{
    "url": "https://defrafarming.blog.gov.uk/2023/03/08/the-science-behind-the-sustainable-farming-incentive/",
    "title": "The science behind the Sustainable Farming Incentive",
    "authors": [
        "Bethan McGregor "
    ],
    "categories": [
        "environmental land management schemes"
    ],
    "pub_date": "2023-03-08T09:14:50+00:00",
    "content": [
        {
            "text": "Through the Sustainable Farming Incentive, we're paying farmers to carry out actions that support both a sustainable farm business and a healthy natural environment. "
        },
        {
            "text": "Food production relies on healthy soils, lots of clean water, beneficial plants and animals, and of course, stable weather. Scientific research and farmers’ experiences shows that nature can do a lot of the heavy lifting when it comes to boosting soil fertility, controlling pests and protecting crops from floods and drought. These are all vital components of both the short and long-term farming system. "
        },
        {
            "text": "In this post, I’ll share a few scientific examples that show how the actions within the SFI can support businesses, bring about positive environmental outcomes whilst maintaining — and in some cases boosting — food production."
        },
        {
            "heading": 2,
            "text": "Reducing the impact of rising costs by improving soil health"
        },
        {
            "text": "Due to global events, farmers have felt the impact of rising input costs. The prices of fertilisers, pesticides, animal feed and machinery have all gone up. "
        },
        {
            "text": "Figures from the Agriculture and Horticulture Development Board (AHDB) show that between May 2021 and May 2022, the price of UK-produced ammonia nitrate fertiliser in the UK had increased by 152%. This reflects an increase from £284 per tonne to £716 per tonne."
        },
        {
            "text": "Although prices have gradually dropped since then, less reliance on these inputs will increase the farming industry’s resilience to future global events. "
        },
        {
            "text": "I’ll first explore the SFI’s arable and horticulture soil standard."
        },
        {
            "text": "Action included in SFI: Add organic matter. For example, through cover crops, legume mixes and incorporation of straw into soil"
        },
        {
            "text": "Effect: Increases nutrient availability, suppresses pests and disease (amongst other benefits)."
        },
        {
            "text": "Explanation: Organic matter offers an alternative source of nutrients to fertilisers. The addition of organic matter either directly or through cover crop increases the amount of nutrients available in the soil. "
        },
        {
            "text": "Additionally, incorporating organic matter into soil supports a diverse community of bacteria and fungi. "
        },
        {
            "text": "This living community breaks down organic matter into absorbable nutrients. It can also reduce pest populations and keep fungal plant pathogens in check. This reduces the need for costly pesticides and anti-fungal treatments."
        },
        {
            "text": "Careful selection of the cover crop can boost yields. For example, using a cover crop mix containing legumes has been shown to boost yield by up to 13%1. This is because legumes absorb nitrogen from the atmosphere and ‘fix’ it in the soil, making it available for uptake by plants. "
        },
        {
            "text": "A study carried out in Poland showed that the use of legumes in rotation decreased the total quantity of nitrogen required to maintain yields2. "
        },
        {
            "text": "A longer-term study combining large quantities of yield data across Europe and Africa showed that increasing crop diversity, adding fertility crops, such as legumes, and direct additions of organic matter could all increase yield. "
        },
        {
            "text": "This study further showed that this effect was largely substitutive for N fertiliser (the practices increased yield when N fertiliser use was low but had minimal or no effect on yield when high levels of fertiliser were being applied)3. "
        },
        {
            "text": "Action included in SFI: Reduce bare ground and tillage. For example, through cover crops and minimum tillage"
        },
        {
            "text": "Effect: Reduces soil loss through erosion and reduces nutrient loss through leaching"
        },
        {
            "text": "Explanation: Soil left uncovered or disturbed by tillage is at risk of being washed away in wet conditions. "
        },
        {
            "text": "Furthermore, nutrients sitting at the soil surface will dissolve more readily into rainwater and be lost to watercourses. This is a particular problem if these nutrients have been added to the soil at a high cost to the farmer. "
        },
        {
            "text": "Covered soil is less at risk of these losses, so ensuring bare ground is kept to a minimum will reduce the wastage of nutrients that would otherwise benefit crop growth."
        },
        {
            "text": "Reducing soil disturbance by limiting tillage will further prevent these losses and improve the chemical, physical and biological properties of soil4,5."
        },
        {
            "text": "A study investigating the effect of differing tillage methods on soil erosion and nutrient loss showed that excessive tillage (multiple ploughing and harrowing cycles) resulted in the highest nutrient losses6."
        },
        {
            "text": "The study also showed that the eroded sediments were often richer in nitrogen, phosphorus, potassium and organic matter than their soil source. This indicates that even for small amounts of soil loss, the loss of nutrients in the eroded sediment could be high and costly. "
        },
        {
            "heading": 2,
            "text": "Mitigating the impact of extreme weather on crops"
        },
        {
            "text": "With England’s climate changing, there is projected to be an increase in extreme weather events such as heatwaves, droughts and flooding7,8,9."
        },
        {
            "text": "This was exemplified by the record-breaking summer we’ve just had. It was one of the driest summers ever and the first time the UK had air temperatures above 40°C10 since records began. "
        },
        {
            "text": "Crop failure is predicted to become a more common occurrence as our climate becomes warmer and drier11."
        },
        {
            "text": "Just as improving soil health reduces the need for nutrient inputs, it also improves the ability of soil to absorb and hold water. This is beneficial in flood and drought events. "
        },
        {
            "text": "Action included in SFI: Adding organic matter and reducing bare ground. For example, through cover crops, tree planting on unproductive land and overwinter stubbles"
        },
        {
            "text": "Effect: Soil structure improves making it better able to hold water (increased water retention) and less at risk of being washed away during floods."
        },
        {
            "text": "Explanation: Well-structured and well-aerated soil, interspersed with decomposing organic matter and living roots acts as a ‘biological sponge’, regulating water flow through the land. "
        },
        {
            "text": "This healthy soil can absorb large quantities of water when needed (during flood events), in the process slowing the flow of water and preventing major damage to crops and infrastructure. "
        },
        {
            "text": "This soil then holds onto this water and dries out more slowly than degraded soil, mitigating the damaging effect of drought on crops and soils12,13."
        },
        {
            "heading": 2,
            "text": "Reducing biodiversity loss to increase yields"
        },
        {
            "text": "Plants and animals are declining globally, with England seeing some of the greatest declines14."
        },
        {
            "text": "For example, one measure of UK farmland birds, an indicator of the state of wildlife generally, has fallen to less than half its 1970 level15. These figures indicate the UK is suffering loss of vital species that play a role in how our environment functions. "
        },
        {
            "text": "Biodiversity plays an important role in maintaining crop yields by providing services such as pollination and pest control. For example, it has been shown that increasing pollinator numbers drives greater yield of oil seed rape16."
        },
        {
            "text": "Meanwhile, for winter wheat, crop pest density and crop damage were found to be significantly lower near biodiversity-supporting wildflower strips with an average 10% crop yield increase for land near the strips17."
        },
        {
            "text": "By making space for wildlife, we can boost the biodiversity we have and our crops can benefit. This is one of the aims of the Sustainable Farming Incentive."
        },
        {
            "text": "Action included in SFI: Incremental hedgerow cutting and planting hedgerow trees, flower habitats and wild bird food"
        },
        {
            "text": "Effect: Increased provision of food and nesting resources available to wildlife. For example, beneficial insects that support farming through pollination and pest control, and birds, which are an indicator of wider environmental quality."
        },
        {
            "text": "Explanation: These actions are just some examples of measures SFI will pay for to boost biodiversity by increasing the foraging and nesting resources available for wildlife18. "
        },
        {
            "text": "Cutting hedgerows less often will increase flowering and fruiting, resulting in more resources for pollinators and other animals including farmland birds19,20."
        },
        {
            "text": "The increased availability of berries will particularly benefit birds going into the autumn and winter months when there is less food available elsewhere21. "
        },
        {
            "text": "Other actions that involve creation of habitat such as introducing flower plots and tree planting will further increase food provisions for these species. "
        },
        {
            "text": "Additionally, these habitats will give wildlife the vital materials and space they need to nest."
        },
        {
            "text": "Supporting pollinator species is important because they are vital for crop pollination and thus yield. Without pollinators, many crops would produce lower quality fruit and/or have significantly lower yields or would not produce fruit at all. "
        },
        {
            "text": "One study showed faba bean yield increased with increasing proportion of semi-natural habitat within 1.5km of the field22 whilst a second study showed that crop yield increased with the number and richness of pollinators visiting flowers23."
        },
        {
            "text": "A long-term study on the Hillesden Estate in Buckinghamshire demonstrated that habitat creation in less productive areas led to increased yield in cropped areas24. This meant that, even accounting for reduction of cropland to allow for wildlife rich habitat creation, yields at the field scale were maintained or, in some cases, increased."
        },
        {
            "text": "In addition to supporting pollinators, creating wildlife rich habitats means boosting the number of natural pest predators in the landscape. By creating the right habitat for animals that prey on common crop pests, pest numbers are reduced, meaning that natural predators can replace some of the work done by expensive pesticide applications25. "
        },
        {
            "text": "For example, a field study in southern England showed that the presence of natural predators successfully suppressed aphid populations26. Further anecdotal evidence from farmers points to a decreased need for pesticides after wildlife rich habitat creation. For example, through hedge planting27."
        },
        {
            "heading": 2,
            "text": "Learn more about our environmental land management schemes"
        },
        {
            "text": "The actions I’ve talked about in this post represent just a small snapshot of what farmers will be paid for within the Sustainable Farming Incentive. "
        },
        {
            "text": "Each action has been carefully chosen to provide environmental benefits such as boosting soil fertility, controlling pests and protecting crops from floods and drought resulting in evidence-based schemes that will protect both our environment and our food-production capabilities. "
        },
        {
            "text": "We recently set out the 6 new SFI standards that will be available in 2023. They are:"
        },
        {
            "text": "In the meantime, take a look at the current SFI offer."
        },
        {
            "text": "You might already be carrying out the actions we’ll pay for."
        },
        {
            "text": "We've improved the scheme standards so they’re clearer. The online application system is faster and easier to use. We're processing applications and issuing payments quickly. You will be able to add more standards as they become available ."
        },
        {
            "text": "You can be in both the SFI and Countryside Stewardship at the same time, but we won’t pay you for the same actions twice and the actions must be compatible.Our recent post on the rollout of our environmental land management schemes summarises the actions, payment rates and when they’ll be available. "
        },
        {
            "text": "And, if you haven’t yet received free business advice, do take a look at our list of independent providers. An adviser can explain the changes to farming in England and can help you plan for the future. "
        },
        {
            "heading": 3,
            "text": "Watch"
        },
        {
            "text": "Video: How the Sustainable Farming Incentive works hand in hand with arable crop production"
        },
        {
            "heading": 3,
            "text": "\nReferences"
        },
        {
            "text": "1 Abdalla, M. et al. (2019). A critical review of the impacts of cover crops on nitrogen leaching, net greenhouse gas balance and crop productivity, Global Change Biology, 25:8, 2530-2543. doi: 10.1111/gcb.14644"
        },
        {
            "text": "2 Grażyna, S. et al. (2020). The long-term effect of legumes as forecrops on the productivity of rotation winter triticale–winter rape with nitrogen fertilisation, Acta Agriculturae Scandinavica, Section B — Soil & Plant Science, 70:2, 128-134. doi:10.1080/09064710.2019.1677766"
        },
        {
            "text": "3 McClaren, C. et al. (2022). Long-term evidence for ecological intensification as a pathway to sustainable agriculture, Nature Sustainability, 5, 770-779. doi:10.1038/s41893-022-00911-x"
        },
        {
            "text": "4 Wilkes, T.I. et al. (2021). Zero tillage systems conserve arbuscular mycorrhizal fungi, enhancing soil glomalin and water stable aggregates with implications for soil stability, Soil Systems, 5:1, 4. doi:10.3390/soilsystems5010004"
        },
        {
            "text": "5 Lal, R.,&  Kimble, J. (1997) Conservation tillage for carbon sequestration, Nutrient Cycling in Agroecosystems 49, 243–253. doi:10.1023/A:1009794514742"
        },
        {
            "text": "6 Quansah, C. et al. (2000). Soil fertility erosion and the associated cost of NPK removed under different soil and residue management in Ghana, Ghana Journal of Agricultural Science, 33:1, 33-42. doi: 10.4314/gjas.v33i1.1882"
        },
        {
            "text": "7 Betts R.A. et al. (2021) Introduction. In: The Third UK Climate Change Risk Assessment Technical Report [Betts, R.A.,Haward, A.B. and Pearson, K.V.(eds.)]. Prepared for the Climate Change Committee, London"
        },
        {
            "text": "8 Christidis, N. et al. (2020). The increasing likelihood of temperatures above 30 to 40°C in the United Kingdom, Nature Communications, 11, 3093. doi: 10.1038/s41467-020-16834-0"
        },
        {
            "text": "9 The Royal Society, 13. How does climate change affect the strength and frequency of floods, droughts, hurricanes, and tornadoes? | Royal Society (accessed 01.2023)"
        },
        {
            "text": "10 MET Office (2022). Available at: Guest post: A Met Office review of the UK’s record-breaking summer in 2022 - Carbon Brief (accessed 12.2022)"
        },
        {
            "text": "11 Caparas M. et. al. (2021). Increasing risks of crop failure and water scarcity in global breadbaskets by 2030, Environmental Research Letters, 16, 104013. doi:10.1088/1748-9326/ac22c1"
        },
        {
            "text": "12 Blanco-Canqui, H. et al. (2015). Cattle manure application reduces soil compactibility and increases water retention after 71 years, Soil & Water Management & Conservation, 79:1, 212-223. doi:10.2136/sssaj2014.06.0252"
        },
        {
            "text": "13 Gabriel, J.L. et al. (2021). Cover crops reduce soil resistance to penetration by preserving soil surface water content, Geoderma, 386, 114911. doi:10.1016/J.GEODERMA.2020.114911"
        },
        {
            "text": "14  Phillips, H. et al. (2021). The Biodiversity Intactness Index - country, region and global-level summaries for the year 1970 to 2050 under various scenarios [Data set], Natural History Museum. doi:10.5519/he1eqmg1"
        },
        {
            "text": "15  DEFRA (2022). Agriculture in the UK Evidence Pack, pp. 43. Available at: PowerPoint Presentation (publishing.service.gov.uk) (accessed 12.2022)"
        },
        {
            "text": "16  Woodcock, B.A. et al. (2019). Meta-analysis reveals that pollinator functional diversity and abundance enhance crop pollination and yield, Nature Communications, 10, 1481. doi:10.1038/s41467-019-09393-6"
        },
        {
            "text": "17  Tschumi, M. et al. (2016). Perennial, species-rich wildflower strips enhance pest control and crop yield, Agriculture, Ecosystems & Environment, 220, 97-103. doi:10.1016/j.agee.2016.01.001"
        },
        {
            "text": "18  Pywell, R.F. et al. (2005). Providing foraging resources for bumblebees in intensively farmed landscapes, Biological Conservation, 121:4, 479-494. doi:10.1016/j.biocon.2004.05.020"
        },
        {
            "text": "19  Byrne, F. et al. (2019) The effect of management practices on bumblebee densities in hedgerow and grassland habitats, Basic and Applied Ecology, 35, 28-33, doi: 10.1016/j.baae.2018.11.004"
        },
        {
            "text": "20  Staley, J.T. et al. (2012). Long-term effects of hedgerow management policies on resource provision for wildlife, Biological Conservation, 145:1, 24-29. doi:10.1016/j.biocon.2011.09.006"
        },
        {
            "text": "21  Hinsley, S.A., & Bellamy, P.E. (1999). The influence of hedge structure, management and landscape context on the value of hedgerows to birds: A review, Journal of Environmental Management, 60:1, 33-49. doi:10.1006/jema.2000.0360"
        },
        {
            "text": "22  Raderschall, C.A. (2021). Landscape crop diversity and semi-natural habitat affect crop pollinators, pollination benefit and yield, Agriculture, Ecosystems & Environment, 306, 107189. doi: 10.1016/j.agee.2020.107189"
        },
        {
            "text": "23  Garibaldi, L.A. et al. (2016). Mutually beneficial pollinator diversity and crop yield outcomes in small and large farms, Science, 351:6271, 388-391. doi: 10.1126/science.aac7287"
        },
        {
            "text": "24  Pywell, R.F. et al. (2015) Wildlife-friendly farming increases crop yield: evidence for ecological intensification, Proceedings of the Royal Society of Biological Sciences. 282:1816, doi: 10.1098/rspb.2015.1740"
        },
        {
            "text": "25 Cardinale, B.J. et al. (2003). Biodiversity and biocontrol: emergent impacts of a multi-enemy assemblage on pest suppression and crop yield in an agroecosystem, Ecology Letters, 6: 857-865. doi: 10.1046/j.1461-0248.2003.00508.x"
        },
        {
            "text": "26  Woodcock, B.A. et al. (2016). Spill-over of pest control and pollination services into arable crops, Agriculture, Ecosystems & Environment, 231, 15-23. doi:10.1016/j.agee.2016.06.023"
        },
        {
            "text": "27  Wolton, R. et al. (2014). Regulatory services delivered by hedges: The evidence base, NE and Defra Report LM0106, 45-47"
        }
    ]
}