{
    "url": "https://homeofficemedia.blog.gov.uk/2023/03/08/windrush-schemes-factsheet-january-2023/",
    "title": "Windrush Schemes Factsheet – January 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-03-08T12:38:41+00:00",
    "content": [
        {
            "text": "We are determined to put right the terrible injustices faced by some people from the Windrush generation and the wider Commonwealth, which happened under successive governments."
        },
        {
            "text": "The Windrush Scheme ensures members of the Windrush generation can get the documentation they need to prove their right to be in the UK, free of charge.  Find out about the Windrush Scheme and how you can apply for a document to prove you can live and work in the UK, here. Once you have received your documentation, you might want to check if you are eligible to apply for compensation."
        },
        {
            "text": "Windrush Compensation Scheme"
        },
        {
            "text": "The Windrush Compensation Scheme was launched on 3 April 2019. You may be able to claim compensation if you suffered losses because you could not show that you had a right to live in the UK."
        },
        {
            "text": "The Windrush Documentation Scheme and the Windrush Compensation Scheme will remain open as long as they are needed, so no one is prevented from making a claim because a deadline has passed."
        },
        {
            "text": "To claim compensation, please check that you are eligible to make a claim. You will be eligible and can make a claim if:"
        },
        {
            "text": "You will also be eligible and can make a claim if you are:"
        },
        {
            "text": "You should complete all sections of the claim form and provide us with as much information as possible about how being unable to show your right to live in the UK affected you. This will ensure we are able to award you the maximum amount of compensation to which you are entitled."
        },
        {
            "text": "We will review Home Office records and will work with other Government Departments and statutory bodies to help gather and check the information you have provided as part of your claim."
        },
        {
            "text": "Further details on how to apply to the Windrush Compensation Scheme can be found at GOV.UK"
        },
        {
            "text": "On 08 March 2023, the Home Office published the latest set of data on the Scheme, which covers the period to the end of January 2023."
        },
        {
            "text": "The total amount paid or offered to claimants through the scheme has increased to over £65.91 million."
        },
        {
            "text": "£55.44 million has been paid across 1,467 claims and a further £10.46 million has been offered, awaiting acceptance, or pending review."
        },
        {
            "text": "The statistics also show that over 59% of claims have had a final decision."
        },
        {
            "text": "During the month of January, the Home Office paid out over £1.4 million in compensation."
        },
        {
            "text": "Compensation payments are made as quickly as possible, but each person’s claim is deeply personal and deserves to be processed with the utmost care and sensitivity so that the maximum payment can be made to them."
        },
        {
            "text": "Individuals must accept their offer of compensation before it can be paid, or, if they are dissatisfied, they can ask for a review. This is first through an independent internal review (Tier 1) and, if someone remains dissatisfied, through an independent review by the independent Adjudicator (Tier 2)."
        },
        {
            "text": "For those who do need support, the Home Office has funded an organisation to provide free, independent claimant assistance to individuals for the duration of the Scheme, We Are Digital."
        },
        {
            "text": "If you need help filling in the application form, the Windrush Help Team can put you in touch with a free independent adviser at We Are Digital or call them directly on 0808 196 8496."
        },
        {
            "text": "You can also call the Windrush Help Team for free."
        },
        {
            "text": "Telephone: 0800 678 1925\nMonday to Friday, 9am to 5pm"
        },
        {
            "text": "Improvements to the Compensation Scheme"
        },
        {
            "text": "The Home Office keeps the Compensation Scheme under constant review, to make sure that everyone receives the compensation they deserve."
        },
        {
            "text": "In December 2020, following feedback from the Windrush Cross Government Working Group, members of the Windrush generation, community leaders and those affected, we overhauled the compensation scheme so people can receive significantly more money, more quickly and this had an immediate beneficial impact."
        },
        {
            "text": "Within six weeks of making the changes, we had offered more than we had in the first 19 months of the scheme."
        },
        {
            "text": "Changes included raising the value of awards for impact on life at every level, so everyone is paid more in this category, with the maximum award increasing from £10,000 to £100,000 (with options for even higher awards in exceptional circumstances)."
        },
        {
            "text": "The most recent changes were made in August 2022 to maximise compensation payments, including changes to homelessness and for close family members. Every close family member who suffered an impact can now receive a minimum of £10,000. They can now also claim compensation for costs incurred whilst supporting someone who lost their employment or benefits because they were unable to prove their immigration status."
        },
        {
            "text": "Changes made to the Homelessness category, include the removal of the cap, and removal of the requirement to demonstrate physical or mental health impacts due to homelessness. These changes ensure people are compensated for the full period they were homeless."
        },
        {
            "text": "Example cases of people who have received compensation:"
        },
        {
            "text": "Windrush Scheme for Documentation"
        },
        {
            "text": "In May 2018 the Windrush Scheme was launched to ensure members of the Windrush generation could get the documentation they need to prove their right to be in the UK, free of charge."
        },
        {
            "text": "Almost 16,000 people have been issued with documentation confirming their status or British citizenship up to Quarter 4, 2022."
        },
        {
            "text": "Individuals from a wide range of nationalities have been granted documentation after applying to the Windrush Scheme from within the UK, including a wide range of Commonwealth countries."
        },
        {
            "text": "Urgent and exceptional cases"
        },
        {
            "text": "In December 2018, the Home Office established an Urgent and Exceptional Payments process. The policy has a very clear purpose to provide support, including financial support, to members of the Windrush cohort who have an urgent and exceptional need, where this cannot wait for the full compensation scheme decision."
        },
        {
            "text": "The process remains open for those who need it. The total value of the payments approved, to the end of January 2023, is £254,435.06."
        },
        {
            "text": "But this is just one way we help those in urgent need. There is also a dedicated Vulnerable Persons Team (VPT) to provide help and advice for more vulnerable people. This service also helps people:"
        },
        {
            "text": "To the end of January 2023, the VPT has provided support to 2,094 individuals."
        },
        {
            "text": "Community Engagement Fund"
        },
        {
            "text": "On 20 September 2022 the Home Office launched a £150,000 Community Engagement Fund. The Community Engagement Fund would provide support to charities, community or grassroots organisations to engage communities and raise awareness of the Windrush Schemes and gain more insights from communities affected by Windrush, particularly around barriers to applying for the Windrush Schemes."
        },
        {
            "text": "Unfortunately, we have experienced delays with our internal assessment of the Community Engagement Fund (CEF) bids leaving successful applicants very little time to spend money before the end of the financial year.  We will relaunch the competition soon."
        },
        {
            "text": "For more information, visit: Community Engagement Fund (Windrush) - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Promotion of the Schemes and supporting communities"
        },
        {
            "text": "The £500,000 Windrush Community Fund (WCF) was launched in December 2020 to support community and grassroots organisations to run outreach and promotional activity to raise awareness of the Windrush Scheme (Documentation) and Windrush Compensation Scheme."
        },
        {
            "text": "Twenty-seven community organisations were awarded monies under the two phases of the WCF. Phase one projects were completed by end of August 2022. Phase 2 projects are due to complete by Summer 2023."
        },
        {
            "text": "Phase one groups have reached over 865,470 individuals through their activities and events and supported over 2,520 individuals in a variety of ways including signposting to additional support, assisting with Windrush Compensation or Documentation Scheme applications, sharing knowledge and addressing misinformation about the Schemes or the role of the Home Office."
        },
        {
            "text": "The Government continues to work closely with stakeholders to ensure anyone who should benefit from the Scheme applies."
        },
        {
            "text": "Amounts offered and paid month by month to Windrush Compensation Scheme claimants up to the end of January 2023"
        },
        {
            "text": "Notes:"
        },
        {
            "text": "Breakdown of full and final offers and payments made to Windrush Compensation Scheme claimants, up to the end of January 2023"
        },
        {
            "text": "Table Special Values: * indicates fewer than 5 customers; and - indicates no offers or payments in the given pay range."
        }
    ]
}