{
    "url": "https://naturalengland.blog.gov.uk/2022/12/05/catchment-sensitive-farming-and-the-river-wye/",
    "title": "Catchment Sensitive Farming and the River Wye",
    "authors": [
        "Natural England",
        "Environment Agency"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2022-12-05T15:44:12+00:00",
    "content": [
        {
            "text": "The River Wye is an iconic river of importance to many people and the local economy. But we know the river’s water quality is being affected by pollution from farming as well as the water industry, home discharges and run-off from roads and urban areas."
        },
        {
            "text": "The complexity of the challenge means solutions will take time and requires long-term partnership planning and action. That’s why the Environment Agency (EA) and Natural England (NE), along with other partners including Natural Resources Wales and local authorities, are working through a Nutrient Management Board, to find and implement the right solutions to tackle phosphate levels in the catchment."
        },
        {
            "text": "Catchment sensitive farming plays a key role in tackling pollution from agriculture. Run by NE in partnership with Defra and EA, the Catchment Sensitive Farming (CSF) programme provides 1-to1 training, advice and grant support to farmers and land managers to reduce water and air pollution from agriculture. In recent years it has reduced the number of serious water pollution incidents in England by almost a fifth."
        },
        {
            "text": "CSF has been active in the Wye catchment since 2006 and has made over 4000 recommendations to about 700 farms. But we know there is more to do. These farms represent less than 20% of the farms in the catchment but 43% of the farmed area within the parts of the Wye catchment in England. To date in 2022, 183 farm holdings in the Wye catchment have contacted the CSF programme. It’s estimated that the implementation of CSF recommendations has reduced agricultural phosphorus annual loads in the Wye catchment by 8.5% and led to an additional 2% reductions via other agri-environment options."
        },
        {
            "text": "NE and EA officers continue to work on the ground in the Wye catchment to build long-term relationships with farmers and the agricultural industry to create a healthy farmed environment and to tackle the issue of phosphate pollution."
        },
        {
            "text": "The work of an Environment Agency Officer"
        },
        {
            "text": "Environment Agency officers also undertake farm inspections to make sure regulations to minimise diffuse pollution from farms are being followed."
        },
        {
            "text": "Soil and nutrients washing off agricultural land is the most common reason for our rivers and streams becoming unhealthy. This is most likely to happen when soil is left bare, with no crops or grass as cover. This situation is exasperated in Herefordshire by the fine sandy and silty soils."
        },
        {
            "text": " "
        },
        {
            "text": "Land at high risk of erosion needs to be identified, but in the Wye catchment there is a lot of land for EA officers to monitor and much of the land does not border a road."
        },
        {
            "text": "To help identify this land, EA officers use satellite technology to find areas of bare ground as well as crop types that have been planted. Computer modelling then combines this with data on the gradient of the land as well as soil type and where rivers, streams and ditches are located, enabling fields most likely to be suffering from soil erosion to be identified."
        },
        {
            "text": "Problem sites in remote locations are much easier to find using this approach. It allows a limited resource to pinpoint visits in an otherwise huge geographical area. EA officers then visit farms identified as having potential run-off problems."
        },
        {
            "text": "EA officers visit farms based on risk such as large livestock numbers or if the farm is in a protected area. They look for evidence of pollution and make a comprehensive assessment of farm infrastructure, management practices and records. Compliance with multiple regulatory regimes is assessed. This includes Farming Rules for Water, which require farmers and land managers to keep soil on the land, match nutrients to crop and soil needs and keep livestock fertilisers and manures out of the water course."
        },
        {
            "text": "If issues are identified, EA officers provide regulatory advice and guidance and where appropriate they can use their regulatory powers to ensure compliance. They will also provide farmers with the contact details of NE CSF Advisers (CSFAs) who can provide specialist advice on the work needed to remedy the problems, as well as providing information on what grants may be available under CSF."
        },
        {
            "text": "A Catchment Sensitive Farming case study"
        },
        {
            "text": "Natural England CSFAs provide independent and trusted advice on available options that deliver on a range of environmental objectives, from water and air quality to natural flood management."
        },
        {
            "text": "Farmers Jo and Brent Thomas from Pencombe in Herefordshire have made substantial changes to their farming practices in response to advice from an NE CSFA to help reduce pollution and flooding in the River Wye catchment. Their farm was primarily arable, and prone to overland flows due to the steepness of the land and run-off from a neighbouring farm, leading to serious soil erosion. The run-off was also contributing to flooding in the local village."
        },
        {
            "text": "Following advice from CSFA James Griffiths, and after receiving a CSF funded Farming and Land Management Advice (FaLMA) Specialist Advice visit, a Water Management Plan was created. Jo and Brent then applied for a Mid-Tier Countryside Stewardship Agreement, which included grant options to revert arable land back to grassland along with a supplement to manage the grassland without inputs of inorganic fertiliser."
        },
        {
            "text": "This allowed them to change the cultivated fields back to grassland, which stabilised their soils and reduced soil erosion from the overland flows. They also carried out capital grant works as part of their Countryside Stewardship agreement as advised in the Water Management Plan. These works included installing dams known as ‘check dams’ to control the water flow rate, as well as sediment ponds to collect run-off and sediment. All of this has contributed to the reduction of nutrient loss (nitrogen and phosphate) from the holding, which will have a directly positive impact on the River Wye along with helping to decrease flooding issues."
        },
        {
            "text": "The work of the CSF team has recently benefitted from increased resource to enable more farmers to access this type of advice and support. In parallel, EA has boosted its water quality monitoring in the catchment and is using this data to make recommendations on where catchment-based solutions can have the most impact. This in turn helps the CSF team prioritise visits to farms at the highest level of diffuse pollution."
        },
        {
            "text": "In June, NE and EA officers worked with Farm Herefordshire to bring together a wide range of local stakeholders, including farmers and citizen scientists, to look at the issues facing the Wye. The event was well attended, and more bespoke events are planned."
        },
        {
            "text": "The joint chair of Farm Herefordshire Martin Williams said:"
        },
        {
            "text": "The latest water quality monitoring report, along with analysis, activities and plans to improve water quality in the Wye and Lugg river catchments can be found on the Environment Agency’s Wye Water Quality Monitoring webpage."
        },
        {
            "text": "If you’re a farmer you can find out more about the support on offer by getting in touch with your local Catchment Sensitive Farming Officer."
        },
        {
            "text": "See our previous blog on how CSF supports farmers across England and NE’s full CSF evaluation report."
        },
        {
            "text": " "
        }
    ]
}