{
    "url": "https://dcmslibraries.blog.gov.uk/2022/12/05/designing-libraries/",
    "title": "Designing Libraries",
    "authors": [
        "Ayub Khan, Service Manager (Universal Services), Warwickshire and Libraries Connected President Elect"
    ],
    "categories": [
        "Library design"
    ],
    "pub_date": "2022-12-05T13:34:12+00:00",
    "content": [
        {
            "text": "Missoula Public Library in the United States was recently announced as the best library in the world at the IFLA conference 2022 in Dublin, and a library building won this year's RIBA Stirling Prize (though not a public library) – The New Library, Magdalene College Cambridge."
        },
        {
            "heading": 3,
            "text": "So what makes a brilliant library?"
        },
        {
            "text": "Partly in response to the question, I recently took over as Director of Designing Libraries with a mission to revitalise, revamp and relaunch the website."
        },
        {
            "text": "Designing Libraries was set up in 2004 as a database of recent public library building projects in the UK. It became a Community Interest Company in 2011, with a brief to provide information to anyone interested in library design and planning."
        },
        {
            "text": "The website is a vital international resource for those involved in the design of new libraries or the remodelling of existing ones, from whatever professional perspective. It is also a shop window for expertise and specialist services. Moreover, the website is an advocacy tool because its case studies show what good design can do."
        },
        {
            "text": "Designing Libraries has outgrown its original structure. We need to make it easier to navigate around more than 1,700 pages of content. These include library case studies, news, a Marketplace of supplies and services, and other useful information. So it’s a great resource - covering not just library design but those all-important fixtures and fittings."
        },
        {
            "text": "Plus priorities have changed since Designing Libraries was set up almost two decades ago. The world is a very different place – currently grappling with war, the impacts of climate change, and a global cost-of-living crisis. The context within which Design Libraries operates is ever-changing. The website needs to reflect the challenges of the time and to predict future trends in library design if it possibly can."
        },
        {
            "heading": 3,
            "text": "Focus and feedback"
        },
        {
            "text": "The current focus is on greener, more energy-efficient, tech-savvy and cheaper-to-run libraries that are more widely accessible. As winter approaches and inflation rises, libraries can expect new visitors, perhaps escaping unheated homes. We will, of course, extend a warm welcome – and hopefully enrich lives in other ways as well."
        },
        {
            "text": "The future is now, in planning terms, and the emphasis is on modernisation. The second round of Arts Council England’s Libraries Improvement Fund focused on enabling library services to “invest in a range of projects to upgrade buildings and technology so they are better placed to respond to the changing ways people are using them”."
        },
        {
            "text": "To my mind, promoting strong, innovative and imaginative library design - and redesign - is key to it all. ACE has provided funding towards the first phase of DL’s redevelopment – a new content management system which will underpin further improvements. I am leading a small team taking the project forward."
        }
    ]
}