{
    "url": "https://homeofficemedia.blog.gov.uk/2022/12/05/factsheet-passport-processing-times-and-unprecedented-levels-of-demand/",
    "title": "Factsheet: Passport processing times and unprecedented levels of demand",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-12-05T10:27:26+00:00",
    "content": [
        {
            "text": "We have seen unprecedented demand, following more than five million people delaying their application for a passport during the pandemic because of restrictions in international travel. His Majesty’s Passport Office (HM Passport Office) is processing more applications than ever before, with an average of almost 700,000 applications processed every month in 2022."
        },
        {
            "text": "Since April 2021, HM Passport Office has been advising people to allow up to ten weeks when applying for their British passport. Between January and October 2022, 95.2% of applications from the UK were completed within 10 weeks."
        },
        {
            "text": "A passport can only be issued once all the checks have been completed satisfactorily and will take longer if applications are submitted with missing or incomplete information."
        },
        {
            "text": "What is HM Passport Office doing to meet this increased demand?"
        },
        {
            "text": "HM Passport Office prepared extensively for the surge in demand and increased capacity – people and systems – across all elements of the production process."
        },
        {
            "text": "To do this:"
        },
        {
            "text": "What can customers do to ensure there are no delays?"
        },
        {
            "text": "We urge people who need a new passport to apply for one as soon as possible to ensure their passport arrives in good time."
        },
        {
            "text": "Customers can help to ensure there are no delays with their application, such as applying online, and submitting a digital photo using a photo code from a shop or booth."
        },
        {
            "text": "And it is important to stress, you should not book travel until you have a passport that meets your travel needs."
        },
        {
            "text": "Where can you go for more help?"
        },
        {
            "text": "*Factsheet updated on 05/12/2022"
        }
    ]
}