{
    "url": "https://ukhsa.blog.gov.uk/2022/12/05/group-a-strep-what-you-need-to-know/",
    "title": "Group A Strep - What you need to know",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-12-05T14:18:20+01:00",
    "content": [
        {
            "text": "Group A streptococcus (GAS) is a common bacteria. Lots of us carry it in our throats and on our skin and it doesn’t always result in illness. However, GAS does cause a number of infections, some mild and some more serious."
        },
        {
            "text": "The most serious infections linked to GAS come from invasive group A strep, known as iGAS."
        },
        {
            "text": "These infections are caused by the bacteria getting into parts of the body where it is not normally found, such as the lungs or bloodstream. In rare cases an iGAS infection can be fatal."
        },
        {
            "text": "Whilst iGAS infections are still uncommon, there has been an increase in cases this year, particularly in children under 10 and sadly, a small number of deaths."
        },
        {
            "text": "This blog explains more about GAS and the infections it can cause, as well as how it is spread and what to look out for when your child is unwell."
        },
        {
            "heading": 2,
            "text": "How is it spread?"
        },
        {
            "text": "GAS is spread by close contact with an infected person and can be passed on through coughs and sneezes or from a wound."
        },
        {
            "text": "Some people can have the bacteria present in their body without feeling unwell or showing any symptoms of infections and while they can pass it on, the risk of spread is much greater when a person is unwell."
        },
        {
            "heading": 2,
            "text": "Which infections does GAS cause?"
        },
        {
            "text": "GAS causes infections in the skin, soft tissue and respiratory tract. It’s responsible for infections such as tonsillitis, pharyngitis, scarlet fever, impetigo and cellulitis among others."
        },
        {
            "text": "While infections like these can be unpleasant, they rarely become serious. When treated with antibiotics, an unwell person with a mild illness like tonsilitis stops being contagious around 24 hours after starting their medication."
        },
        {
            "heading": 2,
            "text": "What is invasive group A strep? "
        },
        {
            "text": "The most serious infections linked to GAS come from invasive group A strep, known as iGAS."
        },
        {
            "text": "This can happen when a person has sores or open wounds that allow the bacteria to get into the tissue, breaches in their respiratory tract after a viral illness, or in a person who has a health condition that decreases their immunity to infection. When the immune system is compromised, a person is more vulnerable to invasive disease."
        },
        {
            "heading": 2,
            "text": "Which infections does invasive group A strep cause?"
        },
        {
            "text": "Necrotising fasciitis, necrotising pneumonia and Streptococcal Toxic Shock Syndrome are some of the most severe but rare forms of invasive group A strep."
        },
        {
            "heading": 2,
            "text": "What is being done to investigate the rise in cases in children?"
        },
        {
            "text": "Investigations are underway following reports of an increase in lower respiratory tract Group A Strep infections in children over the past few weeks, which have caused severe illness."
        },
        {
            "text": "Currently, there is no evidence that a new strain is circulating. The increase is most likely related to high amounts of circulating bacteria."
        },
        {
            "text": "It isn’t possible to say for certain what is causing higher than usual rates of these infections. There is likely a combination of factors, including increased social mixing compared to the previous years as well as increases in other respiratory viruses."
        },
        {
            "heading": 2,
            "text": "What should parents look out for?"
        },
        {
            "text": "It’s always concerning when a child is unwell. GAS infections cause various symptoms such as sore throat, fever, chills and muscle aches."
        },
        {
            "text": "As a parent, if you feel that your child seems seriously unwell, you should trust your own judgement."
        },
        {
            "heading": 4,
            "text": "Contact NHS 111 or your GP if:"
        },
        {
            "heading": 4,
            "text": "Call 999 or go to A&E if:"
        },
        {
            "heading": 2,
            "text": "How can we stop infections from spreading?"
        },
        {
            "text": "Good hand and respiratory hygiene are important for stopping the spread of many bugs. By teaching your child how to wash their hands properly with soap and warm water for 20 seconds, using a tissue to catch coughs and sneezes, and keeping away from others when feeling unwell, they will be able to reduce the risk of picking up, or spreading, infections."
        },
        {
            "text": " "
        }
    ]
}