{
    "url": "https://cddo.blog.gov.uk/2022/12/05/how-do-you-solve-the-software-developer-shortage-across-government-emerging-talent/",
    "title": "How do you solve the Software Developer shortage across Government? Emerging talent!",
    "authors": [
        "Isobel Barrett, DDaT Apprenticeships Strategy Lead, CDDO",
        "Brittany Fearon, New Talent Graduate Lead, CDDO"
    ],
    "categories": [
        "CDDO",
        "DDaT",
        "DDaT community",
        "Digital learning and development",
        "Uncategorized"
    ],
    "pub_date": "2022-12-05T14:15:56+00:00",
    "content": [
        {
            "text": "The digital, data and technology (DDaT) function for government is led by the Central Digital and Data Office (CDDO). Here at CDDO,  the DDaT Profession Talent Team has been developing a variety of talent programmes to support departmental DDaT workforce pipelines across government.  We are thrilled to announce the launch of our new Software Developer Graduate Scheme in October.  "
        },
        {
            "text": "The scheme signals a step change in how we diversify the government's graduate offer and directly addresses the shortfall in software developer talent. Our DDaT Workforce Insights Report published July 2022 reports 3,683 Software Developer vacancies across government. While we are starting small, this is direct progress towards addressing these gaps and improving the diversity of government’s Software Developer community."
        },
        {
            "text": "We were delighted to see the level of high-quality candidates, from a vast range of degree backgrounds. The new cohort will experience a two year curriculum, producing highly competent SEO Software Developers. "
        },
        {
            "text": "The in-person programme launch was held in London in October and saw graduates travelling from far and wide - the furthest from East Kilbride. The day included ice breaker sessions to understand current perceptions of software development in government. "
        },
        {
            "text": "The launch keynote discussion, with Thomas Beautyman, Deputy Director of Government Digital Capability at CDDO, took the group through why the DDaT profession is central to the delivery of excellent government services. "
        },
        {
            "text": "Barry Galvin, Learning Designer and visionary creator of the curriculum launched the official learning journey. He explained the programme will cover topics such as a digital and agile bitesize basics course, software development processes such as scrum and kanban, user-centred design principles, programming, cyber security, prototyping and accessibility."
        },
        {
            "text": "By explaining the learning journey in detail, Barry ensured we addressed a crucial element of adult learning: ensuring that learners know what and how they will learn and why, and how this will benefit them through immediate application to real work scenarios. "
        },
        {
            "text": "Central to the curriculum is a wellbeing thread covering mental health, nutrition, and healthy working practices. This really is a unique and holistic approach to learning; addressing the needs of the whole learner. "
        },
        {
            "text": "Following an intensive morning agenda, we rounded off the day with an afternoon visit to the Churchill War Rooms in Whitehall as a welcome outing, cohort bonding time, and to immerse the graduates in the history of the government they serve. "
        },
        {
            "text": "Spending the day with this inspiring group of future software developers who have chosen to start their tech careers in government was a privilege. It was also a glimpse into how early talent programmes can help fill our crucial skills gaps across government in order for us to deliver truly outstanding digital services to citizens. "
        }
    ]
}