{
    "url": "https://space.blog.gov.uk/2022/12/05/ignite-space-is-coming-to-bristol/",
    "title": "Ignite Space is coming to Bristol",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-12-05T15:31:24+00:00",
    "content": [
        {
            "text": "The UK Space Agency’s Local Growth team is excited to bring Ignite Space to Aerospace Bristol on Tuesday, 7 March 2023, where we will be inviting delegates to network beneath the iconic Concorde Alpha Foxtrot, the last Concorde to be built and the last to fly. "
        },
        {
            "text": "Ignite Space provides an interactive forum to showcase emerging businesses in the UK space sector and highlights the support available. In November 2021, around 280 delegates joined us at the Edinburgh International Conference Centre. "
        },
        {
            "text": "Our main stage sessions looked at the development of the Scottish space sector, connecting the UK space ecosystem, and topics aimed at small and medium-sized enterprises, such as raising investment and accessing supply chains.   "
        },
        {
            "text": "Space entrepreneurs shared their experiences of starting and growing a space business in a Space Soapbox and the event was rounded off by AstroAgency who delivered their SpaceBar Live event. "
        },
        {
            "heading": 2,
            "text": "Who should come to Ignite Space?"
        },
        {
            "text": "All those working in the UK space sector are welcome, and we especially encourage SMEs in the space sector and businesses from sectors with space applicable technologies to come along.  "
        },
        {
            "text": "On the day, ‘zones’ will provide interactive spaces for delegates to get involved in discussions and engage with activities. There will be panel sessions on advancing solutions, and discussions around some of the key challenges facing UK businesses in the sector.   "
        },
        {
            "text": "We are delighted that TV presenter Dallas Campbell will be our Master of Ceremonies for the day, and back by popular demand, AstroAgency will be hosting their SpaceBar Live at an evening networking session.  "
        },
        {
            "text": "Delegate tickets will be free of charge and are due to be released in mid-January 2023. There will also be limited opportunities to exhibit at Ignite Space and we will be issuing an expression of interest in exhibiting shortly.   "
        },
        {
            "text": "We look forward to seeing you at Aerospace Bristol for Ignite Space 2023! "
        }
    ]
}