{
    "url": "https://deframedia.blog.gov.uk/2022/12/05/national-tree-week-in-the-media/",
    "title": "National Tree Week in the media",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-12-05T12:58:09+00:00",
    "content": [
        {
            "text": "There has been widespread media coverage of a range of announcements made as part of National Tree Week, the UK’s largest annual celebration of trees which marks the beginning of the winter tree planting season."
        },
        {
            "text": "Following exclusive coverage in the Daily Express of our £20 million funding for woodlands and the forestry sector, there has been coverage in a range of regional outlets, including the Oxford Mail and Blackpool Gazette, of how the funding will support local authorities to accelerate their tree planting programmes. For example, through the Woodland Creation Accelerator Fund, Oxfordshire County Council will create two new Community Tree and Woodland Planting roles as part of their collaboration with five other local authorities in the region. The two new recruits will work to increase tree cover through training volunteer groups and further engaging the local community in woodland creation activities."
        },
        {
            "text": "In addition, there was widespread coverage across national, regional and trade media outlets of our announcement of a Forest Research-led report revealing the extent of the damage to Great Britain’s woodlands as a result of last year’s winter storms. Almost 12,750 hectares of tree loss was recorded in total, approximately 3,350 of which was found in England. In light of the findings, Sir William Worsley, Chair of the Forestry Commission, has called for landowners and forest managers to consider planting more diverse and resilient tree species, as well foster a greater range of age profiles in their woodlands, in the face of a changing climate. Their long-term prosperity will depend on their resilience to threats caused by climate change, such as stronger gales, drought, emerging pests and diseases, evolving weather patterns and more frequent, severe weather events. The report was covered by Sky News, Telegraph, Daily Mail, Daily Mirror, Daily Star, Yorkshire Post, Forestry Journal and the Press Association. The Forestry Commission Chair was also interviewed by BBC Radio 4’s Farming Today."
        },
        {
            "text": "Moreover, there was coverage in the Daily Express and Daily Mail of our pledge to provide around half a million pounds in funding for projects under the Queen’s Green Canopy, a tree planting initiative in memory of the late Her Majesty Queen Elizabeth. Trees will be planted in communities across England to improve access to nature, create new green spaces and build a lasting legacy for future generations. A comment piece from Forestry Minister Trudy Harrison was featured in the Daily Express, in which she expressed that the “value of trees to people and nature has never been clearer” and called on the public to plant a tree in the memory of Her Majesty. The Minister was also interviewed by Bauer Media for news bulletins on a range of radio outlets, including Absolute Radio, Greatest Hits, Kiss and Magic. This announcement was further supported by Ministers across Government who planted trees in memory of the late Her Majesty Queen Elizabeth, forming part of the Queen’s Green Canopy."
        },
        {
            "text": "Finally, there was exclusive coverage in The Guardian of a landmark report, published by Forest Research and Defra, which revealed the economic value of individual trees planted outside of our forests and woodlands to be up to £3.8 billion per year. The valuation is based on the important role they play in sequestering and storing carbon, regulating temperatures, strengthening flood resilience and reducing noise and air pollution. The report will help to incentivise councils, land managers and local communities to plant more trees outside of woodlands for the varied and numerous benefits they provide. The announcement was subsequently covered in iNews, Garden News and Horticulture Week."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}