{
    "url": "https://aphascience.blog.gov.uk/2022/12/05/rabies-a-personal-perspective/",
    "title": "Rabies in the UK: a personal perspective",
    "authors": [
        "Guanghui Wu"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2022-12-05T09:26:08+00:00",
    "content": [
        {
            "text": "APHA’s Rabies and Viral Zoonoses workgroup undertake work to reduce the risk of rabies and protect animals and humans in the UK and abroad. In this blog, we hear from Dr. Guanghui Wu as she talks about this important area of work and her passion stemming from an early childhood experience."
        },
        {
            "heading": 3,
            "text": "A childhood memory"
        },
        {
            "text": "When I was about 6 years old, I had my first lesson on rabies. I was living in Kunming, a provincial capital city in China. While I was playing with friends in the neighbourhood, a dog charged towards me and bit my right foot. I screamed and alerted my parents! They rushed me to the nearest hospital in town. While putting the yellowish-brown iodine solution on my wound, causing a well-remembered burning sensation, the nurse asked if the dog was a “mad dog”. I was not given any jabs. I still remember the tooth marks on my foot."
        },
        {
            "text": "My mum later told me that rabies was called “Mad Dog Disease” and “Hydrophobia” (fear of water) in China.  According to her knowledge, rabies was diagnosed by offering water to the person who was bitten by a dog and watching their reactions. My six-year-old self was satisfied that I did not catch rabies after I tested myself with a cup of water! Only after I joined the rabies group at APHA, did I realise that the immediate treatment for dog bites should be to wash the wound with soapy water before visiting the hospital."
        },
        {
            "heading": 3,
            "text": "An increased risk of rabies in the UK"
        },
        {
            "heading": 4,
            "text": "Imported pets"
        },
        {
            "text": "The UK is among the few places in the world where classical rabies has been eliminated. However, rabies can still be re-introduced so long as rabies is present in other parts of the world. Many illegally imported dogs are seized at the UK border every year and a mixture of ignorance and putting profit first could bring rabies back to the UK if a rabid (infected with rabies) animal slips through the net."
        },
        {
            "text": "Landmark UK government legislation called “Lucy’s Law”, put in place in April 2020, means that all puppies or kittens bought in the UK must be purchased directly from a licenced breeder. You can find out more on GOV.UK."
        },
        {
            "text": "The disruption caused by the war in Ukraine has increased the risk of rabies being inadvertently introduced to the UK. Before the COVID-19 pandemic in 2018, nearly 2,000 cases of rabies were reported in Ukraine, mainly among wild and domestic animals. This dropped to around 700 in 2021, probably due to a reduction in tests performed due to the pandemic."
        },
        {
            "text": "There are also high numbers of rabies cases in countries surrounding Ukraine and pets may catch rabies when passing through those countries. The UK government and APHA have taken steps to mitigate the risk of rabid animals entering the UK whilst supporting the needs of Ukrainian people and their pets when allowing entry. So far, colleagues in APHA’s Surveillance and Laboratory Services Department have tested over 1,000 Ukrainian pet samples to check if the animals have been vaccinated against rabies in order to protect the UK from introduction of the disease."
        },
        {
            "heading": 4,
            "text": "UK bats"
        },
        {
            "text": "One of the key tasks APHA’s Rabies and Viral Zoonoses workgroup performs each year is testing for two rabies-like viruses that are found in UK bats. These are named European bat lyssavirus type 1 (EBLV-1) and European bat lyssavirus type 2 (EBLV-2)."
        },
        {
            "text": "This year, we have seen an increase in number of bat lyssavirus cases reported through our passive surveillance scheme. We usually detect between two and three positive bats each year. This year to date, nine EBLV-1 and a single bat infected with EBLV-2 have been identified."
        },
        {
            "text": "EBLV-1, the most common lyssavirus in Europe was not found in the UK before 2018. The serotine bats that harbour this virus live close to people, for example in loft spaces. Recently, one positive bat in the UK bit a person (means of virus transmission) before being humanely euthanised on welfare grounds. Thankfully, the person bitten was a bat carer who had been immunised with rabies vaccine."
        },
        {
            "text": "Both bat lyssaviruses have been responsible for human deaths in Europe where prior vaccination or post-exposure treatments were not applied. In 2002 a bat worker from Scotland died following exposure to EBLV-2 and this highlights the vital role APHA plays in helping to mitigate risks of human exposure to a group of lethal viruses."
        },
        {
            "heading": 3,
            "text": "Talking to people about rabies"
        },
        {
            "text": "When I mentioned rabies to some of my friends, I got a blank look. Rabies is such a horrible disease but is being forgotten by many people in the UK. This is not surprising because no classical rabies has been found in the UK for a hundred years apart from occasional importations from abroad that had little impact on the wider society."
        },
        {
            "text": "I still find it surprising to learn that rabies remains present in 150 countries and kills someone every nine minutes, despite death being 100% vaccine preventable. After joining the rabies group, I was amazed to learn that there were two species of viruses (EBLV-1 and EBLV-2) closely related to rabies present in the UK as well!"
        },
        {
            "text": "In conversation with friends, I also asked them whether they knew what the war in Ukraine had to do with rabies? How much the world is spending each year to prevent rabies? What would they do before traveling to a rabies endemic country? What do you do if you’d like to take your pets abroad? What questions do you ask before buying your pets? What about if you are bitten by a bat? Most people do not have answers to many of these questions."
        },
        {
            "text": "We still have much work to do to educate the public. We all need to work together to achieve zero rabies deaths."
        },
        {
            "heading": 3,
            "text": "Additional information"
        },
        {
            "text": "Defra has implemented a series of measures to accommodate the needs of Ukrainian pets and their owners at the same time as protecting the UK’s rabies-free status. To manage the changing situation, Defra has produced a rabies webinar for veterinary professionals to help people to understand the disease."
        },
        {
            "text": "If you have enjoyed reading this blog, you might like to read one of our previous blogs which talks about APHA’s vital international outreach work helping to tackle rabies around the world."
        },
        {
            "text": "Other useful websites:"
        },
        {
            "text": "https://www.gov.uk/guidance/rabies-in-bats"
        },
        {
            "text": "https://rabiesalliance.org/"
        },
        {
            "text": "https://missionrabies.com/"
        },
        {
            "text": "https://www.bats.org.uk/"
        },
        {
            "heading": 4,
            "text": "Finding a bat"
        },
        {
            "text": "It is possible, although very rare, for infected bats to pass rabies to other animals including pets."
        },
        {
            "text": "If your pet catches a bat, keep your pet under observation."
        },
        {
            "text": "If your pet falls sick or starts behaving unusually, you must contact your vet immediately. Your vet will tell APHA if they suspect your pet has rabies."
        }
    ]
}