{
    "url": "https://deframedia.blog.gov.uk/2022/12/05/uk-pushes-for-ambitious-and-effective-global-plastic-treaty-at-first-negotiations-meeting/",
    "title": "UK pushes for ambitious and effective global plastic treaty at first negotiations meeting",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "plastic"
    ],
    "pub_date": "2022-12-05T17:06:16+00:00",
    "content": [
        {
            "text": "Today, the Daily Mail covered the first Intergovernmental Negotiating Committee (INC) meeting to negotiate the new legally binding treaty on plastic pollution that was held in Uruguay last week (28 November – 2 December)."
        },
        {
            "text": "The first INC meeting hosted over 160 countries and highlighted a great willingness to take transformative action to tackle plastic pollution, including in the marine environment."
        },
        {
            "text": "At the INC, the UK continued to push for an ambitious and effective treaty to end plastic pollution, including through the High Ambition Coalition to End Plastic Pollution which now has over 50 members and seeks to:"
        },
        {
            "text": "The UK continues to be at the forefront of tackling global plastic pollution, co-sponsoring the proposal to prepare the new treaty at the UK Environment Assembly in February 2022 and leading on a series of dialogue meetings to help inform the UK’s negotiating position for an impactful treaty."
        },
        {
            "text": "The UK has also taken action at home by banning microbeads in rinse-off personal care products and restricting the supply of plastic straws, plastic drink stirrers and plastic-stemmed cotton buds. Our carrier bag charge has reduced the use of single-use carrier bags in the main supermarkets by over 97%. The introduction of extended producer responsibility for packaging will ensure producers cover the costs of collecting and managing plastic waste, and our plastic packaging tax will incentivise businesses to use recycled plastic in the manufacture of plastic packaging."
        },
        {
            "text": "The piece carried a statement from the Environment Secretary Thérèse Coffey which is pasted in full below."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}