{
    "url": "https://gott.blog.gov.uk/2022/12/05/unlocking-potential-digital-delivery-in-the-nhs/",
    "title": "Unlocking potential: digital delivery in the NHS",
    "authors": [
        "Ben Oakley"
    ],
    "categories": [
        "Knowledge Asset Grant Fund"
    ],
    "pub_date": "2022-12-05T12:48:15+00:00",
    "content": [
        {
            "text": "Innovation as a concept is hard to pin down. Some associate it with ground-breaking inventions. Others think of those small, incremental improvements in how we work day-to-day. Both can give rise to important “knowledge assets”."
        },
        {
            "text": "In my role as a Technology Transfer Strategic Partner in the new Government Office of Technology Transfer (GOTT), I see examples of innovation across the spectrum. It’s my job to support the public sector to make the most of the opportunities presented by the highest potential and most innovative knowledge assets. The benefits can be significant for wider society, the economy and the public sector."
        },
        {
            "text": "It’s all too easy to take for granted the fantastic innovation that takes place in the public sector as sometimes we’re not that good at blowing our own trumpet."
        },
        {
            "heading": 2,
            "text": "Teams coming together"
        },
        {
            "text": "For example, I’ve recently met with teams working on cutting edge technologies in various sectors such as fusion energy at the UK Atomic Energy Authority and high-performance computing at the Hartree Centre (the Science and Technology Facilities Council). I’ve also seen great examples of public sector organisations thinking again about how they use their existing knowledge assets (e.g. information, knowhow and expertise). This is where innovation comes into its own in the public sector - teams coming together to deliver new mechanisms to develop products and services."
        },
        {
            "text": "We’ve seen this at play through projects that we’ve supported through the Knowledge Asset Grant Fund, which is a fund that supports public sector organisations to explore new uses for technology, intellectual property (including datasets), ideas and expertise. It’s now in its second year, and we are starting to see an exciting portfolio of funded projects take shape."
        },
        {
            "heading": 2,
            "text": "Exploiting knowledge assets in the NHS"
        },
        {
            "text": "The Knowledge Asset Grant Fund has supported projects from a range of government departments and arm’s length bodies such as the National Physical Laboratory, the Office of National Statistics and the NHS."
        },
        {
            "text": "I’ve been especially impressed by projects which make use of digital technologies in different forms to unlock the full potential of information, knowhow and expertise."
        },
        {
            "text": "Here are two examples from the NHS:"
        },
        {
            "heading": 3,
            "text": "Mental health simulation training using Virtual Reality"
        },
        {
            "text": "Last year, the fund supported a project run by Maudsley Learning (a unit within South London and Maudsley NHS Foundation Trust). The education provider wanted to harness the power of Virtual Reality (VR) for its well-established mental health simulation training programme."
        },
        {
            "text": "Simulation training uses specialist actors to mimic real-life scenarios so that participants can learn valuable skills and behaviours in a safe and controlled environment. Maudsley Learning specialises in delivering this training to external organisations. One in four people in England will experience a mental health issue each year and there is an ever-increasing need for training on mental health interventions."
        },
        {
            "text": "With funding, the Maudsley Learning team:"
        },
        {
            "heading": 3,
            "text": "An app to help with speech and language therapy"
        },
        {
            "text": "Our fund also supported a project run by the Homerton Healthcare NHS Foundation Trust focused on Speech and Language Therapy (SaLT)."
        },
        {
            "text": "Approximately 1.4 million children and young people have speech, language and communication needs – this has only exacerbated since COVID-19. These difficulties can have severe long-term impacts on:"
        },
        {
            "text": "SaLT provides treatment, support and care for those having difficulties with communication, or with eating, drinking and swallowing. There are approximately 20,000 trained speech and language therapists in the UK. Yet demand for therapy is growing, especially amongst children and young people."
        },
        {
            "text": "The specialist SaLT team at Homerton used the fund for their ‘Get Talking’ project - to develop and scale their virtual services for children and young people."
        },
        {
            "text": "In partnership with a software company, they developed a personalised and interactive platform for children and young people, education staff and families. This has now evolved into Verbo, an app-based toolkit that empowers education staff to support children and young people's communication skills."
        },
        {
            "text": "Through Verbo, the Homerton SaLT team’s knowhow and expertise can reach a much larger pool of people. Verbo is empowering education staff and others to support communication skills alongside trained therapists."
        },
        {
            "heading": 3,
            "text": "Further funding"
        },
        {
            "text": "Both NHS Trusts mentioned above have been successful in securing follow-on grant funding to progress their exciting projects, and we look forward to working with them in the months to come."
        },
        {
            "heading": 2,
            "text": "Get in touch"
        },
        {
            "text": "At GOTT, we want to help our public sector colleagues think creatively about knowledge assets. You may have assets with huge potential to be deployed in new and innovative ways. This is where our grant fund may be able to help. The fund is open to all types of projects - from initial explorations right through to more time- and capital-intensive development work."
        },
        {
            "text": "The deadline for this year’s funding applications is 11.00 on 15 December 2022."
        },
        {
            "text": "We’d be delighted to hear from you!"
        }
    ]
}