{
    "url": "https://food.blog.gov.uk/2025/03/31/a-message-from-fsa-chair-susan-jebb-2/",
    "title": "A message from FSA Chair Susan Jebb",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-03-31T15:26:36+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Our first FSA Board meeting of 2025 in Hull on Wednesday generated some excellent discussion and highlighted the different ways the FSA is working to keep consumers protected."
        },
        {
            "text": "We had an update on the Border Target Operating Model, marking a year since its implementation. It was good to hear that we're carrying out checks and seeking health certification for EU imports for the first time, but the rollout has been slower than we hoped. We still don't have controls at west coast ports, there are issues around access to data, and the legislation needed for some elements of risk management is still not in place. We’re working closely in support of Defra to resolve these issues. That said, we’re in a much better place than a year ago and the situation is continuing to improve."
        },
        {
            "text": "We also discussed cost-recovery for local authorities, which could potentially see them charging food businesses for their regulatory services. Local authorities recover the cost of regulation in many other sectors, for example in licensed premises selling alcohol. They have asked us to consider whether this approach may help to support a more sustainable system of regulation for food."
        },
        {
            "text": "We discussed the principles underpinning this work, including a focus on better outcomes for consumers and support for businesses. The Board asked officials to explore this issue further and to engage with food businesses, government departments, and local authorities, noting that any proposals would also need to be discussed with ministers. The Board were clear that the goal must be to identify a system that delivers the best outcomes for consumers, so their views must be considered too."
        },
        {
            "text": "Finally, we were very pleased to hear about the award of £1.4 million to the FSA to launch a new innovation hub aimed at speeding up risk assessments for new food technologies. Innovative new products, like precision fermented foods and cell cultivated products, build on the UK scientific expertise and have the potential to help us address some of the sustainability and security issues facing the food system."
        },
        {
            "text": "You can see a recording of all of the Board’s discussions at the FSA’s website."
        },
        {
            "heading": 1,
            "text": "Neges gan Susan Jebb, Cadeirydd yr ASB"
        },
        {
            "text": "Cynhaliwyd cyfarfod cyntaf Bwrdd yr ASB ar gyfer 2025 yn Hull ddydd Mercher lle cafwyd rhaid trafodaethau ardderchog a amlygodd y gwahanol ffyrdd y mae’r ASB yn gweithio i ddiogelu defnyddwyr."
        },
        {
            "text": "Cawsom ddiweddariad ar y Model Gweithredu Targed ar gyfer Ffiniau, flwyddyn ers iddo gael ei roi ar waith. Braf oedd clywed ein bod ni’n cynnal gwiriadau ac yn ceisio ardystiadau iechyd ar gyfer mewnforion o’r UE am y tro cyntaf, ond mae’r broses gyflwyno wedi bod yn arafach nag yr oeddem wedi gobeithio. Rydym yn dal i fod heb reolaethau ym mhorthladdoedd arfordir y gorllewin, mae problemau mewn perthynas â mynediad at ddata, ac nid yw’r ddeddfwriaeth sydd ei hangen ar gyfer rhai elfennau o reoli risg ar waith o hyd. Rydym yn gweithio’n agos i gefnogi Defra i ddatrys y problemau hyn. Wedi dweud hynny, rydym mewn lle llawer gwell nag oeddem ni flwyddyn yn ôl, ac mae’r sefyllfa’n parhau i wella."
        },
        {
            "text": "Gwnaethom hefyd drafod trefniadau er mwyn i awdurdodau lleol adennill costau. Gallai hyn olygu y byddai modd i awdurdodau lleol godi tâl ar fusnesau bwyd am eu gwasanaethau rheoleiddio. Mae awdurdodau lleol yn adennill cost rheoleiddio mewn llawer o sectorau eraill, er enghraifft mewn safleoedd trwyddedig sy’n gwerthu alcohol. Maent wedi gofyn i ni ystyried a allai’r dull hwn helpu i gefnogi system reoleiddio fwy cynaliadwy ar gyfer bwyd."
        },
        {
            "text": "Buom yn trafod yr egwyddorion sy’n sail i’r gwaith hwn, gan ganolbwyntio ar ganlyniadau gwell i ddefnyddwyr a chymorth i fusnesau. Gofynnodd y Bwrdd i swyddogion archwilio hyn ymhellach ac ymgysylltu â busnesau bwyd, adrannau o’r llywodraeth, ac awdurdodau lleol, gan nodi y byddai angen trafod unrhyw gynigion hefyd â gweinidogion. Roedd y Bwrdd yn glir o ran y nod, sef bod yn rhaid canfod system sy’n sicrhau’r canlyniadau gorau i ddefnyddwyr, felly rhaid ystyried eu safbwyntiau hefyd."
        },
        {
            "text": "Yn olaf, roeddem yn falch iawn o glywed am y dyfarniad o £1.4 miliwn i’r ASB i lansio hyb arloesi newydd a fydd â’r amcan o gyflymu asesiadau risg ar gyfer technolegau bwyd newydd. Mae cynhyrchion newydd arloesol, fel bwydydd wedi’u heplesu’n fanwl a chynhyrchion a wneir drwy feithrin celloedd, yn adeiladu ar arbenigedd gwyddonol y DU. Yn wir, gallai’r cynhyrchion hyn ein helpu ni i fynd i’r afael â rhai o’r problemau o ran cynaliadwyedd a diogeledd sy’n wynebu’r system fwyd."
        },
        {
            "text": "Gallwch weld recordiad o holl drafodaethau’r Bwrdd ar wefan yr ASB."
        }
    ]
}