{
    "url": "https://defrafarming.blog.gov.uk/2025/03/31/a-standard-to-support-fair-and-transparent-nature-markets/",
    "title": "A standard to support fair and transparent nature markets",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2025-03-31T12:37:48+01:00",
    "content": [
        {
            "text": "Nature markets allow individuals and businesses to pay for the benefits that nature provides, often supporting environmental conservation and restoration efforts. "
        },
        {
            "text": "These benefits, such as clean air and water, carbon storage, biodiversity, and flood protection, can be traded as credits, providing farmers with an additional income stream. "
        },
        {
            "text": "The British Standards Institution (BSI), funded by Defra and the devolved administrations, recently launched a standard designed to bring greater confidence and consistency to nature markets in the UK."
        },
        {
            "text": "It is the first of its kind. "
        },
        {
            "text": "The BSI Overarching Principles Standard, the first in a suite known as the Nature Investment Standards, sets out clear guidelines on transparency, measurement, governance and environmental benefits in nature markets. "
        },
        {
            "text": "The standard is voluntary. It is intended to support everyone involved in the market: farmers, landowners, investors and buyers. It can also be applied to relevant codes and schemes. "
        },
        {
            "text": "This has the potential to change how farmers earn income from sustainable land management. By improving the quality and integrity of the credits being traded, the standard helps address the current lack of regulation in the market and reduces risks including greenwashing. "
        },
        {
            "text": "The suite of Nature Investment Standards will create a framework with clear roles and responsibilities. This could enable farmers to earn income from: "
        },
        {
            "text": "BSI has a free navigation tool to help farmers and other suppliers understand which aspects of the standard might apply to nature restoration on their land.  "
        },
        {
            "heading": 2,
            "text": "The Knepp Estate: a case study"
        },
        {
            "text": "Defra’s Minister for Nature, Mary Creagh, who is responsible for green finance, visited the Knepp Estate in West Sussex. The estate served as a test case for how this standard could support innovative farm-based projects. "
        },
        {
            "text": "Once an intensively farmed, nature-depleted landscape, Knepp has been transformed through rewilding into a mosaic of diverse habitats, including grasslands, scrub, and woodlands. "
        },
        {
            "text": "What makes Knepp particularly relevant to farmers is how it has pioneered ways to: "
        },
        {
            "heading": 2,
            "text": "The creation of the Hedgerow Carbon Code: a case study"
        },
        {
            "text": "This video explores the creation of the Hedgerow Carbon Code, a framework designed to measure and reward the carbon storage potential of hedgerows."
        },
        {
            "text": " Funded by the Natural Environment Investment Readiness Fund, the project aims to unlock private investment in nature-based solutions by providing a clear, science-backed method for assessing hedgerow carbon benefits. "
        },
        {
            "text": "Watch the video below to learn how the code was developed and what it could mean for sustainable land management."
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "More market-specific standards for biodiversity, carbon, nutrients, and community engagement are under development. The nature-based carbon standard has recently been released for public consultation. The consultation closes on 25 April, so there is still time to share your views. "
        },
        {
            "text": "These standards will form an interconnected framework of clear requirements setting out what ‘good’ looks like. They could also create diverse new revenue streams for farms transitioning to more sustainable practices. "
        },
        {
            "text": "Visit the BSI website for more details on the Nature Investment Standards programme. "
        },
        {
            "text": "We’ll blog again with updates."
        },
        {
            "text": "Subscribe to the Farming blog to receive an email notification whenever we publish a new post.  "
        }
    ]
}