{
    "url": "https://naturalengland.blog.gov.uk/2025/03/31/growing-the-evidence-base-to-recover-englands-treasured-peatland-landscapes/",
    "title": "Growing the evidence base to recover England’s treasured peatland landscapes",
    "authors": [
        "Pete Brotherton"
    ],
    "categories": [
        "Evidence",
        "Peat"
    ],
    "pub_date": "2025-03-31T08:30:00+01:00",
    "content": [
        {
            "text": "England’s peatland landscapes are places of inspiration, adventure and beauty. From the sweeping moors of the Pennines to the ancient heaths and mires of the New Forest, these treasured landscapes are more than just amazing wild spaces to visit. They support farming and other rural communities, and are home to rare and special habitats and species, including habitats that are our most important terrestrial carbon store. About 70% of the UK’s drinking water comes from upland catchments1, where healthy bogs help to store and purify the water supply of surrounding urban populations. "
        },
        {
            "text": "Today, Natural England is publishing three new evidence reports to inform action to support the recovery of these special areas. We are publishing an update to our evidence review on, 'The effects of managed burning on peatland biodiversity, carbon and water'. In addition, we are publishing Favourable Conservation Status (FCS) definitions for Blanket Bog and Heathland, which seek to answer the question of ‘what does good look like?’ for these important habitats.  "
        },
        {
            "text": "Natural England’s Updated Evidence Review on managed burning in the uplands (NEER155)  "
        },
        {
            "text": "Our Evidence Review on ‘The effects of managed burning on upland peatland biodiversity, carbon and water’ updates our 2013 review. This latest review benefitted from the input and guidance of an independent expert panel. It considers a further 102 recent studies, and its findings include:  "
        },
        {
            "text": "New definitions of Favourable Conservation Status for Blanket Bog and Heathland "
        },
        {
            "text": "New FCS definitions for blanket bog and heathland are two in a series that sets out ‘what good looks like’ for a suite of habitats and species in England.  The FCS definition series collectively describes a coherent vision for long-term, healthy and functioning ecosystems across England. Each definition identifies the three FCS parameters: "
        },
        {
            "text": "Blanket Bog FCS definition  "
        },
        {
            "text": "Healthy, functioning blanket bogs support precious biodiversity, such as golden plovers, dunlin and a range of rare invertebrates and plants. Britain and Ireland are home to about 13% of the global blanket bog resource (see UK Peatland Strategy 2018-2040). Like other peatlands, blanket bogs form when sphagnum mosses and other plant material dies and accumulates in waterlogged conditions. In good condition, blanket bogs continue to accumulate carbon indefinitely and they retain large volumes of water (providing natural flood prevention). Their wet state also makes them more resilient to wildfires.  "
        },
        {
            "text": "Unfortunately, many of England’s blanket bogs are modified or degraded.  This can lead to many changes: they are less resilient, including to erosion and wildfire (see IUCN Wildfire Resilience Briefing); their ability to store water is reduced and degraded blanket bogs often shift from capturing carbon to becoming net emitters of carbon. "
        },
        {
            "text": "In our highly modified landscapes, it can be difficult to picture what a natural ecosystem should look like, and which habitats should be where, but we can use the presence of peat, and its depth, as a guide. Our FCS definition follows international standards by considering peat of 30cm or deeper in upland landscapes as blanket bog, or as restorable to that habitat, regardless of current vegetation cover.   "
        },
        {
            "text": "Restoration of blanket bog depends upon re-instating the hydrological conditions that sustain the natural functioning of the system, while stopping doing those things that prevent or slow down recovery.  This includes stopping managed burning, which risks a departure from natural function in the long-term (NEER155, 2025).   "
        },
        {
            "text": "Heathland FCS definition "
        },
        {
            "text": "In our heathland FCS definition, we describe how heathland is found across a gradient of wetness, from very dry conditions on mineral soils through to wet, peat-forming conditions. The characteristics of heathland today have been strongly influenced by past and present land uses, and these have generally led to the loss of naturally wet conditions.   "
        },
        {
            "text": "Wet heath (as opposed to dry heath) should typically be present (or where possible restored) where peat soils are of 10-30cm in depth, or where soils with peaty pockets are present. Management practices should help restore natural hydrology to benefit the characteristic species found and boost the resilience of the habitat to the impacts of climate change.   "
        },
        {
            "text": "Working together to recover nature "
        },
        {
            "text": "We hope that the evidence in these reports will help guide action to recover these amazing habitats, contributing to the Government’s Environmental Improvement Plan (EIP) targets. At the heart of the approach is reinstating natural processes to secure resilient ecosystems so that these precious peatland landscapes can continue to provide so many benefits to nature and people.  "
        },
        {
            "text": "We know that this will be a long journey. We will work together with land managers and partners to ensure that measures to restore habitats are appropriate to local conditions and site characteristics. Because every site is different, we will provide tailored advice to collectively achieve the objective of healthy, functioning blanket bog, heathland and peatland habitats.  "
        },
        {
            "text": "Our new evidence supports Defra’s consultation on Heather and Grass Burning in England, which also launched today, 31 March 2025. "
        }
    ]
}