{
    "url": "https://defraenvironment.blog.gov.uk/2025/03/31/have-your-say-on-a-new-nature-based-carbon-standard-consultation/",
    "title": "Have your say on a new nature-based carbon standard consultation",
    "authors": [
        "Harley Stoddart"
    ],
    "categories": [
        "Green finance",
        "Land use",
        "Nature"
    ],
    "pub_date": "2025-03-31T12:22:13+01:00",
    "content": [
        {
            "text": "I'm Harley Stoddart, Head of Climate Mitigation Science at Defra, and I'm excited to share details about an important consultation on a standard for nature-based carbon markets in the UK. "
        },
        {
            "text": "Today, I’m inviting you to have your say on a new standard from the British Standards Institution (BSI) for UK nature-based carbon projects. The deadline for comments is 25 April."
        },
        {
            "text": "The new standard will drive high-integrity projects and scheme design for delivering greenhouse gas removals. "
        },
        {
            "text": "It aims to boost investment into nature and support economic growth, as well as helping to reduce the risk of “greenwashing”.  "
        },
        {
            "text": "Why we need this new standard"
        },
        {
            "text": "The UK's land, coasts, and seas play a crucial role in achieving our net-zero emissions targets. While our land use sector as a whole currently acts as a carbon sink, emissions from agriculture still account for about 11% of UK greenhouse gas emissions. "
        },
        {
            "text": "The Climate Change Committee has made it clear - we won't meet our net-zero target without changing how we use our land."
        },
        {
            "text": "Nature-based carbon markets can help drive this change. Through high-integrity carbon credits, we can direct more funding towards restoring nature while helping to meet our climate goals."
        },
        {
            "text": "However, there are legitimate concerns about carbon markets. Without proper safeguards, projects might claim benefits that aren’t properly verified, would occur regardless, are double-counted, lack permanence, and prioritise carbon reduction over broader environmental benefits."
        },
        {
            "text": "One scheme in the market that's getting ready for assurance is the Wilder Carbon code. It is funded by the Natural Environment Investment Readiness Fund, and is working towards implementing the BSI Carbon Flex. Watch the video below to find out more."
        },
        {
            "text": "Building trust through standards"
        },
        {
            "text": "The new standard for high integrity natural carbon projects addresses these challenges head-on. The standard provides requirements for UK projects delivering nature-based carbon removals and greenhouse gas reductions. It will help:"
        },
        {
            "text": "If you're interested in learning more about similar standards, watch our video below on the development of the Hedgerow Carbon Code."
        },
        {
            "text": "Key features of the new standard"
        },
        {
            "text": "The delivery of the nature-based carbon benefits standard includes robust requirements for:"
        },
        {
            "text": "The standard also provides some guidance on insetting (where companies pay for emission reductions or removals within their own supply chains, in alignment with international best practices and emerging frameworks).  "
        },
        {
            "text": "We would like views on whether this content should be included or whether another approach should be taken to provide clarity on high-integrity insetting approaches."
        },
        {
            "text": "Share your views on the consultation"
        },
        {
            "text": "To ensure this standard works for everyone involved in nature-based carbon markets - we want to hear from all interested parties, including:"
        },
        {
            "text": "Your views will help ensure this standard maintains high levels of integrity while being practical and effective for the whole sector."
        },
        {
            "text": "To have your say, share your feedback by 25 April, when the consultation closes."
        },
        {
            "text": "Your feedback will help shape the future of UK nature-based carbon markets and ensure they deliver real benefits for both climate and nature."
        },
        {
            "text": "In future, the government intends to develop an assurance framework for the BSI nature investment standards, which will apply to nature markets across all four nations."
        },
        {
            "text": "If you would like to find out more information on the Nature Investment Standards programme, visit the BSI website."
        }
    ]
}