{
    "url": "https://hmlandregistry.blog.gov.uk/2025/03/31/local-land-charges-the-journey-so-far/",
    "title": "Local Land Charges – the journey so far",
    "authors": [
        "Rhonda Griffiths, Head of Programme Management and Policy"
    ],
    "categories": [
        "Local Land Charges"
    ],
    "pub_date": "2025-03-31T13:56:34+01:00",
    "content": [
        {
            "text": "The desire for quicker, simpler and cheaper conveyancing is driving a host of new services and infrastructure innovations. Our digital, geospatial Local Land Charges (LLC) Register and the Search for local land charges service are part of this revolution. We recognise the need to use our data more effectively to support the priorities set out by Matthew Pennycook MP, Minister of State for Housing and Planning, and we’re committed to delivering a land registry and property market that works for everyone. "
        },
        {
            "text": "Here's how the LLC Programme is already advancing this aim, as we continue to deliver the most ambitious geospatial data transformation ever attempted by a UK government. "
        },
        {
            "heading": 2,
            "text": "The progress so far"
        },
        {
            "text": "As a programme, we are building on our expertise. Today, a third of local authorities have migrated, a third are in active delivery, and a third are signed-up and starting work on pre-migration action plans. By 2028, all 300+ local authorities across England and Wales will have transitioned to the national LLC Register. At that time more than 26 million LLC records will be accessible online, instantly in a consistent format.  "
        },
        {
            "text": "The pace of LLC transformation is increasing. From January to March this year, we migrated 19 local authorities across England and Wales, making it our most successful quarter to date. We now have migrated 110 local authority datasets, bringing with it 6.5 million instantly available records."
        },
        {
            "heading": 2,
            "text": "What does this mean for our customers?"
        },
        {
            "text": "Feedback from local authorities who have migrated to the national digital register shows that our service is providing immediate and lasting benefits to local government, the property industry and beyond.  "
        },
        {
            "text": "With the transformation of 110 local authority LLC datasets completed so far, the length of time to receive results in these areas has reduced from days or weeks to being instantly available online in a standardised, easy-to-read format. Customers can also be availed of either a free search or an official search result for a fixed fee of £15, saving an average of £10.55 per search.  "
        },
        {
            "text": "Through earlier access to vital information about restrictions on property, we are reducing the number of property-buying transaction failures, saving buyers between £700 and £2,700 each time.   "
        },
        {
            "text": "Richer textual, geospatial records also benefit local authority departments who can self-serve, when the information is added to internal systems.    "
        },
        {
            "text": "Migrating the data to the national register is only the start of a local authority’s journey. With the support of our Service Performance and Integration (SPI) team, we are improving data quality standards and charge registration timeliness. This best practice work enables customers to get the high-quality service they deserve, allows innovators to harness the data’s full potential and stimulates local authority efficiencies.   "
        },
        {
            "text": "Our next step is to build on our success by creating more opportunities for the digitised LLC dataset to be reused, encouraging economic growth. This work supports wider Government digital obligations and ambitions and will help drive innovation within the property market.  "
        },
        {
            "heading": 2,
            "text": "Unlocking our data's full potential"
        },
        {
            "text": "The progress we’ve made so far has proven the LLC Programme’s capability and expertise across government. As a result, we will be working with our sponsor department, the Ministry of Housing, Communities and Local Government (MHCLG), to build on our existing work in digitising property information.  "
        },
        {
            "text": "We will be working with a number of local authorities to identify the best approach to open up more data and make it digital. In particular, building control and highways information which are predominantly paper-based and are known pain points in the transaction process. More details on this activity will be coming soon. "
        },
        {
            "heading": 2,
            "text": "Achieving our goals"
        },
        {
            "text": "As you can tell, it’s a very busy time within the LLC Programme, and it is essential we continue to complete the work at pace without compromising data quality, or the integrity of the register. To meet our goal of completion by 2028, our team will continue to work with customers, partners and stakeholders to achieve the market transformation that will benefit us all."
        }
    ]
}