{
    "url": "https://insidehmcts.blog.gov.uk/2025/03/31/modernising-crime-services-reflecting-on-reforms-impact/",
    "title": "Modernising Crime Services: Reflecting on Reform's Impact",
    "authors": [
        "Tim Britten, Crime Programme Director"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services",
        "User experience and research"
    ],
    "pub_date": "2025-03-31T09:31:11+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Our criminal courts deal with some of the most complex and serious cases in the justice system. Behind each case is a defendant, victim, witness or family member whose lives can be shaped by the proceedings and the case outcome. In the most serious cases a person’s liberty can be at stake."
        },
        {
            "text": "As we conclude our Reform Programme, I want to reflect on our journey in modernising how staff, judiciary and legal professionals use our systems and how the public access our services and information in our criminal courts, the lessons learnt and what we've achieved together."
        },
        {
            "text": "When we began this transformation in 2016, we set out with a clear vision: to create a justice system that is built around people's needs and expectations. Working alongside our criminal justice partners, we’ve made significant progress towards this vision. Whether that be Judges, legal professionals, the police, the Crown Prosecution Service, journalists, colleagues in prison, probation and legal aid – each has played a vital role in achieving the progress we’ve made so far."
        },
        {
            "text": "But it’s not been without difficulties. Some of the most challenging times of my career have been whilst progressing reform of these systems and services, and I know this is true for many colleagues working both in HMCTS, as well as those in the wider justice system. And yet changes we’ve made have been vital to modernising the criminal court system – improving it for those who need it while allowing busy criminal court staff and professionals to use their time more effectively.  I'm incredibly proud of how far we've come, while being mindful of the hurdles we've faced along the way."
        },
        {
            "heading": 2,
            "text": "A digital revolution in criminal justice"
        },
        {
            "text": "Our most significant achievement in the criminal jurisdiction has been introducing Common Platform – a new digital case management system – into all magistrates and the Crown Court. It is now in use across all criminal courts in England and Wales and has currently managed over 2.3 million cases."
        },
        {
            "text": "From the point at which the police make an arrest, to a defendant arriving in court, a criminal case file passes through many different stages. Each stage is handled by a different agency in the criminal justice system: from the police, to prosecution and defence, Legal Aid Agency, magistrates’ court, Crown court, prison and then probation service. Before Common Platform, these agencies were all using different systems to process information about the same criminal case whereas now everyone uses the same Unique Reference Number (URN)."
        },
        {
            "text": "Before Common Platform, progression of cases were reliant on documents being printed out or waiting for information to be emailed between agencies, significantly slowing the process and causing unnecessary duplication and delays. The new system has brought all the information about a criminal case into one central place, meaning all parties in a case can ‘self-serve’ case material flexibly and access the most up-to-date case information whenever they need it and wherever they are working from."
        },
        {
            "text": "For both victims and defendants this means a smoother process and reassurance that all the facts of the case are available for the people involved – allowing their representatives to give accurate and timely advice. It also speeds up any enquiries relating to specific cases as they can be quickly identified by all stakeholders under the same system. The introduction of five modern, industry standard Service Centres have a crucial role to play in this – here colleagues have access rights to appropriate levels of information on Common Platform, so can support people, answering over 2.3 million calls alongside national business centres between April and December 2024."
        },
        {
            "text": "Common Platform is the first step towards a truly collaborative, joined up system – and one that will be digital end-to-end. This isn't just about new technology – it's about real improvements in how justice is delivered to our users."
        },
        {
            "text": "We’re also using Common Platform to digitally handle Single Justice Procedure (SJP) cases (lesser offences such as speeding or fare evasion). This allows a single magistrate, aided by a legal adviser, to hear low-level cases where the defendant pleads guilty or has not responded to a charge. All pleas, electronic or written, and any mitigation, is saved in our systems and is viewed by magistrates before a decision is made in the case. The role of the prosecutor in SJP hearings is also the same as it would be if the same cases were held in open court. But the ability to digitally handle SJP cases means the administration of them is quicker, more straightforward, less costly and more efficient for the whole justice system, while still being fair, transparent and rigorous. "
        },
        {
            "text": "All police forces and a growing range of non-police prosecutors are benefitting from being able to process cases digitally, accessing information in real time to deliver smoother justice and without transporting reams of paper from site to site and without having to manually input data into multiple systems. Between April 2019 and March 2023, the volume of SJP cases entering the system has more than doubled and between April 2017 and January 2025 we received over 267,000 online pleas."
        },
        {
            "text": "Common Platform is improving how we gather and share accurate and comprehensive criminal court data between justice partners.  We’re using it to better understand the needs of court users and continually improving our services, identifying and acting on any hidden barriers for those using them."
        },
        {
            "text": "We couldn’t do this before Reform and better data enables us to directly inform further improvements to the system. Gathering data digitally provides the opportunity for significant scrutiny of prosecutions, cases and decisions, upholding the key principle of open justice even when hearings are not in public."
        },
        {
            "heading": 2,
            "text": "Listening and adapting"
        },
        {
            "text": "One of the most valuable lessons we've learned is the importance of listening to our users and your feedback has been crucial in shaping our direction. A perfect example of this is the decision to retain the Digital Case System (DCS) in the Crown Court – you told us it works well, and we listened. "
        },
        {
            "text": "At times during the rollout to courts across the country, we were too focused on addressing technological solutions, and didn’t keep pace with the feedback coming from users. The pandemic and rising demand for services also caused major disruption, and due to this the programme has faced delays and reductions in scope. But we have used this experience to ensure we’re better at building feedback into our learning processes. "
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "I am the first to recognise that Common Platform is not yet perfect, and that there is much more work to do to improve user experience, fix technical issues and boost the platform's overall performance and stability. But we are prepared and resourced to do that work, not just for next year, but for many years to come. We will continue making incremental improvements to what’s already there and prioritising the most valuable changes."
        },
        {
            "text": "As we move forward, our focus in the criminal courts is clear – embedding and enhancing the business process and technical changes we’ve already made, committing to engage and improve as a service led organisation and taking on board feedback to continuously improve how justice is delivered."
        },
        {
            "text": "The challenges we've faced have taught us valuable lessons about balancing ambition with practicality. This is not the end, but a continued commitment to refine, improve and stabilise."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Moderneiddio Gwasanaethau Llys Troseddol: Myfyrio ar Effaith y Rhaglen Ddiwygio"
        },
        {
            "text": "Mae ein llysoedd troseddol yn delio â rhai o'r achosion mwyaf cymhleth a difrifol yn y system gyfiawnder. Y tu ôl i bob achos mae diffynnydd, dioddefwr, tyst neu aelod o'r teulu y gall eu bywydau gael eu newid gan yr achos a chanlyniad yr achos. Yn yr achosion mwyaf difrifol gall rhyddid rhywun fod yn y fantol."
        },
        {
            "text": "Wrth i ni ddod â'n Rhaglen Ddiwygio i ben, rwyf eisiau myfyrio ar ein taith i foderneiddio sut mae staff, aelodau’r farnwriaeth a gweithwyr proffesiynol cyfreithiol yn defnyddio ein systemau a sut mae'r cyhoedd yn cael mynediad at ein gwasanaethau a'n gwybodaeth yn ein llysoedd troseddol, y gwersi a ddysgwyd a'r hyn yr ydym wedi'i gyflawni gyda'n gilydd."
        },
        {
            "text": "Pan ddechreuon ni'r trawsnewidiad hwn yn 2016, fe wnaethom ddechrau gyda gweledigaeth glir: creu system gyfiawnder o amgylch anghenion a disgwyliadau pobl. Gan weithio ochr yn ochr â'n partneriaid cyfiawnder troseddol, rydym wedi gwneud cynnydd sylweddol tuag at y weledigaeth hon. Boed hynny'n Farnwyr, gweithwyr proffesiynol cyfreithiol, yr heddlu, Gwasanaeth Erlyn y Goron, newyddiadurwyr, cydweithwyr yn y gwasanaeth carchardai, y gwasanaeth prawf a’r asiantaeth cymorth cyfreithiol - mae pob un wedi chwarae rhan hanfodol wrth gyflawni'r cynnydd rydyn ni wedi'i wneud hyd yn hyn."
        },
        {
            "text": "Ond nid yw wedi bod heb anawsterau. Mae rhai o'r cyfnodau mwyaf heriol yn fy ngyrfa wedi bod wrth geisio diwygio'r systemau a'r gwasanaethau hyn, ac rwy'n gwybod bod hyn yn wir am lawer o gydweithwyr sy'n gweithio yn GLlTEF, yn ogystal â'r rhai yn y system gyfiawnder ehangach. Ac eto mae newidiadau rydyn ni wedi'u gwneud wedi bod yn hanfodol i foderneiddio'r system llysoedd troseddol – ei gwella i'r rhai sydd ei angen tra'n caniatáu i staff a gweithwyr proffesiynol llysoedd troseddol prysur ddefnyddio eu hamser yn fwy effeithiol.  Rwy'n hynod falch o ba mor bell rydyn ni wedi dod, tra'n ymwybodol o'r rhwystrau rydyn ni wedi'u hwynebu ar hyd y ffordd."
        },
        {
            "heading": 2,
            "text": "Chwyldro digidol ym maes cyfiawnder troseddol"
        },
        {
            "text": "Ein cyflawniad mwyaf arwyddocaol yn yr awdurdodaeth droseddol yw cyflwyno’r Platfform Cyffredin – system rheoli achosion digidol newydd – ym mhob llys ynadon a Llys y Goron. Mae bellach yn cael ei ddefnyddio ar draws pob llys troseddol yng Nghymru a Lloegr ac ar hyn o bryd mae wedi rheoli dros 2.3 miliwn o achosion."
        },
        {
            "text": "O'r pwynt lle mae'r heddlu yn arestio, i ddiffynnydd yn cyrraedd y llys, mae ffeil achos troseddol yn mynd trwy lawer o wahanol gamau. Mae pob cam yn cael ei drin gan asiantaeth wahanol yn y system gyfiawnder troseddol: o'r heddlu, i’r erlyniad a’r amddiffyniad, asiantaeth cymorth cyfreithiol, llys ynadon, llys y goron, y gwasanaeth carchardai ac yna’r gwasanaeth prawf. Cyn y Platfform Cyffredin, roedd yr asiantaethau hyn i gyd yn defnyddio systemau gwahanol i brosesu gwybodaeth am yr un achos troseddol tra bod pawb bellach yn defnyddio'r un Cyfeirnod Unigryw (URN)."
        },
        {
            "text": "Cyn y Platfform Cyffredin, roedd y gallu i symud achosion yn eu blaenau yn dibynnu ar ddogfennau yn cael eu hargraffu neu aros i wybodaeth gael ei e-bostio rhwng asiantaethau, gan arafu'r broses yn sylweddol ac achosi dyblygu ac oedi diangen. Mae'r system newydd wedi dod â'r holl wybodaeth am achos troseddol ynghyd i un lle canolog, sy'n golygu y gall pob parti mewn achos 'hunan-gyflwyno’ deunyddiau achos yn hyblyg a chael mynediad at yr wybodaeth fwyaf diweddar am achosion pryd bynnag y mae ei angen arnynt ac ym mhle bynnag y maent yn gweithio."
        },
        {
            "text": "I ddioddefwyr a diffynyddion mae hyn yn golygu proses llyfnach a sicrwydd bod holl ffeithiau'r achos ar gael i'r bobl dan sylw – gan ganiatáu i'w cynrychiolwyr roi cyngor cywir ac mewn modd amserol. Mae hefyd yn cyflymu unrhyw ymholiadau sy'n ymwneud ag achosion penodol gan y gall pob rhanddeiliad eu hadnabod yn gyflym o dan yr un system. Mae’r broses o gyflwyno pum Canolfan Wasanaeth fodern, o safon, yn chwarae rôl hanfodol yn hyn – yma mae gan gydweithwyr hawliau mynediad at lefelau priodol o wybodaeth ar y Platfform Cyffredin, felly gallant gefnogi pobl, gan ateb dros 2.3 miliwn o alwadau ochr yn ochr â chanolfannau busnes cenedlaethol rhwng Ebrill a Rhagfyr 2024."
        },
        {
            "text": "Y Platfform Cyffredin yw'r cam cyntaf tuag at system wirioneddol gydweithredol, gyfunol - ac un a fydd yn ddigidol o'r dechrau i'r diwedd. Nid yw hyn yn ymwneud â thechnoleg newydd yn unig - mae'n ymwneud â gwelliannau gwirioneddol yn y ffordd y cyflawnir cyfiawnder i'n defnyddwyr."
        },
        {
            "text": "Rydym hefyd yn defnyddio’r Platfform Cyffredin i drin achosion Gweithdrefn Un Ynad (SJP) (troseddau llai fel goryrru neu osgoi talu) yn ddigidol. Mae hyn yn caniatáu i un ynad, gyda chymorth cynghorydd cyfreithiol, wrando ar achosion lefel is lle mae'r diffynnydd yn pledio'n euog neu heb ymateb i gyhuddiad. Mae pob ple, electronig neu ysgrifenedig, ac unrhyw fesurau lliniaru, yn cael eu cadw ar ein systemau ac yn cael ei weld gan ynadon cyn i benderfyniad gael ei wneud yn yr achos. Mae rôl yr erlynydd mewn gwrandawiadau SJP hefyd yr un fath ag y byddai pe bai'r un achosion yn cael eu cynnal mewn llys agored. Ond mae'r gallu i drin achosion SJP yn ddigidol yn golygu bod y broses o’u gweinyddu yn gyflymach, yn fwy syml, yn llai costus ac yn fwy effeithlon i'r system gyfiawnder gyfan, tra'n dal i fod yn deg, tryloyw a thrwyadl. "
        },
        {
            "text": "Mae'r holl heddluoedd ac ystod gynyddol o erlynwyr nad ydynt yn rhai’r heddlu yn elwa o allu prosesu achosion yn ddigidol, gan gyrchu gwybodaeth mewn amser real i gyflawni cyfiawnder llyfnach a heb orfod cludo llwyth o waith papur o safle i safle a heb orfod mewnbynnu data â llaw mewn mwy nag un system. Rhwng Ebrill 2019 a Mawrth 2023, mae nifer yr achosion SJP yn y system wedi mwy na dyblu a rhwng Ebrill 2017 a Ionawr 2025 cawsom dros 267,000 o bledion ar-lein."
        },
        {
            "text": "Mae’r Platfform Cyffredin yn gwella sut rydym yn casglu ac yn rhannu data cywir a chynhwysfawr yn y llys troseddol rhwng partneriaid cyfiawnder. Rydym yn ei ddefnyddio i ddeall anghenion defnyddwyr llys yn well a gwella ein gwasanaethau yn barhaus, gan nodi a gweithredu ar unrhyw rwystrau cudd i'r rhai sy'n eu defnyddio."
        },
        {
            "text": "Ni fyddwn wedi gallu gwneud hyn cyn y Rhaglen Ddiwygio ac mae data gwell yn ein galluogi i lywio gwelliannau pellach i'r system yn uniongyrchol. Mae casglu data yn ddigidol yn rhoi cyfle i graffu sylweddol ar erlyniadau, achosion a phenderfyniadau, gan gynnal egwyddor allweddol cyfiawnder agored hyd yn oed pan nad yw gwrandawiadau yn gyhoeddus."
        },
        {
            "heading": 2,
            "text": "Gwrando ac addasu"
        },
        {
            "text": "Un o'r gwersi mwyaf gwerthfawr rydyn ni wedi'u dysgu yw pwysigrwydd gwrando ar ein defnyddwyr ac mae eich adborth wedi bod yn hanfodol wrth lunio ein cyfeiriad. Enghraifft berffaith o hyn yw'r penderfyniad i gadw'r System Achosion Digidol (DCS) yn Llys y Goron – dywedasoch wrthym ei fod yn gweithio'n dda, ac fe wnaethon ni wrando."
        },
        {
            "text": "Ar adeg ei gyflwyno i lysoedd ledled y wlad, roeddem yn canolbwyntio gormod ar fynd i'r afael â datrysiadau technolegol, ac nid oeddem yn cadw’n gyfredol â'r adborth a ddaeth gan ddefnyddwyr. Mae'r pandemig a'r galw cynyddol am wasanaethau hefyd wedi achosi aflonyddwch mawr, ac oherwydd hyn mae'r rhaglen wedi wynebu oedi a gostyngiadau mewn cwmpas. Ond rydym wedi defnyddio'r profiad hwn i sicrhau ein bod yn well am ddefnyddio adborth yn ein prosesau dysgu. "
        },
        {
            "heading": 2,
            "text": "Edrych i’r dyfodol"
        },
        {
            "text": "Fi yw'r cyntaf i gydnabod nad yw’r Platfform Cyffredin yn berffaith, a bod llawer mwy o waith i'w wneud i wella profiad y defnyddiwr, datrys problemau technegol a rhoi hwb i berfformiad a sefydlogrwydd cyffredinol y platfform. Ond rydym yn barod ac mae’r adnoddau gennym i wneud y gwaith hwnnw, nid yn unig ar gyfer y flwyddyn nesaf, ond am flynyddoedd lawer i ddod. Byddwn yn parhau i wneud gwelliannau cynyddol i'r hyn sydd eisoes yno a blaenoriaethu'r newidiadau mwyaf gwerthfawr."
        },
        {
            "text": "Wrth i ni symud ymlaen, mae ein ffocws o ran y llysoedd troseddol yn glir – ymgorffori a gwella'r broses fusnes a'r newidiadau technegol yr ydym eisoes wedi'u gwneud, ymrwymo i ymgysylltu a gwella fel sefydliad sy'n cael ei arwain gan wasanaethau a derbyn adborth i wella sut mae cyfiawnder yn cael ei gyflawni'n barhaus."
        },
        {
            "text": "Mae'r heriau rydyn ni wedi'u hwynebu wedi dysgu gwersi gwerthfawr i ni am gydbwyso uchelgeisiau ag ymarferoldeb. Nid dyma'r diwedd, ond ymrwymiad parhaus i fireinio, gwella a sefydlogi."
        }
    ]
}