{
    "url": "https://deframedia.blog.gov.uk/2023/02/13/coverage-from-the-save-britains-rivers-campaign/",
    "title": "Coverage from the Save Britain’s Rivers campaign",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-02-13T17:55:10+00:00",
    "content": [
        {
            "text": "There has been inaccurate coverage in the i this weekend following the launch of their Save Britain’s Rivers campaign."
        },
        {
            "text": "The headline claim on Saturday that only 6% of Britain’s rivers are on course to be healthy by 2027 is completely untrue."
        },
        {
            "text": "This figure relates to Environment Agency modelling showing what would happen in England, by 2043, if no action was taken."
        },
        {
            "text": "That is why a huge amount of action is already underway, including new legally binding targets, our Storm Overflows Discharge Reduction Plan and plans to make it easier for regulators to enforce penalties and hold water companies to account."
        },
        {
            "text": "We use many biological and habitat measures to check the health of our waters – and currently almost 80% of individual tests meet the threshold for good ecological status. However, only 16% are classed as ‘good’ overall. This is due to the “one-out-all-out” principle – failure of any one individual test means that overall the water body will fail."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "\"We are committed to restoring our rivers and we will continue to crack down and take the strongest possible action against polluters."
        },
        {
            "text": "“It’s completely untrue that only 6% of England’s rivers are on course to be healthy by 2027. This figure is what would happen by 2043 if we were not taking the huge amount of action which is already underway."
        },
        {
            "text": "“We have put the strictest targets ever on water companies to clean up our water, delivering the largest infrastructure programme in their history to tackle sewage spills. Since 2015, we have also seen the number of bathing waters classified as ‘good’ or ‘excellent’ increase to 92.8%, and record levels of fines for water companies who break the law.”"
        },
        {
            "text": "Environment Agency enforcement"
        },
        {
            "text": "The article also claims that regulators do not have the legal powers to hold water companies to account. Again, this is not true. Where water companies are found to be breaking the law, they will face enforcement action."
        },
        {
            "text": "Since 2015, the Environment Agency has brought 56 prosecutions against water companies, securing fines of over £142 million. It is also undertaking a major investigation into potential widespread non-compliance by water and sewerage companies at more than 2200 sewage treatment works, involving all the water companies."
        },
        {
            "text": "Retained EU Law"
        },
        {
            "text": "Further coverage from the i today also claims that the Government plans to weaken regulations that protect our waters under the new Retained EU Law Bill. This is not the case."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "“This Government has no plans to weaken any regulations that protect our waters. In recent years we have strengthened them – including major new duties on water companies to tackle storm overflows."
        },
        {
            "text": "“As we have made clear, reviewing our retained EU law will not come at the expense of the UK’s already high standards and environmental protections will not be downgraded.”"
        },
        {
            "text": " "
        }
    ]
}