{
    "url": "https://nda.blog.gov.uk/how-active-demonstrators-are-challenging-the-norm-at-sellafield/",
    "title": "How active demonstrators are challenging the norm at Sellafield",
    "authors": [
        "Chris Hope - Chris Hope, head of technical and new capability in remediation"
    ],
    "categories": [
        "Innovation/savings",
        "Research and development",
        "Science"
    ],
    "pub_date": "2023-02-13T12:05:54+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What are Active Demonstrators?"
        },
        {
            "text": "They are lead and learn projects where we work with our supply chain to come up with solutions to the significant decommissioning and waste management challenges on the Sellafield site."
        },
        {
            "text": "The learning we get from them helps inform the strategic decisions being made by the enterprise – such as ‘what capabilities do we need for treating metal waste?’."
        },
        {
            "text": "We cover the design, procurement, off-site testing, installation, commissioning, active demonstration and decommissioning of new types of equipment to test what’s going to work for the future."
        },
        {
            "heading": 3,
            "text": "How are they different from other innovation programmes, such as Gamechangers or LINC?"
        },
        {
            "text": "It’s about scale. Active demonstrators are jobs that we know need doing right across the Sellafield site so can be scaled up; the others are more bespoke."
        },
        {
            "text": "It’s perhaps simpler to look at it through a challenge statement: ‘How can we remove the need for humans to put their hands in gloveboxes?’ would be the grand challenge and could be the starting point for an active demonstrator project."
        },
        {
            "text": "‘How can we identify and quantify a particular type of radioactive material in a glovebox?’ is more ringfenced, a supporting technology, and could be the start of a Gamechanger challenge. ‘How do we remove material x from glovebox y in plant z’ is again more specific so could be something we deliver through LINC if we don’t have an existing solution."
        },
        {
            "heading": 3,
            "text": "When did Active Demonstrators start?"
        },
        {
            "text": "The programme started to ramp up around 2014. We knew the amount of broad front decommissioning work on the Sellafield site was going to increase so we needed to innovate and find new technologies."
        },
        {
            "text": "We knew ‘what’ work needed doing in the lifetime plan, this was about exploring ways to underpin it with the ‘how’."
        },
        {
            "heading": 3,
            "text": "How much do we invest in the Active Demonstrator programme?"
        },
        {
            "text": "We set aside around £10 million a year from our annual budget to invest across the projects, but they can also bring in funding from additional sources such as the Nuclear Decommissioning Authority (NDA) and the Department for Business, Energy and Industrial Strategy (BEIS) if there’s the potential for them to be used more widely in UK nuclear decommissioning."
        },
        {
            "text": "Once a project becomes more routine/business as usual, then the funding for running them transfers from the technical budget to operations so that we can keep investing in innovation."
        },
        {
            "heading": 3,
            "text": "What sets them apart from other projects we run at Sellafield?"
        },
        {
            "text": "They are learning driven and will always carry uncertainty, so failure can still be an acceptable outcome."
        },
        {
            "text": "They are also about challenging the norm and looking beyond the technologies and techniques we’ve traditionally used.  They tend to be delivered in accelerated timescales and aren’t typical gated projects."
        },
        {
            "heading": 3,
            "text": "Lots of your projects seem to be stepping into operations at the same time now, why is that?"
        },
        {
            "text": "A lot of the current ‘stock’ of projects were initiated between 2017 and 2019 and have taken around 4 years to get operational (that period was obviously affected by Covid-19)."
        },
        {
            "text": "It’s good to see a range of projects all maturing at the same time and we’re delivering a lot of exciting work at the moment."
        },
        {
            "heading": 3,
            "text": "Who is involved in delivering them?"
        },
        {
            "text": "The programmes create the ‘pull’ by setting the challenge and then technical leads on creating solutions and capturing learning, but it’s all about collaboration."
        },
        {
            "text": "There are multi-discipline teams involving a wide range of people and skills across both Sellafield Ltd and our supply chain."
        },
        {
            "text": "It’s a huge team effort involving design, commissioning, safety case and many other disciplines. And then of course our operations and engineering and maintenance people are vital for making it happen on plant."
        },
        {
            "text": "There’s also collaboration and investment at a national level – we’re working with fellow companies in the NDA to provide a pipeline of technology for nuclear decommissioning."
        },
        {
            "heading": 3,
            "text": "Some of our active demonstrators in action"
        },
        {
            "text": "Skip Size Reduction Facility"
        },
        {
            "text": "Storage space on the Sellafield site for intermediate level waste is limited and expensive. The premise behind the Skip Size Reduction Facility is simple and one which made Ikea a global phenomenon:  rather than paying to store air, it’s cheaper to ‘flat pack’."
        },
        {
            "text": "The items we’re ‘flat packing’ are legacy skips taken out of the First Generation Magnox Storage Pond. Getting empty skips out of the pond is a business priority because it frees up the space to speed up further pond clean-up work, including sludge removal on the pond floor. There are over 1,200 skips in total."
        },
        {
            "text": "We started removing skips from the pond in 2018 and removed circa 75 by sending them to the emptied Windscale Advance Gas Cooled Reactor (WAGR) building for storage in shielded isofreight containers – 2 skips in each isofreight. Space limitations in WAGR mean the store can only accommodate circa 75 isofreights."
        },
        {
            "text": "The Skip Size Reduction Facility allows us to get industrial robots to cut up skips using lasers to the reduce storage space they take up. By cutting them into panels we’ve trebled the number of skips that can be put into an isofreight: there’s still 2 intact ‘mother’ skips inside the container, but those 2 skips each hold the cut-up panels of 2 further skips – so there’s 6 skips in each isofreight now."
        },
        {
            "text": "We're also now sending the size-reduced skips to the Medium Beta Gamma Waste Store, where they can be kept before eventual transferral to a Geological Disposal Facility."
        },
        {
            "text": "The Skip Size Reduction Facility is now fully operational and able to cut up 2 skips per week."
        },
        {
            "text": "It's been delivered through the Decommissioning Delivery Partnership and a number of small to medium sized enterprises have been integral, including Taylor Kightley Engineering and Cyan Tec."
        },
        {
            "text": "Alpha Active Demonstrator"
        },
        {
            "text": "This is another remote size reduction system using industrial robots, but this time the lasers will be cutting up alpha contaminated gloveboxes rather than legacy pond skips. The team, based in our former MOX Demonstration Facility, are on the brink of starting active operations."
        },
        {
            "text": "In October 2022, the MOX Demonstration Facility went from being a building in surveillance and maintenance into one where there were active Plutonium Contaminated Material waste handling operations teams started to remove waste items from gloveboxes."
        },
        {
            "text": "This was the first time the gloveboxes had been touched since 1999 and all part of the preparation for cutting them up. The gloveboxes were originally used for manufacturing fuel rods that would then be constructed into fuel assemblies."
        },
        {
            "text": "The aim is to sentence as much of the glovebox and its contents as possible as low level waste (based on the levels of radiation on the material) and then place any intermediate level waste pieces into 200-litre drums."
        },
        {
            "text": "Supporting this work is brand new ‘AMCAM’ equipment which allows operators to detect if there are traces of Americium in the glove box while emptying them – this has been developed collaboratively with Cavendish Nuclear."
        },
        {
            "text": "There are over 1,000 gloveboxes and legacy crates on the Sellafield site, all different shapes and sizes, so chopping up the first one with lasers will be a key moment in helping to inform us whether the technology has the potential to be scaled up into a ‘Central Breakdown Facility’."
        },
        {
            "text": "It will also inform decisions such as whether to construct another Engineered Drum Store or Waste Treatment Complex to house further waste from decommissioning alpha gloveboxes."
        },
        {
            "text": "Decommissioning Waste Services Partnership"
        },
        {
            "text": "This demonstrator involves more ‘chop and sort’ work and is another that has recently gone into active operations, with the first legacy pond waste item being cut up in October 2022."
        },
        {
            "text": "The idea formed in 2018, and in 2019 we started installing equipment in a building which was historically used to decontaminate plant items from around the Sellafield site. Roughly the same size as a typical car wash, bulky waste items are placed on the machine and a diamond wire cutter is used to cut away ‘hot spot’ portions so that pieces can be further segregated/sorted as intermediate level waste or low level waste."
        },
        {
            "text": "The first item to be cut up was an old bogie ram and it is estimated that nearly £1 million will be saved in waste disposal costs on just this one item as only 20% of the original item is classed as intermediate level waste."
        },
        {
            "text": "The active demonstrator involves cutting up 18 different types of legacy pond items in all shapes and sizes so that we can gain learning about the techniques needed for a range of different challenges across site."
        },
        {
            "text": "Again, it relieves pressure on existing storage capacity by minimising the amount of waste classed as intermediate level waste."
        },
        {
            "text": "Like many of our active demonstrator projects, it has been delivered in partnership with our supply chain, with Integrated Decommissioning Solutions contracted through our Decommissioning Delivery Partnership."
        },
        {
            "text": "Alpha Sort and Segregate"
        },
        {
            "text": "This is another project with the potential to deliver huge savings by reducing the cost of waste disposal, this time by removing Plutonium Contaminated Material from items which can be classed as low level waste."
        },
        {
            "text": "The alpha items to be sorted are the first of over 650 ‘legacy crates’ dating back to the 1950s. The crates contain waste from some of the world’s earliest nuclear decommissioning work as we conducted the first trials on making plutonium and needed to dispose of redundant equipment and materials as we learned on the job."
        },
        {
            "text": "To maintain the integrity of the original storage containers, we have overpacked layers of containment over the years, creating a ‘Russian Doll’ effect. Now we’re approaching a time when we can unpack these layers and dispose of the waste appropriately, ensuring as much as possible can be safely go down the lowest-cost routes."
        },
        {
            "text": "Located inside the MOX Demonstration Facility, we have stripped out a former laboratory and built a containment room where operators will ‘unwrap’ the crates."
        },
        {
            "text": "We’ve used technology from the pharmaceutical industry in how we’ve built the walls and ceiling for the most effective containment and contamination barriers."
        },
        {
            "text": "Initially the work will be done by operators which has meant new learning and skillsets for our people. Further along, the experience we gain will help inform how robots and automated machines will be able to support this work."
        },
        {
            "text": "Active operations are expected to begin in 2024."
        },
        {
            "text": "Integrated Innovation for Nuclear Decommissioning"
        },
        {
            "text": "The challenge of whether we could decommission an entire cell that people couldn’t physically access due to radiation levels, started in 2018. We’d need technology that could support the full end-to-end process, starting with advanced characterisation and visualisation, followed by decontamination, plant dismantling, control systems and waste packaging."
        },
        {
            "text": "Given its potential to be deployed in nuclear sites across the UK and beyond, this active demonstrator project has attracted £8.5 million in research and development funding from the NDA, BEIS and Innovate UK."
        },
        {
            "text": "We’re now working with the Appleby-based engineering and manufacturing company Barrnon on our preferred solution – a large machine on caterpillar tracks which is able to check, cut up and remove equipment at all heights in a cell."
        },
        {
            "text": "It looks like it would be a surefire winner on Robot Wars! and is set to be deployed into the medium active north cell in the First Generation Reprocessing Plant in 2025."
        }
    ]
}