{
    "url": "https://ruralpayments.blog.gov.uk/2023/02/13/mind-your-head-supporting-the-farm-safety-foundation/",
    "title": "Mind Your Head – Supporting the Farm Safety Foundation",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Social Media"
    ],
    "pub_date": "2023-02-13T11:23:45+00:00",
    "content": [
        {
            "text": "This week we’re sharing information about the Mind Your Head campaign, on behalf of Yellow Wellies, Farm Safety Foundation. "
        },
        {
            "text": "The Farm Safety Foundation is the charity leading the campaign to raise awareness of protecting the physical and mental wellbeing of those living and working in the sector. According to their research, 94% of UK farmers under 40 rank poor mental health as the biggest hidden problem facing farmers today.  "
        },
        {
            "text": "Across RPA we recognise that there are many challenges facing farming communities right now, and that many of these are having an impact on mental health. "
        },
        {
            "text": "We’re always listening to farmers and we understand that the volume of information available from organisations such as RPA and Defra, about current and future schemes and funding, can be overwhelming. For anyone who isn’t sure where to start, the Funding for farmers and land managers page on GOV.UK sets out the schemes and grants that are available now.  "
        },
        {
            "text": "Also, Defra recently published an environmental land management scheme update including the full range of actions, payment rates and when they’ll be available, with a summary on the Future Farming blog. This should help farmers be better able to plan for the future, as we know not being able to do this is a contributing factor to poor mental health when the way forwards isn’t clear. "
        },
        {
            "text": "We’re proud to support the Mind Your Head campaign and also to work with many farming welfare organisations that support mental health in rural communities. "
        },
        {
            "text": "The Farming Community Network (FCN) have people you can talk to about stress, depression, isolation, or any farming related issue which might be adding to these. FCN volunteers understand farming and rural life and are available via their helpline 7am-11pm every day of the year; 03000 111 999. "
        },
        {
            "text": "RABI offer free and confidential, in-person counselling support for farmers which can be accessed by calling their helpline on 0800 188 4444, 24 hours a day, 7 days a week. They also offer online wellbeing support for adults and young people, with a range of resources available. "
        },
        {
            "text": "Today Yellow Wellies have relaunched their fifth edition of The Little Book of Minding Your Head, a publication which has been written specifically for the UK's farming industry, and offers a Plain English approach to mental health in farming and where to get support. You can access it here and can find all the information on Mind Your Head, and the work of the Farm Safety Foundation on their website Farm Safety Foundation / Yellow Wellies - YellowWellies.org "
        },
        {
            "text": "If you have social media, you can follow the Farm Safety Foundation on Instagram, Facebook or Twitter @yellowwelliesuk  "
        },
        {
            "text": "#MindYourHead   "
        }
    ]
}