{
    "url": "https://publicguardian.blog.gov.uk/2023/02/13/refreshed-deputy-standards/",
    "title": "Refreshed deputy standards",
    "authors": [
        "Jill Twigger"
    ],
    "categories": [
        "Attorneys",
        "Deputies",
        "deputy",
        "Guidance",
        "Public Authorities",
        "Solicitors"
    ],
    "pub_date": "2023-02-13T14:05:23+00:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "A refreshed set of standards has been published to help all court appointed deputies in delivering their duties."
        },
        {
            "text": "Deputies do an important role in making decisions on behalf of someone who has lost capacity to make them for themselves."
        },
        {
            "text": "A court appointed deputy can be anyone aged 18 or above, and is usually someone who is a close relative or friend of the person who needs help making decisions, often referred to as lay deputies. Sometimes the Court of Protection may choose a professional deputy, especially if the donor has complex affairs. This might be someone like a solicitor, accountant or representative from the local authority, which are known as public authority deputies."
        },
        {
            "text": "For many years, standards have been in place to help professional and public authority deputies understand their responsibilities and what’s expected of them. However, feedback told us that these standards are sometimes difficult to use and could be simpler, and there was a gap for lay deputies."
        },
        {
            "text": "We’ve recently reviewed the standards to make them clearer, and applicable to all deputies. These standards now also apply to lay deputies – people who are carrying out the role but are not a professional, such as a solicitor."
        },
        {
            "text": "The refreshed standards and accompanying guidance are now available on GOV.UK."
        },
        {
            "text": "What’s changing?"
        },
        {
            "text": "This is not the introduction of a completely new set of standards as the guiding principles of the refreshed standards remain the same and continue to be aligned with the Mental Capacity Act."
        },
        {
            "text": "The standards are now more focused, built around eight core areas which reflect the duties and responsibilities of all deputies. Much of the material in the original standards has now been re-shaped and included within the supporting guidance."
        },
        {
            "text": "What does this mean?"
        },
        {
            "text": "All deputies, including lay deputies, will now be supervised against these refreshed standards. The standards can be used as a checklist to help deputies make sure they are thinking about all the relevant areas of their role."
        },
        {
            "text": "If you are a deputy, it’s important that you read through the information to understand how these apply to you and the delivery of your role."
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "Cyhoeddwyd cyfres ddiwygiedig o safonau i helpu’r holl ddirprwyon a benodwyd gan y llys i gyflawni eu dyletswyddau."
        },
        {
            "text": "Mae gan ddirprwyon rôl bwysig o ran gwneud penderfyniadau ar ran rhywun sydd wedi colli’r gallu i wneud hynny drosto’i hun."
        },
        {
            "text": "Gall dirprwy a benodwyd gan y llys fod yn unrhyw un sy’n 18 oed neu’n hŷn, ac mae fel arfer yn berthynas agos neu’n ffrind i’r sawl sydd angen help i wneud penderfyniadau, a elwir yn aml yn ddirprwy lleyg. Weithiau gall y Llys Gwarchod ddewis dirprwy proffesiynol, yn enwedig os ydy materion y rhoddwr yn gymhleth. Gallai hwn fod yn rhywun fel cyfreithiwr, cyfrifydd neu gynrychiolydd o’r awdurdod lleol, a elwir yn ddirprwyon awdurdod cyhoeddus."
        },
        {
            "text": "Ers blynyddoedd lawer, mae safonau wedi bod ar waith i helpu dirprwyon proffesiynol a dirprwyon awdurdodau cyhoeddus i ddeall eu cyfrifoldebau a’r hyn a ddisgwylir ganddynt. Serch hynny, mae adborth wedi dweud wrthym fod y safonau hyn yn anodd eu defnyddio weithiau ac y gallent fod yn symlach, a bod bwlch ar gyfer dirprwyon lleyg."
        },
        {
            "text": "Rydym wedi mynd ati’n ddiweddar i adolygu’r safonau fel eu bod yn fwy clir, ac yn berthnasol i bob dirprwy. Erbyn hyn mae’r safonau’n berthnasol i ddirprwyon lleyg hefyd – pobl sy’n cyflawni’r rôl ond ddim yn broffesiynol, fel cyfreithiwr."
        },
        {
            "text": "Mae’r safonau diwygiedig a’r canllawiau cysylltiedig ar gael ar GOV.UK."
        },
        {
            "text": "Beth sy’n newid?"
        },
        {
            "text": "Nid ydym yn cyflwyno cyfres newydd o safonau gan fod egwyddorion arweiniol y safonau diwygiedig yn aros yr un fath ac yn parhau i gyd-fynd â’r Ddeddf Galluedd Meddyliol."
        },
        {
            "text": "Mae'r safonau nawr yn fwy penodol, ac yn seiliedig ar wyth maes craidd sy’n adlewyrchu dyletswyddau a chyfrifoldebau pob dirprwy. Mae llawer o’r deunydd yn y safonau gwreiddiol bellach wedi cael ei ail-lunio a’i gynnwys yn y canllawiau ategol."
        },
        {
            "text": "Beth mae hyn yn ei olygu?"
        },
        {
            "text": "Bydd yr holl ddirprwyon, gan gynnwys y dirprwyon lleyg, nawr yn cael eu goruchwylio yn unol â’r safonau diwygiedig hyn. Gellir defnyddio’r safonau fel rhestr wirio i helpu dirprwyon i wneud yn siŵr eu bod yn meddwl am yr holl feysydd sy'n berthnasol i’w rôl."
        },
        {
            "text": "Os ydych chi’n ddirprwy, mae’n bwysig eich bod yn darllen yr wybodaeth i ddeall sut mae’r rhain yn berthnasol i chi wrth gyflawni eich rôl."
        },
        {
            "text": " "
        }
    ]
}