{
    "url": "https://defrafarming.blog.gov.uk/2023/02/13/the-sustainable-farming-incentive-pilot-learning-together/",
    "title": "The Sustainable Farming Incentive pilot: learning together",
    "authors": [
        "Sam Dovey"
    ],
    "categories": [
        "A view from the farm",
        "Conversations we're having",
        "Sustainable Farming Incentive pilot"
    ],
    "pub_date": "2023-02-13T12:14:24+00:00",
    "content": [
        {
            "text": "Farmers across England are helping us to test the Sustainable Farming Incentive (SFI) through the SFI pilot."
        },
        {
            "text": "In this post, I’ll share a snapshot of what we’ve learned from pilot participants through on-farm and large-scale, regional face-to-face events."
        },
        {
            "text": "These are just a few things we've learnt through the pilot. We will continue to adapt and improve our offer over time."
        },
        {
            "text": "Many of the proposals set out in our recent environmental land management update were informed by the pilot."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Even though the Sustainable Farming Incentive is now live, piloting will continue."
        },
        {
            "text": "It was always our plan to run the pilot for 3 years, until 2025. As is the case with all our new schemes, we’re rolling them out gradually and testing as we go."
        },
        {
            "text": "In total, 840 farmers are involved in the pilot. They represent a range of farms and land types from across England."
        },
        {
            "text": "We started issuing pilot agreements in November 2021. Since then, the experiences of participants have helped us to shape the scheme so that it works for as many farmers as possible. Check out our previous posts on the SFI pilot."
        },
        {
            "heading": 2,
            "text": "Meeting up with pilot participants"
        },
        {
            "text": "We decided to hold in-person events because participants told us that they found face-to-face interaction particularly useful."
        },
        {
            "text": "It was important to create a space where participants could meet and share their feelings about the delivery of the standards on their farms, ask questions and raise concerns with the team."
        },
        {
            "text": "It gave our team the chance to deepen our understanding and further develop our relationships with participants. Sometimes in-person conversations can be richer than those carried out through e-mail or video call."
        },
        {
            "text": "We felt that they would complement our existing approach to learning through the pilot which includes webinars, workshops and surveys."
        },
        {
            "text": "So, over summer and autumn last year, we held 3 on-farm events, hosted by pilot farmers, as well as 6 face-to-face events."
        },
        {
            "heading": 2,
            "text": "On-farm events"
        },
        {
            "text": "On-farm events enabled both our team and participants to better understand how the pilot was working on the ground."
        },
        {
            "text": "With support from our partners at the University of Sheffield, we held 3 on-farm events in:"
        },
        {
            "text": "• Tebay, Cumbria on 23 June\n• Skipton, North Yorkshire on 25 August\n• Skirbeck, Lincolnshire on 14 September"
        },
        {
            "text": "A total of 64 participants attended."
        },
        {
            "text": "The video below, filmed at the Cumbria event, gives a sense of what the events were like."
        },
        {
            "heading": 2,
            "text": "Regional events"
        },
        {
            "text": "Our series of larger-scale face-to-face events has brought together over 300 farmers across the country:"
        },
        {
            "text": "The video below was filmed at our event in Harrogate."
        },
        {
            "text": "Since then, we've held 2 more virtual events. They brought together over 200 pilot participants who couldn't make the earlier events."
        },
        {
            "text": "We were pleased to share significant changes to the live scheme with participants in person, following their earlier feedback. For example:"
        },
        {
            "text": "Some of the insights that we gathered from participants include:"
        },
        {
            "heading": 2,
            "text": "Next steps and thanks"
        },
        {
            "text": "Due to the success of these events, we're planning more of them."
        },
        {
            "text": "We're grateful to the pilot participants for their time, insight and willingness to make the scheme work well."
        },
        {
            "text": "As I mentioned, the Sustainable Farming Incentive is live. If you're interested in signing up, you can learn what to do before you apply on GOV.UK."
        },
        {
            "text": "Finally, if you haven't caught up on the latest from my colleagues working on the Sustainable Farming Incentive, I'll share the latest blog posts from them in the box below."
        },
        {
            "text": "Subscribe to the Future Farming blog for the latest updates from across the Future Farming and Countryside Programme."
        }
    ]
}