{
    "url": "https://educationhub.blog.gov.uk/2024/01/02/how-to-apply-for-30-hours-free-childcare-and-find-out-if-youre-eligible/",
    "title": "How to apply for 30 hours free childcare and find out if you’re eligible",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "early years"
    ],
    "pub_date": "2024-01-02T11:30:35+00:00",
    "content": [
        {
            "text": "Thousands of parents are entitled to free childcare to support them to return to work after parental leave. Depending on how old your child is, you may be able to access between 15 and 30 hours free childcare a week."
        },
        {
            "text": "From April 2024,  even more parents will be able to access free childcare. This was announced by the Chancellor in the Spring Budget 2023."
        },
        {
            "text": "Here we tell you about the free Government-funded childcare you can access now, how to apply and what you’ll be able to get in future."
        },
        {
            "heading": 3,
            "text": "Who can get 30 hours of free childcare?"
        },
        {
            "text": "Working parents or carers of children aged three to four in England are currently entitled to 30 hours free childcare a week."
        },
        {
            "text": "The childcare provider must be approved – so informal providers such as grandparents don’t count – and the support stops when your child starts reception class."
        },
        {
            "text": "Some providers may ask you to pay for extra costs like meals, nappies or trips."
        },
        {
            "text": "Eligibility depends on whether you’re working, your income, your child’s age and circumstances and your immigration status."
        },
        {
            "text": "Full details about eligibility requirements can be found at: 30 hours free childcare - GOV.UK."
        },
        {
            "text": "There are different childcare support schemes in Scotland, Wales and Northern Ireland."
        },
        {
            "heading": 3,
            "text": "Who can get 15 hours of free childcare?"
        },
        {
            "text": "All parents of children aged three to four can access 15 hours of free childcare. It doesn't matter how much you earn or how many hours you work."
        },
        {
            "text": "Currently, parents of two-year-olds can access 15 hours a week of free childcare if they are in receipt of income support benefits, such as Universal Credit, and earn less than £15,400 a year."
        },
        {
            "text": "From April 2024, working parents of two-year-olds will also be able to access 15 hours of free childcare. Applications opened on 2 January 2024. "
        },
        {
            "heading": 3,
            "text": "When will the 30 hours of free childcare be extended?"
        },
        {
            "text": "We’re introducing free childcare gradually, to make sure that providers can meet the needs of more families, starting with 15 hours of free childcare for working parents of two-year-olds. If eligible, you can apply now."
        },
        {
            "text": "From September 2024, 15 hours of free childcare will be extended to all children from the age of 9 months."
        },
        {
            "text": "From September 2025, working parents of children under the age of five will be entitled to 30 hours of free childcare a week."
        },
        {
            "text": "Application for these offers will be available in the coming months. "
        },
        {
            "heading": 3,
            "text": "How to apply for free childcare "
        },
        {
            "text": "If your child is age three or four and you want to access 15 hours of free childcare, you don’t need to make an application as your childcare provider will do this for you automatically."
        },
        {
            "text": "You’ll just need to show them a copy of your child’s birth certificate, and you’ll also have to sign a declaration form. Talk to your childcare provider directly to find out more."
        },
        {
            "text": "Working parents of two-year-olds can also apply for 15 hours of free childcare, to be accessed from April. Parents can apply via Childcare Choices. "
        },
        {
            "text": "If your child is three or four years old and you’re eligible for 30 hours of free childcare, you’ll need to fill out an application form online."
        },
        {
            "text": "If you’re eligible, you’ll get a childcare account and a code which you’ll need to show to your childcare provider, along with your child’s date of birth and your National Insurance number."
        },
        {
            "text": "You’ll need to reconfirm your details every three months, or your code will expire."
        },
        {
            "text": "Check your eligibility and apply for 30 hours free childcare at this link."
        },
        {
            "text": "You can log into your Government childcare account here."
        },
        {
            "heading": 3,
            "text": "When should I apply for free childcare?"
        },
        {
            "text": "You can make an application at any point in the year. However, to make sure you receive your code, leave plenty of time to apply. The best time to apply depends on when your child turns three – work out when is best for you at this link."
        },
        {
            "text": "You will be asked to reconfirm you’re still eligible every 3 months. This means that if you apply at least 3 months before your child starts going to your childcare provider, you’ll need to reconfirm you’re still eligible before you take up a place."
        },
        {
            "text": "For parents of two-year-olds to access 15 hours of free childcare, we recommend those eligible apply between mid-January and the end of February so that parents won’t need to reconfirm eligibility before taking up a place. Parents can apply via Childcare Choices. "
        },
        {
            "heading": 3,
            "text": "How to sign into your Government childcare account"
        },
        {
            "text": "To apply for 30 hours free childcare, you can sign into your account at this link."
        },
        {
            "text": "You’ll need your Government Gateway user ID to login."
        }
    ]
}