{
    "url": "https://educationhub.blog.gov.uk/2024/01/when-apply-for-15-hours-free-childcare/",
    "title": "When can I apply for 15 hours free childcare?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare"
    ],
    "pub_date": "2024-01-02T09:00:27+00:00",
    "content": [
        {
            "text": "We’re expanding free government-funded childcare so that thousands more parents won’t have to choose between a career and a family."
        },
        {
            "text": "Currently, parents who work and earn the equivalent of 16 hours a week at the National Minimum Wage, and earn less than £100,000 adjusted net income per year, are entitled to 30 hours government funded childcare a week for children aged three to four."
        },
        {
            "text": "We’re now expanding the scheme so that eligible working parents are also entitled to 30 hours of government funded  childcare for children from age 9 months. This will be rolled out in stages, starting in April 2024."
        },
        {
            "text": "It's worth noting that some providers may ask for charges in addition to the government funded childcare. Visit childcarechoices.gov.uk for further information."
        },
        {
            "heading": 3,
            "text": "When can I apply for free childcare?"
        },
        {
            "text": "The first stage of the roll out will see eligible working parents of two-year-olds receive 15 hours government funded childcare per week starting from April 2024."
        },
        {
            "text": "Applications for this first stage of the roll out opened on 2 January 2024. Parents will be asked to reconfirm that they are still eligible for the support every 3 months."
        },
        {
            "text": "We recommend those eligible apply between mid-January and the end of February so that parents won’t need to reconfirm eligibility before taking up a place. Parents can apply via Childcare Choices."
        },
        {
            "text": "From September 2024, 15 hours of government funded childcare will be extended to all children from the age of nine months."
        },
        {
            "text": "From September 2025, working parents of children under the age of five will be entitled to 30 hours government funded childcare per week."
        },
        {
            "text": "Application for these offers will be available in the coming months."
        },
        {
            "text": "You may already be entitled to government funded childcare. You can find out more on Childcare Choices."
        },
        {
            "heading": 3,
            "text": "What do you mean when you say free childcare is for ‘working’ parents? "
        },
        {
            "text": "Working parents who individually earn more than £8,670 but less than £100,000 adjusted net income per year are eligible."
        },
        {
            "text": "For couples, the rules apply to both parents, so both must earn at least £8,670 and neither can earn more than £100,000."
        },
        {
            "text": "There’s more information available on the exact criteria on the Childcare Choices website, for example if parents work irregular hours or are receiving certain benefits."
        },
        {
            "heading": 3,
            "text": "How are we supporting nurseries to make sure there are enough places?"
        },
        {
            "text": "To make sure there are enough places available, we’re investing over £400 million in 2024-25 to increase the hourly rates paid to local authorities."
        },
        {
            "text": "For 2024-25, national average hourly rates paid by the government will be £11.22 for under twos, £8.28 for two-year-olds, and £5.88 for three- and four-year-olds."
        },
        {
            "text": "Start-up grants will also be available for new or returning childminders who have:"
        },
        {
            "text": "Childminders will receive grants of:"
        },
        {
            "heading": 3,
            "text": "How to sign into your government childcare account"
        },
        {
            "text": "To apply for 30 hours government funded childcare, you can sign into your account at this link."
        },
        {
            "text": "You’ll need your Government Gateway user ID to login."
        }
    ]
}