{
    "url": "https://cddo.blog.gov.uk/2023/04/21/combating-modern-slavery-through-artificial-intelligence/",
    "title": "Combating modern slavery through artificial intelligence",
    "authors": [
        "Megan Lee Devlin, Chief Executive, CDDO"
    ],
    "categories": [
        "Data",
        "DDaT community",
        "DDaT events"
    ],
    "pub_date": "2023-04-21T10:16:40+01:00",
    "content": [
        {
            "text": "\nLast month, I joined the judging panel for the Civil Service Data Challenge final, which brings civil servants from across government together to design and pitch innovative ideas for the use of data to solve some of the UK’s biggest challenges. "
        },
        {
            "text": "The Data Challenge is an annual event, and a showcase of the ingenuity and brilliant outcomes that can come from cross-department collaborative working and the use of cutting-edge technology to solve knotty issues we face as government and improve the lives and livelihoods of the public. "
        },
        {
            "text": "It is also an example of multidisciplinary teams working at their finest - finalists ranged from data scientists, technical architects, economists to business analysts, product managers and service designers, even a criminal investigator. They also varied in experience from fast streamer to director. "
        },
        {
            "text": "These teams were formed just 16 weeks ago and built around an idea of how data could help to improve their day jobs, and yet presented particularly compelling proposals, with enormous benefits evident to the taxpayer and to the public whose lives they will improve."
        },
        {
            "text": "The winners - tackling modern slavery"
        },
        {
            "text": "This benefit is no more evident than from our winner’s this year, Project Heyrick, who are working on a very difficult challenge - identifying the estimated 135,000 unidentified victims of modern slavery in the UK today. These victims are, by definition, often unidentifiable and often are very difficult to trace using existing data."
        },
        {
            "text": "By combining government and open source data sets and applying advanced analytics, the team have been able to identify locations and organisations with an elevated risk of modern slavery. Enforcement departments, such as Policing, the Home Office, or the National Crime Agency, can then use this information to more effectively identify potential crimes."
        },
        {
            "text": "Cabinet Office Minister, Alex Burghart MP, said: "
        },
        {
            "text": "A tough decision "
        },
        {
            "text": "The grand final, which took place at County Hall Westminster on 23rd March to an audience of hundreds, was a culmination of months of hard work. This year we saw a record number of entries; all full of enthusiasm and curiosity for how data can help the way we serve the public."
        },
        {
            "text": "These ideas were shortlisted over a number of stages to our four finalist teams Project Heyrick, Child Maintenance datasets to improve compliance, Dokimi and Sorting Mail Items With AI - all of whom should be incredibly proud of their achievements. "
        },
        {
            "text": "Turning ideas into reality to serve the public"
        },
        {
            "text": "The Civil Service Data Challenge is a core part of the government's mission, as set out in our 2025 roadmap, to better harness the power of data to the benefit of all those in the UK. The brilliant examples we’ve seen at the final demonstrate the multitude of ways that data can sharpen our policy making and transform our services. "
        },
        {
            "text": "The Data Challenge is designed to help turn ideas into reality. In early stages of the process, we see a proliferation of projects, ideas and teams coming forward with a multitude of ideas. As the process continues, that curiosity and creativity is channelled into deliverable products through mentorship and support. And in the final stages, ideas are turbocharged towards delivery."
        },
        {
            "text": "Last year’s winning idea - the use of AI to identify and deliver restoration of peat bogs - is now being implemented by DEFRA, enabling higher carbon savings at a much lower cost using AI to identify and deliver restoration of peat bogs.  "
        },
        {
            "text": "It’s brilliant to have had such strong support from this Champion Alex Chisholm, Chief Operating Officer, Civil Service and Permanent Secretary, Cabinet Office again this year - as well as the other judges and leaders from the finalist team member’s home departments such as from HM Revenue and Customs, Home Office, Cabinet Office and Office for National Statistics."
        },
        {
            "text": "2023 Project Henrick will receive technical advice and £50,000 worth of development support from NTT DATA UK&I, plus the backing of senior Civil Servants. I look forward to working with the team, alongside fellow judges, in weeks and months to come."
        },
        {
            "text": "It's truly been a privilege to be part of the Civil Service Data Challenge, which is a testament to the fact that the Civil Service has no shortage of ideas, highlights the important role we can play in CDDO to support, encourage and enable those ideas to deliver real world impact for the public."
        }
    ]
}