{
    "url": "https://socialcare.blog.gov.uk/2023/04/21/future-proofing-care/",
    "title": "Future proofing care",
    "authors": [
        "Alice Ainsworth"
    ],
    "categories": [
        "Care and support",
        "Digital skills and technologies",
        "Information sharing",
        "Innovation"
    ],
    "pub_date": "2023-04-21T08:53:03+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Innovation spurred by huge challenges"
        },
        {
            "text": "Three years ago, at the start of the pandemic, we began an ambitious project to send thousands of iPads out to care homes. We knew care staff were facing unprecedented challenges and we wanted to make sure they had the basic technology infrastructure to support video consultations with health professionals and to make sure residents could stay in contact with friends and family while visiting was restricted."
        },
        {
            "text": "Fast forward to now, and we have a major programme underway, with a commitment from the government to invest at least £150 million in the digital transformation of the adult social care sector in England."
        },
        {
            "text": "I often reflect on how much our approach was informed by what we learned from that initial iPad project, both from its successes and the mistakes we made. We know it’s vital to work closely with the sector, to listen to what you want, and also to understand what barriers you might be facing, so we can adapt our approach."
        },
        {
            "text": "We know there’s no one size fits all solution to any problem. In our current programme, we have a local approach to how we allocate funding and support to social care which helps us have better insights into what’s going on in your area and how we can work together to implement technology."
        },
        {
            "heading": 2,
            "text": "A framework to level the field"
        },
        {
            "text": "We also know people working across the sector have a wide range of digital skills. For some people, just the mention of the word “digital” can fill them with dread whereas other people can’t get enough of tech and gadgets. With this in mind we have published a digital skills framework aimed at improving digital literacy across social care and health."
        },
        {
            "text": "The framework was developed with support from Skills for Care and with input from care providers and organisations across the social care and health sectors. The final version will soon be available online to support social care employers to plan staff training or for individuals to think about their own professional development."
        },
        {
            "text": "In our work with care providers, we still hear stories about how those early iPads are in use in care homes and it’s great to learn how their use has expanded beyond their original purpose. We’ve heard many examples of staff  using them to input electronic care plans and order medications online."
        },
        {
            "text": "Residents continue to use them to communicate with friends and family far away but one of the best stories I heard recently was of the care home where the iPad is used to manage the residents own TikTok channel and to monitor online views of their videos!"
        },
        {
            "heading": 2,
            "text": "A willingness to embrace the new"
        },
        {
            "text": "Over the past year, I have been incredibly impressed by the innovation I have seen in the sector and by the enthusiasm to adopt new approaches. More than half of CQC registered providers in the sector are now using electronic care planning solutions, with thousands having taken up funding available to implement one of our assured digital solutions."
        },
        {
            "text": "We want to make sure everyone has the opportunity to make the move away from paper and towards digital record keeping and we will continue to provide funding, which you can access through your ICS (integrated care system)."
        },
        {
            "text": "We’re also turning our attention towards how other technologies can support you in delivering high quality care, or support people to live independently at home for longer. Simple tools like iPads or even smart speakers have a place in helping to achieve this as well as more tailored solutions such as falls prevention technology. We’ll be sharing our plans for how providers can access our CareTech funding offer over the next few weeks."
        },
        {
            "text": "Lastly, we’re also working behind the scenes to launch a new website (which will be live later in the summer) to make it easier for you to find everything you need to benefit from the funding, training, and guidance available to support you take advantage of digital approaches."
        },
        {
            "text": "In the meantime, there’s more info about the funding and skills support available to providers or alternatively, you can email us at england.adultsocialcare@nhs.net."
        }
    ]
}