{
    "url": "https://deframedia.blog.gov.uk/2023/04/21/landowner-sentenced-to-12-months-in-prison-for-destruction-on-the-river-lugg-herefordshire/",
    "title": "Landowner sentenced to 12 months in prison for destruction on the River Lugg, Herefordshire",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Natural England",
        "Weekly stories"
    ],
    "pub_date": "2023-04-21T15:23:17+01:00",
    "content": [
        {
            "text": "There has been widespread coverage following the sentencing of a landowner for causing significant damage to the riverbed and habitats along the River Lugg in Herefordshire."
        },
        {
            "text": "The sentencing has been widely covered by national, regional and trade media, including: BBC, Sky News, The Guardian, The Times, Farmers Weekly, Hereford Times, BBC Radio 4 Farming Today."
        },
        {
            "text": "Mr Price was sentenced to 12 months in prison and ordered to pay costs of £600,000 for carrying out unconsented works along the riverbank which included dredging and bulldozing the riverbanks, removing trees and vegetation."
        },
        {
            "text": "Natural England and the Environment Agency led a joint investigation into the environmental harm caused by the work which persisted despite a Stop Notice. Mr Price’s actions were in breach of several regulations, including the Reduction and Prevention of Agricultural Diffuse Pollution, and operations specified within a Site of Special Scientific Interest."
        },
        {
            "text": "It’s estimated that fish, plants and native crayfish may take years to return to the river and mature trees will take decades to re-establish and provide shade cover to the river."
        },
        {
            "text": "Speaking after the verdict, Emma Johnson, Area Manager for Natural England said: "
        },
        {
            "text": "Martin Quine, Environment Agency Place Manager for Herefordshire added:   "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}