{
    "url": "https://hodigital.blog.gov.uk/2023/04/21/making-ethics-part-of-the-way-we-design-products-and-services/",
    "title": "Making ethics part of the way we design products and services",
    "authors": [
        "Sue Spevack, Interaction Designer",
        "Sarah Lombardi, Senior Content Designer"
    ],
    "categories": [
        "Continuous improvement",
        "User centred design"
    ],
    "pub_date": "2023-04-21T10:43:40+01:00",
    "content": [
        {
            "text": "At the Home Office we work on some of the most challenging and important government services. Our work helps to keep people safe and the country secure.  "
        },
        {
            "text": "This means that our designs can have a big impact on people's lives. "
        },
        {
            "text": "That’s why design ethics is so important. Design ethics is about being aware of how your designs can impact the welfare of people, society and the environment. It helps reduce the risk of causing harm. "
        },
        {
            "heading": 2,
            "text": "What we do as design ethics practice leads "
        },
        {
            "text": "We are practice leads in design ethics for the user-centred design community (UCD) at the Home Office. The UCD community has practice leads in a number of areas, including climate and sustainability, inclusion and prototyping. "
        },
        {
            "text": "Our aim is to raise awareness and develop materials that support designers and their teams to make informed ethical decisions in their work. "
        },
        {
            "text": "We’ve done that through: "
        },
        {
            "heading": 2,
            "text": "What ethical design means for us "
        },
        {
            "text": "Ethics can be very subjective. And there are multiple ways you can approach something ethically. This can sometimes make decision-making hard. "
        },
        {
            "text": "For example, what if your design improves a person’s personal life but it leads to increased digital pollution? "
        },
        {
            "text": "We want to help designers think, discuss and reflect on this in their teams. We won’t tell designers what is ethical, or what they should do.  "
        },
        {
            "text": "Rather than giving designers rules to follow, we want designers to be able to lead those conversations, find the unintended consequences of the design and decide what they and the team agree 'good' is. "
        },
        {
            "heading": 2,
            "text": "Creating a design ethics toolkit "
        },
        {
            "text": "Many of our designers work in time-constrained delivery teams. We wanted to make ethical designs easier for them to understand and apply at pace. We looked at existing resources, but they didn’t quite align to our needs.  "
        },
        {
            "text": "So we explored various ideas and decided that a design ethics toolkit - a central resource that designers can use whenever they need - would be a great way of doing this. "
        },
        {
            "text": "We felt that a toolkit would allow designers and their teams to collaborate in a space where they could explore, identify and raise their concerns. It would also give them the opportunity to gather other perspectives and provide a framework to work from.  "
        },
        {
            "text": "The toolkit includes: "
        },
        {
            "text": "Once we developed the toolkit, we held a workshop with designers to test a real design scenario to see how it was used.  "
        },
        {
            "text": "Feedback was positive, and it brought up some interesting conversations around what we can and cannot influence. We also found that designers needed the framework to be flexible. Designers may need to choose sections that suit their needs, and adjust it based on how much time they have, rather than having to do everything. "
        },
        {
            "heading": 2,
            "text": "Working across the Home Office on ethical decision-making "
        },
        {
            "text": "Ethical decision making isn’t something that only we and the UCD community are working on - this is part of a bigger effort across the Home Office. "
        },
        {
            "text": "In response to recommendation 17 of the Windrush Lessons Learned Review, the department has produced an ethical decision-making model. The model is there to help staff articulate and resolve difficult ethical issues. "
        },
        {
            "text": "Like our toolkit, it doesn’t tell you what you should do or provide a 'right answer'. It encourages critical thinking. "
        },
        {
            "text": "This model has formed the basis of our design ethics decision-making framework, included in the toolkit. We’ve worked closely with strategy and policy teams to make sure these 2 tools are aligned and we continue to share what we learn. "
        },
        {
            "heading": 2,
            "text": "Next steps: Iterating our toolkit and principles "
        },
        {
            "text": "Now that we’ve started to test the toolkit, the next steps are to learn from the toolkit and iterate it. "
        },
        {
            "text": "This includes our principles. The principles in the toolkit were created to support our existing standards, like the Service Standard and Civil Service Values.  "
        },
        {
            "text": "We’re currently working with the Home Office UCD community and the wider cross-government design ethics community to define a list of ethical principles that designers can use. "
        },
        {
            "text": "We’ll explore what those principles mean to us and how we’re going to apply and promote them. But more on that in another blog. "
        },
        {
            "heading": 2,
            "text": "Want to make an impact? "
        },
        {
            "text": "User-centred design at the Home Office is about designing our products and services in collaboration with the people who will use them. "
        },
        {
            "text": "The work we do to design government services is varied, exciting and challenging. "
        }
    ]
}