{
    "url": "https://environmentagency.blog.gov.uk/2023/04/21/the-scale-reveals-all-how-do-you-age-a-fish/",
    "title": "The scale reveals all: How do you age a fish?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity"
    ],
    "pub_date": "2023-04-21T09:31:37+00:00",
    "content": [
        {
            "text": "Conor McCormick, National Fisheries Laboratory (NFL) Ageing Officer"
        },
        {
            "text": "We all know that to age a tree, you count the rings, but have you ever wondered how to age a fish? Or perhaps how long different species can survive for, given the right conditions? Well it’s also a bit like ageing a tree, except you count specific rings on the fish’s scale."
        },
        {
            "text": "Fish ageing is one of the most important tools for understanding the performance of our fish populations. A quick look at the scale of a fish reveals a fascinating insight into its biology, behaviour, and life history, and helps fishery managers understand exactly what’s going on beneath the surface. Scale ageing is a rod licence funded service provided by our National Fisheries Laboratory in Brampton, which is also the place I am lucky enough to call my office!"
        },
        {
            "text": "As fish grow, their scales grow with them, laying down marks a bit like rings on a tree. At our lab, we can read these marks, opening a whole new world about every fish within the population. Taking scales from fish is harmless and lost scales will regrow allowing fish ageing to be applied to fisheries of all types and sizes, from salmon to carp and tench to tarpon. If you removed a scale sample from a fish and observed it under a microscope you would see numerous dark and light bands radiating out from the centre, or focus, of the scale. These dark bands are termed ‘circuli’ and it is the spacing between these circuli that we use to determine the age of a fish."
        },
        {
            "text": "During winter the spacing between the circuli is less due to slower growth of the fish, whereas in summer, the circuli are spaced further apart as the fish feeds and grows more quickly. By counting the winter bands of reduced growth, we can age the fish. Through further analysis of the circuli, we can also evaluate the growth of the fish throughout its life and pinpoint landmark events such as when it was stocked, spawning events, and in some cases, even where it has been to feed."
        },
        {
            "text": "Fish naturally lose scales during their life and with them goes the ability to read its life history. However, most scales remain in place and if we look at a scale that has been present on the fish its whole life, we can assess how old it is. As the years rack up it can become harder to accurately age a fish, but that’s where the skill and experience of the scientist comes in. Interestingly, fish size is not always a reliable indicator of age. We have aged 3lb perch at just 3 years old, and chub of 6lbs to both 11 years and 17 years."
        },
        {
            "text": "Competition within the watercourse"
        },
        {
            "text": "Fish ageing across populations can reveal competition between species and provide an indicator of how well a fishery is performing. Essentially, the growth rates we’re looking at can tell us how much food is available to fish. If fish are eating well, in healthy environments, they can grow well too – we have developed growth rate baselines that we use to compare the growth rate of fish populations across the country. If the population is slow growing or stunted it can suggest there isn’t enough food available, or something else is pressuring the fishery."
        },
        {
            "text": "Catch of the day – the story is in the scale"
        },
        {
            "text": "We are regularly sent scales from anglers and fisheries from notable and record fish, unusual species or to support catch data. We also work with groups to improve understanding of fish species, either in specific rivers or nationally. Through the years we have received scales of a 26lb 6oz brown trout from Eyebrook Reservoir which was over 11 years old and a record-breaking 100+ lb carp from France which was only 16 years old!"
        },
        {
            "text": "Stillwater Ageing Surveys and best management"
        },
        {
            "text": "Good fishery management is key to the performance of stillwater fisheries and the health of the fish they contain. However good management decisions depend on an understanding of the conditions in a fishery and the influence these have on fish. Stocking is often seen as a quick-fix solution to an underperforming fishery. However, in the case of an overpopulated water, the opposite is often true and cropping a water may be the best way to increase performance."
        },
        {
            "text": "An ageing survey can reveal valuable insights about a fishery, providing information on growth, recruitment and population structure; all vital when making informed management decisions. At the National Fish Lab, we provide stillwater fish ageing kits for fisheries and angling clubs to gain a better understanding of how fish are performing within their waters. The kit is free and contains everything needed to sample the fish, including a measuring tape, tweezers, scale packets, a step-by-step guide and even a prepaid envelope to return the scales to us. Once we receive the scales, we will then age the samples and provide a report of our findings. This service is there to help identify problems before they escalate and inform best management practise."
        },
        {
            "text": "If you are interested in knowing more about fish ageing, or know a fishery that needs help, management advice or assistance, please contact the National Customer Contact Centre on 03708 506 506 or at enquiries@environment-agency.gov.uk and ask for your local fisheries officer."
        },
        {
            "text": " "
        }
    ]
}