{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/04/21/when-experience-and-policy-creation-meet/",
    "title": "When experience and policy creation meet",
    "authors": [
        "Gavin Wilson"
    ],
    "categories": [
        "Care and support",
        "Our profession",
        "Research",
        "Viewpoint"
    ],
    "pub_date": "2023-04-21T15:07:13+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A day to remember"
        },
        {
            "text": "I still remember the excitement and anxiety heading into the Victoria Street office of DHSC for my first day. Life begins at the edge of your comfort zone and I felt excited by a new challenge to learn and adapt quickly."
        },
        {
            "text": "Would I fit in? For twelve years, I had worked mainly with health and social workers, professions which attract people who are caring, open minded, helpful and understanding. Would colleagues at DHSC be different?"
        },
        {
            "text": "I needn’t have worried. By the end of the first day, I had been warmly welcomed by analytical colleagues introducing me to the data and systems, my two line managers, whose doors were always open, and Lyn Romeo, Chief Social Worker for Adults, following a fortuitous meeting at the printers."
        },
        {
            "text": "I found there was an eagerness and openness to learn from those working in the field. Weekly presentations by external professionals were well attended, and a humble mantra of “you are the experts of your locality” and “tell us how we can improve your ability to deliver?” was present in interactions with external agents."
        },
        {
            "heading": 2,
            "text": "When theory met experience"
        },
        {
            "text": "DHSC is a complex organisation, working on so many different facets of health and social care at any one time. Policy and research are constantly in flux, which can be discombobulating. My advice to anyone starting is to just ask, everyone has been in the same situation."
        },
        {
            "text": "It’s also a great place to learn and develop. This role combined my great passion using analysis to discover relationships and patterns within data, with social care’s ability to improve people’s lives on a societal level. There was great scope for further developing my coding and analysis skills, which is where I want to be in the future."
        },
        {
            "text": "One unexpected benefit of the placement was working closely with policy colleagues as a team. Seeing how policy is carefully formed was insightful, and something most social workers would not experience every day, let alone influence."
        },
        {
            "heading": 2,
            "text": "Social work adds value to policy making"
        },
        {
            "text": "I would highly recommend those passionate about social work to seek these opportunities and see how the policies we work with every day come into being. DHSC isn’t a magic box where data goes in and policy pops out. It is made of people who care about society but have chosen a slightly different path to making that happen."
        },
        {
            "text": "Luckily, my analytical background in physics gave me that extra element to transition into this role. However, social workers have so many transferable skills: understanding legislation and how it works in practice, communication skills, partnership working, coordination, planning, ability to stay calm under stress, crisis management, which are all valued greatly in the department."
        }
    ]
}