{
    "url": "https://naturalengland.blog.gov.uk/2022/08/05/biodiversity-metric-milestone-defra-consultation-on-the-biodiversity-metric/",
    "title": "Biodiversity Metric Milestone - Defra consultation on the biodiversity metric",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity",
        "Licensing",
        "Natural England",
        "Uncategorized"
    ],
    "pub_date": "2022-08-05T12:39:04+01:00",
    "content": [
        {
            "text": "The Secretary of State has now launched an 8-week consultation on the Biodiversity Metric to be used for the purpose of calculating biodiversity net gain as required under the 2021 Environment Act[1]. The Biodiversity Metric is a key tool that supports the delivery of Biodiversity Net Gain (BNG). It is used to calculate the baseline biodiversity value of a site and forecast its future biodiversity value. The launch of this consultation is a key milestone in the countdown towards the commencement of mandatory BNG for Town and Country Planning Act developments in November 2023. The same requirement will come into force for developments under the 2008 Planning Act by the end of 2025."
        },
        {
            "text": "Natural England has played a critical role in the development of the metric which was first launched by Defra in 2012 and was partly based upon work undertaken by Bill Butcher and Jo Treweek. Since then, Natural England has worked with others within Government and with external stakeholders and partners, to further develop and refine the Metric. In 2019 we launched version 2.0 of the metric, followed two years later by version 3.0. In April we released Biodiversity Metric version 3.1 and subsequently recommended to Defra that it become the metric to be used to underpin mandatory biodiversity net gain. Alongside the release of Biodiversity Metric 3.1 we released a streamlined version of the metric developed for use on small development sites, called the Small Sites Metric. These two metrics are now being formally consulted on ahead of the publication of, what will become, the Secretary of State’s officially sanctioned biodiversity metric(s) to be used for mandatory BNG."
        },
        {
            "text": "We are expecting that the final version of these two metrics, the full Secretary of State metric and the Small Sites Metric, will be published later this year. The intention is that these two metrics will then remain stable and unchanged for a period of between 3 and 5 years. This will provide certainty and consistency for all metric users. However, any metric needs to evolve and develop over time in response to new knowledge, science and technology. This will be the case with the Biodiversity Metric. Natural England will continue to work behind the scenes, together with Defra group colleagues, metric users and other interested parties, on future metric updates and developments. Based on this work, users experience of the metric and our own evaluation of its impact and performance, we will make periodic recommendations to the Secretary of State about ways the metric could be further developed or improved. This could include the values and multipliers within the metric, the scope and content of the metric and the platform on which it is based. Any substantive change to the metric will be subject to additional consultations before adoption. In short, this is the start of the metric journey, not its end."
        },
        {
            "text": "However, it is important to remember that, just as BNG is more than just a number, so the metric is just one tool and component of BNG. Work on other elements of the BNG system continues apace. This includes finalising the Biodiversity Gain Plan, the build and testing of the net gain register and credit sales platform (if you would like to help us test these, please register your interest here), the establishment of the monitoring, reporting and enforcement elements of BNG and the production and dissemination of guidance. Incidentally, for a useful primer on BNG please see our previously published BNG Brochure."
        },
        {
            "text": "November 2023, the start of mandatory BNG, is fast approaching. There is still work to do. However, the publication of this consultation on the Biodiversity Metric that will underpin and inform all calculations for mandatory BNG is an important milestone. Please do share your thoughts and views and continue to help shape the future of BNG."
        },
        {
            "heading": 5,
            "text": "[1] See Schedule 14 – Part 1 section 3.4 (4) - Before publishing or republishing the biodiversity metric the Secretary of State must consult such persons as the Secretary of State considers appropriate."
        }
    ]
}