{
    "url": "https://nationalscreening.blog.gov.uk/2022/08/05/bursaries-available-for-popular-health-screening-course/",
    "title": "Bursaries available for popular health screening course",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-08-05T09:14:56+01:00",
    "content": [
        {
            "text": "We are very pleased to announce that we are able to offer a small number of bursaries to study the ever-popular health screening module run at the University of Warwick."
        },
        {
            "text": "The UK National Screening Committee (UK NSC) – which is housed within the Office for Health Improvement and Disparities (OHID) – is committed to widening accessibility of education and training around screening for all its stakeholders."
        },
        {
            "text": "Applications for this year's module, which will run from Monday 14 to Friday 18 November, will be scored against criteria including the applicant's role and their involvement in screening."
        },
        {
            "text": "Applicants for the bursary will also need to apply direct to the University of Warwick for a place on the course. Options for accommodation are available from the Warwick team."
        },
        {
            "heading": 2,
            "text": "More about the module"
        },
        {
            "text": "The health screening module is ideal to enhance professional development, knowledge of screening or to study as part of an overall MSc programme. It is run by the University of Warwick Medical School and taught at masters level (20 CAT points)."
        },
        {
            "text": "Covering the underlying epidemiological principles, as well as ethics and policy issues, it will help those who commission, run or evaluate screening programmes locally and nationally, as well as helping those interested in policy and practice in population screening to understand the important issues."
        },
        {
            "text": "The course is designed for health professionals, commissioners, policy makers, screening stakeholders, public health students and staff working in screening programmes."
        },
        {
            "text": "It aims to provide an understanding of screening from a population perspective and looks at how to determine when screening is an appropriate intervention, through the analysis of evidence, ethical, performance and economic issues, and how screening programmes can be effectively monitored and improved."
        },
        {
            "text": "The module is taught as a 5-day intensive study block that includes lectures, group work and supervision. The teaching and learning style is interactive, drawing on both the expert teachers from Warwick Medical School and the UK NSC."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}