{
    "url": "https://stratcommand.blog.gov.uk/2022/08/05/cyber-insider-meet-ellie/",
    "title": "Cyber Insider: Meet Ellie",
    "authors": [
        "joshuabamford"
    ],
    "categories": [
        "Careers",
        "Cyber",
        "Personnel",
        "Technology",
        "Training"
    ],
    "pub_date": "2022-08-05T13:16:24+01:00",
    "content": [
        {
            "text": "The National Cyber Force (NCF). A partnership between Defence and Intelligence, and an organisation shrouded in mystery and intrigue. Working closely with the NCF, we look at what prompted one employee to begin their career in cyber, the steps they took to get there and ultimately why, in their eyes, a career in the cyber domain is one worth pursuing."
        },
        {
            "text": "Meet “Ellie”, whose career in the NCF is the result of a chance encounter during her exams. We should point out that Ellie isn’t her real name, and that it has been changed for security reasons, the story of how she entered the world of cyber however, is true."
        },
        {
            "text": "Ellie continues by saying:"
        },
        {
            "text": "It probably won’t come as a surprise to many that a career in cyber starts with a passion for its core subjects. By studying both science and maths Ellie opened herself up to opportunities after school which then tailored themselves to a career in the cyber domain."
        },
        {
            "text": "The GCHQ Apprenticeship scheme is a three-year programme open to school leavers that balances a full-time role alongside a university degree. Combining the qualification in cyber security with valuable work experience, the scheme acts as a perfect gateway into a career in the cyber domain. With placement opportunities offered throughout, it was through one of these that Ellie found the NCF:"
        },
        {
            "text": "As the old adage goes, “good things come to those that wait,” and this is certainly true in Ellie’s case. Enjoying her experience at NCF so much, she opted to come back for her first permanent position. Explaining the thinking behind the decision, Ellie says:"
        },
        {
            "text": "It’s this contribution to national security and playing an active role in the bigger picture of UK Defence, that fuels Ellie’s passion for working in NCF. Add to this the opportunities to continue self-development and growth and you get an understanding of what drove Ellie to return:"
        },
        {
            "text": "The opportunity to develop and utilise past experiences isn’t perhaps something we immediately associate with a career in the cyber domain. In her current role, Ellie has the chance to be involved in outreach programmes with schools, women in engineering, science, and technology festivals, and Equality, Diversity, and Inclusion initiatives which she says all contribute to her development."
        },
        {
            "text": "At this point, you may be thinking to yourself: “This all sounds great, but you have to be genius to work in cyber – there must be some seriously difficult entry requirements?” But, while it helps to have a grasp of maths and science, Ellie say’s there aren’t any specific requirements needed for a career in the NCF:"
        },
        {
            "text": "However, Ellie argues there are definitely things you can be doing to give yourself a head start:"
        },
        {
            "text": "It’s clear from our time speaking to Ellie that a career in cyber, and in particular working in the NCF, is more than just coding."
        },
        {
            "text": "It’s a working environment where you’re able to grow and develop whilst making a difference and contributing to the security of the United Kingdom."
        },
        {
            "text": "How many career paths can say the same?"
        },
        {
            "text": "If you, or someone you know, is interested in pursuing a career in Intelligence visit the GCHQ Careers page to discover the perfect role for you, regardless of your background. Alternatively why not try out some of their puzzles and brain teasers to find out if you have what it takes."
        }
    ]
}