{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/08/05/enabling-networks/",
    "title": "Enabling Networks",
    "authors": [
        "Lucy Hurford"
    ],
    "categories": [
        "Talent & Leadership"
    ],
    "pub_date": "2022-08-05T18:01:38+01:00",
    "content": [
        {
            "text": "Networking is a crucial skill for scientists and engineers in government, who need to collaborate widely to effectively perform public duties. However, networking can be a daunting prospect, with many factors influencing how comfortable we might feel when networking."
        },
        {
            "text": "Lucy and Rohan joined the Fast Stream in 2021 and were slightly intimidated by the heavy emphasis on the importance of networking. Realising that they weren’t alone in feeling overwhelmed at the prospect of networking, Lucy and Rohan spoke to 30 senior civil servants (SCS) working in STEM (science, technology, engineering and maths) roles from 15 departments, to draw upon their lived experiences of networking and try to level the playing field when it comes to networking skills. These conversations were used to write an article filled with information about the importance of networking, and top tips for how to network confidently and successfully."
        },
        {
            "text": "What does the Enabling Networks article include?"
        },
        {
            "text": "The SCS interviewed emphasised that as a scientist or engineer, it is invaluable to have a network that contains colleagues who also have expertise in STEM fields, because science is most effective when it is done in collaboration. Having a multidisciplinary scientific network allows you to more easily connect science from seemingly disparate areas. A good network contains colleagues from other professions, as effectively utilising in Government requires an understanding of the non-scientific structures and processes, and input from colleagues who specialise in these areas, such as commercial, finance, and HR. Individuals from all professions will have interesting insights that might not be initially obvious to scientists and engineers, and it is important to make sure your network does not become too siloed."
        },
        {
            "text": "You can find the full article Final Enabling Networks Article (new pdf), or email scienceandtechnologynetwork@faststream.civilservice.gov.uk."
        },
        {
            "text": "About the authors:"
        },
        {
            "text": "Lucy is a Science and Engineering Fast Streamer, with a background in Biology, who currently works in the Home Office in Forensic Science Regulation. Rohan is a Generalist Fast Streamer, with a background in Politics, Philosophy and Economics, who now works in the Department for Work and Pensions on Work and Health."
        },
        {
            "text": " "
        }
    ]
}