{
    "url": "https://environmentagency.blog.gov.uk/2022/08/05/environment-agency-taking-action-during-prolonged-dry-weather/",
    "title": "Environment Agency taking action during prolonged dry weather",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-08-05T14:59:06+00:00",
    "content": [
        {
            "text": "The Met Office confirmed that last month was the driest July in England since 1935. But it was the hot, dry summer of 1976 that came to mind for many during July’s heatwave, when water supplies were at their lowest on record following a dry 1975."
        },
        {
            "text": "Are we facing the same position now? No, we are in a much better position than in 1976. While Southern Water and Southeast Water are imposing Temporary Use bans (more commonly known as hosepipe bans) we aren’t expecting the use of standpipes or other extreme measures seen in 1976."
        },
        {
            "text": "There are two main differences. The 1976 drought was preceded by a dry year while 2021 was normal in terms of rainfall. The other difference is despite England having a much larger population now, and higher personal water consumption, water companies have been required to invest in better resilience to drought. Water companies are now able to get through a drought like 1975-76 without the need for extreme restrictions (such as standpipes and rota cuts). We are better prepared as water companies have drought plans that set out the actions, they will take to make maximum use of available water as a drought develops, and long-term water resources management plans to increase resilience."
        },
        {
            "text": "A question we often get is whether we can define a drought. We don’t use a single definition for drought so whilst it’s caused by a period of low rainfall, the nature, timing and impacts on people, the environment, agriculture or business will vary. Some droughts are short and intense like a hot, dry summer, while others are long and take time to develop over multiple seasons. The National Drought Group, chaired by the Agency, advises on the impacts seen or anticipated and the actions needed by all sectors to play their part. The Environment Agency decides whether it is helpful to signal a drought or severe drought."
        },
        {
            "text": "We use four stages to describe and manage our response:"
        },
        {
            "text": "As of the first week in August, most of England is in the prolonged dry weather stage. You can find our latest weekly rainfall and river flow stats here. Should this dry weather picture continue, many parts of England will move into drought. This change in status is mainly a classification indicating seriousness, rather than requiring different action. The triggers that influence action and escalation include the hydrological position (including rainfall, river flows, groundwater levels, reservoir levels, soil moisture), as well as the impacts on public water supply, abstractors (including farmers) and on the environment."
        },
        {
            "text": "With most of the country in prolonged dry weather, the Environment Agency has been taking action."
        },
        {
            "text": "Monitoring"
        },
        {
            "text": "We need to know the latest position on water resources e.g. river flow, groundwater depth during the response to dry weather. The Environment Agency regularly collects most of this information routinely, but we have started to increase our monitoring. Accurate data on river levels and flows are vital to ensure the correct regulatory decisions are made and through July and August we have deployed more people to do spot checks at priority sites and locations. In East Anglia we are now increasing our surveys of invertebrates so we can better inform and manage the impacts of dry weather."
        },
        {
            "text": "Regulation "
        },
        {
            "text": "With low water levels, it is important we are checking those abstracting water are complying with their licences and not taking more, resulting in harm to the environment or taking water from other abstractors."
        },
        {
            "text": "We are working closely with water companies to ensure statutory drought plans are followed. Already, many water companies have enacted their drought plans and taken precautionary steps to conserve supplies such as Southern Water’s and Southeast Water’s introduction of Temporary Use Bans."
        },
        {
            "text": "Incident response "
        },
        {
            "text": "We are responding to specific environmental incidents caused by low river flows. In many cases fish may be distressed due to low oxygen levels and the Environment Agency will oxygenate the water or move the fish."
        },
        {
            "text": "We have applied to the Secretary of State for a drought order allowing us to abstract more water to protect environmental needs at Holme Styles Reservoir (not a public water supply reservoir and owned by Yorkshire Water)."
        },
        {
            "text": "Supporting river flows and transfers of water"
        },
        {
            "text": "We are now operating several of our own water transfer schemes - moving water around locally to support environmental flows and abstraction for public water supply, agriculture, and industry. One example of these schemes is the River Severn Regulation, which is protecting the river and the estuary from damage resulting from low flows. We have been managing the flows for nearly 60 days by releasing water from Clywedog Reservoir, Lake Vyrnwy and the Shropshire Groundwater Scheme."
        },
        {
            "text": "In East Anglia we are supporting a number of important rivers with water taken from groundwater sources. We are also working closely with the local Internal Drainage Boards and other partners to reduce the impact of low rainfall and share water across sectors."
        },
        {
            "text": "Navigation"
        },
        {
            "text": "Low water levels have impacted on the Agency’s navigation. We have received reports of boats grounding in East Anglia. The River Stour is impassable at points due to a build-up of duckweed. In Lincs and Northants, we are monitoring the levels in the Nene to maintain navigation. We have received reports of low flows affecting navigation and house boats at level-sensitive locations along the Thames."
        },
        {
            "text": "Supporting farmers"
        },
        {
            "text": "We are working closely with farmers and the NFU. Following the recent National Drought Group, we announced a package of measures to assist farmers which includes water trading between farmers in catchments to help reduce water usage, as well as the ability to abstract additional water where it doesn’t harm the environment."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "On 26 July the EA convened the National Drought Group, made up of representatives from water companies, Defra, Natural England, the NFU and other key partners. The Group will meet again on 12 August to continue to ensure we act together to reduce the consequences of prolonged dry weather."
        },
        {
            "text": "Please find our weekly water situation reports on gov.uk here."
        },
        {
            "text": "Please play your part by using water wisely."
        },
        {
            "text": "In our next blog, we will focus on our incident response activities including reports of fish in distress due to low flows and fish rescues."
        }
    ]
}