{
    "url": "https://beisdigital.blog.gov.uk/2022/08/05/making-learning-part-of-the-job-at-beis-digital/",
    "title": "Making learning part of the job at BEIS Digital",
    "authors": [
        "Ashley Justins"
    ],
    "categories": [
        "Capability",
        "People and skills"
    ],
    "pub_date": "2022-08-05T15:00:24+00:00",
    "content": [
        {
            "text": "\nWhen I joined the Civil Service, I, like most people I’m sure, thought that learning and development was something you had to fit around your work on Civil Service Learning (CSL). That’s the website that provides learning and development courses for civil servants."
        },
        {
            "text": "Don’t get me wrong, CSL is a great tool! It’s a tried and tested learning website that reflects the requirements of working in the Civil Service, and all civil servants will use it as part of their career."
        },
        {
            "text": "It includes traditional subject areas such as policymaking, communication and personal effectiveness, and topics like remote leadership and data analytics."
        },
        {
            "text": "I’ve found that learning and development for our digital team needs to go beyond online courses."
        },
        {
            "heading": 2,
            "text": "Why is learning so important in BEIS?"
        },
        {
            "text": "As People and Development Manager, I want to make sure BEIS Digital has a learning culture that is embedded in every individual, each team, and across BEIS Digital."
        },
        {
            "text": "I encourage everyone to find courses that interest them. Learning needs are personal to each of us and I want the team to take ownership of their personal development by seeking out learning and development opportunities."
        },
        {
            "text": "We are committed to staff being able to dedicate 20% of their working hours to learning. That means we stay up to date with advances in the digital profession as well as being able to retrain into other roles within the Digital, Data and Technology (DDaT) Profession."
        },
        {
            "text": "The benefits of developing and embedding a learning culture at BEIS are that:"
        },
        {
            "heading": 2,
            "text": "Learning in a way that suits us"
        },
        {
            "text": "BEIS Digital looks for diverse ways of learning to offer our staff, whether that is virtual or more traditional learning methods such as digital apprenticeships, mentoring, and coaching."
        },
        {
            "text": "We’ve set up virtual Learning Socials once a month to learn how to use new technology platforms such as Pluralsight and CITF. I encourage everyone to meet regularly with their line managers to review training completed and to discuss new training requirements."
        },
        {
            "text": "Rather than being all done in the same way, our learning and development:"
        },
        {
            "text": "BEIS Digital is committed to making sure that learning is inclusive to everyone in the Directorate and that everyone can develop themselves in their roles."
        },
        {
            "heading": 2,
            "text": "It’s not just BEIS - we’re part of a digital profession"
        },
        {
            "text": "BEIS Digital aligns its training against the government-wide DDaT profession so we offer everyone the training they need to stay up to date with advances in our profession in each role, move up to the next level, and move into other roles."
        },
        {
            "text": "For example: if you are a Software Developer you will be given tailored training that will develop the technical skills you need to build digital products and guide you through the learning milestones that you need to progress in your career."
        },
        {
            "heading": 2,
            "text": "Developing in our jobs"
        },
        {
            "text": "Offering quality learning and development means organisations can capture and develop engaged, inspired and skilled digital staff. Hiring new staff is expensive and time consuming, especially in the current market of ever-increasing competition for digital skills."
        },
        {
            "text": "Offering a wide range of highly specialist and bespoke training to enable continuous development and progression is by far the most significant thing we do at BEIS to retain our highly valued staff."
        },
        {
            "text": "Learning at BEIS is part of the job, it fits what you need and comfortably slots into your day."
        },
        {
            "text": "You can stay up-to-date with the latest developments by signing up for email alerts or by following us on Twitter."
        }
    ]
}