{
    "url": "https://deframedia.blog.gov.uk/2022/08/05/woodlands-expanded-for-communities-across-england/",
    "title": "Woodlands expanded for communities across England",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-08-05T16:19:06+01:00",
    "content": [
        {
            "text": "There has been widespread coverage today in the Daily Telegraph, the Metro, Yorkshire Post, The Mail, and Cumberland News & Star of major new funding for Community Forests and other woodland creation partners to plant trees across England."
        },
        {
            "text": "The £44.2 million of funding will support the creation of larger and more diverse woodlands which will be more resilient to climate change, and extreme weather events such as wildfires and storms."
        },
        {
            "text": "Around 2,300 hectares of trees – equivalent to around 3,220 football pitches – will be planted, which will see approximately 600,000 tonnes of carbon dioxide absorbed by 2050. This commitment will contribute to trebling tree planting rates in England by the end of this Parliament, as well as contributing towards wider efforts to achieve Net Zero by 2050."
        },
        {
            "text": "The funding will also be used to create more green jobs within the forestry sector, providing new opportunities for local communities to access nature and creating more places for nature and biodiversity to thrive."
        },
        {
            "text": "Lord Zac Goldsmith, Forestry Minister, said:"
        },
        {
            "text": "“Our economies, livelihoods and wellbeing all rely on nature."
        },
        {
            "text": "“As well as tackling the impacts of climate change and biodiversity loss, this significant funding will create diverse treescapes across the country and improve the health and wellbeing of local communities by giving them more opportunities to enjoy nature on their doorstep."
        },
        {
            "text": "Sir William Worsley, Forestry Commission Chair, said:"
        },
        {
            "text": "“The social, environmental and economic benefits of being in woodlands are well-documented, helping local communities to be happier, healthier and more pleasant places to live."
        },
        {
            "text": "“It is a personal mission of mine to make sure as many people as possible get to experience these benefits. This funding will ensure we plant trees in areas close to where people live, as well as providing job opportunities in new woodland creation through planting, establishing and managing trees.”"
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}