{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/08/15/gse-profession-talent-strategy-and-action-plan/",
    "title": "GSE Profession Talent Strategy and Action Plan",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Offer",
        "Talent & Leadership"
    ],
    "pub_date": "2022-08-15T16:33:54+01:00",
    "content": [
        {
            "text": "The GSE Profession has provided more details about our approach to supporting GSE members to progress their careers.  The Talent Strategy and action plan builds on the goals and objectives set out in the GSE Profession Strategy 2021.  "
        },
        {
            "text": "The strategy and action plan has been developed through wide consultation with GSE members, our members’ talent forum, other government professions and stakeholders. It aligns with HR best practice, setting out the profession’s aim for growing science and engineering talent.  "
        },
        {
            "text": "This is an inclusive strategy, recognising that GSE members come from a diversity of science and engineering backgrounds and have different needs in terms of career support.  "
        },
        {
            "text": "Actions in the plan cover the range of GSE members, from those at early career, mid-career stages and those from Civil Service corporate talent schemes. The Talent Strategy wording also reflects that career aspirations in GSE can differ, covering career pathways towards GSE senior leadership and towards senior specialist roles.   Finally, the strategy interlinks with other GSE Profession Strategy strands to support members’ career development, for example through the GSE Recognition offer which supports those working towards chartered membership.  "
        },
        {
            "text": "  "
        },
        {
            "text": "GSE Profession talent approach "
        },
        {
            "text": "   "
        },
        {
            "text": "GSE Profession members are encouraged to read the GSE Talent Strategy and to reach out to their departmental Head of Science and Engineering Profession team to discover what career development opportunities are available to them.    "
        },
        {
            "text": " "
        },
        {
            "text": "“The GSE Talent Strategy has benefited from a diverse range of perspectives including those from the GSE Diversity and Inclusion Action Group. This means that the strategy sets out clear actions for how people from a wide range of backgrounds and expertise will be able to thrive in the GSE Profession and deliver the scientific expertise needed by Government.”  "
        },
        {
            "text": "Kirsty, GSE and Diversity and Inclusion Action Group member "
        },
        {
            "text": "“As a community, as a country, and as individuals, it’s crucial for us all to develop our science and engineering skills. This investment equips and inspires us to imagine, investigate, plan, lead, and create the future we want. I look forward to the continued implementation and development of our GSE talent work. Best of all, we will be sharing great ideas, work, and expertise with a like-minded community of people.” "
        },
        {
            "text": "Robin, GSE member and Patent Examiner, Intellectual Property Office.  "
        }
    ]
}