{
    "url": "https://civilservice.blog.gov.uk/2022/08/15/harnessing-the-power-of-science-engineering-and-technology/",
    "title": "Harnessing the power of science, engineering and technology",
    "authors": [
        "Lord Browne"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-08-15T10:01:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Lord Browne of Madingley, Co-Chair of the Prime Minister’s Council for Science and Technology, former CEO of BP and Co-Founder and Chairman of BeyondNetZero, discusses his experience as a business leader now advising government. "
        },
        {
            "text": "The Prime Minister’s Council for Science and Technology (CST) brings together the UK’s leaders in science, engineering and technology to provide independent advice to the Prime Minister on how developments in their fields of expertise can create better outcomes for society. I co-chair CST with Sir Patrick Vallance, the Government’s Chief Scientific Adviser. "
        },
        {
            "text": "We focus our work on what is needed to incentivise scientific and engineering breakthroughs and develop them for the benefit of the nation. We are focused on driving productivity and hence economic growth. "
        },
        {
            "text": "Great discoveries underpin the UK’s intellectual prowess. But that’s not enough. I’ve always believed that discoveries made in all fields of human endeavour, spanning philosophy to medicine, must be harnessed to improve our society’s civilisation and the way we live. "
        },
        {
            "text": "Advice on national goals "
        },
        {
            "text": "We need business, commerce and industry to invest even more in research and innovation in the UK. Government is investing an increasing amount of money in research and innovation, but this needs to enable the private sector to invest with greater certainty.  "
        },
        {
            "text": "Need to change"
        },
        {
            "text": "The Industrial Revolution of this century will be far bigger than the first one of the 19th Century. We need to change all aspects of the supply of energy, goods and services as well as consumer demand if we are to meet the goal of net zero greenhouse gas emissions by 2050. And to secure economic growth, we need to apply innovation to all aspects of productivity. We will be helped by many yet immature industries, such as those coming from the application of quantum computing or engineering biology. And we will need to get the right skills in place. "
        },
        {
            "text": "All these issues form a considerable agenda of policy and implementation, challenges which CST considers. The success of these policies will be dependent on action across the whole of society and the government’s ability to get business and industry to have the confidence to invest, including into research and innovation. CST’s advice needs to focus on what government can do to encourage a range of actors to deliver."
        },
        {
            "text": "Integrating ideas"
        },
        {
            "text": "In my experience, as businesses grow, an enormous effort is needed to ensure that everyone aligns to the values, purpose and strategy of an enterprise. Seamless integration usually leads to a winning result. That challenge is greatly magnified when it comes to government; strategies are influenced by political considerations, and measurements of achievement are more difficult to specify. "
        },
        {
            "text": "Extra effort is therefore needed to maintain alignment. That is why the recent establishment of the Cabinet-level National Science and Technology Council is so important. It not only catalyses integration but also demonstrates the importance attached to science, engineering and technology in shaping the future of the nation. We regularly meet with the Prime Minister and other Cabinet members to ensure that we are aligned on strategy and their priorities and policies. "
        },
        {
            "text": "Ambition"
        },
        {
            "text": "My ambition in taking my role was to support greater coordination between government policy, academic research and industrial, business and financial activity – to focus all parts of the science, engineering and technology system on implementing the new industrial revolution needed to make our society sustainable."
        },
        {
            "text": "Break down silos"
        },
        {
            "text": "For example, we should work further to break down silos by encouraging and enabling people to rotate from the Civil Service into industry and finance, and from industry and finance into the Civil Service. It can only be a good thing for officials to see how things work in business, and for those who work in industry to better understand the constraints of implementing policy. We tried this with some success during my time at BP. There are lots of arrangements around career path management, compensation and pensions which need sorting out to make this work. And why stop with just this; it would be a great step to include more expertise from academia."
        },
        {
            "text": "We are all committed to writing the next chapter in the nations’ book on the future. We want to help create a society in which there are no limits to improving the world. And that means effective deployment of science, engineering and technology will inspire more people to create our common future. "
        }
    ]
}