{
    "url": "https://deframedia.blog.gov.uk/2022/08/15/minister-double-water-companies-must-do-more-to-reduce-leakage/",
    "title": "Minister Double: Water companies must do more to reduce leakage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2022-08-15T17:15:51+01:00",
    "content": [
        {
            "text": "There has been positive pick-up of Water Minister Steve Double’s calls for greater investment from water companies to address leakage, at a time when water resources are in the spotlight as parts of the country move into drought. Writing for the Mail on Sunday, Minister Double reaffirmed that the Government will not hesitate to act if leaks are not addressed, with reports that somewhere between 15-20% is lost annually through leakage."
        },
        {
            "text": "His comments were picked up by The Daily Express and The Sun, who highlighted his calls for water companies to prioritise customers and not shareholder returns."
        },
        {
            "text": "It comes as Environment Secretary George Eustice, writing for The Daily Telegraph, also called on water companies to reduce leakage, highlighting that they have a duty to ensure supplies. He added that we will continue to challenge those with a poor record on leakage and work to ensure new infrastructure such as reservoirs and water transfers are constructed."
        },
        {
            "text": "Water Minister Steve Double said: "
        },
        {
            "text": "The Strategic Policy Statement for Ofwat sets out the Government’s priorities for water companies which includes reducing leakage across the water network."
        },
        {
            "text": "Water companies have already committed to delivering a 50% reduction in leakage from 2017 to 2018 levels by 2050 and we expect Ofwat to challenge companies to deliver this and monitor progress."
        },
        {
            "text": "In addition to its own sector targets, water companies will need to contribute to delivery of Defra’s proposed Water Demand Target under the Environment Act 2021 to reduce the use of public water supply per person in England by 20% by 2037. This includes a 31.3% reduction in leakage by 2037 on the pathway to meet their 50% reduction in leakage commitment by 2050."
        },
        {
            "text": "The government will continue to take action to build the resilience of our water environment and the sectors that depend on it, however we must all play our part not to waste water and treat it as the precious resource it is."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}