{
    "url": "https://grantscommunity.blog.gov.uk/2022/08/15/share-your-experience-of-find-a-grant-with-us-please/",
    "title": "Share your experience of Find a Grant with us, please",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Civil Service",
        "Digital transformation",
        "Evaluation",
        "Government Grants Management Function",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2022-08-15T15:56:25+01:00",
    "content": [
        {
            "text": "Back at the end of 2021, when an online, one-stop shop for government grants was just a twinkle in our eyes, our ambition was that the pilot Find a Grant service would feature a very small sample of grants. "
        },
        {
            "text": "Just to prove the concept, we needed at least 10 grants to test features and functions and, if we could get the interest, we wanted about 30 people to put the service through its paces."
        },
        {
            "text": "Well, we have been live for just 16 weeks. And, since we launched Find a Grant on GOV.UK in mid-April, we have listed almost 70 government grants, valuing over £2bn, from across the government. "
        },
        {
            "text": "Plus, we are fast approaching our 20,000th person to have used the pilot service, with almost 1,000 people clicking on ‘apply’ to start a grant application.  "
        },
        {
            "text": "We have been blown away, to be honest."
        },
        {
            "text": "The anecdotal feedback - and what we are hearing through our co-creation and user research sessions - is overwhelmingly positive. "
        },
        {
            "text": "Comments like:  “A great initiative and an absolutely essential tool, if it can bring together all UK government grant and incentive programmes in one place.”"
        },
        {
            "heading": 2,
            "text": "But is it what you want?"
        },
        {
            "text": "Frankly, we are staggered by the amount of support and interest in the pilot service. But we want - and need - to have quantifiable evidence to really evaluate the service. So what do you want?"
        },
        {
            "text": "We want to find out what prospective applicants - including you - think and feel about Find a Grant, to inform the evaluation of the service and support our recommendation to roll it out across all government grants."
        },
        {
            "heading": 2,
            "text": "Can you take 5?"
        },
        {
            "text": "If you have 5 mins, would you complete this survey, please? And, if you haven’t used Find a Grant as yet, you can check it out here. "
        },
        {
            "heading": 2,
            "text": "The more the merrier"
        },
        {
            "text": "We really want to build a robust evidence base on which to make our recommendations for the future. So apart from completing the survey yourself, we’d welcome you sharing it far and wide. "
        },
        {
            "text": "We want to get the experience of any prospective applicants - individuals, businesses, voluntary organisations, community organisations, social enterprises.  "
        },
        {
            "text": "So, if you could also share this survey via your networks and on your social media channels that would be seriously helpful too. "
        },
        {
            "heading": 2,
            "text": "After Find, then Apply"
        },
        {
            "text": "Thank you to those of you who have been supporting and co-creating the new, additional Apply for a Grant service with us over the last few weeks. "
        },
        {
            "text": "We are on track with its development and are aiming to have this pilot available - again starting with a small sample of grants - in September. "
        },
        {
            "text": "We will let you know when it is up and running and all its new features and functions. "
        },
        {
            "text": "But, as a recap of what we are focusing on, you can read our recent blog here."
        },
        {
            "text": "And, please,do let us know what you think of Find a Grant. "
        },
        {
            "text": " "
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Applicant Programme"
        }
    ]
}