{
    "url": "https://deframedia.blog.gov.uk/2022/12/28/defra-introduces-new-powers-to-crack-down-on-illegal-tree-felling/",
    "title": "New powers introduced to crack down on illegal tree felling",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2022-12-28T10:56:02+00:00",
    "content": [
        {
            "text": "There has been widespread coverage in the Times, i News, Guardian, the Daily Express, Daily Mail and the Western Morning News of new powers introduced to curb illegal tree felling."
        },
        {
            "text": "Illegal tree felling can cause irreparable harm to our forests, damage wildlife habitats and negatively impact local communities. Our network of woodlands are key harbourers of carbon which are essential to tackle climate change and achieve net zero goals."
        },
        {
            "text": "As part of the Environment Act, the changes to the Forestry Act 1967 will deliver more proportionate, impactful and enduring enforcement options against those who fell trees illegally to protect our forests for future generations."
        },
        {
            "text": "The package of measures includes unlimited fines for those felling trees without a licence and possible prison sentences for offenders. Additionally, Restocking Notices and Enforcement Notices will be listed on the Land Charges Register which could reduce the land’s value."
        },
        {
            "text": "Forestry Minister Trudy Harrison said:"
        },
        {
            "text": "“Felling trees without a licence is illegal and can cause irreparable harm - scarring landscapes, damaging habitats for wildlife, and causing distress for local communities."
        },
        {
            "text": "“These robust measures, implemented as part of our world-leading Environment Act, empower the Forestry Commission to tackle the issue head-on with unlimited fines and custodial sentences for the worst offenders."
        },
        {
            "text": "“Today’s announcement demonstrates this Government’s commitment to protecting our precious trees, which are at the forefront of our efforts to bend the curve of biodiversity loss, tackle climate change and achieve net zero.”"
        },
        {
            "text": "Forestry Commission Chief Executive Richard Stanford said:"
        },
        {
            "text": "“I am very pleased to see these new powers written into law; as we expand the numbers of trees in England, we must end the blight of illegal tree felling."
        },
        {
            "text": "“Legal tree felling is part of normal forest operations and essential to ensure a sustainable timber supply and these areas are restocked with new trees. The Forestry Commission will not hesitate to investigate allegations of illegal tree felling. Once reported, our top priority is to make sure the harm caused by the felling is put right by ensuring trees are replanted wherever possible. In cases which merit it, we will always seek prosecution."
        },
        {
            "text": "“These new powers will hit people where it hurts – in their wallets. By guaranteeing that illegal felling is no longer a financially viable option for offenders, these measures are a significant step forward in the fight against this offence and will help in our endeavours to fight the climate emergency and nature crisis.”"
        },
        {
            "text": "Abi Bunker, Director of Conservation and External Affairs, Woodland Trust said:"
        },
        {
            "text": "“This is a welcome announcement which should strengthen protection for trees in England. These changes should send a clear message that felling trees illegally, for example prior to submitting development proposals, will not be tolerated, and that the penalties reflect the value and many benefits trees bring to our towns and cities. It is important that this is backed by increased resources for the organisations that deal with the enforcement of illegal felling. We hope this is a step towards better protection of trees and recognising and protecting our oldest trees as essential parts of our heritage and the most important for climate and nature.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}