{
    "url": "https://dwpdigital.blog.gov.uk/2022/12/15/accessibility-starts-with-an-organisations-culture/",
    "title": "Accessibility starts with an organisation’s culture",
    "authors": [
        "Craig Abbott, head of accessibility, DWP Digital"
    ],
    "categories": [
        "Accessibility",
        "Diversity",
        "DWP Digital"
    ],
    "pub_date": "2022-12-15T14:41:01+00:00",
    "content": [
        {
            "text": "By Craig Abbott, head of accessibility, DWP Digital"
        },
        {
            "text": "Accessibility has traditionally been seen as a technical problem to fix. It was usually just a skillset attached to other roles, such as Frontend Developer or Test Engineer. But things have changed. Accessibility is now emerging as its own profession, and it’s changing the culture of organisations. "
        },
        {
            "heading": 2,
            "text": "What do we mean by organisational culture? "
        },
        {
            "text": "It’s the mindset of the people in the organisation. Their principles, values, priorities and, ultimately, their behaviours. "
        },
        {
            "text": "We can think of it as the heart and soul of the organisation, and it impacts everything they do. "
        },
        {
            "heading": 2,
            "text": "What is a good organisational culture? "
        },
        {
            "text": "A good culture is one where everyone feels like they belong. Their ideas are heard, and their values are aligned with those of their colleagues. "
        },
        {
            "text": "They understand the vision of the organisation and feel like they contribute in a positive way. "
        },
        {
            "heading": 2,
            "text": "What is a bad organisational culture? "
        },
        {
            "text": "A bad culture is one where people feel repressed, like their ideas don’t matter, or that the things which are important to them go ignored. "
        },
        {
            "text": "When the culture is bad, people leave or ‘silently quit’. Silent quitting is when people checkout. They stop trying to do great work and just do the bare minimum. "
        },
        {
            "heading": 2,
            "text": "The culture shift "
        },
        {
            "text": "One of the biggest challenges in any large organisation is changing their culture. It impacts thousands of people, from the language we use, the principles we adopt, and the work that we do. "
        },
        {
            "text": "But times change. Laws, policies, attitudes — they all change. If your organisation can’t move with the times and adapt, it will encounter serious problems. "
        },
        {
            "text": "For example, things that were once considered ‘banter’ in the workplace are now criminal. Even 15 years ago, in a lot of industries, it was widely accepted that apprentices could be openly mocked, bullied and abused. "
        },
        {
            "text": "The Equality Act of 2010 now makes that illegal. Times and attitudes change, whether you want them to or not. "
        },
        {
            "text": "So, clearly, a bad organisational culture can be costly. "
        },
        {
            "heading": 2,
            "text": "Accessibility solves problems "
        },
        {
            "text": "1 in 5 people have a disability in the UK. It’s 14.6 million people — roughly the same number of people in the UK with brown eyes. "
        },
        {
            "text": "This does not include people with hidden disabilities or a lot of people who are considered neurodivergent. So, the true figure is actually far higher. "
        },
        {
            "text": "If you’re still telling yourself that you don’t have disabled users, or that it being inaccessible is not going to impact anybody, you’re wrong.  "
        },
        {
            "text": "Designing with accessibility in mind from the start means designing products and services that work for everyone, with no exceptions. That’s the legal requirement. "
        },
        {
            "text": "Accessibility is covered by 3 pieces of legislation: "
        },
        {
            "text": "Legal challenges where digital products fail to meet the standards are becoming more common. Across government, things are improving. But it’s fair to say that a lot of organisations have been too fixated on the detail. "
        },
        {
            "text": "The culture in most large organisations, is one which pays more attention to risks than the needs of its users. That’s changing, slowly, but there is still a lot of risk aversion. "
        },
        {
            "text": "The focus is often on the potential for reputational damage, rather than the failure of a product to meet the needs of its users in the first place. "
        },
        {
            "heading": 2,
            "text": "Changing the culture around accessible design "
        },
        {
            "text": "There’s an old proverb: "
        },
        {
            "text": "‘Tell me and I will forget. Show me and I will remember. Involve me and I can understand.’ "
        },
        {
            "text": "That philosophy underpins our accessibility strategy. We’re focused on three areas of improvement: "
        },
        {
            "heading": 3,
            "text": "Compliance "
        },
        {
            "text": "This means people are able to check the work and have confidence that it meets the required standards. Compliance is governance and checks which make sure the quality of the work is good enough. "
        },
        {
            "heading": 3,
            "text": "Culture "
        },
        {
            "text": "People also need to understand why accessibility is important and embrace it in each phase of a project. If people don’t understand why it’s important, you’ll never have any accessible products. "
        },
        {
            "heading": 3,
            "text": "Education "
        },
        {
            "text": "Lastly, people must have the required skills and knowledge to design, build and deliver accessible services. You can have all the will in the world, but without the right education you cannot achieve compliance. "
        },
        {
            "text": "There are a number of things we’re doing to support each of those things at DWP Digital. We’ve set some clear, measurable objectives with key results for each of them.  "
        },
        {
            "text": "We’ve created the Accessibility Manual, to raise people’s levels of knowledge. And we’ve set up accessibility clinics, which are a safe space for people can come to get advice and feedback on anything — from a conceptual idea to a block of production ready code. "
        },
        {
            "heading": 2,
            "text": "The accessibility specialist "
        },
        {
            "text": "Most importantly, we’ve been hiring accessibility specialists. We designed a specific career pathway for accessibility. It fits the model we’ve all come to expect, from associate up to senior and lead level. "
        },
        {
            "text": "We hired our first senior accessibility specialist a year ago. Since then, the role has continued to evolve. "
        },
        {
            "text": "Several departments have since collaborated on this new digital specialism, including the Home Office, HMRC, Department for Education, Ministry of Justice, and the Scottish Government. "
        },
        {
            "text": "Following several rounds of working groups and amendments, the accessibility specialist role is now a recognised Digital, Data and Technology (DDaT) profession across government.  "
        },
        {
            "text": "Accessibility has also been redefined as a technical skill, based on the following principles: "
        },
        {
            "text": "Over time we’re aiming to grow the practice. We imagine a world where functional areas have 1 or 2 accessibility specialists overseeing several products, similar to the way Performance Analysts do. "
        },
        {
            "heading": 2,
            "text": "Accessibility principles for everyone "
        },
        {
            "text": "To round off, I hope these principles help you to push the culture around accessibility in your team or organisation. Thanks to Colin Oakley in our Health Leadership Team for helping me put these together. "
        },
        {
            "heading": 3,
            "text": "1. Inclusion is better than empathy"
        },
        {
            "text": "It’s good to understand how other people might be feeling, but do not assume you know their needs. 1 in 3 of us show unconscious bias towards people who have a disability. Make sure you include a diverse group of people and you are collaborative when designing services. "
        },
        {
            "heading": 3,
            "text": "2. Accessible design is good design "
        },
        {
            "text": "Good design should meet needs and solve problems. If you design something which is inaccessible you will create barriers for people. Good design is not just what looks good, it must be usable. It must work for everyone, regardless of what impairments they have or what tools they might use. "
        },
        {
            "heading": 3,
            "text": "3. Start with what works "
        },
        {
            "text": "Start simple and only add complexity if it is needed. Use what is already available and re-use what others have already proven to work. The more things you design from scratch, the more work you need to do to make sure they’re accessible.\nAnything can be made accessible, but complexity takes time and effort. "
        },
        {
            "heading": 3,
            "text": "4. If it’s not accessible, it’s not done "
        },
        {
            "text": "Do not consider something finished until you are sure it is accessible. Accessibility is not a choice, it is law. It is always a priority, and if you neglect it you will create more work for yourself later. "
        },
        {
            "heading": 3,
            "text": "5. This is still for everyone "
        },
        {
            "text": "This is from the Government Design Principles. Everything we design should be as inclusive, readable, and as usable as possible. We are still building for the needs of everyone. We provide services for everybody in society, not just people who are using the web. "
        },
        {
            "text": "To find out about our latest career opportunities subscribe to our mailing list to get roles sent straight to your inbox.   "
        }
    ]
}