{
    "url": "https://apprenticeships.blog.gov.uk/2022/12/15/apprenticeship-external-quality-assurance-update/",
    "title": "Apprenticeship external quality assurance update",
    "authors": [
        "Darren Shaw"
    ],
    "categories": [
        "Apprenticeship standards",
        "The Institute",
        "Training providers"
    ],
    "pub_date": "2022-12-15T16:00:09+00:00",
    "content": [
        {
            "text": "A huge amount of progress has been made through 2022 with the reforms to how quality assurance works for apprenticeship end point assessment (EPA)."
        },
        {
            "text": "Now as we approach Christmas and the new year, I wanted to take this opportunity to update the sector."
        },
        {
            "text": "To recap, the outgoing system for external quality assurance (EQA) of EPA provided multiple options. In addition to the Institute for Apprenticeships and Technical Education (IfATE), EQA could be provided by professional and employer groups, or established qualifications and higher education regulators Ofqual and the Office for Students."
        },
        {
            "text": "We agreed to simplify and strengthen the process in response to concerns that it was over-complicated."
        },
        {
            "text": "Following consultation, it was decided that EQA would predominantly be covered by the regulators, Ofqual, or, for integrated degree apprenticeships, the Office for Students."
        },
        {
            "text": "Phase one of the transition process, which we updated on in May, required end point assessment organisations (EPAOs), for apprenticeships previously overseen by the IfATE EQA service, to apply for Ofqual recognition."
        },
        {
            "text": "A minimum of one EPAO for each apprenticeship had to achieve Ofqual recognition before Ofqual could become its EQA provider."
        },
        {
            "text": "We can now reveal that 66 EPAOs have now achieved recognition with Ofqual - which means that Ofqual provides EQA for 508 apprenticeships in total."
        },
        {
            "text": "An additional 78 apprenticeships, which were previously quality assured by professional and employer groups, are due to transfer to Ofqual by early January 2023 through phase two of the transition process."
        },
        {
            "text": "Added to that, arrangements for OfS to oversee EQA for apprenticeship end point assessment provided by universities, for the integrated degree apprenticeships, have been in place since July."
        },
        {
            "text": "All EQA providers will continue to follow guidelines for EPA quality assurance set out in IfATE’s EQA framework."
        },
        {
            "text": "I, along with my colleagues at IfATE, Ofqual and the OfS, would like to say a huge thank you to everyone involved for your co-operation and patience as the transition progresses. We will be left with a simpler and better system going into 2023 which is a really good thing for everyone."
        },
        {
            "text": "Darren Shaw, deputy director for change implementation for the Institute for Apprenticeships and Technical Education (IfATE)"
        }
    ]
}