{
    "url": "https://mojdigital.blog.gov.uk/2022/12/15/developing-talent-through-apprenticeships/",
    "title": "Developing talent through apprenticeships",
    "authors": [
        "Ian Tidmarsh"
    ],
    "categories": [
        "a great place to work",
        "apprenticeships",
        "Our services"
    ],
    "pub_date": "2022-12-15T11:16:59+01:00",
    "content": [
        {
            "text": "My name is Ian Tidmarsh and I'm Lead Business Analyst for Justice Digital - HMPPS. Business Analysts work in multi-disciplinary teams, alongside other digital professionals. We solve problems. We identify, analyse and look to understand different aspects of an organisation: its people, processes, information, and technology to ensure outcomes meet the needs of the business and its users."
        },
        {
            "text": "An important part of my role is to develop our existing talent so we can meet the needs of the business and deliver our objectives. My role also includes creating sustainable ways to bring in and nurture new talent in our organisation, so we can continue to meet the needs of the future."
        },
        {
            "text": "This article will explain one of the ways we are doing this. I will describe the journey we will go on, the challenges we face and what the future looks like."
        },
        {
            "text": "In May 2022 Head of Business Analysis, Jamie Toyne and I launched the first Business Analysis (BA) apprenticeship in HMPPS Digital. Heads of Digital, Sophie Otter and Mark Stanley supported the initiative by creating space in their organisation for apprentices."
        },
        {
            "text": "Existing Prison and Probation staff were given the opportunity to apply to a programme lasting 2 years and take an intense learning journey, getting involved in real work and undertaking industry-leading training."
        },
        {
            "text": "We received a strong response to our advert, and with the valuable support of our excellent Business Analyst community, interviewed over 30 candidates, identifying 5 candidates who were best equipped for the challenge ahead. They are:"
        },
        {
            "text": "Ciaron Amos - joining Digital Prison\nClare Ibbotson - joining Digital Probation\nDavid Yoxall - joining Digital Prison\nJoanna Grime - joining Digital Probation\nMichael Wood - joining Digital Prison"
        },
        {
            "text": "Although the BA apprenticeship officially begins in January 2023, we wanted them to be familiar with an environment that is significantly different to where they’ve worked previously. So in October we placed these intrepid BA apprentices into product teams and assigned them each a mentor from within the HMPPS Digital BA team. They have settled in quickly, tackling problems and learning how we work in Justice Digital."
        },
        {
            "text": "Since their two-day induction the apprentices have been on a whirlwind journey, learning from their teams and experiencing the collaborative, supportive digital culture here. Starting early means they have had time to learn our tooling and technologies which wouldn't be possible if they were studying and building their portfolio as the apprenticeship begins in earnest. It also meant we could iron out any teething problems with accounts, transfers and devices."
        },
        {
            "text": "The programme\nThe programme will be delivered by our apprenticeship provider, QA, and give successful candidates an industry recognised Level 4 qualification in Business Analysis. This is the equivalent to a foundation degree and is highly valued."
        },
        {
            "text": "As well as their HMPPS Digital mentors, the apprentices will be supported by people in the industry aligned to the programme. This will give them a really well balanced blend of support between our internal HMPPS approach to business analysis and industry standards."
        },
        {
            "text": "They will complete modules, culminating in an end-assessment of their portfolio. They will also be able to take the BCS Diploma in Business Analysis; another desirable, industry recognised qualification."
        },
        {
            "text": "By working on products alongside other BAs in multi-disciplinary teams they will experience the highs and lows of software and service delivery. The time on their teams will give them a real opportunity to consolidate their formal learning and build value into their portfolio."
        },
        {
            "text": "The future\nWe hope this isn't the only BA apprenticeship that we offer in Justice Digital. We are learning all the time and future cohorts will benefit from this current group, trailblazing a path for those that will follow."
        },
        {
            "text": "Ultimately, we hope they secure permanent roles as Business Analysts here.. To help ensure this I regularly review what our objectives are over the spending review periods and forecast the number of BAs that we will need. LinkedIn describes business analysis as the top 6 in demand skills in digital and I'm keen for us all to recognise that in our organisation."
        },
        {
            "text": "Over the coming months you will hear more about how our apprentices are getting on, featuring blogs and articles written by them as individuals and as a collective group. We look forward to the programme starting properly in January and seeing how this very determined and talented group of people develop their business analysis skills."
        },
        {
            "text": "Further information\nFor more information on anything I've written here, please feel free to get in touch. I'm really happy to talk about business analysis, Digital and career progression."
        },
        {
            "text": " "
        }
    ]
}