{
    "url": "https://ipa.blog.gov.uk/2022/12/15/hinkley-point-c-hpc-site-visit/",
    "title": "Hinkley Point C (HPC) Site Visit",
    "authors": [
        "Kate Hall",
        "Samina Khan"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Major Projects",
        "Modern Methods of Construction"
    ],
    "pub_date": "2022-12-15T11:42:41+00:00",
    "content": [
        {
            "text": "Samina Khan, Deputy Director for Department for Business, Energy and Industrial Strategy (BEIS), Foreign, Commonwealth and Development Office (FCDO) and Department for International Trade (DIT) and Project Delivery Advisor, Kate Hall for the Infrastructure and Projects Authority (IPA), share their thoughts about a recent site visit to the Hinkley Point C construction site. "
        },
        {
            "text": "Decarbonisation of Britain's power supply "
        },
        {
            "text": "Hinkley Point C (HPC) will be Britain's first nuclear power plant since 1995. At its peak in 1994, nuclear energy provided more than 20% of the UK’s electricity, helping reduce the UK’s reliance on fossil fuels as a source of energy. Infact, the last nuclear power station to be built in Britain was Sizewell-B, which began construction in 1987 and was commissioned into operation in 1995."
        },
        {
            "text": "As we now decarbonise Britain’s power supply, it means there will be a future increase in demand for electricity. To meet that demand, and to contribute to the net zero 2050 targets, the UK will require a reliable source of energy to complement the energy generated from renewable sources. The construction of HPC (and the more recent government commitment into Sizewell C) is integral to delivering on these commitments."
        },
        {
            "text": "The application of digitalisation  "
        },
        {
            "text": "The HPC site is located on the west Somerset coast near Taunton, an isolated spot along windy country lanes. As we neared the site, we were struck by the significant number of tower cranes prominent in the otherwise flat landscape. The site is large, with a footprint of 1.6km square in size and a workforce which at its peak has been in excess of 10,000. "
        },
        {
            "text": "Transforming Infrastructure Performance (TIP’s) Roadmap to 2030 describes a vision for the future in which we collectively prioritise societal outcomes and use modern digital approaches and technologies, alongside improved delivery. During our visit we were able to see the progress being made by the HPC team in developing and implementing a digital strategy in the planning and delivery of the project - a goal set by IPA Chief Executive Officer, Nick Smallwood, on a previous visit 12 months earlier. With new government investment for Sizewell C, we were keen to understand the opportunities a replica project can provide and make sure that these are realised through future nuclear construction projects. "
        },
        {
            "text": "A digital strategy in construction and infrastructure projects, provides a data centric platform to improve and manage project delivery across the whole life cycle. This allows all parts of the supply chain to drive efficiencies in time, cost and quality - which may achieve as much as an estimated 40% reduction in construction cost if implemented from the outset. In addition, there are added benefits to the operation, such as the application of 3D modelling. The demonstration of the digital model at HPC was impressive. In less than 12 months, the team had implemented a system of 3D modelling, 4D scheduling and advanced work packaging (previously known as 5D/CAD) for the mechanical electrical and heating element of the construction."
        },
        {
            "text": "While on site, we saw how issues could be reported in real time by individuals working on site using ‘smart books’. This meant issues were logged with project management immediately, so that interventions could be handled in a timely manner. We met individuals who were managing concrete pours on site and they explained how through their ‘smart tablets’, they were allocated their daily task orders. Task orders can only be issued once all materials are available and delivered to the correct location on site. Each component is tagged so its location is known and delivery can be efficiently managed. This allows for a more effective approach to logistics management, reducing traffic on and around the site. "
        },
        {
            "text": "It demonstrates pockets of world class delivery using the latest digital and technology solutions, central to achieving the vision set out in the TIP Roadmap. "
        },
        {
            "text": "Applying lessons learnt "
        },
        {
            "text": "The construction of Sizewell C, in which the UK government will be a shareholder, is intended to be an “almost” replica of HPC. The IPA is supporting the team at BEIS in overseeing the delivery of this programme, to ensure that the opportunities provided through replication are maximised by efficiencies in design replication and the application of the digital model. The increased adoption of advanced digital systems will help provide real time data and foster a collaborative working approach similar to HPC. This has the opportunity to change the game in how construction and infrastructure projects in the UK are delivered. "
        },
        {
            "text": "The IPA has produced an IPA Digitalisation Guide which can be found on the Project Delivery Hub. The guide outlines the benefits of digital tools in more detail and sets out a list of questions for projects and programmes to consider when planning the incorporation of these models into their delivery strategies. "
        }
    ]
}