{
    "url": "https://naturalengland.blog.gov.uk/2022/12/15/hoping-for-a-montreal-moment-at-cop15/",
    "title": "Hoping for a Montreal Moment at COP15",
    "authors": [
        "Pete Brotherton"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Natural England"
    ],
    "pub_date": "2022-12-15T09:02:42+00:00",
    "content": [
        {
            "text": "By Dr. Peter Brotherton, Director of Science, Natural England"
        },
        {
            "text": "There can sometimes seem to be a lot of COPs. Periodic ‘Conferences of the Parties’ (COPs) are held for all the United Nation environmental conventions. In the UK, greatest prominence is given to the annual climate change COP. Hosting COP26 was rightly a big deal for the UK, and many of us will have followed the outcomes of COP27 in Egypt. Other conventions meet less frequently, and sometimes barely seem to get noticed."
        },
        {
            "text": "How many people were aware of the 15th COP of the UN Convention to Combat Desertification held this summer, or the recent COP19 of the Convention on International Trade in Endangered Species (CITES)? And now another COP is underway in Montreal - COP15 of the Convention on Biological Diversity (CBD)."
        },
        {
            "text": "While all COPs matter, not all COPs are equal and COP15 has particular significance for biodiversity, representing a once-in-a-decade chance to tackle the crisis facing our natural world. Once-in-a-decade because COP15 is expected to agree a new ten-year strategic plan for biodiversity, a ‘Post-2020 Global Biodiversity Framework’ which, as you can tell from the name, is already two years late due to Covid-19. That’s two years in which nature has declined further around the world, with greater species declines, daily extinctions, and more losses of the ecosystems upon which humanity depends."
        },
        {
            "text": "It’s also two years in which the evidence of the importance of nature for our economy, food, health and well-being has grown, most notably through the Dasgupta review. We also now have an even better understanding of the critical need to recover nature if we are to succeed in tackling climate change."
        },
        {
            "text": "The urgent need for the world to change course and begin nature recovery has led to calls for COP15 to deliver a ‘Paris Moment’ for nature. This references the landmark agreement reached in Paris in 2015 at climate change COP21. In Paris, the world agreed to an apex target to limit global warming to well below +2C, preferably to +1.5C, and also agreed a ‘ratchet mechanism’ to drive progress."
        },
        {
            "text": "Under this ratchet, countries are required to submit progressively more ambitious Nationally Determined Contributions (NDCs) that demonstrate increasing greenhouse gas reductions during each reporting period. In Paris, the world also reaffirmed the need for developed nations to provide more climate financing to other countries."
        },
        {
            "text": "By contrast, the CBD has no apex target and no agreed financial package to deliver its goals. This is what many of us hope will change in Montreal. The UK has a strong track record of international leadership for nature over the past few years in the run-up to COP15. The UK has been instrumental in establishing the High Ambition Coalition for Nature which now comprises over 100 countries and is championing a global target to protect 30% of land and 30% of sea for biodiversity by 2030 (‘30by30’)."
        },
        {
            "text": "The UK has also been at the forefront of developing the Leaders’ Pledge for Nature, which over 90 heads of state have signed and contains many of the elements needed in an ambitious Post-2020 Global Biodiversity Framework. Deliverability is key, which is why Natural England, together with the other UK Statutory Nature Conservation Bodies, set out how the UK can achieve the domestic aspects of the Leaders’ Pledge (and much of the draft Post-2020 Global Biodiversity Framework) in our Nature Positive 2030 report, boosting confidence amongst UK negotiators that they can be ambitious at COP15."
        },
        {
            "text": "From 15th-17th December, COP15 enters its ‘High Level Segment’, where heads of state and ministers become involved in the final stages of the negotiations. An over-arching goal to halt and reverse biodiversity loss globally by 2030 is on the table, together with twenty targets to underpin for the Post-2020 Global Biodiversity Framework. These span indigenous rights, benefits derived from genetic resources, sustainable fishing and farming, invasive species and more."
        },
        {
            "text": "All these targets are important for the future of life on earth, but the 30by30 target is prominent in discussions. If indigenous people can be reassured that 30by30 will not lead to a fortress approach to nature protection which denies them rights and livelihoods, there is a real chance that 30by30 could become the apex target for biodiversity."
        },
        {
            "text": "What about a ratchet mechanism? I’ve not heard much talk of this so far, but the 30by30 target would be well suited to this. Countries could be required to report progressive progress towards protecting and managing 30% of their own land and sea area for biodiversity. Global institutions and partnerships could also report on progress towards protection of the ocean beyond national boundaries."
        },
        {
            "text": "A financial package? Ultimately, we cannot expect to recover biodiversity if we continue with economic systems that are largely reliant for their profits upon the over-exploitation of nature.  Deeper transformational change is needed, so that healthy ecosystems are intrinsic to our economy and food systems. However, urgent action is needed now and the UK, alongside several other countries, is promoting a ten-point plan for financing nature’s recovery."
        },
        {
            "text": "This proposes increasing financial assistance from developed nations, reforming international financial institutions to achieve nature positive outcomes and eliminating harmful subsidies, among other changes. How much? That’s still to be determined, but if the world spent as much on recovering nature as it is spending on a football tournament, that would be a good start."
        },
        {
            "text": "Negotiations have been proving tough at COP15, but an ambitious and comprehensive Post-2020 Global Biodiversity Framework, together with a 30by30 apex target and new financing plan, are all within the reach of heads of state and ministers as they assemble in Montreal. This is a time for world leaders to be courageous and generous, and to achieve a ‘Montreal Moment’ that we can look back on as a turning point for nature, and for the future of humanity too."
        }
    ]
}