{
    "url": "https://civilservice.blog.gov.uk/2022/12/15/how-to-hold-on-to-a-world-record/",
    "title": "How to hold on to a world record",
    "authors": [
        "Mark Camilletti"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-12-15T15:31:29+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Civil Service generates millions of pieces of information every year. But keeping records is nothing new – in fact, it stretches back millennia."
        },
        {
            "text": "Records have played an important part in human history for thousands of years. They can represent a fixed account of transactions, decisions or events. In pre-history some societies made marks on sticks or bone to record transactions that they wanted to refer back to later. "
        },
        {
            "heading": 4,
            "text": "Evolved over time"
        },
        {
            "text": "Records – and the way in which the information they contain is captured – have evolved over time. Their use has become more complex, sometimes representing an account of an entire previous era.  There are many examples: in the early middle ages, the Venerable Bede used archived records from a range of sources to write his Ecclesiastical History of the English People. In 1086, William the Conqueror created the first record of all the land, livestock and property in England when he commissioned the Domesday Book [below]. This is a powerful record – one that still shapes land ownership in Britain a thousand years later."
        },
        {
            "text": "The above examples relate to information that has been captured as a record in a physical medium, such as on a stick, vellum, or paper. In today’s Civil Service we usually create records digitally, but despite the change in medium records continue to be important evidence of events, transactions or decisions. "
        },
        {
            "heading": 4,
            "text": "Capturing important events"
        },
        {
            "text": "The digital records created within the Civil Service capture the important events and decisions of our time. They are stored within departmental information management systems to support transparency and accountability as part of the democratic process. Some of these records – particularly those that capture important events or decisions that shape the government’s interaction with society – will be selected for, transferred to, and preserved at The National Archives at Kew. These can then be accessed and used at any time for research."
        },
        {
            "text": "But there are also many records that are not referred to again after they’ve served the purpose for which they were created.  These records live out their remaining existence in information systems before they’re destroyed or archived or needed for some other purpose.  "
        },
        {
            "heading": 4,
            "text": "Guard against complacency"
        },
        {
            "text": "Nevertheless, organisations need to ensure these records are properly managed and will ignore them at their peril, as if these records are needed the hunt for the one version of the truth about an event or transaction they contain suddenly becomes very important. For instance, this can be when a record is required to protect the department’s reputation, or when a record’s ongoing existence is a compliance issue because it contains obsolete or incorrect information."
        },
        {
            "text": "Complacency about records management can lead to the sort of incident regularly covered by the media where a briefcase or USB stick containing sensitive records is found in an unsecure location, or digital records needed for evidence are corrupted and no longer accessible."
        },
        {
            "text": "What does history tell us? All records stored in any format have power because of their very existence. They need to be managed effectively so that they can be accessed when they’re needed and legitimately disposed of when they’re no longer required."
        },
        {
            "heading": 4,
            "text": "Intriguing"
        },
        {
            "text": "It’s intriguing to wonder which records created today will survive, be selected for preservation and find their way to The National Archives. These very records may possess the power to influence crucial decisions in times to come, and will echo through the ages with the events and decisions of the time in which we live. "
        },
        {
            "text": "Many of us create records on a daily basis – so the next time you create a record, have a think about where you’re creating it, who its intended audience is, how they will access it and how long it needs to be kept. Your record may just change the world. "
        }
    ]
}