{
    "url": "https://food.blog.gov.uk/2022/12/15/living-with-a-food-hypersensitivity-in-the-uk-the-costs-and-the-impact-on-a-persons-quality-of-life/",
    "title": "Living with a Food Hypersensitivity in the UK - the costs and the impact on a person’s quality of life",
    "authors": [
        "Nicholas Daniel, Economics Advisor"
    ],
    "categories": [
        "Allergy"
    ],
    "pub_date": "2022-12-15T11:44:49+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Nicholas Daniel, Economics Advisor at the Food Standards Agency discusses findings from two research reports commissioned by the FSA which help understand the economic and societal costs of living with a Food Hypersensitivity. "
        },
        {
            "text": "Food Hypersensitivity (FHS) is the collective term for a food allergy, intolerance and coeliac disease. Just over 3% of people in the UK have a FHS - figures from the Food and You 2 Wave 3 Survey show that there are approximately 800,000 people living with a clinically diagnosed food allergy, 300,000 with coeliac disease and 1.2 million living with food intolerance in the UK."
        },
        {
            "text": "FHS not only impacts public health but also has wider economic and societal impacts for individuals. To better understand the extent, scope and scale of these impacts, the Food Standards Agency (FSA) continues to invest in innovative economic research. The latest research looks at the costs of living with a FHS, and a further study aims to put a monetary value on how the impacts of financial, economic and quality of life can affect people living with a FHS. This blog will look at the studies in more detail."
        },
        {
            "heading": 2,
            "text": "FSA Research on Monetising the Impact of FHS"
        },
        {
            "text": "The first study - Estimating the Financial Costs to Individuals with a Food Hypersensitivity - looked at the additional financial burden faced by people with FHS. The research study is the first of its kind in the UK and specifically focused on costs associated with grocery shopping, eating out, time off work and the time invested in researching labels and meal preparation etc."
        },
        {
            "text": "The study found that for every £1 a non-FHS household spends on weekly groceries, a household of someone with:"
        },
        {
            "text": "In addition to this, a household with FHS would also:"
        },
        {
            "text": "The second study - Impacts of Food Hypersensitivities (FHS) on Quality of Life in the UK and Willingness to Pay to remove those impacts - led by the University of Manchester, complements the first study by going beyond the scope of the financial costs research and valuing the intangible – how the quality of life impacts affect people with FHS. The research essentially involves getting individuals living with a food allergy, coeliac disease or food intolerance, to put a monetary value on how much they are willing to pay to remove their FHS."
        },
        {
            "text": "Key findings from the study found that to remove all symptoms and limitations of their FHS:"
        },
        {
            "text": "The average money per year that parents would pay to remove all the symptoms and limitations of their children’s FHS was even higher:"
        },
        {
            "heading": 2,
            "text": "Interpreting results in the wider Cost-of-Living context"
        },
        {
            "text": "The results show that adults with FHS, regardless of their FHS condition, face an increased financial burden compared to non-FHS households. With the rising cost of living, in particular food price inflation, it is inevitable that this could have a disproportionate impact on households with FHS, since as we now know, they already incur higher food costs."
        },
        {
            "text": "At the FSA we don’t regulate food prices. We are aware that the causes of rising food costs are complex and go considerably beyond our remit. However, these experiences are critically relevant to our work as a regulator and to our mission to make sure people have food they can trust."
        },
        {
            "heading": 2,
            "text": "New research enhancing our capability"
        },
        {
            "text": "The FSA continues to be a thought leader in this space and we have taken a proactive stance in helping shape and develop leading economic research in this area, adding significant new knowledge to an ever-critical evidence base. We hope that this research will help promote our work in ensuring that food is what it says it is and allow us to continue the development of research to keep food safe."
        },
        {
            "text": "For other FSA research related to Food Hypersensitivity, please visit our website."
        },
        {
            "heading": 1,
            "text": "Byw gyda Gorsensitifrwydd i Fwyd yn y DU – y costau a’r effaith ar ansawdd bywyd person"
        },
        {
            "text": "Dyma Nicholas Daniel, Cynghorydd Economeg yn yr Asiantaeth Safonau Bwyd, yn trafod canfyddiadau dau adroddiad ymchwil a gomisiynwyd gan yr ASB sy’n helpu i ddeall costau economaidd a chymdeithasol byw gyda gorsensitifrwydd i fwyd. "
        },
        {
            "text": "Gorsensitifrwydd i fwyd yw’r term cyfunol ar gyfer alergedd bwyd, anoddefiad bwyd a chlefyd seliag. Mae gan ychydig dros 3% o bobl yn y DU orsensitifrwydd i fwyd, ac yn ôl Arolwg Bwyd a Chi 2 Cylch 3, mae tua 800,000 o bobl yn byw gydag alergedd bwyd drwy ddiagnosis clinigol, 800,000 â chlefyd seliag a 300,000 miliwn ag anoddefiad bwyd yn y DU."
        },
        {
            "text": "Mae gorsensitifrwydd i fwyd yn effeithio ar iechyd y cyhoedd, ond mae hefyd yn esgor ar effeithiau economaidd a chymdeithasol ehangach i unigolion. Er mwyn deall maint, cwmpas a graddfa’r effeithiau hyn yn well, mae’r Asiantaeth Safonau Bwyd (ASB) yn parhau i fuddsoddi mewn ymchwil economaidd arloesol. Mae’r ymchwil ddiweddaraf yn edrych ar gostau byw gyda gorsensitifrwydd i fwyd; ac mae astudiaeth bellach yn ceisio rhoi gwerth ariannol ar sut y gall effeithiau ariannol, economaidd ac ansawdd bywyd effeithio ar bobl sy’n byw â gorsensitifrwydd i fwyd. Bydd y blog hwn yn edrych ar yr astudiaethau yn fwy manwl."
        },
        {
            "heading": 2,
            "text": "Ymchwil yr ASB ar Effaith Ariannol Gorsensitifrwydd i Fwyd"
        },
        {
            "text": "Edrychodd yr astudiaeth gyntaf, Amcangyfrif y Costau Ariannol i Unigolion â Gorsensitifrwydd i Fwyd, ar y baich ariannol ychwanegol y mae pobl â gorsensitifrwydd i fwyd yn ei wynebu. Dyma’r astudiaeth ymchwil gyntaf o’i math yn y DU, ac mae’n canolbwyntio’n benodol ar gostau sy’n gysylltiedig â siopa bwyd, bwyta allan, amser i ffwrdd o’r gwaith a’r amser a dreulir yn ymchwilio i labeli a pharatoi prydau bwyd ac ati."
        },
        {
            "text": "Canfu’r astudiaeth, ar gyfer bob £1 y mae cartref heb unigolion â gorsensitifrwydd i fwyd yn ei wario ar fwyd bob wythnos, bydd cartref gyda rhywun sydd ag:"
        },
        {
            "text": "Yn ogystal â hyn, byddai cartrefi sydd ag unigolion sy’n byw â gorsensitifrwydd i fwyd yn:"
        },
        {
            "text": "Mae’r ail astudiaeth, Effeithiau Gorsensitifrwydd i Fwyd ar Ansawdd Bywyd yn y DU a Pharodrwydd i Dalu i ddileu’r effeithiau hynny, a arweiniwyd gan Brifysgol Manceinion, yn ategu’r astudiaeth gyntaf drwy fynd y tu hwnt i gwmpas yr ymchwil costau ariannol a rhoi gwerth ar yr anniriaethol – effeithiau ansawdd bywydau pobl sydd â gorsensitifrwydd i fwyd.  Mae’r ymchwil yn ei hanfod yn ymwneud â gofyn i unigolion sy’n byw ag alergedd bwyd, clefyd seliag neu anoddefiad bwyd, i roi gwerth ariannol ar faint y byddent yn fodlon ei dalu i gael gwared ar eu gorsensitifrwydd."
        },
        {
            "text": "Canfu canfyddiadau allweddol o’r astudiaeth, er mwyn cael gwared ar holl symptomau a chyfyngiadau eu cyflwr:"
        },
        {
            "text": "Roedd cyfartaledd yr arian fesul flwyddyn y byddai rhieni yn ei dalu i gael gwared ar holl symptomau a chyfyngiadau gorsensitifrwydd i fwyd eu plant hyd yn oed yn uwch:"
        },
        {
            "heading": 2,
            "text": "Dehongli canlyniadau y cyd-destun Costau Byw ehangach"
        },
        {
            "text": "Mae’r canlyniadau’n dangos bod oedolion â gorsensitifrwydd i fwyd, waeth beth fo’u cyflwr, yn wynebu baich ariannol cynyddol o gymharu a chartrefi heb unigolion â gorsensitifrwydd i fwyd.  Gyda chostau byw cynyddol, yn enwedig chwyddiant prisiau bwyd, mae’n anochel y gallai hyn gael effaith anghymesur ar gartrefi sydd â gorsensitifrwydd i fwyd, oherwydd fel y gwyddom bellach, maent eisoes yn wynebu costau bwyd uwch."
        },
        {
            "text": "Nid ydym yn rheoleiddio prisiau bwyd fel rhan o waith yr ASB. Rydym yn ymwybodol iawn bod y ffactorau sy’n achosi costau bwyd i gynyddu yn gymhleth ac yn mynd gryn dipyn y tu hwnt i’n cylch gwaith. Fodd bynnag, mae’r profiadau hyn yn hynod berthnasol i’n gwaith fel rheoleiddiwr ac i’n cenhadaeth i sicrhau bod gan bobl fwyd y gallant ymddiried ynddo."
        },
        {
            "heading": 2,
            "text": "Ymchwil newydd yn gwella ein gallu"
        },
        {
            "text": "Mae’r ASB yn parhau i fod yn arweinydd agweddau (thought leader) yn y maes hwn ac rydym wedi cymryd safiad rhagweithiol wrth helpu i lunio a datblygu ymchwil economaidd flaenllaw yn y maes, gan ychwanegu gwybodaeth newydd sylweddol at sylfaen dystiolaeth hollbwysig."
        },
        {
            "text": "Gobeithiwn y bydd yr ymchwil hon yn helpu i hyrwyddo ein gwaith i sicrhau bod bwyd yn cyd-fynd â’r hyn sydd ar y label ac yn ein galluogi i barhau i ddatblygu ymchwil i gadw bwyd yn ddiogel."
        },
        {
            "text": "I weld rhagor o waith ymchwil yr ASB yn ymwneud â gorsensitifrwydd i fwyd, ewch i’n gwefan."
        }
    ]
}