{
    "url": "https://environmentagency.blog.gov.uk/2022/12/15/restoring-sealife-in-the-solent-a-5-million-5-year-project/",
    "title": "Restoring sealife in the Solent – a $5 million 5-year project",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Fisheries and biodiversity"
    ],
    "pub_date": "2022-12-15T11:07:29+00:00",
    "content": [
        {
            "text": "To mark COP15, Louise MacCallum, Solent Project Manager at Blue Marine Foundation, explains how the exciting multi-million-dollar ‘Solent Seascape Project’ will be the first of its kind in the UK to restore a seascape scale marine habitat (credit: Louise MacCallum).  "
        },
        {
            "text": "Blue Marine Foundation is a UK ocean conservation charity. Its aim is to restore the ocean by creating marine reserves, restoring vital habitats, and establishing models of sustainable fishing. Blue Marine’s mission is to see 30 per cent of the world’s ocean under effective protection by 2030 and to see the other 70 per cent managed responsibly."
        },
        {
            "text": "Last year, an incredible partnership of ten influential partners - the Environment Agency, Natural England, Hampshire and Isle of Wight Wildlife Trust, RSPB, Project Seagrass, Coastal Partners, Isle of Wight Estuaries Project, CHaPRoN, University of Portsmouth and Blue Marine Foundation - took part in a series of workshops.  These aimed to bring together and extend various existing initiatives and habitat restoration projects into one seascape scale vision.  That vision became the Solent Seascape Project! This is an exciting five-year project to restore four of the most vulnerable marine habitats - seagrass meadows, oyster reefs, saltmarsh, and seabird nesting habitat - across the Solent region of the UK’s south coast.  Together, the partnership secured a $5m grant from the Endangered Landscapes Programme, starting from November 2022 running until 2027."
        },
        {
            "text": "I joined the Blue Marine Foundation as Project Manager for the Solent Seascape Project in February this year. I would say to anyone out there with a passion for nature and conservation, I know it can be tough, but keep doing what you are doing, as dream jobs do exist! I have a degree in marine biology from the University of Liverpool and spent many years volunteering with NGOs and doing environmental education before I moved to the south coast and spent more than a decade working as an Environment Officer for Langstone Harbour Board. That role stood me in good stead for this job as I now have a good network of partners to draw on. Because I have worked in the Solent for so long, I know partners’ skills and who to call for advice.  And I have lived on the shores of the Solent all that time too."
        },
        {
            "text": "Lots of people might think of sailing when they picture the Solent, but it is so much more than that.  Home to a network of harbours, spits, numerous islands and vast sandbanks, these dynamic marine and estuarine habitats are bursting with life. Saltmarsh, seagrass, mudflats and oyster reefs provide for an abundance of species - the seabed was once home to the most important native oyster fishery in Europe. Fish and shellfish such as king scallops, cockles, cuttlefish and bass all depend on these habitats for shelter and food. Endangered species such as the European Eel and Thresher Shark as well as seahorses find sanctuary in the Solent."
        },
        {
            "text": "Larger marine predators are drawn to this rich source of food with the Solent supporting around sixty harbour seals, increasing numbers of grey seals, and even occasional bottlenose and common dolphins. The Solent is of international significance for birds, attracting more than 12,000 breeding pairs each year including many species of terns and gulls. The estuaries of the Solent provide wintering grounds for over 125,000 ducks, geese and wading birds such as redshanks and oyster catchers. 10 per cent of the world’s Dark-Bellied Brent Geese population call the Solent home. And of course, the Solent has a rich maritime heritage and has provided for its coastal communities for generations."
        },
        {
            "text": "Despite all the Solent being protected by many nature conservation designations, its habitats have become fragmented and degraded like so many others, globally, through human pressures including poor water quality, increased industrialisation, and disturbance.  The Solent is one of the most heavily used waterways in the UK. With a population of over 1.5 million, 79,000 shipping movements per year and a quarter of all the coastal marina berths in England, it is under increasing pressure from coastal squeeze (where habitat is lost through rising sea levels), poor water quality, unsustainable fishing, recreational disturbance, and sea level rise."
        },
        {
            "text": "Sadly, over 50 per cent of the area’s saltmarsh has been lost, equivalent to an estimated carbon fixing potential of around 5,000 tonnes per year. Oyster populations have declined by 95 per cent causing the collapse of the fishery, and all 650 hectares of seagrass beds are in poor condition. These habitats collectively provide numerous ecosystem and social benefits. They act as an important carbon store, helping to reduce the impacts of climate change, provide vital nursery grounds for commercially important fish, protect coastal homes from erosion and sea level rise, improve water quality, and provide areas for local people and tourists to explore their natural environment, helping to improve social wellbeing."
        },
        {
            "text": "Over the next five years, our partnership will be working together to develop a long-term seascape recovery plan that supports better management of existing Solent marine and coastal habitats. We will be restoring 8ha of saltmarsh, 7ha of seagrass, 4ha of oysters, and 10 breeding seabird nesting sites to increase habitat extent and catalyse recovery across the wider seascape, improving ecological connectivity. We will also be bringing together evidence of the wider benefits of seascape restoration, assessing ecosystem service benefits (carbon sequestration, increasing biodiversity, and nutrient remediation), working with government and regulators to develop key interventions and financial mechanisms to upscale the potential for seascape restoration in the longer term, and empowering local communities to become involved in seascape recovery."
        },
        {
            "text": "Next year you should start to see us out and about in Chichester Harbour doing some saltmarsh restoration, and building an oyster restoration reef in the River Hamble. I am also excited that we will be bringing together local communities to start developing the “Vision for the Seascape Recovery Plan”.  This plan will be a toolkit so that everyone, landowners to residents, local industries to recreation lovers will know what they can do to help protect their fragile and precious Solent habitats."
        },
        {
            "text": "Marine habitat restoration is in its infancy, particularly compared with tropical marine and terrestrial habitats. We hope to use what we learn from this project to create a blueprint for restoring temperate marine habitats elsewhere."
        },
        {
            "text": "Please visit www.BlueMarineFoundation.com to find out more about us and projects we are involved in with the Environment Agency and others."
        }
    ]
}