{
    "url": "https://companieshouse.blog.gov.uk/2022/12/15/sharing-our-equality-diversity-and-inclusion-journey-with-techniquest/",
    "title": "Sharing our equality, diversity and inclusion journey with Techniquest",
    "authors": [
        "Ruth Frost, Recruitment Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2022-12-15T14:20:41+00:00",
    "content": [
        {
            "text": "If you grew up in South Wales, it’s likely your school took you to Techniquest – a science discovery centre in Cardiff Bay. Imagine hands-on science exhibits, a planetarium, and a science theatre where things crash, bang and explode."
        },
        {
            "text": "Techniquest is the UK’s longest-established science centre. With a mission to embed science in Welsh culture through interactive engagement, it provides a range of services to schools and welcomes thousands of visitors through its door each month."
        },
        {
            "text": "So, why did some of the Companies House resourcing, and equality, diversity and inclusion (EDI) teams spend a day there in September? What could we have in common with Techniquest?"
        },
        {
            "text": "Techniquest is committed to being as diverse and inclusive as possible. It’s on a journey to develop and launch its EDI strategy. Because our own EDI work has developed so much over the past few years, they wanted to dig into our experience."
        },
        {
            "text": "At Companies House, we’re currently implementing our EDI strategy. This puts EDI at the heart of our working environment and culture. It starts with attracting diverse candidates and flows through all our careers. We want our culture to be people-led with EDI an integral part of all that we do. We’ve established an EDI steering group to monitor the development and implementation of the strategy so that it’s always outcome-focused."
        },
        {
            "text": "As part of our commitment to EDI we’ve:"
        },
        {
            "text": "Personally, I’m a member of the working families and the faith, allyship, culture and ethnicity (FACE) networks."
        },
        {
            "heading": 2,
            "text": "Taking our experience to Techniquest"
        },
        {
            "text": "In September, we took our EDI journey to Techniquest. We put together an interactive training session, where we thought about their EDI goals as an organisation, both as an employer and in meeting their customers’ needs."
        },
        {
            "text": "The ‘diversity iceberg’ was one thing we discussed. So many aspects of diversity are unseen. What we see when we look at someone is only a tiny percentage of who they are. What’s unseen (and below the iceberg’s waterline) is just as important. Allowing our colleagues to be their ‘whole and brilliant selves’ in work is about valuing what’s below the waterline as well as the ‘seen’ things above it."
        },
        {
            "text": "We had a great time with the team at Techniquest. They were so involved and were really committed to embedding EDI into their culture and organisation. It was lovely to receive this feedback from their CEO, Lesley Kirkpatrick:"
        },
        {
            "text": "As part of the session, we encouraged Techniquest staff to make an EDI pledge – one thing they would commit to doing to embrace equality and diversity and to become more inclusive – and it got our team thinking about what our own individual pledge could be. So let me pose a question. If you could do one thing in work that would help people to feel valued, and to help feel safe enough to share those things ‘below the waterline’, what would it be?"
        }
    ]
}