{
    "url": "https://aphascience.blog.gov.uk/2022/12/15/sir-patrick-vallance-visits-apha-weybridge/",
    "title": "Why Sir Patrick Vallance considers APHA an important asset to the UK",
    "authors": [
        "Sir Patrick Vallance"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2022-12-15T12:46:21+00:00",
    "content": [
        {
            "text": "In this blog we hear from Government Chief Scientific Advisor, Sir Patrick Vallance, as he recently joined APHA’s Chief Executive Officer, the UK’s Chief Veterinary Officer and Defra’s Chief Scientific Adviser at APHA’s headquarters at Weybridge to learn more about the importance of APHA’s scientific expertise and redevelopment, as the UK government’s primary capability for animal health science."
        },
        {
            "text": "Public Sector Research Establishments (PSREs) play an important and often under-recognised role in the UK’s science, research, development and innovation landscape, and they are crucial for providing science for policy and operations for government. I have visited many PSREs during my time as Government Chief Scientific Adviser and was delighted to visit the Animal and Plant Health Agency (APHA) Weybridge site in November."
        },
        {
            "text": "APHA’s CEO, David Holdsworth, gave an overview and I was joined by Christine Middlemiss, the UK’s Chief Veterinary Officer and Gideon Henderson, the Department for Environment, Food & Rural Affairs (Defra)’s Chief Scientific Adviser. David set the agency in the wider context of UK One Health, an initiative which considers human health, animal health, agriculture, and environmental sectors holistically. He described how the agency delivers on biosecurity, trade and food safety & security, as well as how it provides science advice to support policy."
        },
        {
            "text": "APHA’s Yvonne Spencer then gave an overview of the extensive range of national and international partners they engage with, including academic links and interactions with other government departments. The breadth is both impressive and important. A feature of science is that it is always open to challenge, and a broad base of partners ensures that challenge comes from diversity."
        },
        {
            "text": "I particularly enjoyed hearing from some of the UK’s leading specialists in animal health, ranging from avian flu through to tuberculosis (TB) to antimicrobial resistance (AMR). APHA has access to deep expertise and has developed the capability to adapt and respond to emerging animal health risks."
        },
        {
            "text": "My visit marked the start of World Antimicrobial Awareness Week 2022, so it was timely that part of our tour included a presentation from APHA scientist, Muna Anjum, on the work ongoing at APHA on AMR. AMR is one of the biggest threats to global health, food security and development, which cannot be managed effectively without considering the health outcomes of humans, animals and the environment together."
        },
        {
            "text": "Of course, it was also timely to hear about APHA’s efforts to tackle the ongoing outbreak of avian influenza. It was an opportunity to discuss how to ensure that we have the broadest scientific input to help understand the outbreak trajectory and potential mitigation.     "
        },
        {
            "text": " "
        },
        {
            "text": "Finally, I was excited to see the plans to redevelop existing facilities and construct a new Science Hub at Weybridge. The investment and redevelopment of these facilities is essential and will ensure that this site continues to be crucial in protecting the UK from animal disease and future outbreaks.  "
        },
        {
            "heading": 3,
            "text": "Subscribe to our science blog"
        },
        {
            "text": "Throughout the year, we publish blogs which highlight the breadth of scientific work we are involved in as well as sharing our latest news and events we have attended."
        },
        {
            "text": "Subscribing to our blog takes seconds and you will receive instant email alerts as soon as new blogs are published so why not subscribe today!"
        }
    ]
}