{
    "url": "https://environmentagency.blog.gov.uk/2022/12/15/supporting-the-siting-process-for-a-geological-disposal-facility-gdf/",
    "title": "Supporting the Siting Process for a Geological Disposal Facility (GDF)",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2022-12-15T11:44:46+00:00",
    "content": [
        {
            "text": "Eddie Osondu, a Nuclear Regulator at the Environment Agency (EA), reports on our work in west Cumbria and Lincolnshire to share information with communities about how we will regulate a future geological disposal facility."
        },
        {
            "text": "I’ve worked with the Environment Agency for 14 years and my background is in chemistry and environmental science. I specialise in regulating the management and disposal of radioactive waste. I’m providing regulatory support and advice about Nuclear Waste Services’ (NWS) project to find a site for a GDF, and specifically I’m leading our work with the Theddlethorpe GDF community partnership."
        },
        {
            "text": "Geological disposal – Why do we need a GDF? "
        },
        {
            "text": "Before I talk about my work, here’s the background on geological disposal."
        },
        {
            "text": "Much radioactive waste has already been produced because of the UK’s nuclear power, research and defence programmes. The UK government has decided that geological disposal is the best available approach for managing higher activity radioactive waste in the long term."
        },
        {
            "text": "We will be responsible for making sure that any geological disposal facility in England meets the required high standards for protecting people and the environment when it is being developed, while it is operating and after it has closed. Have a look at our animation about our role."
        },
        {
            "text": "Nuclear Waste Services (NWS) is responsible for developing a geological disposal facility. We have established agreements with NWS to provide regulatory advice and to scrutinise its work. You can read about our ongoing reviews of this work in our annual report published in December 2022."
        },
        {
            "text": "Working Groups and Community Partnerships"
        },
        {
            "text": "My colleague wrote about our engagement with GDF working groups last December."
        },
        {
            "text": "In the past year three GDF working groups have evolved into four GDF Community Partnerships (CP). There are three in Cumbria - south Copeland, mid Copeland and Allerdale. The newest Community Partnership formed in Lincolnshire in June 2022."
        },
        {
            "text": "My colleagues and I talked to each of the Working Groups about our regulatory work. Before engaging with the new Community Partnerships, we learned more about their role and the difference between them and the working groups."
        },
        {
            "text": "The CP has several tasks. It will be facilitating discussion with the community and identifying relevant information that people in the Search Area and Potential Host Community want or need about the process. An example of this could be that the community tell the CP they want to know more about the impact of a GDF on the environment or how the radioactive waste will be packaged and checked before it is disposed of. That’s related to our role, so the CP will ask me to come along and talk to the CP and community about our work."
        },
        {
            "text": "The CP will also be the main vehicle for community dialogue with the developer, it will review and refine the boundaries of the Search Area as investigations progress, and it will also identify priorities for Community Investment Funding."
        },
        {
            "text": "Significantly the CP will make recommendations to the local authority(ies) on whether to invoke the Right of Withdrawal and if/when to launch a test of public support. It’s important to note that regulators don’t have any role in decisions about a site selection. Read more about our role here."
        },
        {
            "text": "Our work to support communities"
        },
        {
            "text": "We’ve been supporting the CPs by attending public events, promoting our regulatory role and organising our own events to inform CP members. We’ve talked about when our regulation of a future GDF will start and how we will regulate it, alongside the Office for Nuclear Regulation (ONR). As independent regulators, our formal regulation will start after selection of a site (or sites) for intrusive investigations."
        },
        {
            "text": "In the spring, we attended exhibitions organised by the Theddlethorpe GDF Working Group to talk with members of the community about geological disposal. It provided a great opportunity to meet local people."
        },
        {
            "text": "We heard mixed views and listened to concerns about the impact of a GDF on the environment. Some residents were concerned about the level of flood and coastal erosion protection a GDF would need and said that such a scheme would simply move the risk elsewhere along the coast. We gave assurance that our permitting process will include a flood risk assessment. We highlighted that our regulation would ensure protection of people and the environment now and in the future."
        },
        {
            "text": "And it’s not just our national nuclear regulation team that’s out working with communities on this issue. Our area team in Lincolnshire has also started engaging with Nuclear Waste Services (NWS) including providing information about the flood zone categorisation of the Theddlethorpe area."
        },
        {
            "text": "We hope to get out and meet stakeholders and communities in west Cumbria and Theddlethorpe in the months ahead."
        },
        {
            "text": "If you have questions or would like us to talk to your community group please contact us: nuclear@environment-agency.gov.uk."
        }
    ]
}