{
    "url": "https://naturalengland.blog.gov.uk/2022/12/15/the-battery-powered-partnerships-of-nature-recovery/",
    "title": "The “battery-powered” partnerships of Nature recovery",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery Network",
        "Parks, trails and nature reserves",
        "Protected sites and species",
        "Site of Special Scientific Interest",
        "Uncategorized"
    ],
    "pub_date": "2022-12-15T13:24:55+00:00",
    "content": [
        {
            "text": "Blog by Tony Juniper CBE, Chair of Natural England"
        },
        {
            "text": "I’m writing this blog from COP 15 in Montreal where nations of the world have come together to discuss one of the most urgent issues of our age: how do we turn around the dramatic declines in Nature and give ourselves a fighting chance of a sustainable, prosperous future?"
        },
        {
            "text": "The threat to people and planet posed by the death loop of climate and biodiversity breakdown is so great that it can only be lifted by a partnership approach. Work is taking place across the conference to find the common ground and goals that can help us to seize this opportunity; one that is regarded as a once-in-a-decade moment, but which realistically is far more important than that."
        },
        {
            "text": "A number of countries, including the UK Government, have already made international commitments to supporting Nature’s recovery, including in 2021 through the G7 2030 Nature Compact - working towards protecting 30 per cent of land and seas by 2030 and it is vital that COP 15 brings other nations on board too."
        },
        {
            "text": "We at Natural England are proud to be supporting this ambition through a number of our functions and partnerships. Colleagues across the nations of the UK are similarly ambitious, with the announcement this week of a comprehensive programme for Nature recovery in Scotland presenting a timely case in point."
        },
        {
            "text": "Just over the last 12 months we have declared and protected more than 10,000 hectares for Nature conservation, safeguarding special places. Recent designations include the Swanscombe Peninsula Site of Special Scientific Interest (SSSI) and Somerset Wetlands National Nature Reserve (NNR) where people can experience the wonders of the natural world."
        },
        {
            "text": "It was fitting that we demonstrated Natural England’s ongoing commitment to NNRs on the 70th anniversary of the first ones. This will continue into 2023 when, under our designation programme, we are planning to make a further significant contribution to restoring Nature by considering a raft of new or extended SSSIs and NNRs developed with nature recovery in mind, delivered through collaborative partnerships. We have published details of those areas where we are considering NNR or SSSI status next year.  [Natural England designations programme for areas, sites and trails - GOV.UK (www.gov.uk)]."
        },
        {
            "text": "We will work closely with stakeholders in those areas, as we begin a period of reviewing evidence and understanding current management practices while building an appreciation of what designation means and its benefits. That does not mean all will necessarily move forward to be designated, but if confirmed, they will create almost 8000 hectares more land protected and managed for nature (2900 hectares of SSSI and 5000 hectares of NNR), another important step towards fulfilling the 30x30 pledge. We look forward to sharing more details of these exciting proposals as discussions progress and will ensure that the means by which we consider these proposals is fair and transparent."
        },
        {
            "text": "Supporting targets to protect and manage at least 30 per cent of land and at least 30 per cent of seas by 2030 is a critical foundation for the conservation and restoration efforts required this decade: SSSIs provide high levels of legal protection for the nation’s finest examples of wildlife and natural features, while NNRs require a site to be managed primarily for conservation and offer opportunities for people to connect with – and study – the natural world. These designations have been central to our efforts to prevent the loss of Nature in the face of the many powerful pressures that have during recent decades led to the decline of the natural world."
        },
        {
            "text": "We are now working with partners to derive even more from these sites, going beyond protection to active nature recovery, restoring ecosystems to create more dynamic wildlife communities that are resilient to climate change. Together they are providing a wider range of services to a wider range of people, including storing carbon, providing sustainable food production and clean water and air, reducing flood risk and creating Nature-rich places for people to enjoy."
        },
        {
            "text": "These places are also now acting as the “battery packs” powering Nature recovery, at the heart of new, joined-up habitat that will support a Nature Recovery Network across the country. Such designations are vital, but they are just one part of the story when it comes to meeting the target and we know our 650 partners - businesses, landowners, e NGOs - in the growing Nature Recovery Partnership will also be thinking about their contributions."
        },
        {
            "text": "30x30 targets are fundamental in providing the supporting framework that allows our protected sites to flourish. At the same time, if we are to reverse the decline in Nature loss at scale and at pace - we need to be restoring nature across all of England: which is why we are also using other mechanisms/taking other action."
        },
        {
            "text": "Nature Recovery Projects, for example, represent a new approach to conservation. Many incorporate protected sites such as SSSIs but extend beyond them. Their scale, potential and partnership working means they can press the accelerator on Nature recovery in pursuit of our biodiversity and habitat targets. Six have come on stream since 2021, a further six are in development for launch next year. The first tranche covers over 120,000 hectares - almost the same area as England’s 221 NNRs - and these multi-partnership projects are creating and restoring wildlife-rich habitats, corridors and stepping-stones which will help wildlife populations to move and thrive across town and countryside alike."
        },
        {
            "text": "National Parks and Areas of Outstanding Beauty are also a huge part of the emerging conservation picture in the 21st century, collectively they are approximately 24 per cent across England, National Parks are 10 per cent - which gives them enormous potential in relation to 30x30 targets. The delivery bodies managing these designated landscapes - are well placed to bring together the communities, businesses, landowners and organisations who each have a role in making these landscapes even more attractive, Nature-rich places for local people and visitors. Natural England will continue to support them to fulfil their potential through our joint agreement with National Parks England and the National Association for AONBs to take forward our shared ambitions, as well as through our Natural England Landscape Advisory Panel (NELAP) to provide expert advice, support and challenge in delivering our landscape leadership role."
        },
        {
            "text": "Nature recovery will not only increase the beauty and the benefits that wildlife rich places bring to people and Nature, it will recover species that have disappeared from their natural habitats. In 2023 Natural England is increasing action to meet the species abundance target established in the Environment Act through an expanded Species Recovery Programme. We are also developing a species recovery and reintroduction action plan, in addition to providing technical expertise and support to the new species reintroductions task force."
        },
        {
            "text": "It is efforts like these that will help to make the difference for Nature that COP 15 delegates are striving to achieve and I hope, encourage others to join the partnership for Nature’s recovery. In the end major summits like that taking place in Montreal are only as good as the work done to achieve their aims. At Natural England we are all set to ramp up already significant efforts for Nature’s recovery, translating the spirit of Montreal from a necessary global ambition into practical action on the ground."
        },
        {
            "text": " "
        }
    ]
}