{
    "url": "https://traderemedies.blog.gov.uk/2022/12/15/trout-tiles-and-tariffs-trade-remedies-matter-to-consumers-too/",
    "title": "Trout, tiles and tariffs: trade remedies matter to consumers too",
    "authors": [
        "Roshni Haria, Assistant Economist",
        "Olivia Vail, Economic Analyst Intern"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-12-15T09:03:34+00:00",
    "content": [
        {
            "text": "As economic uncertainty rises, UK households grapple with a rising cost of living, whilst the consumer confidence index has fallen to record lows (Organisation for Economics Cooperation and Development, 2022). We’ve previously looked at the link between the UK’s economic and fiscal outlook and trade remedies. In this blog post, we look back at some of our past cases to discuss how the Economic Interest Test (EIT) measures trade injustices and their consequent remedies and how this impacts consumers."
        },
        {
            "text": "The Trade Remedies Authority’s public file displays our active investigations. Most typically, it is industries that are affected by trade remedies, however our cases can directly involve consumer products too – examples include rainbow trout, ironing boards, and ceramic tiles. Other cases, such as biodiesel and optical fibre cables, impact consumers indirectly as they involve goods that are used in producing consumer products."
        },
        {
            "heading": 2,
            "text": "How does the EIT address the impact of a trade remedy measure on downstream supply chains and consumers?"
        },
        {
            "text": "In our Economic Interest Test, we consider the impact of a trade measure on a range of stakeholders. This includes UK producers competing with foreign firms and exporters as well as upstream and downstream industries, UK importers and consumers."
        },
        {
            "text": "For example, if a measure is imposed on mattress springs from Country X, the price of imported mattress springs from X will rise. For the downstream mattress industry that uses springs as inputs in their production, this might mean an increase in their costs. They then might pass these higher costs through to consumers of mattresses in the form of higher prices."
        },
        {
            "text": "The impact on the downstream mattress industry also depends on several other factors including, but not limited to, the extent to which the demand for springs decreases when prices increase, the industry’s current profit margins, the proportion of the cost of a mattress made up by springs, and their ability to switch between suppliers in different countries to the one facing a measure."
        },
        {
            "text": "We also consider other factors which might impact demand and supply, such as the COVID-19 pandemic, the Russian invasion of Ukraine, and the UK’s exit from the European Union."
        },
        {
            "heading": 2,
            "text": "How have we put this into practice in our cases?"
        },
        {
            "text": "Here are some examples from our cases so far."
        },
        {
            "text": "In our EIT for Biodiesel from the United States and Canada, we estimated the likely impact on prices for UK consumers. The Department for Transport’s data on the number of diesel cars on the road (11.9 million at the end of 2020), and diesel consumption by cars and taxis (12.2 billion litres in 2018), showed an average diesel consumption of around 1,000 litres per car each year. Our calculations showed that even a small difference in the price per litre could have sizeable aggregate impacts on UK consumers: a 1p/litre change would be equivalent to around £120 million across all cars. However, this would be equivalent to just £10 per car (0.8% of the estimated average total spend of £1,263 per year), leading us to conclude that the impact on individual consumers would be minimal."
        },
        {
            "text": "In our Statement of Essential Facts (SEF) for HFP Rebar from the People’s Republic of China (PRC), we considered that demand for rebar from the downstream construction sector might be lower due to the pandemic than it would be otherwise. We also predicted that imports from Russia, Belarus, and Ukraine might decrease due to the Russian invasion of Ukraine. This could have led to insufficient supply if UK production or imports from other countries did not replace imports from these three countries."
        },
        {
            "text": "Our investigation into rainbow trout from Turkey considered the structure of the market and how that would affect consumers. We noted that there are different types of rainbow trout in the market, and a trend in consumer demand away from whole/fresh rainbow trout, towards smoked, frozen, and other pre-packaged products. As frozen and smoked rainbow trout can be transported longer distances, it would have been easier for these imports from Turkey to compete with domestic equivalents. One of the reasons we felt it was justified to recommend a tariff was that domestic producers were more vulnerable against international competition for frozen products."
        },
        {
            "text": "In our assessment of the impact of a measure on the competitive environment in the UK, we also consider the impact on the choices and information available to consumers. The might involve comparing Product Control Numbers (PCNs) produced in the country under investigation with those produced domestically. We can then assess whether they are significantly different. If a measure would increase the price of certain products that are not produced in the UK, we would consider this in our EIT."
        },
        {
            "text": "For instance, in our case on safeguards on certain steel products, we considered certain grades of specific products that could not be produced in the UK. In order to protect their clients in downstream industries, the major UK manufacturer therefore requested the revocation of a measure on this product category, which we accepted."
        },
        {
            "text": "Our EIT also involves research to identify if a measure would disproportionately impact any groups with protected characteristics, in accordance with the Public Sector Equality Duty (PSED). For example, in our case on Rainbow Trout, we had evidence from Seafish, a UK public body, which suggested that fish consumption increased with age and affluence. However, in the absence of data on the characteristics of rainbow trout consumers and knowing that it was not a ‘top five’ seafood species by sales to UK consumers, we concluded that the benefits of revoking the existing trade remedy measure on Rainbow Trout for lower income consumers would be minimal."
        },
        {
            "heading": 2,
            "text": "How to get involved"
        },
        {
            "text": "We invite responses from a range of interested parties and contributors and are keen to hear from those likely to be positively or negatively affected by our recommendations. If you are a consumer or downstream business, you can look out for questionnaires such as those published for Ironing Boards from Turkey or Optical Fibre Cables from the PRC."
        },
        {
            "text": "To see how we considered supply chains and consumers for other consumer goods, you can read the SEFs for Biodiesel from the United States and Canada. You can also look out for more details on Ironing Boards from Turkey, Optical Fibre Cables from China, and Ceramic tiles from the PRC."
        }
    ]
}