{
    "url": "https://defrafarming.blog.gov.uk/2022/12/15/watch-farming-in-protected-landscapes-in-the-lake-district/",
    "title": "Watch: Farming in protected landscapes in the Lake District",
    "authors": [
        "Kate Corfield",
        "Graham Higgins"
    ],
    "categories": [
        "environmental land management schemes",
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2022-12-15T13:30:32+00:00",
    "content": [
        {
            "text": "In the second of our series of films from the Lake District, local farm facilitator Danny Teasdale took us to meet Jasmine Holliday."
        },
        {
            "text": "Jasmine is a Farming Officer in the Lake District National Park and she works on the Farming in Protected Landscapes programme.In this film, Jasmine talks about the ambitions of the programme, which type of projects can get funding, and what works best in the Lake District National Park. A transcript of the film is also available. "
        },
        {
            "text": "The Lake District National Park is just one of the 44 Protected Landscapes in England working closely with farmers to deliver the Farming in Protected Landscape programme."
        },
        {
            "text": "The Farming in Protected Landscapes programme provides funding for farmers and other land managers to work in partnership with National Parks and AONBs (Areas of Outstanding Natural Beauty) to deliver projects on the themes of climate, nature, people and place."
        },
        {
            "text": "The programme opened to applications in summer 2021. So far, it has supported over 1,600 diverse projects across England."
        },
        {
            "text": "Some of these projects are captured in the Farming in Protected Landscapes brochure. A little while ago, I blogged about how some farmers in protected landscapes are using their funding. Starting next year, we'll feature more projects here on the blog, more regularly, so you can follow their progress."
        },
        {
            "text": "The programme  is still open to all farmers and land managers within an AONB or National Park in England, or the Broads."
        },
        {
            "text": "If you’re interested in applying to the programme please do get in contact with your local Protected Landscape."
        },
        {
            "text": "More information on what the programme will pay for and how to apply can be found on the Farming in Protected Landscapes guidance page."
        },
        {
            "text": "Thanks to Jasmine for taking part in this film."
        }
    ]
}