{
    "url": "https://insidedio.blog.gov.uk/2018/08/20/managing-the-overseas-estate-the-importance-of-local-staff/",
    "title": "Managing the Overseas Estate: the importance of local staff",
    "authors": [
        "Brigadier Simon Stockley"
    ],
    "categories": [
        "BATSUB",
        "Belize",
        "Canada",
        "Cyprus",
        "Falkland Islands",
        "Kenya"
    ],
    "pub_date": "2018-08-20T15:13:20+00:00",
    "content": [
        {
            "text": "Hi, I’m Brigadier Simon Stockley and I’m responsible for the provision of infrastructure to support our personnel in their bases overseas, while simultaneously providing Defence training facilities in the UK and around the world. Today I wanted to take the opportunity to explain the important role that our Locally Employed Civilians (LECs) play overseas to ensure that service personnel have a safe place to live, work and train."
        },
        {
            "text": "The Americas"
        },
        {
            "text": "Let’s start in South and North America and work our way east. Firstly, the Falkland Islands, which has our smallest detachment of just one LEC. Responsible for communicating with the Falkland Islands Support Unit, Joint Forces Logistics Unit and our supply chain partners Sodexo and Interserve, she authorises contractor flights and manages accommodation and welfare packages for those deployed in the Falklands."
        },
        {
            "text": "Moving north, in Belize, we have 66 LECs who provide critical infrastructure support and life cycle replacement work to maintain the estate infrastructure. Our LECs recently carried out work to reactivate service family accommodation, replace high voltage electrical cabling and refurbish exercise accommodation."
        },
        {
            "text": "A LEC from Belize working on some plumbing. [Crown Copyright]North again to Canada, where we have over 100 LECs working in different departments to support the British Army Training Unit Suffield, whose mission is to deliver mounted and dismounted combined arms manoeuvre training to up to 8,000 soldiers a year taking part in the series of exercises known as Prairie Storm."
        },
        {
            "text": "DIO's team are vital to providing essential training for British forces in Canada. [Crown Copyright/MOD 2015]They also manage accommodation for up to 3,000 soldiers and around 130 Service families, including a site in the Rocky Mountains near Calgary."
        },
        {
            "text": "Europe"
        },
        {
            "text": "Across into Europe, we have 120 LECs working in the Sennelager Training Area, Germany, which provides fixed and manoeuvre ranges for service personnel to practise firing their weapon systems, from their personal rifles to massed artillery. Our range wardens, security patrol drivers and those responsible for running range control operate a safe place for the UK military and international colleagues to train in Germany, while keeping the civilian population safe. It has now been decided that the British Army will retain the Sennelager Training Area, and we are now working with colleagues to determine what levels of support we will require to provide to retain and maintain these valuable training."
        },
        {
            "text": "Dogs and their handlers from 102 Military Working Dogs Sqn taking part in a live fire exercise on the Sennelager Ranges in Germany. [Crown Copyright/MOD 2016]Further south in Gibraltar we have ten LECs who are responsible for supporting the maintenance of the strategic communications, airfield and harbour. In doing so they are responsible for the delivering of fuel across the estate, collecting and disposing of hazardous waste, providing support in emergencies, maintaining equipment and assisting our contractors working in Gibraltar."
        },
        {
            "text": "Finally, 25 LECs work in Cyprus, including engineers, chartered surveyors and administration staff who work in travel, finance and facility management; in effect we represent the local authority across the British bases. They liaise with the Republic of Cyprus government on issues such as land management, legislation and the provision of water. They also maintain infrastructure for around 5,000 buildings and facilities, including the strategically important airbase at RAF Akrotiri. As one example of the loyalty and dedication shown to the British Armed Forces by our local staff, the team in Cyprus recently said a sad farewell to Mr Andreas Panayiotou, who enters retirement following 62 years of service."
        },
        {
            "text": "Africa"
        },
        {
            "text": "Moving to Africa, in Kenya we have 135 LECs, who are responsible for providing a safe place to train for light forces, and elements of the Joint Helicopter Force, who conduct live and dry training on land that includes mountains, dry and arid terrain and jungle."
        },
        {
            "text": "Some of the Kenya team at work. [Crown Copyright]The team use helicopters to clear people and wildlife from range danger areas, while liaising with the Kenya Defence Force and local communities to ensure the safety of exercising troops and the local population. This includes Samburu tribesman, whose bushcraft is second to none, and our troops have learned many important lessons on tracking, which they have put into good effect in countering improvised explosive devices on operations. Our LECs also carry out mandatory compliance checks and preventative maintenance in three major camps, with over 400 assets which support deployed troops."
        },
        {
            "text": "Asia"
        },
        {
            "text": "Moving to the Far East, we have 16 LECs in Singapore who run the strategic oil fuel depot for UK and foreign naval vessels. During refuelling they connect hoses, walk on top of each tank and measure the fuel levels and drain pipelines. They also conduct weekly maintenance work to pumps and tanks."
        },
        {
            "text": "Some of the Singapore team working with the fuel for a Royal Navy vessel. [Crown Copyright]On top of the world, 63 LECs in Nepal play a crucial role in treating and distributing water, and power generation. The site engineers, foreman, design staff and artisan trades help to run the estate and without their hard work, the British Gurkhas would not be able to operate in Nepal; this includes the important annual assessment of new recruits for the British Army."
        },
        {
            "text": "One of our Nepali team working in the Standby Generator Room. [Crown Copyright]Completing the Far East region are the 30 LECs in Brunei, who carry out essential maintenance and construction work to over 1,200 buildings paid for by the Sultan of Brunei. This can vary from gas checks, plumbing, electric repairs and painting. Our LECs communicate and build strong working relationships with our contractors and suppliers who conduct site inspections. They are also the main point of contact for military personnel to report faults to, including power cuts caused by small lizards electrifying themselves!"
        },
        {
            "text": "Our LECs are a critical component of the DIO family, fundamental to supporting UK MOD personnel and our families overseas."
        },
        {
            "text": "Finally, my team always have a number of exciting opportunities for UK Civil Servants overseas. If you have been inspired by my blog and, have a sense of adventure, a willingness to experience new cultures and a desire to work with supporting service personnel preparing for, and on, operations, check Civil Service Jobs to see what roles are available today."
        },
        {
            "text": " "
        }
    ]
}