{
    "url": "https://skillsengland.blog.gov.uk/2025/11/11/building-the-skills-system-britain-needs-skills-englands-role-in-post-16-reform-by-tessa-griffiths-and-sarah-maclean/",
    "title": "Building the Skills System Britain needs: Skills England's role in Post-16 Reform, by Tessa Griffiths and Sarah Maclean",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "analysis",
        "Insight",
        "News and announcements",
        "post-16 white paper",
        "Strategy"
    ],
    "pub_date": "2025-11-11T13:09:06+00:00",
    "content": [
        {
            "text": "The government's Post-16 Education and Skills White Paper marks a pivotal moment, setting out the Government’s plan for a world-leading skills system which meets the needs of employers, drives innovation and improves people’s lives."
        },
        {
            "text": "Skills England will be at the heart of delivering this comprehensive vision for change. The White Paper, alongside our new remit letter from The Rt Hon Pat McFadden, Secretary of State for Work and Pensions, sets out the strategic direction for our work in the coming years and will shape our priorities as we build a skills system that drives growth and widens opportunity. "
        },
        {
            "heading": 2,
            "text": "Data-driven planning: creating a single authoritative voice"
        },
        {
            "text": "As the White Paper notes, Skills England will be the single authoritative voice on England’s current and future skills needs, aligning national with regional skills needs."
        },
        {
            "text": "We have published four data and insight-driven reports covering skills challenges, sector-specific analysis, future employment demand, and AI upskilling needs across 10 growth sectors. "
        },
        {
            "text": "Our Assessment of priority skills to 2030 report found that we will need 900,000 more skilled workers in our priority sectors in the next 5 years, with two-thirds requiring qualifications at Level 4 and above. It will be critical, then, that we make progress towards the government's ambitious new target of two-thirds of young people participating in higher-level learning by age 25, with the sub-target of at least 10% of young people doing an apprenticeship or another form of higher technical education. "
        },
        {
            "text": "We're working with the Industrial Strategy Advisory Council and Migration Advisory Committee as part of the Labour Market Evidence Group. Together, we're creating a robust evidence base to rebalance the labour market away from over-reliance on international recruitment towards improved domestic training. We are working with other government departments, businesses, and industry bodies to support sector workforce planning, providing analysis, advice, and delivery partnership to help develop the domestic pipeline of workers. "
        },
        {
            "text": "This isn't just about national planning. We're also working closely with Strategic Authorities (including metro mayors) and Employer Representative Bodies to align regional and national skills policy. We need to work together on local labour market challenges, ensuring that Local Skills Improvement Plans, Local Growth Plans, and Get Britain Working Plans work together effectively to connect local people with key jobs in their economies. "
        },
        {
            "heading": 2,
            "text": "Employer partnership and investment: building the workforce the country needs "
        },
        {
            "text": "Employers are at the heart of our vision for better skills for better jobs. We will support them to invest in their workforce through a suite of technical qualifications, apprenticeships, and training products that lead to employment, all based on employer-designed occupational standards."
        },
        {
            "text": "We are harnessing artificial intelligence and data analytics to ensure these occupational standards remain responsive to changing economic demands. The White Paper reaffirms our commitment to prioritise the 10 highest impact sectors and to work in partnership with other departments and industry, supporting the workforce planning plans and delivering the four funded skills packages in Construction, Engineering, Digital, and Defence. "
        },
        {
            "text": "Through job plans we will provide a clear direction of travel for national and local government, public services and industry to develop the domestic workforce together and facilitate the sector-level and local collaboration necessary for business to invest further in skills pipelines."
        },
        {
            "text": "The White Paper also introduces further qualification reforms, including the introduction of V Levels as a new vocational pathway alongside A Levels and T Levels.  V Levels will offer young people more choice and flexibility, allowing them to mix vocational and academic study or explore different sectors before specialising. V levels will be linked to occupational standards and we look forward to working closely with the Department for Education as this work is taken forward."
        },
        {
            "heading": 2,
            "text": "Inclusive access and quality: leaving no learner behind "
        },
        {
            "text": "Skills England is committed to building a skills system that works for everyone, particularly those who face the biggest barriers to opportunity. The White Paper's NEET (not in education, employment, or training) prevention package directly responds to our analysis showing that 18-24 year-olds qualified below Level 2 are 75% more likely to be NEET than the average young person, rising to 180% more likely for disadvantaged young people with special educational needs (SEND).  "
        },
        {
            "text": "The White Paper's commitment to £1.2 billion additional annual investment in skills by 2028-29 reflects the government's recognition that skills are fundamental to economic growth and social mobility. Skills England intelligence will inform the advice that people receive at all stages of their adult lives, through links with the National Jobs and Careers Service. Our research will also give a firm basis for the Department for Work and Pension’s understanding of how training can provide pathways into work for a variety of cohorts, including those at risk of becoming NEET."
        },
        {
            "heading": 2,
            "text": "Take action: help shape the future of skills  "
        },
        {
            "text": "The changes outlined in the White Paper represent more than policy reform – they're about creating pathways to prosperity for millions of people whilst building the skilled workforce our economy needs. But we cannot deliver this transformation alone. "
        },
        {
            "text": "We need your voice. Whether you're a business leader, education provider, local authority, learner, or community organisation, your insights and experiences are vital to getting this right. "
        },
        {
            "text": "In our next White Paper blog post, Phil Smith, Chair of Skills England, will explain how you can get involved in the consultation on the White Paper and share your feedback on these reforms. Your input will directly shape how we implement these changes and ensure they work for your community, your business, and your learners. "
        },
        {
            "text": "The challenge is significant, but so is our determination to build a skills system that truly works for everyone – learners, employers, and communities across Britain. Together, we can build the skills system the country needs. "
        },
        {
            "text": "Tessa Griffiths and Sarah Maclean "
        },
        {
            "text": "Joint Chief Executives, Skills England "
        }
    ]
}