{
    "url": "https://mhclgmedia.blog.gov.uk/2025/11/11/coverage-of-the-standards-and-conduct-announcement/",
    "title": "Coverage of the standards and conduct announcement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Local government",
        "Uncategorized"
    ],
    "pub_date": "2025-11-11T12:29:56+00:00",
    "content": [
        {
            "text": "Today, the Ministry of Housing, Communities and Local Government announced planned reforms to provide local authorities with powers to clean up local politics. This responds to the challenges local authorities have faced since the Localism Act in 2011, which has left them unable to respond to incidents of misconduct and poor behaviour."
        },
        {
            "text": "The announcement was covered across national outlets including PA, The Mirror, and The Guardian."
        },
        {
            "text": "PA (Jonathan Bunn) ran a piece on the wire highlighting that proposals will ‘clean up local politics’ to restore public confidence including introducing suspension powers, withholding allowances and banning individuals from premises in a raft of measures that will be tougher than the existing Localism Act 2011."
        },
        {
            "text": "The Mirror (Sophie Huskisson) ran a straight piece which outlines the measures that are being introduced. It notes that \"bad actors” misbehaviour within local authorities is being rooted out with new powers such as suspensions and having their allowances withheld."
        },
        {
            "text": "The Guardian (Eleni Courea) also report that mayors and councillors in England face suspensions of up to six months for serious misconduct and repeated rule breaches. The piece mentions two examples of cases with councillors this year who were convicted for serious offences but remained in post until they were handed prison sentences."
        },
        {
            "text": "This morning, Minister for Local Government and Homelessness, Alison McGovern, also gave interviews to Times Radio, Sky News, LBC, Good Morning Britain, ITN , GB News and Bauer to talk about the impact the measures will have and how it ties in with the government’s wider local government reforms."
        },
        {
            "text": "The announcement is also covered in trade outlets, including the Local Government Chronicle and Municipal Journal, who note that the measures are being proposed to clean up local politics and restore public confidence. "
        },
        {
            "text": "Secretary of State, Steve Reed, said:"
        },
        {
            "text": "Secretary of State for Ministry of Housing, Communities and Local Government, Steve Reed, said:  "
        },
        {
            "text": "\"I know firsthand the dedication and talent within our local authorities up and down the country.  "
        },
        {
            "text": "\"But when a small minority behave badly, it's a disservice to those hardworking councillors and to taxpayers – distracting from the incredible work happening in our communities every day.  "
        },
        {
            "text": "\"We must clean up local politics by rooting out those who bring the system into disrepute. These reforms will give councils and mayoral authorities the power to do exactly that.”  "
        },
        {
            "text": "Minister of State for Local Government and Homelessness, Alison McGovern, said:   "
        },
        {
            "text": "\"The vast majority of councillors are dedicated public servants working hard for their communities. These reforms will raise the bar and ensure swift, fair action where it's needed most."
        },
        {
            "text": "\"Residents deserve the highest standards from their representatives, and those standing for election deserve more back up when things go wrong."
        },
        {
            "text": "“With Town Hall austerity for the poorest places, and rising abuse, being a local councillor is harder than ever.  But our country needs local leaders who will stand up for people.  These changes are the first step on the road to recovery for local democracy."
        },
        {
            "text": "\"These measures will help create a safer, more respectful environment that builds trust and helps attract the best and brightest talent into local government, giving residents the representation they deserve.” "
        }
    ]
}