{
    "url": "https://naturalengland.blog.gov.uk/2025/11/11/how-citizen-scientists-are-helping-to-close-the-freshwater-data-gap/",
    "title": "How citizen scientists are helping to close the freshwater data gap",
    "authors": [
        "Amy Stocking",
        "Matilda Dixon"
    ],
    "categories": [
        "Biodiversity",
        "Ecosystem Services",
        "Education",
        "Natural Capital",
        "Natural England",
        "Nature",
        "Nature Recovery Network",
        "Science and evidence"
    ],
    "pub_date": "2025-11-11T15:00:00+00:00",
    "content": [
        {
            "text": "By Amy Stocking and Matilda Dixon, Higher Officers for Citizen Science"
        },
        {
            "text": "Ponds may be small, but they punch well above their weight when it comes to biodiversity, supporting around two-thirds of all freshwater species in the UK. Yet they have long been understudied, especially in urban areas. It’s a lack of data which presents a challenge, especially at a time when public and government attention is focused on our freshwater environments. "
        },
        {
            "text": "Fortunately, however, help may be on its way… Over the last three years, as part of Defra’s Natural Capital and Ecosystem Assessment programme, Natural England has been working with partner organisations and citizen scientists to better understand and protect these crucial habitats. The result has been three innovative initiatives – GenePools, the Priority Ponds Project, and the Urban Pond Count – which have placed the power of freshwater research directly into the hands of the public. By testing new technologies and accessible methods, these projects are providing new ways for non-experts to meaningfully contribute to large-scale environmental data collection."
        },
        {
            "text": "Unlocking pond biodiversity through eDNA with the Natural History Museum and Cefas: GenePools"
        },
        {
            "text": "Running from 2021 to 2025, GenePools has been an ambitious partnership involving Natural England, the Natural History Museum, CEFAS (the Centre for Environment, Fisheries and Aquaculture Science), and JNCC (the Joint National Conservation Committee).  Its goal? To explore the biodiversity of urban ponds using environmental DNA (eDNA) testing. eDNA sampling allows scientists to detect and classify species based on the genetic material they shed into the environment. While it’s still a relatively recent addition to the ecological toolkit, it has the potential to become a foundational one, with uses and methods currently being explored across Natural England and beyond."
        },
        {
            "text": "A major challenge for scientists seeking to understand urban ponds is their inaccessibility, as most are tucked away in private gardens. But with more than 80% of the UK population living in urban areas, they’re ideal for a citizen science approach. The Natural History Museum, which led engagement for GenePools, invited volunteers from six cities to collect water samples for analysis, recruiting participants from pre-schoolers to retirees. Their collective efforts resulted in the sampling of over 750 ponds and the identification of thousands of species: insect DNA appeared in 98% of ponds, frog DNA in 53%, and mammal DNA in 50% – including one weasel in a pond in Bristol!"
        },
        {
            "text": "Results from each participant’s own pond were shared via user-friendly apps and reports – meaningful feedback at a local level which reinforces the value of individual contributions to a wider scientific effort. At a larger scale, meanwhile, over 70,000 records are in the process of being added to the National Biodiversity Network Atlas  – some of the first DNA-based records to enter the UK’s largest open-access collection of biodiversity information. Further research into the results by our partners Cefas is ongoing. "
        },
        {
            "text": "But GenePools wasn’t just about data collection; its main purpose was to refine the sampling techniques and the engagement strategies needed to make eDNA-based monitoring practical and scalable for citizen scientists in the future, and to explore the potential for integration of this data with professional pond and eDNA datasets. For example, by aligning the methods used with the England Ecosystem Survey, which is undertaking professional pond eDNA surveys in rural areas across the country, we’ve been able to ensure that the GenePools data can become part of a national picture,  feeding into initiatives like the new pond health metric which is currently in development."
        },
        {
            "text": "Mapping and measuring with the Freshwater Habitats Trust: Priority Pond Assessments and the Urban Pond Count"
        },
        {
            "text": "While GenePools investigated the detailed make-up of urban pond communities, we also lack data on the overall condition of ponds across the UK, and even on how many ponds there are in urban areas. To start answering these questions, we’ve worked with partners the Freshwater Habitats Trust (FHT) to create the Priority Pond Assessment and the Urban Pond Count."
        },
        {
            "text": "‘Priority habitat’ is a national designation, and carries with it legal protections. Fewer than 2% of England’s ponds are designated as ‘priority’ at present, despite estimates which suggest the true number meeting the criteria is closer to 20%. "
        },
        {
            "text": "To help us get a better idea of the real state of affairs, therefore, FHT developed an easy-to-use survey based on seven simple pond features – like shade or plant coverage – which allows non-specialists to identify likely priority ponds. They estimate that the algorithm identifies 97% of non-priority ponds and 58% of priority ponds; while it isn’t perfect, this initial filtering will make it much easier for specialists to focus their efforts on ponds which are likely to fit the priority pond criteria."
        },
        {
            "text": "Since the project's launch in mid-2024, almost 750 surveys have been completed, identifying over 100 probable priority ponds. When combined with data from other projects, over 250 new priority ponds have been recorded. As many as 100,000 priority ponds may still be unrecorded across the country, though – to help reduce that number, visit the FHT website now and find out how to survey for priority ponds in your area!"
        },
        {
            "text": "Alongside this, FHT have led the first national attempt to estimate the number of urban ponds, the Urban Pond Count. This is another glaring gap in our knowledge base: the last national pond survey dates back to 2007 and largely overlooked ponds in urban areas. "
        },
        {
            "text": "Through the count, volunteers recorded over 500 ponds – 89 of which had never been mapped before – allowing us to estimate that England's towns and cities probably host around 8,500 ponds in total. As with priority ponds, however, the final number awaits your invaluable input for your local area…"
        },
        {
            "text": "A word of thanks"
        },
        {
            "text": "Looking ahead, we’re exploring how these methods can be refined, scaled, better integrated with professional survey, and applied across other habitats."
        },
        {
            "text": "But the benefits of these projects haven’t just been scientific. Citizen scientists have known for a long time that their work is not only about collecting better data but also about fostering awareness, stewardship and pleasure in exploring nature. We’re immensely grateful to everyone who’s been a part of this work, and we hope very much that the odd wellyful of (precious, species-rich) water hasn’t put you off coming back for more pond-bothering in the future!"
        },
        {
            "text": "Note: this is the second in a series of three blogs on Natural England’s citizen science work. You can read the first article here, and look out for the third over the next few days."
        },
        {
            "text": " "
        }
    ]
}