{
    "url": "https://hmlandregistry.blog.gov.uk/2025/11/11/how-to-deal-with-restrictions-in-the-register/",
    "title": "How to deal with restrictions in the register",
    "authors": [
        "Bethany Boothby, Assistant Land Registrar, and Andrew Smedley, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2025-11-11T13:47:57+00:00",
    "content": [
        {
            "text": "We see a lot of applications seeking to disapply or modify a restriction in the title register where this is either incorrect or unnecessary. In this blog, senior practitioners consider how best to tackle restrictions that are no longer fit for purpose. "
        },
        {
            "text": "A restriction is often entered in the register to ensure that no disposition is registered without, for example, providing evidence to the registrar that a specified person has consented to it. But sometimes the wording of a restriction in the register needs to be changed. This often happens where a further disposition (such as a transfer to new owners) is being registered, requiring compliance with the restriction’s terms. Here we explore some of those situations and how to change the wording of a restriction or otherwise allow registration of the disposition, as appropriate. "
        },
        {
            "text": "First, please note: if you think the registrar has made an error in entering the restriction in the register, please contact HM Land Registry at the earliest opportunity. We will investigate and, if we agree, we will seek to correct the issue as quickly as possible. "
        },
        {
            "heading": 2,
            "text": "Cancellation, withdrawal and entry of a restriction – the ‘replacement route’"
        },
        {
            "text": "In almost every case, you can apply to remove one restriction from the register and enter a different form of restriction in its place.If the party initiating the change is the beneficiary of the restriction, that party should apply to withdraw the existing restriction from the register using form RX4 and apply to enter the new one using form RX1, making sure panel 8 of the RX1 is completed accordingly. If the party initiating the change is the registered proprietor or a third party who is not the beneficiary, they can apply to cancel the existing restriction using form RX3 and apply to enter the new one using form RX1.  In this case, unless the application contains the beneficiary’s consent to removal of the restriction, we will serve a 15-day objection notice on any identifiable beneficiary."
        },
        {
            "text": "We refer to this method of removal (using form RX3 or RX4) and entry (using form RX1) as the ‘replacement route’."
        },
        {
            "heading": 2,
            "text": "Alteration of  existing restriction"
        },
        {
            "text": "For a simple and straightforward change of wording, in many cases all that’s needed is an application in form AP1 for alteration of the restriction in the register, supported by evidence to support the change required. For example:"
        },
        {
            "text": "We may also consider an application to alter an existing restriction where a corporate beneficiary has changed, or an individual has died. You’ll need to send supporting evidence with your application."
        },
        {
            "heading": 2,
            "text": "Disapplication of a restriction"
        },
        {
            "text": "If an applicant is struggling to obtain compliance or consent from the beneficiary of a restriction, an application can be made to the registrar in form RX2 to disapply the restriction. The outcome of a disapplication application is at the discretion of the registrar. Situations where this might be appropriate include where:"
        },
        {
            "text": "In every case, you must lodge evidence which clearly shows the actions that have been taken to comply with the terms of the restriction as worded, and why the registrar should make the order requested. For example, if the restriction requires a certificate of compliance with certain clauses in a document or deed, then we would require evidence that those clauses have been complied with. In most cases, evidence that the applicant has tried to communicate with the restrictioner on multiple occasions is not sufficient.If the application is accepted, the registrar will make an order disapplying the restriction to allow registration of the later disposition. The disapplication does not remove the restriction from the register.Additionally, if the restriction was never intended to catch a certain type of disposition, then disapplication would not be appropriate as it would relate only to the current transaction, not all future ones, so the replacement route, or more rarely, modification, should be used."
        },
        {
            "heading": 2,
            "text": "Modification of a restriction"
        },
        {
            "text": "We can only make an order for modification of a restriction if the replacement route cannot be used.  "
        },
        {
            "text": "You can use form RX2 to apply to modify the existing restriction, but successful applications are very rare. We can only consider making an order where the applicant is able to explain why: "
        },
        {
            "heading": 2,
            "text": "In practice"
        },
        {
            "text": "The following examples illustrate many of the above points discussed and are in roughly chronological order."
        },
        {
            "heading": 2,
            "text": "Remember"
        },
        {
            "text": "An application for disapplication of a restriction (using form RX2) is only appropriate in limited circumstances, some of which are mentioned above, and an application for modification of a restriction is appropriate in extremely limited circumstances. The outcome of such applications is at the discretion of the registrar. "
        },
        {
            "text": "In nearly every case, the old restriction in our example could be altered (by applying in form AP1) or removed from the register and a new one entered (using forms RX3/RX4 and RX1). An RX2 application will not be accepted where it is possible to follow the replacement route. "
        },
        {
            "text": "HM Land Registry regularly receives applications in form RX2 where the alteration or replacement routes should have been followed instead, and we either have to raise requisitions on those applications or cancel them, as the case may be. "
        },
        {
            "heading": 2,
            "text": "More information, training and guidance "
        },
        {
            "text": "Our practice guide 19: notices, restrictions and the protection of third-party interests in the register examines the nature and effect of notices and restrictions, gives guidance on their entry and explains how to cancel or amend existing notices and restrictions. "
        },
        {
            "text": "Head to HM Land Registry's training hub for help and guidance in a variety of formats on a range of land registration topics, including restrictions. "
        },
        {
            "text": "First published in the Law Society’s magazine Property in Practice, September 2025 edition. "
        }
    ]
}