{
    "url": "https://marinedevelopments.blog.gov.uk/2025/11/11/protecting-our-seas-together-mpa-byelaws-enforcement-and-compliance/",
    "title": "Protecting our seas together: MPA byelaws, enforcement, and compliance",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Enforcement",
        "Evidence",
        "fisheries",
        "marine conservation",
        "Uncategorized"
    ],
    "pub_date": "2025-11-11T13:27:46+00:00",
    "content": [
        {
            "text": "Our mission is to safeguard England’s marine environment while supporting a thriving and sustainable fishing industry. One way we can achieve this is through the implementation and enforcement of byelaws within our offshore marine protected areas (MPAs). "
        },
        {
            "text": "Our MPA byelaws are the product of an extensive assessment, evidence gathering and consultation process. They are designed to protect sensitive habitats and species from damaging fishing activities, particularly the use of bottom-towed fishing gear, which can have significant impacts on important marine ecosystems. "
        },
        {
            "text": "Since the introduction of our Stage 2 MPA byelaws in March 2024, increasing the total area under our protection to almost 18,000 km2, we’ve seen high levels of compliance across the fishing industry. This demonstrates the ability of our fishers to adapt, as well as our shared commitment and the value we place in protecting our marine environment. It also reflects our effective and proportionate approach to enforcement.  "
        },
        {
            "text": "As we continue our ongoing review of all responses received during our recent Stage 3 MPA consultation, we’d like to take this opportunity to share more details about our enforcement work, and why it matters. "
        },
        {
            "text": "Pink sea fan & Ross worm on wave exposed circalittoral rock at Stoke Point, Plymouth, MPA. Credit: Natural England/Keith Hiscock #HiddenSeas "
        },
        {
            "text": "Smart surveillance, targeted enforcement "
        },
        {
            "text": "MMO uses a robust, intelligence-led approach to enforcement. We receive automatic position data from all fishing vessels over 12 metres operating within the UK’s 200-mile exclusive economic zone. This allows us to maintain a real-time picture of fishing activity and detect any unusual or potentially non-compliant patterns. "
        },
        {
            "text": "Where needed, we deploy surface and aerial surveillance assets, including our two Offshore Patrol Vessels, which regularly patrol MPAs in English waters. Our teams also conduct inspections at sea or at the quayside, timed to align with seasonal fishing patterns for maximum effectiveness. "
        },
        {
            "text": "From March 2024 we started analysing fishing vessels' VMS positions for potential breaches of the MMO's second stage of offshore MPA byelaws. "
        },
        {
            "text": "Since then, we have observed 524 vessels actively fishing with bottom-towed gear in English waters, of which 66 were detected breaching the byelaws, with several cases under investigation for potential prosecution. "
        },
        {
            "text": "In May 2025, we secured our first prosecution for contravention of an MPA byelaw, resulting in a guilty plea and a £40,000 financial order for the Master of the French-registered fishing vessel. This demonstrates our ability to take decisive action when required. "
        },
        {
            "text": "Image OPV Trafalgar Sentinel "
        },
        {
            "text": "High compliance, low repeat offences "
        },
        {
            "text": "We’re proud to report that compliance with MPA byelaws is consistently high. Incursions into closed areas are relatively rare, and repeat offences are even rarer. This is a testament to successful our approach and adaptability of the fishing industry. "
        },
        {
            "text": "Listening and learning: Stage 3 MPA Consultation "
        },
        {
            "text": "Following our recent Stage 3 MPA consultation, we are reviewing all stakeholder responses. We’re committed to ensuring that future management measures take into consideration all views and evidence provided by fishers, conservation groups, and coastal communities. "
        },
        {
            "text": "Should the decision be made to proceed with new byelaws, a statutory notification period will follow, giving industry time sufficient time to prepare and adapt. This approach has previously led to strong compliance and smooth transition. "
        },
        {
            "text": "Your role matters "
        },
        {
            "text": "We want to take this opportunity to thank the fishers for their continued compliance with MPA byelaws. The protection of our MPAs will allow sensitive marine habitats to recover, supporting healthier ecosystems and ensuring a sustainable future for coastal communities and fishers. "
        },
        {
            "text": "Find out more about our recent Stage 3 MPA consultation. "
        },
        {
            "text": "Learn more about our Compliance and Enforcement Strategy. "
        }
    ]
}