{
    "url": "https://mhclgdigital.blog.gov.uk/2025/05/09/advancing-digital-planning-open-digital-plannings-first-end-to-end-product-pilots/",
    "title": "Advancing digital planning: Open Digital Planning’s first end-to-end product pilots",
    "authors": [
        "Emily Hadley, Senior Product Manager",
        "Ben Duckworth, Product Delivery Manager"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2025-05-09T13:36:38+01:00",
    "content": [
        {
            "text": "Last year was a significant step forward in our mission to modernise England’s planning system. "
        },
        {
            "text": "Supported by Digital Planning improvement funding from the Ministry of Housing, Communities and Local Government’s Digital Planning programme, local planning authorities (LPAs) in Open Digital Planning (ODP) have launched the first end-to-end product pilots. These pilots are a crucial step in testing how digital tools can streamline the planning process, improve accessibility, and provide a more efficient system for both planning teams and applicants. "
        },
        {
            "text": "ODP is a collaborative network of forward-thinking LPAs working together to shape a more efficient, data-driven planning system. ODP has now grown to a network of over 150 LPAs dedicated to rethinking traditional, document-heavy approaches and adopting innovative, data-driven solutions.  "
        },
        {
            "text": "The Digital Planning programme plays a key role in enabling this transformation, funding the development of open-source alternative planning software solutions that make planning services simpler while streamlining LPA operations.  "
        },
        {
            "text": "These include:  "
        },
        {
            "text": "All underpinned by the Planning Data platform which ensures seamless integration and better data access for LPAs.  "
        },
        {
            "text": "We are now working on end-to-end pilots of the 3 products, with 4 LPAs – Barnet, Camden, Lambeth and Medway – to test how PlanX, BOPS, and the Digital Planning Register function as a unified, live system. "
        },
        {
            "heading": 2,
            "text": "Why these pilots are a significant milestone "
        },
        {
            "text": "These pilots are the first time all ODP products are being used together in a live, real-world setting, providing a critical evaluation of how well they function as a set of integrated services.  "
        },
        {
            "text": "While LPAs have previously tested individual products, this combined approach allows authorities to: "
        },
        {
            "text": "This structured pilot approach aligns with MHCLG’s commitment to digital transformation in planning, ensuring that the products developed are practical, effective, and scalable. The evaluation process includes spot testing, volume testing and a phased rollout to monitor usability, operational performance and overall impact.  "
        },
        {
            "heading": 2,
            "text": "First applications submitted and processed "
        },
        {
            "text": "The pilots are already working well, with planning applications submitted and processed using the ODP product stack. It has proven that the products work together technically and that they have the potential to be central to a more data-driven and streamlined planning process. "
        },
        {
            "text": "While the pilots are ongoing, alternative planning systems remain available, ensuring applicants have a choice. By comparing the performance of both systems, LPAs and the Digital Planning programme can gather critical insights into product operations, service performance and the user experience. "
        },
        {
            "heading": 2,
            "text": "Local Planning Authorities leading the way "
        },
        {
            "text": "Each participating council is following its own timeline: "
        },
        {
            "text": "The pilots remain underway and so full results are not yet available, but indicative results for Lawful Development Certificate (LDC) applications from Barnet show time savings from using ODP products. "
        },
        {
            "text": "Initial figures show that the average time for the end-to-end process for an LDC application being received, validated, assessed and decided in the pilot was just over 30 minutes using ODP products, compared to an hour longer using the existing supplier software.  "
        },
        {
            "text": "Faster decision times free up planning officer time and reduces the cost, uncertainty and risks around submitting planning applications. "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "The insights and data gained from these pilots will help the teams to refine their products, and contribute to progress across the entire ODP community in several ways:   "
        },
        {
            "text": "Building on the success of the pilots, we're excited to be welcoming more LPAs who have begun preparations for a new wave of end-to-end pilots launching soon. "
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "For more information on funded projects or how we’re using digital to modernise England’s planning system, visit the Digital Planning and Open Digital Planning websites.  "
        },
        {
            "text": "The ODP community is growing. If you’re part of an LPA interested in the opportunity to begin digital planning improvements, why not find out more and join them. "
        }
    ]
}