{
    "url": "https://technology.blog.gov.uk/2025/05/09/building-the-future-of-government-software-engineering/",
    "title": "Building the future of government software engineering",
    "authors": [
        "Katherine Bhambra, Senior Content Designer, GDS"
    ],
    "categories": [
        "Transformation"
    ],
    "pub_date": "2025-05-09T09:28:03+01:00",
    "content": [
        {
            "text": "In the Heads of Engineering (HoE) group, we’ve already seen remarkable success in helping to formalise and facilitate software engineering practices across government. Our next step is to go even further and create a brand new council that will directly steer decision making, with our recent HoE workshop helping to form the council’s structure and purpose."
        },
        {
            "text": "The HoE is a special interest group created from leaders of the wider cross-government software engineering community, which was itself designed to bring together the expertise of everyone working in an engineering role in the public sector."
        },
        {
            "text": "We’ve made some fantastic progress in key areas, such as supporting career progression for engineers by identifying and planning pathways for specific engineering roles. Our group has proven to be an integral part of the overall community by turning their needs into real, tangible requirements, and the purpose of the new Engineering Excellence council will be to make sure that those requirements are met. "
        },
        {
            "text": "This council will push forward meaningful change and strategy that has been developed within the engineering community and its leadership group. We also hope that the council will represent the next step in initiating action and influencing the future state of modern digital government."
        },
        {
            "heading": 3,
            "text": "The importance of creating a council"
        },
        {
            "text": "The reason that the new Engineering Excellence council is so important is that earlier in the year, the state of digital government review highlighted several critical issues within the digital supply chain. One of these was that senior leaders can lack the technical knowledge required to deliver effective digital services. This also ties in closely to the larger concern around siloed working hindering knowledge from being shared across teams, programmes, and even directorates."
        },
        {
            "text": "Following on from this, the blueprint for modern digital government set out the plan to join up public services, which will only be possible with the support of strong communities."
        },
        {
            "text": "The blueprint also focuses on elevating leadership, which means investing in the right people with the right expertise. In the case of software engineering, there is no better way to do this than by creating a leadership group from our existing community of practitioners. "
        },
        {
            "text": "While it might still be at an early stage, this council will play an important role in bridging the gap between those who work in the engineering space and senior decision makers. As the council’s name suggests, its priority will be to establish and maintain excellence; it will bring the voice of engineering into strategy building."
        },
        {
            "text": "What this means in real terms is paving the way for future technology that is agile, flexible and seamless by helping to reduce governance processes. We also expect to see increased efficiency and sustainable, replicable processes that can be shared across leadership teams from all sectors."
        },
        {
            "heading": 3,
            "text": "Building the council"
        },
        {
            "text": "6 March 2025 marked a year since the creation of the Heads of Engineering group. To celebrate this event, we hosted a virtual workshop to collaboratively explore the challenges faced by the engineering community and its leaders. These findings will become integral to shaping the new Engineering Excellence council."
        },
        {
            "text": "The session welcomed 28 participants from across the public sector, including the Driver and Vehicle Licensing Agency (DVLA), the Department of Work and Pensions (DWP), the Department for Education (DfE), the Cabinet Office, the Ministry of Justice (MoJ), and the Home Office, as well as devolved administrations and local councils."
        },
        {
            "text": "During the workshop, participants were asked to surface deep insights into the state of engineering leadership, and to prioritise key areas to inform the roadmap for the next 12 months. "
        },
        {
            "text": "We also wanted to identify the biggest challenges within this sector. Participants described the need for better collaboration and more open-source contribution as their most important areas. Heavy governance processes and a lack of both common tooling and standardised software were also noted."
        },
        {
            "text": "The feedback to the workshop was overwhelmingly positive, with many attendees valuing the opportunity to align on key issues and openly challenge assumptions. Dimitris Perdikou, Chief Engineer for Government, noted:"
        },
        {
            "text": "“The session really helped to explore what the Heads of Engineering community thought were key topics and initiatives to follow through with. It was insightful to find areas that lots of members aligned on, as well as areas where they either disagreed on the point itself or its priority. It has given us a community-driven list of topics to explore over the coming year.”"
        },
        {
            "text": "This feedback has shown that, by tapping into the expertise of key stakeholder groups, we can gather deep insights quickly and effectively. The knowledge we gained in this workshop is not just a snapshot; it’s a valuable foundation for our work over the next 12 months.Our work around the future of software engineering and the Heads of Engineering council is ongoing. If you’d like to get involved, contact us through our special interest group."
        }
    ]
}