{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/05/09/empowering-the-leaders-of-tomorrow-leadership-values-masterclass/",
    "title": "Empowering the leaders of tomorrow: Leadership Values masterclass ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Collaborating & Networking",
        "Talent & Leadership"
    ],
    "pub_date": "2025-05-09T15:07:41+01:00",
    "content": [
        {
            "text": "In April 2025, the GSE Profession held our Leadership Values masterclass, with the theme of ‘Innovation’. The event was aimed at developing the skills and values necessary for science and engineering leaders across government using the GSE Leadership Values Toolkit.  "
        },
        {
            "text": "The masterclass began with an inspiring keynote speech from Professor Sarah Sharples, Chief Scientific Adviser for the Department for Transport, followed by turbo talks from other senior leaders. The day provided invaluable networking opportunities and interactive sessions from spot coaching to table discussions. In a first, the masterclass also offered members of the Profession an opportunity to attend both in-person and virtually.  "
        },
        {
            "text": "Key insights from the day "
        },
        {
            "text": "Everyday Innovation "
        },
        {
            "text": "Scientists and engineers are natural innovators. Their curiosity drives them to explore how things work and understand why they work that way. This motivation is at the heart of innovation. By cultivating this curiosity, we can unlock new ideas and solutions that drive us forward. "
        },
        {
            "text": "Frameworks for leadership: Think, feel, act "
        },
        {
            "text": "When leading a team, it's crucial to consider frameworks like ‘Think, Feel, Act’. This approach helps leaders understand the cognitive, emotional, and behavioural aspects of their team members. By addressing this, leaders can create more cohesive teams. "
        },
        {
            "text": "Safe environments "
        },
        {
            "text": "Creating a safe environment is essential for fostering innovation. When team members feel safe, they can explore their curiosity without fear of judgment or failure. This safety net encourages open communication, risk-taking, and ultimately, innovation. "
        },
        {
            "text": "Networking "
        },
        {
            "text": "Beyond the formal sessions, the GSE Leadership Values masterclass provided opportunities to network with the Profession community. The event brought together a diverse group of civil servants, ranging from early careerists to seasoned leaders. Whether during coffee breaks, group activities, or spot coaching, participants had multiple opportunities to engage with one another, share ideas, and forge lasting professional relationships both online and offline. "
        },
        {
            "text": "Feedback from attendees "
        },
        {
            "text": "The event was well-received by the attendees, who shared their positive experiences: "
        },
        {
            "text": "“I took part in the spot coaching, very useful to hear somebody else's perspectives about my career and options available to me.” "
        },
        {
            "text": "“Great event, lots of great insights shared.” "
        },
        {
            "text": "“As a new manager, I found it really valuable to hear from speakers on their individual leadership journeys!” "
        },
        {
            "text": "Reflections "
        },
        {
            "text": "The GSE Leadership Values masterclass was aimed at exploring practical ways for leaders to foster innovation. Participants learned from senior leaders about leadership theories on change, creating safe spaces, and developing a culture of innovation. They left with actionable insights to positively impact their teams. The event also emphasised the GSE leadership core values of collaboration, integrity, diversity, and inclusion, which are essential to be successful in the Civil Service.  "
        },
        {
            "text": "The next leadership masterclass will take place this autumn, sign up to the GSE Profession for information on our learning offer as well as other events taking place this year. If you missed the masterclass and would like to access the session recordings, please email gse@go-science.gov.uk"
        }
    ]
}