{
    "url": "https://valuationoffice.blog.gov.uk/2025/05/09/how-we-value-small-shops-2/",
    "title": "How we value: small shops",
    "authors": [
        "Catherine Jones - National Valuation Lead"
    ],
    "categories": [
        "Business Rates",
        "How We Value",
        "Valuation Methods"
    ],
    "pub_date": "2025-05-09T11:22:17+01:00",
    "content": [
        {
            "text": "There are around 500,000 small shops across England and Wales, occupied by a variety of businesses, such as fashion retailers, homeware stores, convenience shops, and cafés."
        },
        {
            "text": "A small shop is any retail unit under 1,850m² (which is around 20,000 ft²). If you rent or own one, understanding how your business rates are calculated can help you manage your costs more effectively."
        },
        {
            "text": "The Valuation Office Agency (VOA) is responsible for assessing the rateable value of all non-domestic properties in England and Wales. To do this, our surveyors use three main valuation methods, approved by the Royal Institution of Chartered Surveyors (RICS). For most shops, we use the rental comparison method."
        },
        {
            "text": "Let’s take a closer look at this method and how we apply it to small shops."
        },
        {
            "heading": 2,
            "text": "Factors to consider"
        },
        {
            "text": "We start by looking at the actual rent paid on the property. However, this doesn’t always reflect its true market value. That’s because the rent can be influenced by things like:"
        },
        {
            "text": "Since the actual rent paid might not always reflect the property’s value at a specific time, we also look at what similar nearby properties are rented out for to help build our picture of the property."
        },
        {
            "text": "For small shops, we use a measurement called the ‘net internal area’ to compare properties accurately and fairly."
        },
        {
            "heading": 2,
            "text": "Measuring space - the net internal area"
        },
        {
            "text": "We use the net internal area to measure the useable space inside the shop. This includes areas like the sales floor, storage areas, desk space and customer areas. We don’t include spaces such as staff toilets and stairwells."
        },
        {
            "text": "However, for most small shops, we take an extra step because the shape of the property matters. A shop where most space is near the front window is more valuable than a long, narrow shop where much of the space is hidden at the back, even if both have the same total area."
        },
        {
            "heading": 2,
            "text": "Zoning"
        },
        {
            "text": "As small shops can vary in size and layout, we use what’s called ‘zoning’ to reflect how different areas contribute to a shop’s rental value."
        },
        {
            "text": "We divide shops into zones, each 6.1 metres (20 feet) deep:"
        },
        {
            "text": "Dividing shops into zones means that shop values reflect their usability for retail purposes. For example, a customer looking in through the window of a shop will see the goods on display at the front with greater ease than goods to the rear of the shop. And a customer entering a shop is more likely to stay near the front of the shop than venture to the rear."
        },
        {
            "text": "More information about zoning can be found in our YouTube video."
        },
        {
            "heading": 2,
            "text": "Analysing and adjusting rents"
        },
        {
            "text": "After gathering all this evidence, we make adjustments to the rent. We consider the actual rent paid and adjust this to take into account the factors to consider mentioned above."
        },
        {
            "text": "We then divide this adjusted rent by the area in terms of Zone A. This helps us fairly compare rental values of different shops in different locations."
        },
        {
            "heading": 2,
            "text": "Making an accurate valuation"
        },
        {
            "text": "After analysing all available rental data, we can determine a ‘tone of value’ – a benchmark rental value for a group of similarly sized shops in a similar location."
        },
        {
            "text": "We may need to make additions or allowances for factors not reflected in the tone of rents."
        },
        {
            "text": "For example, a tenant might have installed air conditioning, or the property could benefit from a prominent corner location with display windows on two streets – both of which could increase its value. On the other hand, there may be drawbacks, such as access being restricted by a flight of stairs or an awkward layout that limits the usable sales area. In such cases, we may apply an allowance to reflect the impact on value. "
        },
        {
            "text": "Ultimately, our goal is always the same: to determine a rateable value that reflects a reasonable estimate of market rent for a specific shop in a specific location"
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "If you want to check your own rateable value, sign up for a business rates valuation account to view and understand your valuation."
        },
        {
            "text": "More information about the rental comparison method can be found in our blog."
        },
        {
            "text": "If you want to make a Check about your shop, you can use our guidance to support you."
        },
        {
            "text": "For further details on how we value properties, explore our other ‘how we value’ blogs on pubs, petrol stations and more."
        }
    ]
}