{
    "url": "https://insidehmcts.blog.gov.uk/2025/05/09/remote-link-sites-transforming-court-experiences-for-vulnerable-witnesses/",
    "title": "Remote link sites: transforming court experiences for vulnerable witnesses ",
    "authors": [
        "Sue James, Crime Service Manager"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services"
    ],
    "pub_date": "2025-05-09T12:00:52+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Walking through the doors of The Lighthouse recently, I was struck by the contrast to traditional court settings. As part of my role overseeing special measures at HMCTS, I wanted to see firsthand how remote link sites are supporting vulnerable witnesses. What I discovered was an environment carefully designed for children, with colourful wall murals, welcoming spaces, and thoughtful areas that create a calm, supportive atmosphere. "
        },
        {
            "heading": 2,
            "text": "Creating safe spaces for vulnerable witnesses "
        },
        {
            "text": "Remote link sites like The Lighthouse represent one of our most important services in helping vulnerable witnesses participate in the justice process while minimising further trauma. The sites are HMCTS-approved locations away from courtrooms where vulnerable or intimidated witnesses can give evidence at a Crown Court trial via live video link. These locations temporarily become an extension of the courtroom during proceedings. "
        },
        {
            "text": "The sites are part of wider special measures introduced by the Youth Justice and Criminal Evidence Act 1999. They help vulnerable and intimidated witnesses give their best evidence by helping to reduce stress during the justice process. "
        },
        {
            "text": "Locations include buildings operated by criminal justice partners, victim support organisations, local authority buildings, and specialist centres like The Lighthouse. Each must meet our technical and security standards to ensure proper administration of justice while protecting vulnerable witnesses. The success of remote link sites depends on our effective partnership with other organisations. We currently operate 38 remote link sites across England and Wales, each established through close relationships with partners. "
        },
        {
            "text": "Remote link sites serve a critical function: enabling witnesses to give evidence without having to physically attend court. This is particularly valuable for child victims of abuse, who may be especially distressed by appearing in court. When witnesses are less anxious and fearful, they can communicate more effectively, which benefits the entire justice system.  "
        },
        {
            "heading": 2,
            "text": "The Lighthouse "
        },
        {
            "text": "The Lighthouse, which opened in October 2018, exemplifies how remote link sites can be integrated into the support offered. It represents an innovative approach to supporting child witnesses. "
        },
        {
            "text": "Its value comes from combining HMCTS technology with a range of other services under one roof. This means children can give evidence in an environment where they already feel safe and supported. "
        },
        {
            "text": "What makes The Lighthouse unique is its multi-agency approach. HMCTS provides the technical infrastructure and court protocols, while health services offer medical support, police and social care professionals handle safeguarding, and therapeutic staff provide emotional support – all under one roof. Each partner brings distinct expertise, creating a seamless experience for children navigating the justice system. "
        },
        {
            "heading": 2,
            "text": "How remote links work in practice "
        },
        {
            "text": "The witness gives evidence from a remote link site through a secure video connection established with the courtroom. They typically only see the judge and lawyer asking questions, while all rules of evidence and procedure are maintained. "
        },
        {
            "text": "The technical aspect is just one part. Equally important is ensuring the witness has appropriate support throughout the process. Eimear Timmons, Practice Development Manager at The Lighthouse, told me about how they've seen children benefit from giving evidence via remote link rather than in court: "
        },
        {
            "text": "“Children and young people have told us that giving evidence remotely helps reduce their anxiety, as it means they don’t have to face the suspect or the suspect’s family. This support allows them to concentrate on what truly matters – delivering their evidence clearly and more comfortably. Without these remote facilities and support, many have said they wouldn’t feel able to continue with the court process.\"  "
        },
        {
            "heading": 2,
            "text": "Pre-recorded Evidence "
        },
        {
            "text": "HMCTS is expanding special measures at remote link sites through the introduction of pre-recorded cross-examination. This new option allows vulnerable witnesses to record their cross-examination before the trial, rather than during court proceedings. "
        },
        {
            "text": "Currently, witnesses can only pre-record evidence at court buildings, but thanks to our new Pre-Recorded Evidence (PRE) technology, they'll soon be able to do this at remote link sites too. We’ll have rolled out PRE to all Crown Courts and remote link sites across England and Wales by summer 2025. This means remote link sites like The Lighthouse will be able to offer two options for giving evidence: live video link or pre-recorded cross-examination. "
        },
        {
            "text": "Recent Ministry of Justice research confirmed that pre-recorded evidence maintains judicial integrity by showing no impact on jury decision-making, while allowing cases to proceed effectively.  "
        },
        {
            "heading": 2,
            "text": "Impact on young witnesses "
        },
        {
            "text": "Vulnerable witnesses who have experienced abuse can find traditional court settings overwhelming and facilities like The Lighthouse can make a crucial difference. At remote link sites, witnesses can participate in the justice process with appropriate support around them, helping them to feel better equipped to give their account accurately. "
        },
        {
            "text": "As we expand remote link provision and introduce new technologies like PRE, we remain focused on our mission: ensuring justice is accessible to all, especially the most vulnerable in society. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Safleoedd cyswllt o bell: trawsnewid profiadau llys ar gyfer tystion bregus"
        },
        {
            "text": "Wrth gerdded trwy ddrysau The Lighthouse yn ddiweddar, cefais fy nharo gan y cyferbyniad o’i gymharu â llys traddodiadol. Fel rhan o fy rôl yn goruchwylio mesurau arbennig yn GLlTEF, roeddwn i eisiau gweld yn uniongyrchol sut mae safleoedd cyswllt o bell yn cefnogi tystion bregus. Yr hyn a welais oedd amgylchedd wedi'i gynllunio'n ofalus ar gyfer plant, gyda murluniau lliwgar, mannau croesawgar, ac ardaloedd meddylgar sy'n creu awyrgylch tawel a chefnogol. "
        },
        {
            "heading": 2,
            "text": "Creu mannau diogel ar gyfer tystion bregus "
        },
        {
            "text": "Mae safleoedd cyswllt o bell fel The Lighthouse yn cynrychioli un o'n gwasanaethau pwysicaf wrth helpu tystion bregus i gymryd rhan yn y broses gyfiawnder tra'n lleihau trawma pellach. Mae'r safleoedd wedi’u lleoli mewn lleoliadau sydd wedi’u cymeradwyo gan GLlTEF ac maent i ffwrdd o’r llys lle gall tystion bregus neu dystion sy’n cael eu bygwth roi tystiolaeth mewn treial Llys y Goron trwy gyswllt fideo byw. Mae'r lleoliadau hyn dros dro yn dod yn estyniad o'r ystafell lys yn ystod yr achosion. "
        },
        {
            "text": "Mae'r safleoedd yn rhan o fesurau arbennig ehangach a gyflwynwyd gan Ddeddf Cyfiawnder Ieuenctid a Thystiolaeth Droseddol 1999. Maent yn helpu tystion bregus neu dystion sy’n cael eu bygwth i roi eu tystiolaeth orau trwy helpu i leihau straen yn ystod y broses gyfiawnder. "
        },
        {
            "text": "Mae'r lleoliadau'n cynnwys adeiladau sy'n cael eu gweithredu gan bartneriaid cyfiawnder troseddol, sefydliadau cymorth dioddefwyr, adeiladau awdurdodau lleol, a chanolfannau arbenigol fel The Lighthouse. Rhaid i bob un fodloni ein safonau technegol a diogelwch i sicrhau gweinyddiaeth briodol o gyfiawnder wrth ddiogelu tystion bregus. Mae llwyddiant safleoedd cyswllt o bell yn dibynnu ar ein partneriaeth effeithiol â sefydliadau eraill. Ar hyn o bryd rydym yn gweithredu 38 o safleoedd cyswllt o bell ledled Cymru a Lloegr, pob un wedi'i sefydlu trwy berthynas agos â phartneriaid. "
        },
        {
            "text": "Mae safleoedd cyswllt o bell yn cyflawni swyddogaeth hanfodol: galluogi tystion i roi tystiolaeth heb orfod mynychu'r llys yn gorfforol. Mae hyn yn hynod o werthfawr i blant sydd wedi dioddef camdriniaeth, a allai fod yn arbennig o ofidus wrth ymddangos yn y llys. Pan fydd tystion yn llai pryderus ac ofnus, gallant gyfathrebu'n fwy effeithiol, sydd o fudd i'r system gyfiawnder gyfan. "
        },
        {
            "heading": 2,
            "text": "The Lighthouse "
        },
        {
            "text": "Mae'r Lighthouse, a agorodd ym mis Hydref 2018, yn enghraifft o sut y gellir integreiddio safleoedd cyswllt o bell i'r gefnogaeth a gynigir. Mae'n cynrychioli dull arloesol o gefnogi tystion sy’n blant. "
        },
        {
            "text": "Daw ei werth o gyfuno technoleg GLlTEF gydag ystod o wasanaethau eraill o dan yr un to. Mae hyn yn golygu y gall plant roi tystiolaeth mewn amgylchedd lle maen nhw eisoes yn teimlo'n ddiogel ac yn cael eu cefnogi.  "
        },
        {
            "text": "Yr hyn sy'n gwneud The Lighthouse yn unigryw yw ei ddull aml-asiantaethol. Mae GLlTEF yn darparu'r seilwaith technegol a'r protocolau llys, tra bod gwasanaethau iechyd yn cynnig cymorth meddygol, yr heddlu a gweithwyr proffesiynol gofal cymdeithasol yn ymdrin â diogelu, a staff therapiwtig yn darparu cymorth emosiynol – i gyd o dan yr un to. Mae pob partner yn dod ag arbenigedd gwahanol, gan greu profiad di-dor i blant sy'n llywio'r system gyfiawnder. "
        },
        {
            "heading": 2,
            "text": "Sut mae cysylltiadau o bell yn gweithio yn ymarferol "
        },
        {
            "text": "Mae'r tyst yn rhoi tystiolaeth o safle cyswllt o bell trwy gysylltiad fideo diogel a sefydlwyd gyda'r ystafell lys. Maent fel arfer ond yn gweld y barnwr a'r cyfreithiwr yn gofyn cwestiynau, tra bod yr holl reolau tystiolaeth a gweithdrefn yn cael eu cynnal. "
        },
        {
            "text": "Dim ond un rhan yw'r agwedd dechnegol. Yr un mor bwysig yw sicrhau bod gan y tyst gefnogaeth briodol trwy gydol y broses. Dywedodd Eimear Timmons, Rheolwr Datblygu Practis yn The Lighthouse, wrthyf am sut maen nhw wedi gweld plant yn elwa o roi tystiolaeth trwy gyswllt o bell yn hytrach nag yn y llys: "
        },
        {
            "text": "\"Mae plant a phobl ifanc wedi dweud wrthym fod rhoi tystiolaeth o bell yn helpu i leihau eu gorbryder, gan ei fod yn golygu nad oes rhaid iddyn nhw wynebu'r unigolyn dan amheuaeth na theulu'r unigolyn dan amheuaeth. Mae'r gefnogaeth hon yn caniatáu iddynt ganolbwyntio ar yr hyn sy'n wirioneddol bwysig – cyflwyno eu tystiolaeth yn glir ac yn fwy cyfforddus. Heb y cyfleusterau a'r gefnogaeth o bell hyn, mae llawer wedi dweud na fyddent yn teimlo eu bod yn gallu parhau â'r broses llys.\"  "
        },
        {
            "heading": 2,
            "text": "Tystiolaeth wedi'i recordio ymlaen llaw "
        },
        {
            "text": "Mae GLlTEF yn ehangu mesurau arbennig mewn safleoedd cyswllt o bell trwy gyflwyno croesholi wedi'i recordio ymlaen llaw. Mae'r opsiwn newydd hwn yn caniatáu i dystion bregus recordio eu croesholi cyn y treial, yn hytrach nag yn ystod achosion llys. "
        },
        {
            "text": "Ar hyn o bryd, dim ond mewn adeiladau llys y gall tystion recordio tystiolaeth ymlaen llaw, ond diolch i'n technoleg Tystiolaeth Wedi'i Recordio Ymlaen Llaw (PRE) newydd, byddant yn fuan yn gallu gwneud hyn mewn safleoedd cyswllt o bell hefyd. Byddwn wedi cyflwyno PRE i bob Llys y Goron a safleoedd cyswllt o bell ledled Cymru a Lloegr erbyn haf 2025. Mae hyn yn golygu y bydd safleoedd cyswllt o bell fel The Lighthouse yn gallu cynnig dau opsiwn ar gyfer rhoi tystiolaeth: cyswllt fideo byw neu groesholi wedi'i recordio ymlaen llaw. "
        },
        {
            "text": "Cadarnhaodd ymchwil diweddar y Weinyddiaeth Gyfiawnder fod tystiolaeth wedi'i recordio ymlaen llaw yn cynnal uniondeb barnwrol trwy ddangos unrhyw effaith ar benderfyniadau rheithgor, tra'n caniatáu i achosion fynd rhagddynt yn effeithiol.  "
        },
        {
            "heading": 2,
            "text": "Yr effaith ar dystion ifanc "
        },
        {
            "text": "Gall tystion bregus sydd wedi profi camdriniaeth weld lleoliadau llys traddodiadol yn llethol a gall cyfleusterau fel The Lighthouse wneud gwahaniaeth hanfodol. Mewn safleoedd cyswllt o bell, gall tystion gymryd rhan yn y broses gyfiawnder gyda chefnogaeth briodol o'u cwmpas, gan eu helpu i deimlo'n well i gyfleu yr hyn a ddigwyddodd yn gywir. "
        },
        {
            "text": "Wrth i ni ehangu darpariaeth cysylltiadau o bell a chyflwyno technolegau newydd fel PRE, rydym yn parhau i ganolbwyntio ar ein cenhadaeth: sicrhau bod cyfiawnder yn hygyrch i bawb, yn enwedig y rhai mwyaf agored i niwed mewn cymdeithas. "
        }
    ]
}