{
    "url": "https://gott.blog.gov.uk/2025/05/09/transforming-potential-into-impact-introducing-the-knowledge-asset-spinouts-guide/",
    "title": "Transforming potential into impact: introducing the Knowledge Asset Spinouts Guide",
    "authors": [
        "namitbi"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-05-09T09:15:00+01:00",
    "content": [
        {
            "text": "Author: Jacob Coker, Head of Policy, and Cameron Fenwick, Senior Technology Transfer Strategic Partner, GOTT"
        },
        {
            "heading": 2,
            "text": "Introducing the new Spinouts guide "
        },
        {
            "text": "The public sector hosts some of the UK’s leading research and innovation, which, if commercialised as new products and services, could have huge economic and societal benefits to the UK economy and citizens.   "
        },
        {
            "text": "A simple concept, but getting these innovations to market so that they can raise funding, scale, and flourish can be anything but straightforward – where do I start, who do I speak to, what do I need?   "
        },
        {
            "text": "That’s why the Government Office for Technology Transfer has this week published the first ever guide to creating spinouts from the public sector for organisations and innovators. "
        },
        {
            "text": "We're also here to provide expert advice, guidance and grant funding, and to connect you with others on the same journey. Email GOTT@dsit.gov.uk to find out how we can support you. "
        },
        {
            "heading": 2,
            "text": "What’s a ‘spinout’ and why do they matter? "
        },
        {
            "text": "Imagine taking a brilliant idea, nurturing it within the public sector, and then taking it out into the world as a standalone company. That's a spinout! "
        },
        {
            "text": "Spinouts are crucial because they help transform innovations, particularly high risk or transformative ones, into market-ready products and services, driving economic growth and improving people’s lives. "
        },
        {
            "heading": 2,
            "text": "Who is the Guide for? "
        },
        {
            "text": "For individual innovators, the guide explains what you should expect in setting up and being part of a spinout – the considerations and the benefits. "
        },
        {
            "text": "For public sector organisations and corporate teams helping develop spinouts (maybe for the first time!), the guide takes you through all the key considerations and stakeholders to involve. "
        },
        {
            "text": "For investors and other organisations (e.g. HM Treasury and the National Audit Office), it sets out good practice for government organisations, making it simpler and faster for you to work with them to develop successful spinouts. "
        },
        {
            "text": "Whether you're a spinout veteran or a curious beginner, this guide has got you covered. "
        },
        {
            "heading": 2,
            "text": "The public sector spinout landscape "
        },
        {
            "text": "In case you missed it, our previous blog on the public sector spinout landscape lifted the lid on the incredible economic impact of these spinouts. "
        },
        {
            "text": "From industry-leading project management tools to optical sensors for extreme environments, 84 public sector spinouts had raised a whopping £5.1 billion in funding and were employing 7,370 people. "
        },
        {
            "text": "It's clear that public sector spinouts aren’t a flash in the pan – they’re delivering results. This guide aims to make these opportunities accessible to a wider group of organisations. "
        },
        {
            "heading": 2,
            "text": "Key features of the guidance "
        },
        {
            "heading": 2,
            "text": "Spinouts not quite right for you or your innovation? "
        },
        {
            "text": "This week we’ve also published the first ever guide to commercialisation for public sector organisations."
        },
        {
            "text": "It sets out the major routes to commercialisation, including not only spinouts, but also direct sales, licensing, and joint ventures. "
        },
        {
            "text": "Find out more"
        },
        {
            "text": "Email GOTT@dsit.gov.uk to find out what support is available to you and your organisation! "
        }
    ]
}