{
    "url": "https://cdei.blog.gov.uk/2021/09/10/continuing-to-improve-equity-diversity-inclusion-edi-at-the-centre-for-data-ethics-and-innovation-cdei/",
    "title": "Continuing to improve Equity, Diversity & Inclusion (ED&I) at the Centre for Data Ethics and Innovation (CDEI)",
    "authors": [
        "CDEI"
    ],
    "categories": [
        "Diversity",
        "Equity",
        "Inclusion"
    ],
    "pub_date": "2021-09-10T07:25:52+01:00",
    "content": [
        {
            "text": "DCMS has today announced appointments to our refreshed advisory board, helping to lead the Centre in its next phase. Going forward, we’ll be focusing our efforts on enabling trustworthy innovation in the real-world, and delivering on the priorities set out in the National Data Strategy. "
        },
        {
            "text": "The recruitment process for our refreshed advisory board attracted a stellar group of proven innovators in data use, and we are delighted that the Secretary of State for DCMS has appointed a range of world-leading experts with deep understanding of fostering trustworthy innovation. Advisory board members will support the CDEI’s projects with their skills and expertise, and help to shape the Centre’s work programme. "
        },
        {
            "text": "However, we recognise that we need to continue to improve the overall diversity of our advisory board, and will be actively working with DCMS to do so in future recruitment. Our aim is to ensure that our advisory board and staff, as well as the individuals that we engage in our work, are diverse, representative of the public, and champion a range of perspectives."
        },
        {
            "heading": 2,
            "text": "ED&I is central to the CDEI’s mission "
        },
        {
            "text": "As a government expert body, whose mission focuses on enabling trustworthy innovation in the use of data and AI, ED&I considerations are central to what we do. "
        },
        {
            "text": "Our review into bias in algorithmic decision-making outlined the risks and opportunities posed by increased use of data and AI. As well as finding clear evidence that algorithmic bias can occur, the review pointed to the potential for data to be harnessed to tackle bias and create a fairer, more equal society, if used with appropriate care. "
        },
        {
            "heading": 2,
            "text": "Taking steps to embed values of ED&I in our work at the CDEI "
        },
        {
            "text": "At the CDEI, we proactively consider where our workstreams can help address issues around bias, discrimination and inequality, and examine the impact of our work on different demographic groups. We know that involving diverse people and communities in our work will improve the quality of what we do. This is not just something that we believe is right, it is also a legal responsibility for public bodies under the Equality Act 2010. "
        },
        {
            "text": "In 2020, we developed and launched a new ED&I Strategy internally. This builds on DCMS’s Diversity & Inclusion Strategy and is tailored to the context in which the CDEI operates. It aims to embed values of ED&I in our work at the CDEI through a series of practical commitments and actions, which are grouped around three key pillars: "
        },
        {
            "heading": 2,
            "text": "Ensuring that citizens have a voice in how data and data-driven technologies are used and deployed "
        },
        {
            "text": "We also ensure that our work is informed by public engagement, which has been a core component of our work from the outset. For example, we recently worked with the Cabinet Office’s Central Digital and Data Office (CDDO) and BritainThinks to conduct a deliberative public engagement exercise to explore what meaningful transparency about the use of algorithmic decision-making in the public sector could look like in practice. Giving citizens a voice in the design, development and rollout of technology means we can not only envision, but actively move towards a world where fairer values are embedded and championed. Our Public Attitudes Insights Team makes use of a range of methodologies, including survey research and focus groups. "
        },
        {
            "heading": 2,
            "text": "Get in touch "
        },
        {
            "text": "We welcome your thoughts and challenge about our approach to ED&I, particularly suggestions around further actions that we could be taking. Please get in touch with us at cdei@cdei.gov.uk if you‘d like to discuss our approach to ED&I in more detail. "
        }
    ]
}