{
    "url": "https://rtau.blog.gov.uk/2021/09/10/enabling-trustworthy-innovation-to-thrive-in-the-uk/",
    "title": "Enabling trustworthy innovation to thrive in the UK",
    "authors": [
        "Felicity Burch"
    ],
    "categories": [
        "Artificial intelligence",
        "Data",
        "Trustworthy innovation"
    ],
    "pub_date": "2021-09-10T07:14:21+01:00",
    "content": [
        {
            "text": "I’m delighted that DCMS have today announced the members of our refreshed advisory board and updated on the Centre’s remit going forward. "
        },
        {
            "text": "Since the CDEI was established in 2018, we have published internationally recognised research, including into two of the most challenging cross-cutting issues in this field, online targeting and bias in algorithmic decision-making, with much of this work directly informing government policy. "
        },
        {
            "text": "The insights generated by the CDEI - through research and engagement with the public and a wide range of stakeholders - show that more active support is needed to enable trustworthy innovation to thrive in the UK. If in 2018 the focus was on developing the right principles and frameworks to govern the use of data and AI, the challenge is now to ensure these values are embedded into organisations’ use of these technologies."
        },
        {
            "heading": 2,
            "text": "The CDEI has a vital role to play in enabling trustworthy innovation"
        },
        {
            "text": "The National Data Strategy highlights the UK’s aim to harness the power of data to boost productivity, create businesses and jobs, and improve public services. However, organisations lack information and capability to innovate with data and AI in ways that will command and retain public trust. This can cause them to forgo innovation. "
        },
        {
            "text": "The role of my team at the CDEI and our refreshed advisory board announced today will be to meet this challenge head on; working with organisations across the UK to develop, test and refine approaches to trustworthy data use and AI governance. "
        },
        {
            "heading": 2,
            "text": "Our advisory board will bring a breadth of expertise to the Centre’s projects"
        },
        {
            "text": "Our refreshed advisory board includes globally renowned experts including:"
        },
        {
            "text": "The advisory board will provide hands-on support on our projects, and help to shape our work programme going forward. This will ensure that the CDEI’s projects are informed by a deep understanding of the interventions required to drive forward trustworthy innovation across the public, private and third sector. "
        },
        {
            "heading": 2,
            "text": "We will partner with organisations to develop, test and refine approaches to trustworthy data governance "
        },
        {
            "text": "Our research suggests that public support for greater use of technology depends on trust in how it is governed; putting the right governance regime in place will therefore be crucial if we are to unlock the benefits associated with these technologies. Without public trust, consumers will be less likely to use new technologies or share the data needed to build them, while organisations will be less willing to invest in data-driven solutions. "
        },
        {
            "text": "The CDEI will focus its efforts on supporting partners to innovate with trust. Our work will focus on three areas, aligned with the priorities set out in the National Data Strategy:  "
        },
        {
            "text": "I will be working closely with the advisory board and team at the CDEI to make sure that these projects have a wider systemic impact; ensuring that governance approaches can be replicated and sharing insights which emerge to support organisations across the UK."
        },
        {
            "text": "We are eager to work and engage with a diverse range of stakeholders in the UK and beyond. If you would like to discuss areas for collaboration, or hear more about any of the projects mentioned in this blog, please get in touch at cdei@cdei.gov.uk. "
        }
    ]
}