{
    "url": "https://socialcare.blog.gov.uk/2021/09/10/remembrance-and-reflection/",
    "title": "Remembrance and reflection",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Events",
        "Workforce"
    ],
    "pub_date": "2021-09-10T11:15:13+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Marking many months of sacrifice"
        },
        {
            "text": "Forging a safe path through this pandemic has not been without tremendous sacrifice. It is a path with which I am very familiar, having paid tribute to colleagues and veterans of this and other campaigns throughout the years."
        },
        {
            "text": "Many family members, friends, colleagues and loved ones have been lost to coronavirus, the vast majority in the early weeks and months of the outbreak, as the whole world struggled to understand this new and pernicious disease."
        },
        {
            "text": "Our amazing care sector colleagues, just like their incredible NHS counterparts, did not think twice about protecting those in their care, but sadly – in the dark days before the first vaccines arrived – many succumbed to the virus themselves and we lost some truly wonderful people."
        },
        {
            "text": "An estimated 922 care colleagues in England tragically lost their lives between March 2020 and May 2021. To fall victim to the virus as they strived to protect so many others has a particular poignancy."
        },
        {
            "text": "We cannot, indeed must not, forget their kindness, bravery and dedication. That's why social care bodies across England have joined together to announce the Social Care Day of Remembrance and Reflection. It will take place, next year, on 22 March and be a day to honour the work of the adult social care workforce and remember those we lost."
        },
        {
            "heading": 2,
            "text": "Care Workers' Charity"
        },
        {
            "text": "As we begin the journey towards this important and reflective moment, my sector colleagues and I encourage you to add your stories to The Care Workers’ Charity’s online Memorial and Thank You walls. Help us build a communal tribute to the amazing colleagues we lost and express your thanks to those who continue to provide vital care and support in our care homes and communities."
        },
        {
            "text": "Of course, there are many other ways in which care providers, care workers and those who draw on care and support can participate on the day, include planting trees in honour of a lost care worker, observing a minute’s silence, or creating pieces of art. I think it is important we pay our respects in ways that feel right to us and which authentically express our heartfelt feelings of grief, gratitude and hopes for the future."
        },
        {
            "text": "I will be paying my respects course – as I do every day – and will continue to do so, long after the pandemic has receded to the side-lines of every day life. Many of us are here today because of the kindness, dedication and compassion of those who went before. Let’s make sure the world knows that too. It is their proud legacy and one we are even prouder to share."
        },
        {
            "text": " "
        }
    ]
}