{
    "url": "https://insideDIO.blog.gov.uk/2021/09/10/removing-unexploded-ordnance-at-former-air-weapons-range-raf-cowden/",
    "title": "Removing unexploded ordnance at Former Air Weapons Range RAF Cowden",
    "authors": [
        "Bert Appleton"
    ],
    "categories": [
        "Explosive Ordnance Clearance"
    ],
    "pub_date": "2021-09-10T14:08:51+00:00",
    "content": [
        {
            "text": "A close-in representative image, taken using a drone, of the blast from a 28lb munition which DIO Acting Chief Executive, Kate Harrison, detonated. [Crown Copyright / MOD 2021]I recently organised and held a visitors’ day to highlight the MOD’s approach to removing unexploded ordnance from Mappleton Beach at Former Air Weapons Range RAF Cowden. The visit also enabled DIO to further connect with stakeholders on this unique project."
        },
        {
            "heading": 2,
            "text": "History of RAF Cowden"
        },
        {
            "text": "For those of you who don’t know, RAF Cowden was used as a bombing range from 1959 to 1998 and over the years it has been subject to extensive coastal erosion, regularly leaving unexploded ordnance on the beach."
        },
        {
            "text": "Since February 2021, MOD’s contractors Brimstone Site Investigation Ltd have worked hard to clear and safely dispose of UXO on the site. To do this, we’ve worked closely with local authorities and organisations including the Ramblers to ensure that the public are aware of the clearance activities taking place at RAF Cowden. We’re also working hard to reduce the risk to the public and reduce the burden on emergency services."
        },
        {
            "heading": 2,
            "text": "About the Counter-Explosive Ordnance Defence Engagement Office"
        },
        {
            "text": "The Counter-Explosive Ordnance Defence Engagement (CEDE) Office was established in the MOD in 2018 to carry out government assured–contractor solutions where there is a risk or hazard from explosive ordnance. It’s normally focused on supporting international partners, but the CEDE Office was asked by the organisation to take on the challenge of a contract at RAF Cowden in 2020 and has recently deployed a contractor to provide urgent operational cover at two other air weapons ranges."
        },
        {
            "heading": 2,
            "text": "The visit day"
        },
        {
            "text": "After welcoming over 30 visitors, we kicked off the day with a safety briefing before I gave a short description of the challenges that occur with outsourcing UXO activities. This focused on the degree of care that is taken to select and assure a qualified contractor and the week-by-week management of the whole project."
        },
        {
            "text": "The acting Chief Executive of DIO, Kate Harrison expressed her gratitude to all those responsible and to our local partners for all their support. The Founder and Managing Director of Brimstone Site Investigations Ltd, gave an indication of the enormous quantities of ordnance that have been found, made safe and removed from the beach and echoed the importance of strong communications with the local residents."
        },
        {
            "text": "During a tour of the site, the visitors saw examples of the wide variety of ordnance removed, the contractor’s equipment and a live demonstration of explosives and safe disposal. We also measured the noise levels and described time restrictions to demonstrate the care we take to manage any impact on the local environment."
        },
        {
            "text": "The MOD team answered many questions throughout the day, including about communications with local council members, managing access to the beach and safe removal of all waste materials. Finally, we visited Mappleton beach to see examples of UXO contamination, the effect of coastal erosion and observe a live explosive ordnance disposal. The effects of the tides were also evident as we drove off the beach and all the visitors reflected on the challenges of the project."
        },
        {
            "text": "Overall the visitors’ day went extremely well and everyone went away with a greater understanding of the unique issues at this site and our equally unique solutions to ensure the area remains safe. The MOD, commercial and local stakeholders witnessed the success of the CEDE Office's government assured, contractor delivered model, engaged with each other and provided valuable feedback to enable us to continuously improve providing these services."
        }
    ]
}