{
    "url": "https://geospatialcommission.blog.gov.uk/2021/09/10/the-secret-to-great-geospatial-data-portals-start-with-the-user/",
    "title": "The secret to great geospatial data portals: start with the user",
    "authors": [
        "Carl Watson, Senior Analyst and UX Lead, British Geological Survey"
    ],
    "categories": [
        "Data",
        "Data Standards"
    ],
    "pub_date": "2021-09-10T14:03:02+01:00",
    "content": [
        {
            "text": "Guest blog by Carl Watson, Senior Analyst and UX Lead, British Geological Survey who shares the steps taken to build a data portal for the user.  “After listening to what real users want we have created guidelines for Designing Geospatial Data Portals that aims to make geospatial data more accessible to more people”.  "
        },
        {
            "text": "If you’re reading this blog, we probably don’t need to tell you about the power of geospatial data.  "
        },
        {
            "text": "You wouldn’t be alone. For data scientists, developers and anyone wanting to harness its power, finding the right data can be like looking for a needle in a haystack. This was one of the findings from the Data Discoverability project, a Geospatial Commission programme run in collaboration with the six Partner Bodies to make location data easier to find, access and use. "
        },
        {
            "text": "If you are a data provider, your organisation invests time and expertise to create top-quality data. You know the insights it can provide, the innovation it can spark, but how do you share it with the world? There’s a whole mix of data portals out there, do you just copy one and hope for the best?"
        },
        {
            "heading": 2,
            "text": "Start by putting the user at the centre of your design"
        },
        {
            "text": "Research at the start of the Data Discoverability project uncovered the journey people go through when looking for data. It explored the barriers they face and the frustrations they experience.  "
        },
        {
            "text": "Perhaps you are a developer wanting to delve into data, an innovator looking to grow an idea or a start-up with world-changing ambition. You need location data to make this happen, so you start your search, very possibly in an internet search engine. "
        },
        {
            "text": "In the search results, you follow a link to a data portal (a web-based interface designed to help people find and access data).  You’re not sure if this portal is relevant to you, but you try it anyway…"
        },
        {
            "heading": 2,
            "text": "What’s the worst that can happen? "
        },
        {
            "text": "OK, we’ve painted a picture of the worst-case here. But the risk from badly designed data portals is that the world does not benefit from your life-enhancing product. Or if you work for a local authority, you can’t realise the many benefits the data can deliver, like calculating the optimum routes for school transport. Overall, the economy could miss out on the estimated £11bn per year that could be released through better and wider use of location data."
        },
        {
            "heading": 2,
            "text": "Making things better"
        },
        {
            "text": "After listening to what real users want, we created data portal design examples and guidelines that aim to make geospatial data more accessible to more people.  "
        },
        {
            "text": "We took the research and analysed the pain points for each stage of the user journey. We studied data portals worldwide and gained an understanding of “what good looks like”. We used our learnings to design an example data portal. Each of our example screens solves pain points and here’s where we’ve shown how:-  "
        },
        {
            "text": "You don’t know what to search for? No problem, we’ve provided some hints…"
        },
        {
            "text": "… and recent searches"
        },
        {
            "text": "Too many results?  We’ve provided filters, including location:"
        },
        {
            "text": "Want to be able to assess, at a glance, whether a result is worth exploring? We’ve included meaningful titles, available formats, publisher name and logo, and licence information with a link to inspect that licence, all consistently placed."
        },
        {
            "text": "Here’s our search page example, that brings these elements together:"
        },
        {
            "text": "We combined the example screens into a prototype, which we put in front of developers and data scientists, giving them tasks to complete. Based on their experiences and feedback, we iterated on the designs, and you can see the results on  Designing Geospatial Data Portals. Here you’ll find all our example screens and the design guide to help you develop user-focused geospatial data portals."
        },
        {
            "text": "We’ve produced generic guidance that has relevance to a broad range of organisations.  "
        },
        {
            "text": "It’s important that you undertake your own research to make sure you design data portals that are best for your users’ needs. "
        },
        {
            "heading": 2,
            "text": "A final word"
        },
        {
            "text": "We faced our own geospatial challenges during this project, and for some of us it was the first cross-organisation collaboration done without ever meeting our teammates! We really enjoyed learning new ways of working and learning from each other. We’d love to learn from you, too. "
        },
        {
            "text": "Sign up to this blog to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}