{
    "url": "https://nationalscreening.blog.gov.uk/2021/09/10/would-you-like-to-join-a-uk-nsc-reference-group/",
    "title": "Would you like to join a UK NSC reference group?",
    "authors": [
        "Zeenat Mauthoor"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-09-10T16:00:44+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has 2 important reference groups which are critical to its effective function."
        },
        {
            "text": "These are the:"
        },
        {
            "text": "They scrutinise the developing evidence reviews and provide input to those from their relevant areas of expertise (including clinical, user, academic, economic and ethical). This makes sure they are high quality and credible so the UK NSC can base their formal recommendations on the best evidence and thinking. The reference groups are increasingly becoming involved in advising on innovation, research proposals, horizon scanning and stakeholder engagement."
        },
        {
            "text": "Both groups are currently looking for new members to expand their pools of expertise."
        },
        {
            "text": "The FMCH group currently has 11 vacancies: patient and public voice x2, health visitor, fetal medicine obstetrician, geneticist, midwife, paediatrician, public health expert, laboratory services, epidemiologist, medico-legal."
        },
        {
            "text": "The ARG currently has 3 vacancies: pathologist, medico-legal, public health expert."
        },
        {
            "text": "The reference groups meet 3 times a year for a full day, usually in January, May and September. These take place just before the main UK NSC meeting so that advice can be fed in."
        },
        {
            "text": "There may be additional workshops or meetings pertinent to the conditions covered by the reference group that members can beneficially attend or participate in."
        },
        {
            "text": "Members appointed in a professional capacity must be highly experienced and a practicing expert with a track record in screening. Lay members (patient and public voice) should have a good understanding of how the NHS works and a desire to make an effective contribution as a representative of patients, carers and members of the general public."
        },
        {
            "text": "Prof Katie Robb, social scientist and member of the ARG, said:"
        },
        {
            "text": "If you have any questions, please get in touch via the UK NSC helpdesk."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}