{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/09/10/you-can-make-a-difference-by-supporting-those-around-you/",
    "title": "You can make a difference by supporting those around you",
    "authors": [
        "GSE Profession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-09-10T17:06:02+01:00",
    "content": [
        {
            "text": "You can make a difference by supporting those around you"
        },
        {
            "text": "In this anonymous blog, a colleague discusses their experience supporting a family member to raise awareness for World Suicide Prevention Day on Friday, 10 September."
        },
        {
            "text": "Life can be difficult for individuals, families and workplace teams at times. I have been working on COVID-19 since January 2020. The impact to my family of being at home for prolonged periods, with reduced social contact, with me working long hours, has not been ideal. A few years ago, one of my family members became increasingly anxious and started to self-harm. They attempted to end their life on at least 2 occasions, thankfully unsuccessfully. Our local mental health system and GP were fantastic, sweeping in to help within days, offering cognitive behaviourtherapy and later art therapy. Now, almost a year later we are seeing steady improvements, but the road is not always in a straight line and sometimes feels to be mainly uphill in direction."
        },
        {
            "text": "For my family member, being an anxious introvert,  the pandemic offered increased time alone, seemingly more attractive than real-life. Now, each day, we hope for the small victory of successfully leaving the house. The impact on all my family, having or living with someone with a mental illness, is hard to watch."
        },
        {
            "text": "Why am I sharing all this with you? We have been very lucky. Things could have been so much worse for us. My managers and team have been amazing. I am a laboratory scientist and was based on-site throughout the start of the pandemic. I am being supported to work from home and have been given flexibility to care day to day. For my family this has been life-changing and perhaps life-saving. My family member has not self-harmed for over 4 months now and has not made further attempts to end their life. They can talk to me or just have a hug if needed, because I am there."
        },
        {
            "text": "In the past year I have learnt so much about mental health, the system we have to help people, communication, fatigue, and the importance of self-care in helping me support my family. Others have let me know they have been where we are, supporting loved ones with mental illness and juggling work/life balance. If you are going through something similar, my heart goes out to you. You may not know if someone is going through a crisis and, with increased remote working, regular contact is so important. Please be supportive of colleagues and loved ones. If you are aware that someone in your team is going through a crisis, be as supportive as you can. By being there for them you can make a real difference to them and their loved ones. The International Association for Suicide Prevention  highlights:"
        },
        {
            "text": "‘Actions, no matter how big or small, may provide hope to those who are struggling.’"
        },
        {
            "text": "On Friday 10 September I will light a candle, thinking of those who did not get the support they needed at the time they needed it and thinking, with thanks, for those that did and of those that have supported us throughout this time."
        },
        {
            "text": "IASP's light a candle campaign on 10 September encourages you to light a candle near a window at 8pm to show your support for suicide prevention, to remember a lost loved one, and for the survivors of suicide."
        },
        {
            "text": "David Kenyon, chair of Government Science and Engineering’s disability working group said:"
        },
        {
            "text": "“I am incredibly grateful to my colleague for this open and honest account of their family’s experiences. Talking about mental ill-health whether it is your own, a family member or friend can be very difficult especially in a work environment. However, it is only through such conversations that the right support can be put in place and better outcomes can be achieved. At a time when so many of us are working remotely and missing those face-to-face conversations or chats over coffee, it is easy to miss the subtle social cues that a colleague needs support.  So, it is essential that we take time to ask how things are going and are they ok? Some colleagues will always find it difficult to share the struggles that they or a loved one are facing with others, so it is important that we all try and be supportive and understanding colleagues because that might make the difference to them.”"
        },
        {
            "text": "If you or someone you know has been affected by suicide or needs help with suicidal thoughts you can call the Samaritans helpline on 116 123. They are available 24 hours a day, 7 days a week."
        },
        {
            "text": "For emergencies, please call 999."
        },
        {
            "heading": 3,
            "text": "Additional support"
        }
    ]
}