{
    "url": "https://naturalengland.blog.gov.uk/2025/05/19/action-to-restore-or-create-at-least-38877-hectares-of-wildlife-rich-habitat-has-been-undertaken-since-january-2023/",
    "title": "Action to restore or create at least 38,877 hectares of wildlife-rich habitat has been undertaken since January 2023",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environment Act",
        "Environmental Improvement Plan",
        "Evidence",
        "Landscape",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2025-05-19T09:10:00+01:00",
    "content": [
        {
            "text": "By Dr Ruth Hall, Principal specialist for habitats at Natural England"
        },
        {
            "text": "Today, for the first time we can start to understand our progress towards the Environment Act habitat target, which is to restore or create at least 500,000 hectares of a range of wildlife-rich habitats by 31st December 2042."
        },
        {
            "text": "Natural England and Defra have worked in partnership to analyse data provided from the Environment Agency, the Defra Farming and Countryside Programme, the Forestry Commission, Forestry England, and the Nature for Climate Peatland Grant Scheme to assess the amount of habitat action delivered since January 2023. This is a crucial step to monitor and evaluate work to restore nature."
        },
        {
            "text": "Creating and restoring habitats is crucial for biodiversity, including progress towards the species abundance and extinction targets; contributing to improving environmental quality; and delivering ecosystem services. Evaluating current progress and trends will help inform plans, such as the forthcoming Environmental Improvement Plan, to ensure delivery of the habitat target."
        },
        {
            "text": "Delivering action to create and restore 38,877 hectares of wildlife-rich habitat over two years is significant progress, but we know this is not all the action that has been undertaken. In this first report, we have concentrated on those Defra schemes likely to deliver the most hectarage and that had readily available data to allow robust reporting. We decided it is better to share the data we have in an open and transparent way now, rather than waiting for more data before sharing the extent of progress made."
        },
        {
            "text": "We know that many more people are working hard to create and restore wildlife-rich habitat and we have not been able to capture all of this action in our first progress report. We also know that a number of multi-year schemes will not report their data until completion (e.g. the Species Survival Fund). Some delivery mechanisms report every financial year rather than calendar year, so for these delivery mechanisms we only have one full year’s data since the target began. We will continue to work towards including action delivered by everyone in future reporting where data are available, and we will add any appropriate action undertaken since the beginning of 2023 to the running total when we publish yearly updates."
        },
        {
            "text": "Knowing that the figure reported is currently underreporting, due to the reasons above, makes it difficult to know categorically whether we are on track with the habitat target. If delivery was linear across the target timeframe, we would need to have delivered 56,000 hectares by January 2025 to meet the current Environment Improvement Plan interim target. Whilst we do not currently have sufficient data to show this level of action, we can see that a significant amount of this has been delivered and reported, and we are confident this number will increase as further data become available. Delivery of the target is also unlikely to be completely linear, as large-scale projects like those in the Landscape Recovery scheme have not yet started to deliver. The published report provides further details of exactly what data we have over which time periods and what other data we are currently working to acquire."
        },
        {
            "text": "Alongside the headline figure we can also see which types of habitat we are creating and restoring the most (arable field margins) and the least (coastal and aquatic habitats) so far. Aquatic habitats are particularly difficult to report on as they are often impacted by multiple pressures, meaning that a single action is rarely sufficient to restore them. Consequently, no actions for aquatic habitats have been included in this year’s report, as we did not have the evidence to be confident that sufficient action was underway to completely restore a water body. In future, an outcome approach may be taken for these habitats instead, but it would lead to a longer time lag between action undertaken and reporting."
        },
        {
            "text": "As expected, the report shows agri-environment schemes have delivered most of this target so far. The report also includes information on where action is being taken, reported by amount of delivery in each Local Nature Recovery Strategy area."
        },
        {
            "text": "As habitat creation and restoration should help contribute to delivery of the Lawton principles of bigger, better, more and joined up sites for nature, we analysed the data to see if current delivery is contributing to that ambition. The data shows that some delivery has increased the number of large patches of habitat in England, but we have also continued to deliver many small patches too."
        },
        {
            "text": "The mechanisms that we evaluated are mostly voluntary, so this delivery pattern does not reflect a purposeful focus on particular habitats or patch sizes. Instead, it reflects the appetite of those who use these mechanisms for delivering these actions, as currently incentivised by the mechanism."
        },
        {
            "text": "Whilst much more habitat creation and restoration will be needed over the next eighteen years to meet the habitat target and restore nature, today’s publication shows the journey towards nature recovery is underway, we have hit the ground running, and we look forward with anticipation to seeing these habitats develop into places where wildlife thrives."
        },
        {
            "text": "The full report can be found here: https://publications.naturalengland.org.uk/publication/5726258254839808"
        }
    ]
}