{
    "url": "https://defrafarming.blog.gov.uk/2025/05/19/competition-to-accelerate-agri-tech-investment-guidance-out-now/",
    "title": "Competition to accelerate agri-tech investment: guidance out now ",
    "authors": [
        "Sarah Kaya"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2025-05-19T10:21:16+01:00",
    "content": [
        {
            "text": "A new £5 million round of the Farming Innovation Investor Partnerships competition will open on 2 June. "
        },
        {
            "text": "I'm pleased to say that guidance is now available to help you prepare. "
        },
        {
            "text": "The Investor Partnerships competition blends grant funding with private investment. "
        },
        {
            "text": "It helps agri-tech businesses scale and commercialise innovations that are ready to be used on farms. "
        },
        {
            "text": "In this post, I'll give an overview and share details of an upcoming webinar for you to learn more. "
        },
        {
            "heading": 2,
            "text": "A unique investment model  "
        },
        {
            "text": "The Investor Partnerships competition is part of Defra's Farming Innovation Programme, delivered in collaboration with our partners, Innovate UK. "
        },
        {
            "text": "The competition is unique because it combines public and private funding. It helps agri-tech businesses scale and commercialise innovations that are ready to be used on farms.  "
        },
        {
            "text": "Through the ‘Investor Partner Pool’, grant funding from Defra is matched with equity investment from private investors in the pool. "
        },
        {
            "text": "The Investor Partner Pool includes more than 150 trusted investment organisations. These have been selected for their track record, expertise, and interest in backing innovative, high-growth businesses. "
        },
        {
            "text": "This model encourages private investment and supports the growth of UK agri-tech businesses. "
        },
        {
            "text": "This new round follows a successful pilot that supported 5 agri-tech businesses and attracted more than £10 million in private investment. "
        },
        {
            "heading": 2,
            "text": "Eligibility  "
        },
        {
            "text": "To be eligible, you must be a micro, small or medium-sized business with an experimental technology close to market. You should be looking for late seed or Series A stage investment. "
        },
        {
            "text": "Projects must: "
        },
        {
            "text": "Grant funding will cover: "
        },
        {
            "heading": 2,
            "text": "The application process "
        },
        {
            "text": "Applications open on 2 June 2025 and close on 2 July 2025."
        },
        {
            "text": "To apply, you must: "
        },
        {
            "text": "Applications will be assessed by independent experts from business and academia. "
        },
        {
            "text": "If your project meets the threshold, you will be notified in early August. You’ll then have until December to agree heads of terms with a lead investor. "
        },
        {
            "text": "Successful applicants will be notified after that."
        },
        {
            "text": "You should apply through Innovate UK’s Innovation Funding Service.  "
        },
        {
            "heading": 2,
            "text": "Learn more  "
        },
        {
            "text": "Together with UKRI, we’ll hold a webinar and Q&A session on Thursday 5 June.  "
        },
        {
            "text": "In the session, we’ll: "
        },
        {
            "text": "Sign up to attend the webinar. "
        },
        {
            "text": "If you can’t make the webinar, don’t worry – it’ll be recorded. I’ll add the link here once it’s available."
        },
        {
            "heading": 2,
            "text": "Case study: Upcycled Plant Protein "
        },
        {
            "text": "Through the pilot, 5 ambitious agri-tech businesses received a total of £4 million in Defra grant funding and secured more than £10 million in private investment. "
        },
        {
            "text": "One of those businesses was Upcycled Plant Protein (UPP). "
        },
        {
            "text": "UPP developed Harvesta – a technology that automates the labour-intensive broccoli harvesting process and converts would-be crop waste into nutrient-dense protein ingredients."
        },
        {
            "text": "Harvesta reduces the need for large teams and multiple field passes, lowering labour dependency and costs for farmers. Lower harvest costs, less pressure from labour shortages, and reduced waste means that UPP has been able to enhance the viability and productivity of broccoli harvesting for farmers. "
        },
        {
            "text": "Investor Partnerships stimulated research and development in UPP. Through the competition, UPP were able to secure more than £350,000 in grant funding from Defra, and over £700,000 in private investment.  "
        },
        {
            "text": "Mark Evans, CEO of UPP, said: 'The Investor Partnership competition has played a catalytic role in delivering new technologies and business models that will help secure the financial sustainability of UK broccoli farmers. This will strengthen the resilience of UK farming and food supply, and support the development of new, highly nutritious, hypoallergenic and sustainable foods UK consumers love — all produced here in the UK.'"
        },
        {
            "heading": 2,
            "text": "Stay up to date  "
        },
        {
            "text": "For the latest news and updates from the Farming and Countryside Programme, subscribe to the Farming blog."
        },
        {
            "text": "By subscribing, you’ll receive an email notification whenever we publish a new post. "
        }
    ]
}