{
    "url": "https://forestrycommission.blog.gov.uk/2025/05/19/how-to-help-young-trees-survive-prolonged-hot-dry-weather/",
    "title": "How to help young trees survive prolonged hot dry weather",
    "authors": [
        "Chris Watson"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree planting",
        "Woodland creation"
    ],
    "pub_date": "2025-05-19T13:47:53+01:00",
    "content": [
        {
            "text": "This spring has been particularly challenging for young trees with prolonged spells of hot dry weather, but there are things we can do to help them survive."
        },
        {
            "text": "The first 12 to 36 months after planting are a critical time for young trees as they adapt to new site conditions, develop their roots and get established. During this period, water availability is a critical factor."
        },
        {
            "text": "Prolonged exposure to dry conditions can impact trees in several ways. Initially, trees have natural responses which help them cope with these conditions. These can include increasing root development to encourage uptake of more water and reducing water loss from leaves during the hottest periods. Early signs include wilting of leaves/needles, and in these initial stages trees are usually able to recover from these conditions."
        },
        {
            "text": "As periods of dry weather continue, trees’ responses to the weather conditions can become detrimental to their ability to photosynthesise, their growth may be restricted and permanent cell damage and loss of whole shoots, branches and roots can occur. In young trees it is likely that extended periods of exposure to drought will result in tree death."
        },
        {
            "heading": 2,
            "text": "A changing climate"
        },
        {
            "text": "Unfortunately, young trees are increasingly faced with extended periods of hot, dry weather from early spring onwards, leading to drought conditions in some areas of the country. Many young trees will struggle to survive under these conditions. "
        },
        {
            "text": "This is by no means an isolated event. As we see our climate change, we are experiencing the alteration of seasonal weather patterns with long dry springs becoming a common occurrence. We should therefore see this as a timely reminder to plan for increasingly unpredictable and challenging conditions."
        },
        {
            "heading": 3,
            "text": "What can you do?"
        },
        {
            "text": "The good news is that there are things you can do to prepare for such events and alleviate the pressure on trees through hot and dry weather which also increases their overall resilience to pests and diseases."
        },
        {
            "heading": 2,
            "text": "Things to do now"
        },
        {
            "heading": 3,
            "text": "Water larger ‘standard’ trees"
        },
        {
            "text": "During dry periods, young standards planted in urban or rural areas can require 20 litres of water every other day. Councils and community groups should consider organising volunteers to water trees using non-potable water sources such as rainwater harvesting and household ‘grey’ water (for example water from baths or washing up). "
        },
        {
            "text": "Contaminants such as detergent and soap are unlikely to cause issues for the trees from short-term, emergency use, but grey water should be used within 24 hours of collection to minimise any bacterial growth."
        },
        {
            "heading": 3,
            "text": "Weeding"
        },
        {
            "text": "Where trees are young and surrounding vegetation is competing with the tree’s roots for water, removing this vegetation can help the tree."
        },
        {
            "heading": 3,
            "text": "Firming up soil around trees"
        },
        {
            "text": "Where the soil is cracked, make sure young trees are in contact with the soil to avoid damage to exposed roots and to reduce evaporation so that they can extend their root systems in search of water."
        },
        {
            "heading": 2,
            "text": "Preparing for next year"
        },
        {
            "text": "Unfortunately, it might be too late to save some trees, but you can prepare for future dry weather and take action to anticipate these challenges:"
        },
        {
            "heading": 3,
            "text": "Thorough beat-up surveys to assess mortality"
        },
        {
            "text": "Towards the end of summer, whilst leaves are still on the trees, it is important to get an accurate assessment of losses (it can be difficult to establish the extent of mortality once trees move into winter and leaves begin to fall). The sooner an assessment can be made, the sooner trees can be ordered as replacements. Increased demand for planting stock as a result of this year’s drought will put pressure on tree availability. "
        },
        {
            "text": "Do remember, particularly for established trees, they may look dead but premature autumn senescence (leaf fall) or rust/pest outbreak can make a tree look dead when it is very much alive; don’t remove trees unless you’re certain they’ve died."
        },
        {
            "heading": 3,
            "text": "Autumn planting"
        },
        {
            "text": "Try to begin new planting, restocking or beat-up (the replacement of dead trees) as early as possible – this can be as early as the start of autumn, although this may require the use of cell grown trees, rather than bare rooted stock. Planting in autumn will allow trees to respond better to their new site conditions before the challenges of spring and hot weather. Tree root development can continue during winter, especially if mild, and this can help ensure the best chances of water uptake in spring."
        },
        {
            "heading": 3,
            "text": "Quality planting material"
        },
        {
            "text": "Ensuring a good root/shoot ratio on healthy trees is important to give your trees the best chance of survival. Smaller overall tree size with good root development is better than big plants when planning for drought."
        },
        {
            "heading": 3,
            "text": "Plant handling "
        },
        {
            "text": "Ensure trees are carefully handled to avoid root damage and plant as soon as possible after lifting in the nursery to avoid the risk of desiccation. Even five minutes left with bare roots exposed during planting can lead to the death of a young tree."
        },
        {
            "heading": 3,
            "text": "Weed management "
        },
        {
            "text": "In the early stages of establishment, tree roots are directly in competition with other vegetation for water. Good control of weed growth immediately around the trees both before planting and during the growing season will help trees access water."
        },
        {
            "heading": 3,
            "text": "Mulching"
        },
        {
            "text": "Mulching can be helpful in controlling both competing weed growth and maintaining soil moisture immediately around the plant; this is especially relevant where bare earth is present at the planting location. Mulching can also be done as a response to the current drought."
        },
        {
            "heading": 3,
            "text": "Watering tubes or bags"
        },
        {
            "text": "When planting urban standards, installing watering tubes or bags reduces surface water run-off and ensures water reaches the tree roots."
        },
        {
            "heading": 2,
            "text": "Planning for the future"
        },
        {
            "text": "Drought is likely to become an ever more present threat to our trees, woods and forests as our climate changes. It is therefore essential that any woodland creation or restocking assesses the potential for changing local conditions over the lifespan of the trees being planted."
        },
        {
            "text": "Choosing the right trees for the site and owner’s objectives has never been more important, as is making sure that trees are sourced from suppliers who meet the requirements set out in the Plant Health Management Standard, such as by being a member of the Plant Healthy Certification Scheme or by obtaining a successful Ready to Plant assessment."
        },
        {
            "text": "Use Forest Research's Ecological Site Classification system to help you identify the best trees for both current soils and site factors as well as predicted future climate suitability."
        },
        {
            "text": "The Right Trees for a Changing Climate database supports species choice in an urban environment where a range of characteristics may be important."
        }
    ]
}