{
    "url": "https://defradigital.blog.gov.uk/2025/05/19/rolling-out-digital-delivery-at-scale-in-defra/",
    "title": "Rolling out digital delivery at scale in Defra",
    "authors": [
        "Richard Baines"
    ],
    "categories": [
        "Defra digital",
        "Digital delivery",
        "Digital transformation"
    ],
    "pub_date": "2025-05-19T14:42:03+01:00",
    "content": [
        {
            "text": "Deputy Director for Digital Delivery Richard Baines reflects on designing environments for digital delivery. Moving away from hierarchical culture and change frameworks, he outlines Defra's emerging 'outcome delivery groups' model  and how it's being rolled out across the group."
        },
        {
            "text": "If you ask any digital delivery leader in government what the biggest challenges they face are, there’s a good chance you will end up in a conversation about:"
        },
        {
            "heading": 2,
            "text": "Creating a delivery environment"
        },
        {
            "text": "Since the introduction of the Service Manual and Agile delivery, the practice of digital service delivery in government has quite rightly moved away from a hierarchical culture and frameworks for governing change that excessively centralise control and design up-front. "
        },
        {
            "text": "Governance principles like ‘don’t slow down delivery’ and ‘decisions when they’re needed, at the right level’ have put working services in the hands of citizens faster than ever before, and reduced the risk of time and money being spent developing the wrong things."
        },
        {
            "text": "For delivery teams, the Service Manual and Service Standard give a deep understanding of how to thrive in this environment. "
        },
        {
            "text": "However, once you step outside of a team and lead multiple teams – as I first did many years ago – you may become responsible for creating and growing this sort of delivery environment. "
        },
        {
            "text": "There is a bewildering array of methodologies aimed at middle and senior managers looking for a template to design their organisation in a way that achieves the same sort of user-centred, iterative delivery outcomes we expect from a small empowered Agile team. "
        },
        {
            "text": "Some of us in Digital jokingly call this the “agile industrial complex”. It's full of supposedly turn-key frameworks that may move the organisation towards the right direction, but more often than not in my view, still present hierarchical structures of control. They borrow words from Agile methodologies, but are quite contrary to the principles articulated in the Service Manual."
        },
        {
            "heading": 2,
            "text": "'Do it with the right people'"
        },
        {
            "text": "At Defra, when designing our environment for Digital Delivery, we’ve thought a lot about the governance principle 'do it with the right people'. "
        },
        {
            "text": "This reminds us to:"
        },
        {
            "heading": 2,
            "text": "Outcome delivery groups"
        },
        {
            "text": "We call our environment 'outcome delivery groups' and I’m fortunate to be leading the first, which we’ve piloted with the Animal and Plant Health Agency. "
        },
        {
            "text": "As part of the design, we aim to ensure the delivery roadmap is developed in collaboration between digital, operational and policy staff."
        },
        {
            "text": "It's really important to emphasise that digital delivery should never exist in a vacuum inside the organisation. We need close working partnerships between the user researchers deeply listening to the needs of our citizens, and the subject matter experts who understand the impact our policies and services have. "
        },
        {
            "text": "The product managers and service designers working on the roadmap and the future digital service vision must work with the policy professionals who deeply understand the needs of ministers and, in our case, the responsibility we have to enhance biosecurity and protect the food supply and welfare of animals and plants across the United Kingdom."
        },
        {
            "text": "There are many reasons for this joined up approach, some of which are outlined in the blueprint for modern digital government (see 'join up public sector services'). However, put simply, it helps our teams to quickly build the right thing, and build the thing right."
        },
        {
            "heading": 2,
            "text": "How decisions get made"
        },
        {
            "text": "So you might be wondering at this point, how do decisions get made in the outcome delivery group? In the UK government’s governance principles, it states:"
        },
        {
            "text": "The move to product and service centric ownership for us has led to a positive shift towards role based decision making at the right level. As delivery group lead I use our governance forums to coach and support delivery teams in achieving their outcomes."
        },
        {
            "text": "The ceremonies in our delivery group emphasise show and tells, which leads to us understanding delivery a lot better than if we made decisions based on committees receiving lengthy options papers to appraise."
        },
        {
            "text": "There is a noticeable shift in skillset required for this kind of role, moving away from reliance on project and programme methodologies and putting more emphasis on experience in Government Digital and Data practices. So my background in product management and working within delivery teams in the past helps a lot here."
        },
        {
            "text": "There is still the need to support teams with commercial, financial, political and strategic issues – they are present as ever. However, in this modern age, there is an opportunity here for us at Defra to redefine the role of a ‘deputy director for digital delivery’. We can really embody the principles that come from the service manual and role model excellent servant-leadership ourselves."
        },
        {
            "heading": 2,
            "text": "Implementing outcome delivery across Defra"
        },
        {
            "text": "Looking to what’s next for us in Defra, we are now looking to implement this outcome delivery group approach across the entire group. "
        },
        {
            "text": "I’m really enjoying leading this change with my colleagues. I hope you enjoy this and future blog posts we’ll release soon to give more insight into how we’re doing this at scale."
        },
        {
            "text": "Richard Baines is Deputy Director of Digital Delivery at Defra. Follow Richard on LinkedIn."
        }
    ]
}