{
    "url": "https://space.blog.gov.uk/2025/05/19/uk-aims-to-lead-an-instrument-on-nasa-mission-to-find-habitable-worlds/",
    "title": "UK aims to lead an instrument on NASA mission to find habitable worlds",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Space exploration",
        "Space science"
    ],
    "pub_date": "2025-05-19T11:22:34+01:00",
    "content": [
        {
            "text": "The UK Space Agency is taking its first major step towards contributing to NASA’s Habitable Worlds Observatory (HWO), a next-generation space telescope designed to search for Earth-like planets and signs of life beyond our Solar System. "
        },
        {
            "text": "Today the Agency is launching a call for proposals from UK-based research organisations and companies to explore the feasibility of a UK-led scientific instrument for the mission. "
        },
        {
            "text": "This early-stage investment will support studies to develop concepts for instruments such as imagers or spectrographs. These studies will determine whether a UK-led instrument could be included on the mission. While the mission won’t launch until the early 2040s, the UK must act now to be ready for NASA’s selection process in 2026. "
        },
        {
            "text": "Dr Caroline Harper, Head of Space Science at the UK Space Agency, said:"
        },
        {
            "text": "NASA has expressed strong support for international collaboration on HWO, much as it did with the James Webb Space Telescope (JWST). The UK led the European consortium that designed and built the MIRI instrument for JWST— one of four instruments on board, and that leadership delivered long-term benefits for the UK, winning more observing time than any country aside from the US in NASA’s first competition. The UK Space Agency hopes to replicate this model on HWO. "
        },
        {
            "text": "Potential applicants include universities and national labs, which can collaborate with UK industry partners. In the case of MIRI, major UK companies such as Airbus played critical roles in systems engineering and project management. This new call encourages similar partnerships, with research institutions acting as principal investigators and grant recipients. "
        },
        {
            "text": "While the current call focuses only on feasibility and design concepts, the Agency is clear that long-term funding for construction and delivery would depend on future government approval.  "
        },
        {
            "text": "HWO’s modular design is particularly exciting—it will be positioned a million miles from Earth, and its instruments will be replaceable using robotic servicing."
        },
        {
            "text": "Beyond scientific discovery, HWO presents broader economic and societal benefits. Space missions drive innovation across sectors, with technologies like AI tools from Gaia now being adapted for use in cancer diagnostics. They also support high-skill jobs, attract global talent, and inspire young people to pursue STEM careers. "
        },
        {
            "text": "As part of its strategic planning, the UK Space Agency is working closely with international partners and will co-lead European discussions on HWO in Austria this July. Later in the month, UK representatives will also attend a key NASA meeting in Washington focused on defining HWO’s detailed science objectives and technical needs. "
        },
        {
            "text": "This is a pivotal moment for UK space science. With strong heritage, world-class researchers, and growing industrial capability, the UK is well positioned to shape one of the most ambitious astronomical missions of the 21st century. "
        }
    ]
}