{
    "url": "https://nationalscreening.blog.gov.uk/2025/01/30/2021-to-2022-data-from-england-underlines-huge-impact-of-national-nhs-screening-programmes/",
    "title": "2021 to 2022 data from England underlines huge impact of national NHS screening programmes",
    "authors": [
        "Sophie Mitra"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-01-30T09:11:58+00:00",
    "content": [
        {
            "text": "The importance of the NHS screening programmes to the public’s health is underlined in a high level summary of data from the NHS Screening Programmes in England for the screening year 2021 to 2022.   The data includes an overview of the effectiveness of all 11 national screening programmes between 1 April 2021 and 31 March 2022. Some of these quality assured end-to-end programmes were still recovering from the effects of the COVID-19 pandemic during that year but they continued to deliver vital services."
        },
        {
            "heading": 2,
            "text": "Big impact"
        },
        {
            "text": "NHS screening programmes in England invite around 15 million people every year and about 10 million people take up the invitation."
        },
        {
            "text": "These evidence-based end-to-end programmes have a huge impact, including:"
        },
        {
            "text": "Michelle Kane, Director of Vaccination and Screening Delivery and Transformation at NHS England, said:"
        },
        {
            "heading": 2,
            "text": "Report headlines"
        },
        {
            "text": "During the screening year 2021 to 2022, the NHS carried out more than 15 million screening tests for all conditions. This included screening more than 4 million people for bowel cancer, 2.2 million women for abnormalities in breast tissue, and almost 3.5 million people for cervical abnormalities."
        },
        {
            "text": "Coverage for the NHS AAA Screening Programme was 70.2%, with 217,117 cohort men tested. More than 2.2 million people were tested for diabetic retinopathy by the NHS DES Programme, giving an uptake of 78.4%."
        },
        {
            "text": "Coverage for the antenatal screening programmes remained high in the screening year 2021 to 2022. For the NHS Infectious Diseases in Pregnancy Screening (IDPS) programme, coverage for screening of the 3 infections (HIV, hepatitis B and syphilis) was 99.8%. Coverage for the fetal anomaly ultrasound, part of the NHS Fetal Anomaly Screening Programme (FASP), was 99.1% and coverage for the NHS Sickle Cell and Thalassaemia (SCT) Screening Programme was 99.7%."
        },
        {
            "text": "The newborn programmes also had high coverage in the screening year 2021 to 2022. For the NHS Newborn and Infant Physical Examination (NIPE) Programme, 96.6% of eligible babies were screened within 72 hours of birth. Coverage for the NHS Hearing Screening Programme (NHSP) was 98.3%, and 99.3% of babies had the screening process completed within 3 months of their estimated date of delivery (3 months corrected age)."
        },
        {
            "text": "For the NHS Newborn Blood Spot (NBS) Screening Programme, 97.4% of babies were tested and had a result recorded on the Child Health Information System by 17 days. A total of 1,207 babies tested positive for one of 9 rare but serious conditions, enabling timely referral and treatment."
        },
        {
            "heading": 2,
            "text": "Terminology"
        },
        {
            "text": "Screening programmes use coverage and uptake measures to show the proportion of people screened. Coverage is the proportion of individuals eligible for screening at a given point in time who receive an adequate screen within a specified time period. Uptake is the proportion of those invited for screening who receive an adequate screen within a specified time period."
        },
        {
            "text": "There are also a number of other standards and key performance indicators (KPIs) for each programme that make sure local screening services are safe and effective across the screening pathway."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "We would like to thank everyone involved in the screening programmes, all those involved in collecting and collating the data, and most of all those from the NHS who deliver the screening services."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}