{
    "url": "https://marinedevelopments.blog.gov.uk/2025/01/30/best-practice-working-together-for-success/",
    "title": "Best Practice: working together for success",
    "authors": [
        "Mae van Loaf, Coastal Marine Planner (South West)",
        "Ellie Hoad, Coastal Marine Planner (South West)",
        "Charlotte Stadden, Coastal Marine Planner (South)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-01-30T09:13:27+00:00",
    "content": [
        {
            "text": "Strengthening Coastal Planning: Our Engagement with Local Planning Authorities in the South West"
        },
        {
            "text": "Effective planning at the interface of marine and terrestrial environments requires collaboration and clear communication between decision-makers. The Marine Management Organisation (MMO) works with local planning teams to integrate marine plans into their decisions across the land-sea border. Our recent engagements with Stroud District Council and Forest of Dean District Council demonstrate the benefits of this approach."
        },
        {
            "text": "Navigating Marine and Terrestrial Boundaries"
        },
        {
            "text": "In late 2023, we were consulted by Stroud District Council regarding a 2017 planning application for the Sharpness Docks site and its interaction with the South West Marine Plan. Marine planning is often overlooked within estuary environments, which do not immediately identify with the term 'marine'. However, concerns raised by residents about the lack of marine plan considerations prompted us to clarify their relevance."
        },
        {
            "text": "The docks, with a lock system connecting directly to the Severn Estuary, hold significance to the marine area. In response, our marine planning team issued a comment emphasising that activities such as improvements, drainage, or sewage discharges are likely to affect the surrounding marine environment and therefore fall under marine planning regulations."
        },
        {
            "text": "Building Capacity through tailored Implementation Sessions"
        },
        {
            "text": "Recognising a broader knowledge gap, our marine planning team in the South West offered to deliver a bespoke implementation session for Stroud District Council's planning team. Tailored to the district area, the session used case studies of similar locations to demonstrate how marine plans influence planning decisions."
        },
        {
            "text": "The session attracted a variety of attendees, ranging from trainee planning officers to senior strategy planners. Feedback from Stroud was highly encouraging, reflecting an improved understanding of marine planning and its relevance to their work."
        },
        {
            "text": "\"It was very useful to get a wider understanding within our team of marine planning and the interaction with what we do.\""
        },
        {
            "text": "Extending Our Reach"
        },
        {
            "text": "Following our session with Stroud, planning officers from neighbouring councils, including the Forest of Dean District Council, expressed interest in similar support. We provided guidance on a river-based planning application, delivering a detailed note outlining relevant marine plan policies. This proactive approach highlighted the impact of our training sessions."
        },
        {
            "text": "The Power of Engagement"
        },
        {
            "text": "Our work with Stroud and Forest of Dean Councils showcases the tangible benefits of effective engagement:"
        },
        {
            "text": "By continuing to work with local authorities, we aim to align marine and terrestrial planning for the benefit of coastal communities and the environment."
        },
        {
            "text": "As part of the MMO’s commitment to marine and terrestrial integration, we’re assessing how marine plans support emerging local plans, particularly those in development. If you think similar support could be relevant to your planning organisation, please reach out to us at planning@marinemanagement.org.uk."
        },
        {
            "text": "Strengthening Connections through the South West Marine Planning Focus Group"
        },
        {
            "text": "Collaboration and stakeholder engagement are fundamental to effective marine planning. To support this, coastal planners in the South West recently developed the South West Marine Planning Focus Group. This group emerged from focus sessions held during our annual monitoring surveys in 2023, where stakeholders expressed appreciation for having a dedicated space to engage directly with the marine planning team, exchange updates, and raise key concerns. Recognising the value of these connections, we decided to keep the conversation going."
        },
        {
            "text": "Building a Space for Collaboration"
        },
        {
            "text": "Over the past year, we have worked hard to develop and refine this group to ensure it delivers real value. Our focus has been on fostering a shared understanding of marine planning and providing a platform for open communication."
        },
        {
            "text": "What have we accomplished so far?"
        },
        {
            "text": "Looking Ahead"
        },
        {
            "text": "The success of the South West Marine Planning Focus Group has sparked interest in exploring this model in the future. As we move forward, we aim to enhance the integration of marine planning and terrestrial planning, ensuring a more cohesive approach to managing our marine and coastal spaces."
        },
        {
            "text": "To stay connected and help shape the future of marine planning, contact us at planning@marinemanagement.org.uk."
        },
        {
            "text": "Collaborating with the Isle of Wight: A Successful Statement of Common Ground (SoCG)"
        },
        {
            "text": "Effective collaboration is key to successful marine and terrestrial plan integration. A recent example is our work with the Isle of Wight Council on a Statement of Common Ground (SoCG) between the South Marine Plan and the upcoming Island Planning Strategy. SoCGs are document agreements between authorities, ensuring a shared vision on cross-boundary issues."
        },
        {
            "text": "Building a Strong Foundation for Collaboration"
        },
        {
            "text": "Our marine planning team has maintained ongoing collaboration with the Isle of Wight Council though regular engagement."
        },
        {
            "text": "How We Worked Together on the SoCG"
        },
        {
            "text": "When the Isle of Wight Council approached us with their initial draft, they were in the Pre-Submission Draft (Regulation 19) planning stage of the Island Planning Strategy (IPS) 2022-2037, which has since been submitted for examination. They had already put significant effort into aligning their local planning policies with the South Marine Plan, sharing a detailed table cross-referencing policies between the two plans."
        },
        {
            "text": "We worked closely with the council to review the document and clarify key policies. Initially, some marine plan policies appeared to lack equivalent local plan policy. However, upon further inspection, we found they were more aligned than initially thought. After consulting marine planning policy leads, we confirmed alignment and refined the wording to ensure consistency. In cases where minor differences remained, we collaboratively resolved them, ensuring the final document reflected a shared understanding and served as a best-practice example of an SoCG."
        },
        {
            "text": "Key Takeaways"
        },
        {
            "text": "Our work with the Isle of Wight Council highlights several important lessons:"
        },
        {
            "text": "Looking Ahead"
        },
        {
            "text": "The successful completion of the Isle of Wight’s SoCG stands out as a prime example of how collaboration between marine and local planning authorities can lead to meaningful outcomes. As we move forward, we are excited to continue working closely with local authorities to ensure that marine and terrestrial planning remain aligned."
        },
        {
            "text": "If you would like to discuss marine and terrestrial integration in your area, please contact your local coastal planner."
        }
    ]
}