{
    "url": "https://defrafmp.blog.gov.uk/2025/01/30/developing-fmps-share-your-views-on-wrasses-and-seabream/",
    "title": "Developing FMPs: share your views on wrasses and seabream",
    "authors": [
        "Mark Qureshi - Principal Fisheries Manager, Marine Management Organisation"
    ],
    "categories": [
        "Seabream FMP",
        "Wrasses complex FMP"
    ],
    "pub_date": "2025-01-30T17:18:07+00:00",
    "content": [
        {
            "text": "Following the recent closure of Defra’s consultations on the latest set of Fisheries Management Plans (FMPs), we are now looking ahead to the next set of England led plans.  "
        },
        {
            "text": "The Marine Management Organisation (MMO) is leading on the development of three of these upcoming FMPs, which are the wrasses complex FMP, the seabream FMP, and the Celtic Sea and Western Channel demersal FMP. "
        },
        {
            "text": "We’ve been engaging with stakeholders since the autumn, and we’ve had some useful conversations.  "
        },
        {
            "heading": 2,
            "text": "Thank you "
        },
        {
            "text": "Thank you to all those who have joined us at our recent events, both online and in-person in the South and South West. We’ve talked to stakeholders across sectors to make sure all views are considered as we develop the plans before drafting them- from the commercial fishing sector, including fishers and producers, to recreational anglers including the Angling Trust. We’ve also spoken with academics and environmental interest groups, including eNGOs (environmental non-governmental organisations). "
        },
        {
            "heading": 2,
            "text": "Effective engagement "
        },
        {
            "text": "We’ve found that effective engagement comes from speaking to key stakeholders and having constructive conversations, listening to stakeholders voicing their concerns, and their thoughts on potential solutions.  "
        },
        {
            "text": "We’ll continue our engagement activities whilst drafting the plans. "
        },
        {
            "heading": 2,
            "text": "Upcoming engagement opportunity- wrasses complex FMP and seabream FMP "
        },
        {
            "text": "We are hosting an online session on Monday 10 February 17:30-19:30.  "
        },
        {
            "text": "The aim is to engage with anyone who couldn’t attend the recent workshops and drop-in events that we held. "
        },
        {
            "text": "During this meeting, we will provide an overview of the outputs from the earlier engagement and allow some time for suggestions or queries regarding these fisheries to be raised.  "
        },
        {
            "text": "Please contact the FMP team at fmp@marinemanagement.org.uk  to receive a joining link for the Microsoft Teams session. "
        }
    ]
}