{
    "url": "https://civilservice.blog.gov.uk/2025/01/30/get-the-write-stuff-to-boost-your-career/",
    "title": "Get the write stuff to boost your career",
    "authors": [
        "Government Campus"
    ],
    "categories": [
        "A Skilled Civil Service"
    ],
    "pub_date": "2025-01-30T15:53:07+00:00",
    "content": [
        {
            "text": "Government Skills learning expert Jonathan Marshall explains how his ‘JASPER’ course can help civil servants elevate their writing skills."
        },
        {
            "text": "Writing well is one of the stand-out skills civil servants need to thrive in their jobs and progress in their careers. Whether it’s a simple email to a colleague or a detailed briefing paper for ministers, how you express yourself and your ideas in writing is crucial."
        },
        {
            "text": "Indeed it is a cornerstone of your ability to communicate and influence those around you - one of the behaviours every civil servant needs to demonstrate when they go for a new job or promotion. Because they are so important, the Civil Service recommended learning curriculum has an entire learning pathway devoted  specifically to helping civil servants develop their writing skills. Packed with valuable how-to lessons spanning Writing effective emails, Advance your writing in government, Advising and Briefing, Drafting Masterclass and more."
        },
        {
            "text": "And the starting point is the Foundations of Writing in Government (JASPER) - a free online course that is highly rated by those who do it. During four hours of bite-size learning, the JASPER course takes you through the basics of effective writing and includes a checklist of tips to help you improve your skills:"
        },
        {
            "text": "J is for Jargon"
        },
        {
            "text": "It is incredibly easy to slip into the jargon of our organisation or profession. Sometimes we do it to ‘fit in’. But it hinders communication. Nobody in the real world wants to hear about ‘rebaselining’, ‘ringfencing’ or ‘predictors of beaconicity’."
        },
        {
            "text": "A is for Acronyms"
        },
        {
            "text": "You need to Spell It Out The First Time (SIOTFT) with the acronym in brackets."
        },
        {
            "text": "S is for short sentences and paragraphs"
        },
        {
            "text": "Break your long, dense, meandering text down into punchy, crisp sections for easy reading."
        },
        {
            "text": "P is for Plain English"
        },
        {
            "text": "Don’t promise them ‘extensive multi-platform stakeholder engagement’, say that we’ll be talking to them in many different ways."
        },
        {
            "text": "E is for Editors"
        },
        {
            "text": "We’re human - we can’t spot all our own mistakes. We need colleagues and software to help us."
        },
        {
            "text": "R is for Readers"
        },
        {
            "text": "The ultimate aim of our writing is to communicate. From the beginning to the end of the writing process, we should be thinking: who is my audience, and what do they need?"
        },
        {
            "text": "Civil servants such as Leeds-based public health expert Karen Horrocks vouch for JASPER’s value and say it has helped them embrace clarity and simplicity in the way they write."
        },
        {
            "text": "You can get an enrolment link for the Foundations of Writing in Government: JASPER course - and information about our wider offer on writing skills - on Civil Service Learning. "
        }
    ]
}