{
    "url": "https://services.blog.gov.uk/2025/01/30/get-involved-with-services-week-2025/",
    "title": "Get involved with Services Week 2025 ",
    "authors": [
        "Ella Boyer - Senior Communications and Events Manager, CDDO",
        "Angie Dickinson, Senior Communications Manager, CDDO"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2025-01-30T15:15:32+00:00",
    "content": [
        {
            "text": "Services Week is back and the theme for 2025 is - people-centred services. Designing effective public services starts with innovation, a strong understanding of what people need from services, and close collaboration between different teams and specialisms. Are you a digital and data professional in the public sector? Services Week is an opportunity to share, to learn and to collaborate, all with the aim of transforming lives through high quality, technology-powered services."
        },
        {
            "text": "If you want to add a session to this year’s Services Week complete the form below by 3 March, you can also see how the agenda shapes up below."
        },
        {
            "heading": 3,
            "text": "What is Services Week? "
        },
        {
            "text": "Services Week is a yearly event hosted by the Government Digital and Data community with the aim of bringing the public sector together to share best practice and learn from others, improving public services. You can read more about Services Week here. "
        },
        {
            "heading": 3,
            "text": "Why take part? "
        },
        {
            "text": "Services Week is an opportunity to showcase your work to people from across the public sector. It's an especially exciting time to be involved, as we celebrate the launch of the new digital centre of government, which has been set up to lead work that’s more than just a change – it will help catalyse a wholesale reshaping of the public sector, reaching out to local government, the NHS, and the private sector too. Last year’s event attracted over 5,000 attendees across the week from across 60 sessions and Services Week 2025 aims to be bigger and better than ever. "
        },
        {
            "text": "Services Week is a fantastic opportunity to:"
        },
        {
            "text": "Last year’s sessions included:"
        },
        {
            "heading": 3,
            "text": "How to get involved"
        },
        {
            "text": "If you're interested in hosting a session at this year’s event please complete the session submission form by 3 March at the latest. The form allows you to outline your proposed session ready for publication in the live agenda below. It's a great opportunity to showcase your knowledge, connect with a wider audience, and be part of the ongoing conversation about improving service delivery. Be sure to submit your proposal early to maximise sign ups for your session!"
        },
        {
            "text": "You can also join our cross-government Slack channel for all the latest information and resources. "
        },
        {
            "text": "If you have any questions please get in touch with the team.  "
        },
        {
            "heading": 3,
            "text": "Live agenda"
        },
        {
            "text": "Sessions coming soon!"
        },
        {
            "heading": 3,
            "text": "Keep connected"
        },
        {
            "text": "Follow us on LinkedIn and sign up to the Government Digital and Data blog for the latest updates, insights, and a closer look at the exciting transformations happening within Government Digital and Data."
        }
    ]
}