{
    "url": "https://ssac.blog.gov.uk/2025/01/30/have-you-ever-wondered-how-impartial-and-informed-advice-makes-for-better-law/",
    "title": "Have you ever wondered how impartial and informed advice makes for better law?",
    "authors": [
        "Professor Stephen Hardy"
    ],
    "categories": [
        "About the Committee",
        "Department for Communities (Northern Ireland)",
        "DWP",
        "Legislation",
        "social security"
    ],
    "pub_date": "2025-01-30T17:04:34+00:00",
    "content": [
        {
            "text": "The Social Security Advisory Committee (SSAC) is an independent statutory body which provides exactly that when it comes to social security and related matters under the remit of the Secretary of State for Work and Pensions and the Department for Communities (Northern Ireland)."
        },
        {
            "text": "SSAC since 1980 has scrutinised complex secondary legislation (i.e. Regulations) laid before Parliament related to all social security benefits. As a Committee, comprised of a diverse range of individuals all of whom have experiences or an expertise in matters that underpin the UK’s social security system, they support departmental officials to ensure that any proposed legislation is of the highest quality and that it delivers ministerial policy intent.  "
        },
        {
            "text": "Recently, SSAC has scrutinised Infected Blood Capital Disregard amendments; Social Fund Winter Fuel payments; and the Universal Credit Administrative Earnings Threshold. Such scrutiny involves meeting with departmental officials and discussing the rationale, aims, impact and delivery of the Regulations being proposed."
        },
        {
            "text": "So, if you have ever wondered how impartial and informed advice makes better law AND you have an interest and/or expertise in social security law, why not come and join us?More information about our current vacancies, and how to apply, can be found here."
        }
    ]
}