{
    "url": "https://naturalengland.blog.gov.uk/2025/01/30/saving-species-in-somerset-the-work-of-the-somerset-coast-levels-and-moors-nature-recovery-project/",
    "title": "Saving species in Somerset; the work of the Somerset, Coast Levels and Moors Nature Recovery Project",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environmental Improvement Plan",
        "Landscape",
        "Landscapes",
        "Monitoring",
        "National Nature Reserve",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Protected sites and species",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-01-30T08:00:00+00:00",
    "content": [
        {
            "text": "By Simon Phelps – Natural England"
        },
        {
            "text": "Over the past three years, the Somerset Coast, Levels and Moors Nature Recovery Project has been working hard to save some of our most threatened wetland species."
        },
        {
            "text": "I’m fortunate to not only be leading the project but also working in a landscape that I know and love. The landscape is special, its low-lying wetland nature, with peat soils and salt marsh, means it has retained many species which have been lost from the wider countryside."
        },
        {
            "text": "During this period, a partnership of ten organisations (including and led by Natural England) has carried out multiple projects, covering a range of themes: habitat restoration, working with landowners, climate change and green finance. Much of this work has focused on species, whether that be habitat restoration, population monitoring or distribution research. Three projects stand out for me.  "
        },
        {
            "text": "The first was delivered by the Hawk and Owl Trust on their Shapwick Moor Nature Reserve, which is part of the Somerset Wetlands National Nature Reserve. They created four new ‘scrapes’ on the site to diversify the range of wetland features. Due to the expertise of their survey volunteers, they discovered that these scrapes had been rapidly colonised by great crested newts and lesser silver diving beetles. These are two rare and threatened species which had never been recorded on the reserve before. This demonstrates that relatively small scale and simple actions can result in exciting and rapid responses by species."
        },
        {
            "text": "The second project was with the RSPB, this time focusing on breeding wading birds. Rare species, such as curlew, lapwing, snipe and redshank breed in the wet grassland habitats. However, due to their ground nesting habits, they are vulnerable to pressures such as hay cutting and predation. For many years the RSPB has been working with landowners to locate and protect the nests of these precious birds. This is difficult and time-consuming work. This is where the Nature Recovery Project comes into its own. Funding has enabled the RSPB to test whether drones fixed with thermal cameras can help locate and thereby protect their nests. This innovative research found that this method works and has led to more nests being protected.  "
        },
        {
            "text": "The third project switches from land to water and delves into the weird and wonderful world of the European eel. This remarkable creature breeds in the Sargasso Sea and migrates 4,000 miles to Europe, where it lives its adult life before returning again. Many end up in the rivers, streams and ditches of the Somerset coast, levels and moors landscape where it is valued part of its natural and cultural heritage. Our knowledge of this species is limited, so we funded the Wildfowl and Wetlands Trust to carry out a distribution survey. Using eDNA techniques, they were able to show that eels are found across the majority of the landscape but in some areas man-made barriers (such as pumping stations) could be interfering with their migration. We are now working with partners to further improve our knowledge of eels and help improve their survival."
        },
        {
            "text": "As you can see, we are doing some fantastic work for species through our Nature Recovery Project. This demonstrates what can be achieved when extra funding is made available to an energetic and committed partnership."
        },
        {
            "text": "But we know that there is a huge amount more to be done – not just here in Somerset but nationally too. Restoring healthy natural ecosystems is essential to support human life - the water we drink, the food we eat and the air we breathe. We know that helping nature to recover is a powerful tool with multiple benefits for improving people's health, generating wealth and building the country's resilience to climate change and for food security."
        },
        {
            "text": "So with each project we complete we are learning. We are working with our partners to develop new plans for some of the other threatened wetland species found in this unique landscape. We know what needs to be done to save species in this beautiful landscape, we just need the resources to do it."
        },
        {
            "text": "Get Involved"
        },
        {
            "text": "If we look after nature, then nature looks after us. So, if you’d like to get involved then here are a few things you can do. Just small actions can all help nature to recover and thrive."
        },
        {
            "text": "This article previously appeared in the January 2025 issue of Somerset Life"
        }
    ]
}