{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/11/02/celebrating-black-history-month-at-the-cma/",
    "title": "Celebrating Black History Month at the CMA",
    "authors": [
        "Erik Wilson"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2023-11-02T13:05:20+00:00",
    "content": [
        {
            "text": "Every October, the UK celebrates Black History Month. Although Black History Month has been celebrated every February in the USA since 1970, it was not officially celebrated in the UK until 1987 when it was organised by the activist, Akyaaba Addai-Sebo, who was the coordinator for special projects for the Greater London Council."
        },
        {
            "text": "The main aims of Black History Month are to celebrate the achievements and contributions of black people in the UK and worldwide, and to educate on black history."
        },
        {
            "text": "Celebrating Black History Month is just one of the ways that we as an organisation are always striving to create an inclusive culture in the workplace, in which every individual is valued and respected."
        },
        {
            "text": "Keep reading to find out about the various ways we've celebrated Black History Month, this year at the CMA."
        },
        {
            "text": "Across the organisation, colleagues have shared their experiences of being black and British through a series of internal blogs and events which also involved external guests."
        },
        {
            "text": "This included a panel event hosted by our Chair, Marcus Bokkerink, which explored Black British culture and heritage and how it intersects with the arts and media."
        },
        {
            "text": "In our London office, the Café served delicious African and Caribbean food throughout October."
        },
        {
            "text": "The first ever Black History Month in the UK was only celebrated in London, but over the years, the celebration has expanded across the whole of the UK. To mark the end of the month, our Edinburgh-based colleagues came together for a Black History Walking Tour, led by Lisa Williams of the Edinburgh Caribbean Association."
        },
        {
            "text": "On the tour, Lisa shared some fascinating but little-known stories of Edinburgh’s deep connections with Africa, Asia and the Caribbean from Tudor times to the present day. Cecilia Parker Aranha, Senior Director at the CMA, accounts the tour in more detail below:"
        }
    ]
}