{
    "url": "https://forestrycommission.blog.gov.uk/2023/11/02/funded-woodland-advice-available-through-the-pies-project/",
    "title": "Funded woodland advice available through the PIES project",
    "authors": [
        "Dr Gabriel Hemery"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-11-02T09:15:43+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is the PIES project?"
        },
        {
            "text": "PIES (Protect Improve Expand Sustain) is a government-funded project. It is providing a network of independent woodland experts to deliver high-quality free advice to landowners across England."
        },
        {
            "text": "The project aims to support landowners in bringing existing woodland back into management and to support woodland creation projects. Farmers and landowners taking part in the project receive free advice, including a site visit and customised report, plus ongoing online support and technical services."
        },
        {
            "text": "Launched last year, the PIES project has already approved more than 91 fully-funded advisory visits to landowners and farmers across England. Applications to access this support are now open thanks to further funding from the Forestry Commission."
        },
        {
            "text": "The PIES offer has been carefully pitched to support landowners as they take the first step in bringing existing woodlands into management, or as they consider creating new woodlands. Those who receive the free advisory visit are subsequently eligible to apply for further financial support, for example through the England Woodland Creation Offer (EWCO)."
        },
        {
            "heading": 2,
            "text": "The Free Advisory Visit"
        },
        {
            "text": "The free advice and site visit helps landowners to develop outline plans for existing woodlands, and plans and budgets for new tree planting. The first step for successful applicants is to choose who to work with, selected from a choice of three local expert providers offered by the Forest Canopy Foundation."
        },
        {
            "text": "The PIES expert providers have found the process rewarding as it has connected them with new clients and provided them with sufficient time to help them discover more detail about the aims and ambitions of their new clients."
        },
        {
            "text": "The PIES expert provider initially gathers information, maps and plans on behalf of the client, and then agrees the time and scope of a site advisory visit."
        },
        {
            "text": "Following the initial advice and visit, digital plans and maps will be shared with the landowner via a free account on the myForest platform run by Sylva Foundation. The platform provides ongoing support to the landowner, while simplifying the process of applying for government incentives and meeting regulatory requirements."
        },
        {
            "text": "Another valuable part of the PIES offer is the Grown in Britain Forest Certification which is offered free for one year, supporting eligible landowners in making the most of their woodland resource."
        },
        {
            "heading": 2,
            "text": "A Derbyshire Case Study"
        },
        {
            "text": "Landowner Phil knew that he wanted to plant some trees on his farm in Derbyshire. His initial idea was to buy some trees (he thought maybe 200) and involve local schools to help out with planting."
        },
        {
            "text": "He happened to attend an agricultural show while on holiday in Cornwall when he visited a Forestry Commission stand. With permission, his details were subsequently passed on to a local Woodland Officer in Derbyshire. After the Woodland Officer sent him comprehensive information he successfully applied for the PIES project to get further help."
        },
        {
            "text": "He was then paired with local private woodland agent Charles Robinson which proved to be just what he needed to help him get his project off the ground. With help from Charles, Phil then applied for the England Woodland Creation Offer (EWCO) with a nature recovery supplement."
        },
        {
            "text": "Phil says he was unlikely to have ever invested in receiving the advice which subsequently proved so helpful in progressing his plans. PIES support provided him with important early advice to highlight opportunities and has given him clarity on how his plans could work out financially. Phil is clear that without PIES funding, his 4ha woodland creation scheme would not be going ahead."
        },
        {
            "heading": 2,
            "text": "How to Apply for PIES support"
        },
        {
            "text": "Eligible landowners include those with existing woodland that do not have a current management plan in place, and/or any landowner interested in creating new woodland on their land. The offer is available only to landowners in England. The PIES online application process has been designed to be simple and straightforward."
        },
        {
            "text": "To find out more about the PIES project and apply visit: www.sylva.org.uk/pies."
        }
    ]
}