{
    "url": "https://teaching.blog.gov.uk/2023/11/02/joined-up-school-based-support-that-works-for-every-child/",
    "title": "Joined up, school-based support that works for every child",
    "authors": [
        "Kate Sandall"
    ],
    "categories": [
        "Alternative provision",
        "Inspiring teachers",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2023-11-02T14:31:53+00:00",
    "content": [
        {
            "text": "Kate Sandall is a Senior Child and Adolescent Mental Health Services (CAMHS) Practitioner in Manchester’s Pupil Referral Unit (PRU) Alternative Provision Specialist Taskforce (APST). APST is a DfE pilot involving teams of multi-disciplinary specialists being co-located on site, providing integrated, child-centred intervention and support within Alternative Provision (AP) schools."
        },
        {
            "text": "Kate explains her role in making sure children can meaningfully access mental health support, and the difference joined up working between health, education and care can make."
        },
        {
            "text": "Making support work for every child"
        },
        {
            "text": "Most children who attend an Alternative Provision (AP) school have experienced a number of significant life challenges, including exclusion from mainstream education. I am very passionate that these children have the right to access the help they need, within their childhood, to help them reach their full potential and to reduce the need for service involvement in later life. As services, we just need to work a little differently and more creatively to ensure that we provide this support in a way that works for these children."
        },
        {
            "text": "My role is incredibly varied - from carrying out initial mental health assessments and offering evidence based, therapeutic interventions, to supporting children to understand the practical changes that can be made to improve their mental wellbeing. Support is holistic, recognising and responding to the needs of family and wider support networks."
        },
        {
            "text": "Many of our children have had numerous services involved in trying to support them and their families throughout their lives, and they have not always been positive experiences. For example, many have previously been referred to mental health services but have not been able to engage with the standard model of support offered, and so have not attended appointments and subsequently been discharged."
        },
        {
            "text": "I work with children in a way that works for them, meeting at their chosen learning centre, out in the community, at home or at a CAMHS clinic local to them. I help them attend their session by whatever means necessary. For example, having a snack or their favourite drink prepared for them, which helps to build rapport and trust."
        },
        {
            "text": "Much of my work involves re-building trust between children, the school and other specialists in my team. For example, by developing a trusted relationship I recently supported a young person and helped her work with the Assistant Educational Psychologist in our taskforce on an ADHD assessment. At the same time, the family worker in our taskforce was able to work closely with the child’s family, making the support she received truly holistic. As a result of our combined support, this child has gone from not wanting to sit a single GCSE to wanting to do all of them, as well as meeting with a career advisor and visiting different colleges."
        },
        {
            "text": "Joined up working to reach the ‘missing children’"
        },
        {
            "text": "A key part of my role is providing mental health consultations, and as part of the APST taskforce, liaising with professionals to bridge the gap between Health Services and Education. Working in this way has allowed me and the team of specialists to support the ‘missing children’ in our communities, who are not offered the same opportunities as other children who attend mainstream education."
        },
        {
            "text": "For example, when a child new to the AP was thought to have significant SEND and mental health needs, our Speech and Language Therapist, Assistant Educational Psychologist and I were able to visit them and their family together to undertake a full cognitive assessment, that would otherwise have taken numerous visits and risk alienating them given their previous, challenging relationship with services. Although this was initially overwhelming for the family, our combined skills and expertise meant we were able to earn their trust and work with the child on attending school once again, with the necessary support in place."
        },
        {
            "text": "Seeing the difference we can make"
        },
        {
            "text": "The ability to undertake joint working with other services has made a significant difference to my work. Staff at the PRU say they feel supported and that CAMHS is much more accessible, and children are avoiding the waiting times they otherwise would have for support. This support is making a tangible difference to children’s wellbeing, their relationships, and the quality of their engagement in school."
        },
        {
            "text": "I will be forever grateful for the opportunities this role has provided me. I have developed my knowledge and understanding of supporting children in AP both professionally and personally."
        },
        {
            "text": "The Department for Education (DfE) have announced an extension to the programme within the SEND and AP Improvement Plan. Find out more"
        }
    ]
}