{
    "url": "https://educationhub.blog.gov.uk/2023/01/20/how-we-are-ensuring-young-people-have-access-to-great-music-education/",
    "title": "How we are ensuring young people have access to great music education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "music education",
        "Schools"
    ],
    "pub_date": "2023-01-20T12:21:24+00:00",
    "content": [
        {
            "text": "Learning about music and having the opportunity to play musical instruments and make music together is a vital part of a rich and rounded education."
        },
        {
            "text": "It has been proven that music plays a key role in brain development. This is because it helps with the nurturing of language, motor skills, emotional intelligence, and collaboration skills."
        },
        {
            "text": "We have published guidance setting out what the national plan for music education means for children and young people and how they can get involved in music both in and out of school."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What should music education look like in school? "
        },
        {
            "text": "Music is at the heart of a school and its wider community."
        },
        {
            "text": "It is part of the National Curriculum from the ages of 5 to 14, and should be taught in a carefully planned, sequenced way just like maths, English or science."
        },
        {
            "text": "A great music education in school would include:"
        },
        {
            "heading": 3,
            "text": "What is a music hub and how can young people get involved? "
        },
        {
            "text": "Music hubs provide music education opportunities in every part of the country. This includes working with teachers in the classroom to provide great music education and providing opportunities for pupils to learn and enjoy music outside of school."
        },
        {
            "text": "Music hubs work with around 9 in 10 state-funded schools in England. Since 2012, music hubs have increased the number of pupils supported through exams, whole class instrumental lessons, singing lessons and choirs."
        },
        {
            "text": "Music hubs have also been supporting an increasing number of pupils with SEND and those eligible for pupil premium with access to instrumental lessons and ensembles."
        },
        {
            "text": "Music hubs bring together schools, education charities and organisations, music services, community, and professional groups to make sure every child has the chance to explore music as far as their interest and talent will take them."
        },
        {
            "text": "You can find information about your local music hub at Music Education Hubs | Arts Council England"
        },
        {
            "text": "National Youth Music Organisations help to develop talented young musicians across a range of musical genres. They also provide support to music hubs and many further and higher education settings."
        },
        {
            "heading": 3,
            "text": "What financial support is available for young people?"
        },
        {
            "text": "There are several organisations that can help with providing support for costs, fees and access to music. More details on these organisations can be found in our guidance."
        },
        {
            "text": "This includes costs for musical instruments, lessons and rehearsal spaces and financial support to take part in activities with youth music organisations beyond school."
        },
        {
            "text": "Your local music hub can also provide financial support for activities."
        }
    ]
}