{
    "url": "https://deframedia.blog.gov.uk/2023/01/20/reporting-on-septic-tanks-in-cornwall/",
    "title": "Reporting on septic tanks in Cornwall",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-01-20T17:28:04+00:00",
    "content": [
        {
            "text": "There has been inaccurate coverage about issues of septic tank storage in Cornwall."
        },
        {
            "text": "It includes claims that the Environment Agency (EA) has changed the rules on firms being able to spread waste from septic tanks on land."
        },
        {
            "text": "This is not the case. It has always been the law (Sludge Use in Agriculture Regulations 1989) that only sludge – not other sewage – should be spread on land, and only with proper care. This is to protect the environment and stop chemicals being released onto land."
        },
        {
            "text": "EA discovered that a small number of operators in Cornwall (which store and manage the contents of septic tanks) were not abiding by these requirements. As a result, EA clarified the legislation so that all parties understood what they are required to do. There has been no change to the law."
        },
        {
            "text": "Since then, operators have been taking septic tank contents to South West Water (SWW) to store and treat, but due to recent wet weather SWW has limited capacity to accept further commercial waste."
        },
        {
            "text": "In order to ease the current pressures, the EA is issuing a new regulatory position statement to increase waste storage capacity for tankers. This means that tanks can temporarily store more sewage (up to 60 cubic metres) until SWW has capacity to take it. This will be published on Gov.uk shortly."
        },
        {
            "text": "EA has also been raising the longer-term issue of increased storage facilities with SWW. The company expects to have increased capacity for tankered waste by May 2023."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        }
    ]
}