{
    "url": "https://supportingfamilies.blog.gov.uk/2023/01/20/rotherham-local-authority-school-attendance-matters-pathway/",
    "title": "Rotherham Local Authority \"School Attendance Matters Pathway\"",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Evaluation",
        "Multidisciplinary Teams",
        "News",
        "Transformation"
    ],
    "pub_date": "2023-01-20T13:18:17+00:00",
    "content": [
        {
            "text": "Background"
        },
        {
            "text": "Prior to the launch of the Early Help Service in 2016, there was a standalone Education Welfare Service (EWS)."
        },
        {
            "text": "The EWS carried out enforcement using Fixed Penalty Notices (FPN) when leave of absences was taken during term time and further enforcement routes (such as School Attendance Orders, Education Supervision Orders or prosecution) were decided through the multi-agency Local Authority School Attendance Panel (LASAP)."
        },
        {
            "text": "A review of EWS and the processes for enforcement action highlighted a variety of issues with the working processes at that time, including the fact that requests for enforcement were being submitted without clear evidence that all strategies to support attendance and wider social and emotional wellbeing had been exhausted."
        },
        {
            "text": "The process, whilst well intended, was duplicative and often divisive, creating risks for children and families as it did not align with the Early Help Assessment and Team Around the Family mechanism or with existing support for children in statutory services. The pathway to enforcement lacked structure and did not reflect whole family working."
        },
        {
            "text": "Coming out of this review, a new approach was needed, and the partnership began the integration of the Education Welfare Service (amongst a variety of other Services) into a transformed Early Help Service."
        },
        {
            "text": "Development of the School Attendance Matters Pathway "
        },
        {
            "text": "Following the launch of the new Early Help Service in 2016, however, schools continued to request support when working with children with consistently poor attendance and it was identified that there needed to be a consistent approach to addressing the issue in partnership."
        },
        {
            "text": "The School Attendance Matters Pathway was led by Early Help and co-produced though dialogue and consultation with a number of headteachers across the borough. The pathway was launched at the start of the new academic year in September 2019, placing family welfare firmly at the centre and underpinned by exploring why the ‘symptom’ of poor attendance has occurred and addressing that prior to enforcement being explored."
        },
        {
            "text": "The Early Help Assessment is embedded throughout the pathway and is the underpinning tool for supporting children and families with a range of issues, including when children have poor attendance.  This ensures that adequate support and challenge is in place to enhance outcomes and support the things that families need help with, alongside enforcement action."
        },
        {
            "text": "The multi-agency attendance panel (LASAP) chaired by the Early Help Head of Service offers rigorous oversight of children with problematic attendance and makes decisions in respect of attendance enforcement.  The Code of Conduct was updated to reflect the pathway and a series of tools are provided to schools to assist with embedding the pathway."
        },
        {
            "text": "What difference has it made? "
        },
        {
            "text": "The majority of schools (both Academies and Maintained) make good use of the pathway and appreciate the structure and consistency that it brings, the feedback received so far to a recent survey has been highly positive."
        },
        {
            "text": "The approach for addressing poor school attendance and enforcement action with families is increasing in consistency across Rotherham regardless of which school a child attends. As schools completing the Early Help Assessment is integral to the pathway, issues that contribute to poor school attendance are better understood and support is provided to families as problems emerge."
        },
        {
            "text": "Through the Early Help Assessment and Planning process, multi-agency support for families is brokered much sooner in the development of a problem, ensuring that children and families receive the right support (and challenge) at the right time."
        },
        {
            "text": "What impact has it made?"
        },
        {
            "text": "Benefits include bespoke packages agreed for children where there are complex family issues. Completion of EHAs has gone from 0% in 2016 to 29% EHA completion by partners (2021/22), similarly between Sept 2017-July 2019 282 EHA’s were led by schools; in comparison Sept 2019 - Oct 2022 (following the SAMP launch) 914 EHA’s have been led by schools collection is rigorous with a monthly scorecard enabling strategic oversight of the pathway."
        },
        {
            "text": "‘In contrast to the national trend of increasing levels of persistent absenteeism, the School Attendance Matters Pathway has enabled Rotherham to freeze persistent absenteeism rates’"
        },
        {
            "text": "Next steps "
        },
        {
            "text": "A survey was used and sent to all schools to capture their views on the School Attendance Matters Pathway.  The feedback provided by the schools then informed a more recent iteration of pathway documents and this has also been informed by Working together to improve school attendance (2022)."
        },
        {
            "text": "Rotherham is well-placed to respond to and deliver on new expectations of Local Authority Attendance Services and is working alongside headteachers and the DFE to ensure that this is applied consistently and that the right resource is in place as this work progresses."
        },
        {
            "text": "A film aimed at parents that seeks to embed consistent messages about the importance of good school attendance is in the edit stage. This has been supported by school and local authority colleagues as well as the DfE."
        },
        {
            "text": "Strong relationships with colleagues from Children’s Social Care and Inclusion are helping the Early Help service to further embed the notion that attendance is everybody’s business and to ensure that children’s attendance is a priority across the directorate and partners."
        }
    ]
}