{
    "url": "https://dragonsden.blog.gov.uk/2022/02/03/dragons-den-episode-5-series-19/",
    "title": "Dragons' Den, Episode 5, Series 19",
    "authors": [
        "Debbie Evans",
        "Emma Richards"
    ],
    "categories": [
        "Business",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-02-03T21:03:33+00:00",
    "content": [
        {
            "text": "I’m sure that all of you who have been partaking in dry January are relieved that it is finally over, and February is upon us. As you break your dry spell you may want to kick off the weekend with a fresh, new flavoured drink?"
        },
        {
            "heading": 3,
            "text": "A fresh take"
        },
        {
            "text": "Cue entrepreneurs Nick Johnson and Nick Graham with their fruit-flavoured hard seltzer brand, Berczy. Enjoying the refreshing flavours, this was clearly a firm favourite among the Dragons initially, yet despite the merriness of the pitch, they weren’t convinced and opted out. In fact, only two of the pitches during tonight’s episode were successful in securing investment from the Dragons."
        },
        {
            "heading": 3,
            "text": "Shiver me timbers"
        },
        {
            "text": "The first success in the Den was the Timescape brand offering unique-themed escape rooms."
        },
        {
            "text": "Peter Jones and Sara Davies couldn’t wait to get stuck in to the interactive, pirate-themed game which grasped the interest of the Den. Brothers Chris and Mike delivered a convincing pitch but questions were asked about the franchise model."
        },
        {
            "text": "Following a quick search on our on-line search facility I can quickly identify that the Timescape adventures trade mark has been registered with the IPO since September 2021. The search facility is a user-friendly and useful, free service that can be found on the IPO's website."
        },
        {
            "text": "Some of the Dragons were concerned that the concept of the business could be copied and re-branded.  This is a valid concern as a business concept or idea cannot be protected by IP.  You can protect elements within a business such the brand, products or website but the overall concept can still be copied."
        },
        {
            "text": "Despite their concerns, Peter and Sara each invested 100k for a 25% share. With their help I’m sure that the brand will become well recognised, so protecting it with a trade mark at an early stage was a brilliant strategy."
        },
        {
            "heading": 3,
            "text": "Bouncing patents"
        },
        {
            "text": "As already mentioned, you cannot protect a concept or an idea. If you develop your idea into a tangible product, however, you can protect that product with a patent."
        },
        {
            "text": "This was clearly demonstrated with the next entry into the Den, the Oddball. This was presented by friends Pasquale Pio Totaro & Nathan Webb who had cleverly created a music-making bouncing ball.  The technology behind this is unique and they have been able to patent it in two countries, which they confirmed when questioned by Touker."
        },
        {
            "text": "This product was particularly interesting to me, as I recall, in the not too distant past, attending many musical groups with my children.  I can envisage how much they would have enjoyed playing with these items."
        },
        {
            "text": "I also considered how visually impaired individuals would enjoy this product for sensory stimulation. With a patent in place, this product could easily be licenced to existing companies for such versatile uses."
        },
        {
            "text": "The duo was looking for 100k investment for 4% share of the business. After discussions, they decided to decline Deborah Meaden and Touker Suleymans’ offers for a higher percentage of their business and left with nothing."
        },
        {
            "heading": 3,
            "text": "A smiley turnover"
        },
        {
            "text": "A very smiley Natalie Quail entered the Den with her at-home teeth-whitening products, SmileTime Teeth.  All the Dragons warmed to her personality, including Peter Jones when she complimented him on his lovely smile."
        },
        {
            "text": "Natalie was looking for 50k for a 2% share. Peter questioned the ownership of the domain name which Natalie admitted to not owning. This raised a few eyebrows in the Den. Natalie has been savvy enough to trade mark her brand, however, which will make it easier for her to defend it against competitors and copycats."
        },
        {
            "text": "Touker quizzed Natalie on revenue and was surprised how profitable it was. Natalie made over £1 million last year alone, which impressed the Dragons. Dragons Deborah, Peter and Sara decided to opt out as they felt couldn’t add value for Natalie."
        },
        {
            "text": "This left Steven & Touker who offered 50K for 20%. This was more than Steven originally asked for, but Natalie seemed more than happy to have the two Dragons on board. With Touker’s experience in dental cosmetics and Steven in mobile applications, Natalie was happy to have them both on board."
        },
        {
            "text": "Many of the products in the Den caught my attention in this episode. I mean, the combination of a boozy escape room with bouncing music balls and cheesy snacks thrown in would put a glowing smile on anyone’s face. That sounds like my kind of evening!"
        }
    ]
}