{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/02/03/four-things-ive-learnt-as-a-policy-designer/",
    "title": "Four things I’ve learnt as a Policy Designer",
    "authors": [
        "Matt Nicol"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2022-02-03T12:00:11+00:00",
    "content": [
        {
            "text": "I’ve been a Policy Designer in the Department for Education’s User-Centred Policy Design (UCPD) team for the last 18 months. During this time, I’ve worked on a number of knotty policy problems - from how to best utilise EdTech in classrooms, to reducing levels of school absence throughout Covid.  "
        },
        {
            "text": "Working in a government design lab for the first time has been a great challenge and a steep learning curve. As I transition into a new role, I’ve spent some time reflecting on my experiences, pulling out four main lessons. "
        },
        {
            "heading": 2,
            "text": "Build on traditional policymaking"
        },
        {
            "text": "We can talk about ‘User-Centred Policy Design’ like it’s a silver bullet, totally distinct from more ‘traditional’ policymaking. In reality, policymaking has always involved the user; teams engage stakeholder groups, canvas opinion of the sector and look at the data that’s available to make decisions. "
        },
        {
            "text": "Of course, UCPD has a lot to offer on top of this. We need to clearly express how this extra value complements existing policymaking. For me, it’s about enabling policy teams to dig deeper into a problem and collaborating with users to reimagine the future.  "
        },
        {
            "heading": 2,
            "text": "Find the right challenge"
        },
        {
            "text": "Whilst research is integral to our work, UCPD offers much more as part of a broader design process. However, colleagues sometimes refer to us as the ‘user research team’ and approach us to help them figure out what’s happening on the ground, rather than with a well-refined design brief."
        },
        {
            "text": "This presents a challenge for UCPD teams aiming to create and test new policy ideas in a short space of time. In its purest form, our work should move beyond Discovery research into policy innovation and experimentation - but it can be difficult to do this in policy contexts where there’s a strong desire for research and less appetite for design. Investing time to find projects which are a good fit for UCPD is therefore critical.  "
        },
        {
            "heading": 2,
            "text": "Empathise with policy colleagues "
        },
        {
            "text": "As a team, we spend lots of time unearthing why users behave in a particular way, putting ourselves in their shoes and building empathy. UCPD projects should apply this way of thinking not only to our users, but to our policy colleagues too. "
        },
        {
            "text": "Working in policy is hard. Time, resource and the scope to innovate can be massively constrained and decision making often involves a heavy dose of compromise. This has all been exacerbated by Covid-19.  "
        },
        {
            "text": "Understanding these pressures and finding middle ground is essential to delivering policy design projects. We have the headspace and specialist skills to grapple with complexity and think big - both luxuries in government. But, on the flipside, we need to meet colleagues in the middle, understand the pressures they are under and be willing to compromise when they bring constraints to the table.    "
        },
        {
            "heading": 2,
            "text": "Celebrate the small victories"
        },
        {
            "text": "Compromise is a constant theme of my time in UCPD. Even when policy teams have real desire to be ‘user-led’, often the uncertainty, complexity and messiness of policymaking makes it hard to get stuff done, watering down your ability to change things. "
        },
        {
            "text": "With this in mind, I’ve learnt to celebrate every triumph for my team. Influencing the thinking of a senior stakeholder in a ‘user-centred’ direction, or building a stronger evidence base that steers the department away from a decision are both victories for UCPD.  "
        },
        {
            "text": "Constraints in a policy area may mean it’s not possible to rewrite the rulebook, we can still meaningfully contribute to a discussion and champion the user; a good if not perfect outcome. "
        },
        {
            "text": "I’d be interested to hear about how this chimes with the experience of others - leave a comment below. "
        }
    ]
}