{
    "url": "https://educationhub.blog.gov.uk/2022/02/how-we-plan-to-support-families-who-choose-home-education-through-registers-of-children-not-in-school/",
    "title": "How we plan to support families who choose home education through registers of children not in school",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Families",
        "Uncategorized"
    ],
    "pub_date": "2022-02-03T16:40:04+00:00",
    "content": [
        {
            "text": "There are a wide range of reasons why some families might prefer to home educate children. In the vast majority of cases home educating parents do an excellent job and that’s why we want to support families who want to make that choice."
        },
        {
            "text": "But, at the same time, it’s really important that home education doesn’t result in children dropping off the radar and becoming vulnerable to poor standards of education or risks to their safety and wellbeing."
        },
        {
            "text": "That’s why we have announced plans to go ahead with the creation of local authority administered registers for children not in school to allow us to support local authorities to make sure they know where every child is being educated, that it is of the right quality, and that support is offered to home educating families."
        },
        {
            "text": "Here we answer your questions:"
        },
        {
            "heading": 3,
            "text": "How will the registers work?"
        },
        {
            "text": "We plan to start the process to set up the registers at the earliest legislative opportunity – that means as soon as we are able to put the legislation necessary to set the registers up before parliament. At that point we will set out the details of what we’re proposing and MPs will be able to vote on it."
        },
        {
            "text": "But the aim is for the registers to be a comprehensive record of where every child is being educated in a local area, which at the moment doesn’t exist consistently. Having that will allow local authorities to know where home education is happening and check that families have the support they need."
        },
        {
            "heading": 3,
            "text": "Why are you bringing this in now? "
        },
        {
            "text": "Over the last several years there has been a rise in elective home education, but this has escalated further since the beginning of the pandemic. In some circumstances families who had never thought about home schooling found that it suited them when they did it while schools were closed to most pupils."
        },
        {
            "text": "The register of children not in school is something we’ve been planning for a while but this rise has increased the need for it."
        },
        {
            "heading": 3,
            "text": "How can you support home education when you’ve said that you believe school is the best place for pupils during the pandemic?"
        },
        {
            "text": "There is a difference between choosing to home educate your children because it suits your family and having to home educate children because schools were closed to most pupils. In those circumstances where families have chosen home education because they feel it’s the best option for them and they are doing a good job we want to be able to support them to continue doing that."
        },
        {
            "heading": 3,
            "text": "When will the registers come into effect? "
        },
        {
            "text": "As soon as we can set this up we will. The legislation will go in front of parliament as soon as we are able to do so and from there it will need to travel through parliament, with MPs and Lords voting on it in the usual fashion. As soon as that is complete and we have approval from Parliament we will set up the registers."
        },
        {
            "heading": 3,
            "text": "When will you tell us more? "
        },
        {
            "text": "When we put the legislation in front of Parliament we will publish our proposals in full."
        }
    ]
}