{
    "url": "https://educationhub.blog.gov.uk/2022/02/how-rebuilding-schools-and-colleges-around-the-country-will-help-level-up-education-for-all/",
    "title": "How rebuilding schools and colleges around the country will help level up education for all",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-02-03T00:01:22+00:00",
    "content": [
        {
            "text": "We want all young people to learn in modern, fit for purpose buildings, regardless of their background or where they’re from. Some of the schools in our estate don’t meet the standards pupils and families should expect, and the school rebuilding programme aims to replace those buildings with new facilities."
        },
        {
            "text": "Here’s what you need to know:"
        },
        {
            "heading": 3,
            "text": "What is the School Rebuilding Programme?"
        },
        {
            "text": "The School Rebuilding Programme carries out major rebuilding and refurbishment projects at schools and sixth form colleges across England. Projects are prioritised according to the condition of buildings i.e. how poor the fabric and structure of the buildings is."
        },
        {
            "text": "All buildings in the School Rebuilding Programme are built to the latest construction standards, designed to be net-zero in operation and more resilient to the effects of climate change.  New buildings will provide modern facilities to support a world-class education ranging from classrooms and science labs, to sports halls and dining rooms."
        },
        {
            "text": "Over the course of this decade 500 schools will benefit from the programme. There are currently 100 projects in the programme. We announced the first 50 schools in the programme in February 2021 and the second set of 50 schools in July 2021."
        },
        {
            "heading": 3,
            "text": "So what’s new?"
        },
        {
            "text": "This week we ramped up the programme with applications invited for up to 300 of the programme’s 500 total projects this decade. We recently ran a public consultation on how we should decide which schools are in the worst condition and have developed the application process from that. Selection 300 schools in one go will give schools and families greater certainty that they have been prioritised for future investment."
        },
        {
            "text": "We’ve also slightly changed the process so that those who are applying, such as academy trusts or local councils, can upload extra evidence of their buildings’ condition. This will help ensure the process makes use of local knowledge when prioritising applications."
        },
        {
            "heading": 3,
            "text": "How soon will the new buildings be opening?"
        },
        {
            "text": "This will vary. Obviously some projects take longer than others and there are a large number of other variables that will affect the time it takes for them to open. Communities are always involved in the planning and design of the building"
        },
        {
            "text": "Not all of the 300 projects selected this year will go straight to being built, 50 will go to delivery each year."
        }
    ]
}