{
    "url": "https://educationhub.blog.gov.uk/2022/02/how-we-are-tackling-behaviour-in-schools-to-help-maintain-calm-classrooms/",
    "title": "How we are tackling behaviour in schools to help maintain calm classrooms ",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-02-03T00:01:48+00:00",
    "content": [
        {
            "text": "Every child should have the opportunity to learn in a calm, orderly, safe and supportive environment where their education won’t be disrupted by misbehaviour."
        },
        {
            "text": "While most students are well-behaved, we know it can be a cause of stress for teachers and can have a lasting impact on the outcomes of the pupils if there are ongoing behaviour issues."
        },
        {
            "text": "That’s why, as we level up education to ensure all pupils benefit from the same high standards, there is a need for schools to have clear behaviour policies that promote positive behaviour in and out of the classroom."
        },
        {
            "text": "Here we explain what we’re doing to improve and maintain behaviour in schools to help ensure every child has the opportunity to succeed in school and beyond."
        },
        {
            "heading": 3,
            "text": "Every school should be a calm and respectful environment, where all pupils and staff feel safe, and where both pupils and staff can thrive, and reach their potential. "
        },
        {
            "text": "We’re producing new guidance that will provide practical advice to schools about how to encourage good behaviour, respond effectively to incidents of misbehaviour both in and out of the classroom, and will support staff in tackling behavioural issues."
        },
        {
            "text": "The aim is that all schools will be supported to develop positive cultures of good behaviour, support and wellbeing."
        },
        {
            "text": "So we’re speaking to headteachers and teachers about what they know works and what doesn’t so we can help schools all over the country to share best practice."
        },
        {
            "heading": 3,
            "text": "A separate revised guidance will also be published to help headteachers with crucial decisions on exclusions. "
        },
        {
            "text": "Along with the updated behaviour advice, updates have been made to the school exclusion guidance to support headteachers with decisions about exclusions, making sure they are used in a proportionate and fair way."
        },
        {
            "heading": 3,
            "text": "We are also looking to help schools manage behaviour online"
        },
        {
            "text": "We are asking headteachers for their views on how we can help provide clearer support on responding to behaviour incidents online."
        }
    ]
}