{
    "url": "https://environmentagency.blog.gov.uk/2022/02/03/in-2021-the-environment-agency-outlined-how-it-would-reach-net-zero-by-2030-here-sustainable-business-manager-simon-dawes-looks-back-at-the-challenges-and-achievements-and-anticipates-wha/",
    "title": "A year in review – where are we on net zero?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2022-02-03T14:02:05+00:00",
    "content": [
        {
            "text": "In 2021, the Environment Agency outlined how it would reach net zero by 2030. Here, Sustainable Business Manager Simon Dawes looks back at the challenges and achievements – and anticipates what’s yet to come in 2022."
        },
        {
            "text": "So 2021 has passed and we are well into 2022 – only 8 years to go until the deadline we’ve set ourselves to reach net zero. Every day I think, ‘how long do we have left to achieve net zero and avert the worst of a climate crisis?’"
        },
        {
            "text": "It’s easy to get blinded by how much there is to do, which is why it is good to look back and remind ourselves of how much we have done.  So what did we do and achieve in 2021 in pursuit of our ambitious net zero goal?"
        },
        {
            "text": "We started off well by agreeing our net zero roadmap – 92 actions owned by the heads of business that are responsible for those emissions, signed off at executive level.  Not only that but we agreed and implemented a mechanism to track them and report them to our board."
        },
        {
            "text": "We’re making good progress – we’re well on track with about half of them (there are 8 years to go), we need to accelerate our pace a little on some, and need a determined focus on the others – about what you would expect from an ambitious cross-organisational, long-term plan."
        },
        {
            "text": "Then we shared our plans with the public and other bodies in the hope that it would encourage, inspire, and inform them.  Throughout the year we have received great feedback and calls for help to enable other organisations to learn from us and accelerate their journeys.  And finally, it turns out other people have noticed what we’re doing, as we have been short listed for Net Zero Strategy of the Year 2022 by Edie.net, a hub for all things sustainability – which is a ringing endorsement."
        },
        {
            "text": "We quickly started delivering tangible actions, too, to cut our emissions.  We took delivery of electric vans in a first wave of fleet electrification by 2025.  We were the first public sector body to sign up the Plant Charter at the Supply Chain Sustainability School – setting out 5 clear pledges, namely; minimum standards in procurement, engagement, awareness raising & education, measurement & reporting, and innovation.  So our fleet colleagues were off to a great start by accelerating the pace of what they had already done to date on our low CO2 fleet."
        },
        {
            "text": "We also saw a big step in reducing emissions from our construction work.  After a huge piece of collaboration with engineers, innovators and commercial teams, we changed the minimum technical requirements for our concrete use to make low carbon concrete our default choice.  With construction making up 54% of our total emissions – and concrete being over 60% of that – this focus is critical for us.  We also took a step closer to integrating cost and carbon with the roll out of our cost and carbon tool for construction.  This will enable our teams to think about the carbon costs as well as the financial costs of their projects’ design and build."
        },
        {
            "text": "Other significant initiatives include the net zero commitment from the EA pension fund; flood defence schemes, such as at Hythe, that delivered innovation on site via 3D printed elements (to cut down resources and waste), and using low carbon concrete and the use of electric hand tools to replace petrol driven ones.  We also began the work in earnest on developing the offset element of our strategy – working out how to absorb our residual emissions and what the best way of doing that is."
        },
        {
            "text": "Finally to underpin all this we launched a comprehensive carbon literacy package for our 11,000 staff.  This will enable our people to understand climate change, how it will impact them and their job and how they can make a difference, both individually and at work.  We’re aiming to become the first government body to be externally accredited by the Carbon Literacy Trust as carbon literate – and in the first 2 months, the training has been downloaded by over 2000 people."
        },
        {
            "text": "So on reflection it has been a fantastic year of work with a massive team effort right across our organisation.  But what do we anticipate for 2022?"
        },
        {
            "text": "I am looking forward to more and more of our people being certified as carbon literate, including our whole executive leadership team."
        },
        {
            "text": "And the challenge of delivering an offset strategy that is authentic and nature-based is a huge one, but one we will rise to with aplomb.  As well as tackling our net zero challenge this will also go towards helping tackle the nature crisis we are experiencing too."
        },
        {
            "text": "I am excited about the development of a carbon dashboard that will show total carbon emissions down to team level.  We have some ground-breaking pilots being trialled in our Flood Risk business looking at how we do carbon budgeting across programmes.  And finally, I am really looking forward to starting work in earnest on the link between carbon and resource consumption; how can we start to consume less resources and move from take, make, throw away to a more circular model – from our clothing, to our plant, to our flood scheme? It’s an exciting challenge."
        },
        {
            "text": "All of these things need to be underpinned by two things – input from our brilliant (carbon literate) people and collaboration with our supply chain and other organisations.  Together we will move the game on again in 2022 and get closer to our 2030 goals."
        },
        {
            "text": " Follow the Environment Agency on Twitter."
        },
        {
            "text": " "
        }
    ]
}