{
    "url": "https://defradigital.blog.gov.uk/2022/02/03/its-good-to-talk-really-it-is/",
    "title": "It’s good to talk – really, it is",
    "authors": [
        "Kay Finn"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Smarter working"
    ],
    "pub_date": "2022-02-03T07:58:03+00:00",
    "content": [
        {
            "text": "A large proportion of our people have not been to an office in nearly two years. That’s had a different effect on different people in our teams. During this period, we have tried various ways to support our mental health at work, such as protecting our lunch break with a ‘Meeting Free Zone’, monthly ‘Air and Share’ calls, and virtual ‘Coffee Roulette’ meetings to help colleagues keep in touch and take a break. Colleagues tell us that, individually and collectively, these activities are making a difference and having a positive impact."
        },
        {
            "heading": 2,
            "text": "A conversation for everyone"
        },
        {
            "text": "Time to Talk Day is the nation’s biggest mental health conversation. It’s the day that friends, families, communities, and workplaces come together to talk, listen, and change lives."
        },
        {
            "text": "The phrase ‘It’s good to talk’ might be a bit cliched, but research shows that conversations about mental health have the power to change lives, and it shows how important open conversations in communities are to supporting everyone’s mental wellbeing. I really like a quote I read which says, ‘a small conversation about mental health has the power to make a big difference’."
        },
        {
            "text": "In our area of Defra, we have a Safety, Health and Wellbeing Community of Practice who act as champions in these areas. They offer our people a trusted ‘go-to’ person who can signpost support and cascade information. They’re also our eyes and ears on the ground (and even making that work virtually!) highlighting what might be affecting people’s safety, health, and wellbeing in teams. They’re an invaluable source of insight and we often come up with great ideas that can really make a positive impact to our working day."
        },
        {
            "text": "We also give our people a voice in our monthly Pulse Surveys on wellbeing and engagement, so we can hear how people are feeling and check where they might need more help or support. The feedback we get often helps us start a conversation in teams about something we may not otherwise have uncovered. It’s so valuable for dispersed teams working remotely to find ways to be open and honest when times are tough."
        },
        {
            "heading": 2,
            "text": "Being honest with yourself"
        },
        {
            "text": "For me, working in a dispersed team wasn’t new when the lockdowns landed, but working from home every day certainly was. I got used to it quickly and found a new routine with a balance of breaks in the day and plenty of virtual opportunities to keep in touch with colleagues. I felt safe at home and in no hurry to return to the office."
        },
        {
            "text": "So, it surprised me when I did go back to my local office how much I’d really missed people. I’d become almost afraid to go back, but when I was honest with myself, I knew I needed that physical connection with people I worked with again. I was aware I had felt lonely, but somehow had grown accustomed to it."
        },
        {
            "text": "Talking and being open with my team, and my manager, has definitely helped me manage my own mental health. I feel grateful for the support we show each other, and the ethos of my place of work where our senior leaders set an example and manage their own work-life balance in such a way that helps them look after their wellbeing at work."
        },
        {
            "heading": 2,
            "text": "Don’t be afraid to ask"
        },
        {
            "text": "There are lots of ways to check in on people. ‘Ask Twice’ is a technique that I’ve found to be effective in encouraging colleagues to open up and talk about how they’re feeling. So often we say, “Yeah, I’m fine” when we know we’re not. In the right moment, you can ask if someone is really ok, and it may mean the world to them that you took the time to listen."
        },
        {
            "text": "A colleague once noticed that I’d been quieter than usual in team meetings and not turning on my video. One day they dropped me a message to ask if I was genuinely ok. I’d been putting on a brave face at work and it helped to have a chat about the problems I was having. Often, you’re not alone and it helps to know others might be feeling the same. Sharing a problem can take a huge weight off your shoulders, and a small act of kindness towards someone else can do wonders for your own mental health."
        },
        {
            "text": "Want to know more?\nCheck out some of the tips for starting your conversation about mental health.\nDownload the Talking Tips poster.\nGet involved with #TimeToTalk Day"
        }
    ]
}