{
    "url": "https://space.blog.gov.uk/2022/02/03/the-night-sky-in-february-2/",
    "title": "The night sky in February",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-02-03T15:19:02+00:00",
    "content": [
        {
            "text": "Our February night skies host some of the most distinctive and spectacular constellations, so wrap up warm and make the most of any clear nights that come around!"
        },
        {
            "text": "Look directly overhead as darkness falls to see the distinctive shape of the winter constellations of Cassiopeia and Andromeda.  It’s still a great time to look for the faint smudge of light of the Andromeda Galaxy.  You’ll need to get away from light polluted skies to see it, but catch it and you’re looking at the collective light from a trillion stars that has been travelling across space for over 2 million years before it’s reached your eyes!"
        },
        {
            "text": "By the end of the month, these constellations quickly give way to Perseus and Auriga.  Perseus often goes unnoticed because it doesn’t have stars as bright as the constellations around it.  Perseus’ brightest star ‘Mirfak’ is only the 35th brightest in our night sky, though that’s mostly due to its distance, being over 500 light years away - it has actually expanded to be more than 60 times the size of our Sun, and is more than 5,000 times as bright!"
        },
        {
            "text": "In artwork the constellation of Perseus is sometimes pictured holding the head of mythological snake-haired Gorgon Medusa.  Representing the head is the fascinating star ‘Algol’, known as the ‘demon star’ for centuries because this reddish star appears to ‘blink’ over time.  Its brightness changes regularly - every 2 days and 20 minutes the star dims noticeably for 10 hours at a time, an effect that can be observed with the naked eye, but more easily seen with binoculars or a telescope."
        },
        {
            "text": "Modern astronomy has enabled us to see that the point of light we see as the star ‘Algol’ is actually a solar system of three stars (scientists are studying the possibility that there could actually be five), and the dimming is due to a large, less bright star passing between us and Algol, reducing the amount of light that reaches us."
        },
        {
            "text": "The Algol solar system is currently around 90 light years away from us, but interestingly, scientists tracking its path around our galaxy have found that the Algol system passed less than 10 light years from our Sun around seven million years ago, with Algol most likely being the brightest star in our skies at the time."
        },
        {
            "text": "The collective mass of this other solar system passing so close to our own would have had a gravitational effect on the swathes of ice and rock at the outer edges of our solar system (known as the Oort Cloud), causing them to travel into the inner solar system as comets."
        },
        {
            "text": "The constellation of Auriga hosts bright star Capella, actually a solar system of four stars, around 40 light years away.  Two of the stars, both around 10 times larger than our star, orbit each other at about the same distance as Venus orbits our Sun."
        },
        {
            "text": "For anyone under darker skies (those less affected by ground light), you’ll see that the beautiful band of our Milky Way galaxy runs through these constellations, making them a spectacular sight.  It appears to glow faintly with the sheer number of faint stars and the numerous star clusters that lie within it."
        },
        {
            "text": "If you have binoculars or a small telescope, spend some time touring these constellations and you’ll find some wonderful clusters of stars, such as the ‘Double Cluster’ (or NGC 884 and 869), which lies on the border between Perseus and Cassiopeia, and several star clusters in Auriga (messier 36, 37 and 38)."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Moon and planets"
        },
        {
            "text": "Jupiter is visible briefly in the south-west after Sunset early in the month, but quickly gets lost in the glare of the Sun as the month progresses, as the orbits of Jupiter and Earth take them to opposite sides of the Sun."
        },
        {
            "text": "Mars and brightest planet Venus appear in the morning skies now, an hour or so before Sunrise, and by the last week of the month they are joined by Saturn and Mercury."
        },
        {
            "text": "The month starts with a new Moon, with the full Moon appearing in the constellation of Leo on 16 February.  If the weather allows, get an early start on the last two mornings of the month to see a tiny slice of Moon, less than 10% illuminated, join the remarkable cluster of planets.  There are also some very bright passes of the International Space Station before Sunrise on these days – visit https://www.heavens-above.com/ to find the exact timings for your location."
        },
        {
            "heading": 3,
            "text": "Earthshine"
        },
        {
            "text": "Have you ever seen the crescent Moon soon after Sunset, or before Sunrise, and noticed that you can faintly see all of the Moon’s disk, even though only part of it is illuminated?  This effect is called ‘Earthshine’, and it’s caused by the Sun’s light bouncing off our planet, and reflecting onto the Moon."
        },
        {
            "text": "From the surface of the Moon looking back at Earth, our planet would appear to have phases, just as the Moon does in our sky.  Because of the positions of the Sun, the Earth and the Moon at the point where we see a crescent Moon in our skies, Earth would appear as a nearly ‘full’ Earth if you were on the Moon.  This means that more light is reflected onto the Moon, creating Earthshine."
        },
        {
            "text": "Wishing you clear skies!"
        }
    ]
}