{
    "url": "https://defrafarming.blog.gov.uk/2021/03/25/the-future-farming-resilience-fund-supporting-farmers-through-transition/",
    "title": "The Future Farming Resilience Fund: supporting farmers through transition",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2021-03-25T15:26:27+00:00",
    "content": [
        {
            "text": "The way that farming is funded is changing and we want to support farmers and land managers through this transition."
        },
        {
            "text": "One of the ways in which we are doing this is through the Future Farming Resilience Fund (FFRF). "
        },
        {
            "text": "The fund awards grants to organisations so that they can support farmers and land managers who are in receipt of Basic Payment Scheme (BPS) payments. "
        },
        {
            "text": "Today, (25 March) we’re inviting organisations to apply for funding."
        },
        {
            "text": "This new phase will provide up to £9 million funding to organisations who will, in turn, support up to 9,000 farmers and land managers."
        },
        {
            "text": "Resilience support should help individual farmers and land managers to learn more about:"
        },
        {
            "text": "We want farmers and land managers to feel supported to make the best decisions for their farms, families and future."
        },
        {
            "text": "The support will be offered free of charge to farmers and land managers by organisations known and trusted in the farming community. It could be delivered in the form of workshops supported by experts or through direct, one-to-one advice. "
        },
        {
            "text": "We’ve had to revise the timetable for the roll-out of the fund given the timing of the launch of this tender exercise. We now expect that the support to farmers and land managers will be available from late July/ August rather than May. More information on the application and evaluation process can be found on GOV.UK."
        },
        {
            "text": "The deadline for submitting applications is 7 May."
        },
        {
            "text": "The successful grant applicants will be announced in July and support will be scaled up from April 2022.  [UPDATE: We previously said that we would run the scale-up phase from April 2022, but we are now looking at a revised go-live date and will let you know when further information is available.]"
        },
        {
            "text": "Apply for a Future Farming Resilience Fund grant "
        },
        {
            "text": "We will keep you updated on the blog as we move forward, including a post about local providers once the grants have been awarded in July."
        },
        {
            "text": "Do subscribe to Future Farming and sign up to Defra’s e-alerts  if you haven't already."
        }
    ]
}