{
    "url": "https://dfedigital.blog.gov.uk/2024/08/27/cyber-escape-room/",
    "title": "Cyber escape room  ",
    "authors": [
        "Ben MacInnes"
    ],
    "categories": [
        "culture",
        "Security"
    ],
    "pub_date": "2024-08-27T11:47:09+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What the escape room was like"
        },
        {
            "text": "As part of the Vulnerable Children and Families portfolio away day, I took part in the Cyber Security Awareness team’s escape room. This was a chance to look at cybersecurity in a different and more interactive way."
        },
        {
            "text": "Anyone who has done an escape room before will know exactly what to expect. As you walk into the room you see a series of seemingly unconnected objects. And I can’t tell you much more than that – what happens in the escape room, stays in the escape room. I can say our job was to find and solve the puzzles hidden in the room to escape!"
        },
        {
            "heading": 2,
            "text": "What I gained from doing the escape room"
        },
        {
            "text": "Cybersecurity is something I had engaged with at a basic level. The only real interaction with the subject has been mandatory training and flagging phishing emails. This escape room changed that - it made you think about cybersecurity beyond the mandatory. To start thinking how can I use this to solve a problem and what does it mean in a wider context?"
        },
        {
            "text": "As part of the room, you solve puzzles that contain little lessons in cybersecurity. You do this as a team which means you have a conversation about cybersecurity with your peers. This is something I can safely say I have not done until I stepped into that room. The great part is that when you finish (if you make it out) you keep talking about it. This is much improved by having an expert in the room who wants to answer your questions. They will even tell you about how many people they caught trying to get a free Starbucks gift card!"
        },
        {
            "heading": 2,
            "text": "What I'm doing now"
        },
        {
            "text": "While I can’t pretend the escape room has made me a cyber specialist, it has sparked my interest. Without giving away too much, it made me think about the passwords that I use at work and in my personal life. I’m also going to think more about the items I take for granted in the office."
        },
        {
            "heading": 2,
            "text": "How I found the whole experience"
        },
        {
            "text": "I am so happy I got the chance to take part in the escape room. It was the best cybersecurity training I have ever taken part in. I wish more parts of DfE and the Civil Service took this approach to training and engagement. I would encourage everyone to take part in the escape room. If you run any sort of training or business as usual process, I would encourage you to use this model. It's a great way to boost engagement and to get the material across in a really captivating way."
        },
        {
            "heading": 2,
            "text": "From the Cyber Security Awareness team"
        },
        {
            "text": "The team created this fun activity because they wanted to raise cyber security awareness:"
        }
    ]
}