{
    "url": "https://naturalengland.blog.gov.uk/2024/08/27/green-infrastructure-delivering-quality-of-life-and-environmental-benefits-for-communities/",
    "title": "Green Infrastructure: delivering quality of life and environmental benefits for communities",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Connecting People with Nature",
        "Development",
        "Environmental Improvement Plan",
        "Green Infrastructure",
        "Mapping",
        "Mental health and wellbeing",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network"
    ],
    "pub_date": "2024-08-27T16:44:57+01:00",
    "content": [
        {
            "text": "David Drake, Director, People & Nature at Natural England "
        },
        {
            "text": "In January 2023, Natural England launched the Green Infrastructure (GI) Framework to support the creation of good quality Green Infrastructure which maximises benefits for people and nature. GI helps local authorities, communities and developers create better places for people to live, work, learn and relax."
        },
        {
            "text": "Green infrastructure, ranging from street trees, green roofs and parks through to wildlife areas, woodlands and wetlands, can make a valuable contribution to nature recovery, by creating and connecting places which are rich in wildlife. It provides natural solutions to issues like poor air quality, flood risk and urban heating from climate change, whilst providing accessible spaces where people can enjoy the health and wellbeing benefits of contact with nature. Watch the below clip to learn more about GI."
        },
        {
            "text": "In September, Natural England will be introducing a range of new and updated resources to help Local Authorities, developers and others embed Green and Blue Infrastructure into strategies, plans and project design. The aim of these is to help us make our towns and cities fit for the future, for people and for nature."
        },
        {
            "text": "Urban green spaces alone support 2.1 million people in meeting their weekly physical activity needs. This is estimated to be worth £5.6 billion and to avoid health service costs of around £1.4 billion. The new resources come at a time when the need and opportunity for Green Infrastructure creation has never been greater, in addressing a range of priority issues for the government and across society more generally. The importance of high-quality GI is already recognised in the government commitment, contained in the Environmental Improvement Plan, that everyone should live within 15 minutes of green and blue space."
        },
        {
            "text": "We are also seeing a huge increase in the recognition of how regular contact with nature is beneficial to people’s health and well-being, and the role this can play in the prevention or treatment of a range of long-term health conditions. At the same time, partnerships of local authorities, communities and wider stakeholders are providing the GI knowledge, skills, experiences and connections that enable GI planners and providers to improve their local GI to benefit the local economy, creating the towns and cities of the future."
        },
        {
            "text": "Since the launch of the Green Infrastructure Framework, we are seeing an increased preparation of GI strategies for Local Plans and the inclusion of GI in some Local Nature Recovery Strategies. The GI Framework and its Standards are also referenced in the consultation on the revisions of the National Planning Policy Framework."
        },
        {
            "text": "The package of resources being launched in September include:"
        },
        {
            "text": "We have also recently seen the government launch of the official statistic in development for the 15 Minute Commitment, called Access to Green Space in England, which calculates the distance to green space for every household in England, measured along a network of walkable streets and paths."
        },
        {
            "text": "Development of urban greening model for cities and towns"
        },
        {
            "text": "Natural England, National Trust and The Heritage Lottery Fund are working in partnership on a greening initiative that puts nature at the heart of our local and national priorities. It will unlock the benefits of improved mental and physical health, greater community cohesion, resilience to climate change, and economic growth for all."
        },
        {
            "text": "The initiative will support local authorities, partners and community organisations with evidence, tools, funds, and resources to build nature into urban areas. In turn, this will create networks of knowledge and best practice, empowering planners, policymakers and investors to harness nature as an essential building block for better lives."
        },
        {
            "text": "Together, we are entering a very exciting phase in the journey of Green Infrastructure creation and the recognition of its contribution to society. To find out more about how Natural England can help and support local authorities, developers, community groups and other stakeholders with this journey, please join our webinar on 4 September 2024 by registering here."
        }
    ]
}