{
    "url": "https://prisonjobs.blog.gov.uk/2024/08/27/programme-facilitator-core-skills-and-job-insights/",
    "title": "Programme Facilitator: Core Skills and Job Insights ",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Probation",
        "Recruitment advice"
    ],
    "pub_date": "2024-08-27T11:22:09+01:00",
    "content": [
        {
            "text": "We spoke with two programme facilitators, Simone and Craig. The programme facilitator role involves working with groups of offenders completing mandatory courses as part of their probation conditions. Simone joined the Probation Service two years ago and came from a criminal justice background, previously working in the Prison Service. Craig has worked in the role for seven years and brought his experience of working with students with behavioural difficulties.  Simone and Craig give us an insight into the skills required to be a programme facilitator, the benefits and the challenges of the role.  "
        },
        {
            "text": "Thanks for telling us a bit about the role – what's actually involved with being a programme facilitator? "
        },
        {
            "text": "Simone: I deliver programmes like BBR (Building Better Relationships) and TSP (Thinking Skills Programme). BBR is offered to people convicted of domestic violence. The programme aims to help offenders gain a better understanding of the impact of their behaviour and promotes techniques of emotional self-control. The programme runs for 30 sessions, including both group and one-to-one sessions. TSP is geared towards general offending behaviours, covering self-management, problem-solving, and social interactions. Offenders will learn to develop skills like emotional control and assessment of positive and negative influences in their lives. TSP runs for 19 sessions with groups of up to 12 people.  "
        },
        {
            "text": "Craig: You always work with another facilitator. So, you've always got that experience of working with someone else. And it's quite nice that way because it's a good way to build rapport within the team and have that bonding with each other. You always meet offenders individually ahead of them starting their course and then they take part in the group delivery."
        },
        {
            "text": "How did your previous jobs equip you for the role? "
        },
        {
            "text": "Craig: I used to work with students who were expelled from schools and weren't old enough to go to college, so I had experience working with behavioural difficulties.  I also have a sports development and coaching qualification which helps with my role as you are coaching offenders on how they can act differently in situations, set up personal goals, and have a better understanding of their emotions. "
        },
        {
            "text": "Simone: I was a prison officer for two years before doing this. In my previous role, I had the chance to talk to people a lot. I could be on a night shift and spend 12 hours talking to offenders, gaining an understanding of what they’re going through and what led them to make certain decisions. I've used these communication skills in my role now and I enjoy being able to support people in their community. "
        },
        {
            "text": "What essential skills do you think you need for the role?  "
        },
        {
            "text": "Craig: The ability to be personable is key. If you can't build rapport with the group members individually then you’re not going to have that ability to connect with the group. Also, the ability to listen and take time with people who are talking about difficult situations or times in their lives and have an empathic understanding. Time management skills are important too, a typical workday spans to 8 hours, with a significant portion dedicated to session preparation and delivery.  "
        },
        {
            "text": "Simone: We ask offenders to reflect, and if we don’t practice it ourselves, everything falls apart. It's crucial to practice self-reflection and consider others' views, both in training and daily interactions with colleagues. This helps in continual learning and improvement. Although you don’t need to be an extrovert, being comfortable standing up and interacting with a group of people is also a big part of the role, as well as believing in procedural justice and the potential for people to change. "
        },
        {
            "text": "What are the biggest challenges you face?  "
        },
        {
            "text": "Simone: It can be quite mentally challenging to adapt to the different learning needs of groups. For example, at 11am I could be with one group of people some with mental health issues I need to be mindful of, and I could be with another group at 5pm who have a completely different set of issues with different learning types. This may mean you need to adjust the way you speak or deliver a certain point. "
        },
        {
            "text": "Craig: I think the most challenging aspect is getting through the training and developing the self-confidence to be able to work with a group. "
        },
        {
            "text": "On the flip side, what would you say are the best elements of the job?  "
        },
        {
            "text": "Simone: I would say the best part is my team. The way we work has made such a difference in how comfortable I am at work, and we regularly check in on each other using the skills we’ve learnt in training. There’s a lot of self-development that happens from doing the role too. You learn a lot about yourself through this job which is not the sort of thing you get in many other workplaces. "
        },
        {
            "text": "Craig: The best moments are when offenders have those light bulb moments, realising their mistakes and figuring out what they could have done differently for a better outcome. It's incredibly rewarding, especially as it gets towards the end of the programme, and you see an increase in participation, motivation and engagement. It’s great to see them enjoying the sessions more as they progress. I also enjoy the active, varied nature of the work and not being stuck to a desk. "
        },
        {
            "text": "How do you decompress?  "
        },
        {
            "text": "Craig: We allocate dedicated time at the end of each session to reflect, discuss how things went and check in on each other's wellbeing. We also fill out debrief forms in the evening, looking at what worked well and what could have been improved. Personally, I enjoy listening to podcasts on my drive home. Fortunately, our role offers flexibility; for instance, we can take afternoons off after longer shifts earlier in the week. This flexibility helps maintain a healthy work-life balance. "
        },
        {
            "text": "Simone: More often than not by talking to colleagues and debriefing, and that’s why there’s always two of us in the sessions. And then by doing the things that I would normally do, going to the gym, listening to music, I’ll just do my thing! "
        },
        {
            "text": "If you're passionate about helping others and looking for a rewarding career where you can make a real difference, consider our programme facilitator roles. Start your application today."
        }
    ]
}