{
    "url": "https://marinedevelopments.blog.gov.uk/2024/08/27/the-marine-spatial-planning-msp-challenge-game-goes-global/",
    "title": "The Marine Spatial Planning (MSP) Challenge Game goes Global",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2024-08-27T10:39:02+01:00",
    "content": [
        {
            "text": "The Marine Planning Team works with the MMO’s Marine Global Team to help aiming to better protect and sustainably manage their marine environments."
        },
        {
            "text": "Credit: Indonesia Nature Film Society, Rekam Nusantara Foundation"
        },
        {
            "text": "Turkey"
        },
        {
            "text": "Paul Gilliland, Head of Marine Planning, was recently in Turkey at the invitation of a Regional Activity Centres (RAC) under the United Nations Regional Sea (Barcelona) Convention for the Mediterranean. A two-day training workshop, “Marine Spatial Planning in Türkiye: From theory to practice,” was held for participants from central government, local authorities, industry, and academia."
        },
        {
            "text": "Paul led two MSP Challenge game sessions for 30 participants, based on the marine area around Izmir on the south coast. The scenarios aimed to find space for increases in aquaculture, offshore wind, ship breaking facilities, and new marine protected areas, all while safeguarding existing interests such as fishing and tourism. The sessions were lively, and the feedback was extremely positive, providing a great opportunity to explain the MMO’s role and remit."
        },
        {
            "text": "Senegal "
        },
        {
            "text": "In June, the MSP Challenge Game was played with Senegal’s MSP Working Group during an Ocean Country Partnership Programme visit, facilitated by Georgie Sutton and Lois Duff. The session aimed to balance the competing needs for space between three key sectors in Senegal’s marine area: fisheries (artisanal and commercial), oil and gas, and marine protected areas."
        },
        {
            "text": "The game featured two fictitious authorities (Bayland and Island) within one country, each with participants representing all sectors and broadly similar goals, with each needing to contribute half of the defined national objectives."
        },
        {
            "text": "After the game, participants representing the various sectors shared their experiences and provided positive feedback to the wider group. They thought the MSP Challenge game helped them to gain a better understanding of the practical considerations of MSP, including the interactions and potential conflicts between activities. The game helped to consolidate their knowledge and discussions furthering their support for developing MSP in Senegal."
        },
        {
            "text": "Indonesia"
        },
        {
            "text": "Marine planners, David Spray and Louise Feavyour, along with other MMO staff and Centre for Environment Fisheries and Aquaculture Science members were invited to facilitate three MSP Challenge games as part at the Global Dialogue on Sustainable Ocean Development conference."
        },
        {
            "text": "Over three games, 60 participants applied their own knowledge and experience of MSP to create a marine spatial plan for a sustainable, rich, healthy and prosperous sea. The game incorporated global ocean accounts by providing evidenced values for various sectors, covering the economy, social capital and regulating, provisioning and supporting ecosystem services. Participants considered how different values and economic evidence bases would influence decision making."
        },
        {
            "text": "After the sessions, participants shared their experiences and learning. Feedback highlighted the games effectiveness in illustrating MSP and its success as a training tool when tailored to specific audiences."
        }
    ]
}