{
    "url": "https://defrafarming.blog.gov.uk/2024/08/27/webinar-expanded-sustainable-farming-incentive-offer-2024/",
    "title": "Webinar: Expanded Sustainable Farming Incentive offer 2024",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Sustainable Farming Incentive",
        "Things we're doing",
        "Webinars"
    ],
    "pub_date": "2024-08-27T10:02:22+01:00",
    "content": [
        {
            "text": "On Thursday 26 September, we’re holding a webinar for farmers to discuss the guidance, actions, and details of the expanded Sustainable Farming Incentive (SFI) offer."
        },
        {
            "text": "We’ll cover endorsed actions and updates to terms and conditions."
        },
        {
            "text": "Janet Hughes, Farming and Countryside Programme Director, will be joined by policy leads working on SFI and colleagues from the Rural Payment Agency (RPA) and Catchment Sensitive Farming. "
        },
        {
            "text": "This webinar will be delivered in collaboration with the Farming Advice Service (FAS) and The Farming Forum (TFF). "
        },
        {
            "text": "To attend the online session, follow the Zoom link and reserve a place. It’s free, and once registered, you can ask or upvote questions on Slido before and during the webinar."
        },
        {
            "text": "The webinar lasts 1.5 hours and starts at 2pm."
        },
        {
            "text": "If you can’t attend, don’t worry. The webinar will be recorded, and the video will be added to this post and the ‘ webinars in 2024 ’ page after it ends."
        },
        {
            "text": "To prepare, look at our recent blog post on the expanded offer."
        },
        {
            "text": " It includes a link to the ‘Find funding for land or farms’ tool which will give you an idea of the actions you could include in your SFI agreement. "
        }
    ]
}