{
    "url": "https://digitalpeople.blog.gov.uk/2021/09/29/2021-summer-diversity-interns-at-gds/",
    "title": "2021 Summer Diversity Interns at GDS",
    "authors": [
        "Jake Rutherford",
        "Sarah Quinn",
        "Sahil Islam",
        "Fatima Lobocka"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Digital Data and Technology Fast Stream",
        "Diversity and Inclusion"
    ],
    "pub_date": "2021-09-29T14:00:05+01:00",
    "content": [
        {
            "text": "For the second year we’ve welcomed interns remotely for the Summer Diversity Internship Programme (SDIP). While the coronavirus (COVID-19) pandemic continues to affect work, interning in Digital, Data and Technology (DDaT) is still an exciting opportunity to explore a future potential career! Interns across the Central Digital and Data Office (CDDO) and Government Digital Service (GDS) share what their experience was like."
        },
        {
            "heading": 2,
            "text": "Sahil - Strategy Team, Central Digital and Data Office"
        },
        {
            "text": "I worked within the Strategy Team, which supports Cabinet Office on the strategic planning of the digital function of wider government. I joined an extremely welcoming team, who were fully focused on the 2021 Spending Review (SR), which instantly gave me an insight into the work the team does on a day-to-day basis."
        },
        {
            "text": "Immediately making use of my analytical and communication skills, I was tasked with writing a report on how the government can learn from the private sector and international best practice to improve its approach to digital procurement. Because this is a high priority for CDDO and forms an important part of their transformation agenda, I feel that I was working on something which would make a huge difference in the long term."
        },
        {
            "text": "At the end of the project, I had the opportunity to present my findings to various colleagues within the Strategy and Economics team, which gave me invaluable insight and feedback on my work and further honed my transferable skills."
        },
        {
            "text": "I am truly grateful for my SDIP experience, and I feel extremely privileged to have contributed to the work of the Strategy Team. Working remotely didn’t hinder my experience and I felt welcomed by every member of the team. I now understand so much more about the government and the Civil Service, and feel confident in my ability to be successful in the Civil Service Fast Stream. I would absolutely recommend the SDIP to anyone interested in the Civil Service!"
        },
        {
            "heading": 2,
            "text": "Sarah - Threat Intelligence and Counter Fraud Team, Government Digital Service"
        },
        {
            "text": "I’ve been immensely fortunate to benefit from the versatility, innovation and expertise at GDS. The team wanted me to explore my interests, so I’ve worked on identity theft and criminal misuse of the Dark Web for the Threat Intelligence and Counter Fraud team, and the emerging international legal regime for data sharing. This is highly topical in the wake of numerous Silicon Valley scandals and relevant to our policy proposals for a single sign-on for government."
        },
        {
            "text": "What I did not anticipate was the extent to which GDS’s organisational model is centred around innovation. GDS is driven by agile methodologies, originally an approach to software development that is now used to structure the delivery of government services in an iterative and reflective manner. My experience of a workplace which conducts “firebreaks”, “sprints” and “retros”, prioritises efficiency over wasted effort, and refuses to compromise on user experience is something I will seek to reproduce in my future career. "
        },
        {
            "text": "Above all, I am most grateful to my GDS colleagues for their generosity with their time. I had many 1-on-1 meetings to learn from colleagues outside of my immediate team about threat modelling and the technical architecture behind GOV.UK, shadowed a policy team working on proposals for secondary legislation, and attended workshops on a diverse range of topics. I wholeheartedly recommend applying for a role in GDS, and hope to cross paths with people I’ve met here again."
        },
        {
            "heading": 2,
            "text": "Jake - DDaT Capability Team, Central Digital and Data Office"
        },
        {
            "text": "The SDIP has been an enjoyable and worthwhile experience. I would urge anyone considering applying to be bold, back themselves and go for it."
        },
        {
            "text": "I currently intern with the CDDO’s Emerging Talent Team as a User Researcher. Given that my background is in data science, I’ve been encouraged to be innovative and blend data science methodology with user research methodology. With my skills in state-of-the-art natural language processing techniques, I’ve developed new analytical tools for extracting insights from survey data. I am now working towards applying these tools to assist my colleagues in their analyses."
        },
        {
            "text": "The people here are genuine, sincere and seek to positively affect you. I have been pushed to identify areas for skills development. In doing so, the right people with the right projects to develop those skills have been found for me. Through this, I have been able to collaborate with people outside of my team, pursue my professional goals and add value more broadly."
        },
        {
            "text": "Overall, the SDIP is an opportunity to be challenged, to add value to the Civil Service and to get a flavour of what work is like here."
        },
        {
            "heading": 2,
            "text": "Fatima - Government Automation Team, Central Digital and Data Office"
        },
        {
            "text": "In my 3-month internship in the Automation team I worked on the plans and implementation of automating services across government and cabinet offices. I primarily focused on developing engagement plans of how we will work with other departments to understand where they are with their automation ambitions and what help CDDO could provide to support them in actualisation."
        },
        {
            "text": "Learning agile ways of working has been highly rewarding and has led to developing skills such as strategic thinking and project management. This was a boon when preparing and presenting engagement plans for consultants and senior members of staff, and analysing responses. "
        },
        {
            "text": "I also had the opportunity to immerse myself in a fast-paced environment: in a mere 3 days I analysed 6 different departments' meeting notes with CDDO and consultants regarding their stance on automation and its position in the SR proposals. Working with a variety of DDaT professionals helped me gain a depth of understanding into their role. After completing the analysis I provided answers and advice to senior management for next steps."
        },
        {
            "text": "Finally, I provided cover for colleagues on annual leave, giving me the chance to manage diaries for Directors and Deputy Directors in the area. By being the point of contact for all queries I learned to liaise with a range of stakeholders such as local government representatives and colleagues in other departments."
        },
        {
            "text": "This is a great example of the networking opportunities I had, even while working remotely. Being remote, senior staff were able to squeeze in 15 minutes for a chat, which has allowed me to broaden my knowledge and understanding of what career I would like to pursue following my internship end date."
        },
        {
            "heading": 2,
            "text": "What are you waiting for?"
        },
        {
            "text": "Our interns have made a genuine impact on our work, and they were a true part of the team while they were with us. SDIP interns are a meaningful part of the civil service workforce, and often go on to chart careers in the public sector thanks to their experience. However, joining the SDIP is not the only entry route - if you’re interested in DDaT jobs, keep an eye on our jobs site, as there can always be openings!"
        }
    ]
}