{
    "url": "https://publicguardian.blog.gov.uk/2021/09/29/acting-as-a-deputy-for-a-loved-one/",
    "title": "Acting as a deputy for a loved one ",
    "authors": [
        "Ruth",
        "Sara"
    ],
    "categories": [
        "Deputies",
        "deputy",
        "FAQs",
        "Future planning"
    ],
    "pub_date": "2021-09-29T12:44:17+01:00",
    "content": [
        {
            "text": "Acting on behalf of a loved one after being appointed as their deputy can seem a bit daunting. We’ve got some hints and tips here to help you on your way to being the best deputy you can be."
        },
        {
            "heading": 3,
            "text": "Getting started as a deputy."
        },
        {
            "text": " Once you’ve been appointed, you’ll need to complete a New Deputy report to allow us to get some information on the current situation of the person you’re looking after. If you don’t have access to a computer, you can request a paper form to be sent for you to fill in."
        },
        {
            "text": "If you need any help or support we’re happy to help you to complete the report and provide any technical advice required. "
        },
        {
            "text": "You will want to make sure you have everything you need to act, so go over your court order carefully to make sure you’ve got all the clauses and information you need. If there’s something missing, you have 21 days to get in touch with the Court of Protection to amend the document."
        },
        {
            "text": "When acting as a deputy, you must follow the 5 main principles of the Mental Capacity Act code of practice."
        },
        {
            "text": "In brief these are: \n1. You must presume the person has capacity to make a decision  \n2. You must do everything you can to support that person to make a decision \n\n3. An unwise decision does not mean they’re not able to make decisions \n4. You must always act in the best interests of the person \n5. You must always take the least restrictive path when making decisions "
        },
        {
            "text": " \nThese principles will determine how you act and support the person to make a decision. If you don’t follow these principles, you could be removed from acting on their behalf. \n\n"
        },
        {
            "heading": 3,
            "text": "Filling in annual reports"
        },
        {
            "text": " We ask all deputies to fill in an annual report to show how you’ve been doing acting as a deputy and what decisions have been made during that year. "
        },
        {
            "text": "If you are a sole deputy, you may ask someone to help you with completing the annual report. You don’t have to be good at maths but any support to help you adjust to being a deputy and keeping track everything is helpful for filling in an annual report.  "
        },
        {
            "text": " \nThis may be a family member, a friend or a professional person such as an accountant. If you do decide to ask a professional, there may be a cost for their services which will come out of the donor’s finances. Is this something they can afford to do?"
        },
        {
            "text": "The report doesn’t need to be perfect just an accurate reflection of what actually happened over the year. Let us know what best interest decisions have been made, when and what impact this had."
        },
        {
            "text": "We have a digital service which can make recording all this information easier. Paper options are available."
        },
        {
            "text": "You will be appointed a named case worker at OPG to help you when you need it. If that person isn’t available, the wider team will look after you so there’s always someone available when you need them. "
        },
        {
            "text": " \n"
        },
        {
            "heading": 3,
            "text": "I can no longer act as a deputy, what should I do?"
        },
        {
            "text": "If you decide to no longer be a deputy, you will be asked to consider who can replace you such as a family member or a friend.  You will be discharged as a deputy and no longer be able to act for the donor.\n \nIf there isn’t anyone who is able to take your place, you can ask the Local Authority if they can take on the deputyship.  "
        },
        {
            "text": "Otherwise, a professional person such as a solicitor or an accountant may take on this role.  All these professionals will make a charge to the donor for their services."
        },
        {
            "text": "Stepping down in your role is permanent, so if you’re unable to act for a short period of time, remember you can delegate tasks, just not the decision making.  "
        },
        {
            "text": " \nWe know it can be a difficult time acting on behalf of a loved one so please don’t hesitate to get in touch with us if you need help. For regular updates and information, you can find us on social media and for any specific questions get in touch with the deputyships team."
        }
    ]
}