{
    "url": "https://publicguardian.blog.gov.uk/2021/09/29/applying-to-become-a-deputy/",
    "title": "Applying to become a deputy ",
    "authors": [
        "Ruth",
        "Sara"
    ],
    "categories": [
        "Deputies",
        "deputy",
        "Future planning",
        "Mental Capacity Act"
    ],
    "pub_date": "2021-09-29T12:42:17+01:00",
    "content": [
        {
            "text": "It can be a tough time when applying for a deputyship. If you’re having to deal with the application process you’ll also be trying to manage certain aspects of life for someone who no longer has mental capacity.\n  \nHere you can find some helpful information on becoming a deputy, what to consider when applying and how you will need to act once you’ve been granted the deputyship from the Court of Protection."
        },
        {
            "heading": 3,
            "text": "When would you need to apply to become a deputy?"
        },
        {
            "text": "You can apply to become someone’s deputy if they do not have a Lasting power of attorney in place and they ‘lack mental capacity’ which means they cannot make a decision for themselves at the time it needs to be made. This could be due to a long-term illness or an unexpected injury."
        },
        {
            "text": "As a deputy, you’ll be authorised by the Court of Protection to help them make decisions when"
        },
        {
            "text": " needed, or if they’re unable to make that decision, to do so on their behalf. \n  "
        },
        {
            "heading": 3,
            "text": "What do you need to think about before applying to become a deputy?"
        },
        {
            "text": " Before applying you will need to consider if a deputyship is really what you and the person you’re looking after needs. If you want to make a single important decision, you can apply to the Court of Protection for a one-off order or you can consider if a benefits appointee is sufficient if the person has no or minimal savings. "
        },
        {
            "text": "There’s a declaration document called the COP4 which has more detail on what you need to do when applying."
        },
        {
            "text": "You can delegate tasks to others to help with the responsibility, however they will not be able to make any decisions, only you as the appointed deputy can do that. \n \nYou may want to share the responsibility with someone of becoming a deputy, if you would like to have multiple deputies you can apply at the same time. If you decide to share responsibility after someone has already been appointed, you will need to go back to court and request an addition."
        },
        {
            "text": "When acting as a deputy, you must follow the 5 main principles of the Mental Capacity Act code of practice.\n \nThese principles will determine how you act and support the person to make a decision. If you don’t follow these principles you could be removed from acting on their behalf. \n \nYou can get in touch with the Court of protection for any questions on filling in the forms."
        },
        {
            "heading": 3,
            "text": "The different types of deputyship."
        },
        {
            "text": "There are two different types of deputyship, health and welfare or property and finance, they will need separate applications to make decisions."
        },
        {
            "text": "You’ll need to think about what you need from the deputyship and make it very clear to the court when applying and filling in your forms. "
        },
        {
            "text": "As a financial deputy you’ll be solely responsible for paying bills, organising their pension and other financial matters. "
        },
        {
            "text": "Make sure you consider things such as needing to sell the client’s house in the future to pay for care fees, make sure that this is included in your application, if it isn’t and you need to make this decision, you’ll have to make another application to the court for permission.  \n \nOther things also need to be considered, such as if you want to claim Family Care Payments or if you want to make special gifts which fall outside the terms of the court order, such as living in the persons property rent free. For more information on giving gifts you can read our blog or listen to our podcast."
        },
        {
            "text": "If you’re not sure what you might need include it in the application anyway. "
        },
        {
            "text": "For a health and welfare deputy you will be responsible for decisions on medical treatment and how someone is being looked after. "
        },
        {
            "text": "You’ll only be appointed for a health deputyship under certain circumstances. You can find out more on when to apply for a health deputyship online. \n  \n "
        },
        {
            "heading": 3,
            "text": "Acting with multiple deputies"
        },
        {
            "text": " If you’ve decided to apply with others to act as a deputy, you’ll need to look into how you want to act. There’s the option to act jointly or joint and several. \n \nJoint only deputies means all decisions need to be made together, often in person, for example setting up deputyship bank accounts and then using those accounts to withdraw money. If all deputies are not there, together, you can’t act. "
        },
        {
            "text": "Acting as joint only deputies can seem sensible, you both have to agree before any action can be taken and one person can’t act without the other knowing."
        },
        {
            "text": "Joint and several deputies may make decisions together or on their own. This can make life easier for deputies who may not live close by."
        },
        {
            "text": "As a joint and several deputy one person can act alone if needed but they can come together to make decisions on any bigger issues. Such as potential care home or selling assets to pay for care. \n "
        },
        {
            "heading": 3,
            "text": "What happens if you’re not appointed?"
        },
        {
            "text": "There is no guarantee you will be granted the deputyship when you apply."
        },
        {
            "text": "In some cases a professional deputy will be appointed instead. This can be if there are complicated finances, family disputes, or they believe being in the care of a deputy to be more beneficial.  "
        },
        {
            "text": "You can still work with the appointed professional deputy to make best interest decisions and be involved in the care of the donor."
        },
        {
            "text": "We have another blog available for some helpful information on acting as a deputy once you’ve been appointed. "
        }
    ]
}