{
    "url": "https://marinedevelopments.blog.gov.uk/2021/09/29/blue-belt-ukots-benefit-from-roundtable-on-mpa-management-effectiveness/",
    "title": "Blue Belt UKOTs benefit from roundtable on MPA management effectiveness",
    "authors": [
        "Claire Turner, MMO Digital Manager"
    ],
    "categories": [
        "Blue Belt",
        "technology"
    ],
    "pub_date": "2021-09-29T15:37:33+01:00",
    "content": [
        {
            "text": "In March this year, members of the Blue Belt team hosted a roundtable discussion on Protected Area Management Effectiveness (PAME). PAME is a tool to assess how well protected areas – including Marine Protected Areas (MPAs) – are being managed and the extent to which management is achieving the goals and objectives of the MPA."
        },
        {
            "text": "The team were joined remotely by international experts who presented experience and learning from Australia, UK and the Seychelles. The 25 attendees were MPA managers, policy makers and scientists representing the UK Overseas Territories (UKOTs) within the Blue Belt Programme - Ascension Island, British Indian Ocean Territory, Pitcairn Islands, South Georgia and South Sandwich Islands, St Helena, and Tristan da Cunha - as well as the Royal Society for the Protection of Birds, the Centre for Environment, Fisheries and Aquaculture Science, and the Marine Management Organisation."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "The roundtable provided an opportunity to learn how and why PAME is assessed. Understanding management effectiveness is essential to ensure that MPAs are making progress and providing meaningful protection for their marine environments. PAME looks at all the different things that are needed for effective MPA management, so that if things aren’t working that well, MPA managers understand why and what they need to do to improve management."
        },
        {
            "text": "While there is no single method, the workshop participants agreed that common principles can be adapted to local situations and capacity. The roundtable also provided a platform to discuss the challenges and opportunities for UKOT MPA managers in evaluating the management effectiveness of their MPAs."
        },
        {
            "text": "Marianne Teoh, Blue Belt Senior Integrated Marine Manager:"
        },
        {
            "text": "“The presentations and debate went well; it was great to see challenges and different approaches to PAME assessments discussed so openly."
        },
        {
            "text": "The roundtable really underlined the benefits of shared learning between the UKOTs and the wider MPA community. The discussion highlighted a need to keep evaluations simple and achievable for each UKOT, and showed that while the results are important, the actual process of conducting the assessment is incredibly valuable in bringing together stakeholders and promoting mutual understanding of MPA management needs.”"
        },
        {
            "text": "To read more about the event, the proceedings of the roundtable are available: Blue Belt PAME Report (publishing.service.gov.uk)"
        },
        {
            "text": " "
        }
    ]
}