{
    "url": "https://marinescience.blog.gov.uk/2021/09/29/charting-progress-the-english-atlantic-bluefin-tuna-catch-tag-and-release-programme/",
    "title": "Charting progress: the English Atlantic Bluefin Tuna catch, tag and release programme",
    "authors": [
        "Helen Egar"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-29T11:57:43+01:00",
    "content": [
        {
            "text": "Last month, the first ever CHART (CatcH And Release Tagging) pilot programme went live in England, with the start of the 13 week-long Atlantic Bluefin Tuna (ABT)  fishing season. From 16th August, flying their specially designed CHART flags and with the benefit of favourable weather conditions, the first week of the CHART programme saw 12 of the 15 permitted vessels and 53 anglers embark from ports in South West and South England, on their first legally permitted trips in search of these incredible ocean giants."
        },
        {
            "text": "This milestone day represented the culmination of months of effort.  Scientists, policy makers, recreational anglers, skippers and conservationists had been working together since September 2020 to develop a trial programme. Earlier in the year,15 experienced skippers were carefully selected by Cefas, following a rigorous application and evaluation process, to join this unique collaboration, with a mission of working directly with Cefas fisheries observers, scientists, as well as other organisations, such as the Marine Management Organisation, Natural England and various stakeholder groups including Bluefin Tuna UK.  Their mutual objective was to collect data to improve the scientific understanding and management of bluefin tuna."
        },
        {
            "text": "In addition to providing important scientific data, CHART aims to bring economic benefits to coastal communities, by enabling paying recreational anglers to encounter these amazing apex predators up close. In recent years, the number of reported sightings of Atlantic Bluefin Tuna has been increasing in UK waters. They have been observed more frequently in our coastal waters, particularly during the late summer, autumn and winter as they feed on energy rich pelagic fish, such as sprats and herring, in waters around the UK. There are multiple and complex reasons why their numbers may have increased, such as conservation measures and climate change impacts, including abundance of prey and changes to the marine environment."
        },
        {
            "text": "In July, skippers and crew members were put through their paces to successfully complete compulsory specialist training to understand the key objectives of CHART and promote best practice in the effective capture, tagging, recovery and release of Atlantic Bluefin Tuna.  Bespoke workshops led by Cefas scientists and sector experts, were held in Weymouth and Falmouth, with participants attending from Cornwall, Devon, Dorset, East Sussex and Hampshire.  The training, alongside other measures, was designed to safeguard the welfare of these charismatic creatures; allowing the skippers to be granted scientific licences by MMO to fish for Atlantic Bluefin Tuna, from August to November this year."
        },
        {
            "text": "Leading the Falmouth training workshop was Dr Sophy Phillips, Cefas Senior Fisheries Scientist, who commented:"
        },
        {
            "text": "“Scientific research and citizen science projects have provided evidence that Atlantic Bluefin Tuna are returning to UK waters in increasing numbers during the summer months. But we still don’t understand enough about these incredible predators; CHART offers the potential to fill gaps in our knowledge of their distribution, movements, behaviour, numbers and demographics. Training the skippers to carefully tag the Atlantic Bluefin Tuna, as well as how to collect data on their size, fishing effort and sightings will enable us to develop a clearer picture of ABT in English waters.”"
        },
        {
            "text": "Also providing important training for skippers, was Steven Murphy of Bluefin Tuna UK, who added:"
        },
        {
            "text": "“After an exhaustive 7 months’ consultation process, we have here a world class example of collaboration and the value that the Recreational Sea Angling sector can bring to important scientific research. Combining the scientific expertise of Cefas, with the great experience of seasoned UK Charter skippers and anglers with notable experience of large pelagic species, we have a programme which will deliver important scientific data, real economic benefits to coastal communities, and an opportunity for anglers to engage with this iconic sportfish in a professional, managed environment.\""
        },
        {
            "text": "CHART skippers are now nearing another significant programme milestone.  They are almost mid-way through the fishing season, with six weeks fishing experience behind them, collectively they have tagged 155 tuna; measured 159 tuna; undertaken 198 fishing trips, with 484 paying anglers on-board, representing a total of 1,356 hours of fishing effort. These impressive statistics represent the combined effort of the many individuals who have joined forces to ensure CHART meets its aims.  Just some of them are featured here, but all deserve thanks for their commitment and achievements."
        },
        {
            "text": "The Skipper: "
        },
        {
            "text": "Mark Jury is skipper of Fortuna II."
        },
        {
            "text": "Q: What is your role in CHART?"
        },
        {
            "text": "My role in CHART is to provide anglers with an experience with the amazing bluefin tuna which are swimming in our waters.  To target, catch, tag and release these giants is a privilege."
        },
        {
            "text": "Q: Why is CHART important to you?"
        },
        {
            "text": "CHART is so important, as it will help prove without doubt the viability of a future recreational catch and release fishery."
        },
        {
            "text": "Q: Greatest challenge so working on the CHART pilot?"
        },
        {
            "text": "As always, the greatest challenge in any project is results, in this case catching.  Long days at sea and sometimes no fish even seen - but when you catch!!  Every fisherman/woman needs to experience the power, grace and beauty of these true giants and the cherry on top – watching it swim away."
        },
        {
            "text": "The Scientist: "
        },
        {
            "text": "Dr Sophy Phillips has been a Senior Fisheries Scientist at Cefas in Lowestoft since 2005. Primarily working on shark, skate and ray research.  Sophy moved into Atlantic Bluefin Tuna research at the scoping and inception of the CHART programme in September 2020."
        },
        {
            "text": "What is your particular role in CHART?"
        },
        {
            "text": "I was the scientist charged with scoping out the feasibility of a CHART-style programme for England and have since become the principal investigator for CHART, after it was commissioned. I am responsible for leading the scientific design, analyses and reporting of the pilot programme."
        },
        {
            "text": "Why is CHART important to you?"
        },
        {
            "text": "CHART is important for a number of reasons. It is a unique programme in that it has been fully co-designed with stakeholders through a lengthy consultation process and allows fishers to contribute to both national research in understanding the distribution, demographic and numbers of Atlantic Bluefin Tuna utilising English waters, whilst also contributing to international research programmes through ICCAT in support of sustainability targets for this species. It is also the first programme of its kind to make use of a ‘scientific licence’ under the Fisheries Act 2020."
        },
        {
            "text": "Greatest challenge so far?"
        },
        {
            "text": "Designing and pulling off two face-to-face workshops for around 60 attendees in a COVID-safe manner, whilst delivering the necessary hands-on training for our skippers and crew to safely and effectively catch, tag and release these wonderful fish."
        },
        {
            "text": "The Angler:"
        },
        {
            "text": "Phil Gray has been a recreational angler for over 40 years."
        },
        {
            "text": "Q: Why is CHART important to you?"
        },
        {
            "text": "It’s fascinating to work out the population of this fish with a potential to open up a recreational fishery – it’s a privilege to be a part of that."
        },
        {
            "text": "Q: Greatest CHART challenge so far?"
        },
        {
            "text": "Reeling in the big ones!"
        },
        {
            "text": "The Fisheries Observer:  "
        },
        {
            "text": "Joanna Ford has worked at Cefas since 2015, primarily as an offshore observer on the commercial fishing fleet.  In February of this year, she took on the role of operations manager for CHART."
        },
        {
            "text": "Q: What is your role in CHART?"
        },
        {
            "text": "As operations manager, it’s my job to liaise with the skippers and Cefas CHART observers to ensure the smooth running of the fieldwork and making sure the boats have everything they need.  I collate all the data the skippers are collecting and answer all the queries and questions from the skippers."
        },
        {
            "text": "Q: Why is CHART important to you?"
        },
        {
            "text": "CHART is a great opportunity to study an incredible fish, whose return to our waters is still relatively recent, whilst bringing tourism to small coastal communities through the recreational angling sector.  This form of collaboration between scientists and fishermen is rare and it’s a privilege to be a part of CHART."
        },
        {
            "text": "Q: Greatest challenge so far working on the CHART pilot?"
        },
        {
            "text": "Coordinating the 15 charter skippers with the observer team to ensure the smooth running of the fieldwork portion of the project has been an exercise in organisation."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "The CHART pilot fishing season concludes on 14 November, with an end of season workshop to be held to discuss achievements, lessons learned and early research findings. The data collected from CHART will contribute not only to improving understanding of Atlantic Bluefin Tuna in English waters, but will also be supplied to the International Commission for the Conservation of Atlantic Tunas (ICCAT), who supply the tags for CHART and coordinate international tagging of ABT. This information will also help inform policy decisions about the continuation of CHART in England and potential pilots in Scotland, Wales and Northern Ireland."
        },
        {
            "text": "You can keep updated on CHART progress by following the weekly updates on Cefas’ website and @CefasGovUK. Information about all participating skippers can also be found on the website page."
        },
        {
            "text": "Opinions expressed are those of the individuals named."
        }
    ]
}