{
    "url": "https://phescreening.blog.gov.uk/2021/09/29/dqass-reporting-website-goes-live/",
    "title": "DQASS reporting website goes live",
    "authors": [
        "Amy Baker"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme"
    ],
    "pub_date": "2021-09-29T15:13:49+01:00",
    "content": [
        {
            "text": "The Down’s syndrome screening quality assurance support service (DQASS) monitors and supports the quality and effectiveness of Down’s syndrome (T21), Edwards’ syndrome (T18) and Patau’s syndrome (T13) screening in England. DQASS provides feedback and support to laboratories, sonographers, the Screening Quality Assurance Service (SQAS) and to the PHE fetal anomaly screening team."
        },
        {
            "text": "Over the last few years, we have been developing the DQASS reporting website. This is a new tool for screening support sonographers (SSSs) to access:"
        },
        {
            "text": "We have done a phased rollout of the reporting website to allow us to identify and solve problems along the way and get feedback from users."
        },
        {
            "text": "We will launch the website on 1 October 2021, and from this date, we will no longer be sending your DQASS reports as email attachments."
        },
        {
            "heading": 2,
            "text": "Benefits"
        },
        {
            "text": "Compared to sending reports via email attachments, the DQASS reporting website:"
        },
        {
            "heading": 2,
            "text": "What you need to do next"
        },
        {
            "text": "Please email us at dqass@plymouth.ac.uk ifyou do not have a username for the DQASS reporting website and ask us to add your details to the system. We will send you a username and a welcome email with instructions on how to access and use the website."
        },
        {
            "text": "If you already have a username and a password for the DQASS reporting website you do not need to do any more. You will receive an email from us when your next set of reports are available."
        },
        {
            "heading": 2,
            "text": "Future changes"
        },
        {
            "text": "Our next phase will involve adding laboratory summary reports to the DQASS reporting website. This means that you will be able to access all of the reports we send you routinely from the DQASS reporting website."
        },
        {
            "text": "We would like to say thank you to all of those who helped us get this up and running."
        },
        {
            "text": "Verity John, SSS at Royal United Hospitals Bath, said:"
        }
    ]
}