{
    "url": "https://companieshouse.blog.gov.uk/2021/09/29/inclusive-content-design-the-way-we-write-is-important/",
    "title": "Inclusive content design: the way we write is important",
    "authors": [
        "Ellis Davies - Digital Content Manager"
    ],
    "categories": [
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2021-09-29T14:45:03+01:00",
    "content": [
        {
            "text": "It’s National Inclusion Week 2021. A week designed to celebrate everyday inclusion in all its forms. The theme for this year is unity and taking action to be united for inclusion."
        },
        {
            "text": "Inclusion is a golden thread that runs through all Companies House activity. We have multiple people networks and support groups, like our:"
        },
        {
            "text": "We encourage ‘curious coffees’ to find out more about each other. We have learning and development opportunities to understand equality, diversity and inclusion. We’ve signed the Race at Work Charter, and we’re a leader in the Disability Confident Scheme."
        },
        {
            "text": "As a content designer and government communicator, I communicate with my audience through words."
        },
        {
            "text": "My audience is varied. It can range from:"
        },
        {
            "text": "A wide range of people need to understand my messages, so I must make sure the way I write is inclusive. Good content design is about keeping things simple. Writing in a way that people can understand, regardless of their age and background."
        },
        {
            "heading": 2,
            "text": "Writing in a way everyone can understand"
        },
        {
            "text": "When publishing on GOV.UK, it’s important for us to stick to the Government Digital Service (GDS) style guide. The style guide is based on a lot of user testing and helps us to understand how to make content as accessible as possible."
        },
        {
            "text": "A part of this is using plain English. Plain English is about communicating with people, in writing, as clearly as possible. You might hear it being referred to as ‘layman’s terms’. It’s about writing with the reader in mind and writing in a way anyone can understand."
        },
        {
            "text": "It means trying not to use formal or long words when easy or short ones will do. For example, using ‘buy’ instead of ‘purchase’, or ‘help’ rather than ‘assist’."
        },
        {
            "text": "I know I might lose trust from people if I use government ‘buzzwords’ and jargon. Often, these words are too general and vague and can lead to misinterpretation or empty, meaningless text."
        },
        {
            "text": "Sometimes people think that writing clearly and simply can mean you lose authority. But this is not the case. In a 2012 study by Christopher Trudeau, 80% of the people who responded preferred sentences written in plain English. The more complicated the issue, the more they preferred to read simpler language."
        },
        {
            "text": "By writing in plain English for all literacy levels, more people can understand our messages and use the government services they often depend on."
        },
        {
            "heading": 2,
            "text": "Writing in a way that includes, and accurately portrays everyone"
        },
        {
            "text": "At least 1 in 5 people in the UK have a long term illness, impairment or disability. It’s important to use inclusive language, including knowing which words to use and avoid when writing about disability."
        },
        {
            "text": "We should always make sure text is gender neutral wherever possible too."
        },
        {
            "heading": 2,
            "text": "Improving our content"
        },
        {
            "text": "We know not all of the language on our GOV.UK pages, or our services, is as accessible as it should be. And we’re looking to fix this. We want to make life easier for our users, so we’re:"
        },
        {
            "text": "As part of our 5-year strategy, one of our strategic goals is to have brilliant services that give a great user experience. Over the course of our strategy, as well as improving our existing content, we’ll be developing new and intuitive services. Our content designers will design for accessibility, improving the services based on findings from user research sessions."
        },
        {
            "text": "We know there's usually no alternative to using government services, so they must work for everyone. Making our services inclusive and using accessible language means making sure anyone who needs to use them, can do so as easily as possible."
        },
        {
            "text": "Complex language and grammar do not add value to content. They just make the content inaccessible to people who might need that information the most. They’re blockers to providing a good service. If you want to help us make sure our services are as inclusive and accessible as possible, sign up to become part of our user panel."
        },
        {
            "text": "We’ve already made loads of progress in this area and we’ll continue to work hard to level the playing field for all Companies House users."
        },
        {
            "text": "Inclusive content design is a huge part of our future."
        }
    ]
}