{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/09/29/national-inclusion-week-the-only-man/",
    "title": "National Inclusion Week : The only man",
    "authors": [
        "Philip Lawrence",
        "Vicki Chalker"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2021-09-29T10:30:33+01:00",
    "content": [
        {
            "text": "When the GSE Diversity and Inclusivity Action Group (DIAG) was setting up their first three working groups I volunteered for the Women’s Working Group (WWG). I was the only man to volunteer. It made sense for me to be part of this working group as I do a lot of work at the Intellectual Property Office (IPO) on STEM outreach for girls and women, improving the way we promote patent examining as a career, particularly to women. On a side note, I would strongly urge anyone who is thinking of a career change to consider patent examining, we get to see inventions before almost anyone else does!  I’m also very passionate about D&I and I am the kind of person who likes to get involved. So I volunteered, but I was still the only man."
        },
        {
            "text": "As a white, middle aged, somewhat middle-class man, some people may question why I want to be involved in diversity and inclusion anyway. They perhaps see inclusivity as a problem for other people to tackle. These views can make you feel self-conscious and scrutinised, I was once referred to as “that guy in the women’s group”. I realise the irony of that comment as a lot of other people feel the same way every day, in situations where they are the only woman, person with a disability, LGBTQ+ member of their team or even in their building."
        },
        {
            "text": "I’m an outgoing person, so the idea of being the only man on the WWG group didn’t really bother me, but I still had concerns – would my ideas be listened to?  Would I just be viewed as an outsider? Essentially: would I be accepted?"
        },
        {
            "text": "Thankfully, the answer is yes. Improved access to video conferencing has meant we’ve been able to have more meetings than we would have been able to face-to-face. As a result, we have had the chance to get to know each other well, including our strengths and our weaknesses. We can ask each other for help without worrying about damaging our reputation. As for me, I have been able to bring my whole self along without fear of being judged. I feel that I am a useful and valued member of the group, despite not sharing the same experiences and knowledge as other members of the group. Over the course of the last year, we have welcomed other new members and we hope we have helped them feel the same."
        },
        {
            "heading": 3,
            "text": "What is the point of this blog article?"
        },
        {
            "text": "We’re all volunteers and nothing would get done if people didn’t volunteer to help.  You may think that you’re unqualified to volunteer in the D&I sphere – you’re not.  Sometimes diversity and inclusivity might seem exclusive, but you don’t need to be a woman, disabled, from a particular ethnicity, or from a lower socioeconomic background to join any of these working groups. You can join any group and help to deliver projects like GSE Connect, a cross-departmental partnering scheme for women in the GSE, which was my idea. Anyone can volunteer for any of the working groups!"
        },
        {
            "text": "Diversity and inclusion should matter to everyone, anyone can be involved in it and allies play an important role. We want people with passion and commitment to see the GSE Profession become the most inclusive part of the Civil Service. Find out more on how you can get involved in this on Friday!"
        },
        {
            "text": " "
        }
    ]
}