{
    "url": "https://lifeathmrc.blog.gov.uk/2021/09/29/national-inclusion-week-at-hmrc-doms-summer-diversity-internship-experience/",
    "title": "National Inclusion Week at HMRC, Dom’s Summer Diversity Internship experience",
    "authors": [
        "Dom Larocque"
    ],
    "categories": [
        "General",
        "Guest blog"
    ],
    "pub_date": "2021-09-29T09:00:35+00:00",
    "content": [
        {
            "text": "Dom recently graduated from the University of Portsmouth with a degree in Psychology. Through our multi-award winning Civil Service Summer Diversity Internship Programme (SDIP) Dom joined our organisation for 8 weeks over summer 2021."
        },
        {
            "text": "The SDIP is a great way to prepare undergraduates and graduates for a place on one of our Fast Stream graduate programmes, which could lead to many different career paths at the heart of the UK Government. Here’s what Dom has to say about his experience at HMRC."
        },
        {
            "text": "I was initially excited when I joined HMRC, but also a little nervous. How was I going to do? Am I going to enjoy the work? How diverse and inclusive is the Civil Service really? Were questions I thought about as my start date was approaching. However, within the first week of my internship my nerves had disappeared."
        },
        {
            "text": "One thing that helped ease my nerves was the opportunities available to broaden my network with the numerous events and virtual workshops held. The first event was the opening reception, in which we were introduced to several different Fast Streamers and Senior Civil Servants. Some of the workshops I attended were on the Ministry of Defence, Skills and networking, and how the Civil Service is aiming to become more diverse."
        },
        {
            "text": "There was also the opportunity to give back to my community by helping secondary school children practice interview techniques. The experience was extremely fulfilling as the school children came away from the session with a lot real life experience as to what interviews are like and how to succeed. I wouldn’t have had the chance to be a part of schemes like this outside of the SDIP, so I’m really grateful for the opportunity to further develop my skills within the community."
        },
        {
            "heading": 2,
            "text": "It’s not just lip service "
        },
        {
            "text": "Coming into the Civil Service I thought that I was entering a very white, male, upper-class dominated environment and I would be lying if I said that didn’t intimidate me. However, after joining HMRC I can definitely say that inclusivity is really important to the Civil Service."
        },
        {
            "text": "I feel that HMRC has responded in the best way regarding diversity, by acknowledging that there is always room for improvement and fully committing to bettering the organisation. It may be difficult, but I am confident that we are headed in the right direction."
        },
        {
            "text": "There are already loads of challenges that someone from a minority group may face when going into the world of work, so being able to be unapologetically me is an opportunity that I am really grateful for."
        },
        {
            "heading": 2,
            "text": "Joining the team virtually "
        },
        {
            "text": "Time to address the elephant in the room… working from home! My reaction to being told that I was going to be working from home was slightly mixed, but now I can say that the experience has been overwhelmingly positive. Don’t get me wrong, there are plenty of challenges that I have faced from working from home, such as it being harder to network, not meeting my team in person and it being harder to put names to faces. Yet all these problems have been countered by the amazing support my team and everybody else within the department have given. Everyone ensured that I was able to collaborate effectively by connecting me with people across the organisation and facilitating virtual shadowing sessions in meetings. It didn’t feel at all like a barrier and has been a great transition from university work into the world of work."
        },
        {
            "text": "During my internship, I worked on the Recruitment Marketing Attraction team which is a niche area within HMRC and vastly unlike our tax professional teams. The team helped me get stuck in wherever possible as I was working on a variety of projects such as improving our employer boards, like Glassdoor and Indeed; running our Facebook Onboarding groups for new starters and supporting with marketing asset design on a work experience flyer. The support that my team has given me throughout my internship has been amazing and I couldn’t have asked for a better team."
        },
        {
            "text": "It’s sad that my time here is coming to an end, but the experiences I’ve had here will last a lifetime. The SDIP has allowed me to evaluate my future career path, while also allowing me to express my ambitious self in a fast-paced working environment. More than anything I now look forward to my next challenge, which hopefully shall be the 2022 HR fast stream!"
        }
    ]
}