{
    "url": "https://phescreening.blog.gov.uk/2021/09/29/sct-screening-support-service-available-for-expert-advice/",
    "title": "SCT screening support service available for expert advice",
    "authors": [
        "Michelle Rugless"
    ],
    "categories": [
        "NHS Sickle Cell and Thalassaemia Screening Programme"
    ],
    "pub_date": "2021-09-29T17:15:08+01:00",
    "content": [
        {
            "text": "The Sickle Cell and Thalassaemia Screening Support Service in Oxford provides expert technical and scientific support to screening services. We have felt the impact of the COVID-19 pandemic, like all laboratory services nationally, but have remained open for business throughout."
        },
        {
            "text": "Many of us are working remotely, which has meant more reliance on email rather than phone calls, but we continue to deal with the enquiries and provide the help and advice needed in a timely manner."
        },
        {
            "heading": 2,
            "text": "Notable changes due to COVID"
        },
        {
            "text": "There were noticeably fewer enquiries from clinicians during the first period of ‘lockdown’ restrictions, compared to the previous 6 months. We thought this was probably related to a reduction in face-to-face appointments and prioritisation of more urgent medical referrals at the time."
        },
        {
            "text": "During the first lockdown period, we noticed an increase in enquiries about incidental laboratory findings from patients which were neither antenatal nor newborn screening related. This may have represented a slowdown in work in some laboratories and possibly more time to investigate unusual results. This apparent increase appeared to be short-lived as it did not continue into the second lockdown period and beyond."
        },
        {
            "text": "Throughout the pandemic the numbers of pregnancy related enquiries from haemoglobinopathy screening midwives, screening co-ordinators and genetic counsellors, as well as screening laboratory scientists, have remained fairly constant."
        },
        {
            "text": "Some clinicians sought to reduce hospital / GP appointments, especially when there are vulnerable family members who needed to shield. There were a few requests for guidance about the re-issue of maternal/paternal results from previous pregnancies."
        },
        {
            "text": "The numbers of Hb Variant queries reduced during the first few months of the pandemic but have since returned to pre-pandemic levels. These queries were mostly in the antenatal category. We also noticed an initial drop in beta thalassaemia related queries, but they have increased more recently and are mostly related to concerns over borderline Hb A2 levels and Hb A2 levels that differ between pregnancies."
        },
        {
            "heading": 2,
            "text": "Send us your feedback"
        },
        {
            "text": "We at the Sickle Cell and Thalassaemia Screening Support Service are dedicated to providing a good service to all our users. Your feedback is very important to us, so please remember to let us know your thoughts after using the service."
        }
    ]
}