{
    "url": "https://space.blog.gov.uk/2021/09/29/using-satellites-to-monitor-deforestation-in-cocoa-crops/",
    "title": "Using satellites to monitor deforestation in cocoa crops",
    "authors": [
        "Ecometrica, Forest2020"
    ],
    "categories": [
        "Earth observation",
        "International",
        "International Partnership Programme",
        "People",
        "Satellites"
    ],
    "pub_date": "2021-09-29T14:47:51+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Monitoring cocoa plants in Ghana from space"
        },
        {
            "text": "Globally, the majority of tropical deforestation is still linked to commodity farming and production. The expanded production of agricultural commodities such as beef, soy, cocoa, palm oil and paper/pulp are the major drivers of primary forest loss."
        },
        {
            "text": "With the introduction of more legislation, companies are under increasing pressure to prove that their supply chain is not responsible for deforestation. But it’s proving difficult to monitor, with cocoa being particularly tricky."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Cocoa is not easy to monitor"
        },
        {
            "text": "Ghana is the second largest global exporter of cocoa (after Côte D’Ivoire). One of the major challenges Ghanaian partners faced was monitoring the commodities versus the forest landscape in Ghana."
        },
        {
            "text": "Cocoa is grown both under tree shade (agroforest cocoa) as well as grown under sun (monocropped cocoa). Therefore satellite data alone is not enough to accurately monitor all the cocoa farms."
        },
        {
            "text": "As part of Forests 2020, a project by a consortium of UK experts and international partners led by Ecometrica Limited, a land use map was developed."
        },
        {
            "text": "The map was produced by the Ghana Forestry Commission using local expertise - teams on the ground essentially mapping and recording every cocoa farm and the surrounding vegetation -  along with satellite imagery from Sentinel-1 satellite, in combination with optical data collected from Sentinel-2 satellite, as well as machine learning."
        },
        {
            "text": "Forests 2020 is grant-funded by the UK Space Agency’s International Partnership Programme (IPP), part of the Global Challenges Research Fund (GCRF)."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Leading mapping in West Africa"
        },
        {
            "text": "The resulting land map is one of the most accurate (approx 90%) maps of cocoa growing in the world and crucially is able to differentiate between monocropped and agroforestry cocoa."
        },
        {
            "text": "The Ghanaian Forestry Commission worked closely with the Kwame Nkrumah, University of Science and Technology and the University of Leicester, to create a land map that enables cocoa farms to be monitored nationally."
        },
        {
            "text": "As part of the Cocoa and Forests Initiative and local forest laws, this land map will enable the Ghana Forestry Commision to ensure cocoa is not grown on land responsible for deforestation."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Not just cocoa - oil palm, mango, shea too! "
        },
        {
            "text": "The Ghana land use map is a scientific breakthrough creating a multi-purpose map that can be used to monitor all export forest risk commodities. The Ghana Forestry Commission partnered with Ecometrica to provide the Ghana Forest Compliance Service for Export Commodities."
        },
        {
            "text": "The service enables companies to have their supply chain, and its associated environmental impacts examined and assured that the products exported from Ghana are not linked to deforestation."
        },
        {
            "text": "“The Ghana Forestry Commission, in collaboration with Ecometrica, are pleased to announce the piloting of a Forest Compliance Service for Ghana’s agricultural export commodities (FCX)."
        },
        {
            "text": "We hope companies will take advantage of this innovative opportunity to help stamp out illegal deforestation associated with our export crops and ensure a green future for Ghana’s forests.”"
        },
        {
            "text": "Statement from John Allotey, Chief Executive of the Ghana Forestry Commission"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Investment channelled back into Ghana"
        },
        {
            "text": "A key benefit of the service is that it places the control and expertise of the mapping service within Ghana rather than being imposed from outside."
        },
        {
            "text": "Financial benefits from the service are shared with data providing partners, enabling investment in the Ghana Forestry Commision map maintenance and update cycles, thereby creating a commercially sustainable monitoring and mapping system."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What next?"
        },
        {
            "text": "Among the first to sign up to the land map were an international NGO and a cocoa trader. With increased legislation on the way, any companies sourcing their cocoa from Ghana can now receive a certification from the Ghanaian Government by using this comprehensive yet easy to use service."
        },
        {
            "text": "For more information take a look at the website: https://www.forestcompliance.com/"
        },
        {
            "text": "Or read more from Ecometrica here: https://ecometrica.com/ghana-launches-national-map-of-forests/"
        },
        {
            "text": " "
        }
    ]
}