{
    "url": "https://phescreening.blog.gov.uk/2021/09/29/who-highlights-role-of-screening-and-vaccination-in-reaching-hepatitis-b-control-targets/",
    "title": "WHO highlights role of screening and vaccination in reaching hepatitis B control targets",
    "authors": [
        "Jenny Neal",
        "Sema Mandal"
    ],
    "categories": [
        "NHS Infectious Diseases in Pregnancy Screening Programme"
    ],
    "pub_date": "2021-09-29T12:34:09+01:00",
    "content": [
        {
            "text": "The PHE infectious diseases in pregnancy screening (IDPS) programme and PHE immunisation team are celebrating after a commendation for the UK in achieving regional hepatitis B control targets."
        },
        {
            "text": "The commendation came from the World Health Organisation (WHO) European Technical Advisory Group of Experts on Immunisation which provides independent review of vaccine-preventable diseases and immunisation programmes in Europe."
        },
        {
            "text": "Infant immunisation and antenatal screening data submitted by Public Health England (PHE) on behalf of all UK nations showed that the UK attained high (>90%) coverage of hepatitis B vaccine through the universal infant programme and interventions to prevent perinatal (during pregnancy or in first year following birth) transmission of hepatitis B virus."
        },
        {
            "text": "This means the UK has maintained a hepatitis B prevalence below 0.5% in pregnant women and in infants born to women with hepatitis B."
        },
        {
            "heading": 2,
            "text": "Hard work"
        },
        {
            "text": "This fantastic achievement is down, in large part, to:"
        },
        {
            "text": "The latest NHS antenatal screening standards data report showed:"
        },
        {
            "heading": 2,
            "text": "Joint working"
        },
        {
            "text": "Huge thanks are  due to primary care staff who provide the subsequent doses of hepatitis B vaccine and test these infants at 12 months of age to exclude infection. Recent guidance on the hepatitis B: antenatal screening and selective neonatal immunisation pathway supports this work."
        },
        {
            "text": "Primary care play a pivotal role in delivering the universal hepatitis B infant immunisation programme with the hexavalent combination vaccine. It also helps make sure close household contacts of people with hepatitis B infection are tested and vaccinated."
        },
        {
            "text": "Prevention and control of hepatitis B in the UK is also dependent on diagnosing and vaccinating at risk adults, as recommended the hepatitis B chapter of the green book."
        },
        {
            "text": "This work is usually carried out by:"
        },
        {
            "heading": 2,
            "text": "Global elimination of hepatitis B"
        },
        {
            "text": "We await final validation of the UK achieving the control targets in 2022 after the WHO/UNICEF report on immunisation is published. It will appear on the WHO vaccines and immunisation publications page when it goes live."
        },
        {
            "text": "In the meantime, through collective and concerted efforts, we continue to strive towards the global goal of elimination of hepatitis B as a public health problem."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "More information about hepatitis B is available via the NHS infectious diseases in pregnancy screening e-learning module."
        },
        {
            "text": "Contact the screening helpdesk if you have any questions about antenatal screening for hepatitis B. Email immunisation@phe.gov.uk if you have queries about hepatitis B immunisation."
        }
    ]
}