{
    "url": "https://defrafarming.blog.gov.uk/2025/03/11/an-update-on-the-sustainable-farming-incentive/",
    "title": "An update on the Sustainable Farming Incentive ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2025-03-11T19:55:33+00:00",
    "content": [
        {
            "text": "The government has committed £5 billion over 2 years to sustainable farming and nature recovery and we’ve worked hard to get as many farmers into environmental land management schemes as possible.  The largest of these schemes, the Sustainable Farming Incentive (SFI) now has more than 37,000 multi-year live agreements and is not only delivering sustainable food production and nature’s recovery for today and the years ahead, but it is also putting money back into farmers’ pockets.   With record numbers of farm businesses in farming schemes and the sustainable farming budget successfully allocated, we will stop accepting new applications for SFI from today. "
        },
        {
            "text": "In this post, we’ll set out what it means for you. "
        },
        {
            "text": "Every penny in all existing SFI agreements will be paid to farmers, and outstanding eligible applications that have been submitted will be processed.  "
        },
        {
            "text": "Now is the right time for a reset: supporting farmers, delivering for nature and targeting public funds fairly and effectively towards our priorities for food, farming and nature.     "
        },
        {
            "text": "We will provide further details about the reformed SFI offer with details to follow the Spending Review."
        },
        {
            "heading": 2,
            "text": "What this means for you "
        },
        {
            "heading": 2,
            "text": "The SFI story so far"
        },
        {
            "text": "Since it launched in 2022, SFI has provided reliable income to farmers in England, with over 37,000 agreements in place all delivering towards the environmental targets at the heart of the scheme – and, as set out in the table above, these live agreements will continue.  "
        },
        {
            "text": "Through SFI, 800,000 hectares of arable land are now farmed without insecticides, reducing harm to pollinators and improving soil health.  "
        },
        {
            "text": "Meanwhile, 280,000 hectares of low-input grassland are being managed more sustainably, helping to protect biodiversity and improve water quality.  "
        },
        {
            "text": "Additionally, 75,000 km of hedgerows are being actively maintained, providing essential habitats for wildlife, improving carbon storage, and strengthening natural flood defences.  "
        },
        {
            "text": "The thousands of agreements that remain in place will continue to deliver these benefits and help us progress towards meeting our environmental targets over the next three years. "
        },
        {
            "heading": 2,
            "text": "Evolving the offer"
        },
        {
            "text": "Now is the right time for a reset.  "
        },
        {
            "text": "A reformed SFI scheme, with a budget to be confirmed in the Spending Review this summer, will direct funding where there is greatest potential to do more on nature and where there is the least ability to access decent returns from agricultural markets, or other sources of investment, as set out in the Land Use Framework. "
        },
        {
            "text": "In parallel, we will also reform markets, supply chains and regulations to ensure farmers receive fair payment for food production, with private sector support where possible. "
        },
        {
            "text": "We will continue to engage closely with stakeholders while we review the scheme to make sure that it is done in a transparent way. "
        },
        {
            "text": "Details of the revised SFI scheme will be announced in summer 2025, building on lessons learned and stakeholder feedback."
        },
        {
            "heading": 2,
            "text": "Endorsed actions"
        },
        {
            "text": "Farmers and land managers could apply for one endorsed SFI action in the expanded SFI offer (GRH6: Manage priority habitat species-rich grassland). "
        },
        {
            "text": "When we published drafts of an additional 14 endorsed SFI actions in December, we said we expected these additional actions to be available from summer 2025. These will now be considered as part of the work to develop a reformed and more targeted SFI. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "This latest development builds on: "
        },
        {
            "text": "By subscribing to the Farming blog, you’ll receive an email notification whenever a new post is published. We also share details of webinars for you to learn more."
        }
    ]
}