{
    "url": "https://food.blog.gov.uk/2025/03/11/british-science-week-2025-adapting-to-the-changing-food-landscape/",
    "title": "British Science Week 2025: Adapting to the changing food landscape",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Our mission",
        "Science"
    ],
    "pub_date": "2025-03-11T15:35:23+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "British Science Week runs this year from 7th to 16th March. This is a celebration of science, technology, engineering, and maths run by the British Science Association. Each year has a different theme, with this year's theme being ‘change and adapt’."
        },
        {
            "text": "British Science Week 2025 is upon us, a time to marvel at the transformative power of science in our everyday lives."
        },
        {
            "text": "At the FSA, we’ll be honouring British Science Week by celebrating women in science, hosting a Food for Thought webinar and sharing an update on one of our biggest collaborative research programmes to date. We’ve also got a quiz ready for you to test yourself on how much you know about our amazing research!"
        },
        {
            "text": "This year’s theme for British Science Week is ‘change and adapt’, and this ties in perfectly with one of the core aims of the FSA, to use the best available science and evidence to inform our policies and decision making. Change is an inevitable part of the food landscape, driven by factors such as technological advancements, consumer preferences, and global challenges. At the FSA, we understand the importance of adapting to these changes to ensure that our food system remains safe, resilient, and sustainable."
        },
        {
            "heading": 4,
            "text": "Adapting to new challenges"
        },
        {
            "text": "Throughout our 25-year history, we have continuously evolved our approach and strategies to meet new challenges. Great examples of this include our work in assessing the biggest risks that climate change will have on food safety and developing creative new testing methods to help identify adulterated food."
        },
        {
            "text": "Having up-to-date data and scientific evidence allows us to identify at-risk food types that could be posing allergen, authenticity, composition, contaminant and labelling threats. For example, our National Surveillance Sampling Programme coordinates sampling and testing across England, Wales and Northern Ireland to ensure our food is safe. The results from this programme provide essential information for risk assessments and policy decisions, helping us to ensure food is safe and is what it says it is. A key characteristic of this programme is adapting to new threats we are facing across the food landscape."
        },
        {
            "heading": 4,
            "text": "Embracing innovation"
        },
        {
            "text": "From exploring the use of blockchain for food traceability and researching the use of artificial intelligence in the food system, we are seeing history unfold as innovative technology is changing the way we think about food safety."
        },
        {
            "text": "Embracing innovation is also at the core of our recent successful bid (in collaboration with Food Standards Scotland) to run a sandbox programme for cell-cultivated products (CCPs). The sandbox officially launched on 10th March and aims to gather rigorous evidence on CCPs and the technologies used to produce them, aiding our safety assessment process. This work exemplifies our commitment to stay abreast of scientific evidence that helps us protect the public, ensuring we keep up with the evolving food landscape and do not hinder progress, all whilst keeping consumer’s safe"
        },
        {
            "text": "And as one FSA-led innovative and collaborative programme begins, another will be coming to an end with the conclusion of the PATH-SAFE (Pathogen Surveillance in Agriculture, Food and the Environment) programme at the end of March. Funded through the Treasury’s Shared Outcome Fund, this programme tested new approaches for monitoring and tracking foodborne pathogens and associated antimicrobial resistance in the agri-food system. The PATH-SAFE programme has worked with over 65 different organisations and supported 30 different projects. Keep your eyes peeled this week for a post from the PATH-SAFE team, delving into the details of this landmark programme."
        },
        {
            "heading": 4,
            "text": "Celebrating British Science Week"
        },
        {
            "text": "British Science Week is also a great opportunity for us all to reflect on how we can embrace “change and adapt” in our own lives. Whether it's adopting more sustainable food practices, staying informed about food safety, or supporting scientific research, each of us has a role to play in shaping a healthier and safer future."
        },
        {
            "text": "If any of this has piqued your interest, I would encourage you to sign up to the FSA Science Newsletter for regular updates about FSA science. You could also join our Food for Thought seminar series, where we host live webinars on topics which align with FSA research priorities. Don’t forget to register for our session discussing avian flu this week! Or sign up to our mailing list to receive invites on future Food for Thought events."
        },
        {
            "heading": 1,
            "text": "Wythnos Wyddoniaeth Prydain 2025: Addasu i’r dirwedd sy’n newid"
        },
        {
            "text": "Bydd Wythnos Wyddoniaeth Prydain yn cael ei chynnal eleni rhwng 7 ac 16 Mawrth. Mae’r wythnos, a gynhelir gan Gymdeithas Wyddoniaeth Prydain, yn dathlu gwyddoniaeth, technoleg, peirianneg a mathemateg. Ceir thema wahanol bob blwyddyn, a’r thema eleni yw ‘newid ac addasu’."
        },
        {
            "text": "Mae Wythnos Wyddoniaeth Prydain 2025 wedi cyrraedd, ac felly mae’n amser rhyfeddu at bŵer trawsnewidiol gwyddoniaeth yn ein bywydau bob dydd."
        },
        {
            "text": "Yn yr ASB, byddwn yn anrhydeddu Wythnos Wyddoniaeth Prydain drwy ddathlu menywod mewn gwyddoniaeth, cynnal gweminar Cnoi Cil a rhannu’r wybodaeth ddiweddaraf am un o’n rhaglenni ymchwil cydweithredol mwyaf hyd yma. Hefyd, mae gennym ni gwis i chi brofi faint rydych chi’n ei wybod am ein hymchwil anhygoel!"
        },
        {
            "text": "Thema Wythnos Wyddoniaeth Prydain eleni yw ‘newid ac addasu’, ac mae hyn yn cyd-fynd yn berffaith ag un o nodau craidd yr ASB, sef defnyddio’r wyddoniaeth a’r dystiolaeth orau sydd ar gael i lywio ein polisïau a’n penderfyniadau. Mae newid yn rhan anochel o’r dirwedd fwyd, wedi’i ysgogi gan ffactorau fel datblygiadau technolegol, dewisiadau defnyddwyr, a heriau byd-eang. Yn yr ASB, rydym yn deall pwysigrwydd addasu i’r newidiadau hyn i sicrhau bod ein system fwyd yn parhau’n ddiogel, yn wydn ac yn gynaliadwy."
        },
        {
            "heading": 4,
            "text": "Addasu i heriau newydd"
        },
        {
            "text": "Drwy gydol ein hanes 25 mlynedd, rydym wedi datblygu ein dull a’n strategaethau yn barhaus i gwrdd â heriau newydd. Mae enghreifftiau gwych o hyn yn cynnwys ein gwaith yn asesu risgiau mwyaf newid yn yr hinsawdd o safbwynt diogelwch bwyd, a datblygu dulliau profi creadigol newydd i helpu i nodi bwyd wedi’i ddifwyno."
        },
        {
            "text": "Mae cael y data a’r dystiolaeth wyddonol ddiweddaraf yn ein galluogi i nodi mathau o fwyd sydd mewn perygl, a allai wedyn beri risgiau o ran alergenau, dilysrwydd, cyfansoddiad, halogion a labelu. Er enghraifft, mae ein Rhaglen Samplu Gwyliadwriaeth Genedlaethol yn cydlynu gwaith samplu a phrofi ledled Cymru, Lloegr a Gogledd Iwerddon i sicrhau bod ein bwyd yn ddiogel. Mae canlyniadau’r rhaglen hon yn darparu gwybodaeth hanfodol ar gyfer asesiadau risg a phenderfyniadau polisi, gan ein helpu i sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Un o nodweddion allweddol y rhaglen hon yw’r ffocws ar addasu i fygythiadau newydd yr ydym yn eu hwynebu, ym mhob rhan o’r dirwedd fwyd."
        },
        {
            "heading": 4,
            "text": "O blaid arloesedd"
        },
        {
            "text": "O archwilio’r defnydd o blockchain ar gyfer olrhain bwyd i ymchwilio i’r defnydd o ddeallusrwydd artiffisial yn y system fwyd, rydym mewn cyfnod hollbwysig mewn hanes wrth i dechnoleg arloesol newid y ffordd rydym yn meddwl am ddiogelwch bwyd."
        },
        {
            "text": "Mae croesawu arloesedd hefyd wrth wraidd ein cais llwyddiannus diweddar (mewn cydweithrediad â Safonau Bwyd yr Alban) i gynnal rhaglen blwch tywod ar gyfer cynhyrchion a wneir drwy feithrin celloedd (CCPs). Cafodd y blwch tywod ei lansio’n swyddogol ar 10 Mawrth, a’r nod yw casglu tystiolaeth drylwyr ar CCPs a’r technolegau a ddefnyddir i’w cynhyrchu, gan gynorthwyo ein proses asesu diogelwch. Mae’r gwaith hwn yn enghraifft o’n hymrwymiad i gadw ar y blaen o ran tystiolaeth wyddonol sy’n ein helpu i ddiogelu’r cyhoedd, gan sicrhau ein bod yn cadw i fyny â’r dirwedd fwyd esblygol ac nad ydym yn rhwystro cynnydd. Ac rydym yn gwneud hyn i gyd gan gadw defnyddwyr yn ddiogel ar yr un pryd."
        },
        {
            "text": "Ac wrth i un rhaglen arloesol a chydweithredol dan arweiniad yr ASB ddechrau, bydd rhaglen arall yn dod i ben! Bydd rhaglen PATH-SAFE (Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd) yn dod i ben ddiwedd mis Mawrth. Gwnaeth y rhaglen hon, a ariannwyd gan Gronfa Canlyniadau a Rennir y Trysorlys, brofi dulliau newydd o fonitro ac olrhain pathogenau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd cysylltiedig yn y system bwyd-amaeth. Mae rhaglen PATH-SAFE wedi gweithio gyda mwy na 65 o wahanol sefydliadau ac wedi cefnogi 30 o brosiectau gwahanol. Cadwch eich llygaid ar agor yr wythnos hon am bostiad gan dîm PATH-SAFE, yn ymchwilio i fanylion y rhaglen nodedig hon."
        },
        {
            "heading": 4,
            "text": "Dathlu Wythnos Wyddoniaeth Prydain"
        },
        {
            "text": "Mae Wythnos Wyddoniaeth Prydain hefyd yn gyfle gwych i ni gyd fyfyrio ar sut y gallwn groesawu’r syniad o “newid ac addasu” yn ein bywydau ein hunain. Boed yn mabwysiadu arferion bwyd mwy cynaliadwy, yn cael yr wybodaeth ddiweddaraf am ddiogelwch bwyd, neu’n cefnogi ymchwil wyddonol, mae gan bob un ohonom ran i’w chwarae wrth lunio dyfodol iachach a mwy diogel."
        },
        {
            "text": "Os oes gennych ddiddordeb yn hyn, byddwn yn eich annog i gofrestru ar gyfer Cylchlythyr Gwyddoniaeth yr ASB i gael diweddariadau rheolaidd am wyddoniaeth yr ASB. Gallwch hefyd ymuno â’n cyfres seminarau ‘Cnoi Cil, lle rydym yn cynnal gweminarau byw ar bynciau sy’n cyd-fynd â blaenoriaethau ymchwil yr ASB. Peidiwch ag anghofio cofrestru ar gyfer ein sesiwn yn trafod ffliw adar yr wythnos hon! Neu cofrestrwch i ymuno â‘n rhestr bostio i gael gwahoddiadau i ddigwyddiadau Cnoi Cil yn y dyfodol."
        }
    ]
}