{
    "url": "https://ukhsa.blog.gov.uk/2025/03/11/changes-to-health-protection-notification-regulations/",
    "title": "Changes to health protection notification regulations (NOIDs)",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2025-03-11T12:23:13+01:00",
    "content": [
        {
            "text": "From 6 April 2025, we’re expanding the list of pathogens that Registered Medical Professionals and laboratories in England must notify us about."
        },
        {
            "text": "The changes will strengthen local and national surveillance and support a prompt response to outbreaks of infectious diseases."
        },
        {
            "text": "In this blog post, we will provide more information on the changes and important links."
        },
        {
            "heading": 2,
            "text": "The health protection notification regulations"
        },
        {
            "text": "Under the Health Protection (Notification) Regulations 2010 (HPNR), all doctors (registered medical practitioners) are required to report notifiable diseases to the Proper Officer of the local authority (usually a UK Health Security Agency regional team)."
        },
        {
            "text": "There is also a legal requirement for diagnostic laboratories that process human samples in England to report certain pathogens to UKHSA."
        },
        {
            "text": "Reporting of notifiable disease is a critical public health tool which informs local and national surveillance of serious infectious diseases. Notification allows us to take prompt public health action to prevent and control Infections. You can learn about the full list of notifiable diseases here."
        },
        {
            "heading": 2,
            "text": "Changes for Registered Medical Professionals in England"
        },
        {
            "text": "In addition to the existing infections, from 6 April 2025, medical professionals must notify us if they suspect a patient has any of the following:"
        },
        {
            "text": "As previously, RMPs can notify us here."
        },
        {
            "text": "Changes for laboratories"
        },
        {
            "text": "Laboratories that test human samples in England will be required to report an additional 10 causative agents from 6 April 2025. These are:"
        },
        {
            "text": "Diagnostic labs can still notify us here."
        },
        {
            "text": "Last year, an electronic NOIDs system was rolled out, allowing medical professionals to notify suspected cases via an online form. Pilot data has shown that this has reduced notification time by 50%."
        },
        {
            "heading": 2,
            "text": "Expanding the list of notifiable diseases"
        },
        {
            "text": "Together with the Department of Health and Social Care, we assessed surveillance capabilities for current and emerging infectious diseases and made recommendations for updating the regulations, to strengthen local and national surveillance. These changes follow a public consultation on updating the legislation."
        },
        {
            "heading": 2,
            "text": "Using the data"
        },
        {
            "text": "Some notifications require immediate public health action from our Health Protection Teams – for instance to provide antibiotics, vaccination or isolation advice to contacts. Other notifications strengthen our surveillance at local and national level and allow us to assess the impact of different public health interventions, such as vaccine programmes."
        },
        {
            "heading": 2,
            "text": "The impact on patients"
        },
        {
            "text": "Information shared with our teams for this purpose is confidential and protected by General Data Protection Regulations (GDPR). The information is to inform public health response, and understanding of how diseases spread and how we can prevent them."
        },
        {
            "text": "A full guide to what should be notified and when can be found on GOV.UK."
        }
    ]
}