{
    "url": "https://mhclgmedia.blog.gov.uk/2025/03/11/coverage-on-compulsory-purchase-reforms/",
    "title": "Coverage on compulsory purchase reforms",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-03-11T15:27:39+00:00",
    "content": [
        {
            "text": "Reports today misleadingly allege that farmers will be targeted and forced to sell their land for less than their potential value under compulsory purchase reforms in the government’s Planning and Infrastructure Bill."
        },
        {
            "text": "The government’s changes are not targeting farmers or any particular landowners. There is nothing in the Bill that changes the core principles of compulsory purchase. It must be used only where negotiations have not succeeded and where there is a compelling case in the public interest."
        },
        {
            "text": "What the Bill will do is ensure that where these tests are met, the process will be more efficient and effective so local authorities can help deliver the homes and infrastructure, including schools and GP surgeries, that local communities desperately need."
        },
        {
            "text": "While it will be for individual authorities to decide whether to use these powers on sites to deliver their housing schemes, the government expects this will be used most on urban brownfield sites based on the high-level evidence submitted to the government’s recent consultation."
        },
        {
            "text": "The reforms are aimed at ensuring quicker decisions on compulsory purchase orders can be made, reducing the administrative costs of undertaking the process, and striking a balance to make sure compensation paid to landowners is not excessive but they are still paid a fair price."
        },
        {
            "text": "Changes being made to the loss payments regime will also benefit tenant farmers as they’ll receive a fairer share of compensation to reflect any inconvenience they may experience from the compulsory purchase process."
        },
        {
            "text": "From the outset the government has been clear that planning reforms will not come at the expense of the environment or food production."
        },
        {
            "text": "Speaking on the morning round today, Housing and Planning Minister Matthew Pennycook said:“To deliver the homes and infrastructure we need, we do need to unlock land in the right places. It will be local authorities who make greater use of compulsory purchase powers."
        },
        {
            "text": "“We are not setting out to target agricultural land and will ensure prime agricultural land and food security is protected."
        },
        {
            "text": "“But we think it’s right these powers are more widely used, and it will be for local authorities to make the decisions about what land is appropriate for those powers to be used on.”"
        }
    ]
}