{
    "url": "https://gott.blog.gov.uk/2025/03/11/meet-the-trailblazer-claire-kerridge/",
    "title": "Meet the Trailblazer: Claire Kerridge",
    "authors": [
        "avneetkaur"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-03-11T08:00:00+00:00",
    "content": [
        {
            "text": "by Claire Kerridge "
        },
        {
            "heading": 2,
            "text": "Tell us about a Knowledge Asset innovative project you’re proud of and why?"
        },
        {
            "text": "Our focus in cell and gene therapy research led us to explore the necessity for a UK-based, not-for-profit induced pluripotent stem cell repository."
        },
        {
            "text": "This resource could be used for a range of downstream applications, including the future development and manufacture of novel therapies. From our in-house research and expertise, we understood the manufacturers’ need for readily available, well-characterised cells, from trusted sources. "
        },
        {
            "text": "However, we lacked means of assessing wider market interest or competition across the field. We approached GOTT’s PRIMA Accelerator programme at an early concept stage of our project, or as I came to learn throughout PRIMA, at technology readiness level 1."
        },
        {
            "heading": 2,
            "text": "At what point and why did you realise you wanted to take this project forward?"
        },
        {
            "text": "Through working with the PRIMA team, both during focused away days and joint consultancy calls, we were able to formally identify our problem area and develop an approach to solving this. This was achieved through drafting a highly-tailored value proposition canvas. "
        },
        {
            "text": "The time spent on this work, surrounded by expert guidance and conversation with fellow PRIMA participants, highlighted that we had both a defined problem area and that our early-stage Knowledge Asset, with some development, could address many of the issues within the field."
        },
        {
            "text": "While this was a hugely valuable piece of work, following internal discussions, we agreed not to pursue the project through to completion. Despite this pivot, we were still able to complete the PRIMA programme, receive vital feedback, and develop a range of transferable skills, which we are currently applying to other projects."
        },
        {
            "text": "Our journey through PRIMA really emphasises that the project you enter with doesn’t really matter. The programme is designed to be adaptable, so no matter what happens, you will still develop and utilise a huge range of transferable skills."
        },
        {
            "heading": 2,
            "text": "How has the support from GOTT made a difference to your project?"
        },
        {
            "text": "GOTT has been crucial to our success as a team throughout the PRIMA programme, providing expert support and advice during the bootcamps. "
        },
        {
            "text": "The GOTT team have continued to support other projects, including highlighting funding options and providing cross-governmental connections, for input into future work programmes. "
        },
        {
            "text": "Furthermore, GOTT has highlighted to us the importance of sharing our newly acquired knowledge with our wider department and agency, to ensure a legacy from the programme is retained across our area."
        },
        {
            "heading": 2,
            "text": "What’s been the biggest challenge to date?"
        },
        {
            "text": "Resource is always a challenge in scientific research. Our work is often costly with a complex range of outputs, which can be challenging to fund as a not-for-profit agency. "
        },
        {
            "text": "However, across the MHRA science campus, there are several Knowledge Assets which could be further developed in the future. Understanding the mechanisms behind the development of Knowledge Assets was a key driver to our engagement with the PRIMA programme."
        },
        {
            "heading": 2,
            "text": "What one piece of advice would you give to budding trailblazers in the public sector?"
        },
        {
            "text": "Take the time to build a wide multidisciplinary network within your chosen field through participating in programmes such as PRIMA and attending other Government Science and Engineering or government-wide training events."
        },
        {
            "text": "This will not only provide you with collaborators to draw upon for future projects but will also give you the chance to gain confidence in skills such as pitching and presenting your innovative ideas in a supportive and more informal setting. Sometimes, that might mean taking part in an opportunity or project you feel slightly underprepared for."
        },
        {
            "heading": 2,
            "text": "What’s the best part of your job?"
        },
        {
            "text": "It is very hard to pick a singular ‘best part’ because I enjoy the huge variety of work within my role. "
        },
        {
            "text": "This includes working with an incredible team of scientists to conceptualise and manage regulatory focused R&D and standards projects, participating in a range of external committees and contributing to the writing of manufacturing guidance, which will help harmonise future products. However, what drives me most is the contribution we as government scientists at the MHRA can make to benefit future patient and public health."
        }
    ]
}