{
    "url": "https://naturalengland.blog.gov.uk/2025/03/11/new-study-launched-into-relationship-between-people-and-nature/",
    "title": "Study launched into relationship between people and nature",
    "authors": [
        "Natural England",
        "Ruth Lamont"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Environmental Improvement Plan",
        "Evidence",
        "Green Infrastructure",
        "Monitoring",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves",
        "Wildlife"
    ],
    "pub_date": "2025-03-11T11:33:14+00:00",
    "content": [
        {
            "text": "By Ruth Lamont, Principal Officer in Research Ethics, Knowledge into Practice, Chief Scientist’s Directorate, Natural England"
        },
        {
            "text": "Started in 2022, the RENEW project, led by the University of Exeter and funded by the Natural Environment Research Council, is a five-year programme of research to develop solutions to one of the major environmental challenges for humankind: the renewal of biodiversity."
        },
        {
            "text": "The wealth of plants and animals that are threatened with global extinction is a major concern. Biodiversity underpins human existence and RENEW is working to find ways that we can use the power of people—whether organisations, communities or individuals—to renew this essential life support system."
        },
        {
            "text": "Understanding how exposure to natural spaces and biodiversity renewal impacts people—their interactions with and attitudes towards nature, as well as their health and well-being—is an important part of this programme of work."
        },
        {
            "text": "Natural England have partnered with the RENEW programme to develop the ‘Renewing Biodiversity Longitudinal Survey’ (ReBLS for short). This will be the UK’s largest longitudinal study, allowing us to investigate how exposure to natural spaces and biodiversity renewal affects environmental attitudes, behaviours, health, and wellbeing over time. The protocol paper has just been published in People and Nature."
        },
        {
            "text": "ReBLS has begun to capture the experiences of ~18,000 people across England using the same questions around environmental attitudes, behaviours, health and well-being every year for three years. "
        },
        {
            "text": "People’s responses will be linked to spatial information allowing us to explore the influence of their local environments, time in nature and exposure to known biodiversity renewal activities, ranging from planting street trees in towns and cities to ‘(re-)wilding’ entire landscapes."
        },
        {
            "text": "\"One of our immediate priorities is to explore the level of support for biodiversity renewal efforts and how and why this varies. This will provide evidence to help decision makers understand what kind of interventions and policies might be acceptable. "
        },
        {
            "text": "Later, we will use the data to focus on how exposure to biodiversity renewal efforts, or other interactions with nature, might relate to how people feel about nature, and to health and well-being over time. "
        },
        {
            "text": "Co-funding from Natural England has meant we can explore these issues with a very large robust sample of the English population and investigate the usefulness of longitudinal data in addressing national priorities in the Environment Improvement Plan.” "
        },
        {
            "text": " - Dr Jo Garrett, Research Fellow at the European Centre for Environment and Human Health, University of Exeter."
        },
        {
            "text": "This longitudinal research aims to inform the government’s work and national indicators under its environmental improvement plans. By developing methodologies that can understand how changes in nature relate to outcomes for people over time, this can inform our understanding of the impacts of environmental change."
        },
        {
            "text": "ReBLS builds on existing cross-sectional surveys like the Monitor of Engagement with the Natural Environment (MENE) and People and Nature Surveys (PANS) which have been providing key statistics around people and nature for many years."
        },
        {
            "text": "This survey has undergone an extensive 18-month development process, led by Dr Ben Phillips at the University of Exeter and in collaboration with Natural England. ReBLS is administered by YouGov."
        },
        {
            "text": "By partnering in projects such as this, we aim to increase NE’s research capacity and draw upon the extensive expertise of our partners to ensure we are gathering the best possible evidence to inform biodiversity renewal."
        },
        {
            "text": "For more information about the project, contact: renew@exeter.ac.uk"
        }
    ]
}