{
    "url": "https://educationhub.blog.gov.uk/2025/07/best-start-family-hubs-what-parents-need-to-know/",
    "title": "Best Start Family Hubs: what parents need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Babies",
        "early years",
        "Families"
    ],
    "pub_date": "2025-07-07T16:48:03+01:00",
    "content": [
        {
            "text": "Giving children the best start in life shouldn't depend on your postcode. That's why we are rolling out Best Start Family Hubs across the country.  These hubs are just one part of a wider Best Start in Life strategy, where we’ll be spending £1.5bn over the next three years to expand family services, make early education and childcare more accessible and affordable, and improve quality across the early years system. Here's what you need to know about the hubs and how they connect to other support for families. "
        },
        {
            "heading": 3,
            "text": "What are Best Start Family Hubs? "
        },
        {
            "text": "Best Start Family Hubs will be local hubs where families can access a range of services all in one place. Think of them as a 'one-stop shop' for families with children from pregnancy through the early years and beyond. "
        },
        {
            "text": "Whether its free classes, events and activities, help with your children before they start school or finance and housing advice - the hubs will either provide these services directly or connect you to the right local support. "
        },
        {
            "heading": 3,
            "text": "Why are they being created? "
        },
        {
            "text": "Many parents tell us they find it difficult to know where to go for help with their children. Services can feel disconnected and hard to navigate, especially if your child has additional needs. Some families can’t access help at all. Many children’s centres have closed or cut back services. At the same time, health services have faced new pressures such as with fewer health visitors and lower vaccination rates.  "
        },
        {
            "text": "Research shows that early support makes a real difference – children who had access to Sure Start centres were more likely to achieve better GCSE results and had improved health outcomes. "
        },
        {
            "heading": 3,
            "text": "When will there be a Best Start Family Hub near me? "
        },
        {
            "text": "The government is investing over £500 million to create a network of up to 1,000 Best Start Family Hubs across every local authority in England by 2028.  "
        },
        {
            "text": "If you already have a Family Hub or children's centre in your area, it will continue to operate and may be enhanced under this new programme. "
        },
        {
            "heading": 3,
            "text": "What services will be available at the hubs? "
        },
        {
            "text": "Services will vary depending on local needs, but you can expect: "
        },
        {
            "text": "For families with children who have additional needs, each hub will have a trained professional to help you navigate services and connect with local early years settings and health services.  "
        },
        {
            "heading": 3,
            "text": "How will the hubs support children with SEND? "
        },
        {
            "text": "Each Best Start Family Hub will have a children and family services professional trained to support children with additional needs. They'll help: "
        },
        {
            "heading": 3,
            "text": "What if I can't get to a hub in person? "
        },
        {
            "text": "A new Best Start digital service is being created that will give you quick access to trusted advice on parenting, child development. You'll be able to check your eligibility for childcare entitlements and connect to your local hub. This will eventually link to the NHS app.  "
        },
        {
            "heading": 3,
            "text": "Will the hubs connect with other childcare and early education services? "
        },
        {
            "text": "Yes, the hubs will help you find and access the right childcare for your family.The hubs will also work closely with local nurseries, childminders and schools to make sure children get consistent support, especially those with additional needs who might need extra help when moving between different settings. "
        },
        {
            "text": "The hubs are just one part of wider support for families. Alongside them, eligible working parents can get 30 hours of funded childcare from when their child is 9 months old (saving up to £7,500 a year), thousands of new nursery places are being created in schools, and there's extra funding for disadvantaged children through the Early Years Pupil Premium. All these changes are part of the Best Start in Life Strategy – our plan to make sure every child get the best possible start in life. "
        }
    ]
}