{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/07/07/civil-service-care-leavers-internship-scheme-2025/",
    "title": "How the Care Leavers Internship Scheme Changed My Career Path",
    "authors": [
        "Shannon Symington"
    ],
    "categories": [
        "Care leavers"
    ],
    "pub_date": "2025-07-07T09:27:41+01:00",
    "content": [
        {
            "heading": 2,
            "text": "My journey to the Civil Service"
        },
        {
            "text": "My name is Shannon Symington, and I am 26 years old. Before my career in the Civil Service, I was a retail worker at Primark in Newcastle and in my final year of university. "
        },
        {
            "text": "I didn’t know what I wanted to do career-wise after graduation. My social worker sent me the advert for the Civil Service Care Leavers Internship Scheme as she believed it was something I would thrive in. I was successful at the job interview and secured a role at HMRC where I was made a permanent member of staff after my first year."
        },
        {
            "heading": 2,
            "text": "Adapting to office life"
        },
        {
            "text": "When I first started, I felt very overwhelmed as office work was new to me. I arrived at the office on my first day and a member of my team came to collect me. She was lovely and I knew we would get along well. "
        },
        {
            "text": "Some of the tasks I completed as part of my role included working alongside service managers to complete incident forms and resolving problems to maintain their live services. Some of these services included tax-free childcare and making tax digital."
        },
        {
            "heading": 2,
            "text": "Support networks and professional development"
        },
        {
            "text": "My team were very supportive with my transition into office working and helped me to learn how to use new systems. To further help my learning and development, I managed to secure a mentor through the HMRC ‘Stride’ mentoring programme. This has helped me to develop and improve my current skills such as presenting and public speaking. "
        },
        {
            "text": "I am also now part of the Civil Service Care Leavers Network which I love as it gives me the opportunity to understand the journey of other care leavers in the Civil Service. It has also allowed me to see what other opportunities may be available to me in the future."
        },
        {
            "heading": 2,
            "text": "Why you should apply for the Care Leavers Internship Scheme"
        },
        {
            "text": "I would 100% recommend all care leavers to join the Civil Service through this scheme. This is the best life decision I have made, and I am grateful to have had so many opportunities while in my role. "
        },
        {
            "text": "This is a workplace where I am happy, supported, and appreciated, and there are plenty of career opportunities for me to choose from."
        },
        {
            "heading": 2,
            "text": "Take the next step in your career journey"
        },
        {
            "text": "Are you a care leaver looking for meaningful employment with excellent support and progression opportunities? The Care Leavers Internship Scheme could be your pathway to a fulfilling career in the Civil Service."
        },
        {
            "text": "Visit the Civil Service Care Leavers Internship Scheme website to learn more about the application process and upcoming opportunities. Your journey to a rewarding career starts with one simple application!"
        }
    ]
}