{
    "url": "https://defrafarming.blog.gov.uk/2025/07/07/fetf-2025-closing-soon-still-time-to-apply/",
    "title": "FETF 2025 closing soon: still time to apply",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2025-07-07T10:57:03+01:00",
    "content": [
        {
            "text": "If you're thinking about investing in new kit, there’s still time to apply for the Farming Equipment and Technology Fund 2025. "
        },
        {
            "text": "Applications are open now and will close at midday on 10 July. "
        },
        {
            "text": "The fund is for farmers, growers, foresters and related contractors. It helps pay for items that can improve productivity, manage slurry more effectively, and support animal health and welfare. "
        },
        {
            "heading": 2,
            "text": "What you can apply for "
        },
        {
            "text": "The fund is split into 3 themes: "
        },
        {
            "text": "You can apply for between £1,000 and £25,000 per theme, and apply under more than one. Here are just a few examples of what’s available: "
        },
        {
            "text": "Productivity, you could apply for a direct drill, robotic or camera-guided inter-row hoes, or equipment to help with more precise crop management. "
        },
        {
            "text": "Slurry Management, eligible items include slurry separators, dribble bars, and robotic slurry pushers that help with low-emission spreading and better storage. "
        },
        {
            "text": "Animal Health and Welfare, there’s support for things like mobile sheep handling units, cattle squeeze crushes, or even static cow brushes to improve livestock welfare. "
        },
        {
            "text": "Each theme has a full list of equipment you can choose from, with fixed grant amounts. The percentage of the cost covered varies by item, but most are around 40 to 50%. "
        },
        {
            "heading": 2,
            "text": "What to know before you apply "
        },
        {
            "text": "Before you apply, read the guidance on GOV.UK.  "
        },
        {
            "text": "We also hosted a webinar which explains what the fund offers and how to apply. "
        },
        {
            "text": "The post also includes responses to questions that we didn’t have time to answer during the session.  "
        },
        {
            "text": "This is a competitive grant. That could mean that not all applications will be successful, and you may not get the full amount you apply for. But there’s £46.7 million available in this round, so it’s worth checking if there’s something that could help you. "
        },
        {
            "text": "Good luck with your application.  "
        }
    ]
}