{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/07/islamophobia-working-group-definition/",
    "title": "Islamophobia Working Group Definition ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Faith"
    ],
    "pub_date": "2025-07-07T14:59:36+01:00",
    "content": [
        {
            "text": "In February, the government established an independent working group, chaired by Dominic Grieve KC, to advise on a definition of anti-Muslim hatred/Islamophobia. This step has been taken in response to the concerning rise in anti-Muslim hate crime, which has reached record levels. "
        },
        {
            "text": "According to the most recent statistics, two in five police-recorded religious hate crimes were directed at Muslims, highlighting the urgent need for a clear and robust framework to address this form of hatred. The group’s work will support wider and ongoing government-led efforts to tackle religiously motivated hate crime – delivering on the government’s Plan for Change mission for safer streets. "
        },
        {
            "text": "The government, and the working group’s published terms of reference, make clear that any proposed definition must be fully compatible with the enduring and fundamental right of British citizens to freedom of speech and expression. This includes the right to criticise, express dislike of, or insult religions, as well as the beliefs and practices of their adherents. The government has made clear it will not compromise on this principle which is essential in a democratic society. "
        },
        {
            "text": "The group is operating independently and will provide Ministers with evidence-based advice, in line with the terms of reference already made public. Their work will be informed by a wide range of perspectives and expertise, ensuring that any recommendation is not only thoughtful and principled, but also grounded in the lived experiences and realities faced by communities across the country.  "
        },
        {
            "text": "By drawing on diverse insights, the working group aims to develop advice for ministers that is both practically effective and socially sensitive - capable of helping to address the rise of anti-Muslim hatred while upholding the democratic values that underpin our society."
        },
        {
            "text": "An MHCLG spokesperson said: "
        },
        {
            "text": "“We are absolutely committed to defending freedom of speech, and any proposed definition must be compatible with the right to freedom of speech and expression. "
        },
        {
            "text": "“The independent working group has been engaging extensively with a wide range of communities and will provide independent, evidence-based advice to Ministers.” "
        },
        {
            "text": "As mentioned, the working group is seeking views from a wide range of audiences as part of its work - please see here for more information on the call for evidence: Working Group on Anti-Muslim Hatred/Islamophobia Definition - GOV.UK"
        }
    ]
}