{
    "url": "https://defraenvironment.blog.gov.uk/2025/07/07/locally-rooted-community-shaped-launch-of-the-isle-of-wight-and-cornwall-isles-of-scilly-local-nature-recovery-strategies/",
    "title": "Locally rooted, community shaped: launch of the Isle of Wight and Cornwall & Isles of Scilly Local Nature Recovery Strategies",
    "authors": [
        "Ben Wyatt",
        "Stephanie Evans"
    ],
    "categories": [
        "Community",
        "Land use",
        "Local Nature Recovery Strategies"
    ],
    "pub_date": "2025-07-07T09:49:17+01:00",
    "content": [
        {
            "text": "The recent publication of the Local Nature Recovery Strategies (LNRS) for Cornwall and Isles of Scilly and the Isle of Wight marks a major milestone in our collective mission to restore nature across England. They both showcase what can be achieved when local communities, experts and organisations work together to agree where action and investment in nature should be focused."
        },
        {
            "text": "48 responsible authorities have been appointed to develop their strategies, covering the whole of England with no gaps or overlaps. LNRSs are led by local government and shaped by communities and local partners but informed by our wider national environmental targets. They provide a roadmap for cost-effective, nature-based solutions that deliver meaningful, lasting change for both people and the planet."
        },
        {
            "text": "So far, four of the 48 strategies have been published – with the remainder expected to be published this year. All the strategies must prioritise and target nature recovery action to address biodiversity loss and issues experienced by local people that are exacerbated by climate change, including flooding, poor water quality and unequal access to green space."
        },
        {
            "text": "By agreeing the most impactful locations for nature recovery, LNRSs guide action and investment in nature at every scale - from community-led initiatives to landscape-scale habitat restoration projects. Ultimately, they will create a national framework for nature recovery."
        },
        {
            "text": "LNRSs are designed to be clear and accessible, to help everyone understand what action for nature should be taken, where, and why. Both newly published strategies feature interactive maps, videos and other visually engaging materials, providing stand-out examples of engaging content that can inspire and be followed by other responsible authorities in their own strategies."
        },
        {
            "text": "Solving local challenges through community investment and nature-based solutions"
        },
        {
            "text": "The Cornwall and Isles of Scilly LNRS is informing the development of Cornwall’s Local Investment in Natural Capital programme. This initiative brings together a wide range of partners to co-design, fund and deliver nature recovery projects that align with local priorities."
        },
        {
            "text": "As part of the programme, Cornwall council, as a responsible authority, has engaged with around 70 potential funders and investors to support nature recovery projects, including the reintroduction of water voles – an important species whose burrowing and grazing creates a wealth of habitats for others."
        },
        {
            "text": "The LNRS will provide a critical framework for the County’s emerging Nature Market, that will connect businesses with landowners, enabling them to trade in ecosystem services. Buyers can fund the outcomes they need – such as carbon storage or flood mitigation – while suppliers deliver projects that provide those services."
        },
        {
            "text": "The LNRS will also play an important role in Cornwall’s “Love Where You Are” initiative. Run via a trusted Crowdfunder platform, it channels business donations into grassroots nature recovery efforts. Guided by the LNRS, these efforts are targeted, coordinated, and measurable - delivering real benefits to both people and nature."
        },
        {
            "text": "This includes the new 'Nurture Garden' at Newquay Community Garden. Created by and for the local community, it will deliver LNRS priorities by promoting health, biodiversity, and education - offering a place that supports both people and nature."
        },
        {
            "text": "The Isle of Wight LNRS recognises the importance of green infrastructure to urban communities. It identifies actions that enable nature to thrive alongside sustainable development. This includes integrating nature into all new developments to provide climate resilience, while nest boxes, seasonal ponds, deadwood stores and compost heaps create a diverse range of habitats to support an array of species."
        },
        {
            "text": "The Isle of Wight LNRS shows how nature-based solutions can address urgent challenges caused by climate change. By working with the natural flow of rivers and floodplains and creating space for wetlands to expand, the strategy identifies action needed to help protect communities from flooding."
        },
        {
            "text": "The potential of the Island’s hidden resources of deep peat to both biodiversity and climate resilience are also highlighted, addressing nature recovery and carbon capture in a single approach. Already, the Isle of Wight LNRS is informing exciting bids for landscape-scale nature recovery funding, bringing growth to rural and urban Island communities."
        },
        {
            "text": "Co-designing a greener, fairer future"
        },
        {
            "text": "Cross sectoral collaboration is essential to ensure that LNRSs draw on the full range of evidence and expertise available. Natural England is the lead support on behalf of the Defra group, with local advisers bringing together technical advice and insights from across Natural England, the Environment Agency, the Forestry Commission, and central Defra."
        },
        {
            "text": "Both the Cornwall and Isles of Scilly LNRS and the Isle of Wight LNRS were created in collaboration with local partners and communities. On the Isle of Wight, the Council ran webinars, workshops, surveys, and public events – from garden fairs to sheepdog trials – to engage the public. This inclusive and often innovative process has ensured that the strategy reflects the needs of the community, especially those working with the land."
        },
        {
            "text": "In particular, the Isle of Wight Council have recognised the essential role of farming and the land management sector in reversing nature’s decline. As a result, they have worked closely with many representative organisations to ensure the strategy works for the farming community."
        },
        {
            "text": "Models for future action"
        },
        {
            "text": "We congratulate everyone involved in developing the LNRSs for Cornwall and Isles of Scilly, and the Isle of Wight. Alongside the other strategies published so far, they are already serving as models for how local action, rooted in community values and driven by partnerships, can shape a better future."
        },
        {
            "text": "We look forward to seeing the positive impact they will have in the years to come - and the inspiration they offer to the remaining 44 LNRSs in development across the country."
        },
        {
            "text": "Find out more about your Local Nature Recovery Strategy - and help shape the future of nature recovery in your area."
        }
    ]
}