{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/07/07/taking-policy-design-to-a-global-public-audience/",
    "title": "Taking policy design to a global public audience",
    "authors": [
        "Andrew Knight",
        "Elli-ana Morley"
    ],
    "categories": [
        "Case study",
        "Events",
        "PublicPolicyDesign"
    ],
    "pub_date": "2025-07-07T10:38:44+01:00",
    "content": [
        {
            "text": "Last month, the UK Civil Service took part in the London Design Biennale for the first time - showcasing policy design to a global public audience."
        },
        {
            "text": "Our pavilion, designed and delivered by the cross-government Policy Design Community with support from the Government Digital Service, brought together designers from across disciplines. Together, we demonstrated how design can support better public outcomes."
        },
        {
            "heading": 2,
            "text": "Building design capability across government"
        },
        {
            "text": "As well as sharing our work publicly, we welcomed around 200 government designers to the exhibition throughout June. Many visited as part of organised learning and development groups - creating opportunities to connect with peers, share experiences and take inspiration back to their day jobs."
        },
        {
            "text": "One designer told us:"
        },
        {
            "text": "Another added:"
        },
        {
            "heading": 2,
            "text": "Exploring serious games for policy challenges"
        },
        {
            "text": "At the heart of the UK pavilion was a series of live, interactive workshops, open to the public and running throughout the month. Every session sold out ...and demand was high enough for us to run additional spontaneous sessions too."
        },
        {
            "text": "The workshops showcased how serious games - structured, purpose-driven games - can help co-design effective public policy. The approach builds on Policy Lab’s 2022 collaboration with game designer Matteo Menapace, which helped create a sustainable fisheries management plan for sea bass through gameplay."
        },
        {
            "text": "This year, our “Serious Game to Save the Planet” workshops invited participants to explore complex climate challenges through collaborative play. Over 100 people from across the world took part, including professionals from government, academia, journalism, science, advertising and design."
        },
        {
            "text": "Using serious games, we created a safe, engaging space where people could explore trade-offs, challenge assumptions, and listen to diverse perspectives. For complex, high-stakes policy challenges - especially those impacting many communities - this approach offers a powerful way to co-design solutions."
        },
        {
            "heading": 2,
            "text": "Celebrating design leadership in government"
        },
        {
            "text": "We also hosted a special reception at Somerset House, bringing together 50 design leaders from across the Civil Service. The evening was a chance to celebrate their work and share early plans for our new design school …set to launch later this year."
        },
        {
            "text": "Speakers from government and partner organisations reflected on the growing role of design in shaping effective, user-centred policies and services. Guests were invited to feed into the emerging direction of the school, helping shape its future as a shared, cross-government offer."
        },
        {
            "text": "It was a brilliant opportunity to connect, reflect and look ahead to the next chapter for design in government - not to mention enjoy a moment of summer sunshine on the Somerset House terrace."
        },
        {
            "heading": 2,
            "text": "Powered by our community"
        },
        {
            "text": "This was a milestone month for the Policy Design Community - and it wouldn’t have been possible without the incredible efforts of our volunteer team."
        },
        {
            "text": "From planning and curation to delivery and facilitation, community members gave their time, energy and expertise to make it all happen."
        },
        {
            "text": "We want to thank everyone who supported the event - especially our brilliant workshop team: Andrew Knight (curator), Elli-ana Morley (event manager), Dejana Draganic, Mandy Gao, Tessa Fearnley, Qing Wang, Yemi Medeyinlo, Nia Thomas, Komal Pahwa, Stuart Bolton, Laura Pearson, William Milton, Sandeep Singh, and many more who’ve helped shape and grow this work over the years. Plus Policy Lab for producing a film that gives insight into how public design work in practice."
        },
        {
            "text": "Special thanks also to the London Design Biennale team, and their partners at Frog Design, for making the UK Civil Service’s first Biennale pavilion such a success."
        }
    ]
}