{
    "url": "https://naturalengland.blog.gov.uk/2025/07/07/unlocking-nature-for-all/",
    "title": "Unlocking Nature for All",
    "authors": [
        "Val Woods"
    ],
    "categories": [
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "National Nature Reserve",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2025-07-07T13:34:27+01:00",
    "content": [
        {
            "text": "By Val Woods, Centre for Outdoor Accessibility Training (COAT) Lead Officer, Natural England"
        },
        {
            "text": "I consider myself fortunate to be working on a fantastic project which is based at the beautiful Aston Rowant National Nature Reserve (NNR). I manage the Centre for Outdoor Accessibility Training - COAT for short; an easy acronym to remember as often needed for the British weather!"
        },
        {
            "text": " I am excited to be able to share our vision of increasing inclusion and accessibility to nature and the outdoors for everyone. Improving access to the outdoors is vitally important, because by increasing our connection to nature we can improve health and wellbeing on a national scale, drive nature’s recovery and contribute to a thriving economy for all."
        },
        {
            "heading": 4,
            "text": "Where are we and how it started"
        },
        {
            "text": "The reserve is perched on the northwestern scarp of the Chiltern Hills, within the Chilterns National Landscape in Oxfordshire. There is a wide variety of habitats of national importance within the 159-hectare site such as chalk grassland, mixed scrub and ancient beech woodland.  These diverse environments make the reserve special by supporting an amazing diversity of flower, bird and insect species. "
        },
        {
            "text": "The reserve is very popular with walkers for the spectacular views as well as the junipers, orchids, butterflies and kites, and can be visited via The Ridgeway National Trail which runs the length of reserve."
        },
        {
            "text": "The Aston Rowant team consider ourselves so lucky to have amazing volunteers who undertake reserve management tasks around the site, as well as weekly bird/butterfly surveys. It was one of our key volunteers, Tom Bindoff, formerly CEO of Centrewire, who originally approached the NNR staff with the vision of establishing COAT in 2018."
        },
        {
            "text": "Tom has been inspirational to me in my role managing and developing COAT.  I have benefited from his knowledge and leadership, so I am so delighted that his 45 years of dedication to promoting accessibility has been recognised by the Outdoor Recreation Network with a Lifetime Achievement Award."
        },
        {
            "heading": 4,
            "text": "What’s the purpose of COAT?"
        },
        {
            "text": "The Centre offers bespoke classroom training sessions in the legislation principles and standards associated with accessibility in the outdoors, together with a “hands-on” practical element at our field of gates and structures using our all-terrain mobility equipment. We show that inclusion should be about removing barriers for people of all shapes, abilities and ages to promote accessibility to green spaces – from urban parks through to wild nature reserves."
        },
        {
            "text": "The training is aimed at people and organisations who manage or advise on public access to the outdoors. Together with Pippa Langford, Natural England Principal in Recreation and Access, I have developed an integrated training programme with modules on the following topics:"
        },
        {
            "heading": 4,
            "text": "Research And Collaboration"
        },
        {
            "text": "The Centre was initially designed to demonstrate the use of infrastructure meeting the British Standard for improved countryside access; BS5709 Gaps, Gates & Stiles but as COAT is hosted by Natural England there is an inherent brief to instigate and develop research. "
        },
        {
            "text": "As part of this remit, collaborative research has been carried out with trialing, inventing and manufacturing accessible infrastructure furniture such as latches and handle designs. This is unique and invaluable since it ensures that the standard, whilst achieving the best outcomes for the public and farmers, remains deliverable by manufacturers."
        },
        {
            "text": "Raising awareness"
        },
        {
            "text": "We know that everyone cannot easily access the documents detailing legislation and best practice associated with accessibility information. There is much technical information to take in, which in itself can prove to be a barrier to raising awareness of these issues. "
        },
        {
            "text": "So, to reach as many people as possible and give them an understanding of the issues affecting parts of the community, we have created a series of three films in collaboration with Parks Trust volunteer Ambassadors and the British Horse Society which identify key points on best practice related to accessibility information on footpaths and bridleways."
        },
        {
            "text": "Do take a look at these three videos which are all available on Natural England YouTube:"
        },
        {
            "text": "Parts 2 and 3 are available here:"
        },
        {
            "text": "Unlocking Nature - Gaps, Gates & Stiles on Footpaths"
        },
        {
            "text": "Unlocking Nature - Gaps & Gates on Bridleways"
        },
        {
            "text": "I am thrilled that all our hard work in creating these films was rewarded by winning the 2025 Outdoor Recreation Network Award in the Category for Best Practice for Improving Access & Accessibility."
        },
        {
            "text": "If you would like to enquire about booking a training day or for further information contact: COAT@naturalengland.org.uk or speak to Val (Tel:07901309002)."
        }
    ]
}