{
    "url": "https://deframedia.blog.gov.uk/2023/01/09/a-hitchhikers-guide-to-floating-marine-debris/",
    "title": "A hitchhiker’s guide to floating marine debris",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "marine"
    ],
    "pub_date": "2023-01-09T11:02:29+00:00",
    "content": [
        {
            "text": "There has been both national and trade coverage in The Telegraph and AquaFeed surrounding our announcement on new research led by the Centre for Environment, Fisheries and Aquaculture Science (Cefas) and funded by Defra that sheds new light on invasive species ‘hitchhiking’ across the sea on floating marine debris."
        },
        {
            "text": "Invasive species are recognised as one of the greatest threats to marine biodiversity worldwide, second only to habitat loss, and cost the UK economy £120 million a year. The academic research report shows that, by adapting a model originally designed to predict the distribution of oil following an oil spill, Cefas scientists were able to uncover the origin of floating marine debris and track how invasive species enter UK waters."
        },
        {
            "text": "It is hoped this new modelling technique will enable the UK and other countries to more accurately track the movements of floating debris and help establish an early warning system to prevent and respond to any emerging threat of non-native species."
        },
        {
            "text": "With 80% of marine debris made up of plastics, and over 800 million tonnes of plastic ending up in our oceans each year, this research reiterates the importance of tackling global plastic pollution, supporting calls from Environment Secretary Thérèse Coffey at the UN Conference of Biological Diversity (CBD) COP15 last year for greater ambition and support to protect 30% of the world’s ocean by 2030."
        },
        {
            "text": "International Marine Minister Lord Benyon said:\n\n“This research sheds light on a lesser-known consequence of plastics and litter entering our ocean, with floating debris threatening valuable marine biodiversity by transporting invasive, non-native species into the UK."
        },
        {
            "text": "“It underlines the importance of global action that impacts our marine life and the UK is at the forefront of these efforts, mostly recently in championing calls to end plastic pollution by 2040.”"
        },
        {
            "text": "Dr. Peter Barry, Marine Ecology Scientist at Cefas and lead author of the report said:"
        },
        {
            "text": "“While this type of hitchhiking movement has been identified among various species and regions before, there is still a lot we don’t know about how invasive species enter our waters. A real challenge for scientists has been to identify where the hitchhikers have come from. This model allows us to retrace their journey to understand where and how an invasion pathway is operating”."
        },
        {
            "text": "“Although not all non-native species entering the UK will become established, those that do can be incredibly harmful for the environment. With the increase in marine litter in our seas, it’s important for us to understand how these species are being transported, and to identify areas most at risk to help prevent their spread”"
        }
    ]
}