{
    "url": "https://buyingforschools.blog.gov.uk/2023/01/09/buying-energy-and-energy-efficiency-goods-and-services/",
    "title": "Buying energy and energy efficiency goods and services",
    "authors": [
        "Dan Baker, Schools Commercial Team Category Lead"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-01-09T11:12:48+00:00",
    "content": [
        {
            "text": "In this blog post, Dan Baker, Schools Commercial Team Category Lead, gives an overview of the DfE support available to help you buy energy and energy efficiency goods and services for your school. "
        },
        {
            "heading": 2,
            "text": "Buying energy for your school "
        },
        {
            "text": "Like families and businesses across the country, schools are facing challenges with rising prices due to inflation as the aftermath of covid still lingers, and the war in Ukraine has destabilised energy markets and supply chains all over the world.  "
        },
        {
            "text": "All schools will benefit from the Energy Bill Relief Scheme, reducing how much they need to spend on their energy and giving them greater certainty over their budgets over the winter months.  "
        },
        {
            "text": "If you are looking to buy energy for your school, make Find a Framework – energy and utilities your first port of call. Using DFE approved frameworks can help you get value for money and ensure your buying is compliant. "
        },
        {
            "heading": 2,
            "text": "Support with energy efficiency "
        },
        {
            "text": "In early December, the government announced that they were investing £500million to help state schools and colleges with energy efficiency upgrades, helping to manage energy consumption and save on bills. Estimations show that on average, a primary school will receive approximately £16,000 and a secondary school will get £42,000."
        },
        {
            "text": "Making investments to improve energy efficiency will help your school manage costs. The top 3 actions that schools can take to reduce energy costs are: "
        },
        {
            "text": "You know your school best and so it is up to you how you chose to invest this funding to improve energy efficiency. For example, you could use it to install better heating controls, insulation to reduce heat loss from pipes or switching to energy efficient lighting like LEDs. "
        },
        {
            "text": "To support you to maximise the energy efficiency of your school this winter and beyond, new guidance for schools and colleges has been published on GOV.UK. Read the guidance for advice on how your school can reduce their energy demand and consumption, energy costs and carbon emissions. It includes a range of advice from everyday behavioural changes to more complex interventions that will need investment and planning. "
        },
        {
            "text": "If you are looking to buy energy efficiency goods or services for your school, you can find several new frameworks on our Find a Framework – energy efficiency page. These DFE-approved frameworks will give your school a quick and compliant route to market for things like energy audits, renewable energy solutions and LED lighting. Here’s the full list: "
        },
        {
            "heading": 2,
            "text": "Do you need extra help with your buying? "
        },
        {
            "text": "If you need help with buying energy or energy efficiency goods and services for your school, you can contact Get help buying for schools for support with switching and entering new framework contracts. It’s a free service which can save you time on procurement and avoids the need to pay additional fees to third parties when delivering procurements for your school or trust. "
        },
        {
            "heading": 2,
            "text": "Want to know more about energy? "
        },
        {
            "text": "If you’d like to know more about any of the things I have covered, plus the chance to ask any questions you may have, sign up now for our ‘Energy and your school’ webinar: "
        }
    ]
}