{
    "url": "https://ruralpayments.blog.gov.uk/2023/01/09/mp-roundtable-with-the-rpa-dr-neil-hudson-mp-penrith-and-the-border/",
    "title": "MP Roundtable with the RPA: Dr Neil Hudson MP (Penrith and The Border)",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition"
    ],
    "pub_date": "2023-01-09T11:17:05+00:00",
    "content": [
        {
            "text": "We held our 14th MP Roundtable event on 2 December with Neil Hudson, MP for Penrith and The Border, at the Penrith Rugby Club. RPA Directors Sandy Kapila and Rozanne Kidd, and senior managers from RPA and Defra met with a wide variety of farmers and land agents from the local area."
        },
        {
            "text": "Despite it being the end of a crisp December week in the Cumbrian countryside, the event was well attended, with more than eighty members of the farming community giving up their time to engage with the Agency, understand our schemes and ask questions."
        },
        {
            "text": "After a warm welcome from Neil Hudson, the RPA and Defra representatives outlined the RPA 5-year strategy and our plans for working with rural communities in 2023, highlighting the expansion of the Sustainable Farming Incentive (SFI), the introduction of the Slurry Infrastructure Grant and changes made to Countryside Stewardship (CS), along with an update on how we’ve been working to improve our customer service."
        },
        {
            "text": "After the presentations, we moved onto a Q&A session. The attendees raised their concerns about a number of issues, including: the attractiveness and payment rates of SFI: the balance between food production and environmental conservation: concerns about inflation and the cost of operating their businesses: and recent issues regarding animal health including recent outbreaks of avian flu, which was of especial interest to Neil Hudson due to his background as a veterinarian."
        },
        {
            "text": "While we were able to give some good feedback about further improvements we’re making to schemes and some of the ways we are aiming to help farmers across the period, we absolutely accept that we need to continue to find ways to support our farmers and the wider rural communities. We committed both to feeding back this insight to ministers, and to address some individual concerns as best we could."
        },
        {
            "text": "As has been the case in our other roundtable events, we gathered a wealth of insightful information and constructive feedback from the community, and we really appreciate the willingness of so many people to give us their time and attention. We know that we need to continue to provide more information about future schemes to help farmers make informed decisions for their businesses, and we will release further detail shortly to support this aim."
        },
        {
            "text": "We are organising more roundtable events over the coming months with MPs across the country and arranging other sessions with farming bodies and associations, so keep an eye on our blog for more information. To receive further updates to your inbox, you can subscribe to the blog."
        }
    ]
}