{
    "url": "https://deframedia.blog.gov.uk/2023/01/09/national-coverage-of-new-biosecurity-strategy-to-protect-food-security-trade-and-plant-health/",
    "title": "National coverage of new biosecurity strategy to protect food security, trade and plant health",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-01-09T14:47:01+00:00",
    "content": [
        {
            "text": "There has been extensive coverage in The Times, Daily Mail, Daily Express, Independent, Daily Star and Yorkshire Post, Eastern Daily Press, Press and Journal, Farming Online, Forestry Journal and Horticulture week of our announcement of a new action plan to protect plants from pests and diseases."
        },
        {
            "text": "The Plant Biosecurity Strategy for Great Britain sets out a five-year vision for plant health, consisting of an action plan to secure national biosecurity, protect native species and drive economic growth. It positions the UK as a global leader in plant biosecurity, setting out our vision to create a new biosecurity regime and bio-secure plant supply chain, which will safeguard food security and help mitigate the effects of climate change. It comes following updated figures which show that plants provide an annual value of £15.7 billion to the United Kingdom."
        },
        {
            "text": "Lord Benyon, Minister for Biosecurity, said:"
        },
        {
            "text": "This landmark strategy sets out how we will protect Great Britain’s plants, with the government, industry and the public working together to tackle the risks posed by plant pests and diseases. In light of climate change, tackling these varied and mounting risks will be critical to maintaining our food security, as well as facilitating safe trade amidst a challenging economic backdrop."
        },
        {
            "text": "Today’s announcement demonstrates this Government’s ironclad commitment to protecting and restoring our natural environment for future generations, as we deliver on our tree planting targets and ambition to achieve net zero."
        },
        {
            "text": "Nicola Spence, UK Chief Plant Health Officer, said:"
        },
        {
            "text": "Plant pests and diseases know no borders. As the global trade in plants and plant products continues to grow, our precious ecosystems, native species and biosecurity are at risk. The resultant threats posed to our treescapes, food security and the global economy are all too real."
        },
        {
            "text": "Therefore, I am proud to officially launch the Plant Biosecurity Strategy for Great Britain, which will deliver a step change in our plant health protections, actions and behaviours. This will position Great Britain as a global leader in plant biosecurity and set an example for the world to follow."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}