{
    "url": "https://ruralpayments.blog.gov.uk/2022/07/19/early-basic-payment-scheme-payments/",
    "title": "Early Basic Payment Scheme Payments",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2022-07-19T11:49:15+01:00",
    "content": [
        {
            "text": "Recognising the cashflow challenges faced by many farmers as a result of worldwide cost pressures and market instability, the Secretary of State announced on 6 May that BPS payments would be brought forward"
        },
        {
            "text": "RPA were asked to make this change happen and we have been working hard to get everything in place to start to make payments from the end of July, giving farmers more flexibility over their cash flows. Once we start, we’ll carry on through until the end of August as needed, but it’s our expectation that the majority of payments will be made by the end of July."
        },
        {
            "text": "Our aim is to pay half of the final 2022 BPS payment up front, but there will be situations, such as where commons are involved or if a field visit has taken place, where more work will be needed to calculate the final payment and the advance may not be exactly 50% of the final total ."
        },
        {
            "text": "We’ll then be moving on to fully process all applications so a balance payment can be made, as usual, from 1st December. The proportionate amount of progressive reduction will be made to both payments and we’ll also pick up any adjustments to payment values in the balance payment."
        },
        {
            "text": "For anyone considering the Lump Sum Exit scheme, any BPS payment made ahead of the final lump sum payment will be factored into the calculation."
        },
        {
            "text": "This will be a permanent change to the way we pay BPS for the remaining years of the scheme, with twice yearly instalments bringing BPS more in line with the new environmental land management schemes, which will have a more regular and frequent payment cycle."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}