{
    "url": "https://hodigital.blog.gov.uk/2022/07/19/how-we-co-created-business-design-principles-for-the-home-office/",
    "title": "How we co-created Business Design Principles for the Home Office",
    "authors": [
        "Katy Arnold, Deputy Director for Design and Research",
        "Sara Vincent, Head of Content Design"
    ],
    "categories": [
        "Design",
        "Service design"
    ],
    "pub_date": "2022-07-19T10:10:02+01:00",
    "content": [
        {
            "text": "In my role as Deputy Director for Design and Research I’ve been focused mostly on helping the organisation create more user-centred products and services."
        },
        {
            "text": "Recently that changed and I became more involved in how we make strategic design decisions. I also joined our Business Design Authority (BDA). It brings together strategy and change directors so they can steer work and make sure we’re investing in things that will deliver better outcomes for our users."
        },
        {
            "text": "At the time, the department was going through a period of change following the Windrush Lessons Learned Review. This explicitly recommended involving citizens in the design and evaluation of services, yet our BDA processes didn’t always ensure the voice of individuals and communities were heard."
        },
        {
            "text": "With this in mind, I offered to work with our Head of Content Design, Sara Vincent, to help change this."
        },
        {
            "heading": 2,
            "text": "Making people a priority"
        },
        {
            "text": "The BDA already had a set of design principles. However, these had evolved without consensus and become outdated, so it seemed like a useful place to start."
        },
        {
            "text": "If we could embed a people-centred lens into our principles it would ensure design decisions were seen through this lens and based on the lived experience of people affected by our policies and services."
        },
        {
            "text": "It would also help us to reduce risk, work more efficiently and increase the likelihood of successfully meeting intended policy outcomes."
        },
        {
            "heading": 2,
            "text": "Supporting design at scale"
        },
        {
            "text": "When we began interviewing board members to understand what was and was not working, we realised one of the biggest challenges was the sheer size and complexity of the Home Office."
        },
        {
            "text": "We have staff working across everything from immigration and passports to refugee protection, policing and counter-terrorism. This broad remit means it can be difficult for teams to provide advice on areas that have very different duties and challenges to their own."
        },
        {
            "text": "The scale of the organisation also means design is not something that happens in a single team or by specialists with design experience. Design decisions are happening everywhere, all of the time."
        },
        {
            "text": "As designers our role is to support the decision-making process with guidance and evidence gathered from the lived experience of those affected. To do this well, we need to take decision-makers with us - and design principles can help."
        },
        {
            "text": "We realised that if we could reach a consensus on these it might also help draw these disparate areas of the organisation closer together."
        },
        {
            "text": "Initially, we set up a working group that included a wide representation of roles and areas, including policy and operations. This was critical for showing that the board was keen to gather a range of views and genuinely committed to improving governance by co-creating principles that would work for all."
        },
        {
            "heading": 2,
            "text": "Creating a role-based framework"
        },
        {
            "text": "We began by agreeing a structure for the principles. This was based on an approach commonly used in industry:"
        },
        {
            "text": "Next, we identified the primary roles the Home Office fulfils across its remit:"
        },
        {
            "text": "This enabled us to engage with strategy and design teams from across the department. Speaking to teams who represented different roles was essential for understanding both the relationship they have with their users and drafting principles that touched on issues like:"
        },
        {
            "text": "We also drew on cross-government standards such as the Service Standard and the NHS design principles."
        },
        {
            "heading": 2,
            "text": "Looking beyond the BDA"
        },
        {
            "text": "At the time we were drafting the principles, the Home Office was developing a new set of values. We identified that aligning our design principles to these values could help bring them to life and provide a practical way for staff to embed these values in our services."
        },
        {
            "text": "This alignment and focus on people mean the principles have been referenced by other areas when developing their own principles and frameworks, including teams involved in policy, HR and risk avoidance."
        },
        {
            "heading": 6,
            "text": "When drafting the principles, we aligned key themes to our values."
        },
        {
            "text": "The working group also identified that most teams encountered the principles only when they began preparing to attend the BDA – after key decisions had been made."
        },
        {
            "text": "They approached the Project and Programme Delivery (PPD) portfolio and proposed adding the principles to our Project Delivery Framework, which is used by projects and programmes across the department."
        },
        {
            "text": "PPD now helps teams understand how to apply the principles and requires them to start demonstrating alignment from the outset."
        },
        {
            "heading": 2,
            "text": "Achieving something together"
        },
        {
            "text": "By working together, we were able to achieve consensus and create principles that are now used by every programme or major project that comes to the BDA."
        },
        {
            "text": "When they attend the board, teams should be able to demonstrate what they’re doing to understand their users and how they’ll assess the impact of decisions on them."
        },
        {
            "text": "They should also be able to show how they’re adopting a test-and-learn approach, and ensure people are consulted throughout development."
        },
        {
            "text": "All of this must happen before they seek financial approval at the department’s most senior governance board."
        },
        {
            "text": "The process has been in place for several months now, giving the BDA time to test the principles. Next, we’ll be thinking about how to simplify them and ensure they reflect the progress we’re making towards becoming a more user-led, product-centric organisation."
        }
    ]
}