{
    "url": "https://educationhub.blog.gov.uk/2022/07/19/how-were-giving-t-level-students-access-to-world-class-facilities/",
    "title": "How we’re giving T Level students access to world class facilities",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "T Levels"
    ],
    "pub_date": "2022-07-19T14:50:12+01:00",
    "content": [
        {
            "text": "The government is investing millions so that young people studying new T Level qualifications have access to high quality buildings and facilities. This will help them gain the skills they need to secure rewarding careers."
        },
        {
            "heading": 3,
            "text": "What are T Levels? "
        },
        {
            "text": "T Levels are technical courses – equivalent to three A Levels – that combine study with a substantial industry placement so that students gain the skills and experience they need to progress into work, further study or an apprenticeship."
        },
        {
            "text": "T Levels equip young people with the skills and knowledge that will prepare them for the workplace, with content designed with over 250 employers including Fujitsu and Amazon."
        },
        {
            "text": "Courses are available at further education providers across England in subjects including healthcare, education, digital skills and construction."
        },
        {
            "text": "New courses, including Engineering and Manufacturing, Finance, Creative & Design and Legal will be introduced from 2022 and 2023. Plans for a new Marketing T Level to be introduced from 2025 are also being progressed, aiming to give young people the chance to build skills in an exciting and booming sector."
        },
        {
            "heading": 3,
            "text": "How we are supporting T Level students to learn in world-class facilities "
        },
        {
            "text": "To date, around £250 million has been made available through the T Level Capital Fund to support colleges, schools and other further education providers across England to deliver T Levels in 2020, 2021 and 2022. The money has been used to refurbish or build brand new buildings and invest in industry standard-equipment, which is vital for the practical elements of many courses."
        },
        {
            "text": "Thousands of T Level students are already benefiting from this investment, including those studying at City of Sunderland College. The college now has permanent, dedicated learning spaces for their T Levels students including a 360-degree immersive space recently awarded AV Education project of the year."
        },
        {
            "heading": 3,
            "text": "What are people saying about how the T Level capital fund has benefitted them?"
        },
        {
            "text": "Judith Quinn, Vice Principal for Curriculum and Achievement at Sunderland College, said: "
        },
        {
            "text": "Students at LTE Manchester College in the North West has seen similar benefits. As well as refurbishing existing facilities to create an industry-standard hospital, care and nursery environment for the Education & Childcare and Health & Science students, they have also built a new mezzanine level teaching space for construction pupils already based in their Construction Excellence Centre."
        },
        {
            "text": "Rachel Curry, Deputy Principal at The Manchester College, commented:"
        },
        {
            "heading": 3,
            "text": "How we are supporting even more students to study in high quality buildings"
        },
        {
            "text": "An additional £150 million from the fund is being provided to support further education providers to refurbish or upgrade their buildings and invest in equipment in readiness to deliver T Level courses from September 2023. This brings the total invested through the T Level Capital Fund to over £400 million."
        },
        {
            "text": "Providers receiving funding in the latest round include Bridgwater and Taunton college in Somerset which has been awarded funding to support its T Level courses in Agriculture, Environmental & Animal Care, Creative & Design, Engineering & Manufacturing and Hair, Beauty & Aesthetics."
        },
        {
            "text": "Hartlepool College in the North East of England has also received funding to refurbish its facilities for courses in Engineering & Manufacturing. The full list of further education providers to benefit from this latest investment can be found here: T Levels capital fund - GOV.UK (www.gov.uk)."
        }
    ]
}