{
    "url": "https://nationalscreening.blog.gov.uk/2022/07/19/meeting-the-challenges-of-rare-diseases-in-nhs-newborn-blood-spot-screening/",
    "title": "Meeting the challenges of rare diseases in NHS newborn blood spot screening",
    "authors": [
        "Farah Seedat",
        "Silvia Lombardo"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-07-19T07:50:55+01:00",
    "content": [
        {
            "text": "Every baby in England is offered newborn blood spot screening, also known as the heel prick test, ideally when they are 5 days old. The NHS screens babies for 9 conditions, including sickle cell disease and cystic fibrosis, plus some other rare conditions most families will likely never have heard of before."
        },
        {
            "text": "Assessing the evidence on introducing new conditions in newborn blood spot screening is difficult because many of them are so rare. This means we do not have the same amount of information as we do for more common conditions."
        },
        {
            "text": "The UK National Screening Committee (UK NSC) guides ministers to make decisions based on the evidence. But sometimes the UK NSC needs a bit of extra support to make sure it reaches recommendations based on the very best evidence."
        },
        {
            "heading": 2,
            "text": "New group with range of experience"
        },
        {
            "text": "For this reason, the UK NSC set up the Blood Spot Task Group (BSTG) to help identify practical and innovative approaches to research to inform its evaluations."
        },
        {
            "text": "The group brings together a wide range of expertise in newborn screening, including paediatricians, academics (including researchers, methodologists, and health economists), ethicists, quality assurance (QA) professionals, geneticists, and patient and public voice representatives."
        },
        {
            "text": "As the UK NSC makes UK-wide recommendations, government representatives of the 4 UK countries provide input to the group. Representatives of the recently formed Republic of Ireland National Screening Advisory Committee (NSAC) also contribute."
        },
        {
            "text": "The BTSG aims to deepen its understanding by drawing on the huge experience and knowledge of all its members as it goes through its programme of work."
        },
        {
            "heading": 2,
            "text": "Wheels in motion "
        },
        {
            "text": "At the BSTG's first meeting, presentations were given on 3 priority projects for the BSTG."
        },
        {
            "text": "The group also discussed ways in which patient and parent experiences could be used earlier in the decision-making process."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "Hopefully this blog article has given you a flavour of work the new group will be getting involved in and we’ll be sure to keep you updated on progress. You can register to receive updates direct to your inbox whenever we publish a new article. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC."
        }
    ]
}