{
    "url": "https://civilservice.blog.gov.uk/2022/07/19/welsh-language-a-national-treasure/",
    "title": "Welsh language: A national treasure",
    "authors": [
        "Monica Maya-Martinez"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-07-19T08:04:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To help drive up diversity across Wales, the Cabinet Office has pledged to treat the English and Welsh languages on an equal footing. To improve the voice of Welsh speaking citizens, the Civil Service Jobs team now has the option of issuing  job adverts in Welsh. "
        },
        {
            "text": "Ten. That’s how many languages indigenous to the British Isles are still spoken today. And if, like me, you’re curious as to what they are, they include: English, Scots, British Sign Language, Welsh, Gaelic, Irish, Cornish, Manx, Angloromani and Shelta. This diversity is what makes the UK so rich in history, some of which was glorious and some dark. "
        },
        {
            "text": "Henry VIII"
        },
        {
            "text": "The Welsh language was spoken in Britain before Roman occupation. It evolved during the Anglo-Saxon period, developing into the early foundations of Cornish and Welsh in the south west regions of Britain, and Cumbrig in the north of England and lowland Scotland. "
        },
        {
            "text": "Banned"
        },
        {
            "text": "During mediaeval times, the Welsh language flourished. But following Henry VIII’s Act of Union, its use was banned and its official status removed. The Welsh language was replaced by English, at least on official matters, and oral traditions that had survived centuries were lost. After centuries of banning the language and discriminating against its speakers, in 1967, a very important piece of legislation was introduced: the Welsh Language Act. It gave rights, albeit limited, that allowed people to use the Welsh language in legal proceedings in Wales. "
        },
        {
            "text": "Equality"
        },
        {
            "text": "Through its Welsh language scheme, the Office of the Public Guardian intends to provide as many of our services as possible in both English and Welsh. The UK government places a duty on public bodies to treat both languages equally, when providing services to the public. To achieve this, the Cabinet Office has adopted the principle that in the conduct of public business in Wales, it will treat the English and Welsh languages on a basis of equality. In the Civil Service Jobs team, part of the Cabinet Office, we have been cooperating with the Welsh Government but also working collaboratively with HMRC and DWP, to make the user experience for Welsh speakers better. "
        },
        {
            "text": "Apply in Welsh"
        },
        {
            "text": "From Wednesday 22 June, Civil Service Jobs recruiters and vacancy holders have had the option to provide a Welsh version of their job advert, and the content within the Civil Service Jobs portal has been translated into Welsh language. This allows Welsh-speaking candidates to see the job details and apply in Welsh. Candidates will also see the user journey in Welsh if they choose to. "
        },
        {
            "text": "Positive experience"
        },
        {
            "text": "Numbers of Welsh language users may not be high, but they matter - because it is our commitment that every user that visits Civil Service Jobs is treated fairly and has a positive experience during their job search and application process. Candidates can also sign up for job alerts in Welsh, and any notification that comes from our system will be provided in Welsh if they have selected it as their preferred language."
        },
        {
            "text": "Incredible team effort"
        },
        {
            "text": "To get to this point, we completed a round of Welsh language user research, led by HMRC, that helped us understand some of the differences between the journeys and expectations of Welsh language users versus English language users. We incorporated some changes to our designs and user interface, to ensure users were able to easily identify how to toggle between both English and Welsh. "
        },
        {
            "text": "Translations were provided by a team of colleagues at DWP, who are not only native speakers of Welsh but also official translators and great ambassadors for Welsh language and Welsh culture. It was an incredible team effort to get to where we are, and whilst it may be seen as small, it’s a huge gain if it means there are users out there who will have a better experience and gain a sense of inclusion from visiting our site. "
        },
        {
            "text": "Promoting Welsh heritage"
        },
        {
            "text": "There is still work to be done, as departments don’t have the obligation to translate their adverts. But we will continue to promote the translation of adverts and collaborate with our colleagues in Wales, to ensure the importance of the Welsh language is understood. "
        },
        {
            "text": "Today, the Welsh language is embraced and spoken at home, in the workplace, in the community and in government. It’s estimated that almost 800,000 people speak Welsh. We are committed to supporting the Welsh Government’s plan to reach one million Welsh speakers by 2050, and we are confident that through raising awareness, this number may increase sooner. "
        }
    ]
}