{
    "url": "https://mhclgdigital.blog.gov.uk/2022/07/19/what-we-learned-from-local-digital-roadshow-2022/",
    "title": "What we learned from the Local Digital Roadshow 2022",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Team"
    ],
    "pub_date": "2022-07-19T12:01:31+01:00",
    "content": [
        {
            "text": "This year has seen the Local Digital team travelling around the country for the first time in two years as part of the Local Digital Roadshow series."
        },
        {
            "text": "We’ve been joined by 119 people from 64 councils at five in-person events encompassing the North East, Midlands, North West, Yorkshire and the South West, plus a virtual event for attendees in the South East and East of England. It’s been fantastic to see so many of you in-person, so thank you to everyone that travelled to take part or tuned into the virtual event."
        },
        {
            "heading": 2,
            "text": "What is the purpose of the Local Digital Roadshow?"
        },
        {
            "text": "We held our very first roadshow in 2018 with the theme of ‘transforming local services for the internet age’. As well as understanding local authority needs, we wanted to share our vision for the future of public services and set out our plans to work collaboratively with councils."
        },
        {
            "text": "The overarching aim of the roadshow has not changed since 2018, however this year it provided the ideal opportunity for us to introduce councils to our exciting three-year plans for Local Digital, gather your feedback, and gain a better understanding of the cyber and digital challenges that the sector is facing. What we hear at events such as this is vital in helping us to shape our work and the support we provide to councils."
        },
        {
            "text": "The events were open to any council officer interested in learning more about delivering better digital public services, or anyone in local government who has signed the Local Digital Declaration and wants to improve on their commitments."
        },
        {
            "heading": 2,
            "text": "What we heard from you"
        },
        {
            "text": "After a welcome and introduction from the Local Digital team, we split into small groups for the first workshop to explore the common cyber and digital challenges that councils are facing."
        },
        {
            "text": "At each event, we heard that councils across the country face many similar challenges and barriers to digital transformation—emphasising the importance of collaboration when it comes to creating solutions."
        },
        {
            "text": "- Feedback from Local Digital Roadshow participant"
        },
        {
            "text": "We learned that the most common challenges and barriers that councils are experiencing include:"
        },
        {
            "text": "After lunch, we got back into groups for a follow-on workshop to discuss how we can meet the challenges together. During these sessions, we heard that:"
        },
        {
            "text": "- Feedback from Local Digital Roadshow participant"
        },
        {
            "heading": 2,
            "text": "Continuously learning, iterating and improving"
        },
        {
            "text": "After every event, we held a team retrospective to discuss what went well and what we could improve ahead of the next event."
        },
        {
            "text": "We also invited attendees to complete a feedback form to let us know what they thought of the event they attended."
        },
        {
            "text": "By regularly inviting and discussing feedback, we were able to continually make improvements to the events. This included:"
        },
        {
            "text": "After the first event, members of the Local Digital team also undertook a two-day facilitation course to enable them to better support attendees during the workshops."
        },
        {
            "text": "Overall, feedback on the events has been really positive with 97% rating the roadshow they attended as ‘good’ or ‘excellent’. We were also pleased to hear that 100% of attendees would consider attending future events run by the Local Digital team."
        },
        {
            "text": "Attendees told us that they found the workshops and networking opportunities the most useful, including meeting local colleagues, hearing from like-minded people and having lively discussions where issues could be shared and solutions brain-stormed."
        },
        {
            "heading": 2,
            "text": "What we plan to do next"
        },
        {
            "text": "We are currently in the process of defining a multi-year programme of work. We will continue to co-create our plans with councils and iterate as we go, and we are planning to do a lot more engagement with the sector."
        },
        {
            "text": "Our proposed next steps are to:"
        },
        {
            "text": "You can follow our progress and stay in touch with our plans via the DLUHC Digital Blog, well as our usual channels:"
        }
    ]
}