{
    "url": "https://defradigital.blog.gov.uk/2022/07/19/why-product-management-is-key-to-building-digital-services/",
    "title": "Why product management is key to building digital services",
    "authors": [
        "Jazz Austin"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2022-07-19T13:04:04+01:00",
    "content": [
        {
            "text": "Jazz Austin, a Product Manager in the Extended Producer Responsibility team, explores why Product Management is important for Defra in building digital services, and shares some insights from her experience of having recently joined the Civil Service."
        },
        {
            "text": "On this World Product Day 2022, I wanted to share my insight into product management at Defra and explore why it’s key to making a difference for the environment through digital services."
        },
        {
            "text": "In our digital development world, product management generally involves working with a multi-disciplinary team to research, design and build a digital product or service based around user needs and business requirements."
        },
        {
            "text": "A team can comprise of a variety of roles including; user researchers, business analysts, architects, delivery managers, designers, and developers. Not everything can be solved through a digital solution, but done well, it can mean that government services are easier to engage with, better adopted, and therefore more able to drive positive environmental outcomes."
        },
        {
            "heading": 2,
            "text": "Combining experiences from environmental and digital positions"
        },
        {
            "text": "I recently joined Defra as a Product Manager in June 2022 and am completely new to the Civil Service. With a background in product management, project management and policy, as well as experience from both the private and charitable sectors, there’s still been a lot to learn."
        },
        {
            "text": "Product Managers at Defra are responsible for the quality of their products and are required to use their knowledge of user needs and business goals to frame problems and set priorities for delivery teams. Given the overarching remit of Defra, these products should result in environmental benefits."
        },
        {
            "text": "Prior to working at Defra, I have worked as a Product Manager for an equity crowdfunding platform and more recently in project management and policy for the RSPB. Product management at Defra seemed like the perfect opportunity to combine these experiences of digital and environmental skillsets."
        },
        {
            "heading": 2,
            "text": "A steep (but enjoyable) learning curve so far"
        },
        {
            "text": "As a new starter, the scale and breadth of our Digital, Data and Technology Services (DDTS) organisation has been particularly surprising. DDTS supports the digital needs of the whole of the Defra group, with Product Managers and digital teams deployed and working across a variety of areas such as Food and Farming, Trade, and Collection and Packaging Reforms."
        },
        {
            "text": "Examples of recent products the teams have built include the new Government digital service to support what is the toughest ivory ban in the world and the new security training course which will be used across the Civil Service. Our diverse range of teams aim to ensure that the digital services we build are done so in such a way that they enable policy implementation, whilst providing the best experience for users."
        },
        {
            "heading": 2,
            "text": "Understanding the standards"
        },
        {
            "text": "Throughout my induction, it’s been important to understand the Service Standard which underpins digital work at Defra and wider Government services. To make sure this is achieved to a high and consistent standard across departments, the Government Digital Service created the standard to provide a comprehensive set of principles that all services must align with and be assessed against at key phase milestones."
        },
        {
            "text": "The Service Standard includes principles on user research, governance, agile delivery, security, and accessibility, and ensures that services are continually maintained and iterated. This framework and approach help us to balance priorities to deliver for the user, while enabling us to add value sooner and manage expectations of our different stakeholders. Essentially, we are the voice of the user, and the quality assurance for the outcomes that we deliver."
        },
        {
            "heading": 2,
            "text": "Meeting the challenge of balancing technology and environmental needs"
        },
        {
            "text": "During my short time at Defra so far, I’ve noticed some clear challenges and opportunities that occur when working within this intersect between technology and environmental policy. For example, policy might be in-flux, or require dates that are difficult to co-ordinate with digital timeframes, and business requirements can force constraints that contest agile working practices."
        },
        {
            "text": "However, the potential for implementing solutions which help address the biodiversity and climate emergency is huge and it’s vital that these services are built to the best standard for users to achieve these environmental outcomes."
        }
    ]
}