{
    "url": "https://moderncivilservice.blog.gov.uk/2024/01/19/building-the-first-policy-campus-beyond-whitehall/",
    "title": "Building the first policy campus beyond Whitehall",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Government Reform",
        "Modernisation and Reform",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-01-19T15:01:20+00:00",
    "content": [
        {
            "text": "A new government campus will help Sheffield become a powerhouse for policy making and talent development, in line with the Capability and Place missions as part of A Modern Civil Service."
        },
        {
            "text": "In June, the Government’s first policy campus launched in Sheffield as part of the Civil Service Places for Growth (PfG) programme. In December, the Government announced that the PfG commitment to move 22,000 Government roles out of London has been brought forward to 2027 from 2030. This builds on PfG commitments captured in the Declaration on Government Reform and the Government’s Levelling Up white paper. "
        },
        {
            "text": "Building on the strong Civil Service policy community already in Sheffield, the campus will help bring together the departments based in the city around their shared policy priorities and support cross-government career paths in South Yorkshire. "
        },
        {
            "text": "Places for Growth aligns with the Place and Capability missions, two of the five reform missions for A Modern Civil Service. To help us become a Skilled Civil Service we’re investing in skills, championing expertise and strengthening leadership to reflect the country we serve and create opportunities across the UK. "
        },
        {
            "heading": 2,
            "text": "Sheffield and the Civil Service"
        },
        {
            "text": "Sheffield is already a leading location for policy making outside of London with over 1,000 members of the policy profession and is home to around 8,000 civil servants from multiple departments and agencies, such as the Department for Work and Pensions, the Department for Education and the Home Office. With two universities, advanced manufacturing businesses, a thriving creative and cultural sector and — of course — the fabulous Peak District nearby, it’s a great place to build a career in the Civil Service. "
        },
        {
            "text": "The strong sense of Sheffield pride is shared by John Edwards, Director General at the Department for Education. “I live in Sheffield and my kids were born here, went to school, and grew into adults as proud Sheffielders. That sense of belonging is important to me, and I would not have pursued my career in the Civil Service if I had not been able to do so from this great city.” "
        },
        {
            "text": "The campus plans complement other work to build skills and develop a greater range of career paths in Sheffield, such as the One Public Estate approach of collaboration across all public sector occupiers. As an established employer within the region, the Campus will take an active role in working alongside other major institutions and businesses to drive continued growth for employment."
        },
        {
            "heading": 2,
            "text": "Campus life"
        },
        {
            "text": "Government campuses look to enable greater join up between departments with related policy areas. In addition, the Sheffield Policy Campus, like the Darlington Economic Campus, focuses on building cross-government career paths with diverse entry routes, access to professional development at every level, and supports civil servants in progression to the most senior roles. It also aims to create strong partnerships with city and regional institutions such as the local universities, colleges, the city council and combined authority. This brings policy making closer to areas its interventions interact with, and strengthens the positive impact the Civil Service has on the city and wider region. "
        },
        {
            "text": "On 8 February, the campus will host a special themed event focused on policy. This is just one of the examples of how the campus will support the policy profession to thrive, as it is designed to give some top tips and signposts to further learning and development in this essential area. "
        },
        {
            "heading": 2,
            "text": "Local viewpoints, national influence"
        },
        {
            "text": "Alongside links to local universities the Campus is looking to ensure greater engagement with the community at large, working with local schools and colleges, local authorities, chambers of commerce and key local businesses. "
        },
        {
            "text": "The Policy Campus is a beacon for how professions and functions can create deep areas of expertise, with investment in people at the forefront of their ambitions. Through successful relocation of Government roles out of London, other regions can replicate and benefit from this campus approach. This will help us to embed the Civil Service in communities, actively levelling-up our capability across the UK and ensuring that the views and experiences that shape the Government’s policies are as diverse as the UK itself. "
        }
    ]
}