{
    "url": "https://environmentagency.blog.gov.uk/2024/01/19/east-anglias-work-protecting-eels/",
    "title": "East Anglia’s work protecting eels",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2024-01-19T11:12:43+00:00",
    "content": [
        {
            "text": "My name is Dan Hayter and I work in East Anglia for the Environment Agency.\nPart of my job is monitoring and protecting European eels which are a critically endangered species.\nEels are born in the Sargasso Sea in the north-west Atlantic Ocean. From there, they float in their larval form on ocean currents towards Europe – journeying over 3,000 miles for up to two years. Once they reach the coast, they turn into transparent glass eels (up to 8cm long) and then elvers (up to 12cm long) swimming upstream into rivers. Here they live for around 6-10 years as juveniles/sub-adult (yellow eels), before swimming downstream and eventually returning to the Sargasso Sea as mature adults to breed (silver eels)"
        },
        {
            "text": "At the Environment Agency we are working hard to address the struggles eels face and protect them.\nWe know barriers, weirs and sluices are problematic as they disrupt the natural flow of rivers and can prevent or slow the migration. These structures are designed to control river levels and prevent flooding so my task is to monitor them and improve migration for the eels to overcome these barriers. Loss of eel habitat is another big factor, with rivers historically being less natural with less wetland and floodplain connectivity. To mitigate this the Environment Agency designs and installs eel passes to help eels get from the sea into the freshwater habitats and then back again as adults. We monitor sites to ensure eel passes are maintained in good condition and are effective throughout the migrating season."
        },
        {
            "text": "The Environment Agency is involved in many natural flood management projects which reduce flooding for people but also improve the habitat for the eels whilst improving biodiversity.\nPumping stations can be very damaging to eel stocks. We ensure that the owners of them help protect eels by installing screens to prevent eels entering. We make sure the screens are regularly inspected and maintained by the owners. We also carry out maintenance on our own eel passes and screens.\nAs a result of the decline in eels over the last 40 years, the environment agency carries out eel surveys where we monitor the different life stages (glass eel, elver, yellow and silver eel)."
        },
        {
            "text": "We have elver monitoring passes where we can count the numbers that swim through each season. The data gathered is combined with other records from around Europe to monitor the overall population and to help with future management. When we carry out eel surveys we also check their health and look out for parasites and diseases. If we suspect disease in a population, we can collect health samples which are passed on to our laboratory where specialists will investigate the cause and also help with future conservation."
        },
        {
            "text": "We know that stress in eels can result in mortality. Stress can be caused by many factors such as migration issues, loss of habitat, drought, health problems, illegal trade and fishing. The Environment Agency protects and improves fisheries and invests a great deal in improving the environment and conditions where eels live. This along with all our eel specific work, reduces the impact people have on eels and this will in turn reduce stress and disease."
        },
        {
            "text": "Another major challenge we are facing when it comes to protecting eels is climate change. Changes in ocean temperatures and currents can interfere with the migration of the eels and can affect how they breed. We know they breed in specialised conditions at depth in the Atlantic Ocean and any significant changes could be a big problem. With climate change we are also seeing an increase in the number of storms, which could affect eels by disrupting their incredible migration. The work we do will give eels a much better chance to cope with the environmental changes that are likely and, by continuing to learn about these fish, we can adapt and improve what we do in the future."
        },
        {
            "text": "Eels are an important and fascinating species inhabiting our water environment. They feed on various things including invertebrates, fish, molluscs and crustaceans, helping to recycle nutrients and they are an important food source for many species. If members of the public are interested in our work with eels they can check our website, blog and look at our data. "
        }
    ]
}