{
    "url": "https://stratcommand.blog.gov.uk/2024/01/19/we-are-strategic-command-with-redwan-ahmed/",
    "title": "We Are Strategic Command with Redwan Ahmed",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-01-19T14:03:31+00:00",
    "content": [
        {
            "text": "In our latest article, Redwan Ahmed, Business Analyst within our Portfolio Office talks about his mission to make a positive difference through innovation and collaboration."
        },
        {
            "text": "Interviewer: Can you introduce yourself and tell us about your role?"
        },
        {
            "text": "Redwan: I’m Redwan Ahmed and I work in the Strategic Command Portfolio Office as a Business Analyst."
        },
        {
            "text": "I am responsible for ensuring that our projects are prioritised and have the right resources. This helps us to make sure they’re delivered on time, to specification and within the allocated budget."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What brought you to the role?"
        },
        {
            "text": "Redwan: I wanted a challenge and to make a positive difference, which is what Strategic Command is here for, so it was a perfect fit. My previous role was in the Probation Service, and I felt like I could really use my skills to their fullest within Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What is the best part about your role?"
        },
        {
            "text": "Redwan: I would say the ability to bring people together and encourage innovation through shared skills and experiences; my mantra is driving positive change with positive behaviours. A real benefit of my role is I get to engage with so many different people from across the Command and the other Services, bringing together knowledge to deliver for Defence."
        },
        {
            "text": "I work with a really good team that has a common goal and sees the benefit of everyone’s experience and expertise."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: You are passionate about innovation and collaboration!"
        },
        {
            "text": "Redwan: I really am! Collaboration and communication are so important. In my role as a Business Analyst, there are times I need to understand requirements of a project or capability in development, so learning from those with experience can be what makes or breaks meeting the goal of a project."
        },
        {
            "text": "Ultimately, I believe diversity of thought is vital in achieving real innovation, there are times in my job that I need to be creative and think outside the box. Diversity in skills and knowledge can provide a much richer picture."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Outside of Strategic Command, what’s your passion?"
        },
        {
            "text": "Redwan: As part of the Defence Social Mobility Network, I truly believe that your socio-economic background does not predetermine your future. Everyone should have opportunities to develop skills and tap into their talents."
        },
        {
            "text": "I am a career coach outside of work, helping graduates who want to join the Civil Service. This can range from giving them advice to helping them complete an application form or prepare for interviews. I feel immense pride knowing that I have helped others in building their future."
        },
        {
            "text": "I think organisations like Strategic Command are better when we have diversity of thought, and apprenticeships or graduate schemes are a great way of achieving this. They bring a wealth of knowledge and experience with them into the organisation."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What would you say to someone thinking of joining Strategic Command?"
        },
        {
            "text": "Redwan: I would say if you’re looking for something different and a challenge, then Strategic Command is the place for you. The roles across the Command are varied, with different areas such as medical, digital, and intelligence. If you want to be part of something bigger than yourself, innovate, and work in a team that contributes to all of Defence, then join Strategic Command."
        }
    ]
}