{
    "url": "https://homeofficemedia.blog.gov.uk/2019/09/05/home-office-in-the-media-thursday-5-september/",
    "title": "Home Office in the media: Thursday 5 September",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Leading stories"
    ],
    "pub_date": "2019-09-05T10:42:02+01:00",
    "content": [
        {
            "text": "Today's leading stories include the launch of a national campaign to recruit 20,000 police officers, an announcement on future immigration and a High Court ruling on facial recognition."
        },
        {
            "heading": 2,
            "text": "Police recruitment"
        },
        {
            "text": "The launch of the campaign to recruit 20,000 additional police officers by 2023 was widely covered on broadcast this morning, with the Chancellor interviewed on Good Morning Britain, BBC Breakfast, Sky News and the Today programme following his Spending Round announcement."
        },
        {
            "text": "The Home Office budget will rise by 6.3 per cent in real terms in 2020/21, which will partly fund the recruitment of 20,000 additional police officers. Coverage adds that £750 million will fund 6,000 officers by the end of the next financial year, with another 14,000 to be recruited over the following two years."
        },
        {
            "text": "The Chancellor told Good Morning Britain that having been Home Secretary he has “seen how crime is changing”, referencing  county lines drug gangs and violent crime."
        },
        {
            "text": "In online articles, the Times and ITV also report that the 'Be a force for all' campaign features images of a neighbourhood officer, police dog handler, and a firearms officer, which are being displayed on billboards and digital displays in shopping centres and train stations across England and Wales."
        },
        {
            "text": "In an op-ed in the Telegraph, the Home Secretary calls for people from all backgrounds to sign up to the fight against crime, lawlessness and intimidation. She describes the recruitment drive for 20,000 additional police officers as a “once-in-a-generation opportunity” to attract police officers from all walks of life and professional backgrounds."
        },
        {
            "text": "She describes police as a “force for the community” and praises them for the dedication and commitment. The Home Secretary adds that the recruitment campaign is about reminding the general public what brave and hard-working officers do on a day-to-day basis, and restoring pride in policing as a profession."
        },
        {
            "text": "In a separate op-ed in the Express, the Policing Minister describes the launch of the campaign as the “biggest police recruitment drive in decades”. He adds that is a “fantastic opportunity” for people of all genders and ethnicities to serve their neighbourhoods."
        },
        {
            "heading": 3,
            "text": "Home Secretary Priti Patel said:"
        },
        {
            "heading": 2,
            "text": "Future immigration"
        },
        {
            "text": "Following the release of a proactive press notice, the Telegraph, Mail, FT, Sun, City AM and Mirror report that the Government has said EU migrants will be allowed to come to Britain for up to three years, even if there is a no deal."
        },
        {
            "text": "According to the articles, the Home Secretary said EU citizens would still be able to visit, work or study after Brexit on October 31. They highlight that \"tougher checks and ending free movement as it currently stands will allow us to take the first, historic steps towards taking back control of our borders\"."
        },
        {
            "heading": 3,
            "text": "Home Secretary Priti Patel said:"
        },
        {
            "heading": 2,
            "text": "Facial recognition"
        },
        {
            "text": "The FT, Guardian, Metro, Mirror, Star, City AM and Independent report on a High Court ruling that police use of automatic facial recognition technology is lawful."
        },
        {
            "text": "The papers report that a legal challenge was brought by Ed Bridges, supported by human rights organisation Liberty, after cameras captured his image while he was out shopping. He argued that this breached his privacy rights as well as data protection laws."
        },
        {
            "text": "The High Court ruled yesterday that South Wales Police, which has deployed facial recognition technology on 50 occasions, acted lawfully. Judges added that Britain’s “current legal regime is adequate” to deal with concerns that the technology might breach privacy rights."
        },
        {
            "text": "According to the Independent, the judges applied a legal test which finds privacy violations justified if the objective is “sufficiently important”, a less intrusive measure could not have been used and “a fair balance has been struck between the rights of the individual and the interests of the community”."
        },
        {
            "text": "The Guardian carries comments from Mr Bridges, who said he will appeal the ruling."
        },
        {
            "heading": 3,
            "text": "A Home Office spokesperson said:"
        }
    ]
}