{
    "url": "https://defradigital.blog.gov.uk/2022/06/05/celebrating-world-environment-day-how-were-setting-our-sights-on-sustainable-it/",
    "title": "Celebrating World Environment Day: how we’re setting our sights on sustainable IT",
    "authors": [
        "Chris Howes, Chief Digital and Information Officer"
    ],
    "categories": [
        "ICT sustainability"
    ],
    "pub_date": "2022-06-05T09:28:02+01:00",
    "content": [
        {
            "text": "On World Environment Day Defra’s Chief Digital and Information Officer Chris Howes shares his ambitions for sustainable IT, what we’re doing now, and how we are seeking to learn from others."
        },
        {
            "text": "I was in Copenhagen recently to compete in their annual marathon. As I was preparing on the day of the race, one of the things that struck me was the sheer number of race participants who arrived on bikes. I was also struck by the number of electric cars I saw driving around the city, far more than I’m used to seeing back at home."
        },
        {
            "text": "The city of Copenhagen is one of the most sustainable and energy efficient cities in the world. According to its Carbon Neutral by 2025 Plan, it has the ambition of becoming the first carbon neutral capital by 2025. Some of the initiatives that have helped support this goal include Copenhagen’s environmentally friendly modes of transport, sensitivity to climate change, sustainable urban redevelopment, and efficient energy use."
        },
        {
            "text": "Through its efforts towards encouraging a healthy, sustainable lifestyle among its people, its planning process plays a more significant role than simply altering people’s values though. Copenhagen’s success is, in many ways, attributed to how accessible and liveable its transport and other projects are for its everyday citizens."
        },
        {
            "text": "In other words, it’s more than just words on a page, or a spreadsheet on someone’s laptop. Talking of IT, I believe there is much we can learn from Copenhagen when thinking of how we make IT more sustainable."
        },
        {
            "heading": 5,
            "text": "Defra is committed, in our own Defra Sustainable Tech Strategy, to measuring, reporting, and reducing the negative impacts associated with our technology."
        },
        {
            "heading": 2,
            "text": "Aiming for sustainable IT – what we’re doing now"
        },
        {
            "text": "As the UK Government Department for Environment Food and Rural Affairs in Defra we have a leadership role on sustainability. In my role, I do this in four main ways:"
        },
        {
            "text": "I was at an industry event in London recently where I shared our journey to net zero and the role that technology does (and can) play in tackling climate change. It was a fantastic opportunity to share with leaders across sectors and industries how we’ve built our Defra e-Sustainability Alliance (DeSA) from a few suppliers to now over 300 technology companies and service providers. I was also keen to set out how we’ve driven the embedding of sustainability and green IT commitments into technology strategies right across government."
        },
        {
            "text": "It was a great day, and I was immensely proud to talk about the things we’ve achieved as a team and set out how I think we can keep the momentum by working with COP27, the UN, our e-Sustainability Alliance, and continuing to talk about all this great work on various stages, both nationally and internationally."
        },
        {
            "heading": 5,
            "text": "Technology has a massive role to play in supporting the sustainability agenda."
        },
        {
            "heading": 2,
            "text": "How technology is playing its part"
        },
        {
            "text": "Technology and tech teams have a massive role to play in supporting the sustainability objectives of the organisations they support. We’ve been publishing information on emissions from government technology for over 10 years now. And we’ve seen steady reductions in emissions through things like the move to cloud, enabling us to leverage hyperscale level datacentres and cutting-edge technology."
        },
        {
            "text": "More widely you can see the role that technology is playing in the rapid acceleration of tech such as electric vehicles in reducing our reliance on fossil fuels for transportation. It’s not just the electric motors that enable that, it’s the interaction between the vehicle, the availability of charging points, having that data on our mobile phones or dashboards, allowing us to plan our journeys more effectively and so on."
        },
        {
            "text": "Technology won’t solve everything though. Minimising climate change will require massive behavioural and societal changes. So, we need a greater focus on how technology and data can help drive that."
        },
        {
            "heading": 5,
            "text": "The Tech Industry has a platform to demonstrate that it can provide many of the solutions to minimise climate change."
        },
        {
            "heading": 2,
            "text": "Seeing the green shoots of progress"
        },
        {
            "text": "One of the things I’m proud of is the work we did to build sustainability requirements into our major technology procurements back in 2015. We also built a collaboration requirement on our suppliers linked to this – to work together to improve sustainability."
        },
        {
            "text": "This started with just six suppliers, who wanted to include their suppliers, and in three years it grew to an alliance of over 300 technology companies that are collaborating on sustainability."
        },
        {
            "text": "That alliance reached a crescendo last year when we joined with those companies, the United Nations, WWF, and UNICEF to host a Technology for Climate Action event at COP 26 in Glasgow. We involved CEOs from many of the major tech suppliers, to showcase what tech can achieve."
        },
        {
            "heading": 2,
            "text": "The year ahead looks exciting"
        },
        {
            "text": "Our e-Sustainability Alliance now has so much momentum to deliver key thinking, guidance and more around some of the most tricky issues facing ICT in the sustainability arena, for example, supply chain issues, or the impact on ecology and biodiversity. The alliance will be setting out a roadmap shortly."
        },
        {
            "text": "The chance to talk about all this great work on various stages, forums etc both nationally and internationally presents a great opportunity for us to influence others, and to showcase our work in Defra and across government to help nations around the globe on their own journeys."
        },
        {
            "text": "For me that’s a platform for the tech industry as a whole to demonstrate that it can provide many of the solutions to minimise climate change, to mitigate its impacts and show real leadership."
        },
        {
            "text": "Chris Howes is Defra’s Chief Digital and Information Officer."
        },
        {
            "text": "Want to know more?\nLed by the United Nations Environment Programme, and held annually on 5 June since 1974, World Environment Day is the largest global platform for environmental public outreach and is celebrated by millions of people across the world."
        },
        {
            "text": "This year it is hosted by Sweden, and the theme is #OnlyOneEarth. Download the #OnlyOneEarth Practical Guide to living sustainably in harmony with nature, developed for World Environment Day 2022."
        }
    ]
}