{
    "url": "https://ukhsa.blog.gov.uk/2023/11/17/a-look-back-at-the-ukhsa-annual-conference-for-2023/",
    "title": "A look back at the UKHSA annual conference for 2023",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Protecting the country's health",
        "UKHSA"
    ],
    "pub_date": "2023-11-17T19:12:18+01:00",
    "content": [
        {
            "text": "Our second annual conference, #UKHSA2023 brought together a range of people involved in public health and health protection science for speeches, panel discussions and exhibitions. It was a fascinating and busy 2 days in Leeds, with representatives joining from across the sector."
        },
        {
            "text": "As well as colleagues from across UKHSA, devolved administrations, local authorities, the NHS and Directors of Public Health; there were partners in industry, government, the charity sector and academia."
        },
        {
            "text": "The subjects were serious, but energy and enthusiasm were much in evidence. Topics ranged from pandemic preparedness to the health effects of climate change, emphasising the importance of vaccination and our collective responsibility in addressing health inequalities."
        },
        {
            "text": "Antimicrobial resistance (AMR), was a central theme in many conversations throughout the conference, and we launched our 10th English Surveillance Programme for Antimicrobial Use and Resistance (ESPAUR) report."
        },
        {
            "text": "In her opening keynote, our Chief Executive Prof. Dame Jenny Harries sent out an 'AMR SOS', calling for renewed focus and action to address this potential public health crisis: 'we are fighting one pandemic on the back of another: we need to call upon ourselves to go further and faster than before.'"
        },
        {
            "text": "Many discussions were had and connections made during the conference, which will hopefully inform and enrich our work in public health over coming months."
        }
    ]
}