{
    "url": "https://buyingforschools.blog.gov.uk/2023/11/17/getting-your-school-ready-for-winter/",
    "title": "Getting your school ready for winter",
    "authors": [
        "Paul McKeown, DfE Water Strategy Team"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2023-11-17T10:05:04+00:00",
    "content": [
        {
            "text": "Paul McKeown works in the Department for Education’s Water Strategy Team. In this blog post, Paul shares some useful tips to help prepare your school for winter and reduce the risk of disruption that adverse weather conditions can bring."
        },
        {
            "text": "I lead on the delivery of flood protection projects for schools that are at the highest risk of flooding. Having worked in the water industry for 30 years, I want to share some of my experience and key preparation tips to help keep your school operating without disruption as we move into the winter months."
        },
        {
            "text": "Cold temperatures can lead to burst pipes and sometimes these can run for a while before they are discovered, for example, over school holidays where buildings are closed for an extended period. This can lead to extensive damage."
        },
        {
            "text": "Do you know where to turn off the water in your school? It’s a simple point, but an important one. Something you could consider installing is an actuated valve and a water meter linked to the building management system. This would enable you to turn off the water remotely and quickly in case of an internal burst. An actuated valve has a small motor attached to a valve that can be controlled by the building management system, so when an alarm is triggered, or unusual flows noticed, you can act quickly and and investigate the cause."
        },
        {
            "text": "To reduce the risk of burst pipes, I recommend you check that exposed pipework is lagged (insulated). This is not only useful to prevent freezing, but beneficial for saving energy as it keeps the heat in. Tanks should be insulated, but not from underneath as the heat from the building is used to stop them freezing."
        },
        {
            "text": "If any work has been undertaken on the pipes at your school, check the insulation has been replaced properly. To prevent freezing, activate your heating's frost protection setting and consider trace heating spaces with water storage/pipework to maintain the temperature above freezing. Trace heating is a where a small heater maintains the temperature of a space and/or pipes directly to prevent them freezing. "
        },
        {
            "text": "When there has been an extended cold period and then sudden warmer weather, a ‘freeze thaw’ event can occur underground. Of course, just because you can’t see the water, it doesn’t mean there isn’t a leak. A good way to check for hidden leaks is to read the water meter before and after holidays and shut off the internal pipework overnight to see if the meter changes. Lost water can be costly, so don’t forget to claim the leakage allowance for sewerage charges if you have had a significant leak."
        },
        {
            "text": "We have already seen storms and flooding this year. Simple preventative measures like removing leaves and silt from drains and clearing gutters and downspouts can make a difference. If you’ve got bushes and grass growing out of them, it’s not a good sign."
        },
        {
            "text": "If you experience sewage flooding contact your water company to investigate, there’s no charge for this. Pictures and videos are always helpful to inform any investigation. It could be caused by a temporary blockage or a more serious issue, and the water company is required to keep a register of properties with sewer flooding issues so always ask for a copy of their report."
        },
        {
            "text": "Quick tips"
        },
        {
            "text": "I hope this information is useful in planning protection measures for your school."
        },
        {
            "text": " "
        }
    ]
}