{
    "url": "https://vets.blog.gov.uk/2023/11/17/government-veterinary-services-gvs-at-the-london-vet-show-2023/",
    "title": "GOVERNMENT VETERINARY SERVICES (GVS) AT THE LONDON VET SHOW 2023",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Policy Work",
        "Professional development"
    ],
    "pub_date": "2023-11-17T13:13:40+00:00",
    "content": [
        {
            "text": "The Government Veterinary Services represents the community of vets working across government. We are at the London Vet Show so please stop by our stand (N70 in Hall S3) to learn more about what we do."
        },
        {
            "text": "Led by the UK Chief Veterinary Officer (CVO), Christine Middlemiss, the Government Veterinary Service (GVS) provides professional consistency, collaboration and community for government vets.    Working across government, in all countries of the UK, vets are integral in protecting the animals and people against disease threats, underpinning government policy by providing expert advice, undertaking valuable research, ensuring food safety and security and enabling UK trade."
        },
        {
            "text": "The work of the GVS is delivered across a number of different departments and agencies."
        },
        {
            "text": "Susan Paterson (RCVS President) kindly shares her views of the GVS from her attendance at the ‘Veterinary Public Health Association (VPHA) and Association of Government Veterinarians (AGV) Conference’."
        },
        {
            "text": "Jane Clark,  Director of Veterinary Services, Food Standards Agency (FSA), reflects on her  ‘Career Story’ in the GVS."
        },
        {
            "text": "See you at the GVS exhibit, London Vet Show, Stand N70 in Hall S3, or visit our website to find out more about working as a vet in government."
        }
    ]
}