{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/17/join-the-monthly-gse-community-of-practice/",
    "title": "Join the monthly GSE Community of Practice",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Profession Updates"
    ],
    "pub_date": "2023-11-17T09:36:31+00:00",
    "content": [
        {
            "text": "The Government Science and Engineering (GSE) Profession runs a monthly Community of Practice meeting. This is open to all members of the GSE Profession to attend and is a space for members to come together to listen, learn and share ideas. Community of Practice meetings are designed to bring together people with a shared interest in a topic to network and share knowledge – for us, that topic is the broad space that makes up government science and engineering."
        },
        {
            "text": "The Profession Team use the meeting to share updates on ongoing work, share new ideas and upcoming schemes and request feedback from our members. Within each meeting there is also designated space to spotlight or deep-dive into items from our members – these can be research areas of interest, signposting support that your team provides across government or presenting a topic for discussion."
        },
        {
            "text": "So far in 2023, we have been joined by members presenting on the Future of the Subsurface, the Data Science Campus, the Parliamentary Office of Science and Technology (POST) and the National Education Nature Park and Climate Action Award scheme. Still to come this year, we look forward to welcoming members to speak on Space Sustainability."
        },
        {
            "text": "As always, we want these meetings to be led by our members. If you are a GSE member and you would like to share your area of expertise, suggest something you would like to hear about or get more information on the monthly Community of Practice meeting, email gse@go-science.gov.uk."
        }
    ]
}