{
    "url": "https://marinedevelopments.blog.gov.uk/2023/11/17/latest-news-from-mmos-marine-licensing-team/",
    "title": "Latest news from MMO's Marine Licensing Team",
    "authors": [
        "Gareth Hern, MMO"
    ],
    "categories": [
        "marine licensing"
    ],
    "pub_date": "2023-11-17T12:32:11+00:00",
    "content": [
        {
            "text": "Kittiwake nesting towers"
        },
        {
            "text": "The team granted a marine licence for a project that was the first of its kind, the installation of nesting structures for kittiwakes in Lowestoft. Ørsted is preparing to build its Hornsea Three wind farm off the East Anglia coastline. The applicant undertook geographical surveys ahead of building two artificial nesting structures for vulnerable black-legged kittiwakes."
        },
        {
            "text": "The innovative design of the structures includes narrow ledges and vertical sides to mimic the cliffs on which the kittiwakes normally nest. The structures will be built 1km from the shoreline and will have about 500 nesting units on each. There are eight sides to give kittiwakes different options in case one side is too sunny or too windy."
        },
        {
            "text": "Catapult Offshore Renewable Energy RAS test site"
        },
        {
            "text": "An important topic in the offshore wind industry is identifying how operation and maintenance (O&M) of offshore wind farms can be made safer, cheaper, and quicker. One solution to this is using Robotics and Autonomous Systems (RAS) technology to perform different O&M tasks. Currently there is no standard way to test and de-risk these technologies before they are deployed on to an offshore wind farm, which could potentially lead to damage and downtime for the offshore wind turbines if things were to go wrong."
        },
        {
            "text": "The marine licensing team received an application from Catapult for the installation of boundary markers at a testing site for novel robotic techniques for maintenance activities."
        },
        {
            "text": "The approval of the licence means there will now be an area for the novel techniques to undergo testing and will further improve the standing of Blyth as a leading renewables development area, potentially helping the local economy in the future."
        },
        {
            "text": "With the growing offshore wind initiative, techniques like this could become more common, and could allow for the cut down in maintenance time, while also increasing safety of these activities."
        },
        {
            "text": "Sizewell wave rider buoy"
        },
        {
            "text": "The wave rider buoy is located offshore of the Sizewell A and B power stations and the proposed Sizewell C site. It provides crucial information about the wave dynamics of the site and is an input into modelling of beach geomorphology, sediment transport and coastal erosion. The information gathered has been historically valuable and is essential for monitoring the site going forwards."
        },
        {
            "text": "The Centre for Environment, Fisheries and Aquaculture Science (Cefas) applied for a marine licence to service the buoy every year and to complete emergency services as required. The yearly service includes travelling in a vessel to the buoy, removing the current buoy and replacing it with a new one."
        },
        {
            "text": "The marine licensing team worked with Natural England and the Maritime & Coastguard Agency to ensure there were no environmental or navigational issues caused by the works."
        },
        {
            "text": "Burials at sea DNA extracts"
        },
        {
            "text": "MMO recently announced changes to the licensing conditions for human burials at sea for the sea burial site at The Needles off the Isle of Wight. From October 2023, those who wish a sea burial will have DNA extracted from the body prior to them being laid to rest in this designated site."
        },
        {
            "text": "This follows a number of cases over many years where body parts have been washed ashore on the Island. In future, if body parts are found, they will be matched and identified, saving the Coroner and the Police from having to obtain DNA from families of recent sea burials to identify the body and potentially mounting a suspicious death inquiry."
        },
        {
            "text": "The marine licensing team worked closely with the National Crime Agency and UK Missing Persons Unit, among others, to bring in the changes and amend all relevant guidance."
        },
        {
            "text": "Great Yarmouth third river crossing"
        },
        {
            "text": "MMO worked closely with the applicant (Norfolk County Council) when they applied for a Development Consent Order (DCO) for a proposed development for a third crossing over the River Yare. As an interested party, MMO submitted relevant representations to the Planning Inspectorate (PINS) during the examination phase and drafted a Deemed Marine Licence (DML)."
        },
        {
            "text": "In 2020, the Secretary of State for Transport confirmed the Development Consent Order application to construct, operate and maintain the bridge and its approaches. The Government approved the final business case for the project and construction started in 2021."
        },
        {
            "text": "The crossing creates a more direct link and better access between the western and eastern parts of Yarmouth. Earlier this year the public voted and selected the permanent name 'Herring Bridge' for the crossing. The most recent major milestone has seen the two giant bridge leaves lifted into position."
        }
    ]
}