{
    "url": "https://moderncivilservice.blog.gov.uk/2023/11/17/meet-the-modern-civil-service-sonia-pawson/",
    "title": "Meet the Modern Civil Service: Sonia Pawson",
    "authors": [
        "modernistionandreform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Interview",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2023-11-17T12:33:44+00:00",
    "content": [
        {
            "heading": 4,
            "text": "How we bring A Modern Civil Service to life and make it a reality."
        },
        {
            "text": "Hello! Welcome to the first blog in our new interview series: Meet the Modern Civil Service. The aim of this series is to showcase the people in the civil service who are innovating change, whether that be through being a learning champion, embracing digital and data into their daily working or helping develop new hubs outside of Whitehall. If you think you or your team have done work that channels reform and innovation, we’d love to hear from you and showcase your achievements on our A Modern Civil Service blog."
        },
        {
            "text": "As part of the Skilled Civil Service theme, Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit spoke with Sonia Pawson, Executive Director of the Government Skills and Curriculum Unit, about what a modern civil service means to her, as well as illustrate examples of reform being undertaken and how all civil servants will benefit from these positive changes."
        },
        {
            "heading": 2,
            "text": "What does A Modern Civil Service mean to you?"
        },
        {
            "text": "A Modern Civil Service is a skilled one, and when posed this question by Deepa, Sonia was keen to explore the idea of learning skills and capability. But how do we bring it to life and make it a reality for people? At the heart of a Skilled Civil Service, Sonia believes it’s important to keep our knowledge and skills up to date, and stay aware of the skills, knowledge and proficiency levels for their professions. For leaders and senior civil servants, she encourages role modelling good learning behaviours such as progressing with continuous professional development—and for all staff to review the Government Campus Prospectus online to identify knowledge gaps and promote curiosity in skills they might not have otherwise considered."
        },
        {
            "text": "While line manager capability is at the forefront of training and development, Sonia recognises that line managers also need to support development and give staff the opportunity—and time—to engage with learning or attend networking events that will improve their knowledge base and lead to more cohesive cross-government working."
        },
        {
            "heading": 2,
            "text": "What is the importance of taking time to learn and how can staff get involved?"
        },
        {
            "text": "Learning is lifelong and as the Executive Director of the Government Skills and Curriculum Unit, Sonia is a strong role model of that school of thought. She acknowledges that learning takes many forms and isn’t just the sum of watching a lecture or presentation. The 70:20:10 model is one such learning model that prioritises learning from experiences, experiment and reflection, before supplementing that learning with working with others and planned learning sessions. However, Sonia recognises the importance of formal learning days for professional, team and organisational development. "
        },
        {
            "text": "Talking with your peers—whether that’s teammates, those in your professions or the team sitting near you in the office!—is an excellent way to learn about new experiences and opportunities. There are also going to be specific learning and development tied to professions and specific to job roles that will enhance performance. "
        },
        {
            "heading": 2,
            "text": "The importance of joining professional networks"
        },
        {
            "text": "There’s an inextricable link between skills development and career progression, and everyone in the civil service should be a member of at least one profession. (Did you know you can join more than one profession?)"
        },
        {
            "text": "Many civil servants may identify with several professions, particularly if they have experience in other areas. Sonia has a background in psychology, but currently sits within the HR profession, so she is part of the HR profession, analysis profession and government science and engineering profession, and she encourages civil servants to join professions that link to perhaps previous career experiences, qualifications or new professional interests."
        },
        {
            "heading": 2,
            "text": "What are the links between skill development and career progression?"
        },
        {
            "text": "In terms of skills development and career progression, the curriculum for government sets out the foundational skills that every civil servant needs. That is, the skills that you need to work in government, the skills that you need as a leader and manager, and the specific domain requirements as well."
        },
        {
            "text": "Sonia continues, “what we're trying hard to do in the civil service is support long term career pathway development through precise definition and we've actually asked professions and we're working with professions to define the requirements that you need at every level of the organisation.” As professions shore up what the requirements are for entry, practitioner and expert levels, civil servants will become more aware of the skills and knowledge required, empowering them to approach their line managers to ask “where am I now, and how can I reach the next level and what can I prioritise to get me there?”"
        },
        {
            "text": "Reiterating the importance of continuous professional development for every civil servant, Sonia defines one of the commitments of Government Skills and Curriculum unit as delivering a “clearly defined, cohere curriculum that enables long term career pathways and progression”, which the unit hopes to achieve through the strand model and data driven learning."
        },
        {
            "heading": 2,
            "text": "Prioritising learning"
        },
        {
            "text": "Learning and continuous professional development should be one of the top priorities for civil servants at all levels. Contemporaneous knowledge and skills are key to building a modern civil service and Sonia was keen to stress again the importance of support for line managers to enable their teams to engage in continuous learning, one-off events and more."
        },
        {
            "text": "Knowing what kind of learning to prioritise is a difficult challenge, as you need to understand the needs of your team as well as your own role. This can influence what the most important learning is at the time, whether that’s an introductory courses to the civil service if you’ve joined from the private sector, or specialist training in a particular profession—even learning about how to use Microsoft Excel or Google Sheets counts as a priority!"
        },
        {
            "text": "One way to make sure you’re prioritising the correct learning is to read the prospectus online and look at training and learning events within your profession, identify what you’re interested in or a knowledge gap, then speak with your line manager to come up with a learning development plan. This might mean reserving time each week to facilitate that learning, in line with the civil service commitment for structured learning and development days."
        },
        {
            "text": "For new starters, the standardised Civil Service Induction is a great place to start, whether that’s to learn more about writing masterclasses or focusing on digital and data capability."
        },
        {
            "heading": 2,
            "text": "One Big Thing is not just for Christmas"
        },
        {
            "text": "Embracing data-driven working is an organisational challenge, one that One Big Thing hopes to tackle. It’s a condensed seven hours of learning that will help civil servants understand data, why it matters and how it benefits the workplace, enabling them to get hands-on experience using data, and drawing on their own experiences to evaluate how they use data."
        },
        {
            "heading": 2,
            "text": "A modern and distributed civil service"
        },
        {
            "text": "The world of work is changing, with hybrid working now more commonplace and AI integration gaining popularity. Technology changes the way we do things, whether that’s distributing laptops to enable civil servants to work remotely or adopting automatic processes that make the workflow more manageable. "
        },
        {
            "text": "During the interview, Sonia recognised that while using technology to help us deliver a modern service to the public, humans still need to be at the front and centre of a skilled civil service. The bottom line? Civil servants need to work collaboratively across professions, and build on skills and capabilities to be ready for the future."
        },
        {
            "heading": 2,
            "text": "Skills for the future"
        },
        {
            "text": "There’s no right or wrong way to build skills and educate yourself to become a skilled professional. What is important is role and profession clarity so you can access the right training and people needed to succeed. For Sonia, an emphasis on digital data skills is key to that success across all functions, professions and departments. Working towards STEM ambitions with the fast stream in science and engineering professions are part of that strategy, as well as recognising the worth of recruiting individuals with linguistic talents to improve the civil service’s networking capability."
        },
        {
            "text": "Ultimately, recruiting and training a skilled and knowledgeable workforce is at the heart of delivering the best service to the public. With over half the workforce in operational delivery roles, a breadth  of skill sets and training must be available to suit the needs of every profession, function and department and have a good quality offer for everyone. The current apprenticeship scheme is one such example of highlighting potential aptitude in candidates to re-skill in a specific area, which is a great way of enabling that."
        }
    ]
}