{
    "url": "https://environmentagency.blog.gov.uk/2023/11/17/setting-out-our-vision-for-science-in-the-environment-agency/",
    "title": "Setting out our vision for science in the Environment Agency",
    "authors": [
        "Dr Robert Bradburne"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-17T13:02:59+00:00",
    "content": [
        {
            "text": "On November 22 our Chief Scientist Robert Bradburne will be formally launching the Environment Agency’s Science Strategy at the Science Profession Conference in London. Science plays such an important role in nearly everything the Environment Agency does, and this strategy highlights the organisation’s unique capabilities provided through a combination of our scientific assets and skilled, often world-leading staff. It sets out our vision for science in the organisation to 2030, describing the broad areas of science where we will continue to invest in ourselves and work in partnership with others to achieve our ambitions."
        },
        {
            "text": "Why science is so important to the Environment Agency"
        },
        {
            "text": "The Environment Agency is here to create better places, and this presents some unique challenges – the environment is changing, and with it, our requirements and expectations are changing too. Our science is purposeful, providing us with the insights we need to decide how to respond to the changes we are experiencing, underpinning our operational work to protect and improve the environment, and enabling us to assess the impacts these interventions are having."
        },
        {
            "text": "Our science is about more than delivering insight. It is also fostering and capturing innovation to advance the Environment Agency’s work, supporting our planning for, and response to, incidents, and offering highly specialised scientific services such as horizon scanning. The strategy spans this huge variety of science, also highlighting the close links to data, social and economic sciences, and the interaction our scientists have with the Environment Agency’s engineers and specialists."
        },
        {
            "text": "Our vision for science"
        },
        {
            "text": "People are at the heart of our vision for science. Building a thriving scientific community equipped with the best assets and able to conduct highly regarded science and research will be key to our success. We will do this by:"
        },
        {
            "text": "Working with others"
        },
        {
            "text": "We recognise that the Environment Agency’s need for excellent science and robust research to create a better place for people and wildlife cannot be answered in isolation. Scientists in the Environment Agency have already developed partnerships across the UK with the Defra Group and other Government Departments, PSREs and public bodies, and research funders and academia. We also have several important international links with individual countries and multilateral organisations."
        },
        {
            "text": "But we want to do more. So, within the strategy, we have set out the areas of scientific interest that are most relevant to our scientific aims and statutory duties. We want to use this opportunity to strengthen the partnerships we currently have and foster new ones to make best use of the knowledge, expertise and resources that are available across the UK and internationally."
        },
        {
            "text": "If you want to know more about the science strategy or want to give us feedback on how we can bring our ambitions to life, then please contact research@environment-agency.gov.uk"
        }
    ]
}