{
    "url": "https://ruralpayments.blog.gov.uk/2023/11/17/the-rural-payments-agency-podcast-episode-7/",
    "title": "The Rural Payments Agency Podcast: Episode 7",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "RPA podcast",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-11-17T16:18:55+00:00",
    "content": [
        {
            "text": "Welcome to the seventh episode of The RPA Podcast."
        },
        {
            "text": "In our latest episode, we dive into some of the questions and feedback we’ve received at the RPA from those applying to the 2023 offer of the Sustainable Farming Incentive."
        },
        {
            "text": "After opening to applications in August, we received a number of technical and general questions, both from farmers in the process of applying and those considering doing so. Speaking to our expert in the RPA Sustainable Farming Incentive (SFI) Delivery team, Stephen Veasey, we get the answers to the most frequently asked questions RPA has received. You can see the Q&A here which will be kept updated on a rolling basis."
        },
        {
            "text": "Stephen will be discussing the benefits of applying, looking into how the scheme has been created to allow all farmers to tailor to the needs of their land and actions that can be taken before applying, to streamline the application process. We will also discuss the number of accepted applications and offers in the pipeline. This figure was correct at time of recording but will increase over the coming weeks."
        },
        {
            "text": "You can also read the transcript for this episode here."
        },
        {
            "text": "The RPA Podcast is an opportunity to engage with farmers and land managers in a different way, and we encourage you to reach out to us with suggestions of particular topics you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to episode 7 of The RPA Podcast on Apple and Spotify or through Buzzsprout."
        },
        {
            "text": "You can also listen to earlier episodes of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts."
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        },
        {
            "text": " "
        }
    ]
}