{
    "url": "https://ruralpayments.blog.gov.uk/2023/11/17/the-sustainable-farming-incentive-commonly-asked-questions-answered/",
    "title": "The Sustainable Farming Incentive: Commonly asked questions answered",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "RPA podcast",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-11-17T16:24:32+00:00",
    "content": [
        {
            "text": "In the most recent episode of the RPA podcast, we answered some of the commonly asked questions received in relation to the 2023 offer of the Sustainable Farming Incentive (SFI). We recognise that new questions may arise as even more farmers take up the opportunity. This blog will be kept updated with answers to questions as they come in – as we continue to support you through the agricultural transition process."
        },
        {
            "text": "SFI offers benefits for both for the productivity and resilience of your farm and for the environment it exists within. In the SFI scheme, there are 23 actions to choose from, sitting across eight areas – soil health, moorlands, hedgerows, integrated pest management, nutrient management, farmland wildlife, buffer strips and low input grassland. By applying sustainable food production practices on your farm, you could improve soil health, enhance farmland biodiversity or help mitigate the impact of extreme weather - all of which help look after your farm in both the short and long term."
        },
        {
            "text": "You can also enter as much land as you want and choose how many actions you do. Then, once you’re in SFI, you can add more land and actions to your agreement each year as needed. How you complete the actions is up to you."
        },
        {
            "text": "We’ve made continuous improvements to our schemes, making it as easy and straightforward as possible to apply. For agreements issued in 2024 and onwards, your first payment will be four months after your SFI agreement starts. After that you’ll be paid every three months, so you have regular, reliable income."
        },
        {
            "text": "Once a farmer has received their agreement for the SFI scheme, they will be paid over a three-year period to take environmental land management actions - to support farmers to manage land in a more sustainable way. There is also the opportunity to receive a one-off payment for a vet to visit your farm annually to review the health and welfare of your livestock and give you advice about improvements that could be made."
        },
        {
            "text": "The environmental land management actions in SFI will have benefits for both the environment and agricultural productivity. The scheme will help make agriculture more environmentally sustainable – but it’s also about farmers continuing their vital role in producing food and has been designed with this aim in mind."
        },
        {
            "text": "Applicants are able to have a Countryside Stewardship or Environmental Stewardship agreement and an SFI agreement at the same time. This means you can combine SFI actions with other scheme options, providing even greater flexibility. However, applicants should be aware that actions must be compatible, and they can’t be paid for the same action twice. Further information on this is given in both the ‘SFI Handbook’ and the ‘How to Apply’ guide which can be found on GOV.UK."
        },
        {
            "text": "Firstly, farmers need to make sure their land data is up to date. All farmers planning to apply should check their details on the Rural Payments Service and make any changes that are needed to avoid delays later in the process – mapping changes on average take around 2 weeks to process so it’s best to ensure these are processed before starting an application. We’ve published numerous resources to help advise applicants on how to do this. This includes the Handbook for the SFI 2023 offer, which sets out the full details of this year’s SFI offer, to make sure farmers could plan ahead for their applications and autumn planting – this includes a section on 'What you should do before you apply for an SFI agreement'. We also issued a ‘How to Apply’ guide in September and published an accompanying video setting out how to apply for your agreement."
        },
        {
            "text": "The best way to apply is online through the Rural Payments Agency application portal, where it’s straightforward to submit your application and manage your agreement. Once you’ve submitted your application, the RPA will issue your agreement which will start the month after you accept it. However, if you can’t apply online, for example if you don’t have access to the internet or a computer, call us on 03000 200 301 and we can help you."
        },
        {
            "text": "We now have over one thousand live agreements and over 300 further offers with customers! Some of these farmers have already received their payment within the first month of opening the scheme and we continue to make advance payments of 25% in the first month for agreements that started in October and November, this will continue until the end of this year."
        },
        {
            "text": "Farmers who’ve got an ongoing SFI22 agreement are still able to apply to for the 2023 offer and won’t need to take any other measures. RPA will work with those agreement holders to work out the best transition between agreements for them."
        },
        {
            "text": "Yes, of course. Farmers will be able to ask us to upgrade their SFI agreement each year, towards the end of the first and second years of your agreement. This will allow them to add more SFI actions and eligible land. Alternatively, if an applicant doesn’t want to wait for the anniversary of the agreement, they can begin a new application for the additional actions on land, either within the current SFI agreement or new land."
        },
        {
            "text": "SFI has a rolling application window, so you can apply at the right time for you. When you receive and accept your offer the agreement will begin on the first of the following month."
        },
        {
            "text": "We’ve designed SFI with tenants firmly in mind and we’ve been working closely with the Tenant Farmers Association on the issues that matter to the farmers that they represent."
        },
        {
            "text": "We’ve ensured that more tenant farmers can access SFI than has been the case under previous schemes. This includes farmers with tenancies on a ‘rolling’ year-by-year basis, who can enter that land into SFI – if they expect to have ‘management control’ of it for the 3-year duration of their SFI standards agreement."
        },
        {
            "text": "Tenants may need to get their landlord’s permission – that will depend on the terms of their individual tenancy agreement.  In practice, most SFI actions will work alongside tenancy actions, but it’s the tenant’s responsibility to confirm this. However, (unlike Countryside Stewardship) SFI doesn’t specifically require tenants to confirm landlord permission as part of application process."
        },
        {
            "text": "Start by taking a look at the guidance out there and making a judgement, based on what you think is best for your land and business – and you can find guidance at www.gov.uk/future-farming. There’s a lot of great opportunities available in the scheme so it’s definitely worth taking a look to avoid missing out!"
        },
        {
            "text": "We’re rolling out SFI environmental land management actions incrementally. As the scheme expands each year, more SFI actions will be introduced, so the scheme keeps developing and the full set is available by the end of 2024.  You’ll be able to add more actions and eligible land to your SFI agreement each year."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}