{
    "url": "https://environmentagency.blog.gov.uk/2023/11/17/update-on-environment-agency-investigation-3/",
    "title": "Update on Environment Agency investigation",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-17T10:17:22+00:00",
    "content": [
        {
            "text": "Tomorrow marks two years since we announced the launch of a major investigation into potential widespread non-compliance by water and sewerage companies at wastewater treatment works."
        },
        {
            "text": "It is the largest ever criminal investigation we have undertaken to date. The investigation is examining potential breaches of environmental permit conditions by all water and sewerage companies operating in England."
        },
        {
            "text": "As with any live criminal investigation, we are very limited as to what we can share about our inquiries. However, we are committed to sharing information where we can."
        },
        {
            "text": "A key part of the current phase of our investigation is to conduct site visits to gather evidence. The extent of potential non-compliance involves more than 2000 wastewater treatment works. Specially selected ‘indicator sites’ have been identified to be representative of all the wastewater treatment works where offending may have occurred. Our specialist investigators have now completed visits to all of the 114 identified indicator sites which cover a spectrum of works ranging in size, across the entire area covered by each water company, and discharging to differing environmental and amenity sensitivities."
        },
        {
            "text": "Each water company has had around 10 different site visits from our investigators. From these visits we have obtained evidence including the working practices at each site. We have focused on matters such as flow systems and monitors, maintenance regimes, management practices and site diaries to acquire an in-depth understanding of the works and to secure and preserve evidence relevant to our lines of inquiry. We are now analysing the data and the thousands of documents obtained. This will take many months."
        },
        {
            "text": "When the investigation is complete we will consider all options available under our enforcement and sanction policy. Environmental permits exist to protect our environment and limit the impact of pollution; water companies have a legal responsibility to comply with their permit conditions."
        },
        {
            "text": "While our investigation continues, our teams continue to conduct normal water company regulation activity at wastewater treatment works including auditing their compliance records and responding to reports of pollution incidents."
        },
        {
            "text": "You can find more information about this investigation here."
        },
        {
            "text": " "
        }
    ]
}