{
    "url": "https://space.blog.gov.uk/2024/08/09/meteors-galore-and-a-planetary-conjunction-the-night-sky-in-august-2024/",
    "title": "Meteors galore and a planetary conjunction: the night sky in August 2024",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-08-09T14:27:03+01:00",
    "content": [
        {
            "text": "August nights bring one of the best meteor showers of the year, a chance to see a conjunction of Mars and Jupiter, and watch our Moon pass in front of ringed-planet Saturn."
        },
        {
            "heading": 2,
            "text": "Perseid Meteor Shower"
        },
        {
            "text": "This month, Earth ploughs through a trail of fragments of rock, ice and dust left in the wake of Comet Swift-Tuttle, a comet first documented by Chinese astronomers over 2,300 years ago."
        },
        {
            "text": "The fragments, most no larger than the size of a pea, collide with our atmosphere travelling at speeds of around 58km (36 miles) per second.  "
        },
        {
            "text": "They heat up to temperatures of over 1,500 Celsius and streak across our night sky in what we know as the Perseids meteor shower, one of the highlights of the astronomy calendar."
        },
        {
            "text": "The comet itself is a 26km (16 mile)-wide ball of rock and ice on a very eccentric, or elongated orbit."
        },
        {
            "text": "While it’s currently drifting some 50 times further from the Sun than Earth (well beyond the orbit of former-planet Pluto), every 133 years or so its orbit brings it back into the inner Solar System."
        },
        {
            "text": "On its journey, passing closer to the Sun than the Earth does, it is blasted by solar radiation, causing fragments to lift off the surface of the comet.  These fragments continue to drift through space, following the path of the comet."
        },
        {
            "text": "As our planet moves around the Sun, trails of comet fragments cause over 900 known meteor showers every year, with around 110 of these being well established.  Around 30 of these produce the classic \"shooting stars\" visible to us here on earth’s surface."
        },
        {
            "text": "Perseid meteors will be visible all month, but numbers rise significantly between 9 and 16 August, and 60 - 100 meteors an hour could be visible on the nights of 12 – 13 August."
        },
        {
            "text": "Perseid Meteor Shower observing tips"
        },
        {
            "heading": 2,
            "text": "Other night sky sights this month:"
        },
        {
            "text": "A rare lunar occultation of the planet Saturn will take place in the early hours of 21 August."
        },
        {
            "text": "Look low in the southern sky shortly after 4.15am to see the Moon approach and then pass in front of Saturn.  Saturn emerges from the other side of the Moon around an hour later as the morning skies start to lighten."
        },
        {
            "text": "Those with a telescope will get the chance to see our Moon pass in front of a moon of another planet."
        },
        {
            "text": "Saturn’s largest moon Titan (the second largest moon in our Solar System) is visible just to the right of the ringed planet on this night."
        },
        {
            "text": "There is a close conjunction of Mars and Jupiter in our morning skies this month."
        },
        {
            "text": "Early risers can enjoy the two bright planets appearing close to each other throughout the month, rising around 1:00am and shining brightly low in the east until they’re lost in the light of the rising Sun."
        },
        {
            "text": "They’ll appear closest in the early hours of 14 August where, despite seeming close together, they’ll be over 500 million kilometres (300 million miles) apart."
        },
        {
            "text": "The two planets currently appear just below the Pleiades star cluster, and just to the left of red-giant star Aldebaran, and it’s a great opportunity to observe the reddish hue of Mars."
        },
        {
            "text": "Finally, keep an eye out for Noctilucent Clouds this month.  These “night-shining” clouds are rare, pale blue ‘clouds’ that are formed when ice crystals form at an altitude of around 80km (50 miles)."
        },
        {
            "text": "During the summer months, these clouds are under-lit by the Sun which lies just below the northern horizon during the night, causing them to ‘glow’. You can find more information in last month’s blog."
        },
        {
            "text": "There’s likely only a few weeks left to spot them this year, so look north an hour or two after sunset and before sunrise for the best chance to see them."
        }
    ]
}