{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/09/quarterly-homelessness-statistics/",
    "title": "Quarterly homelessness statistics",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2024-08-09T10:30:02+01:00",
    "content": [
        {
            "text": "Yesterday the Department published its quarterly homelessness statistics from Jan-March 2024 showing record numbers of households, including those with children, in temporary accommodation."
        },
        {
            "text": "There have been several pieces of national coverage including The Mirror, The Guardian and The Times reporting on families in temporary accommodation being at a 19 year high and The Times reporting the increase in refugees leaving Home Office accommodation and presenting as homeless."
        },
        {
            "text": "The Deputy Prime Minister is quoted prominently throughout the coverage including in the Mirror’s print headline ‘Rayner: We’ll end the scandal of kids without a home’ and others lead with the Deputy Prime Minister’s language that the figures are “nothing short of a national scandal” as the country faces the “most acute housing crisis in living memory”."
        },
        {
            "text": "The coverage includes comment from Shelter’s Polly Neate, Big Issue founder Lord Bird, Amnesty International, Rick Henderson, CEO of Homelessness Link and The Local Government Association who call on the Government to build more affordable homes and highlight insecurity in the housing market as a reason for the increase in homelessness."
        },
        {
            "text": "Deputy Prime Minister and Housing Secretary, Angela Rayner, said: "
        },
        {
            "text": "“We are facing the most acute housing crisis in living memory and homelessness remains at record levels. This is nothing short of a national scandal."
        },
        {
            "text": "“Urgent action must be taken to fix this. That’s why we are working across Government and with local leaders to develop a long-term strategy to end homelessness for good."
        },
        {
            "text": "“Work is already under way to stop people from becoming homeless in the first place."
        },
        {
            "text": "“This includes delivering the biggest increase in social and affordable homebuilding in a generation, abolishing Section 21 ‘no fault’ evictions and a multimillion-pound package to provide homes for families most at risk of homelessness.”"
        }
    ]
}