{
    "url": "https://nationalscreening.blog.gov.uk/2024/07/22/beths-love-of-problem-solving-is-ideal-for-her-uk-nsc-role/",
    "title": "Beth’s love of problem-solving is ideal for her UK NSC role",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-07-22T09:23:08+01:00",
    "content": [
        {
            "text": "Assessing complex evidence about the potential benefits and harms of screening aligns perfectly with Professor Bethany Shinkins’ love of an intellectual challenge, data analysis and problem-solving."
        },
        {
            "text": "Beth is Professor of Health Economics, Diagnosis and Screening at the University of Warwick and a test expert member of the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "Her longstanding interest in screening includes being involved in the Yorkshire Lung Screening Trial, a randomised controlled trial (RCT) that the UK NSC referenced in its positive recommendation for a national targeted lung cancer screening programme."
        },
        {
            "text": "“My research career has focused on the evaluation of medical tests, spanning a wide range of diseases and clinical settings, and trying to think through how we can efficiently produce high quality evidence for tests,” she said."
        },
        {
            "text": "“Over time it has shifted to increasingly focus on earlier diagnosis and hence I’ve ended up working in the screening field, which is really interesting and complex. I am particularly interested in improving the research methods used to evaluate diagnostic and screening tests."
        },
        {
            "text": "“It’s a real challenge but it’s also fascinating. We’ve got lots of interesting stuff going on.”"
        },
        {
            "heading": 2,
            "text": "From market research to medical statistics"
        },
        {
            "text": "Beth grew up in Suffolk and her fondest childhood memories are beach days at Felixstowe."
        },
        {
            "text": "After studying psychology at the University of Kent she got a place on a graduate scheme, working as a statistician for a market research company. She really enjoyed the statistics and after a year went to the University of St Andrews to do her masters in statistics."
        },
        {
            "text": "After that she moved to Oxford, again to work for a market research company as a statistician. Although she enjoyed the statistics side of things, she did not find analysing customer satisfaction data for cereals, smoothies, or high street banks particularly exciting."
        },
        {
            "text": "By chance one of her friends, hospital consultant Dr Liza Keating, needed help with some statistics for a scientific paper she was working on."
        },
        {
            "text": "“I worked with her on that and loved it,” said Beth. “I thought this is exactly what I want to be doing. She was so inspirational to work with. Even though she had this incredibly busy clinical job, she was still thinking of ways to improve things and do research to see if they worked.”"
        },
        {
            "text": "From that point onwards, Beth shifted her career into medical statistics and health economics."
        },
        {
            "text": "“I saw a PhD advertised in the Nuffield Department of Primary Care at the University of Oxford, applied for it, and got it,” she said. “I can’t say I spent my childhood dreaming of being a medical statistician; I just sort of fell into it by chance. I was really very lucky, I love it.”"
        },
        {
            "heading": 2,
            "text": "Multidisciplinary approach"
        },
        {
            "text": "Beth’s PhD focused on the statistical methods used for evaluating the diagnostic accuracy of medical tests. After completing it she worked at the University of Oxford and then Leeds, gradually moving into health economics and building a team of researchers looking at how to make the evaluation of tests more efficient."
        },
        {
            "text": "She said: “I could see that one way to make the whole process of evaluating tests a bit more efficient, and reduce the amount of waste, was to ask early on whether something even had the potential to be cost-effective.”"
        },
        {
            "text": "What started as a team of health economists evolved into a multidisciplinary group, and research that had initially focused on diagnostics gradually started to encompass screening. This included collaborating with fellow UK NSC member Prof Sian Taylor-Phillips."
        },
        {
            "text": "Beth, like Sian, is now based at the University of Warwick where she works across 2 teams: Warwick Screening and Warwick Evidence."
        },
        {
            "text": "Warwick Screening is a team of systematic reviewers, statisticians, modellers, triallists and qualitative researchers that aims to deliver research that will impact on national screening policy to improve health outcomes."
        },
        {
            "text": "Warwick Evidence undertakes research into the clinical and cost effectiveness of health care interventions for the National Institute for Health and Care Research (NIHR) on behalf of policy makers, including the National Institute for Health and Clinical Excellence (NICE)."
        },
        {
            "text": "Beth said: “I really like the multidisciplinary nature of the work, the fact that I get to work in different clinical settings and learn about different diseases. It’s all very focused on problem solving and asking how we can make changes to improve things.”"
        },
        {
            "heading": 2,
            "text": "Screening questions are challenging but fascinating"
        },
        {
            "text": "Beth’s Warwick Screening work includes UK NSC projects looking at how to evaluate evidence on whole genome sequencing and multi-cancer detection tests – single tests that have the potential to find many conditions."
        },
        {
            "text": "This work will help to establish how high quality evidence can be generated more efficiently to support future decision-making on whether multi-condition tests can be used in screening."
        },
        {
            "text": "“Methodologically these tests are very challenging,” said Beth. “It was hard enough thinking about one disease and trying to capture all the potential benefits and harms of screening. Trying to think about multiple diseases becomes sort of mind-blowing, but it is also a fascinating methodological problem.”"
        },
        {
            "text": "The UK NSC is under increasing pressure to make more positive screening recommendations, and more quickly, for a host of conditions. This pressure is partly driven by the dizzying rate of technological advances in fields such as genomics and artificial intelligence."
        },
        {
            "text": "“The work of the UK NSC is hugely important in terms of making sure we’re introducing screening programmes that are going to benefit people, be cost and resource efficient and provide value to the NHS,” said Beth."
        },
        {
            "text": "“There's a very pro screening perspective out there and increasing pressure to make fast decisions. How we deal with that as a committee is a real challenge."
        },
        {
            "text": "“The rate of technological advance is challenging. We need to keep up in terms of the evaluation of those technologies to make sure we're recommending things that are going to benefit patients."
        },
        {
            "text": "“But we also need to keep reminding the public and lobbyists that in many cases the harms of screening outweigh the benefits. And a lot of those harms, such as the anxiety and further tests associated with false positive results or overdiagnosis and overtreatment, are really difficult to quantify in a study."
        },
        {
            "text": "“We’ve got to make sure the benefits of screening massively outweigh the harms, in part because we are testing people who generally feel healthy. We do not want to disrupt people’s lives unnecessarily. That’s fundamental and a key reason why we must be so rigorous in our evaluations.”"
        },
        {
            "text": "In a context of significant national resource and capacity constraints, Beth stresses the importance of the UK NSC being consistent and thoughtful in its decision-making."
        },
        {
            "text": "“We’ve got to be really careful that we’re not going to swamp the NHS and start disrupting other pathways,” she said."
        },
        {
            "text": "“What pleases me is the amount of discussion we have within and outside committee meetings to really think through and interrogate all the evidence. The fact that committee members have all got quite different backgrounds is very helpful in making sure we’re covering every angle."
        },
        {
            "text": "“Patient representatives come up with really interesting questions and make us think about which outcomes are important. I could easily get bogged down in the statistics and health economics, but their input helps me think more broadly.”"
        },
        {
            "heading": 2,
            "text": "Tennis and paddleboarding"
        },
        {
            "text": "Away from work, Beth lives with her partner and step-son in the picturesque West Yorkshire market town Hebden Bridge, at various times named the ‘best town in Europe’ and ‘fourth funkiest town in the world’."
        },
        {
            "text": "Beth said: “It’s lovely. There’s loads of things to do here, as long as you don’t mind being rained on.”"
        },
        {
            "text": "Those leisure activities include playing tennis, paddleboarding on nearby Hollingworth Lake, and walking in the Lake District."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}