{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/07/22/inside-bfsai-mount-pleasant-winter-capabilities/",
    "title": "Inside BFSAI: Mount Pleasant winter capabilities",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-07-22T10:12:25+01:00",
    "content": [
        {
            "text": "In British Forces South Atlantic Islands (BFSAI), Mount Pleasant Airfield (MPA) is exposed to dramatic and challenging South Atlantic winter conditions at this time of year. This climate makes the operation of the airfield challenging."
        },
        {
            "text": "1312 Flight (Flt), 905 Expeditionary Air Wing (EAW) are responsible for clearing ice and snow from the aircraft at MPA. We interviewed Chief Technician (CT) Warren Burns from 1312 Flt to get an insight."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What does 1312 Flt do?"
        },
        {
            "text": "CT Burns: Our main effort is to deliver Quick Reaction Alert (QRA) Air to Air Refuelling. We also support search and rescue missions, maritime radar reconnaissance and medical evacuations. We are on call 24/7."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How would you describe the climate in the Falkland Islands at this time of year?"
        },
        {
            "text": "CT Burns: It is very dramatic. Weather can change rapidly, sometimes only ten minutes apart. You can get temperatures down to -4 degrees but with the wind chill it feels like -15 degrees."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How do these conditions affect operations?"
        },
        {
            "text": "CT Burns: When you are operating in a cold environment, you can be working for a good few hours per aircraft. For example, there are certain metre requirements for snow to be away from the aircraft."
        },
        {
            "text": "So, it is important to manage and prevent cold injuries within the team, but you still have to be timely in completing the task at hand. Time management and resource management becomes evermore critical. It can only take one piece of equipment to fail and that could affect the delivery."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Why do you need to be timely in your operations?"
        },
        {
            "text": "CT Burns: You have hold-over times when it comes to de-icing the aircraft. If it snows within this time period, we have to re-attack. It requires team management and collaboration with several sections. In this circumstance, you have to work with the Captain, Air Traffic Control and MET to determine a new window for spraying the de-icer again. The knock-on effect for this weather is that time windows get smaller."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What are the differences for operatives in a summer climate here?"
        },
        {
            "text": "CT Burns: The main difference is in the training my team require. Demands are higher and the team have to be a lot more reactive."
        },
        {
            "text": "The Airfield Support Mechanical Transport (ASMT) team are one of the largest contributors to air operations especially in winter conditions. The ASMT team provide the snow clearance vehicles, quality assurance and product testing as well as co-ordination with the catering, aero-medical and fuel elements."
        },
        {
            "text": "Cpl Martin from ASMT, MPA, has said that the team have to be ‘highly reactive and prioritise tasks depending on the 905 Expeditionary Air Wing agenda. Equally, the snow and ice engineers are always on call to fix and repair vehicles in a timely manner. They deal with everything airside related.’"
        },
        {
            "text": "Photography by Cpl C Tierney"
        }
    ]
}