{
    "url": "https://ruralpayments.blog.gov.uk/2024/07/22/rpa-supports-farm-safety-week/",
    "title": "RPA supports Farm Safety Week",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Farm Safety"
    ],
    "pub_date": "2024-07-22T14:09:13+01:00",
    "content": [
        {
            "text": "RPA is supporting Farm Safety Week run by the Farm Safety Foundation – or Yellow Wellies as they’re known. Farm Safety Week, starting on 22 July, is the ten-year anniversary of the campaign, which brings together more than 400 partners in five countries with one simple goal - to encourage everyone in the industry to make our farms safer places to live and to work."
        },
        {
            "text": "This year’s Farm Safety Week will again highlight some of the key challenges farmers and farm workers face every day and will throw a spotlight on the dangers of ignoring near-misses. They remind farmers that, while they cannot eliminate risk completely, they can minimise it and learn from every near-miss to improve their working practices. The team will introduce audiences to inspirational individuals using their own experiences to encourage others to stay alert to the hazards on farm and offer practical guidance on how to make farms safer places to live, visit or work."
        },
        {
            "text": "The aim of Farm Safety Week is to raise awareness of the importance of working safely in farming, promote good safety practices and share positive stories about the use of innovation and education to improve safety. It also offers an opportunity for a reset in the way farmers approach farm safety and risk-taking."
        },
        {
            "text": "This year’s campaign highlights that this year’s figures on farm safety are likely to show no drastic improvement and the HSE Fatal Injuries in Agriculture, Forestry and Fishing GB report release for Day One of Farm Safety Week has shown that farming continues to have the poorest safety record in the UK and Ireland."
        },
        {
            "text": "The campaign will be exploring why farmers don’t take near-miss accidents as an opportunity to improve working practices and highlight people and organisations who are driving the improvements needed."
        },
        {
            "text": "The campaign’s objectives are:"
        },
        {
            "text": "The 2024 campaign is a special one as it marks 10 years of the Farm Safety Foundation – a charity set up by NFU Mutual to raise awareness of, and challenge attitudes to farm safety and poor mental health in the industry."
        },
        {
            "text": "According to Stephanie Berkeley who manages the charity: “Ten years have passed quickly, and we are proud of what we have achieved, but there is so much more to be done to address the massive challenges we have in the industry. Attitudes and behaviours around farm safety and mental health are changing but the pace of change is slow – too slow for the families of those we have lost in the industry and too slow for the thousands of farmers suffering every day with long term ill-health, serious injuries or poor mental health.”"
        },
        {
            "text": "Carrie Smith, External Affairs Manager from RPA added: “We are proud to support the annual Farm Safety Week campaign. Working in partnership with other like-minded organisations can help amplify important messages throughout the week. We need to challenge this industry’s safety behaviours and we need to change our poor safety record. Together we can make a difference not just for the farmers of today but for the farmers of the future.”"
        },
        {
            "text": "For more information on ‘Farm Safety Week’ visit www.yellowwellies.org or follow @yellowwelliesUK on X/Facebook/Instagram using the hashtag #FarmSafetyWeek"
        },
        {
            "text": " "
        }
    ]
}