{
    "url": "https://defrafarming.blog.gov.uk/2024/11/21/advancing-work-on-supply-chain-fairness/",
    "title": "Advancing work on supply chain fairness",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Things we're doing"
    ],
    "pub_date": "2024-11-21T15:39:41+00:00",
    "content": [
        {
            "text": "Today, Steve Reed, Secretary of State for Environment, Food and Rural Affairs, announced that the government will advance work on supply chain fairness by using the fair dealing powers in the Agriculture Act 2020.  "
        },
        {
            "text": "This will boost food security in the long term and protect producers who are vulnerable to unfair trading practices."
        },
        {
            "text": "In this post, we’ll provide background and summary.  "
        },
        {
            "heading": 2,
            "text": "Improving relations between producers and purchasers"
        },
        {
            "text": "Producers tend to be small, individual businesses operating without strong links between them. In contrast, operators further up the supply chain, processors, distributors and retailers, tend to be highly consolidated businesses that command substantial market shares. "
        },
        {
            "text": "Producers are therefore vulnerable to unfair trading practices, which can force them into contracts that impose harmful terms with limited alternatives or legal protection."
        },
        {
            "text": "In 2013, the Groceries Code Adjudicator (GCA) was appointed to oversee the relationship between the UK’s largest grocery retailers and their direct suppliers."
        },
        {
            "text": "However, most farmers do not supply supermarkets directly and so were not covered by the GCA. By using powers in the Agriculture Act 2020, we can improve the relationship between agricultural producers and their direct purchasers. This enables the introduction of regulations which apply to businesses purchasing agricultural products directly from farmers. "
        },
        {
            "text": "These can mandate that contracts include certain information. For example, termination clauses, duration, pricing information and set parameters around these details. "
        },
        {
            "text": "These fair dealing powers are being exercised on a sector-by-sector basis to account for the variation in circumstances between each agricultural sector.  "
        },
        {
            "heading": 2,
            "text": "Agricultural Supply Chain Adjudicator"
        },
        {
            "text": "The first use of the powers introduced the Fair Dealing Obligations (Milk) Regulations 2024 (FDOM24) and established the Agricultural Supply Chain Adjudicator (ASCA) to enforce them.  "
        },
        {
            "text": "The ASCA will also be responsible for enforcing any future regulations developed under the fair dealing powers. "
        },
        {
            "text": "We recently shared a guest post by  Richard Thompson, the ASCA. He explained how his role is to improve fairness and transparency and encourage best practice by influencing positive behaviour change. "
        },
        {
            "text": "We’ve published full guidance on the ASCA enforcement role, and how to make a complaint on GOV.UK.   "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "Wherever we have found evidence of unfairness in the commercial relationships between farmers and those who buy from them, we have taken action using the powers in the Agriculture Act 2020 to regulate contractual practice.  "
        },
        {
            "text": "Regulations for the UK pig sector are in the latter stages of development and are expected to be introduced in Parliament in spring 2025.  "
        },
        {
            "text": "Industry engagement on proposals for eggs and fresh produce regulations is beginning now with regulations to follow over the course of the next two years. "
        },
        {
            "text": "We will continue to explore and investigate fairness in all agricultural sectors and will intervene wherever we find evidence of unfairness.  "
        },
        {
            "text": "We’ll share any further updates here on the Farming blog. Subscribe for a notification as soon as a new post is published. "
        }
    ]
}