{
    "url": "https://aphascience.blog.gov.uk/2024/11/21/combatting-amr-through-global-training/",
    "title": "Combatting antimicrobial resistance through global training",
    "authors": [
        "Rod Card"
    ],
    "categories": [
        "Antimicrobial Resistance",
        "International"
    ],
    "pub_date": "2024-11-21T09:00:00+00:00",
    "content": [
        {
            "text": "Antimicrobial resistance (AMR) is a critical global issue that poses a significant threat to public and animal health, the environment, and the global economy. The UK is committed to addressing AMR through its National Action Plan and by supporting global partners."
        },
        {
            "text": "The adverse effects of AMR are expected to be most severe in Low- and Middle-Income Countries. Since April 2019, APHA has been actively supporting many of these countries, through its FAO designated Reference Centre for AMR."
        },
        {
            "heading": 2,
            "text": "Supporting West Africa through the AMROH-WA grant"
        },
        {
            "text": "The One Health AMR in West Africa (AMROH-WA) is a Fleming Fund Regional Grant designed to support AMR efforts in Ghana, Nigeria, Sierra Leone, and Senegal, managed by Mott MacDonald. This grant focuses on animal health, environmental AMR, and engaging practitioners and industry. The consortium includes APHA, Food and Agriculture Organization of the United Nations (FAO), the Veterinary Medicines Directorate (VMD), and the Centre for Environment, Fisheries and Aquaculture Science (Cefas)."
        },
        {
            "heading": 2,
            "text": "Training programme in Ghana"
        },
        {
            "text": "APHA co-delivered a comprehensive training programme at the National Food Safety Laboratory in Accra, which is a National Reference Laboratory for AMR in Ghana. We have a longstanding partnership with this team, having provided training both in Ghana and the UK (see previous blog). This time we supported them as they led the training of staff from sentinel laboratories from across Ghana."
        },
        {
            "text": "The one-week programme brought together 14 laboratory scientists from animal and environmental health laboratories and focused on enhancing the capacity of Ghanaian laboratories to produce high-quality AMR data."
        },
        {
            "text": "Participants received both theoretical and practical training in bacterial diagnostics and antimicrobial sensitivity testing. The programme emphasised quality control and how to interpret results using internationally recognised standards, equipping participants with essential skills to combat AMR effectively."
        },
        {
            "text": "The event featured distinguished speakers, including the Ghanian Chief Veterinary Officer, the FAO AMR Country Coordinator, and a representative from the British High Commission. This initiative aligns with Ghana’s National Action Plan on AMR, which supports the World Health Organization’s Global Action Plan on AMR."
        },
        {
            "text": "By the end of the course, participants were able to identify bacterial isolates, generate quality data, and apply interpretative criteria correctly. This initiative underscores Ghana’s commitment to advancing laboratory capabilities in bacterial diagnostics and antibiotic susceptibility testing, ensuring a healthier future for animals, humans, and the environment."
        },
        {
            "heading": 2,
            "text": "Expanding efforts to Sierra Leone"
        },
        {
            "text": "In October, the team visited Sierra Leone for the Fleming Fellowship workshop led by the University of Liverpool. The Fleming Fund Fellowship Scheme is a programme that aims to develop a global community of AMR leaders and experts who can meaningfully contribute to their national AMR response. APHA staff are mentors for two animal health Fellows in Sierra Leone. The workshop provided the first opportunity for the Fellows to meet mentors in person and was very successful in building relationships, developing workplans, and designing a collaborative one health project."
        },
        {
            "text": "While in Sierra Leone our team also met FAO colleagues and planned in-country delivery of AMROH grant work. We were also very happy to be able to visit the Central Veterinary Laboratory at Teko to meet the team there and map out a training programme, similar to that delivered in Ghana."
        },
        {
            "heading": 2,
            "text": "The power of collaboration"
        },
        {
            "text": "Collaboration is at the heart of these efforts. By working together, the UK agencies, FAO, and local partners are making significant strides in the fight against AMR. This collective approach ensures that knowledge, resources, and expertise are shared, leading to more robust and sustainable solutions."
        },
        {
            "text": "The UK FAO Reference Centre for AMR designation is held by APHA, Cefas and VMD. It receives funding from Defra, the Fleming Fund, and the Gulf Strategy Fund (Foreign, Commonwealth & Development Office)."
        },
        {
            "text": "The Department of Health and Social Care (DHSC)'s Fleming Fund is a UK aid programme supporting up to 25 countries across Africa and Asia to tackle antimicrobial resistance (AMR), a leading contributor to deaths from infectious diseases worldwide."
        },
        {
            "text": "The Fleming Fund invests in strengthening AMR surveillance systems through a portfolio of country grants, regional grants, and fellowships managed by Mott MacDonald, and global projects managed by DHSC."
        }
    ]
}