{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/21/funding-announced-at-cop29-for-20-projects-to-support-marine-protection-and-fight-poverty/",
    "title": "Funding announced at COP29 for 20 projects to support marine protection and fight poverty",
    "authors": [
        "Ilona Drewry"
    ],
    "categories": [
        "Climate change",
        "Community",
        "Marine",
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2024-11-21T18:29:55+00:00",
    "content": [
        {
            "text": "Today is Nature, Indigenous People and Oceans Day at COP29. We’ve announced that we are funding 20 projects to reduce poverty, empower local communities and protect marine environments worldwide."
        },
        {
            "text": "The ocean is critical for biodiversity and livelihoods. But it is facing threats from ocean heating, acidification and overexploitation, driven by climate change, pollution and human-induced pressures."
        },
        {
            "text": "The consequences of ocean degradation are severe and interlinked – impacting biodiversity, economies, food security and the physical safety of coastal communities. "
        },
        {
            "text": "Yet despite the ocean’s vital importance, less than 1% of global Official Development Assistance  supports the United Nations Sustainable Development Goal 14 which aims to conserve and sustainably use the ocean, seas and marine resources."
        },
        {
            "text": "Getting funding to local organisations who can design and deliver local solutions to local problems is key. "
        },
        {
            "text": "I’m Ilona, and I work in the International Biodiversity and Climate team at Defra, leading on blue finance policy and international marine programmes."
        },
        {
            "text": "Defra is funding locally led marine projects in developing countries"
        },
        {
            "text": "Today, we have announced the 20 projects that have been successful in the first round of funding of our Ocean Community Empowerment and Nature Grant Programme (also referred to as OCEAN)."
        },
        {
            "text": "The programme supports projects in developing countries that aim to deliver lasting change to the marine environment and reduce poverty in the most vulnerable coastal communities around the world."
        },
        {
            "text": "Applicants for funding included local community groups, non-Government organisations and academic institutes."
        },
        {
            "text": "The OCEAN Grants have been awarded through two funding pathways: Community and Partnership."
        },
        {
            "text": "Community grants provide smaller funding to small-scale, local, in-country organisations. These grants focus on increasing the capacity of local communities to tackle marine and poverty issues, by delivering local solutions to local problems."
        },
        {
            "text": "Partnership grants provide larger amounts of funding to organisations who partner with locally led organisations and local communities to deliver solutions at scale."
        },
        {
            "text": "The successful projects cover 5 continents and 13 countries"
        },
        {
            "text": "The projects, which will bolster marine protection and fight poverty, are wide-ranging."
        },
        {
            "text": "They vary from establishing a socio-ecological corridor of Locally Managed Marine Areas in Mozambique, to empowering women to take more active roles in grassroots marine conservation in Papua New Guinea."
        },
        {
            "text": "One of the successful projects is the Coral Triangle Marine Reserve Development. Through training and marine conservation work, the Sea Women of Melanesiaare redressing gender equality by empowering indigenous women to take leadership roles in grassroots marine conservation work in Papua New Guinea."
        },
        {
            "text": "Since its inception in 2016, the Sea Women of Melanesia have expanded their efforts across the Milne Bay Province of Papua New Guinea. They have worked with coastal communities to accelerate the establishment of Locally Managed Marine Areas for sustainable fisheries and ecotourism."
        },
        {
            "text": "These Locally Managed Marine Areas bring much needed jobs, food and income to local communities and boost marine biodiversity through the protection of coral reefs and restoration of fish stocks. "
        },
        {
            "text": "Next steps for the programme"
        },
        {
            "text": "We cannot address the nature and climate crises without coordinated global action and support to developing countries who are most acutely affected by the impacts of climate change. "
        },
        {
            "text": "We are committed to creating lasting change in the marine environment and for the most vulnerable coastal communities."
        },
        {
            "text": "The OCEAN Grants Programme's next funding window will be opening on 6 January 2025. If you’re interested in applying, visit the application portal on the OCEAN website."
        },
        {
            "text": "We’re particularly interested in projects that prioritise gender equality, disability and social inclusion."
        },
        {
            "text": "To receive an email notification whenever we publish a new post, please subscribe to the blog."
        }
    ]
}