{
    "url": "https://accessibility.blog.gov.uk/2024/11/21/introducing-the-leaders-guide-to-accessibility/",
    "title": "Introducing the Leader’s Guide to Accessibility",
    "authors": [
        "Samantha Merrett, Senior Accessibility Specialist, Ministry of Justice",
        "Alice Dryden, Senior Content Designer, Home Office"
    ],
    "categories": [
        "Accessibility",
        "Accessibility Regulations"
    ],
    "pub_date": "2024-11-21T09:48:44+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why have we produced this guide?"
        },
        {
            "text": "This guide was created to give managers and leaders a good understanding of why accessibility is important in a format that they can read and access quickly. We also hope that leaders will use the further reading resources section to find out more about accessibility. "
        },
        {
            "heading": 2,
            "text": "Who was involved?"
        },
        {
            "text": "There was a changing cross-government group with an interest in accessibility with roles including content designers, accessibility specialists, managers and accessibility team leads. Everyone was doing this alongside their day job so we worked together on Mural and created user stories to decide what to include in the guide. "
        },
        {
            "heading": 2,
            "text": "What does it say?"
        },
        {
            "text": "The guide has been published in the DWP Service Manual and Home Office Design System respectively. "
        },
        {
            "text": "This guide aims to simplify accessibility and explain why it needs to be a key consideration in all projects. We want everybody to be able to access and use websites, web pages, documents and online services, regardless of individual ability. "
        },
        {
            "text": "The guide is split into 4 main chapters:"
        },
        {
            "text": "Image courtesy of Government Digital Services."
        },
        {
            "heading": 2,
            "text": "Accessibility as a team sport"
        },
        {
            "text": "The accessibility as a team sport section outlines the different roles in a delivery team and their responsibility when it comes to producing accessible services and products. We also highlight the role other ‘enabling’ teams, for example user researchers or content designers, can have on accessibility progress. All roles included in this section have been taken from the Government Digital and Data Profession Capability Framework (DDaT) so all organisations should find some similarity to their departmental own set up.   "
        },
        {
            "text": "We make it clear that leaders are pivotal to making this work a success. Leaders should champion accessibility, involve accessibility in the decision-making and measure accessibility maturity. "
        },
        {
            "heading": 2,
            "text": "Accessibility and your product"
        },
        {
            "text": "This section covers how all products should meet the Service Standard, but more importantly how making services accessible makes them easier for everyone to use. This means that the team will spend less time answering questions and can invest more time on other projects. "
        },
        {
            "text": "We also explain the different accessibility legislative requirements that organisations need to comply with. "
        },
        {
            "text": "We ask leaders to think: "
        },
        {
            "text": "‘If you don’t currently have any employees with accessibility needs…are you sure you don’t? Why don’t you? Are the systems you use a barrier because they have accessibility issues?’"
        },
        {
            "text": "We hope these questions make leaders question their own assumptions about disability and digital accessibility, and reflect on their own approach."
        },
        {
            "heading": 2,
            "text": "Accessible procurement"
        },
        {
            "text": "This section explains that all products and services need to be accessible regardless of whether they are built in internally or bought from an external supplier. "
        },
        {
            "text": "We explain that accessible procurement is all about asking the right questions. If we do not ask suppliers the right questions then we run the risk of procuring inaccessible products and services. We recommend that all organisations have an accessibility policy for procurement and we make it clear that Voluntary Product Accessibility Templates (VPATs) should not be relied upon to demonstrate compliance.   "
        },
        {
            "heading": 2,
            "text": "Tips and resources"
        },
        {
            "text": "Our tips and resources section has been designed to be simple and easy to understand. We ask leaders to pick three from the list, one to do today, one for later in the week and one for later in the month. We hope that by breaking it down into easy, manageable tasks it will make it easier to do the right thing."
        },
        {
            "text": "We have tried to provide a variety of useful links to things like the WAVE accessibility checker and the model GDS accessibility statement. There is also a glossary at the end of the guide to help explain the complex terms we use. "
        },
        {
            "heading": 2,
            "text": "Our disclaimers…"
        },
        {
            "text": "We don’t live in a dream world and recognise that this guide is not necessarily going to change culture and behaviour across government (even if that is our goal!)."
        },
        {
            "text": "Every department is different and all government departments are organised to suit their own needs and requirements. "
        },
        {
            "text": "We hope that leaders use the guide in a way that works best for them. Most senior leaders have multiple demands on their time and this means that accessibility can often fall to the bottom of the list. This is one of the reasons that we created the tips and resources section. "
        },
        {
            "text": "We hope that if leaders only have 5 minutes they can take something away from the quick tips. "
        },
        {
            "text": "We also know that not all leaders are experts in accessibility, and that is OK! You cannot lead in an area that you do not know much about. This guide is intended to support and upskill leaders to help them better understand that accessibility is everyone’s responsibility. "
        },
        {
            "heading": 2,
            "text": "Thanks to all those involved"
        },
        {
            "text": "This guide would not have been possible without the wonderful colleagues who worked as part of the project team to bring it to life. "
        },
        {
            "text": "James Buller, David Caldwell, Alice Dryden, Lee Goudie and Samantha Merrett helped to co-write and design the guide."
        },
        {
            "text": "Nikki Berry, Tom Napier and Guerman Cope were instrumental in getting the guide published in the DWP Service Manual and Home Office Design System respectively. "
        },
        {
            "text": "Many thanks to you all!"
        },
        {
            "text": "We very much hope this guide helps to support you and your colleagues to embed accessibility within your organisation. Please do pass it onto others who you think might benefit from giving it a read."
        }
    ]
}