{
    "url": "https://ipo.blog.gov.uk/2024/11/21/ip-and-colour-protecting-a-spectrum-of-creativity/",
    "title": "IP and colour: protecting a spectrum of creativity ",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "Environment",
        "Innovation",
        "Patents",
        "Trade marks",
        "Trade secrets",
        "Uncategorized"
    ],
    "pub_date": "2024-11-21T09:52:34+00:00",
    "content": [
        {
            "text": "It's apparent to anyone that meets me that I have a love of all things fashion. I am especially obsessed with brightly-coloured statement pieces, such as a royal blue pair of shoes or a mustard yellow fitted skirt. I know that intellectual property (IP) is all around us, so I was interested to discover that it can even be found in the colours of your clothing. "
        },
        {
            "text": "In the vibrant world of fashion and textiles, Earthshot prize finalist and sustainable dye company, Colorifix, has developed a biological process to produce, deposit, and fix pigments onto fabrics. This approach reduces the environmental impact of textile dyeing, paving the way for a more sustainable way to produce colour pigments."
        },
        {
            "heading": 4,
            "text": "Environmentally-friendly beginnings "
        },
        {
            "text": "In 2013 scientists Jim Ajioka and Orr Yarkoni were on a mission to help improve water quality by creating colour-changing biological sensors that could detect heavy metal contamination. Their project took them to Nepal and Bangladesh where they were able to witness the negative impact the textile dyeing industry was having on the environment.  "
        },
        {
            "text": "The duo founded Colorifix in 2016, a company using engineered microbes to produce and fix pigments onto fabrics in a sustainable way. This breakthrough not only reduces water and chemical use but also highlights how important eco-friendly innovation is in the fashion industry. "
        },
        {
            "text": "I caught up with Colorifix’s founder and Chief Scientific Officer, Jim Ajioka and Marketing Manager, Nora Eslander, to find out more about their business and learn what part their IP strategy plays in their sustainability journey. "
        },
        {
            "heading": 4,
            "text": "From academia to biotechnology \n"
        },
        {
            "text": "Jim transitioned from his academic background in infectious diseases to the field of engineering biology. While this might seem like an unusual leap, the techniques he had developed for large-scale genome analysis laid the foundation for Colorifix’s biotechnological innovation. "
        },
        {
            "text": "Colorifix's technology uses nature’s ability to produce pigments. By studying and identifying the biological pathways that create colour in nature, the team can engineer microbes like E. coli and yeast to replicate the colours created in nature. The microbes are then used to dye fabrics in an eco-friendly manner, eliminating the need for harsh chemicals, and reducing water and energy consumption. The result is a sustainable process that works with standard industry machines and is scalable across a range of fabrics, from cotton to synthetics. "
        },
        {
            "heading": 4,
            "text": "Patenting the process \n"
        },
        {
            "text": "Jim explained that patenting in biotechnology is not without its challenges. "
        },
        {
            "text": "By patenting the process rather than the organisms themselves, the team at Colorifix ensures that its technology is protected while still allowing for scalability. "
        },
        {
            "text": "Patenting the apparatus ‘We have also patented our bioreactor apparatus,’ said Jim."
        },
        {
            "text": "Colorfix’s patented custom-built bioreactors are designed to optimise the growth and function of the colour-producing microbes, creating a standardised environment that can be replicated across different dye houses worldwide. This is crucial for maintaining consistent quality and ensuring that the technology can be scaled industrially. "
        },
        {
            "text": "Balancing patents and trade secrets "
        },
        {
            "text": "While patents play a key part in Colorifix’s IP strategy, they are not the only tool the company uses to protect its innovations. Trade secrets also play an important role, particularly for elements of the process that are difficult to reverse-engineer or for which patent protection would not be practical. "
        },
        {
            "heading": 4,
            "text": "Trade marks and the importance of branding "
        },
        {
            "text": "In addition to protecting their processes, the Colorifix team also understands the importance of protecting their brand. The company’s logo, which symbolises its eco-friendly, sustainable approach to dyeing, is trade marked in key markets. View the brands’ trade marks here (link): Search for a trade mark - Intellectual Property Office (ipo.gov.uk) "
        },
        {
            "text": "“Having a trade mark is critical,” says Marketing Manager, Nora Eslander. “Our logo represents our commitment to reducing the environmental impact of textile production. By trade marking it, we ensure that only companies using our technology can leverage that green branding.” "
        },
        {
            "heading": 4,
            "text": "Looking to the future "
        },
        {
            "text": "Colorifix’s journey from academic research to biotechnology startup highlights the importance of IP. By carefully balancing patents, trade secrets, and trade marks, Colorifix has built a robust IP strategy that protects its unique process while allowing for scalability.  "
        },
        {
            "text": "As the business continues to scale, the focus remains on making a meaningful impact in the textile industry. With a growing demand for sustainable solutions, Colorifix’s technology has the potential to make a change in how colour pigments for fabric are created. However, scaling comes with challenges, especially in an industry known for its reliance on conventional, chemical-based processes. "
        },
        {
            "text": "Ajioka is candid about the hurdles: “We’re at a point where we’re trying to make real market penetration. That means working with dye houses to produce enough pigments and ensure our microbes perform consistently across different environments. It’s all about industrialising nature in a way that’s scalable and cost-competitive.” "
        }
    ]
}