{
    "url": "https://environmentagency.blog.gov.uk/2024/11/21/local-nature-recovery-strategies-how-nature-can-help-drive-improvements-for-the-water-environment/",
    "title": "Local Nature Recovery Strategies: how nature can help drive improvements for the water environment ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Sustainability"
    ],
    "pub_date": "2024-11-21T09:06:32+00:00",
    "content": [
        {
            "text": "Local Nature Recovery Strategies (LNRS) are locally led, evidence-based strategies that will help to prioritise and target action and nature investment –  to help create a better place.  "
        },
        {
            "text": "Whilst nature is at their core, these strategies will drive the delivery of other benefits for people, wildlife and the environment. They will help join up work we are already doing by targeting the use of nature-based solutions to maximise outcomes. Nature-based solutions are those actions that use natural processes to address other environmental or societal issues  – for example, the creation of wetlands that improve water quality and resilience to drought or planting trees in upper catchments that slow the flow of water to communities at flood risk.   "
        },
        {
            "text": "We are working with LNRS responsible authorities, Natural England, the Forestry Commission and other stakeholders to support LNRS preparation. Activities include, ensuring the right local stakeholders are involved, such as catchment partnerships, using our data and evidence to highlight the importance of the water environment to nature recovery, and sharing knowledge on opportunities for the use of nature-based solutions.    "
        },
        {
            "text": "Let’s travel around some of our local teams to share our work. "
        },
        {
            "text": "In our East Anglia area we have been working with Essex County Council as they prepare their LNRS. This is one of the first strategies to reach public consultation. One of their biodiversity priorities sets out an ambition to create new freshwater and river buffer habitat and enhance the water quality of their river network. This is underpinned by a number of practical actions that can be delivered in specific locations. This work has built on knowledge developed through wider partnerships such as the Essex Rivers Hub and the Essex Fish Migration Roadmap.  "
        },
        {
            "text": "Image 1: Natural flood management scheme at Spains Hall Estate in Essex Credit: Matt Butcher (EA) "
        },
        {
            "text": "Heading to the south west, and our Devon, Cornwall and Isles of Scilly team, we have been busy putting water at the heart of the two LNRSs in the area - ensuring rivers and wetlands are recognised as being critical to nature recovery. Looking across a whole catchment, the team have identified the places where action could be carried out to achieve the most for nature and the wider environment. One of these places is the East Devon Management Catchment which includes the Rivers Exe, Culm, Clyst and Axe. The area is impacted by high levels of nutrients from agricultural runoff and sewage treatment works, and pressure from new housing development. Through LNRS discussions we are exploring this catchment approach to direct where the practical actions should be mapped that will help drive necessary improvements.  "
        },
        {
            "text": "Image 2: River Culm at Cullompton Credit: Chris Angell (EA) "
        },
        {
            "text": "Further north, our North East area team are working hard to ensure the Northumberland and North of Tyne LNRS includes actions to address climate change impacts through links to the Wansbeck Restoration for Climate Change Project. Working at a landscape scale, this project has identified locations to store carbon in habitats such as peatland, and will help mitigate the impacts of climate change through restoring floodplains -  storing more water within the landscape to reduce flooding to communities downstream. An example of natural flood management is the use of leaky dams as shown in the image below. "
        },
        {
            "text": "Image 3: Leaky dam at Hardwood Burn Credit: Groundwork NE & Cumbria "
        },
        {
            "text": "Elsewhere we are using information from Shoreline Management Plans to encourage the inclusion of priorities and measures that support habitat creation along our estuaries and coast; and working with larger urban LNRS areas to input opportunities to naturalise rivers and manage surface water linking these with improved public access to nature. "
        },
        {
            "text": "The ambition for LNRSs goes beyond the creation of habitats and species. It will be a system that recognises the role of nature in supporting our vision to create a better place for people and wildlife, so we’re seizing the opportunity to influence each LNRS. However, anyone with an interest can get involved. To find out how and for more information on the LNRS in your area, please contact your local responsible authority via their email or visit their website. Details are available for each LNRS on the GOV.UK link below: "
        },
        {
            "text": "Local nature recovery strategies: responsible authorities - GOV.UK (www.gov.uk) "
        }
    ]
}