{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/21/overdue-right-to-buy-reforms-to-protect-social-housing/",
    "title": "Overdue Right to Buy reforms to protect social housing",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-11-21T11:09:48+00:00",
    "content": [
        {
            "text": "There has been widespread national and trade coverage following the launch of the Right to Buy consultation yesterday, proposing reforms to the scheme to protect and reverse the decline in much need council housing."
        },
        {
            "text": "This was picked up in The Times, The Guardian, The I, BBC News, Mail Online and The Sun as well as trade coverage including Housing Today, Property Week and Architects’ Journal. They all report on proposed measures to extend the length of time someone has to be a tenant before they can buy their home and protecting newly built social homes from sale through exemptions under the scheme."
        },
        {
            "text": "Reporting also includes the government’s decision not to extend Right to Buy to housing associations because of the substantial costs to the taxpayer and the likely reduction in more social housing stock."
        },
        {
            "text": "The Deputy Prime Minister has also written exclusively for The I  where she outlines her own personal experience of Right to Buy and makes the case to bring forward necessary reforms to ensure the scheme is fairer and more sustainable."
        },
        {
            "text": "Deputy Prime Minister and Secretary of State for Housing, Angela Rayner said:“For millions of people in the position I was once in, that first step into the secure social housing that changed my life has become a distant dream."
        },
        {
            "text": "“Too many social homes have been sold off before they can be replaced, which has directly contributed to the worst housing crisis in living memory."
        },
        {
            "text": "“We cannot fix the crisis without addressing this issue – it’s like trying to fill a bath when the plug’s not in."
        },
        {
            "text": "“A fairer Right to Buy will help councils protect and increase their housing stock, while also keeping the pathway to home ownership there for those who otherwise might not have the opportunity to get on the housing ladder.” "
        }
    ]
}