{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/21/warm-homes-plan-and-heat-pumps/",
    "title": "Warm Homes Plan and heat pumps",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Planning"
    ],
    "pub_date": "2024-11-21T15:37:18+00:00",
    "content": [
        {
            "text": "There has been widespread coverage in national media following the launch of the Warm Homes Plan by DESNZ."
        },
        {
            "text": "The Plan will help people find ways to save money on energy bills and deliver warmer, cleaner energy to heat homes, with up to 300,000 homes to benefit from upgrades next year."
        },
        {
            "text": "The plan includes boosting the budget for the Boiler Upgrade Scheme to support more households to switch to a heat pump, as well as removing planning restrictions allowing more people to install air source heat pumps without the need to apply for planning permission.   "
        },
        {
            "text": "The latter element of the plan was the focus of The Telegraph’s front page this morning, with the piece reporting that noise restrictions on heat pumps are to be relaxed in the pursuit of net zero, with the current rules blocking homeowners installing a heat pump less than a metre from their property’s boundary being scrapped."
        },
        {
            "text": "The changes, which are being made by MHCLG early next year, will amend the existing permitted development right to:"
        },
        {
            "text": "The permitted development right will continue to require that installations are compliant with the relevant Microgeneration Certification Scheme Planning Standards."
        },
        {
            "text": "Working alongside the government’s mission to make Britain a clean energy superpower, the Warm Homes Plan will ensure millions more households benefit from homegrown energy delivered by every new turbine, solar panel or pylon built on the path to energy independence. "
        }
    ]
}