{
    "url": "https://hmlandregistry.blog.gov.uk/2021/09/17/coloboma-and-me-managing-a-rare-genetic-condition-in-the-workplace/",
    "title": "Coloboma and me – managing a rare genetic condition in the workplace",
    "authors": [
        "Heather Stringer, Registration Officer"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2021-09-17T14:29:18+01:00",
    "content": [
        {
            "text": "I started as a Registration Officer with HM Land Registry in May 2020 and when it comes to my genetic condition, I can honestly say that I never imagined an employer could be so supportive and accommodating of my needs. It really has been a revelation."
        },
        {
            "text": "I was born with a coloboma in my left eye. This is caused by a rare genetic condition and means that my eye didn’t form properly in the womb. It is sometimes referred to as a cat’s eye as the pupil is misshapen, often towards the bottom of the eye. It means that I am almost blind in that eye and I had my first pair of glasses at nine months old (I still have them!). The gene abnormality has also caused severe hearing loss in my right ear and I wear a hearing aid, but this link wasn’t made until later in life."
        },
        {
            "text": "When I was a child, my parents were told I would have to attend a special school for the blind and partially sighted but my father, who had experienced attending a school for people with health needs, fought against this and I attended mainstream school without any problems. I was lucky that my parents bought me up to be quite resilient and I rarely struggled with being ‘different’."
        },
        {
            "heading": 2,
            "text": "Making my working life easier"
        },
        {
            "text": "Working at HM Land Registry, I have an adjustment passport covering all my different conditions, which helps my managers understand how they can support me, wherever that is in the organisation and across the Civil Service."
        },
        {
            "text": "The Display Screen Equipment (DSE) team have been amazing at getting me all the support and equipment I need to make my working life easier, including a single ear headset so it doesn’t interfere with my hearing aid. I have a specialist chair and ergonomic mouse with the short keyboard and our Digital, Data and Technology department were great at helping me set up my font size on screen so I can read things with ease."
        },
        {
            "text": "I am grateful for the support of HM Land Registry, and proud to be part of such a great place to work, where difference is celebrated."
        }
    ]
}