{
    "url": "https://rpc.blog.gov.uk/2021/09/17/considering-wider-impacts-when-scrutinising-impact-assessments/",
    "title": "Considering wider impacts when scrutinising Impact Assessments",
    "authors": [
        "Prof. Brian Morgan"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-09-17T12:48:42+01:00",
    "content": [
        {
            "text": "Impact Assessments (IAs) are an important part of the policy making process – they set out the policy objectives alongside the expected costs and benefits of different options for implementation so that Ministers and Parliament can  properly consider whether regulation is required and which option to adopt."
        },
        {
            "text": "In order to ensure that the IAs produced by departments properly assess the potential impacts of regulations, they are subject to scrutiny by the Regulatory Policy Committee (RPC). We assess whether the evidence and analysis in the IA is fit for purpose or not. This scrutiny process helps to improve IAs and therefore supports better policy decisions by Ministers."
        },
        {
            "text": "Under the current Better Regulation Framework, the RPC can formally conclude that a final stage IAs is not fit for purpose by giving a red rating in 2 areas:"
        },
        {
            "text": "Although IAs consider wider issues (such as the impact of the proposed policy on the environment or on competition), we cannot formally rate IAs on the fitness for purpose of this wider analysis. Instead we comment on whether they provide sufficient support for decision-making on these aspects of the assessment and then use a quality indicator of ‘good’, ‘satisfactory’, ‘weak’ or ‘very weak’. Our best practice guidance states that wider societal impacts should be considered in every IA and included in the net present value estimate of the true cost of the regulation."
        },
        {
            "text": "This article discusses whether scrutiny could be more effective if our role was formally extended to include the option of ‘red-rating’ IAs on a wider range of issues – specifically the impacts on:"
        },
        {
            "heading": 2,
            "text": "The case for a focus on the wider impacts of regulation on the economy"
        },
        {
            "text": "The UK’s recent exit from the EU makes this an opportune time to be discussing the broader issues surrounding the impact of new and existing regulations. 'Brexit' provides opportunities to ensure that the regulatory system is as effective as possible in encouraging trade and innovation. Hence, it is  increasingly important that the wider impacts of regulation are considered in IAs so that these factors can be balanced alongside the more direct impacts on business. Similarly, the commitment to achieving Net Zero by 2050 means that it is important to understand how a proposed regulation will impact on greenhouse gas emissions and help (or hinder) the UK to achieve its commitment."
        },
        {
            "text": "Because we cannot red-rate on these wider issues, we cannot require improvements in the IA if it is deficient in these areas. Consequently the challenge that we are currently able to offer to the policy making process is limited."
        },
        {
            "text": "Allowing the RPC to ‘red-rate’ an IA on its analysis of these wider impacts would extend the benefits of independent scrutiny to increasingly important areas of government policy. It would do more to ensure that an evidence-based approach is taken to assessing the potential impacts of new regulations on innovation, trade and the environment. The aim would be to improve the analysis of these wider impacts in the same way as the current analysis does for direct impacts on business."
        },
        {
            "heading": 2,
            "text": "What wider impacts might be included?"
        },
        {
            "text": "There is a risk of considering too wide a range of issues and turning an IA into a 'tick box' exercise or requiring an unreasonable level of departmental resources to complete it. An important question is therefore which of these wider impacts are the most important to analyse in order to ensure that a balance is struck between proper consideration of these issues while ensuring that the regulatory process does not become too superficial, onerous or time-consuming."
        },
        {
            "text": "Cases can be made for the three areas of impact described above:"
        },
        {
            "text": "Impacts on trade – now that the UK has left the EU, there is much focus on developing our future trading relationships. The RPC is working closely with the Department for International Trade to support its work on ensuring that trade agreements are targeted where they can most benefit the UK economy. There is therefore a case for increasing the focus on trade impacts in IAs for regulatory proposals."
        },
        {
            "text": "Impacts on the environment – with the ever increasing focus on action to tackle climate change and the commitment to Net Zero, the potential contribution of regulations to that drive is clearly important. An increased focus on this in IAs might help decision makers in making difficult choices on measures that improve the environment but have a cost to businesses, or that improve consumer welfare but have an unintended adverse impact on greenhouse gas emissions."
        },
        {
            "text": "Impacts on competition and innovation – this is another government priority as it seeks to rebuild the economy post-Covid and to support innovation. A recent report on regulation and competition by the Competition and Markets Authority recommended that the RPC should have the ability to red-rate an IA if it did not appropriately consider the impact on competition and innovation."
        },
        {
            "text": "These 3 topics are not intended to be exclusive as there are of course other issues that might also be included: the impact of proposals on the 'levelling up' agenda, on privacy issues, or on diversity and inclusion for example. However it  is important that any new system is proportionate and that the IA focuses on the areas that are most relevant to the proposed legislation."
        },
        {
            "text": "The current BRF consultation is seeking views on this issue. We encourage anyone with an interest to respond to the consultation and offer their suggestions on ways of assessing the wider impacts of regulation. The deadline for responses is 1 October 2021."
        }
    ]
}