{
    "url": "https://socialcare.blog.gov.uk/2021/09/17/flu-jabs-saves-lives-too/",
    "title": "Flu jabs save lives too",
    "authors": [
        "Dr. Éamonn O'Moore"
    ],
    "categories": [
        "coronavirus",
        "Public health",
        "Workforce"
    ],
    "pub_date": "2021-09-17T09:33:10+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Duty of care"
        },
        {
            "text": "If the last 18 months have taught us anything, it is the vital, lifesaving importance of vaccination."
        },
        {
            "text": "When I was seeing patients, I knew how crucial it was for all of us who work directly with vulnerable people to make sure we had a flu jab every year, as I felt it was our professional responsibility to protect ourselves, our colleagues, and those in our care."
        },
        {
            "text": "Last winter, there were extremely low levels of the influenza virus circulating in the UK. This was caused, in large part, by pandemic restrictions, including lockdowns and social distancing measures."
        },
        {
            "text": "Instead, last winter was dominated by the impact of COVID-19, which posed serious health risks to care staff and people receiving care, with knock on effects on care home staffing levels, facilities and equipment. This winter will be highly unpredictable, and the big concern is the extent to which we may see flu and other respiratory viral infections re-emerge as major health threats, alongside coronavirus."
        },
        {
            "text": "Implications for social care staff, vulnerable people receiving care, and their families, friends and loved ones are serious. An Academy of Medical Sciences report warns very low levels of influenza activity over winter 2020/21 and the mild influenza season in 2019/20 make it likely our overall immunity to influenza will have diminished. This makes the urgency of taking up the flu vaccine this winter more important than ever."
        },
        {
            "heading": 2,
            "text": "Combined endeavour"
        },
        {
            "text": "If we all make every effort to take up the flu vaccine offer, we will protect ourselves, our colleagues and those in our care more effectively. It will help us all to weather whatever storms may come our way."
        },
        {
            "text": "As in previous years, health and social care workers are entitled to free flu vaccines. My NHS colleagues and I take full advantage of this offer. I know care colleagues are equally committed to protecting people in their care."
        },
        {
            "text": "Public Health England (PHE) is working closely with the Department of Health & Social Care, NHS England and sector partners to enable more effective delivery of vaccines to care colleagues. We have learned the lessons of last winter and are doing all we can to be fully prepared for the coming one."
        },
        {
            "heading": 2,
            "text": "Keeping others safe"
        },
        {
            "text": "It’s not just about protecting ourselves of course. Older people and people with underlying medical conditions, who are more susceptible to complications, should also receive seasonal flu vaccines every year, as advised in the indispensable Green Book."
        },
        {
            "text": "As the UK’s coronavirus vaccination programme shows, to be successful it must be comprehensive. That means we need a high level of eligible care colleagues, NHS staff and members of the public vaccinated against flu."
        },
        {
            "text": "We have seen a phenomenal response to the COVID-19 vaccine offer, with the vast majority of social care staff now fully vaccinated and better protected, which is a fantastic achievement. I ask all care colleagues to do everything they can to make sure we see higher than ever levels of flu jab take up this year. These jabs save lives – and isn’t that why we all do the work we do? Please get both and get double the peace of mind."
        }
    ]
}