{
    "url": "https://companieshouse.blog.gov.uk/2021/09/17/my-work-experience-placement-at-companies-house/",
    "title": "My work experience placement at Companies House",
    "authors": [
        "Hannah Williams - Operational Support Officer"
    ],
    "categories": [
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2021-09-17T08:50:20+01:00",
    "content": [
        {
            "text": "I started with Companies House on an 8-week work experience course through the Department for Work and Pensions (DWP), after being out of work for almost 2 years."
        },
        {
            "text": "After applying for countless jobs and having a number of interviews with no success, I was starting to worry that I’d never get back into work. I’ve always taken great pride in my success at interviews, so not securing any of the roles I’d applied for was a huge knock to my confidence."
        },
        {
            "text": "My work coach at the DWP informed me of a work experience placement at Companies House. I immediately asked them to submit my CV for this great opportunity. I was not sure what to expect having never worked in an office environment before. I thought I’d probably not be picked for the placement as I was sure there were lots of other candidates with more experience, and maybe even some with Civil Service experience."
        },
        {
            "text": "I heard back from the team at Companies House and was thrilled to hear I was invited for an informal chat. I was very nervous but I had a great chat and was made to feel at ease by the 2 lovely people I spoke with. To my surprise and delight, about a week later I was offered a place on the placement."
        },
        {
            "text": "The placement is fantastic. Although there’s a lot to learn, I had 2 amazing trainers who helped me and others. They never lost their patience and if you did not understand something they were always happy to help."
        },
        {
            "text": "I started my placement in the post room. I never realised how varied a role in the post room would be and how much I would learn. After training I moved to where I’d be working for the remainder of the placement."
        },
        {
            "text": "I’m proud to say that about a week before my placement was due to finish, I was offered a position with Companies House. I was so excited as I’d enjoyed my time here so much, I did not want to leave."
        },
        {
            "text": "The people at Companies House are so welcoming, encouraging and happy to help whenever you need it. Of course, meeting new people for the first time can be daunting but these are the most wonderful people I’ve ever worked with. Not once have I worried about asking for help. Everybody makes you feel as if you’ve known them for years, and I like to think we are like a family."
        },
        {
            "text": "Companies House is a great place to work, not only because of the people you work with, but because of the organisation itself. There are great benefits to working here and they really know how to support and nurture their employees. I could not imagine working anywhere else and wish I’d known about Companies House sooner."
        },
        {
            "text": "I’m now a few weeks into my position and I’m being trained on different sections of the post room. I’m excited to keep learning, and my confidence is continuing to grow."
        },
        {
            "text": "I encourage anyone who’s looking for work, or who’s maybe had their confidence knocked like I did, to apply whenever possible. It’s the best thing I‘ve done and I’m so thankful to Companies House for the opportunity."
        }
    ]
}