{
    "url": "https://educationhub.blog.gov.uk/2021/09/nhs-to-deliver-covid-19-vaccines-to-12-to-15-year-olds-your-questions-answered/",
    "title": "NHS to deliver COVID-19 vaccines to 12- to 15-year-olds: your questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2021-09-17T15:02:10+01:00",
    "content": [
        {
            "text": "This autumn all children aged 12 to 15 years are being offered the first dose of the COVID-19 vaccination. The vaccines will be delivered in schools by the School Aged Immunisation Service (SAIS)."
        },
        {
            "text": "Vaccinating children should help to reduce the need for children to have time off school and to reduce the risk of spread of COVID-19 within schools. The COVID-19 vaccination programme in secondary schools will therefore provide protection to children who are vaccinated and help to reduce disruption to face to face education this winter."
        },
        {
            "heading": 3,
            "text": "How will vaccination in schools work?"
        },
        {
            "text": "Like all school-based vaccination programmes, the vaccines will be administered by healthcare staff working closely with the school and following the usual approach to school-based immunisation."
        },
        {
            "text": "The expectation is that the vaccination programme will be delivered primarily within schools but there might be certain areas or certain schools where this is not possible."
        },
        {
            "heading": 3,
            "text": "Who will be giving the vaccine to the children?"
        },
        {
            "text": "The programme will be delivered by an NHS commissioned SAIS team which may include nurses, healthcare support workers, administrative staff, and other associated professionals who specialise in the delivery of school age vaccinations."
        },
        {
            "text": "The team will administer the vaccination according to nationally agreed standards. Staff are appropriately qualified, trained (including in safeguarding) and experienced in vaccinating children and young people. Staff administering the vaccine will be wearing appropriate personal protective equipment."
        },
        {
            "heading": 3,
            "text": "How will parent or guardian consent for these vaccinations be obtained?"
        },
        {
            "text": "For those aged 12 to 15 years consent will be sought by the SAIS provider from the parent or person with parental responsibility in the same way as for any other school vaccination programme."
        },
        {
            "text": "A consent form and information leaflet provided by the SAIS team will be used to seek parental consent. Parents will also be provided with a contact number for the SAIS team in case of any queries."
        },
        {
            "text": "All parents or those with parental responsibility are asked for consent and will usually make this decision, jointly with their children."
        },
        {
            "text": "The information leaflet is addressed to the child (as the recipient of the vaccine) and encourages them to discuss the decision about the vaccine with their parents."
        },
        {
            "text": "In secondary schools, some older children may be sufficiently mature to provide their own consent. This sometimes occurs if a parent has not returned a consent form but the child still wishes to have the vaccine on the day of the session. Every effort will be made to contact the parent to seek their verbal consent. The school has no role in this process."
        },
        {
            "text": "This is a well-established process which is used in other school-based vaccination programmes."
        },
        {
            "heading": 3,
            "text": "What happens if a parent has not consented, but the child wants to be vaccinated?"
        },
        {
            "text": "Young people who understand fully what is involved in a proposed procedure, such as vaccination, can legally give consent. This is known as ‘Gillick competence’."
        },
        {
            "text": "If no consent from a parent has been received, but the child wants to be vaccinated and is judged to be Gillick competent by the healthcare professional, the child can still be vaccinated. In this case, the healthcare professional will make every effort to contact a parent to check before they proceed."
        },
        {
            "text": "If a parent objects to their child being vaccinated but the child wants to be vaccinated and is judged to be Gillick competent, the healthcare professional will try to reach agreement between the parent and child."
        },
        {
            "text": "Trained professionals in the SAIS team, with expertise in vaccinating children will speak to the child. The SAIS team will assess the individual child’s capacity to self-consent (Gillick competence) and be responsible for deciding the appropriateness of administering the vaccine – not school staff."
        },
        {
            "heading": 3,
            "text": "How are schools involved in the consent process?"
        },
        {
            "text": "While schools may host immunisation services, they are not responsible for securing parental or child consent, for assessing Gillick competence or mediating between parents and children who may disagree about whether or not to consent."
        },
        {
            "text": "This is the role of registered nurses in the SAIS, who have extensive experience and the expertise to handle these issues and are professionally accountable for their decisions. Legal accountability for offering COVID-19 vaccines to children and young people sits with the SAIS and not with the school."
        }
    ]
}