{
    "url": "https://naturalengland.blog.gov.uk/2021/09/17/restoration-grants-awarded-to-restore-thousands-of-hectares-of-peatland/",
    "title": "Restoration Grants awarded to restore thousands of hectares of peatland",
    "authors": [
        "Steve Clarke"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Peat"
    ],
    "pub_date": "2021-09-17T14:43:32+01:00",
    "content": [
        {
            "text": "Climate FundThe Nature For Climate Peatland Grant Scheme (NCPGS), administered by Natural England, has awarded Restoration Grant funding to five successful applicants. Over the next four years they will each receive a share of £16 million from the Nature for Climate Fund, to restore peatland. This is Natural England’s first round of NCPGS Restoration Grants, with more rounds planned for the next two years."
        },
        {
            "text": "Peatlands are Earth’s largest terrestrial carbon store, holding more than twice the amount of carbon in all the world’s forests. They cover 10.9% of England’s land area. Unfortunately, 87% of our peatlands are degraded. In this state, they do not capture and store carbon but emit an estimated 10 million tonnes of carbon dioxide equivalent every year."
        },
        {
            "text": "The NCPGS aims to capture this carbon by setting 35,000 ha of degraded peatland on a path to restoration by 2025. This will help deliver the UK’s Net Zero target. It will contribute to the Nature Recovery Network with wider benefits to biodiversity, water quality and natural flood management."
        },
        {
            "text": "The five new Restoration Grants awarded mark a significant step towards achieving these goals. Peatland restoration comes with some unique challenges, including raising water levels to restore natural hydrology, and re-establishing peat-forming vegetation."
        },
        {
            "text": "In the Border Mires, Forestry England are leading a partnership to restore 827 ha of peatland. One of their main focuses is removing trees to create open peatland habitat."
        },
        {
            "text": "Lancashire and Cumbria Wildlife Trusts will work together to restore over 200 ha of lowland raised bogs in the North of England. On sites in more populated areas their work will include public engagement."
        },
        {
            "text": "At Dove Stone, Greater Manchester, the RSPB and United Utilities will restore 941 ha of blanket bog. They aim to increase resilience to drought and fire and reduce fire risks through public engagement."
        },
        {
            "text": "South West Water is leading the South West Peatland Partnership to restore 2,634 ha of some of the most southerly blanket bogs in England. They will focus on blocking ditches to re-wet extensive areas, as well as public engagement."
        },
        {
            "text": "Yorkshire Wildlife Trust are leading a partnership to restore 3,510 ha of blanket bog, as part of the Great North Bog Initiative. Restoration will include stabilising peat and planting to re-establish typical bog communities."
        },
        {
            "text": "The NCPGS also offers Discovery Grants, which fund work to unlock barriers to restoration. These can help prepare projects to apply for Restoration Grants in future application rounds. The first application window for Discovery Grants closed on 1 September 2021. A further round is planned for 2022."
        }
    ]
}