{
    "url": "https://forestrycommission.blog.gov.uk/2021/09/17/the-oak-lace-bug-a-potential-threat-to-oak-trees/",
    "title": "The oak lace bug: A potential threat to oak trees",
    "authors": [
        "Freddy Toft"
    ],
    "categories": [
        "Biosecurity",
        "Tree health"
    ],
    "pub_date": "2021-09-17T08:00:46+01:00",
    "content": [
        {
            "text": "The oak lace bug (Corythucha arcuata) is an insect native to North America that feeds on oak leaves. It was first reported in northern Italy in 2000, and has since become established in more than 20 countries in Central and Eastern Europe. However, don’t panic! The oak lace bug is not known to be in the UK currently. "
        },
        {
            "text": "Read on to find out more about the oak lace bug, how to spot the symptoms of it and what to do if you’ve detected a suspected sighting of it."
        },
        {
            "heading": 2,
            "text": "What are the risks of the oak lace bug?"
        },
        {
            "text": "Our oak trees are already under pressure from several pests and diseases in the UK, so it is vital that we protect them from this emerging threat. "
        },
        {
            "text": "The oak lace bug feeds on the undersides of leaves. Large populations can cause yellowing and browning of foliage, which can lead to premature leaf drop. In some European countries such as Hungary and Croatia, severe infestations have caused 100% discolouration of foliage as early as late July. Imagine what our parks and woodlands would look like if oak trees turned an unseasonal shade of yellow during summer! "
        },
        {
            "text": "The long-term consequences of the reduction in photosynthesis are not yet fully understood. However, it is likely that this premature loss of foliage could affect tree health and vigour, especially if infestations are repeated year-on-year and combined with other pests, diseases and environmental pressures. "
        },
        {
            "text": "The highest risk of entry to the UK is on infested plants or plant materials, such as logs, since adult oak lace bugs hibernate in bark crevices and in the moss covering tree trunks during winter. Although the adults are not particularly strong fliers, they can be blown by the wind over significant distances, so once introduced into a new area, they can establish and spread quite rapidly.  "
        },
        {
            "text": "The UK’s temperate climate is also unlikely to be a problem for the oak lace bug, as in its native range it can be found across many of the northern and eastern US states, and into southern Canada. "
        },
        {
            "text": "There is concern that if the oak lace bug established in the UK it could be another factor contributing to oak decline, especially in areas of the country where these trees are already threatened by other invasive pests."
        },
        {
            "heading": 2,
            "text": "What are we doing about it?"
        },
        {
            "text": "Our Plant Health Forestry team have a surveillance programme in place to detect the bug if it does arrive in the UK. The team has placed yellow sticky traps around high-risk sites and potential points of entry for the bug."
        },
        {
            "text": "Observatree volunteers also conduct their own surveillance programme each year. The volunteers are provided with yellow sticky traps and instructions on how and where to position them in towns and cities across the UK."
        },
        {
            "text": "You can also help in detecting the oak lace bug. Simply being aware of the symptoms and keeping vigilant throughout summer could make a massive difference in the fight against this pest."
        },
        {
            "heading": 2,
            "text": "So, what should you look out for?"
        },
        {
            "text": "The adult oak lace bugs are recognisable by their delicate, milk-white lacy wings with variable brown markings, and can reach up to 4mm long."
        },
        {
            "text": "Similarly to aphids, the oak lace bug feeds on the sap in leaves. The first signs of feeding damage are small, yellow spots on the upper surfaces of leaves, often concentrated around the leaf veins, (shown in the image above). "
        },
        {
            "text": "As the damage gets worse with increased feeding, the yellow spots merge into yellow and bronze patches."
        },
        {
            "text": "Damage to leaves is visible during the summer months and tends to increase between July and September. During the winter months, adults will be hibernating in the leaf litter and bark crevices."
        },
        {
            "text": "Other signs of oak lace bug infestations include:  "
        },
        {
            "text": "The UK has several native lace bug species, but they do not breed on oak trees. If you come across a lace bug on an oak tree, like the one shown above, then it’s likely to be the oak lace bug! "
        },
        {
            "heading": 2,
            "text": "What else can you do?"
        },
        {
            "text": "If you think you have spotted signs or symptoms of the oak lace bug, please report it immediately using TreeAlert. To submit a report, you will need to take three, high-quality photos of the suspected bugs and the tree you found them on, and record the location. Just be careful not to remove the bugs and nearby plants, as this could cause the pest to spread further. "
        },
        {
            "text": "By following simple biosecurity measures, you can also help to prevent the introduction and spread of pests and diseases, like the oak lace bug, and protect our woodlands. Find out how you can help on Gov.uk."
        }
    ]
}