{
    "url": "https://ruralpayments.blog.gov.uk/2023/07/06/confirm-your-business-details-in-the-rural-payments-service/",
    "title": "Confirm your business details in the Rural Payments service",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Online service",
        "Rural Payments service"
    ],
    "pub_date": "2023-07-06T09:56:38+01:00",
    "content": [
        {
            "text": "From July 2023, we will be asking businesses that have not confirmed or updated their business contact details in the Rural Payments service in the previous 365 days to confirm their business details before continuing to be able to use it.  "
        },
        {
            "heading": 2,
            "text": "Why are we doing this?  "
        },
        {
            "text": "Annual reconfirmation in the Rural Payments service helps us to ensure that we have the most up-to-date information about your business.  "
        },
        {
            "text": "It’s important that your business details are correct so that we can send you important updates and information and contact you about your applications and claims if we need to. "
        },
        {
            "heading": 2,
            "text": "How will it work? "
        },
        {
            "text": "If you have not updated or confirmed your business contact details in the Rural Payments service in the previous 365 days, you will be asked to do so the next time you log in.  "
        },
        {
            "text": "You will be directed to a screen which will show you the business details that we currently hold and be asked to check that they are correct. If they aren’t correct, you can choose to amend them.  "
        },
        {
            "text": "Once you have completed this screen, you will be shown additional details such as Legal Status and type of business. You can check these are correct or you can choose to skip these if you would prefer to check them again at a later date.  "
        },
        {
            "text": "You will then be directed to one final summary screen for confirmation of your details.  "
        },
        {
            "text": "Once this screen is complete, you will then be able to continue on to use the Rural Payments service.  "
        },
        {
            "text": "If you wish to check or update your business details before we launch this requirement, follow the steps in this video. If you have updated or confirmed your business details in the 365 days before we launch the annual reconfirmation, you won’t be asked to do this again until 365 days have passed.  "
        },
        {
            "heading": 2,
            "text": "What are the benefits?  "
        },
        {
            "heading": 2,
            "text": "Who will be affected by this?  "
        },
        {
            "text": "The requirement to update your business details will only be presented to you if you have Full Business or Make Legal Changes permissions in the Rural Payments service.  "
        },
        {
            "text": "Agents with lower permission levels will be able to continue as normal and will not be required to confirm details or make any changes. "
        },
        {
            "text": "For guidance on how to update your permissions on the Rural Payments service, follow the steps in this video on the RPA YouTube channel.  "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:   "
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements.  "
        },
        {
            "text": "You can also listen to The RPA Podcast and read The RPA News which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA.   "
        }
    ]
}