{
    "url": "https://environmentagency.blog.gov.uk/2023/07/06/cumbria-river-restoration-strategy-from-local-to-international-success/",
    "title": "Cumbria River Restoration Strategy: from local to International success",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2023-07-06T14:56:45+00:00",
    "content": [
        {
            "text": "Last year, an ambitious programme to restore and improve rivers in the Lake District battled competition from across Europe to win the prestigious European Riverprize. The joint work of the Environment Agency, Natural England and partners was recognised as winners last November for efforts across Cumbria to reinstate natural river processes that benefit both people and wildlife. Olly Southgate, Environment Agency Programme Manager tells us more about the project, its successes, and how they’re using the momentum to drive this work forward."
        },
        {
            "text": "The Cumbria River Restoration Programme"
        },
        {
            "text": "The Cumbria River Restoration Strategy was developed to help improve the quality and function of three Cumbria catchments - the Rivers Eden, Derwent and Kent. These also include areas of scientific interest and special areas of conservation."
        },
        {
            "text": "Many of our rivers have historically been extensively modified, compromising natural habitats and the benefits that rivers naturally provide us with. Reintroducing natural processes, such as variation in flows, connection with floodplains and sediment management, can reshape rivers to provide the diverse habitats and support a healthy river ecosystem. Delivering river restoration work can provide a wide range of benefits, creating better natural habitats for wildlife, making them more resilient to drought conditions and reducing flood risk through innovative nature-based solutions."
        },
        {
            "text": "The initial aim was to develop a programme of interventions that would not only protect and enhance the protected areas, but also potentially reduce flood risk, boost biodiversity, and create a more sustainable environment for all. At the start it was very much just an aspiration and concept, but it’s expanded to a huge fully functioning machine, delivering vast amounts of benefits for both our communities and wildlife."
        },
        {
            "text": "To deliver on a large enough scale to make a realistic difference, other organisations such as the local Rivers Trust, community led groups and national organisations such as the RSPB, the National Trust and Natural England, were also brought into the partnership. This joint effort of partners, stakeholders, local communities and private landowners was the main driving force behind the success of this programme. Enabling a positive ‘can do’ mindset from the beginning was also key. The journey can be extremely challenging at times, but less so with good people supporting you throughout."
        },
        {
            "text": "International recognition"
        },
        {
            "text": "The European Riverprize celebrates excellence in the management, conservation and development of Europe’s rivers, wetlands and surrounding communities. Historically, the prize is award in conjunction with the European River Symposium, which attracts an audience of Europe’s leading advocates for environment and river protection, including the European Commissioner for Environment."
        },
        {
            "text": "It’s heartwarming to see the work of the Cumbria River Restoration programme being recognised on an international scale and we are thrilled to have scooped this prize last year. In an ever-changing climate it’s work like this that will help to improve our environment for generations to come. The programme is now in the finals of the World River Prize which is set to be awarded in Brisbane in 2024. The competition will be fierce, with some of the largest river basins in the world also in contention, but we’re just really proud to even be in the mix and to be recognised as a true flagship restoration programme internationally."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "The Cumbrian River Restoration programme has improved almost 100kms of river length and restored over 150 hectares of floodplain across the catchments of the Rivers Eden, Derwent and Kent. It has also reduced flood risk, removed plastic from rivers and boosted biodiversity in the region."
        },
        {
            "text": "We’re incredibly proud of the progress we’ve made, but we’re not stopping here. The programme continues to grow and we aim to deliver even more great projects in the future. We are also always keen to share our lessons learnt, in a bid to enthuse others to replicate our successful model in other UK and European catchments and river basins. We’re already doing this by visiting the Vjosa river in Albania in September, as well as hosting various workshops and events over the next year."
        },
        {
            "text": "To read more about this project and the European Riverprize, visit: Cumbrian rivers project scoops prestigious European Riverprize - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Notes to Editors:"
        }
    ]
}