{
    "url": "https://mattersoftesting.blog.gov.uk/how-our-strategy-and-vision-will-affect-the-future-of-the-mot/",
    "title": "How our strategy and vision will affect the future of the MOT",
    "authors": [
        "Neil Barlow"
    ],
    "categories": [
        "MOT Modernisation",
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2023-07-06T16:35:20+01:00",
    "content": [
        {
            "text": "I wanted to catch up with you on the recent publication of DVSA’s vision and strategy and explain how that will affect the future of MOT. "
        },
        {
            "text": "Our strategic plan to 2025 and vision to 2030 set out our vision of keeping Britain moving safely and sustainably.  "
        },
        {
            "text": "To help us achieve that, there are 3 key areas within the vision that we will focus on. We want to set standards, assess and test. We want to inform, educate, and advise our customers. And finally, we want to license and accredit, regulate, and enforce. I would like to share more about what we’re planning in these areas within the MOT and vehicle testing industry."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Setting standards within the industry "
        },
        {
            "text": "Standards work when they are current, relevant, clear, and practical. Because only then are they trusted and truly effective. So, we want to make the best use of data and technology to improve standards of MOT testing. "
        },
        {
            "text": "The vision sets out the likely impact that technology will have in DVSA, including the MOT. A core objective will be to ensure the future of the MOT strikes the right balance between maintaining a high standard to ensure vehicle and driver safety, alongside keeping pace with new technology and supporting the sector as these changes emerge. "
        },
        {
            "heading": 3,
            "text": "Connected equipment "
        },
        {
            "text": "A good example of this is ‘connected’ garage equipment, which is mandatory for new garages, and encouraged for all. As you know, this allows certain parts of an MOT test to be uploaded directly to our computers. This makes the test quicker and cuts out the kind of keying in errors that even the best of us can make.  "
        },
        {
            "text": "We already use connected equipment with emission gas analysers, diesel smoke meters, and brake testers  since 2020. Modernising the equipment used will help secure the future of MOT. Further pilots that will support MOT testers improve accuracy include using cameras to aid identification of vehicles and trialling connected headlamp aim hardware. Chris Price blogged more about how we’ll be trialling connected cameras.  "
        },
        {
            "heading": 3,
            "text": "Getting you the right information, at the right time "
        },
        {
            "text": "I understand the practical reasons as to why mid-test it can be quite a drag to check a manual or call the helpdesk if those are not to hand. But maintaining and improving the quality of testing remains a key priority – and we want to better support you with this. "
        },
        {
            "text": "Over the next few years, we aim to pilot the use of different technologies to help us do this – for example, use of voice recognition through phones, to help provide automated real-time advice. This might all sound a little advanced – but these technologies are in use in other industries and will become more commonplace. So, starting some pilots will help us all get to grips with what may be possible.  "
        },
        {
            "heading": 2,
            "text": "License and accredit, regulate and enforce  "
        },
        {
            "text": "We know you want to be able to get on and run your business.  And you need us to recognise you, or your garage, officially so your customers know you’re qualified. You also need us to identify anyone competing in the MOT industry unfairly and dangerously and, where we must, to stop and even prosecute them. "
        },
        {
            "heading": 3,
            "text": "Tackling fraud "
        },
        {
            "text": "Connected equipment is a great way of tackling fraud. As part of our strategy for the next few years, we want to look at how we can better tackle this – while minimising the impact on those who are doing things right. Initially we will be investing more into how our risk rating operates, making it ‘cleverer’ to help identify those up to no good. Integrating new IT systems to monitor MOT data input and analysing trends that appear will support DVSA to root out MOT fraud and make roads safer.  "
        },
        {
            "text": "Going beyond connected equipment, it seems inevitable that we will need to look at ways of checking emissions more stringently. And the various types of driver assistance systems will become more important as drivers rely upon them more.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Inform, educate and advise "
        },
        {
            "text": "Another part of our vision is to do more to inform, educate and advise customers to do the right thing first time. That means better services and safer practice for everyone. As part of this, we want give motorists more information on how they can keep their vehicle safe to drive.  "
        },
        {
            "heading": 3,
            "text": "Doing more with advisories "
        },
        {
            "text": "We know we have a lot of information on the MOT Testing Service (MTS) that is of benefit to your customers.  "
        },
        {
            "text": "Car owners can already access the MOT test history and use the reminders service, as well as being able to obtain their previous test certificates. But as well as reminding people they need to get a test, there might be more we could do. For example, as technology and data from vehicles improves, we could remind motorists about their recent advisories and when they might need looking at.  "
        },
        {
            "text": "We could send them a text or email reminder that they had an advisory on their tyre tread and that they will need to sort it out before the tyre becomes illegal.  "
        },
        {
            "heading": 3,
            "text": "Adding value for customers "
        },
        {
            "text": "With emergent technologies there is more that we can do to improve and increase the amount of relevant information we communicate. For example, information on recalls, and advice for motorists on what to do in-between MOTs. The more value we can get from the MOT and the associated contacts we have with motorists, the more we can improve road safety and air quality to really demonstrate the important part that the MOT plays in society.  "
        },
        {
            "heading": 3,
            "text": "Planning ahead "
        },
        {
            "text": "I hope that I’ve been able to show you that we have a clear vision for the future of the MOT over the next 7 years. This work will be alongside the outcome of the Department for Transport’s (DfT) call for evidence, and consultation, which ran earlier this year into modernising the MOT.  "
        },
        {
            "text": "Within that, DFT asked questions around the benefits of technology, sustainability and air quality and how we can better work with partners (such as MOT garages) to deliver services to the public. We will share more about the outcome of these questions with you soon and how we hope to explore these areas. "
        },
        {
            "heading": 3,
            "text": "Moving forward together "
        },
        {
            "text": "With your support, we’ve already made huge strides in the rollout of connected equipment. And we have already started making changes that will make life easier both for you and your customers, especially in the digital sphere.  "
        },
        {
            "text": "I remain incredibly grateful to you for the hard work that you do to maintain the MOT as a fantastic and unique partnership between industry and government.  "
        }
    ]
}