{
    "url": "https://socialcare.blog.gov.uk/2023/07/06/invest-in-your-colleagues-to-deliver-great-care/",
    "title": "Invest in your colleagues to deliver great care",
    "authors": [
        "Barbara Yellow"
    ],
    "categories": [
        "Care and support",
        "Workforce"
    ],
    "pub_date": "2023-07-06T13:59:44+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Loyalty is a two-way street"
        },
        {
            "text": "I’m the HR and Payroll Manager at specialist dementia care provider, Vida Healthcare. I’d like to provide insight into what goes on behind the scenes at a care home to keep colleagues engaged."
        },
        {
            "text": "If a social care provider has a cohort of staff who are happy, healthy and motivated, there’s probably a team, behind the scenes, building a strong workplace culture. My day-to-day focus is all about supporting employees. From calling HMRC about tax codes, to helping people into rental properties, there’s always something different that needs to be done."
        },
        {
            "text": "I’m here for all employees throughout their time at Vida. My work starts before anyone has decided to join the business and continues until they leave, whether that be through retirement or a career change."
        },
        {
            "text": "HR isn’t just about work. I’m there to support colleagues in any capacity, even if it means helping them with their banking, organising their holiday leave, or directing them to the right financial advice. Supporting people to make informed choices can have a huge impact on their life and help them focus on the job at hand: providing exceptional care for our residents."
        },
        {
            "text": "The HR team can facilitate holistic care impacting every part of an employee’s life and set them on the road to success within social care. I’ve always found that, by giving help when and where it’s needed, colleagues reciprocate with loyalty. If I understand what they need and want, I can make it happen."
        },
        {
            "text": "Ultimately, we want all our employees to flourish, because high staff retention benefits everyone. The more we offer to employees, from financial support to training and career development, the more they’ll give back to Vida, their colleagues and residents."
        },
        {
            "heading": 2,
            "text": "Recruiting and supporting the best"
        },
        {
            "text": "Every department within a care home needs to work together to make sure exceptional care is being delivered, and that we attract and retain the right talent. Throughout my time at Vida, I’ve worked to transform the HR department to support the development of every individual. This is particularly important when working somewhere with a hugely diverse workforce. Every person is different, so we aim to work flexibly, to make sure we’re taking the right route for each person."
        },
        {
            "text": "Making sure the business values are embedded, not only in recruitment but in the management of employees, is crucial. Our values are included in every HR policy to make sure all residents are wanted, loved and appreciated as if they were in their own home. An essential part of the job is encouraging colleagues to not go through the motions of the job description, but make sure they really do understand and align with the values we’re trying to promote."
        },
        {
            "text": "This was reflected in the staff survey that we recently carried out. We found that 98% of our staff agree that our workplace values are important to them."
        },
        {
            "text": "Any HR Manager will understand the importance that should be placed on supporting colleagues. From a business perspective, if they have the right help, their performance level will increase, which is a win win for everyone. At a time when the social care sector is experiencing ongoing recruitment crises, this has never been more important."
        }
    ]
}