{
    "url": "https://dwpdigital.blog.gov.uk/2023/07/06/the-power-of-allies/",
    "title": "The power of allies",
    "authors": [
        "Rachel Parks-Szymborska"
    ],
    "categories": [
        "Digital Voices",
        "Diversity",
        "Equality",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2023-07-06T14:25:01+01:00",
    "content": [
        {
            "text": "Recently, I’ve been lucky enough to attend both the WeAreTech Festival ran by WeAreTechWomen in London and our own Women in Leadership cross-gov event in Manchester. The latter brought together 86 women from 13 different government departments with senior leaders from our partners Gartner. "
        },
        {
            "text": "Both events focused on equipping women to take control of their careers, build skills to support them in their leadership journey, and learn from those who have gone before, and to do so in a safe space. "
        },
        {
            "text": "The energy and excitement at the events was powerful and stimulating, with everyone keen to engage, share ideas and learn from each other. With so much energy in the room, it led to lots of useful discussions and great sessions where we could reflect and share practical experiences among ourselves. "
        },
        {
            "heading": 2,
            "text": "No one ‘makes it’ on their own "
        },
        {
            "text": "Both events brought home the power and value of allyship. None of us work in isolation and having allies around you means you have support when you need it. "
        },
        {
            "text": "At both events, inspirational women spoke about their own leadership journeys, how they’ve built their confidence and personal style. They also spoke about the challenges they contend with and the people who’ve supported and influenced them on their way. "
        },
        {
            "text": "Rich Corbridge opened the Women in Leadership event in his role as gender champion for DWP’s Women’s Network. He spoke of his aim of creating gender parity in leadership roles in DWP and highlighted the need for allies. "
        },
        {
            "text": "Throughout both events we created our own network of allies, and considered where we already have such people in place in our professional and personal lives. This is more than just a few connections on LinkedIn. These are the people who support, encourage, advise, share the burden, and help us grow and meet our goals. "
        },
        {
            "heading": 2,
            "text": "Surround yourself with inspiration and support "
        },
        {
            "text": "For me, my dad and my husband have always been my biggest cheerleaders. They’re the ones who tell me that of course I can do anything I put my mind to and reassure me that ‘you’ve got this.’ They inspire me and give me confidence to be brave.  "
        },
        {
            "text": "They are closely followed by a strong group of women I’m lucky enough to call friends. A diverse group of women from my professional and personal lives, from a range of backgrounds, perspectives, and experiences. They encourage and challenge me to be better – and I willingly do the same in return.  "
        },
        {
            "text": "Then there’s my work ‘family’ – the teams I build around me and work with, who I want to succeed and who I’m sure wish the same for me. Now I have a new group of allies, all with the same goal of helping each other grow. "
        },
        {
            "text": "I feel lucky. I’m sure you’re lucky too. Take the time to consider who your allies are – history shows us the value of choosing well. It also shows that allies may not be in the most obvious place.  "
        },
        {
            "heading": 2,
            "text": "Treat your network like a garden "
        },
        {
            "text": "Our own Cheryl Stevens stamped her mark on both events with her people-centred approach to leadership, and provided the best piece advice I heard: treat your network like a garden, nurture it and let it grow. I consider my allies the prize plants in that garden. They’re not the showiest, they don’t all match, or even complement each other, but they are the ones that give me confidence, joy, and purpose.  "
        },
        {
            "text": "Surround yourself with good people. Support, learn and grow with them and they will lift you up, no matter who they are. "
        }
    ]
}