{
    "url": "https://deframedia.blog.gov.uk/2023/07/06/three-marine-sites-better-protected-as-highly-protected-marine-areas-imposed/",
    "title": "Three marine sites better protected as Highly Protected Marine Areas imposed",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries",
        "marine"
    ],
    "pub_date": "2023-07-06T15:38:34+01:00",
    "content": [
        {
            "text": "This week, Defra announced that the first three Highly Protected Marine Areas (HPMAs) in English waters had come into force from Wednesday 5 July. The three sites are Allonby Bay (Irish Sea), Dolphin Head (Eastern Channel) and North East of Farnes Deep (Northern North Sea)."
        },
        {
            "text": "The announcement attracted interest from a range of national, regional and trade media who covered the story about the highest levels of protections that are now in place and how they will benefit the marine ecosystem as well as species and habits at the designated sites."
        },
        {
            "text": "BBC Radio Cumbria and ITV Border were amongst those who covered the announcement, focusing on their regional site located in Cumbria, Allonby Bay, and what the new protections will mean for wildlife found at the site – including shorebirds such as curlews and oystercatchers – which are attracted to the unique habitats found there. Some of these include ‘blue carbon’ habitats which can help to tackle climate change by capturing and storing carbon."
        },
        {
            "text": "Coverage was also seen nationally on BBC Online highlighting the reasons for designating the three sites being for ecological importance of nature recovery, as well as their social and economic impacts. The piece touched on the Scottish government’s recent decision to scrap plans to create HPMAs in 10% of their seas, after criticism following concerns from the fishing industry and island communities."
        },
        {
            "text": "HPMAs will help protect some of our most precious marine species and habitats such as honeycomb worm reefs, northern gannets and harbour porpoises, improving the health of our ocean for generations to come."
        },
        {
            "text": "These sites contribute towards achieving some of the UK government’s ambitious marine conservation targets and commitments to protecting our blue planet – set out in the Environmental Improvement Plan and 25 Year Environment Plan."
        },
        {
            "text": "Marine Minister Lord Benyon said: "
        },
        {
            "text": "Tony Juniper, Chair of Natural England, said:  "
        },
        {
            "text": "Hilary Florek, Chair of Marine Management Organisation said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}