{
    "url": "https://aphascience.blog.gov.uk/2023/07/06/vector-borne-diseases-2/",
    "title": "Exploring the rise of vector-borne diseases",
    "authors": [
        "Luis Hernandez-Triana"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2023-07-06T09:00:38+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Viruses travel the global health landscape"
        },
        {
            "text": "Arthropod-borne viruses are the cause of some of the greatest burdens to human and animal health worldwide. The effect of global climate change, wildlife migration and increased surveillance, means that there is strong evidence that temperate regions, such as the UK, are now seeing repeated introductions of invasive mosquito species, as well as mosquito-borne viruses not previously detected in the UK."
        },
        {
            "text": "For example, in Europe, repeated introductions of West Nile virus (WNV) and Usutu virus have been associated with bird migration from Africa and led to the establishment of these viruses in southern and eastern Europe. Subsequent short distance spread has occurred in new areas of western Europe, and six invasive mosquito species are now well established in countries across the Mediterranean basin."
        },
        {
            "text": "There have also been repeated reports of autochthonous (originating locally) transmission of chikungunya and dengue viruses caused by rapid transcontinental travel of infected humans and transmission by mosquitoes that bite humans."
        },
        {
            "text": "Improved surveillance has detected the presence of emerging pathogens such as Sindbis virus and Batai virus in Germany, and many arthropod-borne viruses are re-emerging across the world with new virus species or new strains being frequently discovered."
        },
        {
            "text": "Across Europe there has been an upsurge in the number of human and equine cases of WNV, with 1,499 human cases and 149 deaths reported in 2018, along with many equine cases. More recently, WNV was detected in great owls in northern Germany. Based on previous years, WNV is likely to establish and spread, increasing the risk of introduction to the UK through bird migration or human mediated activities."
        },
        {
            "text": "In 2019, tick borne encephalitis virus was detected in the UK, followed by the detection of Usutu virus in 2020. Further complicating the situation, the invasive species Aedes albopictus (tiger mosquito) has been detected six times in southern England. As such, the UK is at risk from the introduction and establishment of exotic arboviruses, and as climate change continues, arthropods that can transmit vector-borne diseases are increasingly likely to be found in the UK."
        },
        {
            "heading": 3,
            "text": "Shield and safeguard: Minimising the impact of vector-borne disease"
        },
        {
            "text": "APHA holds the UK National Reference Laboratory (NRL) for mosquito-borne viruses such as WNV and Rift Valley Fever virus (RVFV). We have vector borne disease research specialists and a veterinary surveillance network that carry out vector competence studies. As an NRL, APHA also undertake diagnostics and monitoring of endemic livestock diseases and screening for new and emerging vector-borne disease in livestock, companion animals (pets) and wildlife."
        },
        {
            "text": "APHAs Vector Borne Disease and Parasitology Discipline Champions, recently hosted a well-attended workshop in collaboration with the UK Health Security Agency (UKHSA), and APHA has secured new funding from the UKRI and DEFRA to deliver innovative research to better understand the vectors, vector-borne diseases and their impact."
        },
        {
            "heading": 4,
            "text": "Vector competence studies"
        },
        {
            "text": "APHA has undertaken research into UK mosquito competence and viral transmission dynamics for several emergent or re-emergent zoonotic pathogens such as Usutu, Zika virus, Japanese Encephalitis virus and RVFV. One Defra funded study sought to assess the vector competence of Culex pipiens UK mosquitoes with Japanese Encephalitis virus Lineage I."
        },
        {
            "text": "This research investigated the effect that climate change might have on the capacity of this mosquito to transmit Japanese Encephalitis virus, by assessing vector competence at typical UK summer temperatures (21°C and 25°C). Results show that at 21°C Culex pipiens can be infected with Japanese Encephalitis virus but infected mosquitoes did not contain live virus in saliva samples suggesting an inability to transmit infection to humans or animals. However, at 25°C this mosquito species can be infected, and live virus was detected in saliva, suggesting that bite transmission may be possible should the virus reach the UK in susceptible vector species during the warmer months of the year."
        },
        {
            "heading": 4,
            "text": "West Nile virus"
        },
        {
            "text": "APHA has conducted surveillance for mosquito-borne viruses in birds within the UK for many years, with a particular focus on WNV. WNV is carried by birds and can cause notifiable disease in humans and horses. Although present in southern Europe for decades, the UK is currently free of the disease."
        },
        {
            "text": "We have also been successful in obtaining Defra funding to study the vector competence of UK target mosquito species for WNV Lineage 1 and 2. This work includes competence studies on the invasive species, Culex quinquefasciatus and Aedes albopictus, and the development of a serological test (ELISA) specific to WNV. Our group conducts fieldwork to collect mosquitoes for rearing in our insectary facilities as part of the ongoing research."
        },
        {
            "heading": 4,
            "text": "Usutu virus"
        },
        {
            "text": "Usutu virus was first detected in UK wild birds in 2020, and again in 2021 and 2022 as a result of continued surveillance, testing and collaboration with the Zoological Society of London (ZSL), Institute of Zoology (IoZ), and the UK Health Security Agency (UKHSA). Although less virulent in humans and horses, Usutu can cause a lethal disease in certain species of birds, particularly the common (Eurasian) blackbird. Work is currently underway with ZSL to assess whether Usutu virus can overwinter (live through winter) in the UK. This is particularly relevant as we now experience warmer winter temperatures."
        },
        {
            "heading": 4,
            "text": "Ticks and tick-borne disease"
        },
        {
            "text": "In the last few years, we have seen a surge of tick-borne fevers in livestock in the UK. We are therefore taking an integrated approach to surveying ticks and establishing molecular tests for the detection of tick-borne pathogens in livestock and wildlife."
        },
        {
            "text": "During 2022 UKHSA and APHA worked closely on the surveillance of ticks and tick-borne diseases in livestock and wildlife, with a joint UKHSA/APHA visit to mid-Wales carried out to investigate the possible co-occurrence of potentially zoonotic pathogens."
        },
        {
            "text": "APHA have tested dead foxes, amongst a variety of wildlife species, which showed that they can carry blood parasites such as Babesia vulpi and ticks such as Ixodes canisuga, I. hexagonus and I. ricinus. Further molecular testing of specimens of I. ricinus obtained from National Parks and Areas of Outstanding Beauty in Wales and England showed they were infected with four species of Babesia. In addition, we are actively collecting ticks in areas where reports of diseased animals have been documented."
        },
        {
            "text": "Scientific research and surveillance are ongoing at APHA to further understand vectors and vector-borne disease, particularly in light of climate change, warmer summer temperatures and rapid international travel – all of which pose potential threats to animal and human health."
        },
        {
            "text": "Find out more"
        },
        {
            "text": "If you are interested in VBD, please take a look at some of our other related blogs and research papers:"
        },
        {
            "text": " "
        }
    ]
}