{
    "url": "https://deframedia.blog.gov.uk/2023/02/15/coverage-on-phosphorus-pollution-from-agriculture/",
    "title": "Coverage on phosphorus pollution from agriculture",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Pollution"
    ],
    "pub_date": "2023-02-15T17:51:25+00:00",
    "content": [
        {
            "text": "There has been coverage today in the Times – part of its Clean It Up campaign - regarding guidance for farmers to reduce and prevent agricultural pollution into waterways."
        },
        {
            "text": "The piece states that ministers have been accused of giving farmers permission to pollute waterways by loosening rules on how manure can be spread on the land. This is not the case, the regulations – known as the Farming Rules for Water – have not been changed."
        },
        {
            "text": "Farming activities are a main source of water pollution in the UK, which is why we are working with farmers to reduce nutrient pollution and incentivise better practices through our farming reforms."
        },
        {
            "text": "Our Sustainable Farming Incentive (SFI), Countryside Stewardship (CS) and Landscape Recovery schemes will provide farmers with funding support for regenerative measures that reduce water pollution and improve biodiversity. We have also made grants of up to £250,000 available to improve slurry storage, helping farmers to prevent water and air pollution."
        },
        {
            "text": "We have also funded 50 extra Environment Agency inspectors to be recruited and aim to conduct 4,000 farm inspections this year. This has significantly increased the EA’s capacity to work with farmers to meet their obligations, including around catchments such as the River Wye."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "An Environment Agency spokesperson said:"
        }
    ]
}