{
    "url": "https://ruralpayments.blog.gov.uk/2023/02/15/ensure-your-land-mapping-data-is-up-to-date-ahead-of-scheme-applications-and-claims/",
    "title": "Ensure your land mapping data is up-to-date ahead of scheme applications and claims",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Farming Investment Fund",
        "Mapping",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-02-15T13:14:46+00:00",
    "content": [
        {
            "text": "Farmers are being urged to ensure their land mapping data is up-to-date before making scheme applications and claims in 2023."
        },
        {
            "text": "RPA uses digital maps to record physical land parcel boundaries and land covers, and this data is key to the administration of RPA’s land-based schemes."
        },
        {
            "text": "Approximately 75% of the land in England is registered as over 2.5 million land parcels on our land system. Maintaining the integrity of our land system allows RPA to make timely and accurate payments to farmers. When claims are processed for payments, we check this data against the claim data we receive and resolve any differences."
        },
        {
            "text": "A timely turnaround is reliant on farmers and land managers providing accurate information on both the RLE1 forms and the sketch maps. This is also important as farmers need to ensure their digital maps correctly show the agricultural land parcels on their holding to apply for, or claim, rural payments. If the data on the RLE1 form is inaccurate or incomplete, or sketch maps are incorrect or missing, this can lead to mapping change delays."
        },
        {
            "text": "Farmers can submit RLE1 forms via email. This is a relatively new approach, but one that has been very popular, making it easier and cheaper for farmers to submit mapping changes."
        },
        {
            "text": "Mapping will remain an integral part of scheme delivery whilst we continue to administer land-based schemes. We’re working to improve the land change process and that should hopefully make it easier and more efficient for everyone."
        },
        {
            "text": "Farmers can help by making sure all the required fields are completed within the RLE1 form, make clear and accurate annotations on any maps, respond promptly to RPA requests for further information and follow the guidance when emailing RLE1 forms. When you send your RLE1 form to RPA to make mapping changes to your registered land, it’s important you send accurate sketch maps for each of the mapping changes. You should use your sketch maps, alongside aerial photography and Ordnance Survey maps where possible, to mark up and annotate your mapping changes, rather than the RLE1 form."
        },
        {
            "text": "You can see digital maps of all the land parcels registered to your holding using the Rural Payments service on GOV.UK. If the digital maps don’t show all your land correctly, you can make changes by filling in an RLE1 form. An RLE1 form also needs to be used to register a land parcel for the first time. The RLE1 form should be used to make all changes, other than:"
        },
        {
            "text": "For these changes (up to five parcels) you can call the helpline (0300 0200 301) and we will make the amendments."
        },
        {
            "text": "You can sign up to our blog and follow us on social media on the following accounts to see the latest information and updates from RPA:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}