{
    "url": "https://actuaries.blog.gov.uk/2023/02/15/finding-my-purpose-in-climate-change-work-in-government/",
    "title": "Finding my purpose in climate change work in government",
    "authors": [
        "Chris Paterson - Actuary"
    ],
    "categories": [
        "Actuary",
        "Climate change"
    ],
    "pub_date": "2023-02-15T14:11:53+00:00",
    "content": [
        {
            "text": "Ahead of the Civil Service Environment Network (CSEN) conference I reflected on the climate change related work I’ve been involved with at the Government Actuary’s Department (GAD). The Climate and Environment Conference 2023 will be held in central London on 21 February."
        },
        {
            "heading": 2,
            "text": "Finding my purpose"
        },
        {
            "text": "I joined GAD in 2018 looking for more purpose in my work as an actuary. I found this purpose through my work on disaster risk finance where I work with the Foreign, Commonwealth & Development Office, Centre for Disaster Protection and the World Bank."
        },
        {
            "text": "Some like-minded colleagues and I also formed an informal group to look at what actuaries in government could do to help tackle climate change. At that time, while there was lots of good work happening in this area in government, it felt harder for us to get involved at GAD."
        },
        {
            "text": "As actuaries, making assumptions about a very uncertain long-term future is challenging to do in a way that encompasses all potential risks and possibilities, including those which could be the result of climate change."
        },
        {
            "text": "We highlighted the right risks but didn’t always have the tools or knowledge to go further in a way that would help our clients in government as much as we wanted to."
        },
        {
            "heading": 2,
            "text": "Skills and capacity"
        },
        {
            "text": "Since starting the group over 4 years ago it has grown and developed and is now the area in GAD which has the most success in engaging other departments."
        },
        {
            "text": "Some of the colleagues I started the group with have left GAD to tackle the climate crisis in their own ways. However, as the group has evolved, we have built skills and capacity for us to advise in new areas of work."
        },
        {
            "heading": 2,
            "text": "Collaborative working"
        },
        {
            "text": "We have also been working collaboratively with other professions to develop areas in which our skills can help. As an example, one of my colleagues went to COP26 as part of an HM Treasury team looking at private finance’s contribution to net zero goals."
        },
        {
            "text": "A growing area of activity for us is helping organisations to report on their climate risks and opportunities, as recommended by the Task Force on Climate-Related Financial Disclosures (TCFD). The published roadmap sets out the expectation for TCFD reporting to be embedded across the UK economy by 2025."
        },
        {
            "text": "To do this effectively organisations need to estimate their future experience under a range of climate scenarios. As professionals specialising in long-term risk, actuaries are well-placed  to advise here, and indeed at GAD we have already been helping public sector organisations with these issues."
        },
        {
            "heading": 2,
            "text": "Roles and challenges"
        },
        {
            "text": "At the CSEN conference I’m looking forward to meeting like-minded climate advocates; seasoned professionals who’ve been on the front line for some time. I also hope to meet civil servants who may be in a similar place to where I once was. Knowing this was an area I was passionate about and trying to find how to make best use of my skills."
        },
        {
            "text": "Either way this is a great opportunity for us to help each other on that journey, learning from each other about our different roles and challenges."
        },
        {
            "text": "To find out more about how GAD’s climate risk expertise can help your organisation contact us at climate.change@gad.gov.uk"
        },
        {
            "heading": 3,
            "text": "Notes and disclaimer "
        }
    ]
}