{
    "url": "https://naturalengland.blog.gov.uk/2023/02/15/ne-wl-stats-2022/",
    "title": "Natural England wildlife licensing statistics for 2022",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Licensing",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2023-02-15T09:56:41+00:00",
    "content": [
        {
            "text": "By Stephanie Bird-Halton, National Delivery Director"
        },
        {
            "text": "Many wild animals and plants are protected in law by the Wildlife and Countryside Act 1981 and the Conservation of Habitats and Species Regulations 2017. As nature conservation adviser and regulator, one of Natural England’s roles is to licence certain activities that may disturb or harm wildlife, in line with the legal framework established by Parliament."
        },
        {
            "text": "Each year, as part of our commitment to transparency, we publish a summary of the wildlife licences we have issued and the data for 2022 are now available here."
        },
        {
            "text": "In any given year approximately half the licences we issue are for activities that support nature recovery, research and education. Last year this included the translocation of red kites from England to help restore Spanish populations."
        },
        {
            "text": "The legislation sets out the limited purposes for which we may grant a licence to take, kill or disturb wildlife. These include preserving public health and public safety or air safety, preventing spread of disease, and preventing serious damage to crops, livestock and, in some instances, property. Licences are only issued if all relevant criteria are met following a review of the purpose of the application, alternatives and methods, and the scientific context relating to it."
        },
        {
            "text": "One type of licence included in the report for the first time in a number of years, following improvements to our system that enable data extraction, permits the hunting of wild birds for falconry. Information relating to this has already appeared in the public domain following our recent response to a Freedom of Information request and has generated comment due to the fact that some species licensed are currently of conservation concern in England. These licences allow falconers to fly trained birds of prey to hunt and kill quarry species that they would naturally prey upon in the wild such as skylark, song thrush and meadow pipit. We understand concerns expressed about red list species being taken under these licences. Licences are only issued when there is deemed to be no effect on the conservation status of the birds involved. If the evidence points to the need for a change in policy, then we will provide appropriate advice to government.\nOther information that is provided in our report for the first time in recent years are data for area-based licences issued to control cormorants to protect fisheries. Again this reflects improvements to reporting systems rather than a new area of licensing."
        },
        {
            "text": "Species that may stand out in the data include osprey and goshawk. An osprey nest was removed under licence from an electricity pylon to protect the security of power supplies. This activity took place when the nest was not in use so no osprey were harmed. A captive goshawk which had escaped was licensed to be trapped and returned its owner."
        },
        {
            "text": "I hope this provides useful context to our licensing work. For further information on any of the data we are releasing please contact us via: enquiries@naturalengland.org.uk."
        }
    ]
}