{
    "url": "https://ssac.blog.gov.uk/2023/02/15/reflections-on-my-time-with-the-social-security-advisory-committee/",
    "title": "Reflections on my time with the Social Security Advisory Committee",
    "authors": [
        "Liz Sayce"
    ],
    "categories": [
        "About the Committee",
        "Disabled People",
        "DWP",
        "Legislation",
        "social security",
        "SSAC Independent Work Programme",
        "SSAC Occasional Papers",
        "Stakeholders"
    ],
    "pub_date": "2023-02-15T14:59:57+00:00",
    "content": [
        {
            "text": "I have been a member of the Social Security Advisory Committee (SSAC) since 2016 and, as my term comes to an end, I want to reflect on what a fascinating role it has been. When I was first appointed, I was still Chief Executive of Disability Right UK; and I have always worked to bring evidence of disabled people’s experience into the work, not least by engaging on specific projects and issues with Disabled People’s Organisations, claimants, umbrella organisations and disability policy experts.  "
        },
        {
            "text": "As the Committee analyses the implications of draft social security regulations, we have significant debates on what the policy purpose is, whether it will be met by the proposed regulations and whether there are any unintended consequences. We look at how equality impacts have been addressed – and ask questions of officials on, for instance, which groups of people will be most affected and what data is available to illuminate that.  "
        },
        {
            "text": "I have learnt a huge amount from the tremendous expertise of fellow Committee members, ranging from detailed legal academic knowledge to wider policy and strategic thinking. It is that range of knowledge and skills that makes for very high-quality discussions, everyone challenging and learning from each other. And through those debates, and through questioning officials (from policy, analytic and operational teams) so we are really clear on the proposals, we reach conclusions and advise government on ways to improve regulations, before they are laid before Parliament or implemented. During my time we have advised on regulations on everything from young people’s housing allowances to Universal Credit earnings thresholds; from Personal Independence Payment mobility allowances to the large-scale move to Universal Credit. This type of scrutiny can really improve policy. We advise, Ministers decide – so not all of our advice is accepted, but sometimes we find that even if the advice is not immediately adopted, it is implemented down the line.  "
        },
        {
            "text": "We also have the opportunity to talk with a range of local DWP staff including work coaches and Disability Employment Advisors, and to visit Jobcentres, to understand how the system works in practice. This grounds our advice in the real context of the work.  "
        },
        {
            "text": "SSAC also develops more proactive, substantial advice on topics that emerge (from our discussions with stakeholders) as significant and topical and where we can add value. During my time on the Committee I have led or been involved in projects resulting in published reports including: "
        },
        {
            "text": "As I move on from SSAC I look forward to seeing new members pick up these vital roles. "
        },
        {
            "text": "NOTE: The Department for Work and Pensions is seeking to appoint five new members to the Social Security Advisory Committee.  If you are interested in providing impartial, credible, evidence-based advice to the Secretary of State for Work and Pensions, and have the necessary skills and experience, find out how to apply here.  Closing date for applications is 10 March."
        }
    ]
}