{
    "url": "https://nationalscreening.blog.gov.uk/2023/02/15/simple-screening-comparisons-between-countries-mask-complex-differences/",
    "title": "Simple screening comparisons between countries mask complex differences",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-02-15T09:39:07+00:00",
    "content": [
        {
            "text": "Thousands of babies are born in Europe every year with one of many rare, and sometimes serious, diseases."
        },
        {
            "text": "Making recommendations on rare diseases is particularly difficult because their very rarity means there is often a lack of high-quality evidence from the usual research methods such as randomised controlled trials (RCTs)."
        },
        {
            "text": "Several reports have highlighted differences between countries in their approaches to screening for these conditions. Tests, treatments and care vary, despite the international evidence base being the same."
        },
        {
            "text": "The UK National Screening Committee (UK NSC), the independent scientific committee that advises ministers and the NHS in all 4 UK nations on screening policy, has links with equivalent organisations and colleagues across the continent. But these international screening advisory groups are not all the same. In addition to significant cultural differences with our close neighbours, there is variation in how health services are delivered and funded, how screening is described and how screening policy is made."
        },
        {
            "text": "To understand why screening for rare diseases differs between countries, the UK NSC has been looking at exactly what is being offered where, to whom and by whom, and what expertise guides these screening recommendations and policies."
        },
        {
            "heading": 2,
            "text": "What the evidence reveals"
        },
        {
            "text": "The UK NSC commissioned a systematic review to compare international screening policy making1. It found considerable variation between countries in how to decide whether to start or continue a screening programme, including differences in:"
        },
        {
            "text": "The UK was one of only 2 countries to state in its evidence review criteria that ‘clinical management of the condition [being screened for] and patient outcomes should be optimised in all health care providers prior to participation in a screening programme’."
        },
        {
            "text": "Another systematic review2 reported that 42% of recommendations by other national policy-making bodies working in newborn blood spot (NBS) screening did not take account of evidence on test accuracy, 36% did not review evidence about whether early treatment improves health outcomes, and 76% did not consider evidence about potential harms of overdiagnosis."
        },
        {
            "text": "This variation was further highlighted in a 2020 paper3 that reported that the number of conditions the NBS programme screens for across Europe ranged from 1 to 31."
        },
        {
            "text": "We have been in touch with some of our contacts across Europe to explore in more detail exactly what is offered and delivered to babies and families."
        },
        {
            "text": "We found, for example, that some countries or regions reportedly screen for a condition when it is only at the pilot or research stage. Some ‘screening programmes’ just test for a condition rather than being end-to-end quality-assured programmes that include diagnosis, treatment and care. And screening in some countries is delivered regionally, or even just by individual hospitals, rather than nationally."
        },
        {
            "text": "These policy-making and structural differences have led to a complex international picture of whether screening for a particular condition is recommended and how that screening is, or will be, implemented."
        },
        {
            "heading": 2,
            "text": "SMA example illustrates complexity"
        },
        {
            "text": "Screening for the genetic disease spinal muscular atrophy (SMA) provides one example of this variation."
        },
        {
            "text": "The UK NSC currently recommends not to screen for SMA. However, that recommendation is being reconsidered through a major piece of work to review the case for screening for SMA following developments in the evidence base. And a study to pilot screening in the UK was launched in the Thames Valley last year."
        },
        {
            "text": "Several other countries, for example Sweden and Switzerland, are also in the process of reviewing, or are about to review, the case for SMA screening."
        },
        {
            "text": "Elsewhere, SMA screening is being piloted in France and the Czech Republic and it has been approved in some, but not all, regions of Italy and Spain."
        },
        {
            "text": "Other countries, including Portugal, Denmark and the Netherlands, implemented national screening programmes for SMA very recently, during 2022."
        },
        {
            "heading": 2,
            "text": "UK NSC’s rigorous approach "
        },
        {
            "text": "The UK NSC recently recommended the introduction of national population screening for tyrosinaemia and the addition of NBS screening for severe combined immunodeficiency (SCID) is currently being evaluated in England."
        },
        {
            "text": "The committee has set up a blood spot task group (BSTG) to identify ways to help researchers and others develop evidence that can help it make good recommendations within the constraints of limited evidence bases. It is also working to compare EURORDIS (European Organisation for Rare Diseases) key principles for newborn screening with UK decision making and implementation practices to establish what we can learn."
        },
        {
            "text": "Meanwhile, whole genome sequencing (WGS) technology, which can detect genetic variants associated with hundreds of rare conditions, has advanced rapidly in recent years and has huge potential implications for the future of screening in the UK. The UK NSC is working with Genomics England to look very carefully at these implications, including very important questions as to which conditions it would be ethical and acceptable to test for, and how genetics could usefully add to the existing newborn screening programmes."
        },
        {
            "text": "The committee will continue to set the evidential bar for screening deliberately high because the harms of screening, including false positive and false negative results, overtreatment, treatment risks and anxiety, can outweigh the benefits."
        },
        {
            "text": "The UK NSC makes recommendations for the whole UK population, the great majority of whom do not have the condition(s) we screen for. Screening must significantly benefit affected individuals without causing disruption or harm to the majority."
        },
        {
            "text": "Current uptake of newborn screening in the UK is over 99% and the UK NSC does not want this very high public trust to be reduced. It will continue to bring academic rigour and authority to what is an extremely complex area, while understanding the frustration of those who want more screening and the pace of change to be quicker."
        },
        {
            "heading": 3,
            "text": "References:"
        },
        {
            "text": "1Seedat F, et al, International comparisons of screening policy-making: A systematic review. University of Warwick. October 2014"
        },
        {
            "text": "2Taylor-Phillips S, Stinton C, Ferrante di Ruffano L, Seedat F, Clarke A, Deeks JJ. Association between use of systematic reviews and national policy recommendations on screening newborn babies for rare diseases: systematic review and meta-analysis. BMJ. 2018;361"
        },
        {
            "text": "3 Loeber JG, et al. Neonatal Screening in Europe Revisited: An ISNS Perspective on the Current State and Developments Since 2010. Int J Neonatal Screen. 2021 Mar 5;7(1):15"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}