{
    "url": "https://defrafarming.blog.gov.uk/2024/08/05/an-update-on-sfi-and-our-agri-environment-schemes/",
    "title": "An update on SFI and our agri-environment schemes ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "environmental land management schemes",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-08-05T11:54:15+01:00",
    "content": [
        {
            "text": "It’s been a while since we last posted. We’re glad to be back! "
        },
        {
            "text": "Over the past month, we’ve been welcoming Defra’s new ministerial team.  "
        },
        {
            "text": "Defra’s ministers have said they don’t want to overturn the applecart and are fully committed to environmental land management schemes (ELM).  "
        },
        {
            "text": "We’ve been working with ministers on how we can optimise our schemes and grants so that they produce the right outcomes for farmers, food security and nature recovery in a fair and orderly way.  "
        },
        {
            "text": "Right now, we want to maintain the momentum that built over recent months. Record numbers of farmers are now in an ELM scheme. "
        },
        {
            "text": "We’ll provide further details in the coming weeks of our other offers, but the expanded Sustainable Farming Incentive (SFI) offer is still open and, if you want to apply, you can express your interest online. "
        },
        {
            "text": "In this post, we’ll share a short update on how the rollout of SFI is going. We’ll include links to the new supplementary scheme guidance for the expanded offer, details on endorsed actions and information on capital items too.  "
        },
        {
            "heading": 2,
            "text": "Continuing the steady rollout  "
        },
        {
            "text": "As part of the controlled rollout of the SFI offer in 2024, we have been accepting expressions of interest and the first SFI agreements for 2024 are now live.  "
        },
        {
            "text": "If you want to apply for the expanded SFI offer, the first step is to register your interest with the Rural Payments Agency (RPA). "
        },
        {
            "text": "After you complete an expression of interest, the RPA will invite you to apply.  "
        },
        {
            "text": "The expanded SFI offer, designed with the agricultural sector, was announced in May. It comprises 102 actions including more than 20 new actions to support more sustainable food production, with payments for precision farming, agroforestry, a new and expanded offer for upland farmers and more actions for tenants on short-term contracts. "
        },
        {
            "text": "The offer is designed to offer something for all farmers, and covers the range of actions we need to meet our targets for environmental improvement, while also maintaining food production.  "
        },
        {
            "heading": 2,
            "text": "New on GOV.UK "
        },
        {
            "heading": 3,
            "text": "Updated SFI scheme guidance "
        },
        {
            "text": "We updated the  SFI terms and conditions on GOV.UK to explain how you can access more actions and add more land by taking out a second agreement. "
        },
        {
            "text": "Today, we’ve updated the expanded SFI scheme guidance to include technical changes and more information on supplemental SFI actions. "
        },
        {
            "text": "We’ve also updated some of the wording for the actions published back in May to clarify what farmers and land managers need to do. "
        },
        {
            "text": "We’ve set out what we’ve changed within the action on the ‘Find funding for land or farms’ page – these are normally minor clarifications or additional information to help."
        },
        {
            "text": "All the changes we’ve made are based on our careful and controlled rollout of the scheme, listening to and acting upon feedback we receive. "
        },
        {
            "heading": 3,
            "text": "Endorsed actions "
        },
        {
            "text": "Some SFI actions target certain priority habitats or species and heritage features. These need to be approved and are known as endorsed actions."
        },
        {
            "text": "Once you submit an application featuring an endorsed action, Natural England or Historic England, will contact you to confirm your land is suitable for the action for it to be included in your agreement."
        },
        {
            "text": "The first will be GRH6: Manage priority species-rich grassland. We’ll publish more information on this action and the additional endorsed actions in a separate post soon."
        },
        {
            "text": "Section 1.2 of the scheme information contains more details on endorsed actions. "
        },
        {
            "text": " Voluntary advice "
        },
        {
            "text": "Alongside the official SFI guidance, we’ve created new voluntary advice for each SFI action which explains good practice."
        },
        {
            "text": " It offers information and examples on how you might choose to do the actions. It's intended to give reassurance if you're unsure how to undertake an action, or if you're concerned you might do the wrong thing.  "
        },
        {
            "text": "This guidance is optional and something that farmers asked us to provide. It is there to help. You don’t have to follow it. It’s part of our overall approach to making SFI less prescriptive than previous schemes. "
        },
        {
            "text": "You can find the voluntary advice under each action on GOV.UK's  Find funding for land or farms page. "
        },
        {
            "heading": 3,
            "text": "Capital items  "
        },
        {
            "text": "The agri-environment capital grants offer has been available since January. "
        },
        {
            "text": "Today, we added a range of new capital items to the existing offer. "
        },
        {
            "text": "This means that in total, there are now 105 capital items (and 5 plans) available through the different grants. "
        },
        {
            "text": "For example, we’ve introduced new capital items to support the SFI agroforestry actions to help protect trees while they are established and grant funding is available for items including tree guards.  "
        },
        {
            "text": "A new moorland mapping plan supports better planning to manage environmental features on moorland. "
        },
        {
            "text": "You can access these capital grants as a standalone grant, or to help you carry out the actions in your SFI agreement.  "
        },
        {
            "text": "Colleagues at the Forestry Commission will publish an agroforestry post on their blog soon. "
        },
        {
            "heading": 2,
            "text": "Stay up to date "
        },
        {
            "text": "We will confirm plans for Countryside Stewardship Higher Tier and our broader approach to environmental land management in due course. "
        },
        {
            "text": "Stay up to date through our blog posts. In the next few weeks, we'll confirm our plans for agricultural shows and auction marts. You can your questions to us in the comments section below or at a webinar. We'll publish details of upcoming webinars here on the blog. "
        }
    ]
}