{
    "url": "https://environmentagency.blog.gov.uk/2024/08/05/river-vegetation-management-in-lincolnshire-and-northamptonshire-reducing-flood-risk/",
    "title": "River vegetation management in Lincolnshire and Northamptonshire - reducing flood risk",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Flood",
        "Nature"
    ],
    "pub_date": "2024-08-05T09:58:59+00:00",
    "content": [
        {
            "text": "Abigail Ovenden, Asset Management Engagement Advisor, looks at how the Environment Agency reduces flood risk in Lincolnshire and Northamptonshire by cutting vegetation."
        },
        {
            "text": "Environment Agency teams (and contractors on our behalf) manage vegetation and weed growth along 2,210 kilometres of Main River across the Lincolnshire and Northamptonshire area. Main rivers include the Nene, Welland, Witham and Ancholme. This regular maintenance aids the passage of water and can reduce flood risk to people and property."
        },
        {
            "text": "The Environment Agency has permissive or discretionary powers to maintain and improve Main Rivers for the efficient passage of flood flow and the management of water levels. We are not obliged to carry out either maintenance or new works on Main Rivers, but we do carry out this work where it provides the greatest reduction to flood risk to protect people, property, and wildlife. We bid for public funding every year to carry out this and other types of maintenance and work alongside riparian landowners and Local Authorities who also share this responsibility."
        },
        {
            "text": "Why do we remove vegetation from rivers? "
        },
        {
            "text": "Aquatic plants are a very valuable part of the ecosystem. They are a primary food source for aquatic fauna and provide habitat and shelter for a wide diversity of wildlife. They also help protect the banks and bed of the river from erosion and help to modify the velocity of water. However, aquatic plants can become a problem if their growth affects the passage of water in the river or the wildlife in it. At this point, some form of cutting may become necessary."
        },
        {
            "text": "The Environment Agency removes vegetation in rivers to reduce flood risk. Reducing flood risk is the primary purpose of maintenance to Main Rivers and what we are funded to do. However, our maintenance budget is limited and we cannot remove weed from every Main River."
        },
        {
            "text": "We must prioritise works which provide the greatest benefit to flood risk. We focus our resources where they are most needed, protecting people, homes and businesses."
        },
        {
            "text": "Removing weeds from channels helps water move freely, aiding its passage. When high river flows occur, less weed will help ensure the water can move more freely down the river and away from properties. We also do some vegetation management to aid navigation along rivers where we are the Navigation Authority. These rivers include the Ancholme, Nene, Welland, Glen and the Black Sluice Navigation in Boston."
        },
        {
            "text": "How do we cut the weed?  "
        },
        {
            "text": "anRemoving and cutting vegetation in river channels is carried out by a variety of methods. This includes boats with cutters, long arm excavator machines; rakes and cutting by hand. The type of method used depends on the characteristics of the river and weed growth, as well as accessibility to the river. Weed boats are the most effective method of cutting in large watercourses. You may be unable to see the weed we are cutting, because it grows from the riverbed itself. These boats and excavators are designed to remove weed under the water before it reaches the surface."
        },
        {
            "text": "When do we cut vegetation in rivers? "
        },
        {
            "text": "Our programme of maintenance is scheduled to help ensure we are cutting in river channels during the late growing season. This reduces the chance of vegetation returning before the next cut. Some rivers may have more than one cut a year, dependent on levels of flood risk or to inspect flood risk structures. Timings can change due to a variety of factors such as bank conditions or weather. However, we mainly cut between August and October, so the banks are winter ready.  We work with a variety of other organisations and community groups such as fishing groups to gain mutual benefit, but ultimately our priority is to reduce flood risk."
        },
        {
            "text": "Why do we leave the cut vegetation on the banks? "
        },
        {
            "text": "River weed is a natural material and does not cause any harm to the environment. Where possible, cut vegetation and weed is placed carefully on the high side of the embankments where it cannot be washed back into the river. This allows any animals trapped in the weed to make their way back to the water, and to ensure that any water vole burrows are protected from being blocked. If we identify an invasive species that could harm the area, we will remove it safely. We appreciate that when removing material from the river we may also remove litter that was caught up in it. Unfortunately, we do not have the resources and funding to dispose of it somewhere else. We encourage local communities to carry out litter picks along their local river, which could be timed alongside when we carry out a weed cut."
        },
        {
            "text": "How do we safeguard biodiversity during these works? "
        },
        {
            "text": "We are working to create a better place in everything we do. We have a team of biodiversity experts whose role it is to advise and help us adapt our maintenance work to support biodiversity where possible. In the bird breeding season, the working area is checked for nesting birds prior to works. We closely monitor the levels of dissolved oxygen in the water, especially in warm weather, and stop work if the levels start to fall. We also support biodiversity by leaving a margin of vegetation habitat on one or both sides of the river."
        },
        {
            "text": "When we cut vegetation in the river, we may also leave a margin along one or both sides of the channel. This encourages river wildlife by creating habitat, and also helps protect the bottom of the riverbank from erosion. Leaving a margin depends on the characteristics of the river and the level of benefit it will bring."
        },
        {
            "text": " Who can I contact for more information? "
        },
        {
            "text": "If you would like further information on maintenance, please get in touch using the contact details below:"
        },
        {
            "text": "Post - National Customer Contact Centre PO Box 544 Rotherham S60 1BY United Kingdom"
        },
        {
            "text": "Email - LNenquiries@environment-agency.gov.uk"
        },
        {
            "text": "Telephone - 03708 506 506 (Monday to Friday, 8am-6pm)"
        },
        {
            "text": "Incident Hotline - 0800 80 70 60 - to report flooding, blockages, pollution, unusual changes in flow of water, collapsed or badly damaged defences (24-hour service)."
        }
    ]
}