{
    "url": "https://naturalengland.blog.gov.uk/2024/08/05/the-magic-of-heathland-summers-nightjars-nature-recovery-and-the-future-of-our-landscapes/",
    "title": "The Magic of Heathland Summers: Nightjars, Nature Recovery, and the Future of our Landscapes",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Landscapes",
        "Landscapes and access",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network",
        "Parks, trails and nature reserves",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-08-05T10:15:12+01:00",
    "content": [
        {
            "text": "Victoria Hawkins, Heathland Connections Nature Recovery Project Senior Advisor, Natural England."
        },
        {
            "text": "Heathland Connections is an inspiring Nature Recovery Project and I feel fortunate to spend the best part of my day working on it. In this post, I want to share what made me fall in love with the heathlands, what the project is all about and why it’s so important when we think about reversing the decline in England’s nature."
        },
        {
            "text": "Why was Heathlands Connections started? "
        },
        {
            "text": "Lowland heathland is one of the world's rarest habitats and known for its free-draining, sandy, acidic, and low-nutrient soil. It’s home to dwarf shrub species like heather and gorse which create a distinctive (and stunning) landscape."
        },
        {
            "text": "Sadly, our heathlands have been depleted over time and need restoring."
        },
        {
            "text": "Historically, heathlands have been impacted by people using the products of the land to live. This led to a complex mosaic of open dry and wet heath, acidic grassland, regenerating woodland, and scrubby heath. With the industrial evolution came a rise in intensive agriculture and urban development, which has caused an 80% decline in heathlands since 1800s."
        },
        {
            "text": "Photo credit: Heather in Bloom, Wealden Heaths - Victoria Huth"
        },
        {
            "text": "What’s the purpose of the project? "
        },
        {
            "text": "The vision is to build a resilient environment where wildlife can thrive, and people can deepen their connection to nature in the western area of the Surrey Hills National Landscape. Heathlands Connections aims to create a connected landscape, by reconnecting fragmented habitats, enhancing climate resilience, and promoting responsible enjoyment of natural areas. The purpose is to support nature recovery, strengthen existing habitats, and boost biodiversity."
        },
        {
            "text": "As part of a broader government effort to create a Nature Recovery Network across England, this is one of 12 Nature Recovery Projects designed to reverse biodiversity declines and ensure that nature has the space it needs to recover, while providing accessible, wildlife-rich spaces for all to enjoy."
        },
        {
            "text": "The magic of Heathlands "
        },
        {
            "text": "I’m passionate about the vision of this project. I remember my first experience of heathlands like it was yesterday. I was volunteering as a brownie, helping with winter scrub removal. It was a freezing cold day, and I spent what felt like hours pulling up sapling pine trees. What struck me most about these special habitats was the sense of openness and tranquillity. It felt magical to be there. I have been lucky to live locally to heathlands, either in Surrey or down in Dorset."
        },
        {
            "text": "Who runs the project? "
        },
        {
            "text": "Heathlands Connections was created and funded by Natural England (an organisation which sits within Defra - Department for Environment, Food & Rural Affairs) and is led by the Heathland Connections partnership. The partnership is what brings this project to life. It is inspiring to see what we can achieve from sharing our resources and expertise. We are so much stronger working together."
        },
        {
            "text": "Thursley NNR Drone image taken by Piotr Beinke"
        },
        {
            "text": "How does the project help Nature Recovery? "
        },
        {
            "text": "The name gives a big clue. This project connects people with nature, connects the landscape, connects the heathlands with the goal of creating a bigger, better and joined up landscape. Connectivity is vital. To thrive, wildlife needs space to move freely and access what is needed to survive. Habitats in isolation do not help to recover nature."
        },
        {
            "text": "At places like Thursley National Nature Reserve (NNR), a dedicated Reserve Manager, works alongside a team of passionate volunteers (myself included!) to maintain the open habitats essential for rare species. These efforts mimic historical land management practices and large herbivore grazing, which help the heathlands to thrive."
        },
        {
            "text": "Picture this: a still, balmy summer evening as the sun sets, a group of volunteers gathers, filled with anticipation. They wonder if the long winter months of hard work—clearing scrub in the rain and cold—have paid off. As darkness falls, the excitement peaks, for it is time for a summer Nightjar Survey. The nightjar, a captivating bird species with a unique call, is a highlight of the heathlands. These migratory birds, arriving from sub-Saharan Africa in spring, require open, heathy areas to nest on the ground. Will the hard winter work creating this habitat have paid off?"
        },
        {
            "text": "Catch up on BBC Countryfile via this link to see our nightjars survey in action."
        },
        {
            "text": "https://www.bbc.co.uk/iplayer/episode/m0021sm3/countryfile-britains-rarest-creatures"
        },
        {
            "text": "On a broader level, the presence of the nightjar is a sign of successful habitat management. Historically, these birds were surrounded by myths, including the superstition that they used their wide mouths to suck milk from goats, earning them the nickname 'goatsuckers.' Their scientific name, Caprimulgus, reflects this old superstition (Capri – ‘goat’, mulgus - ‘to milk’)."
        },
        {
            "text": "Nightjars are indicators of the overall health of the ecosystem and our progress towards species abundance. They are one of many rare species and can help us understand the diversity and condition of their surroundings. For me, their arrival heralds the start of summer and the anticipation of the heathlands coming alive."
        },
        {
            "text": "Monitoring species like the nightjar offers a tangible way to measure the progress of the Heathland Connections Nature Recovery Project, and many such surveys are carried out by partners across the landscape to achieve an overall picture of the population trends."
        },
        {
            "text": "How to find out more about Heathlands Connections "
        },
        {
            "text": "To discover more about this project, follow the below link. If you want to get involved, we hope to create opportunities for volunteering, so check the link above for latest updates."
        },
        {
            "text": "Heathland Connections - Surrey Hills National Landscape"
        },
        {
            "text": " "
        }
    ]
}