{
    "url": "https://insideDIO.blog.gov.uk/2024/08/05/working-for-dio-in-germany/",
    "title": "Working for DIO in Germany",
    "authors": [
        "Gareth Wilmot"
    ],
    "categories": [
        "Estates",
        "Germany",
        "Recruitment",
        "Sennelager",
        "Working at DIO"
    ],
    "pub_date": "2024-08-05T12:51:44+00:00",
    "content": [
        {
            "text": "Hi, I'm Gareth Wilmot and I'm a Senior Estate Surveyor for DIO in Germany."
        },
        {
            "text": "This role is to provide estate surveying and estate management advice throughout Germany on behalf of the UK MOD. This includes land management for NATO Forward Holding Base Sennelager (NFS), which includes Ayrshire Barracks near Monchengladbach, all isolated detachment housing requirements for the UK military and their families assigned to the various NATO locations around Germany and oversight of adventurous training lodges in Bavaria and the Harz mountains; it's a role I have held since Nov 2021."
        },
        {
            "text": "I have a land agency background which is helpful as the work is split evenly between managing the UK’s military training areas and acquisition and management of residential and some commercial hirings throughout Germany. I have worked previously on MOD ranges in the UK and overseas in Cyprus, the latter managing a small team of locally employed civilians who deliver on a day-to-day basis; similar to the arrangement in Germany."
        },
        {
            "heading": 2,
            "text": "How does it work?"
        },
        {
            "text": "Land Management Services (LMS) have two offices in Germany one at Normandy Barracks Sennelager which supports the local training areas Senne, Staple, Goldgrund plus all isolated detached residential hirings covering an area from the Dutch/Belgium border in the west to Berlin and Leipzig in the east, and up to Flensburg on the Danish border in the north."
        },
        {
            "text": "The other LMS office is in Ramstein, southwest Germany, located within the US base and this primarily supports the UK National Support Element assigned to Ramstein and other NATO exchange posts throughout Bavaria including Wiesbaden, Stuttgart, Ulm, Ingolstadt, Munich, and Oberammergau. The Ramstein office also covers the Bavarian Alpine Training Lodges and their associated support staff who are located in Oberstdorf, Wertach, Sonthofen, and Bad Hindelang."
        },
        {
            "text": "I am located at Normandy Barracks Sennelager, alongside Commander NFS, Germany Enabling Office (GEO) and our DIO Overseas and Training (DIO OS/Trg) colleagues. Sennelager lies on the northwestern outskirts of Paderborn which is a typical German market town with all the facilities you could wish for shops, social, sport and leisure. Well known for its excellent Christmas markets!"
        },
        {
            "text": "Accommodation for married officers is located at Am Der Grimke, which is just outside the perimeter fence but with easy access to the office so no excuses not to cycle in to the office, and on the edge of the Senne training area which extends to 117 sq km of forest and open heathland which is usually accessible at weekends when the flags are down!"
        },
        {
            "text": "Normandy barracks has all the basic day to day facilities you need including medical, dental, gym, small shop, canteens etc. Immediately outside of the barracks the village of Schloss Neuhaus has more facilities. A train station just outside the entrance to the camp provides excellent access to Paderborn or Bielefeld mainline stations from which DB intercity trains access the whole of Europe."
        },
        {
            "heading": 2,
            "text": "What does your job involve?"
        },
        {
            "text": "Primarily my work involves supporting and directing the local Estate Surveyors and UKBC Land Agent on estate surveying issues and acting as the focal point with Cmdr. NFS, GEO Head of Mission, and Head of DIO OS/Trg. I also field issues that fall out from our European Support Group (ESG) accommodation colleagues who are based in Mons, Belgium who are tasked with providing accommodation to service personnel posted throughout Germany and wider Europe which we acquire and deal with all Ld/Tt communication."
        },
        {
            "text": "A key element of my role is to act as the interface between the UK and the German Federal authorities (BImA) with regard to all property related issues in Germany and to that end I work closely with the Germany Enabling Office host nation liaison officer."
        },
        {
            "text": "We're now looking for another Senior Estate Surveyor to join us in Germany. This is a fantastic opportunity to broaden your experience in the world of surveying overseas with a diverse portfolio, significant leadership responsibilities and a real chance to influence decisions with senior military and host nation representatives in the best interests of UK defence."
        }
    ]
}