{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/01/16/100-stemm-women-and-non-binary-people-in-antarctica/",
    "title": "100 STEMM women and non-binary people in Antarctica",
    "authors": [
        "Harriet Teare"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2024-01-16T11:43:44+00:00",
    "content": [
        {
            "heading": 4,
            "text": "In November 2023, I joined an expedition to Antarctica alongside a group of women and non-binary people from 28 countries around the world.  "
        },
        {
            "text": "What brought us together? We are all women or non-binary people with backgrounds in STEMM (science, technology, engineering, maths and medicine), committed to creating a more sustainable future. We have been selected to take part in a global leadership programme called Homeward Bound (HB), which aims to heighten the influence of women and non-binary people and their impact in making decisions that shape our planet. Globally, women are significantly underrepresented in leadership positions. Even though 60% of university graduates are women, only 10-20% make it into senior decision-making roles. The programme's vision is that by 2036, HB will have supported and engaged a globally diverse leadership network of 10,000 STEMM women and non-binary people who can lead for the greater good and impact decision-making for a sustainable future.  "
        },
        {
            "text": "Each year HB selects 100 candidates from around the world to take part in the 12-month programme, and each cohort consists of women and non-binary people from diverse backgrounds working in STEMM subjects within the academic, industrial, or governmental sectors. Alumni from HB include the Executive Secretary of the United Nations Framework Convention on Climate Change, Christiana Figueres (HB3), the Minister of Environment in Chile, Dr Maisa Rojas (HB5), and Scotland's Minister for Green Skills, Circular Economy and Biodiversity, Lorna Slater (HB3), showing the strength of HB’s network. "
        },
        {
            "text": "I applied for HB at the start of 2020, just as the pandemic was becoming a reality, and was selected to participate amid lockdown. My cohort, HB6, began our virtual programme in March 2021. Throughout the year, we met every fortnight to engage in a programme which spanned science, visibility, leadership, and strategy, working together to understand our own approaches to leading, and to share our experiences from across the world. These sessions have laid the foundation for our expedition, where we continued our personal development while experiencing first-hand the impact humankind is having on the environment.  "
        },
        {
            "text": "The programme has supported me in making several significant life decisions, including, most recently, choosing to leave academia to join the Medicines and Healthcare products Regulatory Agency (MHRA). It has provided opportunities to collaborate across the network to encourage involvement in STEMM – for example, working with young women in Haiti, who are being introduced to STEMM subjects through a beekeeping programme at their school. I organised a meeting via Zoom with several people from my HB cohort to discuss our experiences working in different sectors and answer the students’ questions on how to get started on their career paths of interest. I am delighted to have recently caught up with one of the students who has won a scholarship to study public health at the University of Ottawa.  "
        },
        {
            "text": "The voyage provides an awesome opportunity to meet face to face and get to know each other, with 100 participants, from PhD students to University Professors, documentarists to CEOs. Each day was split between expeditions off the ship, and further development and leadership training, including the much celebrated ‘symposium at sea’. We will identify shared interests and initiate future projects as we take our place in the network of 10,000.  "
        },
        {
            "text": "Harriet joined the rest of HB6 on an expedition to Antarctica at the end of 2023.  Check back with us to read her return blog in early 2024! "
        }
    ]
}