{
    "url": "https://designnotes.blog.gov.uk/2024/01/16/co-creating-the-most-complete-overview-of-international-design-in-government-work/",
    "title": "Co-creating the most complete overview of international design in government work",
    "authors": [
        "Kara Kane - Head of Profession for Design, GDS",
        "Martin Jordan – Head of Design and User Research, German government’s Digital Service",
        "Viktoria Westphalen – Junior Content Designer, HMCTS"
    ],
    "categories": [
        "Community",
        "International"
    ],
    "pub_date": "2024-01-16T09:00:32+00:00",
    "content": [
        {
            "text": "The International Design in Government community has been gathering for almost 7 years. This autumn, it found novel ways of convening globally – including in-person gatherings and the first-ever 24-hour remote conference. "
        },
        {
            "text": "Since our last update in August, the community has continued to grow through our events to over 4,000 members. We’ve welcomed hundreds of new colleagues, including from Central Asian and West African countries. This reflects our ambition of increasing global representation – and contributions beyond the Global North."
        },
        {
            "heading": 2,
            "text": "The first 24-hour remote international design in government conference"
        },
        {
            "text": "From 28 to 30 November 2023 we ran our first 24-hour remote conference. There were actually 24 sessions over 26 hours, so in the breaks participants could do speed networking. To co-create the most complete snapshot of public sector design in the world, we reached out to community members everywhere to express their interest in the format and submit topics they would like to contribute. We had over 550 registered attendees and 61 speakers representing 25 countries, nations and territories."
        },
        {
            "text": "We created this new, inclusive 24-hour format for the community to reach everyone wherever they are and co-create a global snapshot of government design work. Since starting the community and running the first events, we have gathered for multi-day conferences, shared our work in remote calls, and collected the viewpoints of people in all parts of the world. For this event, we wanted to bring these three aspects together in a single format.   "
        },
        {
            "text": "Over the day, we moved around the world – starting in Oceania, going through Asia to Africa and Europe and towards the Americas. The topics were broad – ranging from accessible services to co-created policies. We heard from vice ministers, chief design officers, accessibility specialists, content, service, UX designers, and user researchers. From city and state to federal and central government, we saw the broadest range of human-centred design practices: from visual to experience to service to policy design. In addition, several speakers emphasised the importance of building community and global collaboration; and dealing with disillusionment and celebrating small victories."
        },
        {
            "text": "The event was open and free to attend for any community member. Participants spent just under five hours on average and gave a 9.6 out of 10 score for the event. Each talk has been recorded – as we didn’t expect anyone to stay awake for 24-hours – and is available only to the community on our YouTube."
        },
        {
            "text": "It was a massive success and collective community effort to pull this event off—we are very proud of what we achieved and grateful to all of our speakers for volunteering their time! "
        },
        {
            "heading": 2,
            "text": "Other ways we convened in 2023"
        },
        {
            "text": "In our last post we mentioned various community members attended and met at the Creative Bureaucracy Festival in Berlin in Summer 2023, where we hosted an open panel discussion on the challenges of transforming public services."
        },
        {
            "text": "In September and October 2023, international colleagues came together again for service design conferences in Edinburgh and Berlin. Over the years, we had valuable exchanges with people at conferences in various countries. But often, those were unplanned and serendipitous. In October, complementing the Service Design Network (SDN) Global Conference in Berlin, we invited public servants in town for a community afternoon gathering ahead of the main event."
        },
        {
            "text": "Hosted at the German Federal Government’s Digital Service, we spent half a day sharing work, discussing current topics, and getting to know each other. Around 20 people from four nations and seven organisations took part in the event with talks, breakout discussions and exchanges. Germany’s Digital Service shared some of their work on designing principles for digital-ready legislation and co-designing with federal court staff. In multiple breakout rounds, we discussed voted-on topics like the role of ‘delight’ in using public services, skills designers need in emerging areas, or how to play back experience from service to policy. All slides from the afternoon are available on GitHub."
        },
        {
            "text": "Afterwards, attendees expressed gratitude for the intimate exchange of ideas and practices throughout the afternoon and evening. So, we want to explore how to hold similar events adjacent to big conferences in the future such as at the next SDN Global conference — see an update on this at the end of the post. "
        },
        {
            "heading": 2,
            "text": "Capturing shared global challenges and recipes in public service design"
        },
        {
            "text": "At both events, in Scotland and Germany, we gave a talk about the ‘long slog of public service design’. We addressed why designing public services can feel difficult, slow and frustrating. The talk was informed by research with 60 community members from eight countries and all levels of government – from central to local. "
        },
        {
            "text": "Linked to the questions from the Creative Bureaucracy panel discussion in the summer, we asked colleagues how they ensure others stay motivated, excited, empowered, and creative to work resiliently and sustainably towards more fundamental transformational change. We wanted to know what has been easy and what has been hard to change. Respondents took ample time to describe their work, setups and challenges. "
        },
        {
            "text": "In the talk, derived from the research findings, we talked about resilience on an individual level and organisational resilience at a system level. We then presented 5 recipes for people transforming end-to-end services. These respond to the notion that designing public services is not a sprint, but a baton relay ultramarathon. They recognise that services aren’t designed by one group of people, but by multiple generations of teams. "
        },
        {
            "text": "In the audience were public servants from abroad whom we had not met before and who had yet to hear of the community. Just weeks later, they had joined the community and were presenting their work at the 24-hour remote conference!"
        },
        {
            "text": "The talk was recorded and is available for rewatch."
        },
        {
            "heading": 2,
            "text": "What’s next for the community"
        },
        {
            "text": "In 2024, we will resume the regular community calls that took a break during this busy autumn. We want to discuss topics like building accessibility capability, co-designing with local communities, assuring service quality – and any other topic community members propose."
        },
        {
            "text": "Although we had some representation from African, Latin American, and South Asian countries, we plan to increase our efforts by offering time for colleagues from currently underrepresented regions. We made many new contacts through the conferences we attended that will help us find exciting content and case studies. "
        },
        {
            "text": "In autumn 2024, we will team up with the Finnish Government design community Julkis-muotoilijat for an International Design in Government community event. It will be adjacent to the Service Design Global Conference that will happen in Helsinki from 2 to 4 October. We will share more information about the event in the coming months."
        }
    ]
}