{
    "url": "https://moderncivilservice.blog.gov.uk/2024/01/16/harnessing-the-power-of-local-statistics-with-ons/",
    "title": "Harnessing the power of local statistics with ONS",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2024-01-16T11:47:39+00:00",
    "content": [
        {
            "text": "A guest blog from ONS."
        },
        {
            "text": "We all know that working out what's actually happening on the ground can be difficult. Linking national data to where people live and work is often a challenge for many civil servants, especially when you’re looking to use local data for better decision making in everyday work."
        },
        {
            "text": "Fortunately, a highly skilled and knowledgeable multidisciplinary team at the Office for National Statistics (ONS) have been innovating local statistics to make them more accessible and usable for everyone, from data analysts to members of the public and civil servants like you! "
        },
        {
            "text": "They have published the first geography-focused user journey on the ONS website, Find facts and figures about areas in the United Kingdom. ONS is also prototyping the Explore Subnational Statistics (ESS) Beta to help people find facts and figures about their local areas, all in line with the Government Statistics Service (GSS) subnational data strategy."
        },
        {
            "text": "These new digital products are designed to help users find, visualise, compare and download statistics for local areas, making it easier to make decisions at a local level. It complements a wider project where they are developing more insights at lower levels of geography such as towns, and at a building block level so that users can define the area of interest. They also continue to lead across government on UK wide coherence of data. "
        },
        {
            "heading": 2,
            "text": "Innovation in practice: a new approach to complex statistics"
        },
        {
            "text": "The UK statistics landscape is undeniably complex, with subnational data produced by various government departments as well as the Devolved Administrations. This can create a confusing landscape for decision makers needing evidence at the local level.  As a result, there was a clear need for an innovative solution that could work for a range of users of local statistics. "
        },
        {
            "text": "Bringing together statistics from different organisations and platforms is no easy task, so the analysts involved in the project have started building strong and effective relationships with the producers of these datasets to make this happen."
        },
        {
            "text": "To share knowledge across other areas of government, ONS is sharing prototypes and codes via the Explore subnational statistics GitHub and other repositories and forums. This reduces the risk of duplication and builds capability across the community, as in the case of the Oflog Local Authority Data Explorer, which follows a consistent approach to the ONS Subnational indicators explorer.   "
        },
        {
            "text": "As we know from our One Big Thing training, data and statistics are most valuable with insight. Therefore, ONS has not only developed the tools, but has established an analytical advisory service supporting local government across the English regions and the Devolved Administrations in accessing and making the best use of local data. It has dedicated analysts based across the UK, ensuring those locally have access to data, statistics, and analysis to support decision making. "
        },
        {
            "text": "Through engaging with local decision makers, ONS Local strives to build local analytical capabilities across the UK to drive evidence-based decision making.  A recent ONS blog explains how ONS Local operate on the ground; for instance, they helped to improve the evidence base for Yorkshire stakeholders to better understand local business size and employment trends through a new set of innovative statistics. This work provided local policymakers with enough evidence to make the case for investment in small businesses and drive local employment."
        },
        {
            "heading": 2,
            "text": "How can you get involved? "
        },
        {
            "text": "You can keep up to date about the new subnational data tools being developed by ONS signing up to the ONS Local newsletter (by contacting ons.local@ons.gov.uk).  ONS Local often presents webinars and workshops aimed at upskilling civil servants and local analysts on how to better use data, so make sure to sign up to the Eventbrite collection and keep an eye out for more training events in 2024. You can sign up to the next set of workshops which start on Thursday 18th January and have a focus on PowerBI."
        }
    ]
}