{
    "url": "https://dluhcdigital.blog.gov.uk/2024/01/16/join-us-at-our-digital-recruitment-days-in-the-north-east/",
    "title": "Join us at our Digital Recruitment Days in the North East",
    "authors": [
        "DLUHC Digital team"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-01-16T09:29:08+00:00",
    "content": [
        {
            "text": "Are you a product, delivery or user-centred design professional looking for an exciting and meaningful career opportunity? "
        },
        {
            "text": "On 6 and 7 February, the Department for Levelling Up, Housing and Communities (DLUHC) will host its Digital Recruitment Days in Darlington. Building on the success of our previous event, which took place in Wolverhampton in November, this will be our first event of this kind in the North East."
        },
        {
            "text": "At this event, we will be recruiting for roles at various levels within the product delivery and user-centred design specialisms. Find out more and sign up: "
        },
        {
            "heading": 2,
            "text": "Why attend?"
        },
        {
            "text": "Our Digital Recruitment Days provide a unique opportunity for you to meet, connect and engage in two-way conversations with our digital teams. You will meet professionals who work in your specialism, as well as our senior leadership team. "
        },
        {
            "text": "It's a chance for you to learn more about DLUHC Digital and how we work, ways to develop and grow your career with us, and the range of staff benefits we offer. "
        },
        {
            "text": "You will also get an opportunity to tell us about yourself, your skills, experience and aspirations. "
        },
        {
            "text": "The event will be informal and, for the right people, we’re looking to make job offers shortly after the event, which means it’s potentially a great way to fast-track your job search. "
        },
        {
            "heading": 2,
            "text": "Join our purpose-driven work"
        },
        {
            "text": "At DLUHC, we are dedicated to making a positive impact on communities and people across the UK. Our work focuses on solving problems, delivering innovative services and achieving ambitious outcomes. "
        },
        {
            "text": "We work in autonomous, multi-disciplinary teams in 20 locations across the UK, including Darlington and Leeds, and our people enjoy flexible and hybrid working, plus generous benefits and development routes for learning and progression. "
        },
        {
            "text": "Find out more about what it’s like to work in a digital, data or technology role at DLUHC."
        },
        {
            "heading": 2,
            "text": "What our people say"
        },
        {
            "heading": 2,
            "text": "Register to attend"
        },
        {
            "text": "If it sounds like something you’d like to be part of, meet us and let’s chat. "
        },
        {
            "text": "If you have any questions contact our recruitment team."
        }
    ]
}