{
    "url": "https://defrafarming.blog.gov.uk/2024/01/16/watch-future-proofing-our-farming-business-with-sfi/",
    "title": "Watch: future-proofing our farming business with SFI",
    "authors": [
        "Graham Higgins",
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-16T12:44:56+00:00",
    "content": [
        {
            "text": "Through the Sustainable Farming Incentive (SFI), you can get paid for actions that support your business, food production and the environment. "
        },
        {
            "text": "Mother and son team, Tracey and Will, run a dairy and beef farm in Langley Mill, Derbyshire. They entered their SFI 23 agreement in December 2023."
        },
        {
            "text": "In this video, they talk through the SFI actions they’ve included in their agreement, including herbal leys in rotational pasture, hedgerows, soils, legume mix with grasses, and pest management. They describe how SFI will help their farm business be more resilient."
        },
        {
            "text": "Thanks to Tracey and Will for sharing their experience."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "We recently published a post  which summarised the recent Agricultural Transition Plan update. The update includes the full range of new and updated actions as well as payment rates available in 2024. "
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the 23 actions offered in 2023. By waiting for the 2024 actions, you could be losing out on funding. If you apply now, you'll be able to add actions to your agreement annually —  or have multiple agreements —  if you'd like to carry out further actions. "
        },
        {
            "text": "SFI is not competitive. Anyone who applies and is eligible will get an agreement. You can enter as much land as you like: there is no minimum or maximum area. You can choose how many actions you do and, once you’re in SFI, you can add more land and actions to your agreement each year.  You will receive your first payment 4 months after your SFI agreement starts. After that you’ll be paid every 3 months, so you have a regular, reliable income."
        },
        {
            "text": "Our dedicated SFI site is a good place to start your journey."
        }
    ]
}