{
    "url": "https://prisonjobs.blog.gov.uk/2023/04/20/following-in-mums-footsteps-working-as-an-osg/",
    "title": "Following in mum's footsteps: working as an OSG",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "operational support grade",
        "Personal stories"
    ],
    "pub_date": "2023-04-20T14:47:30+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Working as an operational support grade (OSG) is varied and rewarding. It can open opportunities to develop and progress in the Prison Service. "
        },
        {
            "heading": 3,
            "text": "Amber-jay, who works at HMP The Mount, tells us about her experience. "
        },
        {
            "text": "Applying to work at a prison was a natural move for me. My mum has worked at HMP The Mount my whole life and has inspired me in my own career. She has always been my role model. My mum has also shown me that working at a prison is a great opportunity and not as daunting as it may sound! "
        },
        {
            "text": "Mum is an OSG, and that’s the role I did when I started at HMP The Mount five years ago. Also known as a prison support role, the job entailed:   "
        },
        {
            "text": "A meaningful job with development opportunities"
        },
        {
            "text": "It’s varied and meaningful work. "
        },
        {
            "text": "While you don’t need specialist skills to be an OSG, I learnt that you do need to be empathetic and understanding while having firm boundaries. It’s also important to have a good eye for detail, remain calm under pressure and be a good team player. "
        },
        {
            "text": "You receive training to carry out your tasks safely and have access to a range of training and development opportunities, including a paid for Level 2 Apprenticeship in Customer Service."
        },
        {
            "text": " While I enjoyed working as an OSG, I chose to progress. I'm now a manager in the Business Hub overseeing a team who help ensure the prison is running as effectively as possible. "
        },
        {
            "text": "I’m glad I followed my mum into the Prison Service. It’s a great place to work, with lots of opportunities for development and progression. If you’re thinking about applying, I’d encourage you to do so."
        }
    ]
}