{
    "url": "https://earlyyears.blog.gov.uk/2023/04/20/how-staff-to-child-ratios-work/",
    "title": "How staff-to-child ratios work",
    "authors": [
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Childminder registration",
        "Early years",
        "Nannies"
    ],
    "pub_date": "2023-04-20T09:00:09+01:00",
    "content": [
        {
            "text": "The Chancellor recently announced an optional change to childcare ratios from 1:4 to 1:5 for two-year-old children. This change will apply from September 2023."
        },
        {
            "text": "All other staff-to-child ratios remain the same."
        },
        {
            "text": "While the Department for Education sets the ratios, we want to make sure that the way that they work is well understood."
        },
        {
            "text": "We know that many providers find ratios complicated. The questions we get asked most frequently on our Childcare Registration Facebook page are about ratios."
        },
        {
            "text": "We want to help by setting out the answers to a few frequently asked questions:"
        },
        {
            "text": "Examples of when childminders can make exceptions are set out in the framework for the EYFS in paragraph 3.43. They include caring for siblings and caring for your own children. Even when exceptions are permitted, for childminders and assistants, the maximum is always 6 children per adult. Group providers can also make exceptions and this is set out in paragraph 3.31."
        },
        {
            "text": "While we hope these pointers are useful, it is your responsibility to read, understand and demonstrate your ability to meet the ongoing requirements for registration. Ratio requirements are flexible, but you should be able to explain your rationale for how you deploy staff or assistants."
        },
        {
            "text": "Our inspectors are not trying to catch you out. We just want to know that you are keeping children safe and providing high-quality early education and care. That is our priority."
        }
    ]
}