{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/04/20/join-the-data-and-technology-insight-team-at-the-cma/",
    "title": "Join the Data and Technology Insight team at the CMA",
    "authors": [
        "Franck Fourniol",
        "Sharon Park"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA"
    ],
    "pub_date": "2023-04-20T18:56:20+01:00",
    "content": [
        {
            "text": "The Data and Technology Insight team (DTI) provides technical advice and insight on investigations at the Competition and Markets Authority (CMA). We also do proactive work to understand the implications of technologies and trends for consumers and markets. Find out more about our work on algorithms, for example."
        },
        {
            "text": "DTI is in the Data, Technology and Analytics Unit (DaTA) which is also the home of the CMA’s Behavioural Hub, data scientists and data engineers."
        },
        {
            "text": "We work closely with other areas of the CMA, including the Digital Markets Unit (DMU), Consumer and Mergers."
        },
        {
            "heading": 2,
            "text": "Why does the CMA need a Data and Tech Insight team?"
        },
        {
            "text": "The CMA’s mission is to help people, businesses and the UK economy by promoting competitive markets and tackling unfair behaviour, and whilst we’re a relatively small team we use our knowledge of technology, such as web or app development, to help ensure the organisation delivers on this mission every single day."
        },
        {
            "text": "Understanding the impacts of data and technologies is our team’s purpose, and what that looks like can be very different each day - we might be sharing important insights to help with decision making (find out more in our insight paper on Web3), or organising a major event on a new technology (such as quantum computing)."
        },
        {
            "text": "We often also get stuck into the detail too - analysing firms APIs (such as those in the Google Privacy Sandbox case), or the technical specification of one of their systems and translate what it means to economists and lawyers on a case. Firms might be limiting access to certain data or services on grounds of security or privacy – but this can limit the ability of other firms to innovate and compete, so we need to be able to get to the bottom of such potential trade-offs."
        },
        {
            "text": "Using the CMA’s information gathering powers, we also get to understand how tech firms and their products and systems work, be it in writing or on calls with engineers who built the tech."
        },
        {
            "text": "We’re at the forefront of key decisions that affect everyone in the UK and the wider world, advising teams at the CMA on a range of vital investigations, including:"
        },
        {
            "text": "We collaborate with other regulators in the UK, in particular through the Digital Regulation Cooperation Forum, and globally (for example take a look at highlights the 2022 CMA DaTA conference)."
        },
        {
            "heading": 2,
            "text": "Why join DTI now?"
        },
        {
            "text": "Digital technology underpins virtually every aspect of the economy. We need to grow our skilled and diverse DTI team, to carry out the CMA’s ambitious programme of work in digital markets, and anticipating that the CMA will be granted powers for the new DMU."
        },
        {
            "text": "We know that technologists, or ‘people in tech’, can have atypical career paths."
        },
        {
            "text": "Many of us within the team come from a variety of different career backgrounds, from computer science to tech policy, but we all share an eagerness to learn about complex technical systems to make a difference."
        },
        {
            "text": "Your work in the DTI team will contribute to ensuring tech and digital markets work for everyone and benefit consumers across the UK and globally. You will also gain unique insights into how tech companies and their engineering teams operate."
        },
        {
            "text": "And the CMA is a great place to learn and develop, in a supportive and stimulating environment."
        },
        {
            "heading": 2,
            "text": "Current opportunities within the team"
        },
        {
            "text": "This Spring we’re expanding our team and currently recruiting for the following positions:"
        },
        {
            "text": "We’re also excited to announce that our DTI Internship Programme is now open for applications. Our programme is open to everybody, we are particularly encouraging applications from people from underrepresented groups."
        },
        {
            "heading": 2,
            "text": "Our internship programme"
        },
        {
            "text": "Our DTI Internship provides a unique opportunity to gain practical work experience under the support and guidance of experts in data and technology."
        },
        {
            "text": "Our programme, which can last anywhere from 3 to 6 months, provides the chance to contribute to some of the most high-profile cases and studies in tech regulation."
        },
        {
            "text": "In addition, you'll gain access to resources and networking opportunities designed to help you build your skills and prepare for a successful career."
        },
        {
            "text": "The CMA operates a hybrid working policy with offices in Belfast, Cardiff, Edinburgh, London, and Manchester. Most of the DTI team are based in London and therefore if you are based in one of our other offices, you will get the opportunity to visit the London team."
        },
        {
            "text": "If you have any questions regarding our internship programme, you can email us at DataTechInsights@cma.gov.uk."
        }
    ]
}