{
    "url": "https://naturalengland.blog.gov.uk/2023/04/20/nature-recovery-led-by-evidence-chief-scientist-report-2022/",
    "title": "Nature Recovery: led by evidence. Chief Scientist Report 2022",
    "authors": [
        "Tim Hill"
    ],
    "categories": [
        "Biodiversity",
        "Science and evidence",
        "Wildlife"
    ],
    "pub_date": "2023-04-20T16:00:46+01:00",
    "content": [
        {
            "text": "Dr Tim Hill, Chief Scientist at Natural England, tells us about the publication of Natural England’s fifth Chief Scientist Report."
        },
        {
            "text": "Never before has good quality science, evidence and analysis on environmental change been so important for nature, society and the economy. It informs every part of the nature recovery process – from where and how we undertake restoration, to evaluating and adapting our interventions to maximise success. It also underpins our response to climate change. Wider still, nature is entering the mainstream, with sectors such as business, banking and finance recognising the risks and dependencies they have from environmental change. The board rooms require data and analysis on nature in order to take well-informed decisions. Natural England is using the latest technology and techniques alongside tried and tested methodologies to develop and provide evidence for our staff, partners and decision makers from all walks of life to support successful nature recovery on the ground and in the board rooms."
        },
        {
            "text": "This Chief Scientist Report is the fifth in our series and demonstrates just some of the applied science and analysis we have been doing to support a nature positive world and get the transformative change for nature and people that we know needs to happen."
        },
        {
            "text": "To provide some examples, you will see we have applied social science techniques to better understand the complexity of managing human wildlife conflict. We’ve described how we’re using volunteer records to develop and map botanical hotspots. In urban areas we’ve combined citizen science approaches with innovative eDNA techniques in our GenePools project to understand the biodiversity value of urban ponds.\nFinally the report also includes a feature on the publication of a ground-breaking handbook on geoconservation written by Natural England geoscientists that is providing the evidence to inform and support good practice."
        },
        {
            "text": "I do hope you enjoy reading the report, which you can find here."
        }
    ]
}