{
    "url": "https://civilservice.blog.gov.uk/2023/04/20/things-we-dont-talk-about-enough-the-impact-of-eating-disorders-on-men/",
    "title": "Things we don’t talk about enough: the impact of eating disorders on men",
    "authors": [
        "Craig Myers"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-04-20T13:43:11+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The theme of the 2023 Eating Disorders Awareness Week was ‘men’ to underline the damaging impacts of eating disorders often endured by them. "
        },
        {
            "text": "Warning: This blog discusses eating disorders so it might be triggering for some people. If you need support, please make use of your department’s wellbeing resources or visit the UK’s leading eating disorders charity, Beat, to access their services."
        },
        {
            "text": "Contrary to the common belief that eating disorders only impact women, at least 25% of the estimated 1.25-3.4 million people in the UK with eating disorders are men. We don’t talk about this enough. "
        },
        {
            "text": "But it’s not just those with eating disorders that need and deserve support. There are 4-5 million people in the UK indirectly affected through supporting and caring responsibilities, and the impacts on those people are tough and enduring too. We don’t talk about this enough."
        },
        {
            "text": "Well, I want to get us talking by sharing my experience as a father to a child with anorexia. "
        },
        {
            "text": "We all have stories about the challenges of the COVID pandemic – from missing crucial months seeing loved ones to the stresses of juggling home schooling with work. Mine includes the trauma of my daughter, who had just started secondary school, suffering from anorexia. "
        },
        {
            "text": "It was surreal to watch my bubbly young girl who ate freely with enjoyment, become so anxious, withdrawn, and bullied by restrictive “food rules”. For weeks my wife and I kept checking ourselves as to whether this was happening; unsure if and how to open a discussion. "
        },
        {
            "heading": 4,
            "text": "Disordering behaviour"
        },
        {
            "text": "But we gradually came to realise that not only did she have an eating disorder, but it was disordering our behaviour too. For example, it was not normal to give a 12-year-old smaller food portions than her 9-year-old brother. But that’s how anorexia can work; it pervades and bullies indiscriminately."
        },
        {
            "text": "Eventually my wife and I plucked up the courage to share our concerns with our daughter. But before we opened the conversation, she, in her courage, spoke up first and asked for help. I felt such relief amidst the heartache; we could consider together what we would do next. "
        },
        {
            "heading": 4,
            "text": "Better health"
        },
        {
            "text": "We were fortunate to be referred to the Maudsley Hospital for family-based therapy. And so, the long journey back to better health began. For months afterwards we found ourselves meticulously planning the food and eating habits of a girl who months earlier had been helping us to cook. This was a necessary step to better health, while adding to the complexities of our lives. "
        },
        {
            "text": "But eating disorders are not straightforwardly about the food. Those with eating disorders – and their carers - face deep, complex challenges of mental ill health, skewed perfectionism, and misplaced drives for control. So, we spent time each week in family therapy sessions discussing emotions too. We reflected on family relationships, explored how we help her to build back her confidence and love for herself. All while juggling the different emotional and dietary needs of her brother and learning to trust ourselves again as parents."
        },
        {
            "heading": 4,
            "text": "Civil Service"
        },
        {
            "text": "So, what does this have to do with work and the Civil Service? First, while everyone’s experiences are different, I hope it gives an insight into what living with someone with an eating disorder can be like. And second, this is also a story about the gifts of leadership and teams. "
        },
        {
            "text": "I am fortunate in that I could not have been better supported by my manager, Sue. She made clear time and again that I should flex my work to ensure I take full part in the months of family therapy that we had. She would check in how I was, while sustaining the normality of delivering in my role. "
        },
        {
            "text": "I also took the decision to share the fact of my daughter’s eating disorder with my peers and team, not least to explain the regular and immovable personal appointments in my diary. The team were as supportive and kind as my Director, seeing in me the dad that I am as well as the Senior Civil Servant they knew. "
        },
        {
            "text": "Without the support of my boss and colleagues, my experience as a carer for someone with anorexia would have been much harder. So, I encourage all leaders and staff to consider how they can develop an awareness and culture that supports people who may be caring for someone - or suffering themselves - from an eating disorder. In doing so let’s remember that eating disorders do not respect genders: we are all in this together. "
        },
        {
            "text": "The Civil Service Eating Disorders Network is available to all Civil Servants impacted directly and indirectly by eating disorders, disordered eating, and negative body image. For more information, contact the network at edsg@beis.gov.uk."
        }
    ]
}