{
    "url": "https://food.blog.gov.uk/2024/09/23/explaining-national-level-regulation-proposals/",
    "title": "Explaining National Level Regulation proposals",
    "authors": [
        "Carmel Lynskey, Head of Achieving Business Compliance Programme"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2024-09-23T11:50:50+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The food system has undergone dramatic changes in recent years. New technology, changing consumer habits, and global events like the pandemic have all impacted the way the food industry does business. At the FSA we need to ensure the way we regulate keeps pace with this fast-changing world."
        },
        {
            "text": "One area we have been exploring is National Level Regulation (NLR). This could see a small number of large national food businesses - like supermarkets - being regulated at a national level, rather than on a premises-by-premises basis."
        },
        {
            "text": "At its September meeting the FSA Board agreed that NLR is a promising idea which should be explored further, taking a careful step-by-step approach and reflecting carefully at each stage on the next steps. There will also be extensive engagement and consultation with local authorities, primary authorities, businesses and consumers, as well as discussions with governments across England, Wales and Northern Ireland."
        },
        {
            "text": "Exploring this idea isn’t just about keeping pace with the food system. It offers clear benefits to consumers, helping to improve standards. Over the last year we’ve been trialling this with five national retailers. NLR gives us access to more data about food hygiene and safety and we’ve learnt that it can enable us to spot trends more quickly and take action. During the year long trial, the national regulator had access to data from over 10,000 audits, compared with the 1,500 local authority inspections carried out. "
        },
        {
            "text": "Through these pilots we’ve tested whether it’s possible for the FSA, working alongside the existing inspection regime to regulate some supermarkets. This has been done by scrutinising their overall controls and data, rather than just treating each store as a separate premises by local authorities."
        },
        {
            "text": "Of course, food safety will always be the number one priority. There will always need to be checks on businesses, large or small, to make sure their food is safe. But as our trial shows, there may be different ways of carrying out some checks which still keep standards high and consumers safe."
        },
        {
            "text": "We’re developing this approach gradually and expect ideas to evolve over time as we discuss with the FSA board, ministers and stakeholders. This is the start of a period of engagement to understand how we can use NLR to strengthen scrutiny and enhance protections for consumers."
        },
        {
            "text": "In the meantime, here are answers to some of the questions we’ve been asked about NLR."
        },
        {
            "heading": 2,
            "text": "Will National Level Regulation lead to a lowering of food standards and an increased risk to the public now?"
        },
        {
            "text": "No. Food standards will not change, or may improve, and local authorities will remain responsible for inspecting businesses and enforcement action. The law is very clear that all food businesses must be subject to independent regulation and controls. NLR aims to strengthen food regulation, helping us uphold high standards and improve protections for consumers in an evolving food system."
        },
        {
            "heading": 2,
            "text": "How will the public know which stores are safe if supermarkets no longer have food hygiene ratings (a score from 1 to 5) or physical inspections?"
        },
        {
            "text": "The Food Hygiene Rating Scheme plays a very important role in informing consumers, and we have not proposed any changes to the scheme. If we do, these will be subject to full public consultation."
        },
        {
            "heading": 2,
            "text": "When will National Level Regulation start?"
        },
        {
            "text": "We will continue to operate as we do now. Local authorities will remain responsible for inspecting businesses and enforcement action. Changing to NLR would require legislation and we are not ready for this yet, but we will continue to gather information and data on how a new system could work."
        },
        {
            "heading": 2,
            "text": "Will National Level Regulation be extended to other large food businesses (e.g. national food service chains)?"
        },
        {
            "text": "Extending NLR to other large food businesses is not part of our plans while we are developing the idea."
        },
        {
            "heading": 2,
            "text": "Will you consult local inspection and enforcement authorities to ensure National Level Regulation is safe and achievable?"
        },
        {
            "text": "NLR will be explored further with extensive engagement and consultation with local authorities, primary authorities, businesses and consumers, as well as discussions with governments across England, Wales and Northern Ireland."
        },
        {
            "heading": 1,
            "text": "Egluro cynigion Rheoleiddio ar Lefel Genedlaethol"
        },
        {
            "text": "Mae’r system fwyd wedi newid yn sylweddol yn ystod y blynyddoedd diwethaf. Mae technoleg newydd, arferion newidiol defnyddwyr, a digwyddiadau byd-eang fel y pandemig i gyd wedi effeithio ar y ffordd y mae’r diwydiant bwyd yn gweithredu. Yn yr Asiantaeth Safonau Bwyd (ASB), mae angen i ni sicrhau bod ein dull rheoleiddio yn cyd-fynd â’r byd hwn sy’n newid yn gyflym."
        },
        {
            "text": "Un maes yr ydym wedi bod yn ei archwilio yw Rheoleiddio ar Lefel Genedlaethol (NLR). Gallai hyn arwain at reoleiddio nifer bach o fusnesau bwyd cenedlaethol mawr – fel archfarchnadoedd – ar lefel genedlaethol, yn hytrach na fesul safle."
        },
        {
            "text": "Yn ei gyfarfod ym mis Medi, cytunodd Bwrdd yr ASB fod NLR yn syniad addawol y dylid ei archwilio ymhellach, gan fabwysiadu dull cam wrth gam a myfyrio’n ofalus ar bob cam. Bydd hefyd ymgysylltu ac ymgynghori helaeth ag awdurdodau lleol, awdurdodau sylfaenol, busnesau a defnyddwyr, yn ogystal â thrafodaethau â llywodraethau ledled Cymru, Lloegr a Gogledd Iwerddon."
        },
        {
            "text": "Mae archwilio’r syniad hwn yn ymwneud â mwy na dim ond sicrhau ein bod yn gweithredu’n gyfredol gyda’r system fwyd. Mae’n cynnig manteision amlwg i ddefnyddwyr, gan helpu i wella safonau. Dros y flwyddyn ddiwethaf, rydym wedi bod yn treialu hyn gyda phum manwerthwr cenedlaethol. Mae NLR yn darparu mwy o ddata am hylendid a diogelwch bwyd, ac rydym wedi dysgu y gall ein helpu i adnabod tueddiadau yn gyflymach a chymryd camau gweithredu yn eu cylch. Yn ystod y treial a oedd yn para blwyddyn, roedd gan y rheoleiddiwr cenedlaethol fynediad at ddata o dros 10,000 o archwiliadau, o gymharu â’r 1,500 o’r arolygiadau a gynhaliwyd gan awdurdodau lleol. "
        },
        {
            "text": "Drwy’r cynlluniau peilot hyn rydym wedi profi a fyddai’n bosib i’r ASB, gan weithio ochr yn ochr â’r drefn arolygu bresennol, reoleiddio rhai archfarchnadoedd. Gwnaed hyn drwy graffu ar reolaethau a data cyffredinol yr archfarchnadoedd, yn hytrach na bod awdurdodau lleol yn trin pob siop fel safle ar wahân."
        },
        {
            "text": "Wrth gwrs, diogelwch bwyd fydd y brif flaenoriaeth bob amser. Bydd angen cynnal gwiriadau bob amser ar fusnesau mawr a bach er mwyn sicrhau bod bwyd yn ddiogel. Ond, fel y dengys ein treial, efallai y bydd gwahanol ffyrdd o gynnal rhai gwiriadau sy’n parhau i sicrhau safonau uchel a chadw defnyddwyr yn ddiogel."
        },
        {
            "text": "Rydym yn datblygu’r dull hwn yn raddol ac yn disgwyl i syniadau esblygu dros amser wrth i ni drafod gyda Bwrdd yr ASB, gweinidogion a rhanddeiliaid. Dyma ddechrau cyfnod o ymgysylltu i ddeall sut y gallwn ddefnyddio NLR i gryfhau arferion craffu a diogelu defnyddwyr yn well."
        },
        {
            "text": "Yn y cyfamser, dyma ateb rhai o’r cwestiynau cyffredin am NLR:"
        },
        {
            "heading": 2,
            "text": "A fydd Rheoleiddio ar Lefel Genedlaethol yn arwain at ostyngiad mewn safonau bwyd, ac felly’n peri mwy o risg i’r cyhoedd o hyn ymlaen?"
        },
        {
            "text": "Na fydd. Ni fydd safonau bwyd yn newid, neu gallent wella, a bydd awdurdodau lleol yn parhau i fod yn gyfrifol am arolygu busnesau a chymryd camau gorfodi. Mae’r gyfraith yn glir iawn bod yn rhaid i bob busnes bwyd fod yn destun rheolaethau a gwaith rheoleiddio annibynnol. Nod NLR yw cryfhau dulliau rheoleiddio bwyd, gan ein helpu i gynnal safonau uchel a gwella amddiffyniadau i ddefnyddwyr mewn system fwyd sy’n esblygu."
        },
        {
            "heading": 2,
            "text": "Sut bydd y cyhoedd yn gwybod pa siopau sy’n ddiogel os nad oes gan archfarchnadoedd sgôr hylendid bwyd (sgôr o 1 i 5) neu os nad ydynt yn destun archwiliadau ffisegol mwyach?"
        },
        {
            "text": "Mae’r Cynllun Sgorio Hylendid Bwyd yn chwarae rhan bwysig iawn wrth ddarparu gwybodaeth i ddefnyddwyr, ac nid ydym wedi cynnig unrhyw newidiadau i’r cynllun. Os byddwn yn gwneud hynny, bydd y rhain yn destun ymgynghoriad cyhoeddus llawn."
        },
        {
            "heading": 2,
            "text": "Pryd fydd Rheoleiddio ar Lefel Genedlaethol yn dechrau?"
        },
        {
            "text": "Byddwn yn parhau i weithredu fel yr ydym yn ei wneud nawr. Bydd awdurdodau lleol yn parhau i fod yn gyfrifol am arolygu busnesau a chymryd camau gorfodi. Byddai newid i NLR yn gofyn am ddeddfwriaeth ac nid ydym yn barod ar gyfer hyn eto, ond byddwn yn parhau i gasglu gwybodaeth a data ar sut y gallai system newydd weithio."
        },
        {
            "heading": 2,
            "text": "A fydd Rheoleiddio ar Lefel Genedlaethol yn cynnwys busnesau bwyd mawr eraill (er enghraifft, cadwyni gwasanaeth bwyd cenedlaethol)? "
        },
        {
            "text": "Nid yw ymestyn NLR i fusnesau bwyd mawr eraill yn rhan o’n cynlluniau wrth i ni ddatblygu’r syniad."
        },
        {
            "heading": 2,
            "text": "A wnewch chi ymgynghori ag awdurdodau arolygu a gorfodi lleol i sicrhau bod Rheoleiddio ar Lefel Genedlaethol yn ddiogel ac yn gyraeddadwy?"
        },
        {
            "text": "Bydd NLR yn cael ei ymchwilio ymhellach, a bydd gwaith ymgysylltu ac ymgynghori helaeth ag awdurdodau lleol, awdurdodau sylfaenol, busnesau a defnyddwyr, yn ogystal â thrafodaethau â llywodraethau ledled Cymru, Lloegr a Gogledd Iwerddon."
        }
    ]
}