{
    "url": "https://charitycommission.blog.gov.uk/2024/09/23/how-to-protect-your-charity-as-the-sector-continues-to-face-financial-pressures/",
    "title": "How to protect your charity as the sector continues to face financial pressures",
    "authors": [
        "Mazeda Alam, Head of Guidance & Practice"
    ],
    "categories": [
        "Finance",
        "Guidance"
    ],
    "pub_date": "2024-09-23T08:35:32+01:00",
    "content": [
        {
            "text": "It is unfortunately common for charities to feel financial pressure at some point in their existence, and at the Commission we see the sector’s financial resilience and sustainability as a key current risk. During the recent cost of living crisis, many charities have faced a triple threat from increased running costs, greater demand for their services and reducing income. Our recent research highlights a fall in the number of people saying they have donated or raised funds for charity, alongside a steep increase in the number of people who have received help from a charity. Meanwhile our most recently published analysis of annual returns to the Commission shows smaller charities experiencing reductions in income and a rise in expenditure."
        },
        {
            "text": "Some charities have had no choice but to cut back on what they do. For example, Hospice UK has highlighted that one in five hospices in the UK have cut or closed their services in the last year or are planning to do so."
        },
        {
            "text": "When pressures become too great, charities can be forced to make the difficult decision to close entirely. There have been a number of examples of this reported recently, some of them high profile or longstanding organisations."
        },
        {
            "text": "We know that managing financial difficulties is not easy and can be stressful:   it is a situation that will mean making some sort of change at your charity and for some charities, it could also require you to take certain legal steps. You can make it less stressful by being prepared for such an eventuality. That is why we have refreshed our guidance about improving your charity's finances (also known as CC12). In it, we explain that it is vital that all trustees, regardless of whether they have financial expertise, have a clear picture of their charity's finances, so that they can act on any 'early warning indicators'. Spotting problems early gives trustees a better range of options, which can help them manage the impact on their charity’s beneficiaries and any employees and help them recover and avoid insolvency."
        },
        {
            "text": "If you read our recent blog about our new, improved, guidance on trustee decision making, you will know that we have a programme of improving our guidance. This focuses on how we write (using plain English) and how we structure the information to make the guidance accessible and easier to read. We are doing this so that we increase the number of trustees who use our guidance."
        },
        {
            "text": "Improvements we have made to CC12 include splitting the content into three separate pieces, making it easier for trustees to find the information that best relates to their situation. This also means it takes much less time to read the guidance."
        },
        {
            "text": "The first of these three pieces is about improving your charity’s finances, which is aimed at all charities, and which sets out actions trustees can take to minimise the chances of getting into difficulty, such as active monitoring and review of their charity’s financial position. By doing this, trustees can collectively take appropriate action to avoid financial difficulties or spot any difficulties early. Early identification of problems gives charities the best chance of recovery, by widening the range of options available to improve the situation and avoid short notice challenges or, ultimately, insolvency. The guidance lists some of these steps, such as launching a fundraising appeal or changing how your charity operates."
        },
        {
            "text": "Where these steps do not remedy the situation, or the charity is already at risk of insolvency, the remaining two pieces focus on insolvency and explain the steps trustees need to take, split according to their charity type - insolvency is complex, and there are specific legal requirements that apply depending on the type of organisation affected. CC12 also sets out the importance of getting relevant professional advice and there is a checklist to help trustees understand if their charity may be insolvent or may be at risk of insolvency."
        },
        {
            "text": "We urge all trustees, even if they are very experienced in acting as trustee, to read the guidance on improving your charity's finances. It is particularly important not to treat finances as a matter for the treasurer to deal with alone. We know there are no easy answers in these challenging times, but we hope this refreshed guidance supports trustee boards to have focussed conversations about options for improving your charity’s finances and to help you through financial difficulties should they arise."
        }
    ]
}