{
    "url": "https://mhclgdigital.blog.gov.uk/2024/09/23/my-experience-on-the-summer-internship-programme-in-mhclg/",
    "title": "My experience on the Summer Internship Programme in MHCLG ",
    "authors": [
        "Megan Edwards, Intern"
    ],
    "categories": [
        "Careers",
        "Ways of working"
    ],
    "pub_date": "2024-09-23T13:43:26+01:00",
    "content": [
        {
            "text": "A career in MHCLG Digital is open to everyone regardless of their background. The Civil Service Summer Internship Programme fosters an inclusive environment and welcomes individuals from all academic paths, giving them a chance to experience working in the Civil Service. In this post Megan, healthcare student and summer intern in MHCLG, shares her experience within the Local Digital team. "
        },
        {
            "text": "My name is Megan and I’m a student at the University of Central Lancashire (UCLan), based in Preston. I’ve just completed an internship in Local Digital, which is part of the Ministry of Housing, Communities and Local Government (MHCLG). I was working as a Communications and Engagement Officer in the Communications team. In this post, I’d like to share my experience of the Civil Service Summer Internship Programme in MHCLG – why I applied for it, what it involves and the opportunities it provides. "
        },
        {
            "heading": 2,
            "text": "A little bit about my background "
        },
        {
            "text": "I’m from a small village just outside of Stratford-Upon-Avon and grew up in a close-knit rural community. I spend a lot of time with my sister in between breaks from university and enjoy musical theatre and trips to London in my free time. I have a small group of friends based in Birmingham since we all departed to university and enjoy catching up with them outside of work.  "
        },
        {
            "text": "I’m a student on the Bachelor of Science with Honours in Sexual Health Studies. I chose to study this course because of its wide scope of learning and opportunities. My course covers a variety of topics such as contraceptive care, epidemiology of infection, cultural and social barriers to sexual healthcare and so much more.  "
        },
        {
            "text": "Living in Preston has allowed me to meet a vast array of people from different backgrounds, and it has improved my cultural competence as an individual.  "
        },
        {
            "text": "In my spare time at university I volunteer with Renaissance UK, a charity based in the North West, providing services for drug and alcohol users, and sexual health support. I particularity enjoy volunteering for HIV practitioner Jane with delivering an HIV support group to members of the community in Lancashire. "
        },
        {
            "heading": 2,
            "text": "Why I decided to apply for the Summer Internship Programme "
        },
        {
            "text": "I chose to apply for the Summer Internship Programme in MHCLG because I have an interest in developing public health policy within the Civil Service after university. This internship intrigued me to learn more about the Civil Service as an employer and organisation as well as the Civil Service Fast Stream.  "
        },
        {
            "heading": 2,
            "text": "What the Local Digital team is like "
        },
        {
            "text": "Upon joining the Local Digital Communications team in July, I was welcomed with open arms. The team were very friendly and were always available to answer any question I had. My line manager went above and beyond to support me during this process and was a real asset to my development on the internship. Local Digital is a really positive team, constantly championing colleagues and supporting the wider network.  "
        },
        {
            "text": "A key feature of the Communications team which I enjoyed is the sense of care and community, team members ensure that everyone feels supported and valued within the department. "
        },
        {
            "heading": 2,
            "text": "My day-to-day work in Local Digital "
        },
        {
            "text": "My day-to-day work on the internship included a lot of digital content creation and design, regular comms catch-up meetings to manage and track the workload of the team, as well as frequent support and learning sessions with my line manager.  "
        },
        {
            "text": "I supported on multiple communications projects and got to work with different people on their tasks. I was responsible for creating and developing content, such as Council Spotlight blog posts as well as internal tasks, such as developing strategic roadmaps and show-and-tell presentations. I’m particularity proud of the Spotlight blog posts as I independently created them along with the relevant social media promotion. "
        },
        {
            "text": "Take a look at this guest blog post I led the publication of with Dorset Council, which highlights their transformation journey over the past few years to become a digital council. "
        },
        {
            "text": "Being able to present my work and visualise my contribution to Local Digital was rewarding.  "
        },
        {
            "heading": 2,
            "text": "Why I would recommend the Summer Internship Programme "
        },
        {
            "text": "Reflecting on my time on the programme, I would 100% recommend it. As a healthcare student entering a digital space, I was initially apprehensive about my contribution. However, the team made me feel welcome and confident and I was able to utilise my community engagement skills to create relevant content for the team.  "
        },
        {
            "text": "I was also apprehensive about applying to the scheme at first, especially as a student from a non-Russel Group university and enrolled in a niche course. I was unsure whether my application would be considered. However, I came to learn that this process is about who you are as an individual and a learner, not about the labels you hold.  "
        },
        {
            "heading": 2,
            "text": "Thinking ahead "
        },
        {
            "text": "During the course of this internship, I improved my digital skills and learned how I can best work within the Civil Service, which I view as an excellent graduate employer.  "
        },
        {
            "text": "I hope to pursue a career in sexual health within the Civil Service and eagerly look forward to applying for both relevant job roles and graduate training schemes within the Civil Service. "
        },
        {
            "text": "Thank you, Megan, for your time at MHCLG and sharing your story with us.  "
        }
    ]
}