{
    "url": "https://food.blog.gov.uk/2024/09/23/stakeholder-update-fsa-board-asks-for-further-discussions-on-a-new-form-of-national-level-regulation-for-supermarkets-in-england/",
    "title": "Stakeholder update: FSA Board asks for further discussions on a new form of national level regulation for supermarkets in England ",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2024-09-23T14:03:43+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The FSA Board met on Wednesday 18 September 2024 to discuss a range of issues including FSA science, animal welfare, allergen labelling, and proposals for a phased approach towards a new form of food hygiene regulation for large, national businesses."
        },
        {
            "text": "Our discussion of National Level Regulation (NLR) was informed by a wide range of comments and questions received in advance. We're grateful to all the individuals and organisations who took the time to submit questions, which helped to shape our thinking and the Board discussion."
        },
        {
            "text": "The proposals for NLR could see a small number of large national food businesses - like supermarkets - being regulated at a national level, rather than on a premises-by-premises basis. We agreed that it is a promising idea that may enable us to strengthen food regulation and prioritise improvements in food safety for consumers. You can read more about national level regulation here."
        },
        {
            "text": "This is the start of a conversation. We’ve asked officials to engage with governments, local authorities, businesses and other stakeholders and to report back to us in December with a comprehensive plan for what the next steps might be."
        },
        {
            "text": "In other parts of our agenda, the Board discussed local authority resource pressures. Although there’s been progress in clearing the backlog of inspections since the pandemic, data presented to the board showed that 41,000 new food businesses have not received an inspection. To ensure food businesses are inspected routinely, the Board agreed to explore further with local authorities the possibility of charging food businesses for registration."
        },
        {
            "text": "We also discussed a new voluntary international standard on applying precautionary allergen labels that’s being developed within Codex and proposals for a globally agreed threshold for allergen contamination to inform the labelling decisions."
        },
        {
            "text": "Finally, we had the news that two of our Board Members, Justin Varney and Hayley Campbell-Gibbons are stepping down to take up exciting new opportunities. We are grateful to them for the contributions they’ve made to the FSA over the last two years and will be looking for new Board Members shortly to take up these positions."
        },
        {
            "text": "Our Board meetings are an important part of the FSA’s commitment to openness and transparency. You can catch up on the discussions from last week’s meeting in the recording on the FSA website."
        },
        {
            "text": "We value the opportunity these meetings present to discuss our work so please continue to send questions to us that directly relate to the Board papers. We are happy to receive more general correspondence on our work at any time. Our next Board meeting will be on 11 December in London, and you can register to attend ahead of the meeting."
        },
        {
            "heading": 1,
            "text": "Bwrdd yr ASB yn gofyn am drafodaethau pellach ar ddullau rheoleiddio newydd ar gyfer archfarchnadoedd, a materion eraill"
        },
        {
            "text": "Cyfarfu Bwrdd yr Asiantaeth Safonau Bwyd (ASB) ddydd Mercher i drafod amrywiaeth o faterion, gan gynnwys gwyddoniaeth yr ASB, lles anifeiliaid, labelu alergenau, a chynigion ar gyfer dull graddol o ymdrin â ffurf newydd ar reoleiddio hylendid bwyd ar gyfer busnesau mawr, cenedlaethol."
        },
        {
            "text": "Cafodd ein trafodaeth am Reoleiddio ar Lefel Genedlaethol (NLR) ei llywio gan amrediad eang o sylwadau a chwestiynau a gawsom ymlaen llaw. Rydym yn ddiolchgar i’r holl unigolion a sefydliadau a roddodd o’u hamser i gyflwyno cwestiynau. Gwnaeth y rhain helpu i lywio ein meddyliau a thrafodaeth y Bwrdd."
        },
        {
            "text": "Gallai’r cynigion ar gyfer NLR arwain at reoleiddio nifer bach o fusnesau bwyd cenedlaethol mawr – fel archfarchnadoedd – ar lefel genedlaethol, yn hytrach na fesul safle. Gwnaethom gytuno bod hyn yn syniad addawol a allai ein galluogi i gryfhau dulliau rheoleiddio bwyd a blaenoriaethu gwelliannau mewn diogelwch bwyd i ddefnyddwyr. Gallwch ddarllen mwy am reoleiddio ar lefel genedlaethol yma."
        },
        {
            "text": "Dechrau’r drafodaeth yn unig yw hwn. Rydym wedi gofyn i swyddogion ymgysylltu â llywodraethau, awdurdodau lleol, busnesau a rhanddeiliaid eraill ac adrodd yn ôl i ni ym mis Rhagfyr gyda chynllun cynhwysfawr ar gyfer y camau nesaf."
        },
        {
            "text": "Wrth fynd drwy rannau eraill o’n hagenda, trafododd y Bwrdd y pwysau ar adnoddau awdurdodau lleol. Er bod cynnydd wedi bod o ran clirio’r ôl-groniad o arolygiadau ers y pandemig, roedd data a gyflwynwyd i’r Bwrdd yn dangos nad yw 41,000 o fusnesau bwyd newydd wedi cael arolygiad. Er mwyn sicrhau bod busnesau bwyd yn cael eu harolygu’n rheolaidd, cytunodd y Bwrdd i ymchwilio ymhellach, ar y cyd ag awdurdodau lleol, i’r posibilrwydd o godi tâl ar fusnesau bwyd am gofrestru."
        },
        {
            "text": "Buom hefyd yn trafod safon ryngwladol wirfoddol newydd ar labeli alergenau rhagofalus sydd wrthi’n cael ei datblygu o fewn Codex a’r cynigion ar gyfer trothwy y cytunir arno’n fyd-eang ar gyfer halogiad alergenau er mwyn llywio’r penderfyniadau o ran labelu."
        },
        {
            "text": "Yn olaf, cawsom wybod bod dau o aelodau ein Bwrdd, Justin Varney a Hayley Campbell-Gibbons, yn camu i lawr i fanteisio ar gyfleoedd newydd cyffrous. Rydym yn ddiolchgar iddynt am y cyfraniadau y maent wedi’u gwneud i’r ASB dros y ddwy flynedd ddiwethaf a byddwn yn chwilio am Aelodau Bwrdd newydd yn fuan i ymgymryd â’r swyddi hyn."
        },
        {
            "text": "Mae ein cyfarfodydd Bwrdd yn rhan bwysig o ymrwymiad yr ASB i fod yn agored ac yn dryloyw. Gallwch wylio recordiad o gyfarfod yr wythnos hon ar wefan yr ASB i gael gwybod beth a drafodwyd [Link]. Rydym yn gwerthfawrogi’r cyfle y mae’r cyfarfodydd hyn yn ei gynnig i drafod ein gwaith, felly gofynnwn yn garedig i chi barhau i anfon cwestiynau atom sy’n ymwneud yn uniongyrchol â phapurau’r Bwrdd. Rydym yn hapus i dderbyn gohebiaeth fwy cyffredinol ar ein gwaith unrhyw bryd. Bydd ein cyfarfod Bwrdd nesaf ar 11 Rhagfyr yn Llundain, a gallwch gofrestru i ddod i’r cyfarfod yma."
        }
    ]
}