{
    "url": "https://gott.blog.gov.uk/2024/09/23/three-things-i-learnt-on-my-technology-transfer-placement-with-gott/",
    "title": "Three things I learnt on my Technology Transfer placement with GOTT",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-09-23T08:00:00+01:00",
    "content": [
        {
            "text": "by Dr Sarwat Howe"
        },
        {
            "heading": 2,
            "text": "Why I applied for a secondment in government"
        },
        {
            "text": "I’m currently working as an Intellectual Property and Commercialisation manager at the University of Salford, where I help academics turn their discoveries into much-needed products and services to boost the impact of their research. Having worked in university technology transfer for the past 5 years, I’ve always been curious how a role like mine would work in government, so when the opportunity for a secondment with GOTT in the Department of Science, Innovation and Technology, came up I was keen to apply."
        },
        {
            "text": "As my secondment comes to an end, here are my reflections on some of my key learnings over the past few months."
        },
        {
            "heading": 2,
            "text": "Technology Transfer isn’t all about big breakthroughs"
        },
        {
            "text": "Before joining GOTT I hadn't considered the differences in the missions of universities and government, reflected in the Knowledge Assets they generate and how they do technology transfer. Within universities the primary objective is to push the boundaries of our knowledge for lasting social and economic benefit, by carrying out cutting-edge research and delivering top quality teaching. Whereas in government it is to support citizens by providing public services that can improve the way we live and grow our economy."
        },
        {
            "text": "Whilst on my secondment I couldn't help but notice the abundance of Knowledge Assets owned by government that aren't necessarily seen by the public, but that play a crucial role in ensuring that public services can be delivered effectively. For example, the Government Internal Audit Agency (GIAA), who are responsible for producing around 1500 audits each year, have created a generative AI tool that can save between one to two days’ worth of work per audit. This tool is just one of a suite owned by GIAA that represents massive potential time and money-saving benefits for government."
        },
        {
            "text": "These innovations, as is true of many others in government, are based on incremental changes that can transform the way we live for the better."
        },
        {
            "heading": 2,
            "text": "Culture change takes time"
        },
        {
            "text": "One thing I really enjoyed during my time at GOTT was working in a new area for government and seeing firsthand how Knowledge Assets generated by the public sector have the potential to be translated into new goods and services for the benefit of the economy and society."
        },
        {
            "text": "Coming from a university background, where many institutions have been doing technology transfer for decades (and have continued to adapt and refine their strategies), I found it eye-opening and energizing to experience an environment where technology transfer is still a relatively new practice. It is going to take time not only to understand how to do technology transfer in government, but also for the value and benefits from this important activity to become apparent."
        },
        {
            "text": "I look forward to seeing this area of work grow in government, and in particular how GOTT is going to create change in the public sector when it comes to exploiting Knowledge Assets."
        },
        {
            "heading": 2,
            "text": "Technology Transfer is a contact sport"
        },
        {
            "text": "I have repeatedly heard this phrase throughout my career, as in my experience the success of technology transfer projects is down to having the right team of people behind them. I quickly realised this was true during my time at GOTT too."
        },
        {
            "text": "There are so many people involved in getting a product to market – not just the innovators behind the idea, but also the people behind the scenes who put enabling systems in place to break down barriers to commercialisation. In GOTT there is the capability enhancement team, that delivers training and upskills the public sector in KA management, the funding team, that identifies and support projects along the innovation lifecycle, the Technology Transfer team, that provides practical, hands-on advice to organisations on the best way to commercialise their KAs, as well as many other teams pushing GOTT’s work forward."
        },
        {
            "text": "It was so inspiring to work with people who care so much about what they do, and heartening to see it takes just as much collaboration and joined up effort for technology transfer to happen in government as it does in universities."
        },
        {
            "heading": 2,
            "text": "What’s next for me"
        },
        {
            "text": "We have a really strong community of researchers at the University of Salford who are working hard to solve problems in the world around us. I’m excited to take my learnings back to my role at the University and work with them to help amplify the impact of their research across a diverse range of projects."
        },
        {
            "text": "Having previously worked in a well-established technology cluster based in the southeast, I have seen how a closely-knit ecosystem can benefit the local economy - and I can see the potential for something similar in Salford. Making local connections, where you can call upon your network for support, is incredibly important for this line of work."
        },
        {
            "text": "I look forward to  seeing how my relationship grows with GOTT, and how we can contribute to the local innovation ecosystem as a University."
        },
        {
            "text": "I would encourage anyone to apply for a secondment in the civil service if they get the opportunity. It’s a great way to bring your skills and experience into government and a brilliant opportunity to learn something new that you can apply to your day job."
        }
    ]
}