{
    "url": "https://dluhcdigital.blog.gov.uk/2024/04/04/a-foot-in-the-digital-front-door-expanding-digital-thinking-in-policy-making/",
    "title": "A foot in the Digital Front Door: expanding digital thinking in policy-making",
    "authors": [
        "Greg Winfield, Head of User-Centred Policy Design"
    ],
    "categories": [
        "Policy design"
    ],
    "pub_date": "2024-04-04T10:03:51+01:00",
    "content": [
        {
            "text": "In this post, Greg Winfield, Head of User-Centred Policy Design at DLUHC, talks about how adding user-centred design support at the spend control gateway spreads digital thinking across policy-making. "
        },
        {
            "heading": 2,
            "text": "Hooks, levers and the D word  "
        },
        {
            "text": "Within DLUHC Digital our strategy is focused on further embedding digital thinking into the wider policy work of the department. Our Digital Front Door team (DFD) is a key part of this ambition, accelerating the spread of digital thinking through active, appreciative and supportive engagement with policy teams who are new to the digital world. "
        },
        {
            "heading": 3,
            "text": "What I mean by ‘digital’ "
        },
        {
            "text": "Before I go on, it’s important to note I’m talking about digital in its broader sense here – not just the practical delivery of digital products but going about work in a way that is nimble, iterative and user-centred, making it applicable to the policy space whether or not that policy may have an obvious digital delivery method. "
        },
        {
            "heading": 3,
            "text": "The DFD team "
        },
        {
            "text": "At its core, DFD is a team you must talk to if you’re planning some digital spend. It’s a key sign-off point. This creates a helpful hook. It means that a conversation begins between digital and policy colleagues that may never have happened otherwise. The spend control lever means that there is also a means of controlling how the delivery of the digital work progresses. There are gateways where assurance can take place (including assessments against the Service Standard) so we can steer anything that might be going off track. So far so procedural.  "
        },
        {
            "text": "It would be possible to leave it there and for helpful stuff to happen. However, assurance can be a conversation, and the DFD team is set up to do so much more with that opportunity to talk. We fully unpack pieces of work that come our way, taking them back to the key aspects of problem, intent and user need. Stepping outside our purely digital box, this highlights a relevance of digital thinking in wider policy work. But doing this right requires something a bit special. "
        },
        {
            "heading": 2,
            "text": "People, pillars, and policy "
        },
        {
            "text": "DFD is not a transactional conveyor for digital projects. It’s a foot in the door that creates a wide-ranging conversation on the benefits of digital thinking and supports teams on taking that forward in their wider work. To do this well requires – amongst other things – legitimacy and people skills. Luckily, the team is hugely diverse in its experience – full of skills in product management, content design, service assessments, delivery management, user research, service design and more. It’s also a group who embrace (and dare I say it, enjoy) the opportunity to talk digital with anyone who’ll listen (and even those that will not). There are some key pillars of how the team think and work that make these interactions hugely valuable in the wider mission of spreading digital thinking: "
        },
        {
            "heading": 3,
            "text": "We are realistic "
        },
        {
            "text": "Having worked in or with policy teams, we understand the pressures they face and we consider each project independently in terms of what is possible. As we push towards change, we strike the balance between pragmatism and idealism, appreciating that learning new ways of working is not an overnight change. "
        },
        {
            "heading": 3,
            "text": "We support and guide  "
        },
        {
            "text": "We help navigate. We hand-hold if needed. We support not just those who are engaging directly with us but their seniors and stakeholders too. We translate and mediate, particularly with external digital experts who come in to deliver with the policy team. We are there for informal chats when stuff does not make sense. We contribute to business cases and we help recruit digital people as things progress. We create trust. "
        },
        {
            "heading": 3,
            "text": "We network  "
        },
        {
            "text": "We sit at a sweet spot that allows us not just to promote the reuse of practical assets but share learning and create support relationships too. We know what’s going on across the department, so we put colleagues in touch with others who have experienced similar digital journeys so that a peer network is created for both the shorter and longer term.  "
        },
        {
            "heading": 3,
            "text": "We collaborate  "
        },
        {
            "text": "We leverage the diversity and experience of the DFD team itself by coming together frequently to share what we are working on and consider different ways to approach problems. We support each other when the work gets difficult.  "
        },
        {
            "heading": 3,
            "text": "We empower  "
        },
        {
            "text": "We do not lead the projects that come to us. We prompt, steer and assure to build skills and confidence in the policy team so they can take a digital approach forward in future work. We can step in if needed, but the approach of the previous 4 points means we will be required to do this less and less as digital awareness grows. "
        },
        {
            "heading": 2,
            "text": "Going beyond digital "
        },
        {
            "text": "DFD has grown significantly in the last year, but it will never be large enough to be hands-on in every project. This is ok, as we do not want to be. We are working towards a model where digital ‘franchises’ emerge within various parts of the department, embedding the skills and ethos that we are trying to drive forward. Our role is to develop at the earlier stages and create this pipeline of new skills and enthusiasm, meaning more franchises pop up and the momentum increases.  "
        },
        {
            "text": "At the same time, the multiplier effect of more policy colleagues telling their other policy colleagues about their good experience amplifies the message and its reach, furthering the strategic goal.  "
        },
        {
            "text": "There is still more to do to embed digital thinking earlier in the policy making process, and we are working on innovative ways to do that. Breaking the perception of digital as a tool to deliver policy and instead embedding digital as a tool to create more effective policy is a key challenge that will take time.  However, with the core team of skilled and passionate advocates in DFD we have strong foundations that our pillars can build upon. "
        }
    ]
}