{
    "url": "https://naturalengland.blog.gov.uk/2024/04/04/biodiversity-net-gain-insights-on-planning-bng-for-small-sites/",
    "title": "Biodiversity Net Gain: guest insights on planning BNG for small sites",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips"
    ],
    "pub_date": "2024-04-04T09:01:13+01:00",
    "content": [
        {
            "text": "Welcome to our Biodiversity Net Gain (BNG) guest blog, featuring industry experts sharing their top tips. They are:"
        },
        {
            "heading": 4,
            "text": "Julia Baker – Mott MacDonald"
        },
        {
            "text": "Everything counts when it comes to nature. Through mandatory BNG, small developments certainly have an important role in supporting nature’s recovery and enhancement."
        },
        {
            "text": "Some might think space is too limited to create habitats, and space for habitats to establish and thrive is critical. But there are a surprising number of ways to generate BNG within small developments. What’s great is that with mandatory BNG, we’re exploring all possible options to enhance and create wildlife habitats within small developments."
        },
        {
            "text": "Tip 1: Collaborate on BNG as early as possible"
        },
        {
            "text": "There are great landscape designs for small urban developments that create green spaces for people and habitats for wildlife. Even if wildlife habitats cover small areas, they can create stepping-stones throughout a locality as well as refugia for wildlife. This needs an integrated approach to BNG and landscape designs, and the best, most efficient way is for ecologists and landscape architects to collaborate from the start."
        },
        {
            "text": "Tip 2: Keep track of the developments in green infrastructure"
        },
        {
            "text": "Green infrastructure (GI) is an exciting, fast-moving space with new and improved products and technologies coming to market. Do keep track. There is an increasing range of green walls, urban planters such as for lamp posts and bike racks and other GI features that can fit a variety of developments. All add-up to create more green space."
        },
        {
            "text": "Tip 3: Think Sustainable Drainage System!"
        },
        {
            "text": "There are really good guidelines on designing biodiverse Sustainable Drainage Systems (SuDs). There are many case studies demonstrating biodiverse SuDs within a variety of small-scale development settings. This makes for a great link between BNG and SuDs, and it’s key to consider this join-up from the start."
        },
        {
            "heading": 4,
            "text": "Isabelle Carter - Stride Treglown"
        },
        {
            "text": "We often work on small or constrained sites in both urban and rural contexts. They can add real value for BNG if you consider the site holistically, looking beyond the boundaries for local and regional GI networks to tap into."
        },
        {
            "text": "Tip 1: Start with biodiversity"
        },
        {
            "text": "By looking at the biodiversity at the design stage, you can make the most of existing natural habitats and features present such as trees, hedgerows or grasslands."
        },
        {
            "text": "Understanding the baseline and site conditions early on, allows you to tailor your proposals to make the most of the opportunities in aspect and microclimate."
        },
        {
            "text": "Do not forget to use water as this can really add habitat value in the form of swales, ponds and raingardens. Drainage can create vibrant features in small areas."
        },
        {
            "text": "Tip 2: Maximise planting mixes"
        },
        {
            "text": "Make planting mixes work hard in small areas to extend pollinator seasons, tolerate drought and flood conditions. This could be achieved by:"
        },
        {
            "text": "Be led by nature rather than trying to control it. To quote Professor Dave Goulson ‘tidiness is the enemy of biodiversity’."
        },
        {
            "text": "Tip 3: Use buildings and structures"
        },
        {
            "text": "Biodiversity is not just to do with landscape areas. Use vertical and horizontal building areas as well, such as for green roofs and walls. This will make a significant contribution to BNG on a small site. Look at our Biodiversity Design Guide for further ideas. It outlines a concise, but robust set of concepts to embed biodiversity in the design process."
        },
        {
            "heading": 4,
            "text": "Emma Toovey - Environment Bank"
        },
        {
            "text": "Small development sites often face challenges with on-site BNG delivery simply because of space constraints. This could lead you to explore off-site solutions such as independent landowners, brokerage models and joint venture operators. This is where it can get tricky."
        },
        {
            "text": "Small development sites often have small unit requirements. Most of off-site options rely on larger buyers to get the project off the ground. This can be a transaction size that is beyond most small development sites. This is where a habitat bank could become your new best friend."
        },
        {
            "text": "Tip 1: Habitat Banks: small site solutions"
        },
        {
            "text": "Habitat banks are forward funded projects that do not rely on the sale of any units to kick start the project."
        },
        {
            "text": "Habitat creation works can start straight away, with the units ‘banked’ for future sale to multiple developers. Habitat bank providers can service very small transaction sizes. They can provide teeny fractions of a unit and can offer units ‘off the shelf’. This could avoid lengthy negotiations, hefty legal costs or potential programme delays."
        },
        {
            "text": "Some providers may have a minimum unit transaction size or administrative fee, this will typically be small and offer a much more viable solution for smaller developments."
        },
        {
            "text": "Tip 2: Love thy neighbour"
        },
        {
            "text": "The BNG off-site market is hotting up, but many Local Planning Authorities (LPAs) and National Character Areas still lack accessible off-site solutions. Especially in urbanised LPAs where land is scarce."
        },
        {
            "text": "All is not lost! The Statutory Biodiversity Metric allows for the delivery of BNG across boundaries. This means you can use habitat banks nationwide, even for small requests."
        },
        {
            "text": "A consequence of this is that multipliers in the metric result in an increase in land requirements. This is at a rate of either:"
        },
        {
            "text": "Leveraging habitat banks nationally can help small development sites to mitigate BNG challenges, albeit potentially at a higher cost. I recommend incorporating this cost into your project right from the outset."
        },
        {
            "text": "Tip 3: Strength in numbers"
        },
        {
            "text": "Collaborating with local developer groups strengthens negotiation. The buying power of a developer cluster should not be underestimated! Engage with a trusted habitat bank operator and secure ‘off the shelf’ Biodiversity Units where and when you want them. Early engagement with operators will give you the greatest chance of success."
        },
        {
            "text": "Let’s continue to maximise the opportunities arising from BNG, to support nature’s recovery and create healthy and sustainable places where people will want to live. Find out more about Biodiversity net gain."
        },
        {
            "text": "Find out more about Biodiversity Net Gain."
        }
    ]
}