{
    "url": "https://medregs.blog.gov.uk/2024/04/04/dsur-submissions-and-fees-are-changing-from-1-june-2024/",
    "title": "DSUR Submissions and Fees are Changing from 1 June 2024",
    "authors": [
        "Mandy Budwal-Jagait",
        "Louisa Obillo"
    ],
    "categories": [
        "Clinical Trials"
    ],
    "pub_date": "2024-04-04T11:54:40+01:00",
    "content": [
        {
            "text": "The process for submitting Annual Safety Reports (ASRs) for Clinical Trials of Investigational Medicinal Products (CTIMP) to the MHRA is changing. From 01 June 2024, ASRs such as the Development Safety Update Report (DSUR) will not be considered valid unless you provide proof of payment of the DSUR Review Fee with your submission. To avoid late submissions and non-compliance with the requirements of Regulation 35 of SI 2004/1031 (as amended), please ensure you consider the guidance below and on our webpages."
        },
        {
            "heading": 2,
            "text": "What’s changing?"
        },
        {
            "text": "From 01 June 2024, the payment associated with submission of annual safety reports to the MHRA will only be accepted via our online portal MHRA Pay."
        },
        {
            "text": "A receipt generated via MHRA Pay will be sent by email upon completion of payment and must be included in the submission of the annual safety report as proof of payment."
        },
        {
            "heading": 2,
            "text": "Failure to provide evidence of payment will result in the submission being made invalid. "
        },
        {
            "text": "The cover letter accompanying the submission must include:"
        },
        {
            "heading": 2,
            "text": "When does this apply?"
        },
        {
            "text": "This applies from 1 June 2024."
        },
        {
            "heading": 2,
            "text": "What can I do now to prepare? "
        },
        {
            "text": "Ensure those submitting Annual Safety Reports/ DSURs to the MHRA are aware of this requirement ahead of 01 June 2024, and review your organisation’s processes for regulatory submissions to ensure this change has been incorporated. A review of your current clinical trial portfolio and DSUR submission due dates may be useful to identify which DSUR submissions will be affected by this change and require additional oversight to ensure their submission to the MHRA is valid."
        },
        {
            "heading": 2,
            "text": "For our Type A trial, we submit the Annual Progress Report (APR) instead of the DSUR to the MHRA. Does this change still affect me? "
        },
        {
            "text": "Yes. The submission of the APR which is usually sent to the REC, has been accepted for certain lower risk (Type A) trials, as the annual safety report by the MHRA. Therefore, if submitting an APR to the MHRA instead of the DSUR, evidence of payment via MHRA Pay will need to be included with the submission for it to be considered valid."
        },
        {
            "heading": 2,
            "text": "Will late submissions result in findings on inspection?"
        },
        {
            "text": "Sponsors have a legal requirement to comply with Regulation 35 of UK SI 2004/1031 (as amended). Inspectors take a pragmatic approach when reviewing change controls within an organisation and including whether they were implemented in a timely and effective manner. Every effort should be taken to manage this change and ensure annual safety report submission timelines are met. Should any issues with submissions be encountered, these should be documented contemporaneously, rectified with appropriate corrective and preventative actions and documentation retained in the Trial Master File.  A deviation should be raised within the quality management system if appropriate."
        },
        {
            "text": "Failure to recognise submissions are invalid, overdue and not resubmitted in a timely manner may result in inspection findings, especially where repeated failures are identified."
        },
        {
            "heading": 2,
            "text": "Where can I find out more information?"
        },
        {
            "text": "Further information, including details of how the fees apply and how this should be managed if trials have been approved via the Combined Review Process, can be found here. There is also a user guide on how to submit payments for ASRs using MHRA Pay."
        }
    ]
}