{
    "url": "https://deframedia.blog.gov.uk/2024/04/04/the-publication-of-the-common-user-charge-rates/",
    "title": "The publication of the Common User Charge rates",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-04-04T12:14:59+01:00",
    "content": [
        {
            "text": "There has been widespread reporting following the government’s publication yesterday of the Common User Charge rates and guidance, which will be brought in alongside new risk-based sanitary and phytosanitary (SPS) controls from 30 April as part of the nation’s new border system, known as the  Border Target Operating Model (BTOM). This follows a government consultation held last year on charging arrangements at Border Control Posts."
        },
        {
            "text": "The Common User Charge will be in place for imports on low-risk products of animal origin (POAO), medium and high-risk animal products, plants and plant products entering GB through the Port of Dover or Eurotunnel Le Shuttle which are eligible for checks at a government-run Border Control Post."
        },
        {
            "text": "The charge will apply to all eligible imports regardless of whether the import is selected for a physical check at planned government-run BCP facilities."
        },
        {
            "text": "As a global trading nation, diseases carried from imported animals, animal products, plants and plant products pose a serious risk to the UK’s biosecurity. Risk-based border controls are therefore essential to manage this and ensure that we only import safe, high-quality products."
        },
        {
            "text": "Therefore, charges on eligible imports coming into GB are necessary to fund the operation of planned government-run Border Control Post (BCP) facilities serving Port of Dover and Eurotunnel Le Shuttle to make sure physical checks on sanitary and phytosanitary (SPS) imports can be undertaken safely and securely."
        },
        {
            "text": "The Common User Charge will be in addition to any inspection fees applied by the Port Health Authority (for products of animal origin) and/or the Animal and Plant Health Agency (for plant and plant products). It will be up to commercial (private) ports to set their own charging structure and rates for traders using their services."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}