{
    "url": "https://mhclgdigital.blog.gov.uk/2025/01/08/4-things-ive-learnt-as-a-policy-professional-working-in-digital/",
    "title": "4 things I've learnt as a policy professional working in digital",
    "authors": [
        "Reuben Kenton-Harris, Policy Design Lead"
    ],
    "categories": [
        "Funding Service",
        "Strategy",
        "Ways of working"
    ],
    "pub_date": "2025-01-08T13:05:09+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Moving from policy to digital "
        },
        {
            "text": "Last year, I decided to try something different by taking up a role in a digital team. After 5 years in policy, I joined the MHCLG Funding Service as a subject matter expert, helping the department deliver grants more effectively and efficiently. While the substance of my work has remained similar, the differences in approaches and ways of working have been stark. "
        },
        {
            "text": "I’ve learnt a lot from immersing myself in the relatively unfamiliar world of digital. In this blog post, I share some reflections that might interest you – whether you are enthusiastic, sceptical or simply curious about how digital technologies and methods can transform and improve public services. "
        },
        {
            "heading": 2,
            "text": "1. Digital is more than just technology "
        },
        {
            "text": "One of my first discoveries was that ‘digital’ encompasses much more than just technology. As set out in MHCLG's strategic vision for digital, “it is about working smarter, streamlining how we operate, making policies more responsive, and creating a culture of collaboration”. Tom Loosemore, former Deputy Director at the Government Digital Service (GDS), defined ‘digital’ as: “applying the culture, practices, processes and technologies of the Internet-era to respond to people's raised expectations”. "
        },
        {
            "text": "Even as someone who grew up surrounded by electronic devices, my expectations have changed dramatically as a result of recent improvements in technology, as I’m sure yours have. From expecting online deliveries in a matter of days (or even minutes!) to feeling frustrated by clunky online forms, it’s undeniable that we now expect things to be easier, better and faster. "
        },
        {
            "text": "But as Loosemore’s definition suggests, meeting these heightened expectations requires much more than just adopting new technology. It demands that we put users of our services at the heart of design. "
        },
        {
            "heading": 2,
            "text": "2. User-centred approaches can improve policy "
        },
        {
            "text": "User-centred design lies at the core of digital ways of working – an iterative process where teams focus on users and their needs in each phase of design. Indeed, the first principle underpinning MHCLG’s digital strategy is ‘start with the needs of the user and value their knowledge’. But, as the strategy emphasises, this approach can be applied beyond designing digital services. "
        },
        {
            "text": "Every government programme or initiative has users. A ‘user’ is anyone who interacts with a service – whether they are reading guidance on GOV.UK, applying for funding or implementing policy. This differs from stakeholders, who have an interest in, or might be affected by a policy, product or service, without experiencing it directly. "
        },
        {
            "text": "While policy teams regularly engage with stakeholders, user-centred policy design takes this a step further. It embeds users and their needs into policy development by ‘co-designing’ policies from the outset and using user feedback to inform continuous improvements and iterations.  "
        },
        {
            "text": "User-centred policy design allows teams to test assumptions and unknowns with users while developing a policy or testing a prototype before launch, starting with user needs and perspectives. This saves time and resource, prevents unintended consequences, and ultimately helps to deliver better policy outcomes. Read more about user-centred policy design. "
        },
        {
            "heading": 2,
            "text": "3. Agile approaches can be used outside of digital teams "
        },
        {
            "text": "Something that sets digital teams apart from more traditional Civil Service teams is their commitment to constant iteration based on user feedback. This agile approach, however, is not just beneficial for digital teams.  "
        },
        {
            "text": "The agile methodology was developed as a way to work effectively in complex environments, where multiple factors interact to produce unpredictable outcomes. I’m sure this context will be familiar to many policy and delivery teams, who are often seeking to tackle multi-faceted and seemingly intractable problems. As Pat McFadden, Chancellor of the Duchy of Lancaster, recently emphasised, civil servants need to develop a “test-and-learn mindset”. Adopting an agile approach can help you do just that. "
        },
        {
            "text": "In September, I wrote a blog post on adaptive funding exploring tangible ways in which agile principles can help grant teams navigate complex policy environments. There is huge potential for other types of government policy to learn from this approach too. "
        },
        {
            "heading": 2,
            "text": "4. Multidisciplinary teams can unlock better solutions  "
        },
        {
            "text": "Another strength of digital teams is their multidisciplinary nature. The Funding Service brings people together from an array of different professions, including user researchers, content designers, policy designers, service designers, data engineers, software developers, business analysts, delivery managers and product managers – all working towards a shared goal.  "
        },
        {
            "text": "These varied perspectives prevent ‘groupthink’ and enable us to tackle problems from multiple angles. As citizens’ expectations of government services grow, combining these diverse skillsets is crucial for solving complex problems effectively.  "
        },
        {
            "text": "As Lawrence Hopper, Deputy Director of Digital Product and Delivery, recently highlighted, digital is a critical partner in shaping responsive government policies. Involving multidisciplinary teams from the start of policy design will ultimately lead to better outcomes.  "
        },
        {
            "heading": 2,
            "text": "Transform your work through digital "
        },
        {
            "text": "For government to be effective, it is essential that we adapt to an ever-changing world. For policy, delivery and communications teams this means embracing digital and data to work smarter and deliver better. By adopting internet-era cultures, practices, processes and technologies, we can tackle today’s complex challenges more effectively and create services that truly work for our users. "
        },
        {
            "text": "Find out how you can learn from digital in your organisation: "
        }
    ]
}