{
    "url": "https://educationhub.blog.gov.uk/2025/01/childrens-wellbeing-and-schools-bill-saving-parents-money-on-school-uniform-costs/",
    "title": "Children’s Wellbeing and Schools Bill: saving parents money on school uniform costs ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Child protection",
        "School uniform",
        "Uniforms"
    ],
    "pub_date": "2025-01-08T00:01:00+00:00",
    "content": [
        {
            "text": "Families shouldn’t have to be out of pocket when it comes to setting their child up for school.  "
        },
        {
            "text": "That’s why our new Children’s Wellbeing and Schools Bill will introduce measures to help with school uniform costs and introduce free breakfast clubs in all state-funded primary schools in England. "
        },
        {
            "text": "But what do these changes mean to parents and pupils? Here’s what you need to know. "
        },
        {
            "heading": 3,
            "text": "Help with school uniform costs "
        },
        {
            "text": "School uniforms can contribute to a sense of belonging for students as well as reducing peer pressure when it comes to clothing choices. "
        },
        {
            "text": "But we know many families are struggling with the mounting cost of school uniforms – with half of parents feeling concerned about the cost of uniforms and 12% saying they have been in financial hardship as a result. "
        },
        {
            "text": "Many schools are already taking steps to reduce school uniforms costs, but others still require 10 or more branded items per child. That means those parents have fewer options to buy cheaper uniform items from the high street or supermarkets. "
        },
        {
            "text": "The Children’s Wellbeing and Schools Bill will ban schools from requiring parents to buy more than three branded items as part of the school uniform. Secondary and Middle schools will be able to require an additional branded item if one of those items is a branded tie. The government is clear that these items should be limited to low-cost and long-wearing items only.  "
        },
        {
            "text": " This means, for the first time, no school in England will be able to require unnecessarily large numbers of branded items, so no parent will be unfairly disadvantaged. "
        },
        {
            "heading": 3,
            "text": "How much will parents save? "
        },
        {
            "text": "Currently 24% of primary and 70% of secondary schools still require five or more branded items, with some parents saying they were asked to provide 10 or more. Others already require less than three or four branded items. That means savings will depend on the reduction in branded items required.  "
        },
        {
            "text": "Costs will vary from supplier to supplier, but parents of pupils at schools that have to remove at least one item could save on average around £14 per primary pupil and £19 per secondary pupil. This is because there will be more options available to parents when it comes to buying their uniform.  "
        },
        {
            "heading": 3,
            "text": "How else can families save money on uniform costs?"
        },
        {
            "text": "Some families may be able to get grants to help with paying for school uniforms, depending on their local authority and whether they are eligible. "
        },
        {
            "text": "Some schools or trusts run their own schemes to help with uniform costs, but they should also help make second-hand uniforms available to parents. This can be through setting up a second-hand uniform scheme or by signposting parents to an existing one.  "
        },
        {
            "heading": 3,
            "text": "Free breakfast clubs"
        },
        {
            "text": "The Bill will also mean all primary school children in state-funded schools will have the option to attend a free breakfast club – ensuring children have a settled start to the day and time with friends so they are ready to learn. "
        },
        {
            "text": "Some clubs will launch from as early as April 2025 at schools taking part in the early adopter scheme. The changes in the Bill will mean the programme will be rolled out to every state-funded primary school.  "
        },
        {
            "text": "Further details about the timing of this wider roll out will be made available in due course.  "
        },
        {
            "heading": 3,
            "text": "What other measures are in the Children’s Wellbeing and School’s Bill? "
        },
        {
            "text": "You can read more about further measures in the Bill to help children and families, from school reform and home education to safeguarding at our Education Hub post here.  "
        }
    ]
}