{
    "url": "https://defrafmp.blog.gov.uk/2025/01/08/navigating-fmp-consultations-qa-videos-to-answer-your-questions/",
    "title": "Navigating FMP consultations: Q&A videos to answer your questions",
    "authors": [
        "Anna Maclennan - South West Regional Fisheries Group lead, Marine Management Organisation"
    ],
    "categories": [
        "Cockle FMP",
        "North Sea and Channel sprat FMP",
        "Southern North Sea and Channel skates and rays FMP",
        "Southern North Sea demersal non-quota FMP"
    ],
    "pub_date": "2025-01-08T16:54:43+00:00",
    "content": [
        {
            "text": "A set of four videos have been produced for the draft fisheries management plans currently under consultation.  "
        },
        {
            "text": "The Regional Fisheries Group team gathered questions from the fishing sector during the FMP consultation engagement events held between October and December 2024 to put together Q&A (question and answer) videos.  "
        },
        {
            "text": "These videos are designed to address some of the frequently asked questions by the fishing sector and highlight key elements of the plans such as what goals are included.    "
        },
        {
            "text": "Defra policy leads for the draft plans have answered the questions with support from the organisations that developed the plans- Cefas, AIFCA and Marine Management Organisation.  "
        },
        {
            "heading": 2,
            "text": "Videos "
        },
        {
            "text": "Links to these Q&A videos have also been shared directly with the members of Regional Fisheries Groups. "
        },
        {
            "text": "To contact your local MMO Regional Fisheries Group lead, please email: regionalfisheriesgroups@marinemanagement.org.uk "
        },
        {
            "text": "The consultations for these draft plans close at 23:59 on 19 January 2025.  "
        },
        {
            "text": "​​You can find the FMP and associated documents in the ‘related’ section at the bottom of the consultation webpages on Defra - Citizen Space. Here you can respond to the consultations by completing the online questionnaire or find the email and postal details to respond.​ "
        }
    ]
}