{
    "url": "https://designnotes.blog.gov.uk/2022/03/25/a-day-in-the-life-of-an-interaction-designer-at-gds/",
    "title": "A day in the life of an interaction designer at GDS",
    "authors": [
        "Ann Oduwaiye – Senior Interaction Designer, GDS",
        "Jeremy Yun – Senior interaction designer, GDS",
        "Rose Westcott – Interaction Designer, GDS"
    ],
    "categories": [
        "Design",
        "Interaction Design"
    ],
    "pub_date": "2022-03-25T09:52:06+00:00",
    "content": [
        {
            "text": "An interaction designer designs the ways that people interact with services. That might be through online forms, guidance, text messages, emails, letters – whatever works best to help users through a service."
        },
        {
            "text": "At our career events, attendees often ask us what a day in the life of an interaction designer looks like. Government Digital Service (GDS) is hiring mid-level and senior interaction designers in multiple locations, so this is an excellent time to tell you about how we work. In this blog, you hear from 3 interaction designers, all in different stages of their career as interaction designers."
        },
        {
            "heading": 2,
            "text": "What are the tasks that an interaction designer might do?"
        },
        {
            "text": "A typical day for an interaction designer can differ quite a lot, depending on what team you’re working on, and at what stage a project is at."
        },
        {
            "text": "Roughly, our work can be split into two aspects. "
        },
        {
            "heading": 3,
            "text": "Being strategic"
        },
        {
            "text": "One aspect of our work focuses on looking at the strategic side of the work, where we collaborate with a user researcher, service designer and product manager to understand who the users of a service are, and think about what they need, and what their pain points are."
        },
        {
            "text": "This work could involve:"
        },
        {
            "heading": 3,
            "text": "Defining the thing to build and helping to build it"
        },
        {
            "text": "The other aspect of our role is working to define the thing to build. This involves more prototyping, communication and delivering skills from the interaction designer."
        },
        {
            "text": "This work could involve:"
        },
        {
            "text": "coming up with design solutions by:"
        },
        {
            "text": "turning designs into an actual service by:"
        },
        {
            "heading": 2,
            "text": "Joining GDS as a junior interaction designer"
        },
        {
            "heading": 3,
            "text": "Rose Westcott, Interaction Designer"
        },
        {
            "text": "I had never worked in government before joining as a junior just under a year ago. I found some elements of working at GDS intense. People are highly specialised, the day to day work is not predictable and there are a lot of moving parts that go into delivering services that can be used by everyone."
        },
        {
            "text": "However, I have recently been promoted to mid-weight interaction designer. Reflecting on the difference in confidence from when I first joined and now, it’s clear that I have been able to learn a lot from working closely with other designers. Also, the wider GDS design community provides support and knowledge sharing in the form of design coaches, training courses and talks."
        },
        {
            "text": "The main thing for someone new to government starting at the junior level, is to take your time getting up to speed with things. At the beginning it helps a lot to focus on the skills you are comfortable with. For me, this was the more practical elements of design like building user journeys in design tools."
        },
        {
            "text": "Another tool we often use as interaction designers is the GOV.UK Prototype Kit. This is a set of HTML pages and design components that allow people with little knowledge of coding to publish interactive pages to the web. These prototypes are then used to test ideas with users and colleagues."
        },
        {
            "text": "The other side of being an interaction designer is more strategic. It can be hard to nail down the skills required for this area, but I think it’s largely about understanding context: who your designs will be used by and how, as well as what work has already been done in the area."
        },
        {
            "text": "This may be difficult to add input to when first joining, but it’s important to understand that you can take a more observational approach and input when you feel confident to, GDS prides itself on having an open culture where anyone can and should raise their voice. Remember that it’s fine to ask questions!"
        },
        {
            "text": "One of the best parts of being an interaction designer at GDS is the collaboration with other disciplines. We often pair with content designers, working on the end-to-end journey of a service to help users complete their goal. The user researcher takes these designs and tests them with real users, afterwards the whole team can watch and reflect on which parts were successful and which need to be iterated on. It can be a very satisfying process with lots of opportunities to learn from other disciplines."
        },
        {
            "heading": 2,
            "text": "Interaction designers do discovery work too!"
        },
        {
            "heading": 3,
            "text": "Ann Oduwaiye, Senior Interaction Designer"
        },
        {
            "text": "The discovery phase is the first phase in a project. It is a time to learn about users, constraints, and what can be improved. As a mid-weight interaction designer working on a discovery team, I help to define the problem we are trying to solve."
        },
        {
            "text": "We meet with a range of stakeholders, I do design reviews of similar services, and I collate the information we gather into one place. After this, myself and my service designer colleagues run a team workshop to devise a problem statement. This problem statement helps to guide us throughout the discovery phase."
        },
        {
            "text": "Once we have defined our problem, we are able to brainstorm design opportunities and assess the suitability of each one based on a range of criteria. I create user flows and wireframes, which are based on secondary user research and my knowledge of existing services. The user flows act as communication tools in the discussions we have on tech feasibility and governance risks."
        },
        {
            "text": "By assessing the design opportunities based on a range of criteria, we are able to make recommendations for next steps and move onto the alpha phase. The alpha phase is where we will be able to iterate and test design ideas with users."
        },
        {
            "text": "I have found my role has been to advocate for user-centred design (UCD) within my discovery team. My role has been a mixture of more general UCD and more specialised interaction design. Design roles might be more or less defined depending on the stage your team is at."
        },
        {
            "text": "I have recently been promoted to senior interaction designer at GDS. As a senior you have more room to shape the work to be done, as well as more leadership opportunities in managing and coaching other designers. Career progression is just one of the benefits in working for GDS."
        },
        {
            "heading": 2,
            "text": "Doing craft and strategy"
        },
        {
            "heading": 3,
            "text": "Jeremy Yun, Senior Interaction Designer"
        },
        {
            "text": "Working as a senior interaction designer at GDS entails a healthy dose of both ‘being strategic’ type of work and ‘defining the thing to build and helping to build it’ type of work."
        },
        {
            "text": "This is just based on my own experiences, however, as you’re likely to hear many different designers say that they do more or less of each type of design. Some designers like to stay focused on the craft side of the work, while others like to sit more on the strategic side."
        },
        {
            "text": "Currently my work sits more on the strategic side of the work, where I spend most of my time exploring topic areas that are yet to be fully defined. Quite often I ask ‘what if’ and ‘why’ questions to understand how particular iterations of a design or technology could help us."
        },
        {
            "text": "Recently I have been working with the data teams on GOV.UK, and with a user researcher, we have been working closely with data scientists, performance analysts and service teams to understand the current state, and future state, journeys for feedback collection on the platform. This has entailed more of the strategic side of the work; trying to understand what the problems are with the current state, and defining what the future state process could look like."
        },
        {
            "text": "It is worth saying that the work of a senior interaction designer and a service designer are related to each other. The main difference is that an interaction designer is closer to the ‘making’ side of the design process, so the focus is more on the details of a service."
        },
        {
            "text": "Another type of work that isn’t really in the list at the top of this post is the wider community work. For me, this involves looking after more junior designers and organising cross-government opportunities for cross-pollinating ideas in the form of organising ‘Get Feedback’ sessions or bringing the UCD and data community together."
        },
        {
            "text": "Community is the glue of collaboration and it is important to pay it forward whenever we can towards fostering a healthy design community."
        }
    ]
}