{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/03/25/bringing-together-regulatory-thinking-in-the-digital-space/",
    "title": "Bringing together regulatory thinking in the digital space",
    "authors": [
        "Gill Whitehead"
    ],
    "categories": [
        "CMA Digital"
    ],
    "pub_date": "2022-03-25T10:50:09+00:00",
    "content": [
        {
            "text": "Gill Whitehead, Chief Executive of the Digital Regulation Cooperation Forum, welcomes the launch of the DRCF’s new digital research portal."
        },
        {
            "text": "One of the most profound benefits of the internet has been the democratisation of knowledge. The ability for anyone with a device and internet connectivity to have instant access to the vast array of scientific, technical, or cultural information that exists today has helped individuals find new communities, helped spur entrepreneurship and is helping the effort to solve our largest global challenges, such as climate change."
        },
        {
            "text": "Yet, alongside the advantages generated by the internet, there are of course disadvantages, which range in intent and severity. The original Utopian vision for the internet, as a free-spirited golden era of self-regulation, has receded and been replaced by widespread recognition of the need for digital regulation to ensure that individuals, society, and economies can reap the benefits whilst being protected from harm."
        },
        {
            "text": "This has prompted the evolution of multiple new regulatory regimes and responsibilities in relation to digital markets. To support consistency between these regimes, the ICO, CMA, and Ofcom – joined since by the FCA – came together in July 2020 to create the Digital Regulation Cooperation Forum (DRCF). Having joined as their inaugural Chief Executive in November 2021, I describe the mission of the Forum using 3 C’s:"
        },
        {
            "text": "Our work requires us to look over the horizon as to what might be coming next, and to advance our own knowledge as to what the implications may be, as our forthcoming joint publication on algorithmic benefits, harms and the current landscape for solutions, intends to set out. But to understand where we can really add value, we need to know what has already been done. We need to be able to spot gaps and see synergies. To do this well means first having full awareness of the knowledge of our own organisations and those we partner with."
        },
        {
            "text": "It is for this reason I am delighted to launch our new digital regulation research portal that brings together over 80 pieces of recent research on emerging and future digital developments from eight regulatory bodies, including the DRCF members and the Intellectual Property Office, the Bank of England, the Advertising Standards Authority and the Gambling Commission."
        },
        {
            "text": "By ensuring that this body of knowledge is publicly available, fully accessible and easily discoverable via the DRCF Gov.uk webpage, we hope to better equip all who are interested in contributing to the shape of digital regulation in the UK, and to the debate on how society can best harness the best of the internet without the worst."
        },
        {
            "text": "We intend for this body of research and those that contribute to grow over time, and we will iterate the portal in response to feedback. I look forward to yours."
        }
    ]
}