{
    "url": "https://valuationoffice.blog.gov.uk/2022/03/25/how-we-value-petrol-stations/",
    "title": "How We Value: Petrol Stations ",
    "authors": [
        "sophiekilgour"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2022-03-25T10:00:23+00:00",
    "content": [
        {
            "text": "Dave Hughes is a National Valuation Lead in the VOA. One of his roles is to oversee the valuation of petrol stations in England and Wales. Here, Dave runs through what is involved in valuing these properties. "
        },
        {
            "text": "The sector "
        },
        {
            "text": "There are around 7,000 petrol stations in England and Wales, ranging from sole traders with a single garage to large dealers operating close to 1,000 sites.  "
        },
        {
            "text": "Many petrol station operators offer a range of services in addition to fuel sales, including shops, food facilities and often car wash services. Unpredictable margins on fuel and changes in consumer demands have resulted in an increase and improvement to these added extras - from a wider range of products in shops and locally sourced produce to franchise partnerships with well known high street brands. "
        },
        {
            "text": "A modern service station will have a fuel supply agreement, usually with a well-known oil company.  With one eye on the future, some stations are installing charging points for electric cars.  "
        },
        {
            "text": "How are petrol stations valued? "
        },
        {
            "text": "Simply put, petrol stations are valued on their trading potential, where a landlord and tenant will reach an agreement based on the ‘fair maintainable trade’ (FMT) at the relevant valuation date. FMT is the trade which a reasonably efficient operator would expect to achieve at the site in question, bearing in mind factors like location and local competition.  "
        },
        {
            "text": "We also look at how much fuel is sold, normally measured by litres dispensed. For the forecourt shop and any valeting, we normally measure turnover - all based on the principles of FMT. "
        },
        {
            "text": "We consider the individual pricing policy of each site, which is up to the operator. They must decide whether to price high but sell a lower volume, or to price low but achieve a higher volume of trade. Those who sell the most fuel in the UK are typically superstore operators, adopting a low price and low margin approach. "
        },
        {
            "text": "Valuation of the forecourt shop is also based on an FMT approach, keeping turnover in mind, and can range significantly from site to site. Recognised brand names will often increase how much customers spend, however these can come with extra costs for the operator, such as franchise fees. Valeting is usually either an automated wash or a jet wash and the same FMT approach applies here.  "
        },
        {
            "text": "Once a reasonable FMT has been determined, the valuer will then determine the gross profit, a percentage of which is then taken as rateable value. These percentages are based on the analysis of rents paid by petrol station operators. The local authority will then apply a calculation to the rateable value to work out what business rates bill is. "
        },
        {
            "text": "Industry discussions "
        },
        {
            "text": "Due to the complex nature of this market, we keep in regular contact with agents who represent the various industry bodies and act for landlords and tenants when stations are being let. These discussions have helped agree valuations schemes for successive rating lists, leading to more certainty for ratepayers on their bills.  "
        },
        {
            "text": "There’s certainly a lot for us to consider in valuing petrol stations. Not only do different operators approach their businesses in different ways, but we’re seeing changes like preparations for electric cars. It’s certainly an interesting sector to work with. "
        }
    ]
}