{
    "url": "https://teaching.blog.gov.uk/2022/03/25/what-the-adoption-of-edtech-has-taught-us/",
    "title": "What the adoption of EdTech has taught us",
    "authors": [
        "Sarah Morgan"
    ],
    "categories": [
        "Primary schools",
        "Remote education"
    ],
    "pub_date": "2022-03-25T14:01:48+00:00",
    "content": [
        {
            "text": "Sarah Morgan, Programme Lead for the EdTech Demonstrator Programme at Pheasey Park Farm Primary School, explains how the adoption of new technology during the pandemic has inspired changes that have improved the effectiveness of teachers and the experience of students.  "
        },
        {
            "text": "While the pandemic has been challenging in many ways, disrupting so much of ‘normal’ school life, we have observed positive outcomes and recognise how it has, in fact, opened doors to better ways of learning. In the time since that first shift to remote learning, we have realised the possibilities of EdTech are far broader than we imagined. We are working with schools on several new initiatives based on the following learnings:  "
        },
        {
            "heading": 3,
            "text": "1. Bringing new groups of students together"
        },
        {
            "text": "Schools have learned that students can take on a broader range of subjects through remote learning. Online sessions can bring students together from different schools within a MAT for a lesson in a particular specialist skill area, such as a modern foreign language. Technology has created an opportunity to really provide a more personalised approach to learning. "
        },
        {
            "heading": 3,
            "text": "2. Using EdTech to upskill staff"
        },
        {
            "text": "We have also worked with schools to create an effective continuing professional development (CPD) programme. The pandemic reminded us that there is a wealth of unexplored opportunities from education technology that is missed due to a lack of training and awareness. Continually providing staff with opportunities to upskill has enabled a greater return on schools’ EdTech investment. "
        },
        {
            "heading": 3,
            "text": "3. Maintaining video conferencing for parents"
        },
        {
            "text": "Lockdown also revealed the benefits of stronger home-school links. For example, some schools are continuing to offer families remote meetings for parents’ evening. These are better attended by both parents, wherever they are based, and supports those who have historically struggled to attend these meetings.  "
        },
        {
            "heading": 3,
            "text": "4. Updating feedback and marking approaches"
        },
        {
            "text": "Teachers have also achieved a reduced workload through online marking technology. Some teachers have been using voice recording technology to embed audio feedback within a piece of digital work. The power of audio feedback that can be replayed, has proved to be far better and more appropriate for a wider range of children’s needs.  "
        },
        {
            "text": "Despite the challenges of teaching and supporting our pupils through the pandemic, it has certainly brought a new ways of working with EdTech that have benefits far beyond remote education. Embracing EdTech has improved our teachers’ practice and workload and supported our children’s development, as well as unprecedented cost savings."
        }
    ]
}