{
    "url": "https://deframedia.blog.gov.uk/2025/01/27/coverage-after-government-pledges-to-clean-up-communities-with-deposit-return-scheme-for-plastic-bottles-and-cans/",
    "title": "Coverage after Government pledges to clean up communities with deposit return scheme for plastic bottles and cans",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "plastic"
    ],
    "pub_date": "2025-01-27T13:21:04+00:00",
    "content": [
        {
            "text": "There has been widespread positive media coverage after the Government implemented legislation for the deposit return scheme for drinks containers in England and Northern Ireland. "
        },
        {
            "text": "Publications includingthe Mail, Independent, Standard, Telegraph, Business Green, edie, letsrecycle.com, Circular, Innovation News Network, Your Money and Sustainable Plastics among others covered the announcement, which marks a significant step forward in ending the throwaway society and cleaning up Britain.  "
        },
        {
            "text": "Once the deposit return scheme launches in October 2027, consumers will have a financial incentive to return empty containers to a collection point, such as at their local supermarket, so that the bottle or can will be recycled. "
        },
        {
            "text": "Introducing such a scheme in England, Northern Ireland and Scotland is a simple yet hugely effective way of addressing problems with rubbish building up on our streets and in our rivers and oceans, while also ensuring the public gets money back on their bottle.  "
        },
        {
            "text": "New legislation for England and Northern Ireland has now come into force, enabling the appointment of the scheme administrator – known as the Deposit Management Organisation – in April 2025. This will be a not-for-profit, industry-led body responsible for the administration and day-to-day running of the scheme.   "
        },
        {
            "text": "Circular Economy Minister Mary Creagh said:"
        }
    ]
}