{
    "url": "https://defrafmp.blog.gov.uk/2025/01/27/introduction-to-the-role-of-evidence-in-fisheries-management-plans/",
    "title": "Introduction to the role of evidence in fisheries management plans",
    "authors": [
        "​​Jennifer Scott - Fisheries Science Advisor, Defra​",
        "Lara Oh - Fisheries Science Advisor, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Bass FMP",
        "Channel demersal non-quota FMP",
        "Cockle FMP",
        "Crab and lobster FMP",
        "King scallop FMP",
        "North Sea and Channel sprat FMP",
        "Queen scallop FMP",
        "Southern North Sea and Channel skates and rays FMP",
        "Southern North Sea and Eastern Channel mixed flatfish FMP",
        "Southern North Sea demersal non-quota FMP",
        "Whelks in English waters FMP"
    ],
    "pub_date": "2025-01-27T15:00:39+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Evidence is key when developing fisheries management plans (FMPs).  "
        },
        {
            "text": "We are taking an evidence-based approach to FMPs, using the best available scientific advice to support decision making. "
        },
        {
            "text": "This approach is important for ensuring the sustainability of fish stocks and the benefits they provide to society and meets objectives in the Fisheries Act 2020,  the Joint Fisheries Statement (JFS) and the Trade and Cooperation Agreement. "
        },
        {
            "heading": 3,
            "text": "The amount of evidence available for each FMP species varies.  "
        },
        {
            "text": "In general, species with high economic value, easier monitoring conditions or well understood biology are more likely to have more evidence available. In contrast, species that are difficult to monitor, less economically significant or biologically complex often have less evidence available. There tends to be more evidence for stocks managed by quotas than those that aren’t. During the development of each FMP, evidence is gathered to shape the approach we take in the FMP.  "
        },
        {
            "heading": 3,
            "text": "This evidence is published in an Evidence Statement. "
        },
        {
            "text": "An Evidence Statement will be produced for each FMP that sets out what we know about the species and fishery, including an overview of the fishery, stock data (if available), species biology, environmental considerations (such as climate change), and the social and economic evidence.  "
        },
        {
            "text": "These are now available for the first 11 FMPs - find them here: FMP Evidence Statements   "
        },
        {
            "heading": 3,
            "text": "Evidence gaps are identified  "
        },
        {
            "text": "During the development and consultation stages of each FMP we identify evidence gaps where further data, evidence and knowledge is required.  "
        },
        {
            "text": "Some gaps are specific to one FMP (e.g. life history study of specific species) and others are across several, or all FMPs (e.g. the carbon footprint of English fisheries supply chain).  "
        },
        {
            "text": "See the list of evidence gaps for the first six published plans here: Evidence gaps for FMPs. "
        },
        {
            "text": "These evidence gaps need to be addressed to successfully implement the measures and goals in the FMPs. "
        },
        {
            "heading": 3,
            "text": "What’s coming next? "
        },
        {
            "text": "To start tackling some of these gaps so we can continue to move forward with implementing FMPs, Defra have commissioned several Research and Development (R&D) projects which aim to address some of these evidence gaps.   "
        },
        {
            "text": "Researchers at Cefas, Defra, Bangor University and Joint Nature Conservation Committee (JNCC) have been working on these projects that aim to increase our knowledge on stock structures and appropriate management measures for different non quota species, improve our data collection abilities and better understand how to mitigate the impacts of some gear types on benthic habitats. "
        },
        {
            "text": "An update on these R&D projects and more is coming soon, along with the opportunity to get involved. Watch the blog (or subscribe) for updates. "
        }
    ]
}