{
    "url": "https://gds.blog.gov.uk/2025/01/27/same-name-new-ambitions/",
    "title": "Same name, new ambitions",
    "authors": [
        "Joanna Davinson, Government Chief Digital Officer"
    ],
    "categories": [
        "Digital Centre"
    ],
    "pub_date": "2025-01-27T10:39:29+00:00",
    "content": [
        {
            "text": "Last week we shared some news! The digital centre of government we've been talking about will be called the Government Digital Service. We have published its high level plans for the future: A blueprint for modern digital government."
        },
        {
            "heading": 2,
            "text": "The 'digital centre' is now the Government Digital Service (GDS)"
        },
        {
            "text": "We considered lots of ideas for new names, but in the end settled on using the name we already have. The \"GDS\" name is extremely well known, both nationally and internationally and it has an excellent reputation we can build upon. "
        },
        {
            "text": "Although the name is familiar, the organisation will change. Teams from GDS, the Central Digital and Data Office (CDDO), the Incubator for AI (i.AI) and colleagues from the Geospatial data team and the Responsible Technology Adoption Unit have merged together to come together as the Government Digital Service. "
        },
        {
            "heading": 2,
            "text": "Wholesale reshaping of the public sector"
        },
        {
            "text": "A changed organisation brings changed plans and ambitions. They are much wider in scope, setting out an intention for comprehensive, compelling change across the public sector, not just central government. "
        },
        {
            "text": "The blueprint for modern digital government sets out all those ambitions in some detail. We encourage you to read it in full. There's a lot to take in, not just in what we want to achieve, but in how we intend to achieve it. In his foreword to the Blueprint, our Secretary of State Peter Kyle describes it as \"a wholesale reshaping for the public sector.\" "
        },
        {
            "text": "The Blueprint was informed by the State of Digital Government Review, which highlighted some lasting, deep rooted systemic problems faced by digital public services. For example, we continue to struggle with recruiting and retaining the right skills and expertise in our digital teams. And sometimes organisations structures perpetuates the fragmented services people are expected to make sense of. These are just a few of the problems we need to work towards resolving in the newly formed Government Digital Service."
        },
        {
            "text": "The Blueprint sets out the future we'd like to see. Modern digital government should still do all the things we've been doing for years: meeting user needs, iterative user-centred delivery, and digital services so good that people prefer to use them. "
        },
        {
            "text": "But it should also go much, much further than this. Government services should do more of the hard work on people’s behalf: they should interconnect and link up and they should move at the same pace as people's daily lives. People shouldn't have to work out which benefits it’s worth them applying for; or remember the steps they're supposed to follow when they want to start a new business. We should take a responsible, ambitious stance on using AI to help deliver public services: understanding its potential, and using it where it makes sense to do so. "
        },
        {
            "text": "In the Blueprint you'll see details of the future we're striving for: a six-point plan for helping to bring it about, and a set of next steps. We've been working on some very early concepts to visualise and articulate that future and we'll share some of that work soon."
        },
        {
            "heading": 2,
            "text": "Starting points"
        },
        {
            "text": "To succeed, the new GDS will need to expand its remit, acquire new mandates for reform, and gradually expand its scope over time into targeted support for local government and the NHS, for example. "
        },
        {
            "text": "We will introduce new products, including GOV.UK Wallet and GOV.UK App, and new digital public infrastructure including a National Data Library."
        },
        {
            "text": "We will double down on some existing work, such as One Login, and work to build digital and data capability across government. "
        },
        {
            "text": "We will renew our efforts to reform how AI and digital services are funded, assured and procured. "
        },
        {
            "text": "We will need to develop a roadmap for the next few years alongside the second phase of the Spending Review, and collaborate with digital leaders and teams across the public sector to make sure it works for everyone."
        },
        {
            "text": "What do you want to see from the reinvigorated GDS? We’d love to hear your ideas for modernising digital government. "
        }
    ]
}