{
    "url": "https://cddo.blog.gov.uk/2025/01/27/welcome-to-government-digital-and-data/",
    "title": "Welcome to Government Digital and Data",
    "authors": [
        "Government Digital Service"
    ],
    "categories": [
        "Cross-government strategy",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-01-27T12:09:19+00:00",
    "content": [
        {
            "text": "You may have noticed some changes around here - we've renamed this blog to reflect recent machinery of government changes. "
        },
        {
            "text": "Welcome to our new chapter! We're excited to introduce you to 'Government Digital and Data' - the new name for our blog. While the name may be different, our commitment to sharing digital transformation stories remains the same. We will continue to highlight innovation, share best practices, and showcase the excellent work happening throughout the public sector."
        },
        {
            "heading": 2,
            "text": "About Government Digital and Data"
        },
        {
            "text": "Government Digital and Data is a community of tens of thousands of experts leading digital transformation in government. Together, we are a powerful force creating more efficient services that have a meaningful impact on people’s lives."
        },
        {
            "text": "As of January 2025, the Government Digital Service leads the Government Digital and Data function for government."
        },
        {
            "heading": 2,
            "text": "Stay Connected"
        },
        {
            "text": "Learn more about the future vision for digital in government."
        },
        {
            "text": "Follow us on LinkedIn and subscribe to this channel to receive the latest blogs directly into your inbox."
        },
        {
            "text": "If you work in the public sector, don't miss out on our regular updates - sign up to our monthly email Bulletin. "
        },
        {
            "text": "Thank you for continuing to follow our digital transformation journey. We look forward to sharing more stories about how we're working to make government services better for everyone."
        }
    ]
}