{
    "url": "https://defradigital.blog.gov.uk/2017/09/27/making-the-change-from-project-to-delivery-management/",
    "title": "Making the change from project to delivery management",
    "authors": [
        "Frieda Davies"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2017-09-27T10:37:07+01:00",
    "content": [
        {
            "text": "Agile delivery is relatively new to government, and a lot of teams and departments are still getting used to how it works."
        },
        {
            "text": "One of the essentials is that the team structure is right, and that you have the right people in place to plan and influence. The result is a stronger and more effective delivery team. You need a product manager and a delivery manager. The product manager defines the vision; the delivery manager makes sure it happens (as explained by Emily Webber)."
        },
        {
            "text": "Delivery management is not, and shouldn't be assumed to be, just a new word for project management. In making the transition to new ways of working, that’s an assumption that does keep cropping up."
        },
        {
            "text": "I've spent the recent part of my career building towards project management, but found myself becoming a delivery manager during the last year or so."
        },
        {
            "text": "Making that move was hard. Being a delivery manager requires a completely different mindset, and a fair number of specific skills that newcomers to the role need to learn and practice. It's so much more than a different job title. It's a different way of working."
        },
        {
            "heading": 2,
            "text": "How the GDS Academy helped me"
        },
        {
            "text": "Recently, I attended the GDS Academy training course for delivery managers. Among many other things, it taught me:"
        },
        {
            "text": "A bit more about that last point: having a clear vision for the work helps the work get done. It needs to be something simple and understandable, and something that everyone with an interest in the work can agree to. The earlier in the process that it's discussed, finalised and shared, the better for everyone."
        },
        {
            "text": "The best time to do this is at the end of discovery, when the whole team have reached a shared understanding of the problem space and the user needs that should be met."
        },
        {
            "text": "For me, the delivery manager course covered everything you need to know as a DM, and everything a team is likely to expect a DM to do. It included impact mapping, and understanding the value of change and how delivery gets prioritised. We learnt more about roadmaps and product backlogs, planning methods, Scrum, Kanban and lean UX and agile estimation methods."
        },
        {
            "text": "In short: I now feel better equipped to be a delivery manager. I can see where I need to learn more, apply what I know and ensure that everyone on my team is with me. Since the course I have trialled new ways of facilitating retrospectives, pushed for more use of planning tools (such as JIRA), and developed a roadmap and ways of working to help team members understand and move forward with delivery."
        },
        {
            "heading": 2,
            "text": "Help is out there if you need it"
        },
        {
            "text": "I suspect I'm not the only civil servant in the Environment Agency (or even in government as a whole) to find myself suddenly needing to be a delivery manager with little or no previous experience. If you find yourself in that position... don't panic. There is an active Delivery Managers Community of Practice within Defra that holds weekly calls and frequent meetings to share ways of working. You should join that. I'd also recommend that you attend the GDS Academy training to give you a practical overview of tools you can use. And finally, there are lots of posts on many government blogs that support and explain these ways of working."
        },
        {
            "text": "I have found that a common sense approach goes a long way, as well as talking through as a team what you are trying to achieve in the short term and delivering step by step. The better we understand delivery management in Defra, the better we can deliver. And that's what we're all here for, right?"
        }
    ]
}