{
    "url": "https://healthmedia.blog.gov.uk/2023/05/19/boosting-the-primary-care-workforce-and-improving-patient-experience/",
    "title": "Boosting the primary care workforce and improving patient experience",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "GPs",
        "Primary Care"
    ],
    "pub_date": "2023-05-19T10:51:54+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The government has met its target of recruiting 26,000 additional primary care professionals – one year ahead of the March 2024 deadline."
        },
        {
            "text": "Data published today by NHS England shows there are 29,103 additional primary care staff delivering care to patients and supporting one of the government’s key priorities to cut waiting lists."
        },
        {
            "heading": 2,
            "text": "Health and Social Care Secretary Steve Barclay said:"
        },
        {
            "text": "“This government is focused on cutting waiting lists – which is one of our five priorities –  and getting patients the care they need, when they need it."
        },
        {
            "text": "“We have delivered on our promise a year early to recruit 26,000 extra primary care professionals which means more clinicians delivering better, more specialised and accessible care to patients."
        },
        {
            "text": "“Building on the Primary Care Recovery Plan, we are determined to end the 8am scramble, improve technology and reduce bureaucracy.”"
        },
        {
            "text": "Here’s what you need to know: "
        },
        {
            "heading": 2,
            "text": "What services will these extra staff deliver? "
        },
        {
            "heading": 2,
            "text": "Are these staff adequately trained to deliver appropriate care?"
        },
        {
            "heading": 2,
            "text": "What are you doing to deliver more GPs?"
        },
        {
            "heading": 2,
            "text": "Are you investing further money into primary care to support these extra staff? "
        }
    ]
}