{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/05/19/gse-leadership-values-integrity/",
    "title": "GSE Leadership Values: Integrity",
    "authors": [
        "Dr Kavitha Kishen"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Talent & Leadership"
    ],
    "pub_date": "2023-05-19T14:47:38+01:00",
    "content": [
        {
            "text": "When writing a blog about the GSE leadership value of ‘Integrity’, I had to stop and think for a moment about what integrity really meant for me. As both a Civil Servant and a scientist, I think it’s essential for so much of what we do. We need to always be open and honest about the evidence and data available, and about the conclusions we can draw (or not, as the case may be). Integrity is vital to building trust, and as scientists and engineers we need to be trusted to deliver unbiased messages fairly and transparently. "
        },
        {
            "text": "As a leader in the GSE Profession, I think it becomes even more important. Part of the leader’s role to promote and defend integrity, leading by example for our teams and those around us. I often hear the phrase ‘speaking truth to power’ and that is part but not all of it. It’s also about how we uphold the need for rigour in our research, evidence and analysis so that we are not taking the easy routes but are willing to challenge ourselves to do the best that we can.  "
        },
        {
            "text": "That doesn’t mean we should be seeking perfection - we need to be responsive in a fast-paced world – but we need to be as rigorous as we can be. The teams I lead now support delivery of science advice in very different contexts: the Prime Minister’s Council for Science & Technology advise on key strategic issues, whilst SAGE is there to provide advice to government in emergencies. Advice from either body must be based on sound evidence and discussion but will always be limited by the data available and unknowns, whether that is because a novel technology is unproven or because the situation is evolving so rapidly. "
        },
        {
            "text": "Looking back on my time in the Civil Service, I can think of times when I’ve been asked for ‘fast research’ to support policy development. Sometimes I’ve been able to say ‘yes’ when I can see how to get the specific evidence which will be valuable. At other times I’ve had to hold the line and say ‘no’ when I could clearly see the risks of an incomplete picture skewing decision-making. Each situation needs to be considered on its own merits. Building trust with my colleagues through being open about the value and limitations of research enabled me to have those conversations and reach a positive way forward. "
        },
        {
            "text": "Everyone in the profession will face these or similar challenges in the course of their work. I believe that leading with integrity will always be key to supporting those people to navigate a path that upholds the quality of research and to then communicate that clearly and transparently as needed. I’m committed to upholding that throughout my career, and I hope you will join me in that. "
        },
        {
            "text": "Dr Kavitha Kishen  "
        },
        {
            "text": "Deputy Director, Security, Resilience and Strategy   "
        },
        {
            "text": "Related Link "
        },
        {
            "text": "GSE Leadership Values "
        }
    ]
}