{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/05/19/the-qs-of-quality-research/",
    "title": "The Qs of Quality Research",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities"
    ],
    "pub_date": "2023-05-19T16:54:57+01:00",
    "content": [
        {
            "text": "When looking for or commissioning research it is important to understand the research question, what it is you want to know. A suggested way to do this is to break your research question into basic what, how and why questions."
        },
        {
            "text": "Often the aim of the research you are completing or have commissioned will determine which analytical methods to use. Research methods are often categorised as being either quantitative or qualitative - but what do these terms mean?"
        },
        {
            "text": "Quantitative data involves numerical variables and is typically used during analysis as it can provide clear figures/ statistics that can be used to inform recommendations."
        },
        {
            "text": "Qualitative data involves categorical variables, and the data is usually expressed as an opinion and open-ended questions. Particular attention is paid to the context of the research environment.  For example, how the context of an interview or relationship with interviewer influences data."
        },
        {
            "text": "Whenever possible, quantitative and qualitative analysis can be brought together to get a full picture this is often called mixed methods."
        },
        {
            "text": "Through the, soon-to-be launched, Understanding and Accessing Science and Engineering Advice course, you can learn how to identify quality scientific evidence, and the qualitative and quantitative analysis methods that support cross government policy making."
        },
        {
            "text": "Use the GSE Course Registration form to register interest in the Understanding and Accessing Science and Engineering Advice course. If you want to know more about the other GSE course Communicating Science and Engineering Advice, check out our previous blog post and Learn new skills by signing up to GSE Science and Engineering courses."
        }
    ]
}