{
    "url": "https://defradigital.blog.gov.uk/2023/05/19/why-travel-is-my-way-to-wellbeing/",
    "title": "Why travel is my way to wellbeing",
    "authors": [
        "Kata Papunen"
    ],
    "categories": [
        "Smarter working"
    ],
    "pub_date": "2023-05-19T09:34:06+01:00",
    "content": [
        {
            "text": "Senior Service Management Office Manager Kata Papunen reflects on how much a recent extended travel break has done wonders for her mental wellbeing."
        },
        {
            "text": "One of the 5 Ways to Wellbeing is to get active, with walking and getting out and about as examples of how physical activity can help many of us to maintain a more positive mental health. I’m a keen hiker and walker and spending time outdoors is my #1 way of looking after myself."
        },
        {
            "text": "Earlier this year, I took this to new levels by packing my bag and headed to New Zealand, Australia and Singapore for a 10-week adventure! I absolutely loved exploring new places, meeting new people and making more memories whilst taking a break from the status quo."
        },
        {
            "heading": 2,
            "text": "Work can play such a big part in wellbeing"
        },
        {
            "text": "Taking such a break from work might sound like an extreme approach to looking after oneself but it wouldn’t have been possible without the option of taking unpaid leave, which Defra offers its employees."
        },
        {
            "text": "I wrote last year about the importance of workplace wellbeing, and having a culture of respect, inclusion, and of championing wellbeing. In Defra I’ve felt safe from stigma or discrimination and felt able to say when I’m not feeling OK to colleagues, including senior ones, and actually been supported by many of them, which I’m very grateful for."
        },
        {
            "text": "And after Covid delayed my 2021 travel plans, I was able to save more money, not just for the trip but for this coming summer too, helping to reduce anxiety levels with price increases whilst I was hiking."
        },
        {
            "text": "This year’s Mental Health Awareness Week theme is anxiety. Financial anxiety has risen in the past year. A November 2022 Mental Health Foundation survey found that 34% of UK adults experienced anxiety because of financial worries during the previous month, with more UK adults struggling to pay bills."
        },
        {
            "text": "Defra’s wellbeing support offers a range of financial advice and education, discounts, e-vouchers and much more! I ended up converting a reward I was given into an Airbnb voucher and using that to pay for some of my accommodation."
        },
        {
            "text": "I mostly stayed in hostels, which for me as a solo traveller offered more opportunities to connect with people (connect being one of the 5 Ways to Wellbeing!) and exchange travel tips."
        },
        {
            "heading": 2,
            "text": "Cities, more hikes, and heritage sites"
        },
        {
            "text": "In terms of the places I visited, there are too many to mention! My favourite city in New Zealand was Queenstown, home to extreme sports and surrounded by The Remarkables, the mountain chain that inspired Mordor in Lord of the Rings."
        },
        {
            "text": "Here, I hiked amazing peaks, including Ben Lomond (1748m high) before heading to Lake Tekapo, a stunningly beautiful site which is also a UNESCO Dar Sky Heritage place, and where I saw the Southern Hemisphere Star sky and the Milky Way. I find it hard to put into words just how amazing that was."
        },
        {
            "text": "Other South Island highlights included taking a scenic train from the east to the west coast across Arthur’s Pass National Park, seeing dolphins and fur seals in Milford Sound in Fjordland National Park, and falling in love with Franz Josef. I stayed in one of my favourite hostels, hiked more mountain tracks, searched for glow warms and took a helicopter up to what’s left of the glaciers. An unforgettable experience for sure!"
        },
        {
            "text": "Due to the North Island being hit by flooding and a cyclone, I didn’t see as much as I planned. Nevertheless, I had a fab time including doing the Tongariro Crossing, NZ’s most popular day hike and a stunning 20km-ish hike across volcanic landscape with emerald lakes, amazing views and new friends to share the experience. I also hiked Mount Tarawera, an old volcano on land that has been returned to the local Maori tribe, so the only way to visit it is to book a guided tour with them. A hike of nature providing its best."
        },
        {
            "heading": 2,
            "text": "Making new friends\n"
        },
        {
            "text": "In Australia, I visited Sydney, Tasmania and Melbourne. I enjoyed Sydney even more than I thought I would, but my favourite was Tasmania. Great hikes, big enough hills, amazing food and lovely people. I made new friends too, not only at my hostel but also whilst waiting for my flight to Hobart. Now, Mum might have told me not to talk to strangers but it really is a great way to make friends! I visited Bonorong Wildlife Sanctuary, where I saw a Tasmanian Devil, super cute wombats and fed kangaroos. Would definitely recommend!"
        },
        {
            "text": "Before heading back to Finland to see the family, I stopped in Singapore for a few days. I’d wanted to travel there ever since I did a presentation on it in primary school, and I have friends to visit there as well. Singapore surprised me with how green and non-crowded it felt, not to mention how tasty and surprisingly cheap eating out was."
        },
        {
            "text": "Taking an extended break from work really helped reduce my stress and anxiety levels and gave me time to reflect on things, including my values and how I can look after myself better. Since returning, I have kept the hikes going, even if they are on much flatter surface and slightly shorter. I’m truly grateful I was able to fulfil some of my dreams, experience new adventures, make new friends and memories, and challenge myself."
        },
        {
            "text": " "
        }
    ]
}