{
    "url": "https://gfie.blog.gov.uk/2024/08/13/this-opportunity-set-me-on-a-good-path-to-achieve-further-employment-within-the-public-sector-i-am-confident-it-can-do-the-same-for-others/",
    "title": "This opportunity set me on a good path to achieve further employment within the public sector, I am confident it can do the same for others",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "A Skilled Civil Service",
        "Autism",
        "build capability",
        "Life Chances",
        "Neurodiversity"
    ],
    "pub_date": "2024-08-13T14:30:39+01:00",
    "content": [
        {
            "text": "The Civil Service has 20 Going Forward into Employment (GFiE) Life Chance Schemes currently in operation across Government, using innovative approaches to recruitment and providing Individuals from a wide range of backgrounds, who face barriers to employment, with opportunities and experience."
        },
        {
            "text": "In this blog edition, we introduce you to our latest scheme the GFiE Scheme for Autistic People."
        },
        {
            "heading": 2,
            "text": "What is the GFiE Scheme for Autistic People?"
        },
        {
            "text": "The GFiE Scheme for Autistic People is a pilot scheme offering employment opportunities across the civil service, working with the Civil Service Autism Exchange Internship Programme (AEIP) to bring brilliant new voices into the Civil Service."
        },
        {
            "heading": 3,
            "text": "How does the scheme work?"
        },
        {
            "text": "Following a period of paid work experience in the Civil Service through AEIP and if a hosting department has available roles,  Interns may be offered a temporary fixed term appointment for up to 24 months, with a possibility of permanent employment from 12 months through the GFiE Scheme for Autistic People."
        },
        {
            "text": "Where hosting departments do not have available roles to offer Interns after completion of the work experience placement,  Interns can express an interest to the GFiE team, to have their details added to the GFiE Scheme for Autistic People candidate bank, and where departments have a vacancy and choose to offer a role via the GFiE Scheme for Autistic People,  Interns will then be notified of the vacancy and provided the opportunity to declare an interest in the role."
        },
        {
            "heading": 3,
            "text": "Eligibility Criteria"
        },
        {
            "text": "This pilot is currently only available to individuals who have completed work experience placements via the Civil Service Autism Exchange Internship programme."
        },
        {
            "heading": 3,
            "text": "How can Civil Service departments get involved?"
        },
        {
            "text": "We currently have individuals across the country that have expressed an interest in pursuing a role in the civil service following completion of the Autism Exchange Internship. We are now seeking vacancies to match these individuals with ,so if you are a Civil Service department and would like to discuss providing life changing roles to individuals through use of this scheme for live vacancies or any vacancies you have coming up, please do get in contact with the GfiE Team at GFiE@cabinetoffice.gov.uk."
        },
        {
            "heading": 3,
            "text": "What do the Interns think about their time in the Civil Service"
        },
        {
            "text": "Some of the candidates from this years Autism Exchange share their experience of their work placement in the Civil Service. Following successful placements, individuals are already receiving job offers from Departments via the GFiE Scheme for Autistic People:"
        }
    ]
}