{
    "url": "https://prisonjobs.blog.gov.uk/2024/08/13/training-to-be-a-programme-facilitator/",
    "title": "Training to be a Programme Facilitator",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2024-08-13T11:53:36+01:00",
    "content": [
        {
            "text": "The programme facilitator role involves working with groups of offenders who are completing mandatory courses as part of their probation conditions. We spoke with two programme facilitators, Simone and Craig who bring different experiences of the role. Simone joined the Probation Service two years ago and came from a criminal justice background, having previously worked in the Prison Service. Craig has worked in the role for seven years and brought his experience of working with students with behavioural difficulties. From initial training to the nuances of working with diverse groups, Simone and Craig give us an insight into being a programme facilitator and how they can help change offending behaviours.  "
        },
        {
            "text": " How did you come to the role? "
        },
        {
            "text": " Craig: I was working with “NEET” students, which stands for Not in Employment, Education or Training. A lot of them had conditions such as ADHD.  I supported them in developing personal goals and helped them to try and think differently in certain situations. I enjoyed that kind of coaching element of the role and that was a good crossover into the programme facilitator role. "
        },
        {
            "text": " Simone: I was a prison officer for two years before doing this. So, a very different role, but I had the chance to talk to people a lot. I could be on a night shift and would talk to offenders about what they were going through and what had led them to make certain decisions. I was trying to make a difference and trying to support people through making different decisions and I can really put this into practice in my current job.   "
        },
        {
            "text": " What does the training side of the role entail?  "
        },
        {
            "text": " Simone: Firstly, you undergo core skills training which helps you develop the essential skills for the job. This training focuses on asking questions, professional curiosity, and how you can engage with a room of people and encourage productive conversations.   "
        },
        {
            "text": "Craig:  We start with core skills training. It’s quite intense, with a lot of information to absorb. Coming from a college background, I thought it would be easy, but it was more challenging and in-depth than I anticipated. However, it’s incredibly worthwhile. After core skills training, we have a separate five-day training for each accredited programme we deliver. "
        },
        {
            "text": " What are the accredited programmes you deliver and what do they involve?  "
        },
        {
            "text": "Simone: I deliver programmes like BBR (Building Better Relationships) and TSP (Thinking Skills Programme). BBR is offered to people convicted of domestic violence. The programme aims to help offenders gain a better understanding of the impact of their behaviour and promotes techniques of emotional self-control. The programme runs for 30 sessions, including both group and one-to-one sessions. TSP is geared towards general offending behaviours, covering self-management, problem-solving, and social interactions. Offenders will learn to develop skills like emotional control and assessment of positive and negative influences in their lives. TSP runs for 19 sessions with groups of up to 12 people.  "
        },
        {
            "text": "How did you find transitioning from the training to delivering the programmes?  "
        },
        {
            "text": "Craig: Transitioning from training to delivering the programmes was quite challenging initially but working in pairs meant I had the support and collaboration of a more experienced facilitator during sessions. This not only helped in understanding the practical aspects of delivering the programmes but also in building rapport within our team. The core skills training laid a strong foundation by teaching us essential techniques like motivational interviewing. These skills are crucial in engaging participants and steering conversations towards productive outcomes. We have one-to-one meetings with each offender before they start a programme to develop conditions of success, creating an environment where everyone is open, honest, and willing to learn. "
        },
        {
            "text": "What makes a good programme session for you?  "
        },
        {
            "text": "Simone: Regardless of the programme, a good session is when you can see offenders processing the information and hear them relate it to their own experiences.  "
        },
        {
            "text": "Craig: Sometimes you see that light bulb moment in a session where a participant has realised “that is maybe where I've made a mistake” or “that's what I could have done differently” To have that moment and for them to identify what they could do differently, it's really rewarding."
        },
        {
            "text": "Would you recommend the role? "
        },
        {
            "text": "Craig: I know I'm biased, but I think it's the best job in probation. We get the chance to work with people for an intense period of time and see that change and have that time with them."
        },
        {
            "text": "If you're looking to make a difference, consider our programme facilitator roles. You'll have the opportunity to develop your skills, undergo specialised training, and experience the impact of your work first-hand. Start your application now."
        }
    ]
}