{
    "url": "https://ruralpayments.blog.gov.uk/2024/08/13/understanding-the-sustainable-farming-incentive-2023-annual-declaration/",
    "title": "Understanding the Sustainable Farming Incentive 2023 Annual Declaration ",
    "authors": [
        "Rural Payments Agency"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-08-13T14:16:47+01:00",
    "content": [
        {
            "text": "As the year progresses, we are reminding Sustainable Farming Incentive (SFI) agreement holders to submit their annual declaration.  "
        },
        {
            "text": "What is the Annual Declaration? "
        },
        {
            "text": "The annual declaration is how SFI agreement holders confirm that they have delivered against their agreement for that year. It is an important part of receiving the final payment for the agreement year. Section 5.2.4 of the Sustainable Farming Incentive (SFI) Handbook for the SFI 2023 offer (publishing.service.gov.uk) covers information on the Annual Declaration. "
        },
        {
            "text": "Submission Timeline and steps "
        },
        {
            "text": "Each SFI agreement spans three years, with agreement holders required to submit an annual declaration during the last two months of each relevant agreement year.  "
        },
        {
            "text": "The timing for the declaration depends on the start date of your SFI agreement, and RPA will notify agreement holders when the submission period opens. "
        },
        {
            "text": "Here is a summary of the steps for submission: "
        },
        {
            "text": "Importance of Timely Submission "
        },
        {
            "text": "It is important to submit your annual declaration within the designated period to receive the final quarterly instalment of your annual payment. The annual declaration process is to be conducted online via the Rural Payments service, making it accessible and straightforward for all agreement holders. "
        },
        {
            "text": "Key Dates for Annual Declaration Submission "
        },
        {
            "text": "To assist SFI agreement holders, we have outlined the opening and closing dates for the annual declaration submission based on the start date of the agreement: "
        },
        {
            "text": "We encourage all SFI agreement holders to mark the relevant dates in your calendar and complete your declaration promptly to avoid any disruptions in payment. "
        },
        {
            "text": "For any assistance or questions regarding the annual declaration process, please contact the Rural Payments service.  "
        }
    ]
}