{
    "url": "https://movingon.blog.gov.uk/2024/08/13/what-were-working-on-improving-our-digital-services/",
    "title": "What we're working on: improving our digital services",
    "authors": [
        "Gordon Thomson"
    ],
    "categories": [
        "Vehicle testing"
    ],
    "pub_date": "2024-08-13T15:42:34+01:00",
    "content": [
        {
            "text": "In this blog post, I wanted to explain the work we’re doing at the minute to improve our digital services and when you might start to see some of that."
        },
        {
            "text": "It’s really important that we offer a modern and efficient service to our customers within vehicle testing. Recently we’ve spent a lot of time improving the digital processes and services for operators and ATFs, building the MYVT (manage your vehicle testing) service that allows them to better manage their transactions with us. Now MYVT is up and running, we want to use it to improve more of our processes."
        },
        {
            "heading": 2,
            "text": "Replacing the TAS (technical application service)"
        },
        {
            "text": "Currently, if you want to apply for an approvals or technical test, you must use the technical application service (TAS). TAS is used to apply for things like:"
        },
        {
            "text": "We know from customer feedback that this service can be complicated to use. It also doesn’t allow all customers to make their payments and bookings digitally without the help of the Customer Service Centre in Swansea."
        },
        {
            "text": "So as part of a wider project, called approvals transformation implementation or ATI, we’re looking at how we can make this easier for customers by improving and streamlining the service for technical tests. Moving to my MYVT will also give customers a better view of their transactions with us."
        },
        {
            "heading": 2,
            "text": "Who this change will affect"
        },
        {
            "text": "We’ll be migrating customers who already have a pre-funded account and are already using MYVT for other business, first. We’ll be contacting customers soon who will be affected by this change, explaining how they can apply for their technical tests through MYVT."
        },
        {
            "text": "Once we’ve moved everyone with a pre-funded account, we will migrate people who don’t have an account onto the service. We hope that by the end of the year most of our customers will be able to apply for their technical tests using MYVT."
        },
        {
            "heading": 2,
            "text": "Adding to MYVT"
        },
        {
            "text": "Once we have moved everyone over to MYVT, we will continue to make improvements to what we offer."
        },
        {
            "text": "We will continue to simplify the application process, making it more intuitive for customers and easier to apply for these tests. Customers will be able to track their applications using MYVT and we are also considering the potential to book some of these tests, such as individual vehicle approval, online."
        },
        {
            "heading": 2,
            "text": "Digitising plating certificates"
        },
        {
            "text": "Another digital improvement we’re working on is around plating certificates. In March 2023, we started the process to make heavy vehicle plating certificates available digitally by emailing operators their first and replacement plating certificates instead of posting."
        },
        {
            "text": "We’re now working on some changes to allow heavy vehicle operators to access their plating certificates through the MOT history service."
        },
        {
            "heading": 2,
            "text": "Why we’re making the change"
        },
        {
            "text": "This change will make it easier for operators to access their plating certificates, especially if their certificate is lost, misplaced, or damaged. Not only will this make the whole process more efficient, but it will also save operators money, as plates can be printed from the MOT History Service, so there will be no need to pay for a replacement plating certificate."
        },
        {
            "text": "We’re in the process of making this available and will update you when you’re able to view your certificate online."
        },
        {
            "text": "We’ll keep you updated over the next few months as both of these projects progress. If you have any questions, please let me know in the comments."
        }
    ]
}