{
    "url": "https://educationhub.blog.gov.uk/2022/06/what-you-need-to-know-about-plan-2-student-loan-repayments/",
    "title": "What you need to know about Plan 2 student loan repayments",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Students",
        "Universities"
    ],
    "pub_date": "2022-06-11T00:10:48+01:00",
    "content": [
        {
            "text": "*This post was updated on 10 August 2022 to reflect the announcement that student loan interest rates for current borrowers will be capped to protect them from a rise in inflation. "
        },
        {
            "text": "Here's what you need to know about student loan interest rates."
        },
        {
            "heading": 3,
            "text": "What have you announced?"
        },
        {
            "text": "Student loan interest rates will now be capped at 6.3%, rather than 7.3%, from 1 September 2022 to 30 November 2022 – this will protect student loan borrowers from rising inflation rates."
        },
        {
            "text": "We intervened in June to protect borrowers in response to the rise in the rate of RPI due to global economic pressures which meant student loan borrowers would have faced a 12% interest rate in September."
        },
        {
            "text": "The rate will be capped at 7.3% from 1 December 2022 unless the Prevailing Market Rate (PMR) remains below this level."
        },
        {
            "heading": 3,
            "text": "Who will this cut benefit?"
        },
        {
            "text": "This further cut will provide reassurance for student loan borrowers on Plan 2 (undergraduate) and Plan 3 (Postgraduate) loans."
        },
        {
            "heading": 3,
            "text": "So what is a Plan 2 and Plan 3 student loan?"
        },
        {
            "text": "Plan 2 student loans includes anyone who took out a student loan for an undergraduate, Level 4/5, and/or PGCE course beginning on or after 1 September 2012, as well as Advanced Learner Loan borrowers. More details of the student loan plans can be found here: Repaying your student loan: Which repayment plan you're on - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Plan 3 loans are postgraduate loans."
        },
        {
            "heading": 3,
            "text": "What is the Retail Price Index (RPI)?"
        },
        {
            "text": "The RPI is a measure of inflation produced by the UK's Office for National Statistics. The RPI has always been used for calculating interest on student loans."
        },
        {
            "heading": 3,
            "text": "How will the RPI announcement affect student loan interest rates?"
        },
        {
            "text": "The RPI is the measure of inflation that is used for calculating interest on student loans."
        },
        {
            "text": "March’s RPI figure is used to set the interest rate for Plan 2 loan repayments from September 2022 onwards."
        },
        {
            "text": "The interest rate on student loans has no impact on monthly repayments. These will not increase for students. Repayments are linked to income, not interest rates."
        },
        {
            "text": "The new interest rate is applied from September and to protect borrowers the Government, by law, must cap maximum student loan rates to ensure the interest rate charged on the loan is in line with market rates for personal loans."
        },
        {
            "text": "The Government has announced that – from September 2022 to end November 2022 the maximum Plan 2 and Plan 3 interest rates will be 6.3%. The rate will be 7.3% from 1 December 2022 unless PMR remains below this level."
        },
        {
            "heading": 3,
            "text": "Will this change in RPI make paying off my student loan unaffordable?"
        },
        {
            "text": "No. Monthly repayments for student loans are linked to income rather than interest rates or the amounts borrowed."
        },
        {
            "text": "Student loans are different to personal loans and an increase in student loan interest rates will not increase monthly student loan repayments."
        },
        {
            "text": "Interest rates only affect lifetime repayments for those who will repay their loans in full (or who come very close to doing so), principally high earners and/or those with small loan balances. Currently only 23% of borrowers who enter full-time higher education next year are forecast to repay their loans in full"
        },
        {
            "text": "This means that borrowers who earn below the relevant repayment threshold will continue to not have to make any repayments. Any outstanding balance is also written off at the end of the student loan term (or in case of death or disability) at no extra cost to the borrower."
        },
        {
            "text": "The Institute for Fiscal Studies (IFS) has made clear that changes in interest rates have a limited long-term impact on repayments and the Office for Budget Responsibility predicts that RPI will be below 3% in 2024."
        },
        {
            "heading": 3,
            "text": "If I am due to go to university in the next few years, will this change in RPI make it unaffordable?"
        },
        {
            "text": "No. It is important to be clear that student loans are not like commercial loans – repayments will be paused if you find yourself unemployed or if you salary drops below the threshold."
        },
        {
            "text": "We announced in February that we will be reducing interest rates for new borrowers and so from 2023/24, new graduates will not, in real terms, repay more than they borrow. Alongside our wider reforms, this will help to make sure that students from all walks of life can continue to receive the highest-quality education from our world-leading higher education sector."
        },
        {
            "heading": 3,
            "text": "What are you doing to support students with the cost of living?"
        },
        {
            "text": "We know many students will be worried about the cost of living. We’ve increased the maximum grants and loans available every year so those from the lowest-income backgrounds can now access the largest ever amounts in cash terms, and we are currently looking at options for the following year in 2023/24."
        },
        {
            "text": "The maintenance system isn’t the only way we are supporting students – we’ve asked the Office for Students to protect the £256m in funding which universities can make use of to boost their own hardship funds – so if a student is worried about making ends meet the first thing we’d advise is speaking to their university to see what support they can access."
        },
        {
            "heading": 3,
            "text": "Ok but inflation rates are going up – how will you protect borrowers?"
        },
        {
            "text": "Student loan interest rates for current borrowers will be capped to protect them from a rise in inflation. The government has stepped in to ensure that from September 2022 to end November 2022 borrowers face a maximum interest rate of 6.3% rather than 12%, after a rise in the rate of RPI."
        },
        {
            "text": "The interest rate on student loans has no impact on monthly repayments. These will not increase for students. Repayments are linked to income, not interest rates."
        },
        {
            "text": "For commercials loans, repayments will stop for any borrowers who earn below the relevant repayment threshold."
        }
    ]
}