{
    "url": "https://companieshouse.blog.gov.uk/2023/08/31/an-introduction-to-community-interest-companies/",
    "title": "An introduction to community interest companies",
    "authors": [
        "Lloyd Edwards - Operational Case Manager, Office of the Regulator of Community Interest Companies"
    ],
    "categories": [
        "Office of the Regulator of Community Interest Companies"
    ],
    "pub_date": "2023-08-31T11:02:16+01:00",
    "content": [
        {
            "text": "In April 2023, I was given the opportunity to work for the Office of the Regulator of Community Interest Companies. At the time, like many, I was not sure what the role of the regulator was."
        },
        {
            "heading": 2,
            "text": "Community interest companies"
        },
        {
            "text": "A community interest company (CIC) is a type of limited company and a social enterprise business model that was established in 2005."
        },
        {
            "text": "CICs are set up to undertake activities for the benefit of the community and not purely for a profit. Returns are permitted but these must be balanced and reasonable. This is to encourage investment in the social enterprise sector while making sure true community benefit is always at the heart of any CIC."
        },
        {
            "text": "We're nearing 30,000 companies on the register, with CICs undertaking a wide range of activities from small local projects to offering multi-million pound health services."
        },
        {
            "heading": 2,
            "text": "What the Office of the Regulator does"
        },
        {
            "text": "We’re a small team of 7 and we’re responsible for deciding whether an organisation is eligible to become, or continue to be, a community interest company."
        },
        {
            "text": "We deal with a variety of workstreams, including:"
        },
        {
            "heading": 2,
            "text": "My role"
        },
        {
            "text": "I’ve been under the wing of my more experienced team mates so far, working through CIC applications to decide if the proposals satisfy the community interest test or not. The test is whether a reasonable person might consider that the company's activities are being carried out for the benefit of the community. This is the bread and butter of our work and the starting block of learning the world of CICs."
        },
        {
            "text": "I’ve been working on conversion applications which are similar to the community interest test, but these are proposals from existing limited companies wishing to become a CIC. I’ve also been examining company resolutions and supporting our customers with email enquiries."
        },
        {
            "text": "I’m really enjoying my role with the team, the work is never the same and it’s providing a great opportunity to widen and develop my skills. Over the next few months, I’ll be working on a project in relation to CIC34 reports and how we can make sure the information being put on the register is reflecting that of the company objectives."
        }
    ]
}