{
    "url": "https://nda.blog.gov.uk/creating-skills-for-the-future-at-the-nda-jacq-longrigg-head-of-leadership-skills-and-talent/",
    "title": "Creating skills for the future at the NDA - Jacq Longrigg, Head of Leadership, Skills, and Talent",
    "authors": [
        "samfrench"
    ],
    "categories": [
        "Skills"
    ],
    "pub_date": "2023-08-31T15:35:43+01:00",
    "content": [
        {
            "text": "Jacq Longrigg, NDA group Head of Leadership, Skills and Talent joined the Nuclear Decommissioning Authority (NDA) in 2018 with an extensive knowledge and experience of the education and skills sector. "
        },
        {
            "text": "Her role includes being the NDA representative on the National Nuclear Skills Task Force,  supporting the development of the agenda of the Nuclear Skills Strategy Group (NSSG), of which the NDA is a lead member organisation and she ensures the NDA is aligned with national programmes such as the Leadership Development, Talent Acquisition and Development, sponsor of the NDA group graduate programme and the sector wide Nuclear Graduates, the apprenticeship levy and school engagement. "
        },
        {
            "text": "Jacq ensures that we have the right skills at the right time to deliver the mission across the NDA group, including early careers, subject matter experts, technical and professional capability, and STEM engagement."
        },
        {
            "text": "The NDA is tasked with decommissioning the UK’s earliest nuclear sites safely, securely, and sustainably. "
        },
        {
            "text": "This September we are taking part in the Nuclear Industry Association’s (NIA) Nuclear Week in Parliament, allowing us to promote the opportunities that nuclear sector presents; to engage with Parliamentarians, bring together key stakeholders and decision-makers and hold productive conversations, to drive forward growth in the UK nuclear industry. We are also sponsoring the skills and apprenticeships fair, allowing us to showcase the talent we are developing right here within the NDA group which is vital to the successful delivery of our mission."
        },
        {
            "text": "It's a mission that is ever expanding, so investing in skills has never been more important; both in supporting the growth of our people and for advancing the UK nuclear industry."
        },
        {
            "text": "In January this year, we launched our new NDA group graduate scheme, offering opportunities from radiological protection advisors and cyber security experts to rail freight operators. It’s been hugely successful and in September we will welcome our biggest graduate intake so far, with aspirations to double this next year and attract an even more diverse range of individuals by partnering with academia – including those outside the traditional Science, Technology, Engineering and Mathematics (STEM) establishments."
        },
        {
            "text": "We have a proven track record in investing in early career development. Thousands of careers have started within our group over several decades, so we really understand the importance of attracting new talent to deliver our complex mission. That’s why each year, we invest over £45 million in apprentice and graduate development, with over 1,000 people currently following our early careers programmes."
        },
        {
            "text": "Decommissioning our sites will take well over a hundred years, hence why it is so important that we attract the next generation, while also investing in and retaining our current workforce. That’s why we’re proactively making strides to ensure we have the correct support in place, for example our women in leadership programme, promoting mobility across our group of companies via secondments, and cross group mentoring schemes, which not only allow sharing of best practice, but continue to foster a culture of collaboration within our group."
        },
        {
            "text": "We’re also playing our part in addressing national acute skills shortages, such as in areas like project management and cyber. We’re developing a strategic workforce plan, supporting the development of the NDA group Industrial Cyberspace Centre, and collaborating with the Nuclear Skills Strategy Group (NSSG) on attracting the next generation of talent into nuclear, through projects like Developing Experts, a digital learning platform for schools linking the science curriculum with the STEM workplace."
        },
        {
            "text": "The success of our nuclear clean up mission is delivered by over 17,000 people within the NDA group working in and on our 17 sites across the UK, covering over 900 different roles. Additionally, we have over 5,000 organisations in our supply chain, therefore it's not just the economic contribution we are making not just across the country that is vast, it’s the employment and opportunities as well."
        },
        {
            "text": "There really has never been a more exciting time to be within the NDA group, being a part of our long-term mission, being exposed to so many possibilities and helping us drive change to ensure a long lasting and meaningful career."
        },
        {
            "text": "If you’re interested in a career with us you can visit our website to find out more Working for NDA - Nuclear Decommissioning Authority - GOV.UK (www.gov.uk)."
        }
    ]
}