{
    "url": "https://digitaltrade.blog.gov.uk/2023/08/31/introducing-students-to-a-career-in-digital-data-and-technology/",
    "title": "Introducing students to a career in Digital, Data and Technology",
    "authors": [
        "Kelly Voysey, Product Adoption Manager",
        "Joanne Granton, Capability Lead",
        "Andy Palmer, Workforce Planning and Capability Manager"
    ],
    "categories": [
        "People",
        "Professions"
    ],
    "pub_date": "2023-08-31T14:32:40+01:00",
    "content": [
        {
            "text": "Hundreds of thousands of students have received their exam results this month, an important life stage which marks the beginning of a career journey. Ensuring that students are equipped with knowledge of ‘what exists out there’ as a career choice is an important part of the journey. It benefits future employees and employers. This Summer, the Digital, Data and Technology (DDaT) team were delighted to play their part in highlighting what a career in the Department for Business and Trade(DBT), and in particular DDaT, might look like for A level students at Exeter College in the South West.  "
        },
        {
            "text": "The team joined other government departments including Ministry of Justice, UK Home Office, Rural Payments Agency and Department for Work and Pensions who presented sessions as part of a Hidden Careers Event. The event took was organised by One South West, a community of civil servants across the South West of England. The day involved talks, activities and Q and As with students and lecturers. "
        },
        {
            "text": "The DDaT team consisted of regionally based colleagues from a variety of professions: Jo Granton (Capability Lead), Stephen Corder (Senior Product Manager in Tariff Management Tool), Matt Jukes (Head of Product) and Kelly Voysey (Product Adoption Manager).  "
        },
        {
            "text": "Jo introduced DDaT and the role it plays in providing digital, data, user-centered design and technology to enable DBT’s mission to facilitate UK trade and investment and ensure businesses thrive. She spoke about the range of routes into DDaT and the types of apprenticeships offered. "
        },
        {
            "text": " "
        },
        {
            "text": "Stephen and Matt delved into the breadth of roles found in DDaT and explained how it functions to enable DBT. Matt encouraged students to think about their personal interests and strengths if they were to consider a DDaT career. He advised that they focus on what they love and their personal strengths rather than technical qualifications, and told the students that there are many opportunities to flourish in DBT’s DDaT.  "
        },
        {
            "text": "The students were then given a ‘day in the life’ of a Product Manager by Stephen. He talked about his route into DBT through the Civil Service Fast Stream and his team's role in supporting DBT to manage the UK Global Tariff. They use software applications which interact with the UK’s border systems. The sessions were rounded off by Kelly who challenged the students to an export quiz. Each team had to use the DDaT managed website Great.gov.uk to find essential information about different export destinations.  "
        },
        {
            "text": "Jo Granton is also a member of the One South West Talent team. She works strategically to promote and support a wide range of talent schemes across government. One such scheme is the DBT’s Software Developer Apprenticeship. It has 2 cohorts each year and gives apprentices the chance to join the Makers Academy which includes a bootcamp and hands on experience in our DDaT team, combining learning and real world experience. "
        },
        {
            "text": "Jo commented, “We are delighted with the work our partners at Makers have done. We are already in the process of recruiting another round of apprentices and seek to expand into other useful and appropriate programmes. I am passionate about my work with One South West and I jumped at the chance to work on this project with them and Exeter College. DBT have a Cardiff hub which is great location for South West-based staff” "
        },
        {
            "text": "Andy Palmer, Capability and Workforce Planning Manager, at DDaT also mentions the importance of these outreach events in the wider recruitment picture. He highlights how recruitment for DDaT roles can be challenging, with competition from the private sector being fierce. This means DDaT are always looking for ways to develop homegrown talent. Andy explains “We know that apprenticeships are an excellent source of undiscovered talent, and interest in them has grown substantially. We are hearing from younger people joining the workforce for the first time, and from more experienced people looking to change careers, or seeking to gain accreditation in their professions”. "
        },
        {
            "text": "The event organiser James Holton, Home Office Social Mobility Outreach Lead and Senior Responsible Officer commented on the day. “As head of the One South West Talent strand I reached out to Exeter College some time ago to organise an outreach event. Ed Sweatman, their head of Careers, was keen to deliver a ‘Hidden Careers’ event to talk about parts of the Civil Service that students were perhaps less aware of as career routes. The day was a huge success with DBT and the Rural Payments Agency focusing on digital career opportunities in particular. This is the first time that One South West have delivered such a session. We hope to expand our outreach offer across the region over the next 12 months.” "
        },
        {
            "text": "Summarising the day, Kelly Voysey said, “I was really impressed with the students’ focus during our sessions and with DDaT’s enthusiasm for supporting this event happening in my home city. We worked as a South West team to ensure our sessions were as informative as possible. My own teenagers are about to start their career journey, so I understand how much it means to young people when employers engage and offer advice and support”.  "
        },
        {
            "text": "Read more information about apprenticeships in government. "
        },
        {
            "text": " "
        }
    ]
}