{
    "url": "https://defrafarming.blog.gov.uk/2023/08/31/nature-can-sit-alongside-agriculture-a-landscape-recovery-project-spotlight/",
    "title": "'Nature can sit alongside agriculture': a Landscape Recovery project spotlight",
    "authors": [
        "The Team",
        "Graham Higgins"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-08-31T12:38:33+01:00",
    "content": [
        {
            "text": "North Norfolk: Wilder, Wetter, Better for Nature is a first round Landscape Recovery project."
        },
        {
            "text": "Alongside supporting sustainable food production, the project aims to create new habitats for nature, restore rivers and boost biodiversity on the Holkham Estate."
        },
        {
            "text": "In this video, project members talk more about how their plans will work in practice."
        },
        {
            "heading": 2,
            "text": "The second round of Landscape Recovery"
        },
        {
            "text": "The second round of Landscape Recovery focuses on projects of at least 500 hectares."
        },
        {
            "text": "This could include landscape-scale projects creating and enhancing woodland including temperate rainforest, peatland, nature reserves and protected sites such as ancient woodlands, wetlands and salt marshes."
        },
        {
            "text": "We look forward to supporting up to 25 projects in this round — there's still time to apply."
        },
        {
            "text": "Applicant guidance can be found on GOV.UK."
        },
        {
            "text": "The deadline is midday, 21 September."
        },
        {
            "heading": 2,
            "text": "Upcoming webinars"
        },
        {
            "heading": 3,
            "text": "Learn more about Atamis"
        },
        {
            "text": "In this webinar, we'll talk through Atamis, the online portal through which applications are submitted. There will also be an opportunity to ask the team questions."
        },
        {
            "text": "The hour-long session will begin at 10am on Tuesday 5 September."
        },
        {
            "text": "Register to attend the webinar."
        },
        {
            "heading": 3,
            "text": "Learn more about funding for farmers"
        },
        {
            "text": "In this webinar for farmers, policy leads will explain the Landscape Recovery offer alongside the Sustainable Farming Incentive and the Farming Equipment and Technology Fund. You'll be able to put your questions to the team."
        },
        {
            "text": "The hour-long session will begin at 11:30am on Wednesday 6 September."
        },
        {
            "text": "Register to attend the webinar."
        }
    ]
}