{
    "url": "https://ofsi.blog.gov.uk/2023/08/31/ofsi-uses-disclosure-power-for-first-time/",
    "title": "OFSI uses disclosure power for first time",
    "authors": [
        "Giles Thomson"
    ],
    "categories": [
        "Compliance",
        "Financial Sanctions",
        "Implementation"
    ],
    "pub_date": "2023-08-31T11:00:02+01:00",
    "content": [
        {
            "text": "The critical role that financial sanctions have played in the international coalition’s response to Russia’s invasion of Ukraine has further demonstrated what a crucially important tool they are for the UK to protect its national security and financial integrity. As threats to our values and freedoms remain constant, it is more important than ever that we are effectively implementing and enforcing financial sanctions. "
        },
        {
            "text": "The private sector, as the first line of defence, play a critical role in the effective implementation of financial sanctions. The Office of Financial Sanctions Implementation (OFSI)’s primary objectives are to help the private sector understand and effectively implement sanctions, to prevent illicit finance entering the UK’s financial system and achieve the security and foreign policy aims of our sanctions at minimal cost to the UK economy and legitimate actors. The vast majority of UK businesses want to comply with financial sanctions and are committed to doing so. However, as with any regulatory system, taking robust but proportionate enforcement action where it is justified is crucial to the effectiveness of our sanctions. It punishes those guilty of the worst breaches of sanctions, acts as a deterrent to them and others, and – through the associated publicity and compliance lessons OFSI produce – helps others understand how they can improve their compliance systems. "
        },
        {
            "text": "As part of our ongoing commitment to strengthening our enforcement regime, on 31 August 2023, OFSI used its new Disclosure enforcement power for the first time. In brief, this power allows OFSI to publish details of financial sanctions breaches - including the person/entity who committed the breaches – where OFSI decides that the breaches are not serious enough to justify a civil monetary penalty. We refer to this publication as a “Disclosure”. OFSI acquired this power last year via the Economic Crime (Transparency and Enforcement) Act 2022, and it forms an important part of our expanded enforcement toolkit.  "
        },
        {
            "text": "Where OFSI decide it is necessary and proportionate to use the disclosure power, OFSI will publish the details of a breach on its GOV.UK website in the form of a notice. Our intention is to use this power in response to moderately severe breaches, when an administrative warning letter would be too lenient on the facts of the case, but a civil monetary penalty would be disproportionately punitive. This is an important step in allowing OFSI to further tailor its enforcement action according to the different severities of breaches it sees. Through publishing details of breaches, this new enforcement tool will act as a form of censure and deterrent while also enabling compliance lessons to be available to other companies and individuals. "
        },
        {
            "text": "In OFSI’s first published Disclosure, important compliance lessons can be learnt to ensure that companies and individuals do not make funds available to designated persons or entities owned or controlled by designated persons. The company’s policy at the time of the breach (of not restricting debit cards where a possible name match to a designated person was identified) was inappropriate for managing sanctions risk. A lack of resource at weekends to review sanctions alerts also led to a material delay in the proper restrictions being placed on a designated person’s debit card. This case demonstrates that firms should carefully consider what resourcing is appropriate to manage sanctions risk exposure. When a firm identifies a sanctions risk, it should take steps to fully address that risk by promptly restricting all forms of access to funds or economic resources. Firms should also maintain proportionate sanctions screening and alert review functions whenever business is being conducted. "
        },
        {
            "text": "As well as making a disclosure on a specific case, OFSI has today also published updated guidance with further information on how we intend to use this power and the different steps in that process. Following these events, I encourage those involved in sanctions compliance to read Chapter 10 of our updated Monetary Penalty and Enforcement Guidance, as well as the first Disclosure Notice."
        },
        {
            "text": "You will also see in our updated guidance that we have provided more detail on how OFSI categorises breaches (as lesser severity, moderate severity or serious enough to justify a civil monetary penalty) when determining what enforcement outcome is most appropriate. This updated guidance reinforces OFSI’s commitment to taking proportionate action that considers the facts of each case. Although in this first disclosure case we determined that full use of the power to name the firm involved was proportionate to the breach, OFSI can also use its disclosure power for breaches of lesser severity to publish details of case where there is a useful compliance lesson to industry. In those cases, OFSI will usually anonymise the publication by not identifying who performed the breach.  "
        },
        {
            "text": "As ever, OFSI and I welcome your feedback on these or any other issues relating to our implementation of financial sanctions, which you can email to: ofsi@hmtreasury.gov.uk. "
        },
        {
            "text": "I intend that the updated enforcement guidance, this blog, and the Disclosure OFSI has made today, provide clarity to support your continued diligence and efforts to fully comply with the regulations.  "
        },
        {
            "text": "  "
        },
        {
            "text": "Giles Thomson "
        },
        {
            "text": "Director, Office of Financial Sanctions Implementation and Economic Crime "
        },
        {
            "text": "HM Treasury "
        }
    ]
}