{
    "url": "https://ssac.blog.gov.uk/2023/08/31/the-social-security-advisory-committee-is-so-important-to-us-all/",
    "title": "The Social Security Advisory Committee is so important to us all",
    "authors": [
        "Seyi Obakin"
    ],
    "categories": [
        "About the Committee",
        "social security"
    ],
    "pub_date": "2023-08-31T11:17:02+01:00",
    "content": [
        {
            "text": "When I was first approached to consider applying for a place on the Social Security Advisory Committee (SSAC), I had never even heard of it. Nonetheless, I quickly found myself wanting to know more because of my practical experience of social security through my role as Chief Executive of Centrepoint, the UK’s leading youth homelessness charity."
        },
        {
            "text": "Now, after nine years, I step down convinced that SSAC is perhaps one of the most important unheralded groups in the UK – a remarkably high bar indeed. There are several reasons why I believe that SSAC is so important, and they all track back to one question: what is the point of social security?"
        },
        {
            "text": "First, the ebb and flow of life means that many of us will interact with social security at some point in our lives. There are several triggers for this, many of which are beyond an individual’s control. For example, one could be involved in a debilitating accident or face periods of unemployment; have to fund childcare; deal with the fallout of a bereavement; have to provide caring duties; suffer from ill-health; become disabled; and so on. These are all issues for which support from the rest of society through the state would go a long way."
        },
        {
            "text": "Second is the other side of the first. Society functions effectively partly because of the implicit agreement that those whose lives are stable and okay have some responsibility to support those who are struggling in some way. An important part of this responsibility is discharged on our behalf by the state through social security, and it enables those who need help to receive it, move on to firmer footing, and return to contributing their quota."
        },
        {
            "text": "Third, our demography is changing. Ethnic diversity, cohabitation, separation and divorce, blended families, ageing, dwindling extended family support, and so on are all changing the shape of family life. It is important that we respond to this changing shape and social security has a significant part to play in that."
        },
        {
            "text": "Fourth, we know that work can play a key role in an individual’s overall wellbeing. Therefore, it is important to ensure that those who can work are empathetically enabled and supported to do so but that alone is not enough. It is equally important to ensure that people are always better off in work (which sadly is still not entirely the case); that those in work earn sufficient wages to live reasonably without dependence on others; and that they progress in their career journeys. Social security has a critical role to play in this too."
        },
        {
            "text": "Fifth, since social security is administered on behalf of society, it is important to ensure we keep striking the right balance between providing an effective safety net for people who need it and ‘value for money’ for taxpayers."
        },
        {
            "text": "These are just five of the several issues that are embedded in social security and on which SSAC plays a critical role, firstly to advise the government on draft regulations and emerging issues, and secondly to consider the detail of how social security is delivered to those who need it."
        },
        {
            "text": "Scrutinising the details of regulations in order to advise the Secretary of State is a terribly important duty. It means looking at practical implications, potential unintended consequences, consistency with parliament’s policy intentions, as well as potential ‘winners’ and ‘losers’ and how best to respond to them."
        },
        {
            "text": "SSAC is uniquely placed to do this work well because it is a broad church of experts who are dedicated to improving how the social security system works and are supported by a formidably effective secretariat. Around the Committee table, there is an unusual combination of policy experts, practitioners, academics, researchers, legal minds, and so on. This level of diversity brings with it a mix of experience, knowledge, skill, and therefore thought that enables SSAC collectively to see issues fully in the round. I believe that is hugely important in a society which is as multicultural and diverse as ours and is evolving. You can see the Committee’s reports on SSAC’s website."
        },
        {
            "text": "Furthermore, SSAC is unique in having the independence that allows it to be trusted both as a critical adviser to the Secretary of State and as an important voice for many stakeholders. This is no mean feat, but it is achieved because the Committee guards its independence jealously; sticks to its impartial role with integrity; and approaches all parties with humility. Members may come at issues from different angles but there is huge respect for each opinion and experience. They are united in the conviction that the social security system makes a tangible positive difference in people’s lives and that, through its contribution, SSAC can help improve that system for claimants, policy makers, taxpayers, and those who administer benefits. It is this conviction that I have found most inspiring and my sole reason for enthusiastically reapplying for my place about halfway through my nine years, when given the opportunity."
        },
        {
            "text": "Reflecting on my time, I was always delighted to visit stakeholders and job centres better to understand how the proverbial rubber is hitting the road. Among several issues I had the opportunity to contribute to, three stood out for me.  I was especially pleased to have led some of the Committee’s work on various aspects of Universal Credit. I was similarly delighted to have been involved in the Committee’s work on how life might be made better for young people living independently, just as I was to be engaged with the work on opportunities to enhance the effectiveness of measures taken to support people through the Covid-19 pandemic."
        },
        {
            "text": "It has been a privilege for me to serve on SSAC. Sometimes it was a joy and sometimes it was frustrating, but always it was inspiring to know that through SSAC, my service was making life better for thousands of people facing tough times. There are not many things one could do that are more rewarding."
        }
    ]
}