{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/08/31/what-were-doing-to-provide-access-to-road-fuel-price-data/",
    "title": "What we’re doing to provide access to road fuel price data",
    "authors": [
        "Daniel Turnbull"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2023-08-31T15:20:06+01:00",
    "content": [
        {
            "text": "We published the final report of our road fuel market study in July. The market study found that competition in the retail sector for petrol and diesel had weakened since 2019, meaning that drivers were paying more for road fuel.  "
        },
        {
            "text": "We made two recommendations to the UK government which have both been accepted:  "
        },
        {
            "text": "We believe that the best chance of positive change will be achieved when a permanent, mandatory and open access fuel finder scheme is put in place. The UK government has already confirmed it will take forward this recommendation. "
        },
        {
            "text": "In the meantime, the government asked the CMA to implement a temporary fuel price data scheme. We’re asking fuel retailers to provide up-to-date price data, which will be available to third-party developers. Consumers will then be able to use apps and websites to find fuel prices in their area. "
        },
        {
            "heading": 2,
            "text": "Launching our temporary fuel prices data scheme"
        },
        {
            "text": "During July and August, the CMA worked with the largest fuel retailers and trade associations – representing a significant proportion of petrol and diesel sold in the UK – on a temporary data scheme.  "
        },
        {
            "text": "While this scheme is a useful first step, it’s important there is a mandatory, permanent scheme in place as soon as possible, so drivers have access to real-time prices from all the fuel stations in the UK. "
        },
        {
            "text": "The permanent scheme will help ensure effective competition, which benefits consumers and businesses. "
        },
        {
            "heading": 2,
            "text": "Who’s providing pricing data"
        },
        {
            "text": "The CMA website lists the retailers who have signed up to the scheme, with links to their pricing data. So far, several major fuel retailers, including Asda, Morrison’s, Sainsbury's and Tesco, have joined. You can see the full list of who has signed up on our website. The fuel retailers that have signed up so far account for approximately 35% of service stations throughout the UK and approximately 60% of the volume of fuel sold. "
        },
        {
            "text": "We're strongly encouraging more retailers to follow suit.   "
        },
        {
            "heading": 2,
            "text": " Find out more about our work on road fuel pricing "
        },
        {
            "text": "You can read more about the scheme on our road fuel price data scheme page. You can also find out more about the market study we completed this summer. "
        }
    ]
}