{
    "url": "https://vmd.blog.gov.uk/2022/06/28/can-i-buy-cbd-oil-cannabidiol-for-my-pet/",
    "title": "Can I buy CBD Oil (cannabidiol) for my pet?",
    "authors": [
        "Barry Haycraft"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2022-06-28T15:27:30+01:00",
    "content": [
        {
            "text": "The short answer is No. Hopefully after reading this article you’ll understand why - but all is not lost, read on and you’ll discover that there is a safer solution!"
        },
        {
            "text": "So why can’t I just use the CBD products authorised for human use?"
        },
        {
            "text": "While CBD products are not authorised in the UK for veterinary use, they are available for use by humans subject to the marketing restrictions imposed by the Medicines and Healthcare products Regulatory Agency (MHRA)."
        },
        {
            "text": "The main consideration for using these products in animals is that while the safe dosage for human use has been assessed and calculated, and the recommended dosage indicated on the product label, the safe dosage for the various species and size of animal has not been determined. You would have to “guesstimate” how much of the product to give to your pet, and hope that in doing so, trust that you are not inadvertently causing them distress or harm."
        },
        {
            "text": "Despite the numerous anecdotal reports of the benefits of using CBD oil in animals, such as its anti-inflammatory and anti-anxiety properties, all medication and supplements carry the risk of a reaction, even when using an authorised product at its recommended dosage. It can also interfere with any other medication currently prescribed."
        },
        {
            "text": "You can report an animal or human unexpected reaction to any medicine to the VMD."
        },
        {
            "text": "What is CBD?"
        },
        {
            "text": "CBD is just one of the many chemical compounds found naturally in the cannabis plant, known collectively as cannabinoids. It does not contain tetrahydrocannabinol (THC), the psychoactive component of cannabis responsible for making users feel \"high.\""
        },
        {
            "text": "There's a common misconception that CBD and medical cannabis are the same thing and that's not the case."
        },
        {
            "text": "Buyer beware!"
        },
        {
            "text": "Although there are many products freely available to buy on the high street or online that claim to be medical cannabis, be mindful that they offer no guarantee of quality, or that they will provide any therapeutic benefits."
        },
        {
            "text": "Some products available to buy over the internet without a prescription may be illegal to possess or supply – for example, if these contain a significant level of the psychoactive cannabinoid THC.  As well as the legal issues, THC can also be toxic to animals."
        },
        {
            "text": "Are there any CBD products that I can safely use to treat  my pet?"
        },
        {
            "text": "The definition of a veterinary medicine is outlined in the Veterinary Medicines Regulations (VMR):"
        },
        {
            "text": "‘any substance or combination of substances that may be used in, or administered to, animals with a view either to restoring, correcting or modifying physiological functions by exerting a pharmacological, immunological or metabolic action, or to making a medical diagnosis.’"
        },
        {
            "text": "Our view is that because of the effects they have, products containing cannabidiol (CBD) should be regulated as veterinary medicines. This means that these products require a marketing authorisation (licence) before they can be sold or supplied in the UK."
        },
        {
            "text": "Currently there are no CBD products authorised in the UK for veterinary use and giving your pet an unauthorised product containing CBD obtained without a veterinary prescription is an offence under Regulation 8 of the VMR."
        },
        {
            "text": "While your pet may possess many human-like qualities, this type of medication could have very different and unwanted effects on them.  If you are thinking of trying CBD oil and your vet considers that a human CBD product could be an appropriate treatment for your pet, they can advise on the specific product to buy and how to do so legally, as well as the correct dosage specific to the type and size of the animal.  They will  also evaluate and highlight any special precautions or potential adverse events for you to consider before going ahead with the treatment."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}