{
    "url": "https://defradigital.blog.gov.uk/2022/06/28/defra-data-heroes-meet-our-digital-first-library-team/",
    "title": "Defra Data Heroes: Meet our ‘digital-first’ library team",
    "authors": [
        "Sonja van Montfort"
    ],
    "categories": [
        "Data Transformation",
        "Defra services",
        "Open data"
    ],
    "pub_date": "2022-06-28T07:30:53+01:00",
    "content": [
        {
            "text": "In the latest instalment from our Defra Data Heroes series, we hear from Sonja van Montfort, Defra’s Head Librarian, about how her team keeps colleagues across the Defra organisations informed through a range of print and online resources, and the vital work the team does to manage a unique library collection."
        },
        {
            "text": "My team provides essential services and resources to enable colleagues across Defra to access the information they need for their work. It’s that simple. Well, almost."
        },
        {
            "text": "Our library is part of a wider team within the Digital, Data and Technology Services function that makes Defra’s data and information accessible to users across Defra, government and beyond. We offer library services to a range of Defra organisations and work with colleagues across the whole Defra group to set library policy."
        },
        {
            "heading": 2,
            "text": "The team"
        },
        {
            "text": "Like all libraries we pride ourselves on delivering an excellent service. We are a team of seven, made up of qualified career librarians and information professionals, with a wide range of experience drawn from a variety of roles in different kinds of libraries. Our library officers are the true stars, dedicated library professionals delivering a great service to our customers."
        },
        {
            "text": "I come from the Netherlands but moved to the UK after I’d completed my master’s degree in Information Management at University of Amsterdam. I made the jump across the Channel to start my career in the private sector in London, before becoming Deputy Head at the Periodicals Department at Cambridge University Library."
        },
        {
            "text": "I started at the APHA library when the organisation was known as the Veterinary Laboratories Agency. Over time, through restructuring programmes, the libraries from NE, APHA and Defra merged, and we transformed and modernised the library services to suit current staff requirements."
        },
        {
            "text": "As well as procuring and managing access to the resources our library staff can provide advice and guidance about a range of topics, such as copyright, alerting services, publishing advice and bibliometrics."
        },
        {
            "heading": 2,
            "text": "Our resources: digital and print"
        },
        {
            "text": "Historically, the library would maintain a print collection, however over the years most of our content has moved to electronic resources and services. This has been accelerated by the pandemic, which improved the IT infrastructure and allowed us to improve access to electronic resources."
        },
        {
            "text": "Today we are almost exclusively ‘digital-first’, with an extensive electronic collection which includes e-books, e-journals, databases of full text peer-reviewed research, abstract and citation databases, and industry standards"
        },
        {
            "text": "We still maintain a small print collection in Weybridge, which mostly consists of publications that are not available elsewhere, not available electronically, or unique as a collection. This collection is searchable via our catalogue."
        },
        {
            "text": "However, although our print collection is the most visible part of the library, it only counts for five to ten per cent of the information resources that we are responsible for; most of our work, and the resources we manage, is digital nowadays."
        },
        {
            "heading": 2,
            "text": "The service – what we do"
        },
        {
            "text": "Day to day, I spend my time ensuring our services and resources meet the requirements of a modern information service for all staff. That means talking to stakeholders in all customer organisations and looking at the strategies and priorities from organisational level to teams and sometimes back to individuals, so that these requirements are reflected in our customer offer."
        },
        {
            "text": "This also means that I spend a lot more time looking at budgets, usage statistics and value for money than I ever envisaged when I started my career in the library world."
        },
        {
            "text": "With the services we provide through using our information skills, we add value to the resources we buy and ensure they are extensively used. I work closely together with information specialists across Defra, but also in the wider government libraries, to share knowledge and encourage collaboration. And very important too, I manage my team, split across Weybridge, Peterborough, and home working."
        },
        {
            "text": "The team handles different types of requests, which vary from access to Farmers Weekly, to helping sort out the copyright on a collaboration with 30 institutions that need to publish an article together. We have extensive knowledge of copyright law, as breaching copyright is not only an offence, but can also cause reputational damage to the organisation."
        },
        {
            "text": "Any documents that we do not have in our collection can be requested from elsewhere and the team prides themselves in providing these articles as quickly as possible, mostly within a day or two. I’m proud to say that the team can fulfil almost all requests, no matter how obscure."
        },
        {
            "text": "We also produce several specialist alerts so colleagues can get the latest, and most relevant, information delivered straight to their inbox."
        },
        {
            "heading": 2,
            "text": "Knowing the value of knowledge"
        },
        {
            "text": "It’s impossible to overstate the value of the knowledge and experience we have within the team.\nWe use this knowledge in two ways."
        },
        {
            "heading": 2,
            "text": "The Future"
        },
        {
            "text": "Following EU Exit government libraries are experiencing a renaissance, demand for resources is growing as departments deliver more policy for the UK."
        },
        {
            "text": "Being part of a data and information team has helped us identify synergies between the traditionally separate Data and Knowledge and Information professions. We are increasingly identifying opportunities to being the skills and experience of our librarians to bear on our collections of data, for example."
        },
        {
            "text": "The future of libraries looks exciting."
        }
    ]
}