{
    "url": "https://digitaltrade.blog.gov.uk/2022/06/28/excel-at-engagement-and-events-in-the-post-pandemic-world/",
    "title": "Excel at engagement and events in the post-pandemic world",
    "authors": [
        "Natalia Rowles, Product Engagement Manager",
        "Hannah Horn, Senior Engagement and Strategic Adoption Manager"
    ],
    "categories": [
        "Culture",
        "Diversity and Inclusion",
        "People and Skills"
    ],
    "pub_date": "2022-06-28T11:50:25+01:00",
    "content": [
        {
            "text": "Digital, Data and Technology (DDaT) Week 2022 was a new initiative from the DDaT team held from 25 to 29 April. We wanted to highlight DDaT’s work, promote our ways of working and encourage collaboration across the Department for International Trade (DIT)."
        },
        {
            "text": "Across the week, the DDaT team hosted over 30 events attended by around 1200 DIT colleagues. We held hybrid, in-person drop-ins and online-only sessions to connect colleagues across DIT in our Old Admiralty Building (OAB), Darlington, regional offices and at home. DDaT Week was the first large-scale, hybrid event of its kind for DIT in the post-pandemic world."
        },
        {
            "text": "After the event we shared tips, tricks, resources and lessons learnt to help colleagues across the department deliver their own successful all-staff engagement events. Now we’re sharing them with you, too!"
        },
        {
            "heading": 2,
            "text": "Putting hybrid ways of working to the test"
        },
        {
            "text": "In DIT DDaT, we are passionate about making hybrid working work for our colleagues. So, we made sure that our DDaT Week events were a mixture of hybrid, in-person only and online only to be inclusive of everyone. We asked our DDaT colleagues to add their event ideas and scheduling information to a central document and schedule. This meant we could maintain oversight and ensure a balance of hybrid, in-person and online sessions, avoid duplication of topics and minimise time clashes. It also meant that we could ensure every team and portfolio in DDaT would be represented during the event."
        },
        {
            "text": "We hosted a packed schedule of events across DDaT teams. We kicked off the week with a career panel led by Jason Kitcat, our DDaT Director. This took inspiration from our previous blog about making a career change into DDaT and was one of the most popular events from the week."
        },
        {
            "text": "Our Cyber Security team held various tips and tricks sessions from passwords to cloud security. The Data Workspace team held in-person surgeries each day of the week and ran their Data Workspace Challenge, sparking the interest of DIT colleagues around the globe who participated. We also held sessions on how to learn Python, Microsoft Teams tips and tricks, live product demonstrations, content design clinics and how to apply for a job in DDaT. The creativity and passion of our DDaT team shone through."
        },
        {
            "text": "For hybrid and in-person events, we booked an events space in OAB and designed a DDaT Week banner for OAB and Darlington to increase footfall. We collaborated with our DDaT colleagues in the Audio-Visual (AV) team to organise the display and sound set-up for the week. Our Facilities team perfected our event space layout and helped us to promote DDaT Week by positioning signage near the office entrances."
        },
        {
            "heading": 2,
            "text": "Taking DDaT Week to Darlington"
        },
        {
            "text": "DDaT Week took place in our Darlington office, too. An identical banner was sent to the team and displayed in the Collaborate space. Volunteers from the DDaT team based in Darlington were stationed at the banner and experienced some great engagement with DIT colleagues. Questions were asked about recruitment outside London, support with automating data and more."
        },
        {
            "text": "Our Head of Business Operations, Ann Hughes (pictured above), travelled from London to support her team members in Darlington for two days of the week. It was important to us to take DDaT Week to colleagues outside of London, hear their thoughts and show that DDaT is an inclusive place to work."
        },
        {
            "heading": 2,
            "text": "Connections made and lessons learnt"
        },
        {
            "text": "Our recorded metrics proved that DDaT Week a huge success. We experienced a growth in product uptake, an increase in DIT stakeholders signing up to receive our newsletter and increased visibility and collaboration across the department. Lots of new connections and important conversations were started with teams across DIT. Consider our objectives of helping DIT colleagues understand who we are and how we can support them, met!"
        },
        {
            "text": "DDaT Week also brought colleagues within DDaT together. Our collaboration set the standard in DIT for being ambitious, running hybrid events at scale and being inclusive of colleagues across the UK."
        },
        {
            "text": "We reflected on lessons learned, both what worked well and what we will do differently next time and shared these with the DDaT team."
        },
        {
            "heading": 3,
            "text": "What worked well"
        },
        {
            "heading": 3,
            "text": "What we will do differently"
        },
        {
            "text": "The case study of DDaT Week demonstrates our agile ways of working. We knew our users’ “problems”: DIT colleagues needed to better understand who DDaT are, how we operate and how we can support them. DDaT Week helped us work towards a solution. We tested it and it worked well, but there are iterations and improvements we will make so it’s even better next time. We are proud of what we achieved in bringing DDaT and DIT closer together and grateful for the time invested by our colleagues. If anyone would like to learn more about DDaT Week, please get in touch."
        }
    ]
}