{
    "url": "https://homeofficemedia.blog.gov.uk/2022/06/28/factsheet-blueprint-for-campsfield-house-immigration-removal-centre/",
    "title": "Factsheet: Blueprint for Campsfield House immigration removal centre  ",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-06-28T13:12:28+01:00",
    "content": [
        {
            "text": "The Home Office has announced initial plans for a new Immigration Removal Centre (IRC) in Oxfordshire."
        },
        {
            "text": "The below factsheet provides a Q&A."
        },
        {
            "text": "What are immigration removal centres? "
        },
        {
            "text": "The Home Office is committed to a fair and humane immigration policy that welcomes those here who use legal routes, but tackles abuse and makes our streets safer. This is what the public expects. Immigration detention is an essential part of this system. Immigration removal centres (IRCs) provide safe, secure and fit for purpose detained accommodation for people who are subject to removal from the UK."
        },
        {
            "text": "What is planned for Campsfield?"
        },
        {
            "text": "The Home Office is planning the development of a new IRC at the former Campsfield House, near Oxford. The plans are at an early stage. This new IRC will be a mixture of refurbished and new-build accommodation and will provide safe, secure and fit for purpose accommodation for people in detention."
        },
        {
            "text": "As part of our planning for the development of this IRC, we will hold discussions with local councillors, other local stakeholders such as the police, fire and health services and detention-related non-governmental organisations (NGOs)."
        },
        {
            "text": "What stage are the plans? "
        },
        {
            "text": "Our plans for the IRC are at an early stage but form part of our ongoing review of both detention capacity and geographical footprint in line with the Prime Minister’s statement on illegal migration on 14 April."
        },
        {
            "text": "The Home Office has formally announced to the market its intention to create an IRC at the former Campsfield House site and to procure the services to operate it. This is the start of the procurement process for those services and shows our intention to go to market within the next 12 months."
        },
        {
            "text": "As part of our planning for the development of this IRC, we will hold discussions with local councillors, other local stakeholders such as the police, fire and health services and detention-related NGOs."
        },
        {
            "text": "Why have you chosen Campsfield in particular?"
        },
        {
            "text": "The Home Office undertook thorough site assessments at several locations to establish those which can be most easily converted into safe, secure and fit for purpose immigration removal centres. These site assessments included consideration of the land and location of the site, including accessibility of services and utilities, the current use of the site and existing buildings and value for money."
        },
        {
            "text": "As a previous IRC site, Campsfield offers a good opportunity to utilise and improve existing accommodation as well as an opportunity to consider wider options within the site. It will provide jobs and support the local economy."
        },
        {
            "text": "How will local people be kept informed of the plans?"
        },
        {
            "text": "As part of our planning for the development of this IRC, we will hold discussions with local councillors, other local stakeholders such as the police, fire and health services and detention-related NGOs ."
        },
        {
            "text": "Engagement with local representatives enables the Home Office to better understand the impact of the plans on the local environment and communities, share updates of the planning work and feeds into the development of comprehensive assessments in line with our duties under the Equality Act 2010."
        },
        {
            "text": "Will the IRC impact the safety of local residents?"
        },
        {
            "text": "No. This will be a secure facility with on-site services (including recreation, faith and medical services) available."
        },
        {
            "text": "Why is the IRC needed? "
        },
        {
            "text": "Our plans for Campsfield form part of our ongoing review of both detention capacity and geographical footprint in line with the Prime Minister’s announcement on illegal migration on 14 April."
        },
        {
            "text": "How is the Home Office approaching planning of the site?"
        },
        {
            "text": "The Home Office will engage with the relevant local planning authority in due course to agree whether/which planning permissions are required for the site."
        },
        {
            "text": "How many people will be detained at the new IRC? "
        },
        {
            "text": "Detention and removal are essential parts of effective immigration controls. It is vital these are carried out with dignity and respect, and we take the welfare of detained individuals in our care very seriously. We are considering plans for the development of modern, decent and secure accommodation for around 400 men at Campsfield."
        },
        {
            "text": "Who will be detained at the IRC?"
        },
        {
            "text": "Foreign nationals liable for removal from the UK – foreign national offenders and immigration offenders"
        }
    ]
}