{
    "url": "https://space.blog.gov.uk/2022/06/28/how-forum-will-improve-climate-change-forecasts/",
    "title": "How FORUM will improve climate change forecasts",
    "authors": [
        "Professor Helen Brindley"
    ],
    "categories": [
        "Earth observation",
        "Satellites"
    ],
    "pub_date": "2022-06-28T10:14:57+01:00",
    "content": [
        {
            "text": "Science Minister George Freeman has announced that Airbus has been awarded a new European Space Agency (ESA) contract for the FORUM mission. "
        },
        {
            "text": "The UK, which is involved in the mission thanks to the UK Space Agency’s membership of ESA, committed over £200 million in Earth Observation missions, including FORUM, in 2019. "
        },
        {
            "text": "Scientists at Imperial College London provided key support to ESA in defining FORUM’s science objectives and, today, Airbus has been awarded a €160 million contract to build the satellite in Stevenage. "
        },
        {
            "text": "Imperial’s Professor Helen Brindley explains how the mission will improve the accuracy of climate change forecasts and help scientists see the Earth through new eyes."
        },
        {
            "text": "FORUM has been a long time in the making. In the 1990s, as a PhD student working with Professor John Harries at Imperial, I used what were, at the time, sophisticated modelling tools to simulate what we might expect the Earth to look like if viewed from space in the far-infrared, or at wavelengths between around 15-100 microns (0.015 - 0.1 mm)."
        },
        {
            "text": "Over the intervening period there have been numerous satellite instruments measuring the Earth’s outgoing energy to space in the mid-infrared (wavelengths between around 4-15 microns)."
        },
        {
            "text": "However, FORUM will be the first mission to measure the spectrum with high spectral resolution and accuracy across the far-infrared.   "
        },
        {
            "text": "But why should we care about the far-infrared?"
        },
        {
            "text": "Well, if our simulations are right, on the global average the region is responsible for over half of the Earth’s emission to space. Put another way, atmospheric absorption within the far-infrared makes a major contribution to the Earth’s Greenhouse effect."
        },
        {
            "text": "FORUM’s observations will enable us to probe the detail of this effect. We expect to gain important new insights into the role of water vapour and high-level ice cloud in driving and responding to changes in surface temperature, and hence in determining how our climate will evolve into the future.   "
        },
        {
            "text": "The observations can also be used to improve regional climate predictions by providing new knowledge about surface conditions. In clear, dry conditions such as those that might be seen in the Arctic, the atmosphere can become transparent within certain far-infrared ‘micro-windows’, allowing FORUM to sense the surface at these wavelengths."
        },
        {
            "text": "Polar regions are precisely those where we are seeing the fastest surface warming, yet our climate models show strong biases in these areas. Part of the discrepancy may be due to incorrect assumptions about their surface properties – something that FORUM can help to diagnose.    "
        },
        {
            "text": "The mission payload consists of two instruments flying on the same polar orbiting satellite. The FORUM sounding instrument (FSI) will resolve the outgoing spectrum from 6.25-100 microns with high radiometric accuracy, integrated over a 15 km diameter footprint at the Earth’s surface."
        },
        {
            "text": "The FORUM embedded imager (FEI) will measure in just one wavelength channel but at much higher spatial resolution to identify features within the FSI footprint.   "
        },
        {
            "text": "Team FORUM at Imperial is working very hard to develop new ground-based and airborne far-infrared instrumentation in support of the mission ahead of its scheduled launch in 2027."
        },
        {
            "text": "It’s exciting to think that FORUM will deliver completely unique observations - and finally allow me to see whether my thirty-year old simulations were correct! "
        },
        {
            "text": " "
        }
    ]
}