{
    "url": "https://despatch.blog.gov.uk/2022/06/28/mindfulness-and-how-it-can-help-you-and-your-pupils/",
    "title": "Mindfulness and how it can help you and your pupils",
    "authors": [
        "San Harper"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Resources for instructors"
    ],
    "pub_date": "2022-06-28T16:29:42+01:00",
    "content": [
        {
            "text": "We know that 1 in 10 people who fail their driving test say the main reason was because they were nervous on the day. A third of people who have passed their test say that they still feel nervous while driving."
        },
        {
            "text": "In this blog post, San Harper will explain how a mindfulness-based approach can help you in your work as an approved driving instructor (ADI) and about how it can support your pupils with managing their nerves."
        },
        {
            "text": "San is an ADI of 18 years from Gloucester. She’s also an accredited mindfulness teacher, and she’s brought the 2 disciplines together with great results."
        },
        {
            "heading": 2,
            "text": "What is mindfulness?"
        },
        {
            "text": "Over the last 5 years, mindfulness has become more mainstream. It’s estimated that 5,000 trained teachers in England have delivered mindfulness training with their pupils in schools. It supports the pupils with their mental health and wellbeing and helping prepare for exams ."
        },
        {
            "text": "Recent research stated, “studies have found that drivers who tend to be naturally more mindful tend to have lower engagement with distracting activities while driving, reduced driving anger, lower risk, and increased safety behaviours”."
        },
        {
            "text": "Mindfulness is defined as an awareness that arises through paying attention in a particular way, on purpose, in the present moment, and non-judgementally. It’s about being an observer and ‘turning towards’ what is happening."
        },
        {
            "text": "Mindfulness helps develop listening skills, increases ability to stay calm and understand emotions, develop a deeper sense of kindness and compassion for ourselves and others, and manage physical and psychological difficulties."
        },
        {
            "text": "I found learning mindfulness to be so transformative my personal life that I began to integrate it into my work as an ADI and went on to set up the Guild of Mindfulness Trainers."
        },
        {
            "heading": 2,
            "text": "How mindfulness works in driving lessons"
        },
        {
            "text": "One of the main mindfulness techniques in my driving lessons is the ‘grounding practice’ which I begin my lessons with when appropriate."
        },
        {
            "text": "One of the first things I do is just give my pupil a moment to settle and then get them to focus on their breath to bring awareness to all of their senses. Our breath is the only thing we can do in the moment. We can’t breathe yesterday. We can’t breathe tomorrow."
        },
        {
            "text": "The grounding practice brings them into the present moment."
        },
        {
            "text": "If the pupil gets stressed later on or something challenging happens during the lesson, we can pull over and repeat the grounding practice."
        },
        {
            "text": "The grounding practice is also a great exercise to do with pupils on the day of their driving test."
        },
        {
            "heading": 2,
            "text": "Mindfulness helps with test nerves"
        },
        {
            "text": "Mindfulness practise is absolutely making a difference with my pupils, especially with nerves which are one of the biggest factors in not passing. Nerves are when you go into a fear response your brain just goes offline. It affects your memory and your cognitive function."
        },
        {
            "text": "Mindfulness has helped my pupils in many ways, including:"
        },
        {
            "text": "One pupil told me that she’s even used the techniques she’d learned in her driving lessons with me, to help her deal with a difficult interaction at work."
        },
        {
            "heading": 2,
            "text": "Mindfulness can help you cope with the hard parts of the job"
        },
        {
            "text": "Learning mindfulness helps you to manage better and cope with the difficult parts of the job. It can help with stress, managing chronic pain, diary management, organisation, and relationships with pupils, road users and other people."
        },
        {
            "text": "If you bring your own stress and anxiety into the car and that lesson, on a subconscious level you’re sharing that with that pupil. You might not even be aware of it, but it will impact them. Mindfulness helps with that."
        },
        {
            "heading": 2,
            "text": "It’s also good for business"
        },
        {
            "text": "In analysis of positive customer reviews for ADIs, the attributes learners deemed most effective within training were ADIs who were:"
        },
        {
            "text": "These attributes overlap completely with the definitions of mindfulness qualities."
        },
        {
            "text": "As more and more young people are learning mindfulness at school, many of them will already be aware of what it is and how it can help when they come to start learning to drive and choosing an ADI."
        },
        {
            "heading": 2,
            "text": "Find out more about mindfulness"
        },
        {
            "text": "Mindfulness is a practice, you can’t learn it quickly or cognitively. There is a difference between having the knowledge and having the practice, but there is still a benefit in learning about what it is."
        },
        {
            "text": "If you want to learn more about how mindfulness can help you, your business and your pupils there are plenty of resources you can check out:"
        },
        {
            "text": "There is more help on managing emotions, anxiety and stress in The Official DVSA Guide to Better Driving (use our campaign discount code ‘TT25’ and save 25% when you order the guide online)"
        },
        {
            "text": "Please share your thoughts, ideas and comments on this subject in the comments."
        },
        {
            "text": "And remember, any research you do about mindfulness counts as continuing professional development. So keep a record of what you do."
        }
    ]
}