{
    "url": "https://defrafarming.blog.gov.uk/2022/06/28/soil-health-a-uk-wide-discussion/",
    "title": "Soil health: a UK-wide discussion",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2022-06-28T14:48:47+01:00",
    "content": [
        {
            "text": "In this post, we'll share a summary of the second meeting of the UK Agriculture Partnership (UKAP). It was held at the College of Agriculture, Food and Rural Enterprise in Northern Ireland."
        },
        {
            "text": "The topic of the meeting was soil health."
        },
        {
            "text": "Over 100 participants from the UK’s 4 nations attended in person and online to discuss the shared challenges, potential solutions and innovations relating to soil health."
        },
        {
            "text": "Among the participants were representatives from academic and research institutions, agri-businesses, charities, environmental non-governmental organisations (NGOs), as well as farmers, ministers and officials from Defra and the devolved administrations."
        },
        {
            "heading": 2,
            "text": "One of our greatest natural assets"
        },
        {
            "text": "Soil is one of our greatest natural assets. This message was restated by the ministers in attendance."
        },
        {
            "text": "In the UK, we have a rich variety of soil types, land uses and local climate characteristics which provide diverse habitats and agricultural opportunities that benefit us all."
        },
        {
            "text": "Healthy soil supports a range of environmental, economic and societal benefits. These include food production, climate change mitigation and increased biodiversity."
        },
        {
            "text": "Poor soil management or inappropriate land use can cause soil degradation, which reduces the ability of soil to perform these vital functions."
        },
        {
            "text": "For context, a 2019 report by the Environment Agency found that in England and Wales:"
        },
        {
            "text": "The importance of soil health underscored in the government’s 25 Year Environment Plan which states that England’s soils must be managed sustainably by 2030 and steps must be taken towards restoring the UK’s soils."
        },
        {
            "text": "A recurring point on which participants agreed was the importance of taking an integrated approach to soil management to ‘protect and improve soil ecosystem services’."
        },
        {
            "text": "The day’s discussions were addressed by the following themes:"
        },
        {
            "heading": 2,
            "text": "Threats to UK Soil Health"
        },
        {
            "text": "We heard from the University of East Anglia, Agri-Food and Biosciences Institute, the James Hutton Institute, and Wealmoor Limited, about the different threats to agricultural soil health across the UK."
        },
        {
            "text": "The presentations and the discussions which followed, explored aspects of soil mismanagement and the challenge of balancing conflicting requirements from our land."
        },
        {
            "text": "The implications of the latest available soil data were also discussed."
        },
        {
            "text": "Participants identified where collaboration was needed to tackle agricultural threats to soil health effectively."
        },
        {
            "heading": 2,
            "text": "Current soil health priorities and initiatives"
        },
        {
            "text": "This discussion was aimed at better understanding and delivering through different initiatives the political, environmental, and societal priorities required from our agricultural land."
        },
        {
            "text": "Speakers from the Agriculture and Horticulture Development Board, the Farming and Food Countryside Commission, the Agri-Food and Biosciences Institute, and Bangor University also looked at how current evidence gaps could be addressed to identify common priorities to protect and improve soil health."
        },
        {
            "heading": 2,
            "text": "Soil Carbon and Natural Capital"
        },
        {
            "text": "This session explored the role that private finance could play in supporting sustainable soil management. We discussed the potential for soil carbon markets. A trading system for buying and selling sell units of soil carbon could help countries meet carbon emissions targets and encourage carbon sequestration within agricultural settings."
        },
        {
            "text": "We also discussed the wider natural capital benefits of agricultural soil. For example, increased biodiversity, food production and flood mitigation. Speakers from the Soil Association, Sustainable Soils Alliance and Scotland’s Rural College also addressed the need for voluntary carbon markets to ensure environmental integrity."
        },
        {
            "heading": 2,
            "text": "Soil Health research agenda and evidence gaps"
        },
        {
            "text": "In this discussion, we focussed on identifying current research needs, the risks posed by evidence gaps and what is needed to address future emerging risks to soil health. Presentations were given by the UK Centre for Ecology and Hydrology, the James Hutton Institute, and the Pasture-Fed Livestock Association."
        },
        {
            "text": "Building on the momentum of these discussions, Defra and the devolved administrations will continue update each other on policy developments and research projects."
        },
        {
            "heading": 2,
            "text": "Our next meeting"
        },
        {
            "text": "As part of our shared commitment to rotating UKAP among the UK nations, the 3rd UKAP will take place on 4 July at the James Hutton Institute in Dundee and will focus on food security."
        },
        {
            "text": "Defra’s Secretary of State, ministers from the Scottish Government and the Northern Ireland Executive, and a range of experts and stakeholders from the agricultural sector will discuss the challenges and risks facing food security. They will explore how innovative, sustainable agricultural approaches can provide solutions."
        },
        {
            "text": "We’ll blog about this event, so please subscribe to the blog."
        }
    ]
}