{
    "url": "https://ukhsa.blog.gov.uk/2022/06/28/the-covid-19-dashboard-moves-to-weekly-updates/",
    "title": "The COVID-19 Dashboard Moves to Weekly Updates",
    "authors": [
        "Clare Griffiths"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-06-28T15:24:20+01:00",
    "content": [
        {
            "text": "The Government’s Living with COVID-19 plan set out how the UK would transition from managing COVID-19 as an emergency response to living with the virus, whilst ensuring we retain the resilience and contingency capabilities to deal with the uncertainty around the future path of the pandemic."
        },
        {
            "text": "This transition is underpinned by the success of the UK’s vaccination programme, and a suite of available pharmaceutical tools for treating people who are most vulnerable or severely ill with COVID-19. Vaccination derived protection and treatments have changed the risks of COVID-19 and led a pathway to greater stability."
        },
        {
            "text": "As we move from pandemic to endemic, management of COVID-19 no longer requires the rapid deployment of specific interventions which respond to changing daily data, and wider public health measures and guidance provide an effective and proportionate approach."
        },
        {
            "text": "This makes it possible to manage COVID-19 in a similar way to other respiratory illnesses. COVID-19 will be managed through ongoing surveillance, vaccination programmes and strong public health messaging."
        },
        {
            "text": "In line with this approach, data on the COVID-19 Dashboard will move from daily to weekly reporting from 1st July 2022. This follows the typical reporting schedules for other respiratory infections and also aligns COVID-19 reporting for England with Scotland and Wales - which already report COVID-19 data on a weekly basis."
        },
        {
            "text": "The COVID-19 Dashboard will continue to update every Wednesday at 4pm with the most up to date available daily data on testing, cases, vaccinations, healthcare, and deaths within 28 days of a positive COVID-19 test from the nations of the UK."
        },
        {
            "text": "This change represents a further evolution of the COVID-19 Dashboard which has continued to develop in step with the needs of the health and care sector, policy makers, the media and the public alike, providing a powerful and popular tool for timely and reliable COVID-19 statistics."
        },
        {
            "text": "The Dashboard will continue to be a key source of COVID-19 data and we remain committed to providing open-source data that can be rapidly and frequently used by international, national, regional and local users including major media outlets that analyse and report COVID-19 statistics and trends to audiences within the UK and around the world."
        },
        {
            "text": "Rob England, Senior Journalist in the BBC News Data and Analysis team, said:"
        },
        {
            "text": "The Dashboard will also continue seeking to enhance equitable access to official public health data directly to the public.  A recent report titled 'What Counts' published by Sense about Science, illustrated the Dashboard’s success in proving equitable access by illustrating that the level of Dashboard followers varied less between groups categorised by age, qualification and economic activity when compared with followers of other government information sites."
        },
        {
            "text": "A large contributing factor to reaching high levels of public engagement can be attributed to the quality of engineering, statistics and the user interface which have been developed and designed in response to regular user feedback."
        },
        {
            "text": "Public health advice and government decisions will continue to be informed through the COVID-19 Dashboard and we will also maintain our other critical surveillance capabilities to monitor the virus, including the weekly COVID-19 surveillance report and the COVID-19 Infection Survey (CIS)."
        },
        {
            "text": "Genomic sequencing will be maintained to help us understand the evolution of the virus and identify new variants. The Government also retains core infrastructure and capabilities to scale up testing if needed. As we move forward and continue to monitor COVID-19 closely, the frequency of reporting data on the COVID-19 Dashboard will be kept under review."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}