{
    "url": "https://forestrycommission.blog.gov.uk/2022/06/28/trees-a-natural-way-to-help-our-waterways/",
    "title": "Trees – A natural way to help our waterways",
    "authors": [
        "Alexandra Jenks"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-06-28T14:01:38+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "With Franklin following Dudley and Eunice, February 2022 was the first time that three named storms were recorded within seven days since the storm naming system began in 2015. Storms like the ones we have recently experienced are on the increase, prompting experts to look for viable long-term solutions to help mitigate the impact of extreme weather conditions."
        },
        {
            "text": "One of the solutions under consideration at least in part, is to plant trees in areas where there have been ongoing issues with soil erosion, flooding and to aid the restoration of river and riverside habitats."
        },
        {
            "heading": 2,
            "text": "A win-win situation for soil and water quality"
        },
        {
            "text": "Big benefits can be gained from planting trees, namely the improvements to both soil and water quality. If you’ve ever seen dark brown floodwater, you’ve seen soil erosion. Planting trees helps to reduce soil erosion in various ways:"
        },
        {
            "text": "Fallen leaf litter from trees also creates new organic matter which leads to better soil fertility, which in turn leads to a soil structure which can help to slow the flow of surface water through woodlands during flood events."
        },
        {
            "text": "By planting trees in fenced areas adjacent to watercourses preventing access to rivers by livestock, woodland will act as a natural filter and buffer – reducing the amount of harmful organisms directly entering the water. Likewise, planting blocks of trees can help to intercept spray drift by up to 90% when they have grown and their canopy forms a barrier. Woods also help to soak up nitrates and phosphates, particularly in areas where there are issues with agricultural pollution."
        },
        {
            "heading": 2,
            "text": "Trees help to ‘slow the flow’ of floodwater"
        },
        {
            "text": "Planting trees and shrubs on riverbanks, floodplains, across slopes and in the headlands of a catchment can slow floodwater. A woodland floor is rougher and more difficult for water to negotiate than a grassy field, and it’s this roughness that slows down floodwaters. As they slow, floodwaters tend to drop suspended particles and nutrients in hollows and troughs, and these nutrients are used by the trees to grow."
        },
        {
            "text": "Water that is moving slower has more of a chance to move down into and through the soil to the groundwater below, this all helps to reduce the amount of water from a storm that actually arrives in a river and causes a flood."
        },
        {
            "text": "Trees also help to shade and keep rivers cool during the summer – providing a vital refuge for wildlife in and around rivers. Shading from planting riverside trees and shrubs can help reduce local stream temperatures. It’s good to have about half of the river in dappled shade, as this can lower average maximum summer water temperatures by about 2°C – 3°C compared to open rivers – that can be the difference between a river being a great place for fish and invertebrates to live or it being really difficult."
        },
        {
            "text": "Before planting trees, it's crucial to consider that the right tree species are planted in the right place, to not exacerbate any existing issues. There are a few things to think about prior to planting:"
        },
        {
            "text": "For riverside and floodplain planting, ideally there should be 50% dappled shade over the river."
        },
        {
            "heading": 2,
            "text": "Large or small-scale tree planting can work for you"
        },
        {
            "text": "It’s important to remember that it’s not just large-scale planting that can reap all those tremendous benefits. Planting small areas of targeted woodland to improve the water environment, can also provide shelter from wind for livestock, soil and game birds."
        },
        {
            "text": "Research by the Game and Wildlife Conservancy Trust (GWCT) has shown that planting shelter belts can help to reduce lambing deaths as the addition of trees provide somewhere for ewes and lambs to seek refuge in bad weather. Similarly, planting trees on the upwind sides of exposed fields can help to maintain higher soil temperatures and extend growing seasons."
        },
        {
            "text": "The study also showed that when it came to gamekeeping, planting tree species such as wild cherry and crab apple led to a better retention of birds on drives. The birds preferred the natural food found within the newly planted areas, compared to that found within existing maize crops. The trees also had an additional bonus of providing shelter in bad weather, and roost spots for the birds to avoid predators."
        },
        {
            "text": "Perhaps we should be looking at a shift away from planting maize for cover on slopes, which has shown to exacerbate nitrate levels and look to replace these areas with woody shrubs like box and privet – proven to offer a whole raft of benefits."
        },
        {
            "heading": 2,
            "text": "The time to plant is now"
        },
        {
            "text": "Whatever your tree planting objectives might be, research has shown the far-reaching benefits woodland creation can have on natural flood management, improving water quality, supporting habitats and the wider environment – for us now and for future generations."
        },
        {
            "text": "Financial support is available through Forestry Commission grants and via partners and other woodland creation organisations. Our flagship scheme, the England Woodland Creation Offer covers:"
        }
    ]
}