{
    "url": "https://ipo.blog.gov.uk/2025/04/26/music-metadata-matters-how-to-get-paid-and-credited/",
    "title": "Music metadata matters: how to get paid and credited",
    "authors": [
        "Meg Davies",
        "Jenny Manders"
    ],
    "categories": [
        "Europe",
        "International",
        "IP research",
        "Music Metadata"
    ],
    "pub_date": "2025-04-26T08:53:48+01:00",
    "content": [
        {
            "text": "In the digital era, good quality metadata (the information that describes who contributed to a music track’s creation) is essential to making sure music-makers are accurately credited and paid. But metadata is often not as accurate or complete as it should be, particularly relating to songwriters and their song or composition. Incomplete or inaccurate metadata can lead to significant delays to creators being paid for the use of their works, and in some cases not being paid at all."
        },
        {
            "text": "“This is where the UK Industry Agreement on Music Streaming Metadata comes in,” says David Humphries MBE, Intellectual Property Office (IPO) Head of Research."
        },
        {
            "text": "You can read more about the positive commitments of the working group here (link)UK Industry Agreement on Music Streaming Metadata - GOV.UK"
        },
        {
            "heading": 3,
            "text": "The Get Paid Guide: metadata demystified"
        },
        {
            "text": "The working group underpinning the Metadata Agreement highlighted two key areas of concern: the problems creators faced in registering original music compositions and the problems the recording and publishing industries faced in dealing with bad or incomplete data."
        },
        {
            "text": "This feedback led to the creation of the Get Paid Guide, a collaborative initiative between the IPO, the Performing Right Society (PRS), Phonographic Performance Limited (PPL), the Ivors Academy and the Music Publisher’s Association (MPA). "
        },
        {
            "text": "Launched in 2023 and updated in 2024 with recorded music guidance, it recognised that education around registering metadata information accurately is essential for creators to make sure they get paid what they’re owed. Experts from across the music industry have contributed to this step-by-step interactive guide to simplify the process of registration for all artists, new and established."
        },
        {
            "text": "Take a look at the Get Paid Guide here [link]: Get Paid Guide  "
        },
        {
            "text": "Crispin Hunt is the President of the PRS Members' Council and is himself a multi platinum-selling songwriter and record producer. It's still early days for the Get Paid Guide, so we wanted to know what impact he thinks it has had so far:"
        },
        {
            "text": "PPL is the UK music industry’s collective management organisation (CMO) for performers and recording rightsholders. With over 150,000 members, the organisation helps ensure that members are fairly rewarded when their recorded music is broadcast or played in public places. Camilla Waite, General Counsel, PPL told us:"
        },
        {
            "heading": 3,
            "text": "The music-creators' perspective "
        },
        {
            "text": "For British rock band James and the Cold Gun, it took just three years to go from recording their first self-titled album in a garage in Wales, to performing at Hyde Park in support of rock bands Pearl Jam and Guns N’Roses. They are now signed by Pearl Jam guitarist Stone Gossard to his label, Loosegroove Records. Their second album, Face in the Mirror, has just launched to positive acclaim, “...oozing attitude with gutsy riffs and punked-up energy to boot...” (Kerrang). They currently have a UK tour underway."
        },
        {
            "text": "The band, comprising founder member vocalist/guitarists James Joseph and James Biss together with Gaby Elise on bass/vocals, experienced a steep metadata learning curve when they first formed in 2019. Frontman James Joseph explains:"
        },
        {
            "text": "Recent years have seen the need for the band to collect royalties outside the UK, having performed and been played in locations such as the USA (which is where Gossard first heard them on Radio KEXP in Seattle) and Europe including France, Italy, Germany and the Czech Republic. They’re gaining an enthusiastic overseas fanbase."
        },
        {
            "heading": 3,
            "text": "James’ top metadata tips for music-makers "
        },
        {
            "text": "James admits to feeling thankful that he took an early interest in the business angle – something he acknowledges fellow artists may overlook when busy building their music career."
        },
        {
            "text": "“I would say to musicians and composers, if you want to be serious about your art you definitely need to learn the business side - like making sure your metadata is correct - just to protect yourself. Many young artists will have no idea about all of that and it’s only when they get picked up by a label or by a manager that they're even aware that they could register for their royalties themselves. Then they have to do it retrospectively to try and get back the money they're owed.”"
        },
        {
            "text": "James’ attention to metadata detail is music to our ears. Has his early interest in registering for streaming royalties paid off? "
        },
        {
            "text": "\"When I think about it, I realise that if I hadn't registered to claim my share of all of that stuff when I was younger, it'd be money that I wouldn't have had. That’s quite a sobering story. It may trickle in in drips and drabs, but that’s a kind of pension plan for as long as the band stays around. That sort of brings it to life for me.\""
        },
        {
            "text": "James’ advice struck a chord with us. Does he think metadata awareness has improved in the industry? "
        },
        {
            "heading": 3,
            "text": "Getting paid can only get better "
        },
        {
            "text": "The music industry is well aware of the continued need to widen access to information and improve education around the metadata landscape. Crispin Hunt concludes: "
        },
        {
            "text": "Our top tips for musicians"
        }
    ]
}