{
    "url": "https://forestrycommission.blog.gov.uk/2023/08/24/celebrating-the-kings-coronation-a-new-living-heritage-fund-for-tree-planting/",
    "title": "Celebrating the King’s Coronation – A new Living Heritage Fund for tree planting",
    "authors": [
        "Daniel Good"
    ],
    "categories": [
        "nature",
        "Tree Planting",
        "Urban trees",
        "Woodland creation"
    ],
    "pub_date": "2023-08-24T11:00:45+01:00",
    "content": [
        {
            "text": "The King’s Coronation in May was a key event in people’s lives, and what better way to honour that than by creating cleaner air and an improved natural heritage that can be enjoyed by future generations."
        },
        {
            "text": "We are really excited to be opening the Coronation Living Heritage Fund. This £2.5 million government fund will support local tree planting initiatives to commemorate the Coronation of King Charles III."
        },
        {
            "text": "This is a great opportunity for tree planting close to where people live across England. We will see more trees being planted outside woodlands through the creation of micro woodlands in urban areas and new community orchards."
        },
        {
            "text": "The trees planted through this fund will not only help us reach the government’s target of reaching net zero by 2050, but can also help:"
        },
        {
            "text": "This fund will be supported by £2.5 million in funding made available through Defra’s £750m Nature for Climate Fund. County, unitary, metropolitan, London borough, district and city local authorities can apply for up to two grants for projects ranging between £10,000 and £50,000. They can then distribute that across projects in their area. Planting will need to be carried out by 31st March 2025."
        },
        {
            "text": "Eligible local authorities will be able to apply for funding to support projects in the following categories:"
        },
        {
            "heading": 3,
            "text": "Coronation Micro Woods "
        },
        {
            "text": "The creation of micro woods, using a planting method pioneered by Japanese botanist Dr Akira Miyawaki, creates miniature woodlands in urban areas. We are excited to see these develop within communities as they emulate a more naturalistic growth to a local area, and by planting mixed native species at close densities in small patches, we see higher survival rates. They also require minimal maintenance after two to three years and have lower vulnerability to vandalism, helping to contribute to a lasting heritage."
        },
        {
            "heading": 3,
            "text": "Coronation Community Orchards"
        },
        {
            "text": "Providing grants to local people and groups to establish community orchards. Community orchards are excellent places for people to come together to plant a variety of fruit trees and to use the area for community activities. They increase bee numbers and are a great opportunity for schools and the communities to learn about wildlife, planting, and maintenance of trees. They give healthy food to people, as well as supporting wildlife and improving the land in a natural way."
        }
    ]
}