{
    "url": "https://insidegovuk.blog.gov.uk/2023/08/24/how-we-developed-gov-uks-strategy-for-growth/",
    "title": "How we developed GOV.UK’s strategy for growth",
    "authors": [
        "Jyoti Basuita, Head of Policy and Strategy, GOV.UK"
    ],
    "categories": [
        "How we work"
    ],
    "pub_date": "2023-08-24T12:29:22+01:00",
    "content": [
        {
            "text": "Recently Christine Bellamy, Director of GOV.UK, published our new strategy for growth. It sets out how we want to better help people access the support they are entitled to, the information they need and services they're after by expanding the range of channels, content and interactions GOV.UK provides. All of this work supports GDS’s mission: to design and protect the user experience of government."
        },
        {
            "text": "In this blog post, I'm going to explain how we developed this strategy."
        },
        {
            "heading": 2,
            "text": "Why now?"
        },
        {
            "text": "It's been an intense couple of years on GOV.UK. We've been right at the heart of the government's response to the pandemic, developing and maintaining new content and services to help millions of people find information and access support."
        },
        {
            "text": "During this period, GOV.UK received its highest ever traffic levels and we started to push the boundaries of our proposition - playing a more proactive and interactive role than ever before. By summer 2022, our work on COVID-19 had largely stabilised, which gave us some space to think strategically about what this all meant for GOV.UK's future, and how we could best meet our users’ needs. This also coincided with GOV.UK's 10th birthday (there's nothing like a milestone to prompt reflection) and the arrival of our new director, Christine Bellamy."
        },
        {
            "heading": 2,
            "text": "What did we do?"
        },
        {
            "text": "We set ourselves the goal of describing an achievable but ambitious future GOV.UK proposition, the impact it would have, and the changes needed to deliver it. We focused this on the period until 2025 - mainly to align with our internal funding and planning cycles."
        },
        {
            "text": "We took an iterative, hypothesis-led approach to the project, which took around 15 weeks."
        },
        {
            "heading": 3,
            "text": "Phase 1: Issues analysis"
        },
        {
            "text": "The first phase was gathering past and present data and research about GOV.UK and its wider context. We then analysed this to create a picture of where we are now and the challenges and opportunities facing GOV.UK."
        },
        {
            "text": "We looked at site performance data, polling data and user research to understand how we were performing for users at a macro level. This showed us that GOV.UK's usage is flat or declining compared to pre-COVID levels and that certain user groups are relatively underserved; for example, satisfaction with GOV.UK is lower amongst younger users."
        },
        {
            "text": "We supplemented this analysis by speaking to stakeholders across government to find out more of their needs and perspectives. For instance, some departments told us that they are still reliant on call centres for informational needs that could be met by GOV.UK and that not everyone who is entitled to access their services is currently doing so. We see this supported in research like that from Policy in Practice, which reported that £19 billion of support goes unclaimed annually."
        },
        {
            "text": "We also assessed trends in our wider landscape, such as international governments and industry. This confirmed that technology advances are changing users’ online behaviour. People are spending more time on their phones than ever and recent breakthroughs in AI will change things again."
        },
        {
            "heading": 3,
            "text": "Phase 2: Hypotheses"
        },
        {
            "text": "Next, we gathered hypotheses for how we could address the opportunities and challenges we'd identified in our analysis. For instance:"
        },
        {
            "text": "Cross-functional teams in GOV.UK evaluated the potential benefits and feasibility of the hypotheses. This exercise wasn't about being 100% sure that our hypotheses would work out. We just wanted to know enough to be able to make a judgement about relative priority and decide where to invest in further exploration and testing."
        },
        {
            "heading": 3,
            "text": "Phase 3: Recommendations"
        },
        {
            "text": "From this work, we were able to recommend specific workstreams to progress, which you can read more about in Chris' blog post. Like any good product team, we will work in an agile way and learn as we go. We will be evaluating our efforts for these objectives as the work continues."
        },
        {
            "heading": 2,
            "text": "Working in partnership"
        },
        {
            "text": "As with any strategy project, engagement is really important to develop something of high quality and to generate buy-in and it's something we did throughout this project."
        },
        {
            "text": "This is especially true of GOV.UK. Although GOV.UK looks like a single thing to the user, it's actually made up of multiple domains owned by other government departments. In our strategy, when we say 'GOV.UK' we mean GOV.UK as a user sees it - that means everything that exists under the GOV.UK brand. So our strategy has to be a joint one with shared ambitions across the departments who contribute to GOV.UK every day."
        },
        {
            "text": "For us this meant engaging extensively with our stakeholders across government, speaking with over 50 people and at cross-government fora. We paid particular attention to colleagues in policy and communications teams, as well as digital teams, to make sure we understood government priorities, and how GOV.UK could help to achieve those even more effectively in future. Our strategy was ultimately signed off by the Digital and Data Board in March this year - a group of cross-government permanent secretaries."
        },
        {
            "heading": 2,
            "text": "Implementation"
        },
        {
            "text": "To enable delivery of our strategy, we needed to update the way we organise ourselves. We set up a new team structure at GOV.UK, with each team working on objectives and key results (OKRs) aligned to the strategy."
        },
        {
            "text": "We also developed a product flywheel (a product strategy model which identifies and encourages virtuous circles that improve user outcomes) and defined the metrics we'll be using to track progress. These include overall traffic and traffic sources; levels of usage, satisfaction and findability; and brand recognition. This will help us to make sure we're having the effect that we hope to, and to plan and prioritise work aligned to our strategy."
        },
        {
            "text": "At the same time, we're doing more work to continuously build our understanding of GOV.UK's current and potential users, including those we seem to be underserving, to better understand their needs and the barriers they face, so that we can target interventions."
        },
        {
            "text": "Now we're in delivery mode and in the next blog post in this series you'll hear from Rob Rankin, Head of Product, about our programme roadmap in more detail."
        }
    ]
}