{
    "url": "https://naturalengland.blog.gov.uk/2023/08/24/investing-in-sites-of-special-scientific-interest-sssis/",
    "title": "Investing in Sites of Special Scientific Interest (SSSIs)",
    "authors": [
        "Brian Davies"
    ],
    "categories": [
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2023-08-24T13:10:42+01:00",
    "content": [
        {
            "text": "By Brian Davies, Protected Sites Principal Adviser"
        },
        {
            "text": "From geological outcrops formed millions of years ago to flower rich chalk grasslands home to endangered butterflies, and parklands, ancient woodland and lowland heaths resonating to the sounds of native birds, Sites of Special Scientific Interest (SSSIs) represent the very best of England’s nature.  "
        },
        {
            "text": "Each SSSI is legally protected and selected because it contains special features. These could be threatened habitats, characteristic, rare and endangered species or important geology. There are just over 4,100 SSSIs in England covering more than 1.1million hectares, around 8% of England’s land area. "
        },
        {
            "text": "They span the country - from city centres to remote coasts and mountains - and range in size from a rare bat roost measuring a fraction of a hectare, to The Wash in East Anglia at 62,000 hectares. They include farmland, canals, old industrial sites, sand dunes and shingle beaches – all of which can be important for wildlife. "
        },
        {
            "text": "Natural England is working with many of the 13,000 SSSI land managers, whose skills and traditional activities have helped shape these special places. Monitoring and evaluation of the condition of SSSIs is hugely important to understand how land management and other factors, such as water quality, are affecting a site’s special features."
        },
        {
            "text": "In April this year, Natural England changed our approach to SSSI monitoring. Instead of subdividing SSSIs into units and making assessments of condition at the unit scale, we now assess the condition of special features across the whole of a SSSI. This approach, known as Whole Feature Assessment, helps us to better understand what is affecting features and how SSSIs function as part of their wider landscape.   "
        },
        {
            "text": "Government has set a long-term Commitment to have 75% of SSSIs in favourable condition by 2042. At the start of April this year, 38% of SSSIs (by area and by feature) were recorded as being in favourable condition. This figure has not changed much in recent years, due in part to relying on historic data. With increased funding over the past couple of years, Natural England is now investing in updating condition assessments and developing a long-term, prioritised monitoring plan.  "
        },
        {
            "text": "The Government’s Environmental Improvement Plan (EIP) set two important interim targets for SSSIs to be achieved by the end of January 2028. The first target, to have an up-to-date condition assessment for every SSSI, will make sure that land managers can be confident about the state of their special sites and what actions are necessary, by whom, to recover or maintain it in favourable condition.  "
        },
        {
            "text": "We are increasingly using new technologies, such as eDNA and digital IT to achieve this target. We are drawing on expertise and data from farmers, landowners and contractors, as well as work carried out by our own staff to inform our assessments. We’ve tripled the number of Natural England staff carrying out SSSI monitoring over the past 5 years, and currently spend £1.4m a year on SSSI monitoring. "
        },
        {
            "text": "The second SSSI target in the EIP is to have actions on-track to achieve favourable condition on 50% of SSSI features by 2028. Through our SSSI monitoring and casework and by working with land managers we are improving understanding of the pressures on SSSIs and the actions needed to achieve and maintain them in favourable condition."
        },
        {
            "text": "We are piloting new powers to establish Protected Site Strategies in five landscapes. We are working closely with the Major Landowners Group (the large environmental organisations, such as the RSPB, National Trust and The Wildlife Trusts, utility companies and public bodies who collectively manage over 50% of SSSI land), to develop and implement solutions to recover the features that make their sites special.  "
        },
        {
            "text": "With improved evidence, and through collaboration, we are developing action plans to get features into favourable condition, addressing both on-site and off-site pressures. Getting action plans underway and on-track for 50% of SSSI features by 2028 is key to meeting Government’s commitment to get 75% of SSSIs into favourable condition by 2042. "
        },
        {
            "text": "Traditional farming skills and land management have helped shape SSSIs. We recognise it is important that landowners and managers are properly recognised and rewarded for their efforts to bring and maintain sites into favourable condition. Agri-environment schemes are an important way to achieve this, and we are working with Defra as they develop and roll out the new Environmental Land Management schemes to properly pay farmers and land managers to provide environmental goods and services alongside food production.  "
        },
        {
            "text": "Not all SSSIs are eligible for agri-environment schemes. The Conservation Enhancement Scheme (CES) is a Natural England scheme that can pay for research and development and direct land management work to improve the condition of SSSIs. We’ve successfully used CES in the past to bring many SSSIs into favourable condition. Examples include scrub removal and rotational cutting on reed beds; management of urban meadows; research on geological sites; and weir removals to improve access for fish. "
        },
        {
            "text": "SSSI land managers who have sites that are ineligible for agri-environment schemes and think that CES might be appropriate for them can contact our CES team for more information by emailing protectedsites@naturalengland.org.uk.. "
        },
        {
            "text": "Many SSSIs are now the last home for species at risk of extinction. Ensuring they are in good condition, and at the heart of a thriving and resilient Nature Recovery Network, is central to meeting Government’s goal of recovering nature. Meeting the Government’s SSSI targets will be challenging. We are committed to playing our part, working nationally and locally with farmers, government, the public, private and voluntary bodies, for the benefit of wildlife and people. "
        }
    ]
}