{
    "url": "https://digitalhealth.blog.gov.uk/2023/08/24/join-the-digital-transformation-team/",
    "title": "Join the digital transformation team",
    "authors": [
        "Matthew King",
        "Nick Rees"
    ],
    "categories": [
        "Jobs"
    ],
    "pub_date": "2023-08-24T14:49:12+01:00",
    "content": [
        {
            "text": "We are recruiting 9 people to join our passionate and experienced digital transformation team at the Department of Health and Social Care (DHSC). We need enthusiastic digital and technology people to work with us on interesting and exciting health and social care projects. "
        },
        {
            "heading": 2,
            "text": "Working at DHSC "
        },
        {
            "text": "At DHSC, we are proud of our purpose – to enable everyone to live more independent, healthier lives for longer. To achieve this, and create a great place to work, we have four values:  "
        },
        {
            "text": "We are committed to promoting and supporting inclusion in the workplace, including flexible working options. We are helping to build a diverse and inclusive Civil Service where everyone can realise their potential. "
        },
        {
            "heading": 2,
            "text": "Who are the digital transformation team? "
        },
        {
            "text": "We are in a joint unit between the department and NHS England. We are a dynamic and growing team with a great culture. As digital and technology are critical to delivery in health and social care, there are plenty of opportunities for interesting and exciting work."
        },
        {
            "text": "We use our expertise in digital, data and technology to support better services across the health and care systems. We focus on the people using the services and the professionals who provide them.  "
        },
        {
            "text": "We have specialists in user centred design, digital and technology assurance, product, delivery, and building digital capability – and we have communities of practice, so we can offer continued learning and development, support and training opportunities.  "
        },
        {
            "heading": 2,
            "text": "Who are we looking for? "
        },
        {
            "text": "The roles we are recruiting are: "
        },
        {
            "heading": 2,
            "text": "What will you be doing?"
        },
        {
            "text": "Depending on your role, you could be ensuring a new NHS system delivers value for users and the taxpayer. Or you could be working in collaboration with adult social care policy to build the foundations of a new service. Or you could be advising senior leaders on the value of digital and technology. Some of the recent projects we have worked on include Better Health: Rewards, adult social care workforce, weight management services and digital health checks. "
        },
        {
            "text": "Most of our work is in the discovery and alpha phases of projects, consulting with teams to ensure that we are focussed on solving the right problems and getting the best outcomes. We support teams to deliver digital products and services, but do not currently own specific services long term.  "
        },
        {
            "text": "Whatever your role in the team, you will work in collaboration with policy and suppliers on varied and engaging projects. If this sounds like an environment you would like to work in, we would love to hear from you. "
        },
        {
            "heading": 2,
            "text": "How can you apply?"
        },
        {
            "text": "You can apply for these roles through Civil Service jobs. The roles will be published on a rolling basis, so do check back or set up an email alert if you cannot see the role you want to apply for. "
        },
        {
            "text": "If you want to learn more about these roles or have any other questions, please email digital.recruitment@dhsc.gov.uk with your contact details and one of the team leaders will get in touch with you. "
        }
    ]
}