{
    "url": "https://socialcare.blog.gov.uk/2023/08/24/nhs-and-social-care-covid-life-assurance-scheme/",
    "title": "NHS and Social Care COVID Life Assurance Scheme",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2023-08-24T14:43:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Closing soon - don't miss out"
        },
        {
            "text": "In our line of work, there are many challenges we do our best to meet - and beat - every day of the year. However, three years ago, none of us expected to find ourselves in the middle of a global pandemic, when even the most rudimentary health and care tasks became fraught with risk and uncertainty."
        },
        {
            "text": "As social care leaders, clinicians, medical scientists and governments strove to formulate a defence against a new virus we all, understandably, new little about, our frontline colleagues across the health and care system continued to do what they do best: protect the most vulnerable from threats to their health and wellbeing."
        },
        {
            "text": "Sadly, some colleagues succumbed to infection themselves and died as they strove to help others live. The loss to their family, friends and loved ones is incalculable. We mourn these brave, compassionate and dedicated individuals every day."
        },
        {
            "text": "In some cases, they may have been the sole or main earner in their household, so their passing will have undoubtedly added financial worry to families and dependants already grieving for a much loved partner or relative."
        },
        {
            "heading": 2,
            "text": "Duty of care"
        },
        {
            "text": "While take up of the scheme by NHS staff dependants has been relatively high, the number of claimants in the social care sector is much lower than it should be. If you’re a care provider, I urge you to contact the families and dependents of colleagues you sadly lost and share this information with them. As the cost of living continues to put a strain on the nation’s finances, it is our duty of care, as senior managers and leaders, to signpost financial relief which could make all the difference."
        },
        {
            "text": "The scheme was extended to 30 September 2023, in respect of deaths which occurred on or before 31 March 2022. That closing date is fast approaching. I ask all employers to play their part in supporting and submitting claims for the families of late colleagues, without delay."
        },
        {
            "text": "Full details of the scheme claim form are available on the NHS website."
        }
    ]
}