{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/08/24/piloting-a-new-model-for-assessing-policymaking-environments-our-take-aways-at-hmrc/",
    "title": "Piloting a new model for assessing policymaking environments: our take-aways at HMRC",
    "authors": [
        "Natalie Corbett"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2023-08-24T12:00:29+01:00",
    "content": [
        {
            "text": "Throughout 2022, HM Revenue & Customs (HMRC) partnered with the Policy Profession Unit (PPU) on their Shared Policy Capability Project. Sponsored by our Head of Policy Profession, Cerys McDonald, we worked with a diverse group of policymakers from across our department to develop a model for departments to assess their policy environment."
        },
        {
            "text": "Over three months, the PPU team facilitated a self-assessment of HMRC’s policymaking environment, through which evidence and insights were gathered and discussions about opportunities for improvement started. It was a bottom-up and collaborative approach allowing an open and honest discussion about our policymaking environment."
        },
        {
            "heading": 2,
            "text": "Bringing together a range of perspectives"
        },
        {
            "text": "This was a genuinely collaborative effort between the PPU team and HMRC. Both teams brought new techniques, approaches, and perspectives to the table. Whilst some project phases took longer than planned or gave rise to unexpected considerations (as with most policy projects), the outcome of the collaboration was really valuable for us."
        },
        {
            "text": "In particular, the assessment model helped us to focus on a number of workstreams which were touching on similar questions, but from different angles. For us in HMRC, these included longer-term strategic exercises, our skills, learning and development programmes, and also areas such as knowledge management."
        },
        {
            "text": "The facilitated self-assessment was also an excellent mechanism to bring together internal stakeholders beyond the ‘usual suspects’ in a meaningful way. We reached out to those involved in policymaking in the broadest sense, but who may not be policy professionals, and colleagues from across grades. We really saw the value in doing this and bringing a huge range of perspectives into our thinking."
        },
        {
            "heading": 2,
            "text": "Understanding our departmental needs first"
        },
        {
            "text": "That said, the programme wasn’t without challenge. We spent much longer than expected in the initial scoping phase of the project, working with PPU to build greater understanding of factors specific to HMRC – such as our formal Policy Partnership with HM Treasury, and how the annual Finance Bill process sets the tempo of policymaking in HMRC. We also identified some parts of the original project plan which would have duplicated existing work undertaken in HMRC and we, therefore, worked closely with PPU to explore how we could ensure that the assessment would build on the foundations we already had. If doing this again, we would also put more emphasis into increasing participation rates and getting the most from the peer review function, making sure we got the most out of a valuable opportunity to engage with a ‘critical friend’."
        },
        {
            "heading": 2,
            "text": "Breaking down silos to tackle issues together"
        },
        {
            "text": "Reflecting back now, my team and I really believe the project drove out useful insights and helped us focus on key themes. Some of those were already on our radar – such as reviewing our governance structures – but the project helped us break down silos and improve our plans to tackle issues together."
        },
        {
            "text": "Other areas were completely new, and the external perspectives and tools helped bring issues into sharper focus – such as how we better empower colleagues to take ownership of projects and decisions."
        },
        {
            "text": "In total, we have taken seven key themes arising from the project and are taking them forwards. We will be keeping PPU updated on our next steps so they can see what we’re doing post-assessment and hope to have positive updates to share in due course!"
        }
    ]
}