{
    "url": "https://educationhub.blog.gov.uk/2023/08/vaccines-for-students-how-to-get-up-to-date/",
    "title": "Vaccines for students: how to get up to date",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Students"
    ],
    "pub_date": "2023-08-24T16:02:41+01:00",
    "content": [
        {
            "text": "Research shows that around 1 in 8 new students starting university or college this year are unprotected against 4 deadly types of meningitis capable of causing serious health complications. "
        },
        {
            "text": "It’s really important that all students make sure they’re up to date with all free routine NHS vaccines and get to know the signs and symptoms of meningitis and septicaemia. It could help save a life. "
        },
        {
            "heading": 3,
            "text": "Why is it important for students starting university or college to be up to date on their vaccines? "
        },
        {
            "text": "Students are particularly at risk from contracting diseases such as meningitis and measles as they mix with large numbers of other students from around the country and overseas. "
        },
        {
            "text": "These diseases can cause serious health problems and can even be fatal. Every year, new and returning students get seriously ill, with some tragically dying from these preventable diseases.  "
        },
        {
            "text": "By getting the necessary vaccines, students are not only protecting themselves, but also protecting others from getting ill. "
        },
        {
            "heading": 3,
            "text": "Which vaccines should all students get? "
        },
        {
            "text": "The three vaccines students should be up to date with before starting university or college include: "
        },
        {
            "heading": 3,
            "text": "What are the symptoms of meningitis?  "
        },
        {
            "text": "Meningitis can kill healthy people within hours and in the early stages is difficult to distinguish from a bad hangover or more common milder illnesses.  "
        },
        {
            "text": "By taking up the free MenACWY vaccine, students are not only protecting themselves but also protecting others by stopping the bacteria from being passed on. "
        },
        {
            "text": "For young people who have already been vaccinated, it’s still important to be aware of the signs and symptoms of meningitis because the free vaccine does not protect against MenB, which is the most common cause of life-threatening meningitis amongst this age group. "
        },
        {
            "text": "Symptoms include: "
        },
        {
            "heading": 3,
            "text": "How do I find out whether I’m up to date on my vaccines? "
        },
        {
            "text": "Contact your GP to find out which vaccines you’ve already received if you’re not sure, or look at your red book which records the vaccines you’ve had.  "
        },
        {
            "heading": 3,
            "text": "How much do the vaccines cost and how can I get them? "
        },
        {
            "text": "Contact your GP surgery to arrange getting a vaccine – for most students, they will be completely free. "
        },
        {
            "text": "HPV vaccines were first introduced to girls before being extended to boys in year 8 aged 12 and 13 in 2019."
        }
    ]
}