{
    "url": "https://civilservice.blog.gov.uk/2022/01/24/civil-service-awards-why-victory-is-over-the-rainbow/",
    "title": "Civil Service Awards: Why victory is ‘over the rainbow’",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-24T16:33:17+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Civil Service LGBT+ Network, led by John Peart, triumphed in the prestigious Developing and Supporting People category for its groundbreaking mentoring scheme. "
        },
        {
            "text": "As winning reactions go, it’s fair to say that John Peart’s on cloud nine right now. As the person behind the programme, John scooped the accolade on behalf of the LGBT+ mentoring scheme, one of the largest of its kind across the Civil Service. What makes it even more remarkable is that John set the programme up in his spare time, working from his living room over evenings and weekends."
        },
        {
            "text": "Ask John to sum up his victory, and his reaction comes straight from the heart: “Over the rainbow!” he smiles. “Honestly, there were points where running this programme seemed near impossible, so to have been shortlisted, let alone win, was already a shock!”"
        },
        {
            "text": "Since work began in April 2021, the programme has signed up an impressive 425 mentors and 550 mentees, whilst more than 500 people have been given training. More than 1,150 mentoring matches have been created with staff who are at least one grade senior to them. "
        },
        {
            "text": "Developing careers"
        },
        {
            "text": "John explains that the mentoring programme was created for two reasons. Top priority was to support LGBT+ civil servants in developing their career. Another aim was to create greater visibility of LGBT+ role models throughout the Civil Service. Research into the career progression of LGBT+ civil servants found that respondents felt they lacked access to the same career and development opportunities as their straight or cisgendered colleagues. Mentoring was one development opportunity that was cited and has been consistently asked for. "
        },
        {
            "text": "Representation"
        },
        {
            "text": "Whilst a coveted Civil Service award is welcome, you sense that this proud network chair gains most satisfaction from the knowledge that victory is embodies a big win for Civil Service values and representation."
        },
        {
            "text": "“Our networks demonstrate the Civil Service at its best: resourceful, innovative, compassionate and developmental, so to have the programme recognised in this way is the icing on the cake,” says John."
        },
        {
            "text": "John is palpably touched by how much the programme has meant to civil servants in the LGBT+ mentoring programme. John has received many positive and grateful messages from people saying they found it valuable."
        },
        {
            "text": "“The Civil Service LGBT+ Network wanted to run a programme like this for almost a decade,” reflects John. “It’s only been possible because of the huge shifts in our collective ways of working since the pandemic struck. Knowing that not only has it worked, but that it’s seen as a standard bearer is brilliant. Our calculated gamble paid off.”"
        },
        {
            "text": "John thinks the nomination impressed the judges due to the scale of achievement and lightning pace of progress. Although lockdown imposed severe restrictions, there was at least one small silver lining. "
        },
        {
            "text": "“My lack of ability to have a social life certainly provided the time and opportunity to make some quick progress!” he says."
        },
        {
            "text": "Run entirely by volunteers, and delivered without any funding in place, 425 mentors and 550 mentees have already taken part across 80 Civil Service organisations. "
        },
        {
            "text": "Save the celebrations"
        },
        {
            "text": "Given that the Civil Service LGBT+ Network team is spread all over the country, John plans to save celebrations for the next time they can meet each other face-to-face. “Meanwhile, we’ve been celebrating with a few bubbles over video call!”"
        },
        {
            "text": "Asked to describe the most rewarding aspect of winning, John reflects for a moment, recognising the mammoth shared team effort. "
        },
        {
            "text": "“This programme only works because people came forward to help make it work,” says John. “Without those 425 people giving up their time to be mentors, none of it would have been possible. So what I’m proud of is that this programme demonstrates that the Civil Service is dedicated to putting other people first. It’s the little acts of selflessness that keep opportunities like this alive. I hope the award will inspire more people to get involved next time. That will be reward enough.”"
        },
        {
            "text": "Challenge John to sum up what he likes about a) his job and b) being a civil servant and he is torn. “I don’t think you can really separate the two!” he says finally. “What I love about every job I’ve done in the Civil Service is that it makes a difference. Everything we do, whatever our roles are, touches people’s lives. The best thing about public service for me is getting to see the impact of your work in the real world.”"
        },
        {
            "text": "New year,  new challenge"
        },
        {
            "text": "Next? John, a Grade 6, is starting the New Year with a bang with a new job, switching from the Department for Digital, Culture, Media and Sport to the Government Equalities Office, which is part of the Cabinet Office. "
        },
        {
            "text": "“As for the mentoring programme, we intend to run it again later this year; so if you’re reading this and you’re LGBT+, look out for that in a few months time!”"
        },
        {
            "text": "www.civilservice.lgbt/mentoring"
        }
    ]
}