{
    "url": "https://civilservice.blog.gov.uk/2022/01/24/civil-service-awards-2021-keeping-up-with-the-jones/",
    "title": "Civil Service Awards 2021: Keeping up with the Jones ",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-24T16:47:55+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Civil servant Andrew Jones has snapped up the Rising Star Award at age 45, but promises that ‘The best is yet to come!’"
        },
        {
            "text": "Only 16 months after joining HM Courts & Tribunals Service, Andrew Jones is going places at break-neck speed. Andrew is a Band E working in customer services and admin, based in Stoke."
        },
        {
            "text": "Andrew, a languages graduate, dipped his toe in accountancy before spending just shy of 20 years in hospitality management. He joined the Civil Service in August 2020, scooping the Rising Star accolade just 16 months later, making his turbo-charged trajectory all the more impressive. "
        },
        {
            "text": "Perhaps the cherry on top is that Andrew was named Rising Star winner at the relatively mature age of 45, making victory even sweeter. "
        },
        {
            "text": "“I thought it might be won by somebody in their early 20s so I was quite astounded and, so far, it’s the highlight of my Civil Service career,” smiles Andrew. “I was very pleased to be nominated but never expected for one minute to win, especially with the whole of the Civil Service to choose from. "
        },
        {
            "text": "Age isn't an issue"
        },
        {
            "text": "“It’s amazing to get such recognition after only 16 months in the job,” Andrew adds. “It’s obvious that age isn’t an issue in the Civil Service, which is heartening. It shows you’re never too late to change career and make a success.”"
        },
        {
            "text": "Andrew caught the judges’ eye with his quest to improve the way things are done, always with the drive to make the service better for users. He willingly completed learning, extra work and reports on top of his work role."
        },
        {
            "text": "Judges praised his contributions which not only “benefitted the service at national level” but put together procedures designed to have a daily beneficial impact on staff and service users. “He has an innate ability to engage, inspire and achieve.”"
        },
        {
            "text": "Asked why he thinks he won, Andrew puts success down to his “constant questioning and drive for improvement. My thinking and ideas of better processes for both end users and staff fit perfectly with the current reform programme.” "
        },
        {
            "text": "Andrew introduced ideas designed to speed up efficiency, enabling appellents to be better armed with information and timescales, in turn cutting the need to keep calling up in frustration. Andrew also worked as part of a team manually checking 5,000 cases, yet to be digitalised, prioritising those that needed progressing towards a hearing date."
        },
        {
            "text": "With the Ministry of Justice undergoing reform, Andrew approached his local Change and Improvement team with bright ideas, resulting in a series of incrementally small yet significant improvements. "
        },
        {
            "text": "The Rising Star Award recognises the potential of someone in the first five years of their Civil Service career. However, Andrew is determined not to rest on his laurels and is already eyeing up his next move. “I’m currently helping Probate and come spring, I’ll move again, it all depends what opportunities crop up."
        },
        {
            "text": "“I’d love to be highly involved in the reform and/or change and improvement programmes: making things better for everyone, both staff and public, making practical changes that benefit all.”"
        },
        {
            "text": "Personalised service"
        },
        {
            "text": "With the Civil Service undergoing transformation, Andrew is keen to see a cutting-edge organisation “that works in the modern world” whilst offering a personalised service wherever possible. "
        },
        {
            "text": "“We really do listen to people, take time to understand their issue and can make a difference. Customer service in this country has often been notorious, historically, but we’re catching up fast with the rest of the world. We can be at the forefront.”"
        },
        {
            "text": "Andrew adds: “I’m proud to be part of the Ministry of Justice, of the improvement work undertaken and the responsibility I feel working in such an environment.”"
        },
        {
            "text": "Away from work, Andrew likes nothing more than spending time in the Peak District with his rescue dogs."
        },
        {
            "text": "Finally, any concerns he may have peaked too soon are given short shrift. “I’m still only a band E so there’s much scope to get more involved with the background and support work. The best is definitely yet to come!” "
        }
    ]
}