{
    "url": "https://educationhub.blog.gov.uk/2022/01/24/did-you-know-the-covid-19-vaccine-is-available-to-anyone-aged-12-15/",
    "title": "Did you know the COVID-19 vaccine is available to anyone aged 12-15?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Secondary schools"
    ],
    "pub_date": "2022-01-24T13:03:23+00:00",
    "content": [
        {
            "text": "We all know that getting a COVID-19 vaccine is the best way we can protect ourselves."
        },
        {
            "text": "Not only that, it protects those around us and helps us live normal lives – this includes helping reduce disruption in schools. That’s why it’s really important that everyone who is eligible for a vaccine, gets it."
        },
        {
            "text": "Here’s what you need to know about the vaccine and why it’s so important for young people and their families."
        },
        {
            "text": "The vaccine is now available is available to anyone aged 12-15"
        },
        {
            "text": "Young people are able to get their first or second vaccine through vaccination or walk in centres. Bookings can be made on the NHS website."
        },
        {
            "text": "Children aged 12 to 15 are also able to receive their second dose of COVID-19 vaccination in their school as part of the school-based COVID-19 vaccination programme. All children who have yet to receive their first dose can have their first at the vaccination session."
        },
        {
            "text": "Young people at greater risk of serious illness — if they catch COVID-19 — will need 2 doses of vaccine, 8 weeks apart. All other young people will be offered 2 doses of vaccine 12 weeks apart."
        },
        {
            "text": "The majority (52%) of eligible 12–15-year-olds have now received their first dose of the vaccine and 10% have already received their second dose."
        },
        {
            "text": "Getting a vaccine reduces your risk of serious illness "
        },
        {
            "text": "The vaccination helps to reduce the chance of COVID-19 infection and provides good protection against serious disease."
        },
        {
            "text": "Vaccination is helping to reduce virus spread among children. Those aged 12-17 who had received a single Pfizer/BioNTech dose had around a 56% lower risk of infection compared to unvaccinated children. The risk was even lower for symptomatic infection, at around 68%."
        },
        {
            "text": "It also reduces the risk of you passing the virus on to others"
        },
        {
            "text": "Research also shows that those who do become infected 3 weeks after receiving one dose of the Pfizer-BioNTech or AstraZeneca vaccine are between 38% and 49% less likely to pass the virus on to their household contacts than those who are unvaccinated."
        },
        {
            "text": "And minimises the risk of disruption to education"
        },
        {
            "text": "Vaccinating children should help to reduce the need for children to have time off school and should reduce the risk of spread of COVID-19 within schools."
        },
        {
            "text": "If we all play our part and get vaccinated, it is estimated that a 60% vaccine uptake among healthy 12- to 15-year-olds will reduce confirmed cases of COVID-19 — in this group in the period up to 31 March 2022 — by 33%."
        },
        {
            "text": "This equates to a reduction of 110,000 school days absent in this age group due to confirmed COVID-19 cases."
        },
        {
            "text": "Booking a vaccine is easy"
        },
        {
            "text": "To support the rollout of the vaccine we have launched the COVID-19 vaccination programme in secondary schools."
        },
        {
            "text": "This means that if your child’s school is involved in the programme, the vaccines will be administered by healthcare staff working closely with the school and following the usual approach to school-based immunisation."
        },
        {
            "text": "Alternatively, you can book your vaccine by visiting the NHS website or speaking to your GP or by finding a walk-in COVID-19 vaccination site."
        },
        {
            "text": "You can access COVID-19 vaccination resources and information here: COVID-19 vaccination: resources for schools and parents - GOV.UK (www.gov.uk)."
        }
    ]
}