{
    "url": "https://insidedio.blog.gov.uk/2022/01/24/encouraging-the-return-of-pine-martens-and-red-squirrels-to-kirkcudbright-training-centre/",
    "title": "Encouraging the return of pine martens and red squirrels to Kirkcudbright Training Centre",
    "authors": [
        "WO2 Scott Maclean"
    ],
    "categories": [
        "Conservation",
        "Environment and Ecology",
        "Wildlife"
    ],
    "pub_date": "2022-01-24T15:45:03+00:00",
    "content": [
        {
            "text": "Two pine martens in the wild. [Copyright Iain Leach Photograph]As Deputy Training Safety Officer for Kirkcudbright Training Centre in Dumfries and Galloway, I’ve been spending some of my time on a project designed to help Scotland’s native red squirrels."
        },
        {
            "text": "Kirkcudbright Training Centre is primarily used for infantry training, including live firing, and stretches over approximately 1,900 hectares (4,700 acres) of varied landscape and habitats."
        },
        {
            "text": "Soldiers from 101 Regiment Royal Artillery moving the Guided Multiple Launch Rocket System (GMLRS) to a firing position at Kirkcudbright Training Centre in 2020. [Crown Copyright / MOD 2020]Looking after our land and wildlife is extremely important to DIO, but despite a personal interest in conservation it’s not typically something I get too involved in as a training safety officer."
        },
        {
            "heading": 2,
            "text": "Introducing pine martens to help red squirrels"
        },
        {
            "text": "However, I’ve been working with the Dumfries and Galloway Pine Marten Group on an initiative to encourage a permanent population of pine martens. Research has shown that where pine martens have been reintroduced or encouraged, red squirrels flourish. This is because pine martens are a natural predator of squirrels, but red squirrels are much more cautious of pine martens than their grey cousins."
        },
        {
            "text": "There is evidence of existing pine marten activity in the area, but it is mostly migratory. To help change that, we’ve obtained funding from DIO’s Conservation Group to install six pine marten den boxes. These replicate large tree cavities, which are not that common in nature, and form a safe area where pine martens can breed and spend the winter. I’m hopeful the boxes will help a small, permanent pine marten population to develop and reduce our grey squirrel numbers, encouraging a resurgence of their red cousins."
        },
        {
            "text": "We’ll be monitoring the pine marten den boxes using trail cameras and if this initiative is successful, I’d like to expand it to more of Kirkcudbright Training Area."
        },
        {
            "heading": 2,
            "text": "Balmae Lake regeneration"
        },
        {
            "text": "This work forms part of a wider project to rejuvenate the Balmae Lake region of Kirkcudbright Training Centre. Working with our industry partner Landmarc Support Services, we’ve removed non-native plant species such as rhododendron, montbretia and bamboo and replaced them with Scottish wildflowers. The hope and intention is that this will increase insect numbers and diversity of insect species."
        },
        {
            "text": "Balmae Lake. [Crown Copyright, MOD 2021]We’ve also removed scrub to allow more light to reach the forest floor and have improved the path around the lake and added a small picnic area to encourage responsible public access. Canadian pond weed has been removed from the lake and a new sluice gate installed to allow the water level to be raised to its natural depth, which has increased water quality and flow dramatically. I’m also planning to reintroduce native fish species, primarily brown trout."
        },
        {
            "text": "As you can see a lot of work has gone into this and I’m not finished yet!"
        }
    ]
}