{
    "url": "https://educationhub.blog.gov.uk/2022/01/24/everything-you-need-to-know-about-how-were-helping-young-people-and-adults-get-the-skills-they-need-to-succeed/",
    "title": "Everything you need to know about how we're helping young people and adults get the skills they need to succeed",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2022-01-24T16:16:28+00:00",
    "content": [
        {
            "text": "Skills are at the very heart of our plans to make sure we can not only recover from the pandemic, but we can thrive – giving people from every part of the country the opportunity to get a good, well-paid job and make sure employers have what they need to grow their business."
        },
        {
            "text": "Four new campaigns have just launched to help young people, adults and employers get the skills they need and to get more skilled workers into the FE sector to teach and share their expertise. Here’s what you need to know about them all and where you can find out more…"
        },
        {
            "heading": 3,
            "text": "We’re calling on those with industry experience to share their skills by teaching in further education"
        },
        {
            "text": " \nA new Further Education recruitment campaign is calling on those with experience in their industry to share their skills by  teaching in further education, alongside their current job."
        },
        {
            "text": "With research showing that almost two thirds of employees (63%) already work more than one job or are planning to do so, the new campaign is asking professionals to apply the skills and experience they have gained through years of working in industry and turn their hand to teaching in FE – giving students the practical, expert training they need to prepare them for work. There is particular demand for skilled workers from sectors such as Construction; Engineering and Manufacturing; Legal, Finance and Accounting; Digital and IT; and Health and Social Care."
        },
        {
            "text": "To find out how to share your skills and teach in FE, visit: https://www.teach-in-further-education.campaign.gov.uk/"
        },
        {
            "heading": 3,
            "text": "Helping young people work out their next step"
        },
        {
            "text": "There’s an exciting range of education and training pathways available to young people, from T Levels and apprenticeships to Higher Technical Qualifications and traineeships, but making the decision on what next step to take can be an overwhelming and confusing process."
        },
        {
            "text": "The new ‘Get the Jump’ campaign, launching today, aims to help tackle this by bringing together, in one place, all of the education and training options available to young people at age 16 and 18 and reassuring them that not knowing what they want to do for a job or career is normal."
        },
        {
            "text": "A new hub, with all the information a young person needs about what choices are available to them, how they compare and where they can lead to, has been created on the National Careers Service website."
        },
        {
            "text": "This new resource will help young people when they are making decisions about their future so that they can get the best start to their working lives."
        },
        {
            "heading": 3,
            "text": "Unlocking training to get the job that you want  "
        },
        {
            "text": "With new research showing that 70% of workers are interested in learning new work skills this year – a new ‘Skills for Life’ campaign has launched to support more adults to develop new work skills or retrain into better jobs."
        },
        {
            "text": "The campaign will showcase hundreds of government-funded skills opportunities for adults - from free careers advice and short courses, to advanced qualifications and on-the-job training - and help adults to make the right choice for them, to support them to get a better job at any stage of life. This includes online learning options and free essential skills courses in numeracy, literacy and digital; sector specific qualifications and Skills Bootcamps; and in-work training; as well as personalised support and guidance from the National Careers Service."
        },
        {
            "text": "To find out more about opportunities to learn new skills visit gov.uk/SkillsforLife."
        },
        {
            "heading": 3,
            "text": "Call on employers to join the skills revolution"
        },
        {
            "text": "With more people keen to upskill or learn new skills, employers are being urged to get on board and take advantage of skills and training initiatives available to them to support their workforce."
        },
        {
            "text": "This campaign highlights the range of support and funding available for businesses wanting to boost their workforce and unlock untapped talent from online courses to boost numeracy to apprenticeships, traineeships and T Levels."
        },
        {
            "text": "Businesses are urged to join the skills revolution and drive better performance, and can learn more about the offers available to them by visiting gov.uk/SkillsSupport."
        },
        {
            "text": " "
        },
        {
            "text": "Look out for content on all the campaigns on Facebook, Instagram, Twitter and LinkedIn"
        }
    ]
}