{
    "url": "https://defrafarming.blog.gov.uk/2022/01/24/farm-visit-hampden-bottom-farm-buckinghamshire/",
    "title": "Farm visit: Hampden Bottom Farm, Buckinghamshire",
    "authors": [
        "Rob Arden"
    ],
    "categories": [
        "A view from the farm",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2022-01-24T13:22:16+00:00",
    "content": [
        {
            "heading": 3,
            "text": "My role"
        },
        {
            "text": "I am a senior policy adviser. My team and I develop advice for our environmental land management schemes. Farmers need good advice so that they can plan and deliver environmental outcomes, particularly through the more ambitious schemes. We blogged about our approach to advice and guidance last year."
        },
        {
            "text": "I’m currently working on advice policy for the Local Nature Recovery scheme (1 of the 3 new environmental land management schemes)."
        },
        {
            "heading": 3,
            "text": "Our visit"
        },
        {
            "text": "The team recently visited Hampden Bottom Farm in Buckinghamshire, where we met Ian Waller, who is a pioneer of the regenerative agriculture movement. Ian has been a tenant at Hampden Bottom Farm since 2000."
        },
        {
            "text": "Ian has a strong personal commitment to the environment, and his aim is to produce high quality products whilst mitigating the environmental impact."
        },
        {
            "text": "This tallies with the intentions of our Sustainable Farming Incentive scheme. It is designed to make agriculture more environmentally sustainable and support farmers in the vital work they do to produce our food. For example, one of the  aims of the Sustainable Farming Incentive in 2022 is to improve soil health – this will have benefits for both the environment and agricultural productivity.  "
        },
        {
            "text": "Over time, Ian says he has noticed more farmers becoming interested and knowledgeable in regenerative agriculture."
        },
        {
            "text": "Some farmers switch to regenerative techniques in order to reduce costs, but over time see the benefits to the environment and develop a keen interest."
        },
        {
            "text": "He is active in BASE-UK, a farmer-led knowledge exchange organisation focused on regenerative agriculture, and the Farming in Protected Landscapes programme within the Chilterns Area of Outstanding Natural Beauty. He advocates the farm cluster model currently supported by the Countryside Stewardship Facilitation Fund to help farmers learn from each other and work together."
        },
        {
            "text": "The aim of the visit was to learn more about Ian’s farming system and the day-to-day challenges he faces, and to hear how my team can best help farmers to access high quality advice when they need it."
        },
        {
            "heading": 3,
            "text": "Soil health: looking after the livestock under the ground "
        },
        {
            "text": "Ian manages his land using regenerative agriculture techniques. He explained how improving the soil is key to all his decisions, and how he looks after the “livestock under the ground” –  the organisms that live in the soil which are crucial for soil health."
        },
        {
            "text": "He uses minimum tillage and plans all his machinery operations carefully to avoid soil compaction. For example, by parking his grain trailer on the headland rather than driving it over the cropped area."
        },
        {
            "text": "He has worked tirelessly to build organic matter in the soil through incorporating straw and importing organic manures from a local turkey breeder. He said that this has delivered great results. He shared that organic matter is currently measured at 8-10%. He estimates that this would have been at 2-3% at the start of his tenancy - based on some neighbouring fields managed in the same way as those he took on in 2000."
        },
        {
            "heading": 3,
            "text": "Promoting pollinators and preventing pests"
        },
        {
            "text": "Ian grows milling wheat, oilseed rape and spring beans on a 6-year rotation that is designed to discourage the build-up of weeds, pests and diseases. The farm is not organic, but Ian is very targeted in his use of sprays and fertilisers, and says that attention to detail is crucial, recognising that every field is different and there is often significant in-field variation."
        },
        {
            "heading": 3,
            "text": "Managing flower-rich grassland "
        },
        {
            "text": "The farm is entered into a Countryside Stewardship Higher Tier agreement, which includes management of flower-rich chalk grassland for the benefit of species such as barn owls, tawny owls and kestrels."
        },
        {
            "text": "To manage this area, Ian established a flock of Herdwick sheep, which he chose because they thrive on poorer quality grazing, produce a good carcass size, and are easy to lamb outside. The flock currently numbers 100 ewes, from which lamb is sold direct to consumers, as well as supplying a supermarket."
        },
        {
            "text": "Some of the sheep have been grazing this year on a herbal ley, which is a mixture of grasses, legumes and other flowers. This improves soil structure and fertility and provides lots of pollen and nectar making it fantastic for wildlife."
        },
        {
            "text": "Over the autumn he mob-grazed the ley, with the field divided into small cells, leaving the sheep to graze each cell for 2-3 days before moving on to the next. This leads to more uniform consumption of forage and distribution of manure. The plant material that is trodden into the ground helps to build soil organic matter."
        },
        {
            "heading": 3,
            "text": "The importance of local advice"
        },
        {
            "text": "We had a really interesting discussion with Ian about advice, and the importance of finding advice you can trust. He works with an adviser from Natural England who helped to set up his Countryside Stewardship agreement, as well as an independent agronomist and an independent environmental adviser."
        },
        {
            "text": "These offer support and he values how they can help him to optimise the outcomes he wants and increase his knowledge. He suggested that we should do all we can to encourage access to independent, locally-based advice to help farmers adapt and grow their businesses through the agricultural transition."
        },
        {
            "text": "So, we are exploring how we can best support the advice sector to build its capacity and capability to support farmers to take part in the schemes."
        },
        {
            "text": "The team found the visit valuable, both through learning about Ian’s farming system and his views on how we can best support farmers through advice and facilitation. I would like to thank Ian for an enjoyable and inspiring day."
        }
    ]
}