{
    "url": "https://valuationoffice.blog.gov.uk/2022/01/24/how-we-value-quarries/",
    "title": "How We Value: Quarries",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2022-01-24T13:18:36+00:00",
    "content": [
        {
            "text": "The Built Environment and Mineral Surveyors (BEAMS) team is part of the National Valuation Unit at the Valuation Office Agency. Their role includes inspecting quarries to assess them for rateable value. In the latest edition of How We Value, Alun Jones from the BEAMS team explains this process in simple terms."
        },
        {
            "text": "Quarries "
        },
        {
            "text": "Quarries are excavations or pits, open to the air, from which minerals are extracted to be used for construction or other practical uses.  These minerals range from the relatively abundant limestones, sandstones and sand and gravel to those regional minerals for example slate and coal and those unique minerals such as fluorspar, centred in Derbyshire or china clay which is worked in Devon and Cornwall."
        },
        {
            "text": "There are around 1,300 quarries in England and Wales ranging from small units producing less than 50 tonnes of specialist masonry stone in a year, to very large sites which produce in excess of two million tonnes of construction stone or aggregate and the combined rateable value for these quarries is in excess of £120 million."
        },
        {
            "text": "The minerals extracted from quarries and the methods of working vary greatly, from drilling and blasting 20 metre benches at hardrock quarries to a one man operation at a remote blockstone quarry, however, the valuations all follow the same principles."
        },
        {
            "text": "With occasional exceptions, it’s fair to say that the average operational quarry does not lend itself to rental comparisons as they are rarely let out as a working unit."
        },
        {
            "text": "Instead, when valuing quarries, we look at several factors to come up with a final figure for their rateable value:"
        },
        {
            "text": "The rateable value of a quarry is the sum of these four elements, however, this rateable value is reviewed on an annual basis."
        },
        {
            "text": "Maintaining an accurate valuation"
        },
        {
            "text": "Although we will now have arrived at our final decision, a distinguishing feature of a mineral lease is the fact that the royalty and rent may vary annually, depending upon the mineral output over the course of a year."
        },
        {
            "text": "To reflect this, it has become custom for valuers to revise the rateable values for quarries each year with effect from 1 April to reflect the actual mineral output."
        },
        {
            "text": "Although the process of compiling the valuation is the same for all quarries, it is dependent on the knowledge and experience of the mineral surveyor to ensure that the rateable value applied to each individual quarry reflects all the factors that have an impact on the valuation."
        },
        {
            "text": " "
        }
    ]
}