{
    "url": "https://homeofficemedia.blog.gov.uk/2022/01/24/update-to-home-office-casework-guidance/",
    "title": "Update to Home Office Casework Guidance",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-01-24T13:02:11+00:00",
    "content": [
        {
            "text": "Home Office casework guidance has been amended to correct a small error in relation to the ‘two year rule’."
        },
        {
            "text": "Individuals who have Indefinite Leave to Remain (ILR) in the UK lose this status after two years’ absence from the UK, which is known as the ‘two year rule’ and has been in place for decades. "
        },
        {
            "text": "However, since 2006 some Home Office guidance has stated that a Commonwealth citizen, who settled in the UK by 1 January 1973, would have been exempt from the two year rule if they returned to the UK before August 1990. "
        },
        {
            "text": "That is incorrect: Commonwealth citizens have always been subject to the two year rule, as have citizens from the rest of the world."
        },
        {
            "text": "This guidance was used to inform the Windrush Scheme and Windrush Compensation Scheme."
        },
        {
            "text": "Who has been affected?"
        },
        {
            "text": "This error has only affected a small number of people in very rare circumstances. "
        },
        {
            "text": "It has affected people who have made applications for certain documentation since 2006. Where people were affected, this would have been to their benefit. "
        },
        {
            "text": "A small number of applicants to the Windrush Compensation Scheme may also have been paid or offered more compensation than they should have been entitled to. "
        },
        {
            "text": "As is only right, we will honour claims that have already been made to the Compensation Scheme in order to ensure that no one will unfairly lose out as a result of this error coming to light. "
        },
        {
            "text": "In addition, some individuals were incorrectly issued documentation stating they had ILR. We have amended the Windrush Scheme so that they can have that status confirmed free of charge. "
        },
        {
            "text": "The vast majority of applicants to the Windrush Scheme and Windrush Compensation Scheme will not be affected, even where individuals have previously spent more than two years living overseas. "
        },
        {
            "text": "How many people have been affected?"
        },
        {
            "text": "A very small number of people have been affected. "
        },
        {
            "text": "Where individuals have been affected by this error, this would have been to their benefit. No individuals have been refused documentation or prevented from coming to the UK as a result of this error. "
        },
        {
            "text": "Anyone who thinks they could have been affected should get in touch with the Windrush Help Team who will help them formalise their status free of charge.   "
        },
        {
            "text": "What action have we taken to fix the error?"
        },
        {
            "text": "After discovering the error, we completed a comprehensive review of the historical Immigration Rules and previous changes to Home Office guidance, to make sure there are no other errors. "
        },
        {
            "text": "The Windrush Scheme and Windrush Compensation Scheme guidance remain subject to continual scrutiny and review in order to ensure that they accurately reflect immigration law."
        },
        {
            "text": "We have amended the Windrush Scheme so that anyone affected can be formally granted ILR free of charge.  "
        },
        {
            "text": "The Home Secretary and department remain steadfast in our commitment to members of the Windrush generation."
        }
    ]
}