{
    "url": "https://naturalengland.blog.gov.uk/2022/01/24/updates-to-planning-guidance-to-help-safeguard-englands-protected-species-and-ancient-woodland-ancient-and-veteran-trees/",
    "title": "Updates to planning guidance to help safeguard England’s protected species and ancient woodland, ancient and veteran trees",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Protected sites and species",
        "Uncategorized"
    ],
    "pub_date": "2022-01-24T16:21:36+00:00",
    "content": [
        {
            "text": "Recently we updated our standing advice to help local planning authorities take planning decisions which protect and enhance England’s irreplaceable ancient woodland, ancient and veteran trees and our rare and threatened species."
        },
        {
            "text": "Natural England’s role is to provide advice to local planning authorities (LPAs) on the impacts of development on the natural environment and opportunities for environmental gains. Well-planned and designed development proposals can avoid adverse impacts on England’s protected species and irreplaceable ancient woodlands and trees, enhance existing habitats for wildlife or create new ones. In this way, development and infrastructure can make a valuable contribution to nature’s recovery."
        },
        {
            "text": "It is a priority for us to make sure that local authority planners have the right guidance to hand when they are involved in planning decisions that could affect ancient woodlands and protected species. As part of this goal, this month we have updated our standing advice for LPAs on Protected Species. We and the Forestry Commission have also updated our joint standing advice on Ancient Woodland, Ancient and Veteran Trees."
        },
        {
            "text": "This formal advice sets out how decision makers should fully assess, avoid, mitigate and, as a last resort, compensate for the negative impacts from development and infrastructure proposals on protected species and on ancient woodland, ancient and veteran trees. It will help LPAs make decisions on planning applications that better protect these species and irreplaceable habitats."
        },
        {
            "text": "How should the standing advice be used?"
        },
        {
            "text": "The standing advice is provided in place of an individual response to a consultation on a planning application and should be taken into account by planning authorities when making decisions on development proposals."
        },
        {
            "text": "Providing LPAs with this standing advice to address commons issues means we can focus our efforts on advising on planning issues that affect designated nature conservation sites and issues that require a bespoke response. LPAs should continue to consult us where development proposals might affect sites of special scientific interest or other protected sites but we will only provide advice if consulted on other cases in exceptional circumstances. The Forestry Commission should continue to be contacted for advice on issues not covered by the ancient woodland standing advice."
        },
        {
            "text": "What changes have been made to the guidance?"
        },
        {
            "text": "We revised this guidance in consultation with key stakeholders, and have improved the clarity for users, ensured better alignment with national planning policy and provided additional detail on some issues."
        },
        {
            "text": "The updated Protected Species standing advice covers bats, badgers, hazel dormice, water voles, otters, wild birds, reptiles, protected plants, fungi and lichens, white-clawed crayfish, freshwater pearl mussels, invertebrates, freshwater fish, and natterjack toads. Some further amendments have also been made to great crested newt standing advice, including advice about District Level Licensing. Minor changes have been made to the main Local Planning Authority advice page and the separate guidance for developers."
        },
        {
            "text": "To summarise the key changes in relation to protected species, we have streamlined and simplified advice for local authority planners with clearer distinction between planning and licensing requirements and updated links to other guidance."
        },
        {
            "text": "In regard to ancient woodland, ancient and veteran trees, we’ve added further detail on the effects of development, on mitigation and compensation measures and the factors to be considered for buffer zones such as if the surrounding area is less densely wooded, close to residential areas or steeply sloped. We’ve also updated the supporting assessment guide to help planning authorities record their decisions."
        },
        {
            "text": "By carefully considering the impacts of development and taking measures to avoid or mitigate for impacts and design in gains for nature, development proposals can contribute to nature’s recovery."
        },
        {
            "text": "Your feedback\nWe would welcome your feedback on the updated standing advice. Please send any comments to Joanna.Russell@naturalengland.org.uk"
        }
    ]
}