{
    "url": "https://ipo.blog.gov.uk/2022/07/06/celebrating-british-ip-day-with-great-success-stories/",
    "title": "Celebrating British IP Day with great success stories ",
    "authors": [
        "Nic Fearon-Low"
    ],
    "categories": [
        "British IP Day",
        "Business",
        "Copyright",
        "IP research",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-07-06T11:33:46+01:00",
    "content": [
        {
            "text": "At the Intellectual Property Office we like to celebrate intellectual property every day. British IP Day, however, gives us that extra excuse for sharing some great IP success stories."
        },
        {
            "text": "We spoke to three very different companies whose valuable Intellectual property has elevated their success to another level. Together with support from Local Enterprise Partnerships, the Growth Hubs and partners Innovate UK Edge, they have used IPO’s free IP business tools and the IP Audit scheme to identify and use the IP in their business to help them grow.  "
        },
        {
            "heading": 2,
            "text": "VisitMôr - enhancing and enriching magical visitor experiences "
        },
        {
            "heading": 2,
            "text": " "
        },
        {
            "text": "When visiting natural landscapes and attractions such as country parks, wetlands and bird sanctuaries, have you noticed how much your cultural experience has been inspired and enhanced by clear and colourful visitor interpretation? It could be the work of Bristol-based success story, VisitMôr. They create magical ways for people to reconnect with the natural and cultural heritage of sites the length of the British Isles.  "
        },
        {
            "text": "Founder Beth Môrafon explained how expert support, including using IPO’s free IP Health Check and IP Equip tools, helped her make maximum use of the intellectual property in her IP-rich company. Beth told us how this made it easier for her to seek and secure investment and develop and exploit new services.  "
        },
        {
            "text": "Beth explained:  "
        },
        {
            "text": "“After a session with an IP expert who downloaded everything I could possibly need to know, I better understood that I needed to protect, and make the most of, my valuable IP for the benefit of the business.”  "
        },
        {
            "text": "Beth worked with the West of England Combined Authority and their ‘We Are Growth’ Growth Hub.   "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Multus – sustainable food sources for a better future "
        },
        {
            "text": " "
        },
        {
            "text": "Food sources with a lower environmental impact are figuring increasingly in our daily conversation as we seek to build a better future for the generations to come.  "
        },
        {
            "text": "South-East based, pioneering biotech company, Multus, is paving the way to the future by developing sustainable food sources. Working with Innovate UK Edge, an IP Audit highlighted areas where the company could use their IP to develop more profitably.  "
        },
        {
            "text": "Co-founder and CEO Cai Linton told us: "
        },
        {
            "text": "“The decision to bring in expertise to assist our growth has been a real game changer. Better understanding of our IP, through an IP Audit, was critical to working out how best to exploit our technological advancements in a sustainable and profitable way.” "
        },
        {
            "text": "IPO funding was used to implement recommendations in the audit report. These contributed to the growth of the company, adding five new jobs and accelerating the Multus product to market still further. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Pet Weighter – weighted bowls for our four-legged friends "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "They come in all shapes and sizes, can be loyal, fun, part of the family and our best friends. Above all, they can be bouncy...and that’s not so great when full bowls of pet food and water are sent flying!  "
        },
        {
            "text": "Rob Peacock of Pet Weighter came up with a brilliant solution – weighted pet bowls. We spoke to him about his West Midlands success story.   "
        },
        {
            "text": "Rob has seen his company grow quickly and expand into overseas markets. Using their IP has been a cornerstone of this success. This has led to increased resilience, confidence and competitiveness where IP is concerned. "
        },
        {
            "text": "Rob explained: “I did a full IP review with the IPO’s help and I don’t think we’d have been able to grow the business as much without this support. It helped us understand what work we needed to do to enter new markets overseas.”  "
        },
        {
            "text": "Pet Weighter worked with Greater Birmingham and Solihull Local Enterprise Partnership and Growth Hub for IP support.  "
        },
        {
            "text": " "
        },
        {
            "text": "Tim Moss, IPO CEO said: “Businesses across the UK never cease to inspire and amaze me when I see how they are making the world a better place. It’s always rewarding to see how they can soar to new heights propelled by making the best of their IP.”"
        },
        {
            "text": " "
        },
        {
            "text": "We loved celebrating #BritishIPDay with these three great success stories which certainly left us feeling waggy-tailed on British IP Day! "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "IPO’s free online business tools "
        },
        {
            "text": "IP Health Check - helps identify what intellectual property (IP) your business owns. "
        },
        {
            "text": "IP for Business tools  "
        },
        {
            "text": "IP Equip e-learning tool "
        },
        {
            "text": "IP for Investment  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Support around the UK and overseas "
        },
        {
            "text": "England: Local Enterprise Partnership Growth Hub "
        },
        {
            "text": "Scotland: Scottish Enterprise. "
        },
        {
            "text": "Wales: Welsh Government business support.  "
        },
        {
            "text": "Northern Ireland: Invest NI covers  "
        },
        {
            "text": "UKRI Innovate UK Edge  "
        },
        {
            "text": "UK Patent Library Network Patlib "
        },
        {
            "text": "Business and IP Centres BIPCs  "
        },
        {
            "text": "Overseas: The IPO attaché network "
        },
        {
            "text": " "
        }
    ]
}