{
    "url": "https://ruralpayments.blog.gov.uk/2022/07/06/introducing-you-to-7/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Introducing You To"
    ],
    "pub_date": "2022-07-06T13:27:21+01:00",
    "content": [
        {
            "text": "Hi, I’m Andrew. I’m part of the Countryside Stewardship (CS) Applications Higher Tier team and I’m based in Nottingham. I’ve been with RPA just over a year now and have worked on Higher Tier since last September. Primarily I work on processing Higher Tier CS applications, but I also help out with Mid Tier pre-approval queries and do some Customer Relationship Management coaching too."
        },
        {
            "text": "For me a typical day is based around the applications I’m working on and collaborating with my team on any issues we may encounter. One of the things I’m so grateful for here is that my colleagues have their own individual areas of expertise, meaning I know I can find the answer to any questions I have. I have intermittent mobility issues due to a problem with my ankles, so I can’t always walk very easily. Sometimes I use a cane when it’s bad, or at its worst I can’t really get out, so I’m grateful that I have a team that works with me brilliantly whether I’m in the office or at my kitchen table, where my work day is observed by our two family cats."
        },
        {
            "text": "I feel that my role as part of the Higher Tier team is about more than just processing applications, as we help our customers work through any complications with their applications and any queries they may have. We’re constantly in touch with customers and agents and I feel we help to build relationships that work well for everyone involved. By continuing to do our utmost to deliver the best results possible while facing challenges in a proactive and positive manner, we can continuously improve the support we provide to our customers."
        },
        {
            "text": "A driving force in all that I do is the humanisation of large organisations. I developed this interest in a previous role at the head office of a large national retailer, where I was deeply involved with designing and developing the brand ‘tone’ in terms of their customer care social media presence, which reached over four million people a day. It’s important to me that our customers and the wider society know that the Civil Service isn’t some kind of amorphous mass. It’s an organisation filled with dedicated people doing their best for the people we serve. We’re people with a passion for making a difference."
        },
        {
            "text": "Prior to RPA I was a copywriter at a digital consultancy, writing content for everything from timber merchants and carpet companies to bespoke accountants and even a dog therapy company. I wrote for a national music magazine for nine years, interviewing rock stars including members of Kiss, Journey, Def Leppard, Halestorm, Evanescence, Joe Bonamassa, Arch Enemy and many more. I had a column in a horror film magazine and have also written fiction for Judge Dredd and Doctor Who comics."
        },
        {
            "text": "Outside work my time is quite packed with running a YouTube channel, a podcast, screenwriting, writing comic book scripts and fiction. I’ve written 14 books and have two more coming this year. This summer will also see me end a 16 year hiatus and play guitar at a music festival as a favour to a friend. The most important things in my life though, are my two sons and my wife. She’s with the organisation too so I thought I should mention that in case she sees this. Hi darling – I’ll take the bins out in a bit!"
        }
    ]
}