{
    "url": "https://lifeathmrc.blog.gov.uk/2022/07/06/managing-together-part-4-discover-what-its-like-to-be-one-of-hmrcs-13000-managers/",
    "title": "Managing Together (part 4) – discover what it’s like to be one of HMRC’s 13,000+ managers",
    "authors": [
        "Kinga Kaminska"
    ],
    "categories": [
        "General",
        "Management"
    ],
    "pub_date": "2022-07-06T14:31:37+00:00",
    "content": [
        {
            "text": "Here we are on our 4th blog of the 5-part series on core manager functions."
        },
        {
            "text": "This time Kinga will explain how planning and organising plays a huge part in managing a team effectively."
        },
        {
            "heading": 2,
            "text": "Planning and organising within my team"
        },
        {
            "text": "I work in Debt Management where we use external Debt Collection Agencies (DCAs) to pursue the collection of HMRC debt."
        },
        {
            "text": "Before joining HMRC in 2021 I used to be secondary school teacher, within the management tier. As I loved the management side of the job, I decided a change of career would suit me, so began both an MA Leadership/Management, and my search for a new role. A family member spoke so highly of HMRC as a great employer, having had a 30-year career within the department, I was encouraged to apply to work here."
        },
        {
            "text": "I now manage a team who deal with enquiries within HMRC’s Debt Market Integrator Operations Team. We are notified of changes of circumstances, such as address changes, deaths and insolvency cases, and my team is responsible for clearing these queries and tasks."
        },
        {
            "text": "By using appropriate methods that apply repetition and create positive habits, I effectively manage my own time. I plan and organise using day-to-day to-do lists, in order of priority, around scheduled meetings. This enables me to manage my time during the day and fit in unexpected ad-hoc tasks and meetings, making time to chat to my team!"
        },
        {
            "text": "The work my team and I receive varies, and there are always unforeseeable events during the day. My team is made up of skilful colleagues who can multitask and navigate through various systems simultaneously, so I take this into account when I am scheduling and allocating any ad-hoc work that comes in."
        },
        {
            "text": "Rather than dictating what my colleagues need to do each day, they use a query portal to assign themselves tasks. This helps to give autonomy, allows flexibility and increases engagement and a sense of satisfaction when completing tasks. There are a variety of jobs to be done daily, and by getting to know my team better, considering their strengths and needs, I know what they thrive on, so this helps when organising the daily flow of work."
        },
        {
            "text": "As well as daily well-being chats, checking everyone is ok, I plan regular chats with my team regarding development and trying new tasks. This helps me to set achievable goals, ensuring deadlines are met without compromising quality over quantity. Having these chats about workload means I can replan work and reassess delegated tasks if needs be. In addition to this, we have flexible working, which has built mutual respect and trust throughout the team. For example, if an extended break is needed then colleagues know they can do this, knowing no-one takes advantage, and I can plan accordingly if needed."
        },
        {
            "text": "In my spare time, outside of work, I am a Trustee for a charity. This has involved budgeting and hiring of staff, which I’ve found has helped with my planning and organising skills. I am excited and proud that this July will see me flying out to Kenya to assist a school with no tech facilities. We will be providing the school with projectors, helping to improve the education and learning experiences of the disadvantaged children there. I have found that this charity work has helped me lead my team in HMRC. Learning the need to adapt to situations and prioritise accordingly, while also seeing the benefit of different personalities within a group, some people being leaders, some followers."
        },
        {
            "text": "In my current team at HMRC, we use a buddy up system, regularly switching pairings to share tips. We find this is a great way of learning for new starters and established team members alike, as it’s a useful refresher, ensuring methods don’t get stale."
        },
        {
            "text": "Having a skilful workforce around me, who are flexible and adaptable, makes us thrive. We have such positivity throughout our team, and I’m pleased that I often hear how welcoming and friendly our department is. Staff feel well looked after, and comment how our managers are approachable and open to conversation, and I can honestly say this is something I have experienced for myself since joining HMRC."
        },
        {
            "text": "If you haven’t already, catch up with our previous editions in the series where Kyle, Carol and Kian talk about how they own, and initiate, engage and lead and support and develop within their teams."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}