{
    "url": "https://aphascience.blog.gov.uk/2022/07/06/vector-borne-diseases/",
    "title": "Taking the sting out of vector borne diseases",
    "authors": [
        "Luis Hernandez-Triana",
        "Suzanna Bell"
    ],
    "categories": [
        "Parasites",
        "Viral diseases"
    ],
    "pub_date": "2022-07-06T13:46:50+01:00",
    "content": [
        {
            "text": "Doctor Luis M. Hernández-Triana and Suzanna Bell BVMS MSc, are APHA Discipline Champions and experts in the field of vector borne diseases. In this blog, they describe how APHA are involved in vector borne disease research and the importance of these emerging pathogens."
        },
        {
            "text": "Vector borne diseases (VBD) have been recognised since the 1980s as a rapidly growing group of diseases threatening human, animal, bird and plant health worldwide. The vector borne group of diseases is diverse and includes parasites, bacteria and viruses that are transmitted by a range of arthropod vectors, including biting insects and ticks."
        },
        {
            "text": "Many VBDs occurring in animals have the potential to cause human infection meaning this group of diseases includes many important zoonotic infections. The World Health Organization (WHO) stated that more than 17% of all infectious diseases in people are caused by vector-borne diseases, causing more than 700,000 deaths annually."
        },
        {
            "text": "Vector borne diseases are often complex. Research, particularly using molecular methods, are helping us develop an increased understanding of the pathogens, vectors, and vector-host interactions. Research advances have globally accelerated the discovery of new diseases and improved knowledge on managing, preventing and treating VBDs."
        },
        {
            "text": "VBDs are likely to remain a major focus of concern and interest for the future with climate change, globalisation and new introductions of invasive species likely to continually increase the risk of new emergence and epidemics involving VBDs."
        },
        {
            "text": "APHA plays an important role as the UK National Reference Laboratory for mosquito-borne viruses such as West Nile Virus. We have research specialists in vector borne disease and a veterinary surveillance network and carry out a wide range of VBD work including vector competence studies, diagnostics and monitoring of endemic livestock diseases and screening for new and emerging vector-borne disease in livestock, companion animals and wildlife."
        },
        {
            "heading": 3,
            "text": "Zoonotic Vector borne disease work highlights:"
        },
        {
            "heading": 4,
            "text": "Vector competence studies"
        },
        {
            "text": "Research into UK mosquito competence and viral transmission dynamics for several emergent or re-emergent zoonotic pathogens such as Usutu, Zika virus, Japanese Encephalitis virus and Rift Valley fever virus have been undertaken. Plans are underway to carry out competence studies using temperatures representative of the UK summer climate, especially with Japanese Encephalitis virus and Culex pipiens. You may wish to read the latest paper on the subject."
        },
        {
            "heading": 4,
            "text": "West Nile virus"
        },
        {
            "text": "APHA has conducted surveillance for mosquito-borne viruses in birds within the UK for over 15 years, with a particular focus on West Nile virus (WNV). WNV is carried by birds and can cause notifiable disease in humans and horses. Although present in southern Europe for decades, the UK is currently free of the disease."
        },
        {
            "heading": 4,
            "text": "Usutu Virus"
        },
        {
            "text": "Closely related to WNV is Usutu virus which was first detected in UK wild birds in 2020, and again in 2021 thanks to continued surveillance and testing and collaborative working with Zoological Society of London (ZSL), Inst. of Zoology (IoZ), and the UK Health Security Agency (UKHSA). Although less virulent in humans and horses, it can cause a lethal disease in certain species of birds, particularly the common (Eurasian) blackbird."
        },
        {
            "heading": 4,
            "text": "Babesia divergens surveillance project in cattle"
        },
        {
            "text": "Babesia divergens is a potentially zoonotic UK endemic tick-borne blood parasite that can cause severe disease in cattle. An APHA project has been testing samples from cattle from across England and Wales, to gain a better understanding of the geographic distribution of this infection and the impacts of the disease on the affected farms."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "You may be interested in reading some of our other related blogs and research papers:"
        },
        {
            "text": " "
        }
    ]
}