{
    "url": "https://companieshouse.blog.gov.uk/2022/07/06/what-to-consider-when-incorporating-a-new-business/",
    "title": "What to consider when incorporating a new business",
    "authors": [
        "Ryan Elliott - Content Manager, Enterprise Nation"
    ],
    "categories": [
        "Company guidance",
        "Starting a business"
    ],
    "pub_date": "2022-07-06T16:45:42+01:00",
    "content": [
        {
            "text": "No matter the business, no matter the sector, no matter the budget, every entrepreneur has one consideration they must address before all others: registration."
        },
        {
            "text": "Before locking in a status, it’s important to take the time to gather information, weigh-up options and take on expert advice. Enterprise Nation’s StartUp UK programme is geared towards supporting these new businesses through the provision of workshops, webinars and blog posts, many of which focus on registration."
        },
        {
            "text": "But where do you start?"
        },
        {
            "heading": 2,
            "text": "What options do entrepreneurs have?  "
        },
        {
            "text": "The company status you choose will determine what financial records you need to keep, as well as the level of general admin you’ll have to undertake. Here are the 3 most common options for business owners looking to register."
        },
        {
            "heading": 3,
            "text": "Limited company"
        },
        {
            "text": "Incorporating through Companies House means the businesses will exist as a separate legal entity. This keeps your own finances separate from the business’—so personal responsibility cannot be derived from any company debts."
        },
        {
            "text": "It’s important for entrepreneurs to have an ongoing relationship with Companies House, to make sure their information is up-to-date and compliant."
        },
        {
            "heading": 3,
            "text": "Sole trader  "
        },
        {
            "text": "If you’ve done your research and feel like incorporating is not for you, then becoming a sole trader might be a better route.  "
        },
        {
            "text": "You'll be working for yourself, which means you'll be solely liable for any debts. But being a sole trader does allow you to keep all profits too.   "
        },
        {
            "heading": 3,
            "text": "Partnership"
        },
        {
            "text": "If you're going into a business with a co-founder, registering as a partnership means both parties are self-employed, and share the risks, costs and workload of starting their enterprise."
        },
        {
            "heading": 2,
            "text": "Is becoming a limited company right for you?  "
        },
        {
            "text": "Many thousands of small businesses are incorporated every single month, a number coming in fresh off the Enterprise Nation StartUp UK programme. But what leads these ambitious and exciting entrepreneurs to take this route?  "
        },
        {
            "text": "For a business owner to decide they are capable of meeting their obligations to Companies House as a director, they need to conduct some research of their own, while also taking the time to speak to the experts. Take Francis Jones, who very recently incorporated his EdTech company:"
        },
        {
            "text": "The importance of absorbing as much information as possible before deciding to incorporate is also explained by Careen Joseph, who owns her own global safeguarding think tank:  "
        },
        {
            "text": "Rebecca Wall, who opened her bookshop, Night Owl Books, in April, made the decision to incorporate her business after attending Enterprise Nation’s StartUp 2022 event back in January, taking advantage of the numerous expert panels on the topic."
        },
        {
            "text": "These 3 entrepreneurs, all owning very different businesses, approached their decision to incorporate in a logical and responsible way, so they can be safe in the knowledge it was a good one.  "
        },
        {
            "heading": 2,
            "text": "The importance of an ongoing relationship with Companies House as an incorporated business  "
        },
        {
            "text": "It’s crucial not to view your association with Companies House as purely a box-ticking exercise – there’s a whole lot more to consider than simply registering your company’s name and paying £12!  "
        },
        {
            "text": "As a director, you are legally responsible for sending Companies House certain pieces of information on time, including:  "
        },
        {
            "text": "Being on top of all things compliance will make your life much easier as a director. "
        },
        {
            "text": "That’s not to say Companies House is the only body you’ll be dealing with as a director. You'll still need to file accounts and tax returns through HMRC, so being certain these additional duties can be met is another key pillar of your decision making.  "
        },
        {
            "text": "There's so much to remember as a new business owner. So it's important to incorporate your company with your eyes wide open, with the weight of due diligence behind you."
        }
    ]
}