{
    "url": "https://vets.blog.gov.uk/2022/07/06/world-zoonoses-day-how-you-can-help-protect-our-dogs-from-brucella-canis/",
    "title": "World Zoonoses Day – How you can help protect our dogs from Brucella canis",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Disease outbreak",
        "Government Veterinary Services"
    ],
    "pub_date": "2022-07-06T12:03:36+01:00",
    "content": [
        {
            "text": "World Zoonoses Day is held every year to commemorate the first vaccination against zoonotic disease – infectious diseases caused by bacteria, viruses, and parasites spread between animals and humans. World Zoonoses day is particularly timely this year to highlight the risk of canine brucellosis."
        },
        {
            "text": "We have recently witnessed a significant increase in cases of Brucella canis detected in the UK in imported dogs. It is very upsetting for dog owners when their pet is confirmed as infected and dog owners are key in supporting our efforts, which is why I am now asking for your help."
        },
        {
            "text": "What are we fighting against?"
        },
        {
            "text": "Canine brucellosis is a very unpleasant infection for dogs.  It is painful, whilst also presenting a life-long health risk to both humans and other dogs that come into contact with the infected dog.  Infection causes reproductive disorders and chronic illness in dogs, with chronic cases often suffering from spinal problems. There is no vaccine currently available, treatment is long, expensive, not always successful and with side effects for the health of the animal."
        },
        {
            "text": "Countries with a high stray dog population often have a higher incidence of Brucella canis, as it is most frequently spread through reproductive contact between dogs. Humans can also have serious disease that may require hospitalisation."
        },
        {
            "text": "The statistics are very clear. Prior to 2020, there were only three cases in the UK.  However, since the start of 2020 until the end of 2021, there have been a total of 87 dogs which were positive for Brucella canis infection identified within the UK. Countries of origin were Romania, Bosnia, South Africa, Greece, Afghanistan, Belarus (plus one UK dog which holidayed abroad)"
        },
        {
            "text": "Since the start of 2022, 20 dogs have been identified as positive for Brucella canis so far (all either imported, have been breed with imported dogs, have overseas travel history or descended from imported dogs)."
        },
        {
            "text": "How can you help before importing a dog? "
        },
        {
            "text": "Rescue animals and those used for breeding are at higher risk of infection. Infected dogs that have not been neutered (spayed/castrated) represent the highest risk."
        },
        {
            "text": "To reduce this risk, we recommend prospective owners make sure that any dog imported from countries and regions where Brucella canis is present is tested before arrival. These dogs should be tested approximately a month prior to importation and, if possible, neutered."
        },
        {
            "text": "Why taking action before dogs arrive to the UK is so important"
        },
        {
            "text": "Ensuring dogs are free of Brucella canis before they come to this country helps protect dogs and people from the risk of infection. It also helps avoid significant veterinary costs incurred by any veterinary treatment that may be needed."
        },
        {
            "text": "Following this advice to responsibly and safely import dogs will help prevent the disease from spreading within the UK and affecting more dogs and owners."
        },
        {
            "text": "What to do if you suspect your dog is infected with Brucella canis"
        },
        {
            "text": "You should contact your private veterinary surgeon, who can contact the Animal and Plant Health Agency (APHA) to obtain further information and advice. Your vet can arrange for any testing to be done and in England, Scotland and Wales a positive laboratory diagnosis of Brucella Canis must by law be reported to APHA."
        },
        {
            "text": "Keep dogs with suspect infection away from other dogs and people other than their owners until testing is complete. Owners should ensure that neither a male nor female dog is infected before breeding. Rescue dogs and any dog which has been imported from a country where canine brucellosis occurs or has previously mated with a dog from such a country, or are a contact of a confirmed case, should be tested."
        },
        {
            "text": "What is government doing? "
        },
        {
            "text": "As ever, working together across government and agencies is vital. We joined forces with the APHA One Health team , the OIE Reference Laboratory for Brucellosis at APHA, UK Health Security Agency (formerly Public Health England), PHE and specialist clinicians from the Brucella Reference Unit in Liverpool (Royal Liverpool and Broadgreen Hospital)."
        },
        {
            "text": "In addition, we also work closely with our colleagues in Europe and raise awareness by involving affected people and the broader veterinary and laboratory community."
        },
        {
            "text": "Together, we can better protect our dogs from canine brucellosis."
        }
    ]
}