{
    "url": "https://food.blog.gov.uk/2023/12/04/2023-a-year-in-fsa-science/",
    "title": "2023 - A year in FSA Science",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-12-04T10:23:07+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Professor Robin May, FSA Chief Scientific Adviser (CSA) reflects on the FSA’s commitment to science and the work delivered throughout 2023."
        },
        {
            "text": "The Food Standard Agency’s (FSA) core mission is to ensure food is safe and is what it says it is. Science and evidence lie at the heart of this mission and strong scientific networks help ensure our responses are always underpinned by evidence."
        },
        {
            "text": "I think I’ve said this every year since I’ve been in this role, but at the risk of sounding like a broken record, this year’s (again!) been a busy, interesting and challenging one. From complex food incidents to novel food applications, the science team has demonstrated its resilience during challenging and often unprecedented times, all whilst ensuring that the FSA continues to deliver high-quality, robust science and evidence."
        },
        {
            "text": "As ever, too much has happened this year to do justice to it all, but (with apologies for the things that have been inevitably left out!), I want to mention a few highlights."
        },
        {
            "heading": 2,
            "text": "Making connections across the sectors"
        },
        {
            "text": "Earlier this year the FSA participated in British Science Week for the first time. The theme was ‘connections’, which seemed particularly fitting for the collaborative, multidisciplinary science that FSA relies on. It was an excellent opportunity to highlight the sometimes ‘invisible’ ways in which science is embedded within government, and we’ve managed to continue this theme with other events – most recently when a group of Cardiff University undergraduate students joined part of the CSA away day at Cardiff Castle for an inspiring session of ‘note-swapping’."
        },
        {
            "text": "One of the great privileges of being CSA is to get out and about both in the UK and internationally to learn more and hear about scientific developments in the food sector. This is especially important when the science that underpins a particular food is both complex and fast-moving. I was especially grateful to spend several days visiting the Food Sec and Tech 2023 conference, as well as companies working on cultivated proteins to understand more about the underlying technology and the potential safety risks that we need to be ready to assess. This was an excellent opportunity for the FSA to learn more from world-leading regulators and we gained valuable insights, which will help us shape our future approach to areas such as regulated product authorisations."
        },
        {
            "text": "On a similar theme, I was delighted to visit the Norwich Science Park earlier in the year and see a fascinating mix of research, ranging from Precision Bred crop plants to human microbiome studies. And later in the year I swapped lab coats for welly boots with a visit to Harper Adams University, seeing research projects ranging from robotic tractors to dairy cow metabolism."
        },
        {
            "heading": 2,
            "text": "PATH-SAFE and IID3"
        },
        {
            "text": "Research partnerships underpin a huge amount of our work. I’m delighted that these have grown this year with a number of new projects and programmes starting and some older ones continuing. The FSA-led programme PATH-SAFE (Pathogen Surveillance in Agriculture, Food and Environment) is an exemplar piece of work, which has established collaboration of over 50 cross-government, academic and industry partners. The impact of this programme extends far beyond FSA and as we enter into the final phase of funding for this programme, I’m excited to see not only the longer-term impact of this evidence base, but also how we maintain these partnerships for future workstreams."
        },
        {
            "text": "We have also seen the launch of our flagship research project Infectious Intestinal Disease (IID) 3, partnering with a consortium of government and academic colleagues to bring the government's data on IID up to date for the future."
        },
        {
            "heading": 2,
            "text": "Openness, integrity, and robust networks"
        },
        {
            "text": "Throughout the year, we’ve issued over 20 letters of support to academics from various research intuitions. Of course, not all of these funding bids will be successful. However, maintaining these strong relationships is key in building robust networks with stakeholders, leveraging resource and, perhaps more importantly, ensuring this research has real-world policy implications. I look forward to seeing this workstream grow in the coming years."
        },
        {
            "text": "The FSA is committed to bringing integrity and openness to the research it conducts and commissions through the application of the principles of the Research Integrity Concordat. I’m particularly proud that in May, the FSA were one of the first departments to publish our Annual Statement of Compliance with the Research Integrity Concordat. This describes the steps and actions we’ve taken to meet the Concordat’s principles. This workstream has also brought us newly developed relationships in the form of the cross-government Concordat Working Group (CWG), which meets monthly to discuss the practical considerations of implementing the principles of the concordat in government."
        },
        {
            "text": "We’ve also identified novel ways to undertake research this year and through partnership and joint funding with UKRI, we delivered a package of citizen science research projects across a range of topics which were aligned to the FSA’s areas of research interest. In addition to delivering invaluable data, these projects allow the communities in which we serve to help build the evidence on which policy decisions are made. These relatively small projects can nonetheless have really big impacts – as evidenced by the media coverage of one of them, looking at infant milk preparation machines."
        },
        {
            "heading": 2,
            "text": "New associate members of the SACs"
        },
        {
            "text": "I couldn’t discuss FSA relationships without giving an honourable mention to our Scientific Advisory Committees (SACs) and Science Council. They provide independent expert advice and challenge on FSA science strategy, risk assessment and ensure that policy decisions are based on the most up-to-date science and evidence."
        },
        {
            "text": "In June, I was delighted to welcome 24 new members across the different SACs, of which 10 appointments were made in the new associate membership category. This category is specifically designed to bring on board early-career experts, and I’m delighted to see the fresh perspective this brings to the SACs. Work in the regulated food and feed products space has ramped up over the course of 2023, particularly as we continue to work closely with our committees to develop data requirements for precision bred organisms (PBOs)."
        },
        {
            "text": "In July, our Advisory Committee on Novel Foods and Processes (ACNFP) published the third ACNFP statement on Precision Bred Organisms, which supported the FSA Board discussion in September 2023. This remains a key priority for us as we lead on creating a new regulatory framework for these products and delivering continuous scientific support for incident response for UK food and feed."
        },
        {
            "heading": 2,
            "text": "Glycerol and slush-ice drinks"
        },
        {
            "text": "Of course, science is not all about long-term planning – it also plays a key role in urgent incidents. One example from this year was our response to food safety concerns surrounding young children and their exposure to glycerol in slush-ice drinks. Through joint collaboration with the food industry, we were able to deliver valuable consumer advice at pace, helping protect vulnerable consumers whilst maintaining confidence in the food system as a whole."
        },
        {
            "text": "Looking at the year ahead, the FSA faces a significant new demand for science and evidence, and I have no doubt that there will be plenty of unexpected twists and turns. However, the fantastic range of science expertise within the FSA, our collaborative and supportive culture and, above all, the dedication and commitment of everyone to ensuring food is safe and what it says it is, gives me enormous confidence for the future."
        },
        {
            "text": "Here’s to 2024!"
        },
        {
            "heading": 1,
            "text": "2023 – Blwyddyn mewn gwyddoniaeth yn yr ASB"
        },
        {
            "heading": 2,
            "text": "Mae’r Athro Robin May, Prif Gynghorydd Gwyddonol yr Asiantaeth Safonau Bwyd, yn myfyrio ar ymrwymiad yr Asiantaeth i wyddoniaeth a’r gwaith a gyflawnwyd trwy gydol 2023."
        },
        {
            "text": "Cenhadaeth graidd yr Asiantaeth Safonau Bwyd (ASB) yw sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Mae gwyddoniaeth a thystiolaeth wrth wraidd y genhadaeth hon ac mae rhwydweithiau gwyddonol cryf yn helpu i sicrhau bod ein hymatebion bob amser yn seiliedig ar dystiolaeth."
        },
        {
            "text": "Dwi’n meddwl fy mod wedi dweud hyn bob blwyddyn ers i mi fod yn y rôl yma, ac ymddiheuriadau am swnio fel tiwn gron, ond mae eleni (eto!) wedi bod yn flwyddyn brysur, ddiddorol a heriol. O ddigwyddiadau bwyd cymhleth i geisiadau am fwydydd newydd, mae’r tîm gwyddoniaeth wedi dangos gwydnwch yn ystod cyfnod heriol a digynsail, gan sicrhau bod yr ASB yn parhau i ddarparu gwyddoniaeth a thystiolaeth gadarn o ansawdd uchel."
        },
        {
            "text": "Fel bob amser, mae gymaint wedi digwydd eleni, ac mae’n anodd gwneud cyfiawnder â’r cyfan, ond (gan ymddiheuro os ydw i’n anghofio unrhyw beth!), hoffwn nodi ambell uchafbwynt."
        },
        {
            "text": "Yn gynharach eleni, cymerodd yr ASB ran yn Wythnos Wyddoniaeth Prydain am y tro cyntaf. Y thema oedd ‘cysylltiadau’, a oedd yn addas iawn ar gyfer y wyddoniaeth gydweithredol, amlddisgyblaethol y mae’r ASB yn dibynnu arni. Roedd yn gyfle gwych i amlygu’r ffyrdd ‘cudd’ y mae gwyddoniaeth wedi’i hymgorffori o fewn y llywodraeth, ac rydym wedi llwyddo i barhau â’r thema hon gyda digwyddiadau eraill – yn fwyaf diweddar pan ymunodd grŵp o fyfyrwyr israddedig Prifysgol Caerdydd â rhan o ddiwrnod Cwrdd i Ffwrdd y Prif Gynghorydd Gwyddonol yng Nghastell Caerdydd ar gyfer sesiwn ysbrydoledig o ‘gyfnewid nodiadau’."
        },
        {
            "text": "Un o freintiau mawr bod yn Brif Gynghorydd Gwyddonol yw teithio yn y DU ac yn rhyngwladol i ddysgu mwy a chlywed am ddatblygiadau gwyddonol yn y sector bwyd. Mae hyn yn arbennig o bwysig pan fo’r wyddoniaeth sy’n sail i fwyd penodol yn gymhleth ac yn symud yn gyflym. Roeddwn yn arbennig o ddiolchgar o gael treulio sawl diwrnod yn ymweld â chynhadledd ‘Food Sec and Tech’ 2023, yn ogystal ag ymweld â chwmnïau sy’n gweithio ar broteinau wedi’u meithrin (cultivated) i ddeall mwy am y dechnoleg sylfaenol a’r risgiau diogelwch posib y mae angen i ni fod yn barod i’w hasesu. Roedd hwn yn gyfle gwych i’r ASB ddysgu mwy gan reoleiddwyr blaenllaw’r byd a chawsom fewnwelediadau gwerthfawr, a fydd yn ein helpu i lunio ein dull yn y dyfodol ar gyfer meysydd fel awdurdodiadau cynhyrchion rheoleiddiedig."
        },
        {
            "text": "Ar thema debyg, roeddwn yn falch iawn o ymweld â Pharc Gwyddoniaeth Norwich yn gynharach eleni a gweld amrywiaeth hynod ddiddorol o ymchwil, yn amrywio o blanhigion cnydau wedi’u bridio’n fanwl i astudiaethau microbiom dynol. Yn ddiweddarach yn y flwyddyn, tynnais fy nghot labordy, a gwisgo fy esgidiau glaw ar gyfer ymweliad â Phrifysgol Harper Adams, gan weld prosiectau ymchwil yn amrywio o dractorau robotig i fetaboledd buchod godro."
        },
        {
            "text": "Mae partneriaethau ymchwil yn sail i ran helaeth o’n gwaith. Rwy’n falch iawn bod y rhain wedi tyfu eleni gyda nifer o brosiectau a rhaglenni newydd yn dechrau a rhai hŷn yn parhau. Mae’r rhaglen PATH-SAFE (Gwyliadwriaeth Pathogen mewn Amaethyddiaeth, Bwyd a'r Amgylchedd) a arweinir gan yr ASB yn ddarn o waith enghreifftiol, sydd wedi sefydlu cydweithrediad rhwng dros 50 o bartneriaid trawslywodraethol, academaidd a’r diwydiant. Mae effaith y rhaglen yn ymestyn ymhell y tu hwnt i’r ASB, ac ar ddechrau cam olaf y cyllid ar gyfer y rhaglen, rwy’n gyffrous i weld effaith hirdymor y sylfaen dystiolaeth hon, yn ogystal â sut rydym yn cynnal y partneriaethau hyn ar gyfer ffrydiau gwaith y dyfodol. Rydym hefyd wedi lansio ein prosiect ymchwil blaenllaw ar Glefydau Perfeddol Heintus (IID) 3, mewn partneriaeth â chonsortiwm o gydweithwyr y llywodraeth ac academaidd i ddiweddaru data’r llywodraeth ar IID ar gyfer y dyfodol."
        },
        {
            "text": "Drwy gydol y flwyddyn, rydym wedi cyhoeddi dros 20 o lythyrau cymorth i academyddion gan wahanol ganfyddiadau ymchwil. Wrth gwrs, ni fydd pob un o’r ceisiadau cyllid hyn yn llwyddiannus. Fodd bynnag, mae cynnal y perthnasoedd cryf hyn yn allweddol er mwyn adeiladu rhwydweithiau cadarn gyda rhanddeiliaid, defnyddio adnoddau ac, yn bwysicach o bosib, sicrhau bod gan yr ymchwil hon oblygiadau polisi go iawn. Edrychaf ymlaen at weld y ffrwd waith hon yn tyfu yn y blynyddoedd i ddod."
        },
        {
            "text": "Mae’r ASB wedi ymrwymo i sicrhau gonestrwydd a didwylledd yn yr ymchwil y mae’n ei chynnal a’i chomisiynu trwy gymhwyso egwyddorion y Concordat Uniondeb Ymchwil. Rwy’n arbennig o falch mai’r ASB oedd un o’r adrannau cyntaf i gyhoeddi ein Datganiad Cydymffurfiaeth Blynyddol â'r Concordat Uniondeb Ymchwil ym mis Mai. Mae hwn yn disgrifio’r camau a’r camau gweithredu yr ydym wedi’u cymryd i fodloni egwyddorion y Concordat. Mae’r ffrwd waith hon hefyd wedi dod â pherthnasoedd newydd i ni ar ffurf y Gweithgor Concordat trawslywodraethol (CWG), sy’n cyfarfod yn fisol i drafod ystyriaethau ymarferol gweithredu egwyddorion y concordat mewn llywodraeth."
        },
        {
            "text": "Rydym hefyd wedi nodi ffyrdd newydd o gynnal ymchwil eleni, a thrwy bartneriaeth a chyllid ar y cyd ag UKRI, gwnaethom gyflwyno pecyn o brosiectau ymchwil gwyddoniaeth dinasyddion ar draws ystod o bynciau a oedd yn cyd-fynd â meysydd o ddiddordeb ymchwil yr ASB. Yn ogystal â darparu data amhrisiadwy, mae’r prosiectau hyn yn caniatáu i'r cymunedau yr ydym yn eu gwasanaethu helpu i adeiladu’r dystiolaeth sy’n sail i benderfyniadau polisi. Serch hynny, gall y prosiectau cymharol fach hyn gael effeithiau mawr iawn – fel y gwelwyd gyda’r sylw yn y cyfryngau i un ohonynt, yn edrych ar beiriannau paratoi llaeth babanod."
        },
        {
            "text": "Ni allwn drafod perthnasoedd â’r ASB heb roi sylw i’n Pwyllgorau Cynghori Gwyddonol (SACs) a’n Cyngor Gwyddoniaeth. Mae’r Pwyllgorau’n darparu cyngor arbenigol annibynnol ac yn herio strategaeth wyddoniaeth ac asesiad risg yr ASB, gan yn sicrhau bod penderfyniadau polisi yn seiliedig ar y wyddoniaeth a'r dystiolaeth ddiweddaraf. Ym mis Mehefin, roeddwn yn falch iawn o groesawu 24 o aelodau newydd i’r gwahanol Bwyllgorau, gan recriwtio 10 i’r categori aelodaeth gyswllt newydd. Mae’r categori hwn wedi’i gynllunio’n benodol i gynnwys arbenigwyr ar ddechrau eu gyrfa, ac rwy’n falch iawn o’u gweld yn cynnig persbectif newydd i’r Pwyllgorau. Mae gwaith yn y maes bwyd a bwyd anifeiliaid rheoleiddiedig wedi cynyddu yn ystod 2023, yn enwedig wrth i ni barhau i weithi’n agos gyda’n Pwyllgorau i ddatblygu gofynion data ar gyfer organebau wedi’u bridio’n fanwl. Ym mis Gorffennaf, cyhoeddodd ein Pwyllgor Cynghori ar Fwydydd a Phrosesau Newydd (ACNFP) trydydd datganiad yr ACNFP ar Organebau wedi’u Bridio’n Fanwl, a gefnogodd drafodaeth Bwrdd yr ASB ym mis Medi 2023. Mae hyn yn parhau i fod yn brif flaenoriaeth wrth i ni arwain y gwaith o greu fframwaith rheoleiddio newydd ar gyfer y cynhyrchion hyn a darparu cymorth gwyddonol parhaus ar gyfer ymateb i ddigwyddiadau bwyd a bwyd anifeiliaid y DU."
        },
        {
            "text": "Wrth gwrs, nid yw gwyddoniaeth yn ymwneud â chynllunio hirdymor yn unig – mae hefyd yn chwarae rhan allweddol mewn digwyddiadau brys. Un enghraifft eleni oedd ein hymateb i bryderon diogelwch bwyd ymhlith plant ifanc yn dod i gysylltiad â glyserol mewn diodydd iâ slwsh. Trwy gydweithio â’r diwydiant bwyd, roeddem yn gallu darparu cyngor gwerthfawr i ddefnyddwyr yn gyflym, gan helpu i ddiogelu defnyddwyr agored i niwed, a chynnal hyder yn y system fwyd yn ei chyfanrwydd ar yr un pryd."
        },
        {
            "text": "Wrth edrych ar y flwyddyn i ddod, mae’r ASB yn wynebu galw newydd sylweddol am wyddoniaeth a thystiolaeth, ac rwy’n sicr y bydd digon o droeon trwstan annisgwyl. Fodd bynnag, mae’r ystod wych o arbenigedd gwyddoniaeth o fewn yr ASB, ein diwylliant cydweithredol a chefnogol ac, yn anad dim, ymroddiad ac ymrwymiad pawb i sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label, yn rhoi hyder aruthrol i mi ar gyfer y dyfodol. Gan edrych ymlaen at 2024!"
        }
    ]
}