{
    "url": "https://vmd.blog.gov.uk/2023/12/04/animal-health-and-welfare-pathway-and-amr/",
    "title": "Animal Health and Welfare Pathway and AMR",
    "authors": [
        "Jimmy Lindqvist",
        "Aisling Glennie"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)"
    ],
    "pub_date": "2023-12-04T13:49:14+00:00",
    "content": [
        {
            "text": "On 1 November we published the UK-Veterinary Antibiotic Resistance Sales and Surveillance (UK-VARSS) 2022 report, which shows that the UK has reduced it’s antibiotic sales in food-producing animals by 59% since 2014."
        },
        {
            "text": "Behind these impressive results is the success story of the UK’s voluntary and collaborative approach to antibiotic stewardship in the veterinary and farming sectors. This is showcased in the joint report by the FAO and VMD – Tackling antimicrobial use and resistance in food-producing animals."
        },
        {
            "text": "The goal has been to reduce the need for and avoid unnecessary use of antibiotics to slow the development of AMR, whilst maintaining the UK’s high animal health and welfare standards. In some cases, changes to farm infrastructure and management practices are needed to prevent and eliminate infectious disease to reduce the need for antibiotics."
        },
        {
            "text": "Here we explore how Defra’s Animal Health and Welfare Pathway team is helping to support farmers in making these changes to achieve step-wise and sustainable reductions in antibiotic use."
        },
        {
            "heading": 3,
            "text": "What is the Animal Health and Welfare Pathway"
        },
        {
            "text": "The Animal Health and Welfare Pathway is an initiative that supports continual improvement in farm animal health and welfare.  Developed in partnership with farmers, vets, academics and other experts it includes a programme of financial support for keepers of cattle, sheep, pigs and poultry to continually improve animal health and welfare."
        },
        {
            "heading": 4,
            "text": "Support available through the Pathway in 2023"
        },
        {
            "text": "Defra launched the first step on the Pathway in January 2023; Annual Health and Welfare Review. This made funding available to eligible keepers of cattle, pigs and sheep for a visit by a vet-led team to carry out a yearly on-farm review of animal health and welfare. This includes carrying out diagnostic testing, reviewing biosecurity and the use of medicines including antibiotics, as well as bespoke advice on actions to improve health and welfare."
        },
        {
            "text": "In spring 2023, keepers were able to apply for animal health and welfare equipment and technology grants of between £1000 and £25,000. Over £19 million in grants were awarded to more than 3,300 pig, cattle, poultry and sheep farmers with the​ aim to improve the health and welfare of livestock."
        },
        {
            "text": "The items on this list were selected through close work with farmers, academics, and industry groups and will help all livestock keepers to make changes which target the Pathway’s health and welfare priorities agreed for each sector. These priorities include reducing sow confinement during farrowing and reducing stressors."
        },
        {
            "text": "Alongside this Defra also offered the first animal health and welfare infrastructure grant; the Calf Housing For Health and Welfare Grant. This offered farmers the opportunity to receive co-funding of between £15,000 and £500,000 for the cost of building and refurbishing calf housing."
        },
        {
            "heading": 4,
            "text": "Support available in the future"
        },
        {
            "text": "Using stakeholders’ skills and expertise, Defra are developing three programmes that will provide financial support to address key endemic diseases and conditions."
        },
        {
            "text": "Building on the initial advice given in the Annual Health and Welfare Review, these programmes will focus on:"
        },
        {
            "text": "Defra is aiming to launch all three programmes early in 2024 and are currently working on developing delivery solutions for the programmes."
        },
        {
            "text": "These programmes will allow us to deliver further public benefits. We will encourage efficient, effective, and sustainable use of resources, reducing greenhouse gas emissions. We will promote responsible use of medicines, limiting the spread of antimicrobial resistance and its threat to public health."
        },
        {
            "text": "A further round of the animal health and welfare equipment and technology grant is also being developed. Defra also intends to introduce further infrastructure grant offers for keepers of adult cattle, pig and poultry housing."
        },
        {
            "heading": 3,
            "text": "How the pathway helps tackle the issue of AMR "
        },
        {
            "text": "In delivering funding to farmers the Animal Health and Welfare Pathway will support several cross-government strategies including the UK’s 5-Year national action plan for antimicrobial resistance. In addition, we plan to strengthen delivery of the regulatory baseline by improving compliance with our current high standards. Where it is appropriate to raise the bar, we will do this in consultation with all relevant sectors and provide sufficient notice of changes so that farmers can plan properly."
        },
        {
            "text": "The Pathway offer is for England only and whilst animal health is a devolved matter, we will seek ways to work across borders where there are shared interests."
        },
        {
            "text": "By improving animal health, we will also contribute to wider UK government commitments on reduced endemic disease and enhanced biosecurity, as set out in the 25 Year Environment Plan"
        }
    ]
}