{
    "url": "https://marinescience.blog.gov.uk/2023/12/04/collaboration-and-progress-through-cefas-climate-health-and-environment-resilience-programme-in-the-middle-east/",
    "title": "Collaboration and progress through Cefas’ Climate, Health, and Environment Resilience Programme in the Middle East",
    "authors": [
        "Rachel Mulholland"
    ],
    "categories": [
        "adaptation",
        "Climate Change",
        "International",
        "Middle East",
        "Pollution",
        "Uncategorized"
    ],
    "pub_date": "2023-12-04T09:17:27+00:00",
    "content": [
        {
            "text": "Our Climate, Health, and Environment Resilience Programme (CHERP) has recently kicked off another year of activity in the Middle East. With the UN Climate Change COP28 currently underway in the region, we are taking a look back at what we have delivered in the last few years, and the progress we have made so far."
        },
        {
            "text": "This work programme has projects across five of the Gulf Cooperation Council countries (Bahrain, Kuwait, Qatar, Saudi Arabia, and the United Arab Emirates) as well as with Iraq, Iran, and Oman through collaboration with the Regional Seas Convention."
        },
        {
            "text": "Through this programme, Cefas is working with partner organisations across the Gulf region to tackle the shared environmental challenges of climate change, biodiversity loss, enabling blue economies, and protecting human health. We have active projects in the areas of One Health anti-microbial resistance, Marine Protected Area management, climate change adaptation and resilience, water quality and pollution, biodiversity, invasive species, microplastics, and blue carbon."
        },
        {
            "heading": 3,
            "text": "Blue Carbon"
        },
        {
            "text": "Blue carbon is the carbon stored in coastal and marine ecosystems. Environments such as mangroves, seagrasses, and tidal marshland can sequester and lock away carbon from our atmosphere. These coastal and marine ecosystems store more carbon per unit area than terrestrial forests and are now being recognised for their environmental importance and the contribution they can make in mitigating climate change."
        },
        {
            "text": "In collaboration with the Regional Organization for the Protection of the Marine Environment (ROPME), Cefas undertook a review of the current scientific evidence of the extent and carbon sequestration potential of blue carbon ecosystems in the ROPME Sea Area, and prepared a Regional Blue Carbon Inventory to support member states evaluate and manage their coastal and marine habitats to support climate change mitigation."
        },
        {
            "text": "Across the whole ROPME Sea Area the recognised blue carbon ecosystems are estimated to cover 7,398 km2. The importance of these blue carbon habitats should also be considered in terms of the greater proportion of emissions they would account for once total emissions have been significantly reduced, the total carbon stored, and the important wider ecosystem services delivered by these ecosystems."
        },
        {
            "text": "As part of this work, we prepared a Blue Carbon Policy Brief to support the communication of evidence outputs and effective management of these ecosystems."
        },
        {
            "text": "Nationally, we are undertaking work on seagrass health and climate resilience in Saudi Arabia, and blue carbon research in Bahrain and Kuwait as part of a wider blue carbon project assessment of seagrass in the region as an effective climate change mitigation measure."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Climate Change"
        },
        {
            "text": "Climate change impacts on the marine and coastal environment will have major social and economic consequences for all states bordering the Gulf. Low lying, densely populated coastal settlements, critical infrastructure, and important ecosystems are at risk from sea level rise and major surge events linked to storms and cyclones. Marine species and habitats could suffer major decline, or even local extinction, as temperatures rise, oxygen levels drop, and seas become more acidic."
        },
        {
            "text": "Cefas’ International Marine Climate Change Centre worked with ROPME to deliver a multi-year marine climate change Regional Action Plan. This aims to provide the evidence base to support ROPME Member States in protecting their marine environment from climate change, including through evaluation of climate change mitigation and adaptation actions. The outputs from these studies have been published as a series of Policy Briefs and Technical Reports."
        },
        {
            "text": "Cefas scientists, the ROPME Secretariat and scientists from across the ROPME Member States collaborated to publish three new reports last year which provide practical advice on adaptation measures to build climate resilience across three priority areas; Fisheries, Corals and Desalination Plants & Industrial Cooling Systems."
        },
        {
            "heading": 3,
            "text": "Plastic Pollution"
        },
        {
            "text": "While the presence of litter across the marine environment is evident, there is limited information about its abundance, source, and impact within the Gulf to inform effective management."
        },
        {
            "text": "To address this, we have worked with regional stakeholders to identify the drivers for waste generation in region as well as reviewing the extent, distribution, and impact of marine litter within the Gulf."
        },
        {
            "text": "Cefas has been working with partners in Kuwait and Bahrain to assist with the establishment of microplastic laboratories and national environmental monitoring programmes for marine litter. We are also working with ROPME to inform coordinated regional monitoring to provide essential insights into the long-term trends and impacts of marine litter in the region."
        },
        {
            "heading": 3,
            "text": "Biodiversity"
        },
        {
            "text": "The coasts and waters of the Gulf states are home to a range of biodiversity including species and habitats of global conservation importance such as coral reefs, turtles, and dugongs. Protecting this biodiversity is important for conservation and for human livelihoods. It is also essential for a growing ecotourism industry, to protect coasts from erosion, to build resilience to climate change and for productive fisheries."
        },
        {
            "text": "We have been working to support partners across the region on evidence gathering, monitoring, assessing, and managing key marine species and habitats. From the deployment of Baited Remote Underwater Video Survey equipment in Qatar to investigate whale shark aggregations, reviewing pathways for invasive species transmission in the United Arab Emirates, to developing standards for assessing marine and coastal water quality in Bahrain."
        },
        {
            "heading": 3,
            "text": "Antimicrobial resistance (AMR)"
        },
        {
            "text": "AMR is one of the most pressing global challenges threatening human health and economic security in the 21st Century. Today, AMR is estimated to be responsible for 1.2 million deaths per year globally, and this is expected increase significantly by 2050. The threat of AMR is primarily of concern in human healthcare settings, but it is increasingly clear that AMR can develop and spread in the environment, including freshwater and marine environments."
        },
        {
            "text": "Climate change contributes to AMR by increasing the rate of horizontal gene transfer – allowing resistance genes to transfer more quickly between bacteria as the global temperature rises. Research has shown that increased temperatures increase both the rate of bacterial growth and the rate of the spread of antibiotic-resistant genes between microorganisms."
        },
        {
            "text": "Cefas is working with regional partners to build capacity and understand the environmental and veterinary components of AMR to further enhance Gulf States’ AMR National Action Plans which countries are required to develop and implement under the United Nations AMR Global Action Plan."
        },
        {
            "text": "Previous work has included the first regionally coordinated survey of AMR in the marine environment, which has built understanding and capacity to address the environmental and veterinary components of AMR and establishing a network of researchers across the GCC. This has included the publication last year of a marine monitoring programme to assess antibiotic resistance."
        },
        {
            "text": "Current work in Kuwait, Qatar, and the United Arab Emirates includes novel research to provide evidence on the extent of AMR in agri-environment sectors and retail settings."
        },
        {
            "heading": 3,
            "text": "Environmental Education"
        },
        {
            "text": "Environmental education plays a crucial role in fostering awareness, knowledge, and action to address pressing environmental challenges. However, limited accessible or locally relevant resources as well as language barriers often hinder effective environmental education."
        },
        {
            "text": "This year we have been working on the production of school resource packs on environmental topics such as climate change and marine litter, designed specifically for primary and secondary schools in the Middle East."
        },
        {
            "text": "By creating materials in both English and Arabic, we aim to facilitate inclusive education for students in the region. The focus on locally relevant species and habitats within the resource packs and use of locally recognised locations represents an innovative approach to personalise the issues being addressed and promote personal responsibility and environmental stewardship."
        },
        {
            "text": "Focus was also given to providing teachers with the tools they need to educate students on the causes, impacts, and solutions to these important environmental issues with an emphasis on promoting critical thinking, problem-solving, and positive behavioural change."
        },
        {
            "heading": 3,
            "text": "The Future"
        },
        {
            "text": "We are looking forward to continuing our ongoing collaboration on the Middle East Climate, Health, and Environment Resilience Programme throughout the coming year and into the future. With dedicated project partners spanning the Middle East region, our collective focus on addressing critical marine environmental issues exemplifies the power of international cooperation."
        },
        {
            "text": "Together we are committed to using science and evidence to drive impactful solutions and promote resilience in the face of shared global environmental challenges. This collaborative effort highlights our shared dedication to creating a sustainable and healthy future for the Middle East and beyond."
        },
        {
            "text": " "
        }
    ]
}