{
    "url": "https://deframedia.blog.gov.uk/2023/12/04/coverage-of-xl-bully-definition/",
    "title": "Coverage of XL Bully definition",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-12-04T14:41:14+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been media coverage this weekend of claims that the definition of the XL Bully type lacks clarity, with owners not knowing whether their dog will be classed as the banned breed."
        },
        {
            "text": "We have taken quick and decisive action to protect the public from dog attacks by adding the XL Bully type to the list of dogs prohibited under the Dangerous Dogs Act. We firmly believe this approach is needed to reduce the risks to the public by this type."
        },
        {
            "text": "We have produced a definition and guidance to help owners and enforcement authorities understand whether a dog should be defined as an XL bully. This involved convening a group of experts and other stakeholders to define the physical characteristics of this breed type, as well as reviewing existing breed standards provided by registries in the US and UK and testing the standard in practice."
        },
        {
            "text": "We have also provided photographic examples of XL Bully breed types on gov.uk. These images are intended as a guide for owners and are not exhaustive."
        },
        {
            "text": "It is up to the owner or keeper to identify whether they think their dog may be in scope of the ban – which only applies to XL Bully dogs. If someone has a dog that is clearly another established breed, such as a rottweiler, the ban does not apply."
        },
        {
            "text": "If an owner has a dog that could be considered to be an XL Bully then they must consider whether it meets the minimum height requirements and has a substantial number of the characteristics set out in the standard and whether it may therefore be within the scope of the ban."
        },
        {
            "text": "We recommend taking a precautionary approach. If you are unsure if your dog is an XL Bully or whether any puppies may grow up to be of this dog type, you should comply with the relevant requirements and restrictions as they come into force."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "Follow Defra on Twitter and sign up for email alerts here."
        }
    ]
}