{
    "url": "https://defrafarming.blog.gov.uk/2023/12/04/further-round-of-the-research-starter-competition-coming-soon/",
    "title": "Further round of the Research Starter competition coming soon ",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-12-04T13:04:24+00:00",
    "content": [
        {
            "text": "Farmers, growers and foresters in England will soon be able to apply for a share of £850,000 for ideas that improve productivity, sustainability, resilience and move the agricultural sector to net zero.  "
        },
        {
            "text": "Opening on 18 December, the Research Starter competition offers an entry point to the innovation process for those with bold, ambitious, early-stage ideas.   "
        },
        {
            "text": "We published guidance for the competition today to help you prepare. It provides information on how to apply, the scope of the competition and eligibility. "
        },
        {
            "text": "As with previous competitions, Innovate UK KTN will host a webinar briefing and consortia building event. "
        },
        {
            "text": "In this post, I’ll share a summary of the competition and include links for you to learn more. "
        },
        {
            "heading": 2,
            "text": "The Research Starter competition "
        },
        {
            "text": "The aims of this competition are to:  "
        },
        {
            "text": "Innovation in this space would benefit both you and the wider farming and growing community and these small projects might lead to big impacts. "
        },
        {
            "text": "We welcome applications from English farming, growing and forestry businesses for projects to investigate their original “on farm” ideas.  "
        },
        {
            "text": "The funding will enable academic, research organisation or tech businesses to join the project team and support research and development of the idea.  Projects must be led by, and show, benefit for English farmers growers and foresters.  "
        },
        {
            "text": "Successful projects from previous rounds of this competition include: "
        },
        {
            "text": "We look forward to adding more projects to this innovative group. "
        },
        {
            "text": "Together with our delivery partner Innovate UK, part of UKRI, it will be the fourth time we’ve run this competition which is part of the £270 million Farming Innovation Programme.     "
        },
        {
            "heading": 2,
            "text": "Dates to note"
        },
        {
            "text": " "
        }
    ]
}