{
    "url": "https://teaching.blog.gov.uk/2023/12/04/how-tutoring-is-helping-to-improve-pupils-attendance/",
    "title": "How tutoring is helping to improve pupils’ attendance",
    "authors": [
        "Pupil and staff at Nottingham Emmanuel School"
    ],
    "categories": [
        "Attendance"
    ],
    "pub_date": "2023-12-04T09:30:38+00:00",
    "content": [
        {
            "text": "Nottingham Emmanuel School have found that small group tutoring is helping to overcome issues with pupil absence rates, which have risen since the Covid-19 pandemic due to a variety of reasons - including lack of confidence, mental health and social factors."
        },
        {
            "text": "In this blog, a teacher, tutor and pupil from Nottingham Emmanuel School explain how they’ve seen tutoring improve attendance."
        },
        {
            "text": "A teacher at Emmanuel School"
        },
        {
            "text": "“At the start of the academic year, one of our pupils was nervous about coming into school and attending lessons. As a result of 1:1 sessions with a tutor from YipiYap, a Tuition Partner for the National Tutoring Programme (NTP), their attendance at school improved."
        },
        {
            "text": "“They worked in a small group setting for a few hours at a time and the feedback from colleagues was fantastic. His teachers also talked  about the difference the tutoring sessions were having on their attendance and their attitude to being in school.”"
        },
        {
            "text": "A SENCo at Emmanuel School"
        },
        {
            "text": "“1:1 tuition was part of our re-engagement plan. Our aim was that, by having regular, positive interactions with a tutor, this pupil would be able to access the curriculum needed to support his science work in Key Stage 4."
        },
        {
            "text": "“I saw a significant change in his attendance, which increased by 15%, and attitude during the period of the tuition. From my observations, I think the combination of both educational and relational factors was important in effecting this change.”"
        },
        {
            "text": "A pupil at Emmanuel School"
        },
        {
            "text": "“I felt much better coming into school on days when I had tutoring."
        },
        {
            "text": "“I found it easier to learn because there were less people about. I was able to focus more outside the main classroom and we seemed to do a lot more work. When I re-joined my class, I was actually ahead and had a better understanding of what was being taught.”"
        },
        {
            "text": "A tutor at Emmanuel School"
        },
        {
            "text": "“Our sessions were held in a classroom where we know pupils feel more comfortable. One pupil I worked with had a reduced timetable to begin with, so he did not feel overwhelmed, but this gradually increased as the year went on."
        },
        {
            "text": "“For our initial session, I chose something mathematical, knowing this was one of his favourite subjects. This helped to develop a connection and allowed him to focus on a subject he enjoyed."
        },
        {
            "text": "“During our sessions, he confided in me about his difficulties interacting with other students, mentioning that he felt their behaviour sometimes slowed down the pace of lessons, leaving little time for actual learning. Having a small, focused session allowed us to cover material more efficiently. I believe that our small group setting, and our ability to make rapid progress, contributed to his feeling that attending my tutoring sessions was worthwhile."
        },
        {
            "text": "“I noticed a positive change in his attitude toward school. He had evidently made friends with other pupils in the tutoring environment, which gave him more motivation to come to school. He had also developed coping mechanisms when interacting with his classmates, making his return to the classroom less stressful.”"
        },
        {
            "text": "For more information:"
        }
    ]
}