{
    "url": "https://gfie.blog.gov.uk/2023/12/04/no-matter-what-walk-of-life-you-come-from-you-can-make-a-difference/",
    "title": "No matter what walk of life you come from, you can make a difference!",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "Care Leavers",
        "Life Chances"
    ],
    "pub_date": "2023-12-04T08:00:13+00:00",
    "content": [
        {
            "text": "The Civil Service currently has 23 Going Forward into Employment (GFiE) Life Chance Schemes in operation across Government, using innovative approaches to recruitment and providing Individuals from a wide range of backgrounds, and who face barriers to employment, with opportunities and experience."
        },
        {
            "text": "In this blog edition, we introduce you to the Care Leavers Internship Scheme led by the Department for Education.  "
        },
        {
            "heading": 2,
            "text": "What is the Care Leavers Internship Scheme?"
        },
        {
            "text": "The GFiE Civil Service Care Leavers Internship Scheme is a flagship scheme which gives Care Leavers the chance to benefit from a 12-month paid internship in a central Government department/agency, with the possibility of the post being made permanent at the end of the 12 months."
        },
        {
            "heading": 3,
            "text": "Eligibility Criteria"
        },
        {
            "text": "Individuals can apply for the scheme if they:"
        },
        {
            "text": "No qualifications are required for this internship and apprenticeships may be offered as part of some roles."
        },
        {
            "heading": 3,
            "text": "How does this scheme make a difference?"
        },
        {
            "heading": 3,
            "text": "What do our Interns say about the Scheme..."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What the Intern Line Managers said about the Scheme...."
        },
        {
            "heading": 3,
            "text": "How and when can individuals apply for an Internship?"
        },
        {
            "text": "The scheme is operated at certain points throughout the year and we plan on the next  application window opening May 2024"
        },
        {
            "text": "Care leavers will be able to apply directly through the Civil Service Jobs Portal and there will be an opportunity to join information sessions to support applicants before the application opens."
        },
        {
            "heading": 3,
            "text": "How Civil Service Departments can get involved:"
        },
        {
            "text": "If you are a Civil Servant Department and would like to offer opportunities via the Care Leavers Internship Scheme to fill your vacancy please contact the Care Leavers Team at Leavers.CARE@education.gov.uk for more information.  "
        },
        {
            "heading": 3,
            "text": "Life Chance Schemes"
        },
        {
            "text": "If you want to know more about any of our other GFiE Life Chance Schemes, or would like to discuss using schemes for any vacancies that you have coming up, please contact us at GFiE@cabinetoffice.gov.uk"
        }
    ]
}