{
    "url": "https://forestrycommission.blog.gov.uk/2023/12/04/professional-forester-apprenticeship-a-pathway-into-your-new-career-in-forestry/",
    "title": "Professional Forester Apprenticeship: a pathway into your new career in forestry",
    "authors": [
        "Marcus Ling"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2023-12-04T11:30:38+00:00",
    "content": [
        {
            "text": "It’s a full-on start as you spend the first four weeks with the other new apprentices, but we’re a really good group and we get on well. There’s such a range of past experiences among us, which is valuable. We have a former postal worker, NHS worker, and art student, for instance. Everyone is interested and passionate but we’re all novices in forestry. There isn’t an expectation of previous experience. For the last few years I was working in the arboriculture and garden landscaping industry so I’ve been around trees a lot in my previous work, but it hasn’t been a massive benefit over the other people who have spent time in other workplaces like maternity wards. The apprenticeship is set up to give anyone of any background the chance to become foresters, we all find ourselves on the same level."
        },
        {
            "heading": 3,
            "text": "Getting started"
        },
        {
            "text": "We spent our induction week at Forestry England’s Cannock Chase Forest in the Midlands, then a week at the University of Cumbria – studying in the Lake District has been a real highlight. Then weeks three and four were at Cannock Chase again team building, learning about risk assessments, and biosecurity training which is about the things we can do to help prevent the spread of tree pests and diseases as we go about our work."
        },
        {
            "text": "Since then, I’ve been proactive in getting out on a lot of site visits so I can get the most exposure to what a Woodland Officer does. I’ve been out with a few local councils. I’ve also met quite a lot of farmers, and I was part of a water catchment meeting that included local MPs, Natural England, and others. It’s encouraging to see all the collaboration between organisations."
        },
        {
            "text": "The best thing about the programme so far is how I’m already contributing to changes in the landscape. I’ve been helping Woodland Officers to ensure that new planting is being undertaken responsibly and that existing woodlands are managed carefully. You really get to know more about your local area and visit places you’ve never been to. I’m going to Blenheim Estate soon to see their woodland management plan and that’s an opportunity I wouldn’t have without being in this role."
        },
        {
            "heading": 3,
            "text": "Advice for candidates"
        },
        {
            "text": "To anyone thinking of applying I’d say don’t be put off by feeling like you don’t have the right knowledge. If you can’t identify trees, for instance, that’s not an issue, that’s what the course is here to help with. You just need to be interested and passionate. You’ll get to show that passion at the assessment days. I’ve never had an interview quite like it. As well as the formal interview panel that most of us are used to, there were design tasks, analytical tasks and an assessed walk, something for everyone to show off their skills and strengths."
        },
        {
            "text": "Also, be prepared to stick with it. Applying for any apprenticeship or course can feel like quite a long process. The gap between submitting my application and starting in the role has been around six months, and it will be another three years until I graduate, so you need to commit."
        },
        {
            "heading": 3,
            "text": "Future Foresters"
        },
        {
            "text": "It has definitely been the right move for me. It has given me instant exposure to the forestry industry. We’ve had opportunities to go to active harvesting sites to see what machines are used and what the felling process is. We also went to the Forestry Conference in October. That was the best day for me so far. It had a focus on the next generation, so we saw the advancements in technology, aerial drone surveys, electric engines, a whole pioneering attitude. It was an amazing glimpse into the future of forestry. In three years when we graduate the sector’s going to look very different and we’re going to be part of that – that’s a fantastic feeling."
        },
        {
            "text": "The Professional Forester Apprenticeship is led by the Forestry Commission, Institute of Chartered Foresters, and University of Cumbria. Applications for 2024 are now open."
        }
    ]
}