{
    "url": "https://mhclgmedia.blog.gov.uk/2023/12/04/recent-devolution-deal-signings/",
    "title": "Recent devolution deal signings",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Devolution",
        "Levelling Up"
    ],
    "pub_date": "2023-12-04T15:57:13+00:00",
    "content": [
        {
            "text": "The Department for Levelling Up, Housing and Communities has signed devolution deals with three new areas and committed over £1 billion in funding to invest in local priorities and level up."
        },
        {
            "text": "Deals signed with Hull and East Yorkshire, Lancashire and Greater Lincolnshire cover over 3 million people - that is over 90% of the North of England and 54% of the Midlands now covered by a devolution deal."
        },
        {
            "text": "Several local outlets reported that the historic devolution deal to give greater power to local communities in Lancashire was signed by the Levelling Up Minister during a visit on 26 November. The Daily Express reported favourably on the ‘historic’ devolution deal, carrying an extensive quote from Minister Young who says the deal will ‘unleash economic growth’ in the county."
        },
        {
            "text": "The news was also reported in the Lancashire Post and Lancs Live, while the Lancashire Post, who attended the ceremony at Lancaster Castle, covered a detailed follow-up of the signing, featuring its interview with Minister Young."
        },
        {
            "text": "BBC News online covered the devolution deals for Hull and East Yorkshire and Greater Lincolnshire which were signed as Minister Young met with local leaders in Hessle and Scunthorpe on 27 November."
        },
        {
            "text": "Levelling Up Minister Jacob Young said:"
        },
        {
            "text": "A devolution deal for Cornwall was also confirmed at the Autumn Statement and will be signed in due course."
        }
    ]
}