{
    "url": "https://ruralpayments.blog.gov.uk/2023/12/04/rpas-rural-land-register/",
    "title": "RPA’s Rural Land Register ",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2023-12-04T15:37:02+00:00",
    "content": [
        {
            "text": "The Rural Land Register is a key dataset maintained by RPA which underpins the delivery of the land-based schemes, such as Basic Payment Scheme, Countryside Stewardship and Sustainable Farming Incentive, to ensure accurate payments are made to farmers and land managers.  "
        },
        {
            "text": "RPA systematically reviews and updates data held on the Rural Land Register as the areas claimed by customers need to correspond with eligible areas within those land parcels for a claim to be paid."
        },
        {
            "text": "Overall, RPA maps and maintains 2.7 million land parcels, and within those are 4.6 million land covers that tell us which features are present in each land parcel, such as arable land, woodland, ponds and farmyards.  We also maintain eight million hedges as linear features within, or on, the boundary of land parcels."
        },
        {
            "text": " Proactive Land Change Detection"
        },
        {
            "text": "Proactive Land Change Detection (PLCD), is an exercise run by RPA to review any land parcels which haven’t been updated or assessed within the past three years. We review around 900,000 parcels each year, one third of the total number. The PLCD activity improves the accuracy of the Rural Land Register, and therefore payments to customers."
        },
        {
            "text": "RPA monitors the Rural Land Register each month and applies spatial analysis to see which potential land parcels will receive updated intelligence during the year. Land parcels can also be updated by other means, such as a customer edit request, a farm visit by RPA field officers, or remote inspections using satellite imagery. We also consider which agri-environmental subsidy schemes the parcels are being claimed under to make sure our checks are done at the right time so we don’t disrupt payments."
        },
        {
            "text": "Once the land parcels have been identified, they’re reviewed manually to identify any changes to the boundaries or land covers. RPA receives aerial photography covering one third of the country each year, and also makes use of other intelligence such as Ordnance Survey MasterMap and satellite imagery."
        },
        {
            "text": "Key facts "
        }
    ]
}