{
    "url": "https://buyingforschools.blog.gov.uk/2023/12/04/sustainable-drainage-systems-for-schools-environmentally-friendly-flood-prevention/",
    "title": "Sustainable drainage systems for schools – environmentally friendly flood prevention",
    "authors": [
        "Amy Greenough, Lead for Schools Water Strategy"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2023-12-04T12:28:52+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Amy Greenough, DfE’s project lead for the Schools Water Strategy, talks about the sustainable drainage systems (SuDS) projects her team has worked on in partnership with water companies and Lead Local Flood Authorities (LLFA) to reduce the surface water flood risk across the school estate."
        },
        {
            "text": "Water is a valuable resource, in our How to make your school more water efficient blog we talked about some of the measures you can take to make your school more water efficient and I’d like to follow on from this and tell you about our SuDS projects."
        },
        {
            "text": "Increasingly UK weather and climate records are being set.  Unprecedented heavy rainfall naturally results in more water in sewers and as a result, increases the risk of local surface water flooding."
        },
        {
            "text": "So, what exactly are SuDS? In short, they are a collection of water management systems that aim to align modern drainage systems with natural water processes. The key objectives are to manage the flow rate and volume of surface runoff, and consequently reduce the pressure on the sewerage network and reduce flood risk."
        },
        {
            "text": "Leading this project and working within the Department for Education’s risk protection arrangement (RPA), I know the issues schools can face when there has been increased rainfall in a short period of time. Because many of your schools have a large amount of hard surface area, for example your playgrounds and pathways, surface water pooling can leave playing fields looking more like a big muddy puddle and somewhere that children can’t play on."
        },
        {
            "text": "The DfE’s schools water strategy is an imaginative ‘invest to save’ strategy which aims to reduce the flood risk profile across the school estate. We want to support you to increase climate and flood resilience and schools are a natural place for SuDS, as they have large areas of land and roofs that can be used to collect and manage rainwater."
        },
        {
            "text": "But it’s not just about the benefits for the school estate, SuDS can also be used to create educational opportunities, teaching pupils about water management and the environment. Another important feature about the work of this team is the impact these systems have on not only water quantity and quality, but how this can help counter the effects of pollution and biodiversity."
        },
        {
            "text": "We believe the work we are doing can also support you to improve pupils mental and physical health, tackle air quality and  create spaces that can be used for recreation, education, and wildlife habitats."
        },
        {
            "text": "In this short video, you can see the result has not only reduced the risk of flooding but also provided an attractive area. Its enhanced educational benefits, with a new green space is used not just for play, but for different classes, including maths, science, art and craft, reconnecting the children with nature and wildlife."
        },
        {
            "text": "By 2026, working with partners such as the Environment Agency, water companies and LLFAs, we aim to reduce the flood risk in over 800 schools through our water strategy initiatives, and SuDs is a large part of this. Through more projects like the one at Ursuline Catholic Primary School we hope that more children will grow up knowing about natural ways to manage water and have an increased understanding of the impact of climate change."
        },
        {
            "text": "If you are interested in learning more about SuDS for schools, there are resources available online. You can also check what your local water utility company is doing."
        }
    ]
}