{
    "url": "https://lifeathmrc.blog.gov.uk/2023/12/04/tax-specialist-programme-michelles-journey/",
    "title": "Tax Specialist Programme: Michelle's Journey",
    "authors": [
        "Michelle"
    ],
    "categories": [
        "Diversity and inclusion",
        "Employee support",
        "Tax"
    ],
    "pub_date": "2023-12-04T11:13:44+00:00",
    "content": [
        {
            "text": "I had done a lot of different things before joining the Tax Specialist Programme (TSP). I studied Computing with Operational Research at university, before getting a job as a programmer. I decided this wasn’t for me and went to do half a PGCE before deciding that teaching abroad might suit me better."
        },
        {
            "text": "I taught in China and Korea for nearly 10 years, before coming back to the UK. I then worked for a company bringing students to the UK to study English in the summer. When the pandemic hit, I was made redundant and decided to join the Civil Service. I started as an Assistant Officer in the Crown Prosecution Service before becoming an Officer (O grade) in Campaigns and Projects at HMRC."
        },
        {
            "text": "I had seen the programme when applying for jobs when I was first made redundant. I was really excited by it, as I believe strongly in the importance of taxation for society, and I love learning. The salary was also a huge draw, as it was easily the best paying job I was considering at the time. I got to the interview stage the first time I applied but didn’t quite score high enough to get an invite to the assessment centre."
        },
        {
            "text": "When the opportunity came around again the following year, I was quick to apply for a second time. I had received an autism diagnosis during the year, and I was able to get a reasonable adjustment to slightly change the format of the interview. I scored a full 10 points (out of 40) higher than the year before and got through to the assessment centre."
        },
        {
            "text": "I started in September 2022 and I have really enjoyed the TSP. I have just finished my stage 1 exams and been told that I am streaming to Fraud Investigation Services in March. I am really pleased with this, as while you don’t get to choose, this would have been my preference anyway. Our managers did a really good job taking into account everyone’s interests and strengths and assigning us placements that matched them."
        },
        {
            "text": "The course itself has been great so far. I love that we work on live cases and look into a range of different customers and the issues that crop up in their tax returns. We also volunteer to do bits of work for other caseworkers, meaning we see a wide range of tax issues. The casework is really varied and a huge difference from Campaigns and Projects. You are supported throughout by knowledgeable Business Learning Managers. When you volunteer for projects the case owners all take the time to explain what is being done and why."
        },
        {
            "text": "We are also completing a Quality Assurance Framework (QAF) that asks us to take examples from our own casework and the volunteering we are doing and write examples of how we have met certain criteria. It is nice to get the opportunity to reflect on the work that you have done and we are really well supported throughout this process, with our managers having a great idea of what is needed for completing this document."
        },
        {
            "text": "The third branch of the TSP is exams and studying. Studying alongside work is sometimes tricky, but you do find that the things you are learning turn up in your casework. We have a set amount of study time dedicated to each module that we are able to take during work, then we also have tutorials."
        },
        {
            "text": "Another area of support is with my neurodiversity. There are quite a few of us who are neurodiverse and there has been a big push to try and make things more accessible. I will not claim that there aren’t still adjustments to be made, but it has been possible to see the progress since I started. You will not be alone or unsupported if you have dyslexia, dyspraxia, ADHD, ADD, autism or any other form of neurodiversity."
        },
        {
            "text": "My advice to anyone who is considering applying is to go for it! The first stage is simply taking the numeracy, verbal reasoning, and judgement tests so it is less of a time commitment than many Civil Service jobs, at least initially. I would also like to speak to those who might be in my situation and offer two bits of advice:"
        },
        {
            "heading": 4,
            "text": "Apply now!"
        },
        {
            "text": "For more information on the Tax Specialist Programme and to apply click here."
        }
    ]
}