{
    "url": "https://lifeathmrc.blog.gov.uk/2023/12/04/tax-specialist-programme-rebeccas-journey/",
    "title": "Tax Specialist Programme: Rebecca's Journey",
    "authors": [
        "Rebecca"
    ],
    "categories": [
        "Tax"
    ],
    "pub_date": "2023-12-04T11:14:34+00:00",
    "content": [
        {
            "text": "I started my career in HMRC in 2007 and like many others in the department, my first role was an Assistant Officer (AO) in the contact centre handling Tax Credit calls. I graduated from Warwick University with a BSc in Psychology and initially I saw the role within HMRC was a temporary one."
        },
        {
            "text": "I was then promoted and gradually worked my way up to an Senior Officer (SO) Technical Lead within Counter Avoidance. I decided to stay within HMRC due to the diversity of careers and the work life balance offered."
        },
        {
            "text": "In June 2019 I went off on maternity leave with my first child and my plan was to return to work in September 2020 looking to progress to Grade 7. During that time, I was thrown a health-related curve ball and diagnosed with cancer which meant I ended up having an 18 month absence from work (maternity and sick leave). In December 2020, after an 18-month absence, I returned to work. This knocked my confidence and I decided to stay in my previous role to build my competencies back up after being out of work for so long. Then 10 months after returning to work, I made the decision to apply for the Tax Specialist Programme as I thought it would be a great steppingstone for me to Grade 7. I saw it to be the perfect foundation for a wide-ranging career and offered the opportunity to find my way back into HMRC."
        },
        {
            "text": "I was lucky enough to secure a place and started the TSP in September 2022. The recruitment process can be daunting as it takes a while but don’t let that put you off."
        },
        {
            "text": "When starting the course, I was surprised to see a complete mix of age groups and backgrounds, and yet everyone is made to feel welcome. We have an amazing team who have bonded so well. If someone in my cohort is not able to help, trainees further along in their TSP journey have been able to step in. You are allocated a Business Learning Manager and they are there to support you along the way."
        },
        {
            "text": "After graduating from university over 15 years ago, I was concerned that I would be out of my comfort zone but I have found getting back to study surprisingly enjoyable. There is a good balance of academic and practical learning.  I have welcomed the challenge of the exams to test my knowledge."
        },
        {
            "text": "I’m now coming to the end of stage 1 which is a foundational period of generalist cross-tax training lasting 18 months. Stage 2 is a further 18 months of specialised training within the line of business I will be streaming to."
        },
        {
            "text": "The programme is quite flexible, and this has worked well for me as I only work 4 days a week and have to balance work with a young daughter. You are trusted to manage your own learning and the tutorials are a good opportunity to engage with your cohort and get the most from your tutor."
        },
        {
            "text": "Workwise, no two days are ever the same. I have really enjoyed doing compliance work and opening enquiries into a variety of different tax issues which has allowed me to demonstrate my learning."
        },
        {
            "text": "My biggest challenge has been time management and ensuring that no areas of the programme slip. I have needed to make the most of my revision time, be organised and stay focused."
        },
        {
            "text": "For me I have realised the best way to approach the study would be to break the reading down into manageable bite size chunks. This allowed the reading to feel less intense and allowed me to dip in and out of the reading and fit it around my schedule. The human brain is not able to maintain focus for hours on end. I have experienced that learning and focus can be greatly improved when the content is delivered in short bursts to help cement learning."
        },
        {
            "text": "My one piece of advice for anyone looking to join TSP would be don’t be afraid to reach out for help if you need it. It’s easy to believe you are the only one finding things difficult. At times I have questioned whether TSP is right for me. I’d left a role I was competent in where I was the ‘go to person’ for any technical queries and was a specialist in my subject matter. Juggling a young child, health issues and working only four days a week has been challenging due to the demands of the course, but I am happy to say that I believe TSP is the right choice for me.  It is certainly challenged and fast paced, but I believe is providing me with the best opportunity to progress my career within HMRC."
        },
        {
            "heading": 4,
            "text": "Apply now!"
        },
        {
            "text": "For more information on the Tax Specialist Programme and to apply click here."
        }
    ]
}