{
    "url": "https://environmentagency.blog.gov.uk/2025/07/04/how-does-science-support-sustainable-places-and-pathways-to-net-zero/",
    "title": "How does science support sustainable places and pathways to net zero?  ",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Climate change",
        "Nature",
        "Science"
    ],
    "pub_date": "2025-07-04T15:56:00+00:00",
    "content": [
        {
            "text": "By Dr Gina Cavan, Lead Scientist for Land Research "
        },
        {
            "text": "Achieving net zero by 2050, the UK’s legally binding target, will be a national effort. All parts of the country will contribute in different ways. Areas rich in natural resources will help to fuel low-carbon technologies, while others will become hubs for industry. Communities will navigate the transition to net zero in diverse and place-specific ways, shaped by their social, economic and environmental contexts. The place-based nature of net zero presents unique scientific challenges.  "
        },
        {
            "text": "As an environmental geographer, I’m interested in the complex interactions between people and the natural environment, and how these relationships vary across places. I joined the Environment Agency in February 2025 as Lead Scientist for Land Research. As part of my role, I’m responsible for leading the Environment Agency’s net zero research theme, an interdisciplinary programme managed by the Chief Scientist’s Group and funded by Defra. Our overall aim is to understand, at different scales, what different net zero pathways mean for the environment, the sectors we regulate, and the communities in which we work.  "
        },
        {
            "text": "Below, I share a few ways our research supports the national effort to transition to net zero, with insights from our dedicated scientists on their work.  "
        },
        {
            "text": "Natural resources and net zero  "
        },
        {
            "text": "The UK’s diverse natural environments play an important role in achieving net zero. People are harnessing the power of nature to decarbonise energy (using solar, wind, and water), remove greenhouse gases from the atmosphere (using trees and rocks), and even heat homes (using the earth’s heat for ground-source heat pumps). These technologies and combinations thereof could affect local ecosystems and communities in different ways.  "
        },
        {
            "text": "The subsurface is one natural environment of interest. Geology is the unseen enabler of net zero, with many activities relying on the subsurface as part of their solution. The subsurface can provide energy solutions and carbon storage, while a range of low-carbon technologies use minerals extracted from the earth. Many of these activities aim to use the same, or neighbouring, subsurface environments.  "
        },
        {
            "text": "My team is working with the British Geological Survey to explore where there could be competition for particular subsurface spaces for net zero technologies. The research investigates the challenges, including environmental and societal impacts, that could arise from an overcrowded subsurface.  "
        },
        {
            "text": "Industrial clusters and net zero "
        },
        {
            "text": "Beyond natural spaces, industrial areas also present place-based challenges. One of the UK’s most ambitious net zero initiatives is the development of industrial clusters, where multiple low-carbon technologies are located together to accelerate decarbonisation. These clusters aim to reduce emissions from energy-intensive industries while fostering innovation and economic growth.  "
        },
        {
            "text": "The concentration of net zero technologies can affect the local environment and people living there. These impacts may be positive – such as reducing carbon – but they may introduce additional pollutants that can affect air quality, water quality, and water availability for other processes and users. The Environment Agency is uniquely placed to consider both positive and negative changes to the environment and identify the need for novel monitoring and regulatory approaches. "
        },
        {
            "text": "The Environment Agency’s 4-year Environmental Capacity in Industrial Clusters project investigated the environmental capacity to deploy carbon capture and hydrogen production technology in 3 English industrial clusters. Following on from this work, we are now investigating the potential air quality and wastewater impacts of co-locating net zero technologies. This research will help the Environment Agency to regulate industrial clusters effectively. "
        },
        {
            "text": "Communities and net zero  "
        },
        {
            "text": "Achieving net zero relies heavily on behavioural change and public support for the transition. One-third of emissions reductions in 2040 will stem from low-carbon choices made by households. This includes both individual choices (like adopting electric cars) and collective efforts (like car-sharing).  "
        },
        {
            "text": "Social science is therefore a common thread throughout our research. The Environment Agency is part of a social science Net Zero Task Force that provides evidence for effective policymaking. We’re exploring public hopes and concerns about the path to net zero and understanding where we can anticipate support or opposition to net zero technologies and pathways. Evidence tells us that meaningful, consultative, and transparent public engagement is critical to securing social support to operate. Understanding how different communities think about and experience the transition means we can reduce negative social impacts during the journey to net zero emissions. "
        },
        {
            "text": "Developing the next generation of scientists "
        },
        {
            "text": "Tackling complex research questions requires collective action. To this end, the Environment Agency works with government, academia, research councils, and industry to bridge knowledge gaps and build evidence to guide sustainable strategies to net zero. For example, the Chief Scientist’s Group recently hosted a secondee funded through the UK Industrial Decarbonisation Research and Innovation Centre (IDRIC) to support our exploration of the environmental implications of different pathways to net zero.  "
        },
        {
            "text": "As a former university academic, I am especially pleased to see the Environment Agency’s commitment to developing future scientists. I was delighted to share reflections on my academic career at our annual PhD Network knowledge exchange event in April. The event included an inspiring keynote presentation from our Chief Scientist, Dr Robert Bradburne, setting out the Environment Agency’s science needs for the future, followed by some excellent talks from our research scientists and affiliated PhD researchers. This included a net zero-related project about investigating circular economy principles in nuclear decommissioning. "
        },
        {
            "text": "Final thoughts "
        },
        {
            "text": "Net zero is a fast-moving area, with both short- and long-term effects on people and places. Working together across disciplines, we can strengthen the UK’s evidence base and support the research needed to secure a more resilient and environmentally conscious future. "
        },
        {
            "text": "We’ll be publishing outputs from our net zero research theme over the next year. In the meantime, you can read more about the Environment Agency’s net zero research in the 2024 Chief Scientist’s annual review. "
        }
    ]
}