{
    "url": "https://ssac.blog.gov.uk/2025/07/04/our-initial-advice-on-disability-benefit-reform/",
    "title": "Our initial advice on disability benefit reform",
    "authors": [
        "Dr Stephen Brien"
    ],
    "categories": [
        "Consultation",
        "Disability Benefits"
    ],
    "pub_date": "2025-07-04T14:48:11+01:00",
    "content": [
        {
            "text": "Few challenges facing the country are more significant than ensuring our social security system provides the right support for people with disabilities and severe or chronic health conditions, supporting them to live independently and, for those who are able, to find and sustain meaningful work."
        },
        {
            "text": "As with all major reforms, to succeed, these proposals need to be underpinned by a clear, integrated vision. Any major policy shifts must be backed by a transparent public rationale that explains both the reasoning and the expected outcomes."
        },
        {
            "text": "Following the publication of the Pathways to Work: Reforming Benefits and Support to Get Britain Working Green Paper, the Social Security Advisory Committee (SSAC) has been engaging closely with the Secretary of State and her ministerial team, expert advisers and officials at the Department for Work and Pensions (DWP). As an independent body, our role is to provide impartial advice to the Secretary of State on social security matters, and we have been doing just that during our engagement with the Department with respect to the aspects of the Green Paper where the government has been consulting and also more broadly."
        },
        {
            "text": "The consultation exercise on the Green Paper closed on Monday (30 June), and as the Department considers the responses it has received from a wide range of organisations and individuals, I thought it timely to share our initial views on a number of areas which we considered required further attention, and on which we advised the Department to reflect further when considering its next steps. Although the Government has recently announced that it has taken one of its Green Paper proposals out of the current Bill which will deliver aspects of this reform, this advice remains pertinent.[1]"
        },
        {
            "text": "1. An Integrated Vision"
        },
        {
            "text": "The Green Paper contains far-reaching proposals for reforming benefits, supporting people into work, and managing public spending."
        },
        {
            "text": "What does ‘good’ look like? We have urged the government to articulate further its goals for the different groups of people who will be affected, ranging from those who are expected to return to the labour market relatively quickly to those for whom there is little or no realistic expectation of future work because of the nature of their health condition or disability. A more tangible range of ambitions will not only provide certainty for claimants but will also be essential for the thousands of DWP staff who will be tasked with delivering these reforms on the ground."
        },
        {
            "text": "2. The \"Why\" Behind the Policy Matters"
        },
        {
            "text": "We have highlighted several areas where the intent behind the proposals needs to be explained more fully as the policy is developed."
        },
        {
            "text": "The proposal to make the Personal Independence Payment (PIP) the sole gateway to the health element of Universal Credit (UC) is a fundamental change. Historically, we have had two distinct types of support: one for the extra costs of disability (PIP) and one to alleviate the poverty associated with being out of work long-term due to ill-health (the UC health element). Conflating these two purposes by using a test for one to grant the other needs a clearly articulated justification. The Minister for Social Security and Disability has subsequently announced that clause 5 would be removed from the Bill at Commons Committee stage and that no changes to PIP eligibility, activities and descriptors would be made before the completion of his review into PIP eligibility.[2]"
        },
        {
            "text": "We have previously asked the government to clarify its thinking so that everyone, including Parliament ahead of its consideration of the Bill, was able to understand the underlying rationale. The PIP review will provide an opportunity to do so on that aspect."
        },
        {
            "text": "3. Employment Support"
        },
        {
            "text": "The Green Paper promises \"tailored and guaranteed support\" for disabled people, which is a welcome ambition. The plan involves removing the Work Capability Assessment. This is a complex area requiring specialist skills. We have recommended that as the Department develops its policy, it provides more details on:"
        },
        {
            "text": "We note the additional funds proposed for employment support, and look forward to receiving greater clarity around how the Department intends to make use of the insights obtained from pilots across the country to inform and support effectively the development of employment support proposals."
        },
        {
            "text": "4. The Need for Evidence"
        },
        {
            "text": "The Committee has consistently raised concerns about the adequacy of published Equality and Poverty Impact Assessments for major policy proposals. We are urging the Department to create a solid foundation of evidence to underpin its policy development, for example by undertaking and publishing a deep analysis of how these reforms will affect different groups, including those with protected characteristics, carers, and families who may be affected by the benefit cap."
        },
        {
            "text": "Our Conclusion: Learn from the Past, Trial for the Future"
        },
        {
            "text": "History has shown that reforming health and disability benefits is fraught with risk. Previous attempts made by successive governments have often failed to meet their goals, leading to rising costs while damaging trust and causing real harm to claimants."
        },
        {
            "text": "Because the stakes are so high, including for a significant number of claimants in vulnerable situations, we believe it is imperative that any changes are robustly tested and trialled. This is the only way to ensure that policy is informed by high-quality evidence and analysis, avoiding the mistakes of the past."
        },
        {
            "text": "The Government has demonstrated its willingness to listen to advice – from SSAC, Parliamentarians and a wide range of other commentators and stakeholders. They have also given a commitment that the review into PIP eligibility “will be co-produced with disabled people, the organisations that represent them, clinicians, experts, MPs and other stakeholders, so a wide range of views and voices are heard.” The Committee has previously been a strong advocate of the merits of such an approach, and we welcome this commitment.[3]"
        },
        {
            "text": "The Committee fervently hopes that this commitment will lead to better outcomes which effectively deliver the government’s ambition that “disabled people have the support they need to live independently, with dignity, and will unlock opportunities to get into work without facing the prospect of losing the help they need”.[4]"
        },
        {
            "text": "The Committee will, in due course, fulfil its statutory duty by scrutinising regulations that stem from the Green Paper. In addition, we will continue to engage constructively with the Department on the development of proposals that fall outside our formal scrutiny remit, for example those changes being brought forward in primary legislation and/or guidance. Our goal is to provide advice and add value across the entire reform programme and support the government in getting this right."
        },
        {
            "text": "[1] Universal Credit and Personal Independence Bill Introduced to Parliament on 18 June 2025."
        },
        {
            "text": "[2] Second Reading of the Universal Credit and Personal Independence Bill 2025, 1 July 2025 “During this debate, my hon. Friend and others across the House have raised concerns that the changes to PIP are coming ahead of the conclusions of the review of the assessment that I will be leading. We have heard those concerns, and that is why I can announce that we are going to remove clause 5 from the Bill in Committee. We will move straight to the wider review…and only make changes to PIP eligibility activities and descriptors following that review. The Government are committed to concluding the review by the autumn of next year”."
        },
        {
            "text": "[3] SSAC Occasional Paper 25: How DWP involves disabled people when developing or evaluating programmes that affect them - GOV.UK"
        },
        {
            "text": "[4] Further details on welfare reforms published ahead of Second Reading - GOV.UK"
        }
    ]
}