{
    "url": "https://socialcare.blog.gov.uk/2025/07/04/the-10-year-health-plan-and-the-role-for-social-care/",
    "title": "The 10 Year Health Plan and the role for social care",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Workforce"
    ],
    "pub_date": "2025-07-04T13:12:04+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A plan we all helped to build"
        },
        {
            "text": "As health and social care professionals, carers and the cared for, it’s right we should be in awe of our hospital and A&E colleagues."
        },
        {
            "text": "They work tirelessly to keep us safe and well, often in high-pressured environments, where workplace challenges keep on coming and there are always new problems to solve."
        },
        {
            "text": "As social care nurses and care colleagues across the sector, we are no less committed and no less familiar with the intense demand placed upon our own skills, knowledge and expertise."
        },
        {
            "text": "After all, whether we’re working in community or clinical settings, we are all dedicated helping those in our care live happier, healthier lives for longer."
        },
        {
            "text": "That’s why we welcome the publication of the government's  10 Year Health Plan for the health and care system, shaped in part by the ideas, concerns and lived experience of people like you and me."
        },
        {
            "text": "We have long known our unique insights into community-based care help ease pressure on an overstretched system."
        },
        {
            "text": "NHS doctors and nurses need the time and space to deliver the best care, while we need the same to create supportive and restorative environments, which encourage and sustain health and wellbeing."
        },
        {
            "heading": 2,
            "text": "Our communities are where we shine"
        },
        {
            "text": "As we hope for wider social care reforms, this week’s announcement of a new Neighbourhood Health Service is a huge and welcome change for health and care services in our communities."
        },
        {
            "text": "Indeed, its launch speaks to our social care values of collaboration, prevention and compassionate community-based care. Neighbourhood teams, which will include social workers and palliative care staff alongside nurses, doctors and pharmacists, will allow much closer working between social care and health services."
        },
        {
            "text": "Social care nurses and professional carers are, of course, additional community assets. Their work enhances and supports NHS colleagues and through collaboration improves the outcomes for the people they look after."
        },
        {
            "text": "It’s not a silver bullet, but if this new era of coordinated health and care leads to a reduction in hospital admissions or delayed discharges back to care settings, it will have already been worth it."
        },
        {
            "text": "I’m also pleased to see that millions of unpaid carers, to whom we provide support through respite care services, will be offered digital assistance via the NHS App to make care plans, hospital appointments, and prescriptions easier to manage."
        },
        {
            "heading": 2,
            "text": "'My Carer' ushers new era of access and control"
        },
        {
            "text": "‘My Carer’ will be rolled out on the app from the beginnining of next March and will also be used by carers as proof of identity when contacting GPs, hospitals and pharmacies."
        },
        {
            "text": "Care plans will be essential for personalised care within the community. Right now, only 20% of people with a long-term condition have them. "
        },
        {
            "text": "We can do better than that and the 10 Year Health Plan provides an opportunity for us all to encourage their use. Together, we can make life easier for recipients of care and the family, friends and loved ones around them."
        },
        {
            "text": "Indeed, the plan sets a new standard that, by 2027, 95% of people with complex needs will have an agreed personal care plan created with full consideration of a person’s needs and wishes."
        },
        {
            "text": "Challenges remain of course, but social care colleagues of all disciplines and specialisms will, I’m sure, engage positively with the ambitions of the 10 Year Health Plan and help deliver care and support that works for everyone, whoever they are and wherever the live."
        }
    ]
}