{
    "url": "https://defrafarming.blog.gov.uk/2021/02/03/your-views-on-our-plans-for-sustainable-use-of-pesticides/",
    "title": "Your views on our plans for sustainable use of pesticides",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Ways to get involved"
    ],
    "pub_date": "2021-02-03T13:16:28+00:00",
    "content": [
        {
            "text": "Back in December, we published a draft national action plan on the sustainable use of pesticides and a consultation to find out what people think of it."
        },
        {
            "text": "The consultation is open until 26 February and we’re keen to get a wide selection of views, from a wide selection of people."
        },
        {
            "text": "We’re keen to hear from members of the farming community, related industries, environmental and public health groups, and members of the public."
        },
        {
            "heading": 2,
            "text": "Why the plan exists"
        },
        {
            "text": "Defra’s 25 Year Environment Plan, published in 2018, said:"
        },
        {
            "text": "“We must protect people and the environment from the risks that pesticides can pose. At the same time, farmers need to protect their crops.”"
        },
        {
            "text": "That’s what underpins the key aim of the pesticides plan: to minimise the risks and impacts of pesticides to human health and the environment, while ensuring pests and pesticide resistance are managed effectively."
        },
        {
            "text": "The plan centres on Integrated Pest Management (IPM). That means minimising the use of chemical pesticides, and maximising use of non-chemical pest control alternatives (such as physical, biological and other non-chemical methods). Common IPM techniques, like planting hedgerows or encouraging predators, can enhance biodiversity, and are good for pollinators."
        },
        {
            "text": "We believe maximising IPM will help us reduce the risks associated with pesticides, combat pest resistance, and support agricultural productivity and biodiversity. It’s one way – among many – we can achieve the goals set out in the 25 Year Plan."
        },
        {
            "text": "It’s also one of the many approaches mentioned in the Agricultural Transition Plan that we published in December last year."
        },
        {
            "heading": 2,
            "text": "Your input matters"
        },
        {
            "text": "Every piece of feedback matters. Please take the time to fill out the consultation. We welcome everyone’s views."
        },
        {
            "text": " "
        }
    ]
}