{
    "url": "https://space.blog.gov.uk/2023/08/01/entrepreneurs-encouraged-to-apply-to-the-uk-space-agency-accelerator-explore-programme/",
    "title": "Entrepreneurs encouraged to apply to the UK Space Agency Accelerator Explore programme",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Applications"
    ],
    "pub_date": "2023-08-01T11:37:23+01:00",
    "content": [
        {
            "text": "The UK Space Agency Accelerator has opened applications for its highly anticipated second round of the Explore programme."
        },
        {
            "text": "The programme offers unparalleled support for space entrepreneurs and is delivered through a partnership with the UK Space Agency, Entrepreneurial Spark and Exotopic."
        },
        {
            "text": "In its first successful round, the Explore programme supported a dynamic cohort of entrepreneurs with businesses ranging from STEM education to sustainability, data analytics and AI, to satellite and rocket hardware build, propelling their startups to new heights of success."
        },
        {
            "text": "Now, the programme is inviting the next cohort of ambitious and visionary space entrepreneurs from all walks of life to join its mission of driving innovation, economic growth, and sustainable space practices."
        },
        {
            "heading": 2,
            "text": "Success story"
        },
        {
            "text": "Ashley Johnson, founder and CEO of Applied Atomics, a UK space company on a mission to harness sustainability and atomic technology took part in the first Explore cohort in 2023."
        },
        {
            "text": "Ashley said:"
        },
        {
            "heading": 2,
            "text": "Round 2"
        },
        {
            "text": "The second round of the Explore programme will provide 30 highly coveted fully funded places for selected participants, perfect for those making their first steps into the commercial space industry."
        },
        {
            "text": "It is aimed at entrepreneurs who are either interested in building a business based on their existing space knowledge or in bringing new ideas from other industries, such as aerospace, law, quantum technology, farming, environmental engineering, or healthcare, that have potential in the space sector."
        },
        {
            "text": "Portia Bircher, Local Growth Manager at the UK Space Agency, said:"
        },
        {
            "text": "With a comprehensive support system designed to accelerate their entrepreneurial journey, participants will receive mentorship from seasoned industry experts, gain access to a wide network of partners, and receive tailored resources and training to address their unique challenges."
        },
        {
            "text": "The programme stands out from the rest due to its unique focus on cultivating entrepreneurial ​​mindsets and growth-oriented attitude, both crucial to achieving business success."
        },
        {
            "text": "Other areas of the Explore programme address personal growth, equip entrepreneurs with a diverse skill set to develop credible and capable entrepreneurs, and empower participants with unwavering confidence and focus on their goals."
        },
        {
            "heading": 2,
            "text": "Apply today!"
        },
        {
            "text": "Entrepreneurs interested in applying for the Explore programme can submit their applications through the programme's official website."
        },
        {
            "text": "The application process will remain open until 25 August, and successful applicants will start the programme on 25 September."
        },
        {
            "text": "To find out more about the UK Space Agency Accelerator and to apply, visit www.ukspaceaccelerator.co.uk."
        }
    ]
}