{
    "url": "https://educationhub.blog.gov.uk/2023/08/how-are-student-loans-changing-everything-you-need-to-know/",
    "title": "How are student loans changing? Everything you need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2023-08-01T16:42:22+01:00",
    "content": [
        {
            "text": "Student loans for new undergraduate students are changing from today (August 1) as new ‘Plan 5’ terms come into effect.  "
        },
        {
            "text": "The new terms will apply to students taking out a student loan to pay for undergraduate courses that start in September 2023, but students won’t be expected to start paying them back until the April after they leave their course, and no earlier than April 2026.  "
        },
        {
            "text": "The salary threshold for when repayments start, interest rate, and the length of the loan are changing. Here’s everything you need to know about Plan 5 loans. "
        },
        {
            "heading": 3,
            "text": "What plan will I be on if I’m starting university this September?  "
        },
        {
            "text": "If you’re starting your course on or after 1 August 2023 you will be on Plan 5 if: "
        },
        {
            "text": "You’ll be on a Postgraduate Loan plan if you’re studying a postgraduate master’s or doctoral course. "
        },
        {
            "text": "You’ll be on Plan 2 if you take out a Higher Education Short Course Loan or are continuing on a course. "
        },
        {
            "text": "If you’re not sure which repayment plan you’re on, you can sign into your online repayment account to check. "
        },
        {
            "heading": 3,
            "text": "How is the interest rate changing for Plan 5 loans? "
        },
        {
            "text": "Interest on student loans is added from when the first amount is paid either to you or to your university or college, until the loan is repaid in full or written off. "
        },
        {
            "text": "The interest rate is set at the start of each academic year and is linked to the rate of inflation as measured by RPI (retail price index).  "
        },
        {
            "text": "Previously, for loans taken out under Plan 2 (post-2012) loans, the interest rate was set at RPI plus 3 percent during study. From the April after you finished your studies, interest rates would vary on a sliding scale from RPI only to RPI plus 3 percent depending on how much you earn.  "
        },
        {
            "text": "However, under Plan 5, the interest rate is just set at RPI only both during and after study.  "
        },
        {
            "text": "This means the amount you owe increases over time but only by about as much as the price of retail goods and services.  "
        },
        {
            "text": "While interest added will affect how long it takes you to fully repay your student loan, the amount you pay back each week, month or year is based solely on what you earn, not what you owe. "
        },
        {
            "heading": 3,
            "text": "When do I start repaying my student loan if it’s a Plan 5 loan?  "
        },
        {
            "text": "You’ll only start to repay your loan when your income is over £480 a week, £2,083 a month or £25,000 a year - before tax and other deductions.  "
        },
        {
            "text": "Graduates who earn less than the repayment threshold, which will be £25,000 for Plan 5 loans in financial year 2026-27, will not be required to make any repayments at all. This threshold will be adjusted annually by inflation from April 2027. "
        },
        {
            "heading": 3,
            "text": "How much will my total loan be when I finish my course?  "
        },
        {
            "text": "Your total loan is made up of everything you borrowed while studying, plus interest. However, because student loans are not like other loans, the amount you repay each week, month or year is based solely on what you earn, not what you owe, and any outstanding balance is completely cancelled if not repaid within 40 years.   "
        },
        {
            "text": "You can borrow money for your tuition fees and for living expenses. A tuition fee loan goes towards the cost of your course, up to a maximum of £9,250 per year – which is the full cost of tuition in most cases – and is paid directly to your university or college. "
        },
        {
            "text": "A maintenance loan helps with the everyday costs of being a student like accommodation, food and transport. It’s paid directly into your bank account in instalments at the start of each term. "
        },
        {
            "text": "The amount you can borrow depends on several factors, including where you live and study and your household income. Use this link to find out how much you’re entitled to. "
        }
    ]
}