{
    "url": "https://nationalscreening.blog.gov.uk/2023/08/01/new-dates-announced-for-popular-screening-masterclass/",
    "title": "New dates announced for popular screening masterclass",
    "authors": [
        "Maryam Abdu"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-08-01T14:00:53+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has announced 3 new dates for its popular screening masterclass — Wednesday 4 October, Thursday 26 October and Tuesday 21 November 2023."
        },
        {
            "text": "Places are always highly sought after on the course, so we recommend you apply early to avoid missing out."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Screening masterclasses are run by the screening team that supports the UK NSC, which is hosted by the Department of Health and Social Care, and external experts. It caters for participants from a wide range of backgrounds, with varying levels of screening knowledge."
        },
        {
            "text": "Sessions are held over Microsoft Teams and use different teaching methods, including case studies, quizzes (to test how well the facilitators have delivered the knowledge — not to catch anyone out!) and practical exercises."
        },
        {
            "text": "The day session includes an in-depth look at:"
        },
        {
            "text": "We leave space in the programme for experience sharing, questions and your feedback."
        },
        {
            "text": "The classes are facilitated by screening expert Dr Angela Raffle, supported by Jo Harcombe and Nadia Permalloo."
        },
        {
            "heading": 2,
            "text": "New email"
        },
        {
            "text": "Please note, we have changed the email for people to use to contact us about the masterclass from phe.screeningmasterclass@nhs.net to screeninginformation@dhsc.gov.uk. We will continue to monitor the old email intermittently, but please use the new address from now on."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}