{
    "url": "https://geography.blog.gov.uk/2021/06/21/geography-in-government-awards-mark-an-exceptional-year/",
    "title": "Geography in Government Awards mark an exceptional year",
    "authors": [
        "reshaaddurgahee"
    ],
    "categories": [
        "Awards",
        "Geography"
    ],
    "pub_date": "2021-06-21T16:52:26+01:00",
    "content": [
        {
            "text": "The Third Geographers in Government awards took place on 27th May 2021, celebrating the achievements and impact of a broad profession of dedicated and talented individuals and teams across the public sector. The categories and winners were:"
        },
        {
            "text": "Advancing geospatial data science"
        },
        {
            "text": "Data Science Campus, Office for National Statistics"
        },
        {
            "text": "Estimating vehicle and pedestrian activity from town and city traffic cameras"
        },
        {
            "text": "This work focused on the use of traffic cameras as a source of open data offering value to public authorities by providing real-time mobility statistics for assessing the impact of policies on local populations and economies. Analysis was developed that processes large volumes of traffic camera data from across the UK, using a deep learning pipeline to detect pedestrians and vehicles of different types. The results have been adopted by ONS as an experimental faster indicator of the impact of the COVID-19 on the UK economy and society."
        },
        {
            "text": "Contribution to the profession"
        },
        {
            "text": "Christine Walton, UK Hydrographic Office"
        },
        {
            "text": "Christine Walton is to retire this year after 36 years at the UK Hydrographic Office. In this time she has contributed enormously in a wide variety of fields within nautical charting both nationally and internationally. These have included chart compilation work, the conversion of charts to WGS 84 in UK waters, defining charting standards and policy, implementing a new GIS based production and maintenance system at the UKHO and finally becoming the Geographic Technical Lead at the UKHO for Scotland, Ireland, Wales and the west coast of England."
        },
        {
            "text": "Excellence in geo-visualisation & cartography"
        },
        {
            "text": "OS API Team, Ordnance Survey"
        },
        {
            "text": "Ordnance Survey - National Mapping Services"
        },
        {
            "text": "In 2020 OS designed and developed a new suite of Map API’s that has revolutionised the way our public and private sector customers access and use Ordnance Survey data. The solution allows quick and easy access to a host of data in various cartographic styles. As part of the Geospatial Commission’s Public Sector Geospatial Agreement, over 5,500 public sector organisations now have direct and immediate access to OS’s most detailed and trusted location data via a suite of APIs which will transform how geospatial data is used to support government policy and underpin public services."
        },
        {
            "text": "Excellence in local government"
        },
        {
            "text": "TAME (Technical Assurance, Modelling and Economics Team) & Strategy team, Transport for the North"
        },
        {
            "text": "Transport for the North’s Future Travel Scenarios"
        },
        {
            "text": "Transport for the North (TfN) have worked to develop an innovative Future Travel Scenarios approach to help understand, navigate and respond to transport uncertainties. The Future Travel Scenarios offer this by providing an agile and flexible modelling framework to interrogate evolving and new trends at a detailed geographical level. The application of Future Travel Scenarios is not simply a one-off exercise but is now integrated into TfN’s wider evidence-building, planning and decision making frameworks."
        },
        {
            "text": "Impact on policy"
        },
        {
            "text": "Benchmark Team, Geovation – Propositions and Innovation – Ordnance Survey"
        },
        {
            "text": "Benchmark Programme and Locus Charter"
        },
        {
            "text": "The Benchmark Initiative was created by the Omidyar Network and Ordnance Survey to increase awareness of the many potential risks of using location data, to identify ethical principles, and to promote good practice. Benchmark also supports international collaboration to agree and promote a shared view of what good practice with location data looks like, in the form of the Locus Charter. The Benchmark Initiative has also raised awareness of ethical use of location data through a series of events as well as a support programme for entrepreneurs, whose businesses are showcasing amazing examples of ethical use of location data."
        },
        {
            "text": "Operational delivery "
        },
        {
            "text": "Ecosystems Analysis Team and Digital & Data Solutions Team, Joint Nature Conservation Committee"
        },
        {
            "text": "The Copernicus User Uptake Project (UK Action)"
        },
        {
            "text": "The Copernicus User Uptake Project (UK Action) has addressed the  large increases in the amount of satellite derived environmental data, notably through the Copernicus space programme. These data have great potential for the environmental sector and are free at point of access; however appropriate skills and knowledge are required to make best use of them.   This project supports this, and delivers satellite data to over 32 different public sector organisations."
        },
        {
            "text": "Excellence in Emergency Response"
        },
        {
            "text": "PHE GIS Team, Emergency Preparedness Division - Public Health England"
        },
        {
            "text": "Demonstrating the value and importance of flexible and scalable geographical data and tools in supporting a pandemic"
        },
        {
            "text": "The PHE GIS Team has made a significant contribution to the COVID-19 response, providing a flexible, responsive service locally, nationally and internationally. This included supporting technical advances, developing enhanced visualisation tools, providing geographical support to inform operational decision making and policy on geographical variation. Working 24/7, they ensured a response underpinned by robust geographical data, supported by various geographical tools. Their championing and support to the delivery of geographical data including UPRN and property classifications ensured that the importance of this data was recognised as instrumental aspects of how we understand and importantly make best use of geographical data."
        },
        {
            "text": " "
        },
        {
            "text": "The winner of the overall Geography in Government Award was shared between the Public Health England Team and the Data Science Campus from the Office for National Statistics."
        },
        {
            "text": " "
        },
        {
            "text": "Thalia Baldwin, Director at the Geospatial Commission said:"
        },
        {
            "text": "Celebrating the absolute best applications of dynamic data modelling, close collaborative working, impactful policy insights and critical operational delivery, the Government Geography Award winners exemplify the diverse and important range of initiatives that the Profession has been leading and impressive range of talented people working together to meet the significant public sector challenges this year."
        },
        {
            "text": "David Wood, Head of Profession for the Government Geography Profession added:"
        },
        {
            "text": "Every year I am amazed by the breadth and quality of nominations to the awards, this year has been no different.  The shortlisted nominations show the range and quality of contribution that geography professionals make to the public sector.  The final judging was even more challenging this year and the selection of the two teams from Public Health England and the Data Science Campus, ONS show how geography has been central to the response to Covid-19.  Congratulations to all who were shortlisted."
        },
        {
            "text": " "
        },
        {
            "text": "The Government Geography Profession was set up in 2019 and is a membership network of over 1,500 members from across central and local government.  It is now based at the Cabinet Office with the Geospatial Commission and is also part of the Government’s Analysis Function."
        },
        {
            "text": "If you are a geographer working in government you are able to access a range of support from webinars to job opportunities via its member site or by visiting the Government Geographers Profession organisation page."
        }
    ]
}