{
    "url": "https://hmlandregistry.blog.gov.uk/2021/06/21/how-can-i-remortgage-online/",
    "title": "How can I remortgage online?",
    "authors": [
        "Suzanne Earl, Senior Product Manager"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services"
    ],
    "pub_date": "2021-06-21T09:30:11+01:00",
    "content": [
        {
            "text": "Our digital mortgage service Sign your mortgage deed is a simple way to sign remortgage deeds online, reducing paperwork and delays when remortgaging. This last year has showed us why this service is essential."
        },
        {
            "text": "Since the first digital mortgage deed was signed and registered in 2018, our Sign your mortgage deed service has gone from strength to strength. But why should you use it?"
        },
        {
            "heading": 2,
            "text": "It’s made history – really quickly"
        },
        {
            "text": "The service has reached a major milestone this year: automatic updates to the register without caseworker intervention – a first for HM Land Registry."
        },
        {
            "text": "Sign your mortgage deed has now automated the registration process for around 20% of applications received into the service. Previously each deed that was submitted would need to be checked by a caseworker. Now the register can be updated automatically in a matter of seconds from the time of application."
        },
        {
            "text": "If you’re remortgaging, why not ask your bank if you could take advantage of this service?"
        },
        {
            "text": "This year we have welcomed RBS, Co-op and Virgin Money to the service, joining a range of high street lenders. We are also welcoming Leeds Building Society into the Sign your mortgage deed fold. The full list of who we’re working with includes high street providers such as HSBC, Nationwide and Santander."
        },
        {
            "heading": 2,
            "text": "The number of deeds continues to grow"
        },
        {
            "text": "We have received feedback that in the face of one of the most challenging years for the property industry, the service offered a great solution for lenders, conveyancers and borrowers both to protect their customers and reduce costs. It also offers an end-to-end digital journey for borrowers – meaning they could remortgage their homes without getting off the sofa or needing a witness, especially useful during times of social distancing."
        },
        {
            "text": "Use of the service expanded exponentially in 2020, which has continued into 2021. In February 2020 we announced that 7,000 deeds had been registered using the service. Now that number stands at an incredible 40,000 (early June 2021)."
        },
        {
            "heading": 3,
            "text": "Jenny Ratcliffe, Enact"
        },
        {
            "heading": 2,
            "text": "Automation and verification "
        },
        {
            "text": "The new automated process was thoroughly tested and was only turned on when it had passed through strict governance process. This new level of automation is a big moment for HM Land Registry and will help caseworkers focus on more complex cases. It also provides vital lessons while we consider how we could introduce automation to other application types in the future."
        },
        {
            "text": "In addition to exploring automation, we have continued to understand how the experience for borrowers could be improved and have been particularly encouraged by developments to the GOV.Verify journey to utilise cryptographic and biometric checking of identities. As we alluded to in our March blog on identity, this technology provides a high level of assurance in a neat user experience, making it simpler for borrowers to confirm their identity before signing their deed. In fact, our work has enabled us to really fast-track the work being undertaken on electronic signatures and digital identity verification."
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "The COVID-19 pandemic has shown the importance of digital services for HM Land Registry and for others across the industry. We have plans to extend the number of applications that can be automated by the service as well as always looking to involve more lenders and conveyancers."
        },
        {
            "text": "Keep an eye on our blogs for future developments with digital mortgages and if you have any feedback, either comment below or email digitalmortgages@landregistry.gov.uk."
        }
    ]
}