{
    "url": "https://educationhub.blog.gov.uk/2021/06/21/im-an-international-student-what-do-i-need-to-know-about-studying-in-england-during-the-pandemic/",
    "title": "I’m an international student, what do I need to know about studying in England during the pandemic?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus",
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2021-06-21T17:10:06+01:00",
    "content": [
        {
            "text": "International students are still able to come to England to study during the pandemic, and we understand you may have questions regarding Covid-19 measures and vaccines."
        },
        {
            "text": "So, what do you need to know?"
        },
        {
            "heading": 3,
            "text": "You don’t need to have been vaccinated to come to study in England. "
        },
        {
            "text": "Vaccination is not currently a requirement for entry into the UK. However, we encourage all international students to receive a vaccine, either in a different country before arriving for term, or in the UK once they arrive."
        },
        {
            "text": "Whether you have been vaccinated or not, it is vital that you look at the relevant travel advice to avoid any problems at the border."
        },
        {
            "heading": 3,
            "text": "Our amazing NHS provides world-leading healthcare, and you should register with a GP as soon as possible on arrival into England. "
        },
        {
            "text": "There may be a GP surgery attached to your university."
        },
        {
            "text": "While registration with a GP is encouraged to access the vaccine, you will also be able to request to book Covid-19 vaccination appointments as an unregistered patient through a local GP practice."
        },
        {
            "heading": 3,
            "text": "If you haven’t been vaccinated, you will be able to get a Covid-19 vaccine in England if you want one."
        },
        {
            "text": "Anybody aged 18 or over in the UK is eligible for the Covid-19 vaccine for free, regardless of their nationality or immigration status. International students in England and the rest of the UK aged 18 or over can receive the Covid-19."
        },
        {
            "text": "Nobody in England has to pay for the Covid-19 vaccination."
        },
        {
            "text": "The Covid-19 vaccine is free of charge and does not count as the kind of care that requires payment."
        },
        {
            "text": "International students or anyone seeing requests for payment should report this activity to their university institution and to Action Fraud. More information on Covid-19 vaccine scams is on the Action Fraud website here."
        },
        {
            "heading": 3,
            "text": "We are safely and methodically unlocking many areas of society, which will ensure you can enjoy a full and enriching experience while you are studying at a UK university. "
        },
        {
            "text": "We expect universities to continue to offer high quality provision when term restarts in September."
        }
    ]
}