{
    "url": "https://educationhub.blog.gov.uk/2021/06/key-things-you-might-not-know-about-fire-safety-in-schools/",
    "title": "Key things you might not know about fire safety in schools",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "School building",
        "School safety"
    ],
    "pub_date": "2021-06-21T14:55:05+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "It is crucial that all students and staff are safe at school. This is especially important in relation to fire safety, where schools, local authorities, and the Department for Education work towards the same goals of ensuring schools are a safe environment."
        },
        {
            "text": "Fires in schools are very rare and fewer than 1 in 1,000 school buildings are damaged by fire each year, but how does fire safety in schools work?"
        },
        {
            "heading": 3,
            "text": "All schools are legally required to have a fire safety plan called a Fire Safety Risk Assessment (FSRA)"
        },
        {
            "text": "Every school’s FSRA will be different, but there are some things they should all have in common. All schools must have regular fire drills to ensure students and staff have a clear understanding of evacuation procedures. The FRSA must also make clear who the named fire wardens are. This guidance is set by the Ministry of Housing, Communities and Local Government (MHCLG)."
        },
        {
            "text": "The MHCLG has produced a guide for schools that you can read here. The guide says that schools need to:"
        },
        {
            "text": "It is also crucial that:"
        },
        {
            "text": "Following this guidance has helped ensure fires in school are very rare and when they do happen their impact is minimised."
        },
        {
            "text": "The DfE supports schools by including useful information on fire safety in the Good Estates Management Guide, which is available online to support all schools. You can find out more about here: Health and safety - Good estate management for schools - Guidance - GOV.UK"
        },
        {
            "heading": 3,
            "text": "Last year we announced additional funding for school building maintenance"
        },
        {
            "text": "We know that one of the ways to make schools secure, is to make sure school buildings are maintained properly. In 2020 we announced an additional £560 million for repairs and upgrades to school buildings, on top of funding already allocated for the 2020 to 2021 financial year."
        },
        {
            "text": "Schools are able to choose how to use this funding for maintenance, repairs and upgrades of facilities which could include fire safety within their buildings."
        },
        {
            "heading": 3,
            "text": "We’ve also updated the guidance on building new schools "
        },
        {
            "text": "School fires are very rare, with Home Office Data showing there are fewer than 500 school fires per year, with 90% of fires limited to one room or causing no damage."
        },
        {
            "text": "However, we know that while fires are very rare, is it crucial that new schools are designed and built to ensure they are safe and secure."
        },
        {
            "text": "This includes multiple fire safety measures, such as making sure that pupils can evacuate quickly and in an orderly fashion if there is a fire. The DfE sets standards for how new schools should be designed."
        },
        {
            "text": "This guidance (named BB100) provides comprehensive fire safety design advice for school buildings in England."
        },
        {
            "text": "The guidance applies to nursery schools, primary and secondary schools, including sixth form colleges, academies and city technology colleges, special schools and pupil referral units."
        },
        {
            "text": "The guide is intended for all those with an interest in fire safety in schools, but in particular designers, fire engineers, building control officers (or equivalent) and fire safety officers. Head teachers, governors, teaching staff and facilities and maintenance staff can also use it to help develop their understanding of their role as fire safety managers."
        }
    ]
}