{
    "url": "https://insideDIO.blog.gov.uk/2021/06/21/reversing-the-trend-of-declining-bees-on-the-defence-training-estate/",
    "title": "Reversing the trend of declining bees on the Defence Training Estate",
    "authors": [
        "Derek Walter"
    ],
    "categories": [
        "Conservation",
        "Environment and Ecology",
        "Land Management",
        "Landmarc",
        "Wildlife"
    ],
    "pub_date": "2021-06-21T14:49:56+00:00",
    "content": [
        {
            "text": "There are many bees that are found on the Defence estate, such as the Honey Bee. [Crown Copyright/MOD2018]This week is National Pollinator’s Week and we’d like to share the initiatives we’ve put in place to help protect bees on the Defence estate."
        },
        {
            "text": "Bees are major pollinators, that ensure food and food security, sustainable agriculture and biodiversity and significantly contribute to the mitigation of climate change and environmental conservation."
        },
        {
            "text": "In March this year, the Ministry of Defence (MOD) issued the Climate Change and Sustainability Strategic Approach, which sets out the threats posed by climate change and how Defence must work to mitigate its impact through three ambitions; adaptation and resilience, sustainability and net zero, and global leadership."
        },
        {
            "text": "Landmarc manages the UK Defence Training Estate in partnership with the Defence Infrastructure Organisation and plays an important role in helping to minimise the environmental impact of training activities, while addressing implementing initiatives to encourage greater climate resilience. ."
        },
        {
            "text": "One of the biggest threats to bees is habitat loss caused by changes in land used for activities such as intensive agriculture, transport infrastructure or urbanisation. This has led to the decline  of bee habitats and a loss of the diversity in the diets that bees need to stay healthy."
        },
        {
            "heading": 2,
            "text": "How we’re helping to reverse the trend of declining bees"
        },
        {
            "text": "At Landmarc there are many examples of how our teams across the Training Estate have been working hard to reverse the trend in declining bee abundance in order to help protect the environment."
        },
        {
            "text": "In 2018 at Westdown Camp on Salisbury Plain, the team conducted a no mow trial, under the guidance of DIO Ecologists, which involved not mowing designated areas of Westdown Camp throughout the summer to back wider MOD initiatives in support of the UK Government's 10-Year National Pollinator Strategy. The results were impressive, with the no-mow areas alive with pollinators throughout the day."
        },
        {
            "text": "In early 2019, a no mow and wildflower project was set up at Warcop Camp in a bid to improve biodiversity and to reduce the carbon footprint of the site. The success of the initiative inspired further action and the team at Warcop have since entered into partnership with Cumbria Wildlife Trust (CWT) and Plantlife, who are acting on behalf of the CWT, to formalise the project which is named Meadow Maker."
        },
        {
            "text": "The rare Cornish Black Bee has been found at Tregantle Fort in south east Cornwall. [Crown Copyright/MOD2018]At Ballykinler in Northern Ireland, a five acre field opposite the headquarters building was left un-mowed to support pollinators, while at Tregantle Fort in south east Cornwall, an unused range is managed for the benefit of wildflowers to promote the rare Cornish Black Bee."
        },
        {
            "text": "In Castlemartin in Pembrokeshire, locally harvested Green Hay including yellow rattle, red clover, self-heal and bird's-foot-trefoil, as well as finer meadow grasses such as sweet vernal grass, crested dog's-tail and yellow oat grass, were seeded to encourage pollinators."
        },
        {
            "text": "At Sennybridge Camp, near the Brecon Beacons, areas where poppies are known to flourish are left uncut, while a similar initiative at Wyke Regis in Dorset, protects Bee Orchids; both of these flower species are attractive to pollinators."
        },
        {
            "text": "The initial no mow trial at Westdown Camp has now been recognised in the MOD Climate Change and Sustainability Strategic Approach report. Landmarc’s role includes maintaining and promoting the ecosystem of the UK’s Defence Training Estate, comprising forestry and habitat management across a number of areas designated as Sites of Special Scientific Interest, as well as preserving numerous scheduled ancient monuments across the estate."
        },
        {
            "text": "Following the success of the no mow trial we would like to encourage other sites to consider introducing more no mow areas, in line with the report and the Government’s National Pollinator Strategy."
        }
    ]
}