{
    "url": "https://civilservice.blog.gov.uk/2021/06/21/rising-to-the-civil-service-challenge-of-change/",
    "title": "Rising to the Civil Service Challenge of Change",
    "authors": [
        "Shazia Razzaq: Strategic Policy Lead, Scottish Government "
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service"
    ],
    "pub_date": "2021-06-21T14:29:30+00:00",
    "content": [
        {
            "text": "At Civil Service Live, Cabinet Secretary, Simon Case and Civil Service Chief Operating Officer, Alex Chisholm launched the vision for A Modern Civil Service. To kick off our new series, we’ve invited civil servant Shazia Razzaq to share her ideas about their priorities - and ours."
        },
        {
            "text": "Don’t worry if you haven’t heard of A Modern Civil Service - yet - you soon will. But what exactly does A Modern Civil Service mean? Well, let’s take as a starting point that even the most cutting-edge organisations must evolve and reinvent themselves if they’re to avoid standing still and the Civil Service is no exception. "
        },
        {
            "text": "‘A Modern Civil Service’ is not just a new strapline, but also a new approach. There is a sense that things are different. It builds upon the extraordinary work of the organisation and is also designed to help us become more skilled, innovative and ambitious. "
        },
        {
            "text": "Shazia Razzaq: Strategic Policy Lead, Scottish Government writes:"
        },
        {
            "text": "As Civil Service leaders, it’s important to recognise we all have a responsibility to act in a certain way – to amplify the behaviours we want to see in others. "
        },
        {
            "text": "For me, that means embodying traditional values such as integrity and honesty. But it goes much further. It’s so important to be aware of the impact of our own preconceptions and ensuring we take steps to address them. As part of that, we need to approach things with a curious, open mind.  "
        },
        {
            "text": "Call it out"
        },
        {
            "text": "If we truly want to see change, we must acknowledge that being a passive bystander is no longer an option. In other words, where we see something is wrong or just not working – we need to call it out.   "
        },
        {
            "text": "The phrase my Permanent Secretary, Leslie Evans, likes to use which captures this so well is, ‘Whatever you permit you promote!’  The Civil Service is a huge machine and in such organisations, it can take time to implement large scale changes. But even the tiniest change can bring about incremental improvements.  "
        },
        {
            "text": "As leaders, we need to recognise change is never impossible. And if there was ever the slimmest silver lining to 2020, Covid taught us that change can happen and even flourish at lightning speed, when required."
        },
        {
            "text": "Be brave "
        },
        {
            "text": "In the words of the American researcher Brene Brown, “As leaders we need to be brave.” Indeed, not only is mental courage important to be a credible leader, vulnerability is crucial too.  "
        },
        {
            "text": "When you lead with vulnerability, you become more human and relatable – enabling and empowering colleagues to do likewise.  It allows you to lead with compassion and empathy so that you’re not demanding, ‘Why are you not performing?’ but instead gently asking, ‘I’ve noticed you’re not yourself, are things ok?’"
        },
        {
            "text": "Fresh perspective"
        },
        {
            "text": "When I think about a renewed vision for the civil service, I consider a fresh perspective and exploring ways to do things a bit differently.  To be able to do that, diversity is so important – we need diversity of people and thought at every level.   "
        },
        {
            "text": "But even having a diverse workforce is not enough – a positive image, inclusion and a sense of truly belonging need to go hand-in-hand for people to give their best.  Only then can we truly reflect the communities we serve. "
        },
        {
            "text": "The challenge, as I see it, when we talk about change is to go about delivering change in a way that brings others along on the journey with you.  "
        },
        {
            "text": "Tough decisions"
        },
        {
            "text": "As leaders, what can and should we be doing to ensure the right change happens at the right time in the right way, pulling in others along the way? We also need to recognise that sometimes tough decisions have to be taken at the top and cascaded down. But often, it’s about implementing small changes that start in your own team, directorate or area with a ripple effect consistent with the wider changes we all want to see.  "
        },
        {
            "text": "For example (a subject close to my heart) there’s a lot of focus on upping the recruitment of ethnic minorities. To achieve this, we need to continuously review our practices and our diversity stats to make even the smallest most incremental gains.  "
        },
        {
            "text": "If the current practices aren’t working and diversity is stalling, then we need to shake things up, be brave and do things differently. It’s a huge challenge but it’s about making everyone in the Civil Service realise we are involved in one endeavour - and we all have a vital role to play."
        }
    ]
}