{
    "url": "https://kingsawards.blog.gov.uk/2021/06/21/winning-the-queens-award-for-enterprise-was-music-to-the-ears-of-percussion-play/",
    "title": "Winning the Queen’s Award for Enterprise was music to the ears of Percussion Play",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-21T14:44:29+01:00",
    "content": [
        {
            "text": "Robin and Jody Ashfield started their outdoor musical instruments business with a mission to create a product that would enable consumers to embrace music and find a feeling of instant satisfaction and joy. Musical instruments that could be shared outdoors with family, friends, and community, for people of all cultures, ages, and abilities and that are accessible, inclusive, and irresistible to play."
        },
        {
            "text": "Today, Percussion Play sells their instruments of concert pitch internationally to more than 50 countries through a network of resellers as well as directly through their website."
        },
        {
            "text": "We produce the best outdoor musical instruments in the world - premium handcrafted products that are made in our Hampshire workshop and sent to be enjoyed by communities across the globe. We’ve shipped our instruments to many varied locations, from busy city parks and playgrounds to outdoor spaces where they are used for music therapy, dementia care, music education, and interactive community spaces designed to bring people together."
        },
        {
            "heading": 2,
            "text": "How did you hear about the Queen’s Award?"
        },
        {
            "text": "We cannot remember a time since being in business that we haven’t been aware of these awards! They’re the UK’s best-known and largest cross-industry business awards and there really is no higher accolade than being recognised by your sovereign!"
        },
        {
            "text": "We decided to apply following our international business’s exponential growth. Recognising our products to be particularly niche and with a multicultural attraction, we resolved to offer them for sale globally and haven’t looked back. We now have daily shipments being delivered to countries across Asia, Australia, Africa, Europe, North and South America."
        },
        {
            "text": "The judges recognised both our manufacturing excellence and burgeoning strength in the marketing and export of our products across the world. We’ve attended many international trade shows and conventions over the years to showcase our instruments and invariably have a steady stream of landscape architects, designers, educators, and suppliers specifically come to visit our booth to see and play our instruments. It seems there is a genuine hunger for quality British products made by a vibrant, creative company."
        },
        {
            "text": "Writing our awards application initially seemed a daunting process, especially when, like anyone running an SME, you have a million and one other things that need doing! However, once we recognised that the time spent on the application would be an investment in the business rather than a cost, we were able to dedicate the time needed. In fact, it was a rather satisfying process that allowed us to reflect on our achievements and motivated us to make new plans. Subsequently, we’ve taken on several new team members to continue building towards the future."
        },
        {
            "heading": 2,
            "text": "The future for Percussion Play"
        },
        {
            "text": "Winning the Queen’s Award for Enterprise is a recognised and credible endorsement of our company and we’re extremely pleased that we threw our hat into the arena and applied. It has unquestionably raised awareness of our product and brand while sending very strong and positive signals to our existing customers that we are a dynamic, innovative, and trustworthy organisation to do business with."
        },
        {
            "text": "We’ve proudly adorned our product catalogue and website with the Queen’s Award logo to ensure as many people as possible are aware of our accolade! The award has also been a big motivator internally and we’ve witnessed a renewed sense of pride amongst the team. Seeing and hearing them sharing the details of our win with their own family and friends and social media was heart-warming. We’re looking forward to meeting the Lord Lieutenant of Hampshire in September and planning a proper celebration later this summer. Following a difficult year that has seen some of our team either temporarily furloughed or rapidly adjusting to working from home, this award has given us something to celebrate together along with our new team members who are excited to join an award-winning company."
        },
        {
            "text": "Find out more about Percussion Play on their website here: https://www.percussionplay.com/"
        },
        {
            "text": "Or take a look at their fantastic Queen's Awards video on our YouTube channel: https://youtu.be/Dtn6usSvFTs"
        },
        {
            "text": "Follow The Queen's Awards for Enterprise on Twitter: https://twitter.com/TheQueensAwards"
        },
        {
            "text": " "
        }
    ]
}