{
    "url": "https://mhclgdigital.blog.gov.uk/2025/02/07/digital-planning-scaling-the-planning-data-service/",
    "title": "Digital Planning: Scaling the Planning Data service ",
    "authors": [
        "Emma Beer",
        "Steve Messer"
    ],
    "categories": [
        "Data",
        "Digital Planning"
    ],
    "pub_date": "2025-02-07T17:23:59+00:00",
    "content": [
        {
            "text": "Our purpose is to make land and housing data easier to find, use and trust. "
        },
        {
            "text": "We believe this will lead to better planning decisions, fewer uncertainties and delays in the housing system, more new digital services for property and planning and better relationships between communities and developments.  "
        },
        {
            "text": "Our planning data platform collects planning and housing data from local planning authorities (LPAs) across England and transforms it into a consistent state. Anyone can view, download and analyse the data we make available.  "
        },
        {
            "text": "Six years ago, this work began as a bold initiative, but the past 12 months have marked a transformative phase. We’ve pioneered a new delivery model for a scaled team, strategically evolving two entities into three specialised teams. At the same time, we’ve steadily increased the presence of civil servants within these teams – a crucial step toward achieving the service’s ambitious objectives. This approach ensures we’re equipped with the ideal blend of skills and expertise to tackle the complexities of this mission and drive meaningful progress. "
        },
        {
            "text": "Last year LPAs provided around 200 datasets – up from around 30 the year before. That’s a six fold leap, and it’s a clear sign that the tools and guidance we’ve provided are empowering authorities to share high-quality data with less manual effort. And we’ve scaled our data design process to involve more participants from the sector, using co-design methods to bring users’ voices to the table. "
        },
        {
            "text": "To achieve this, in the last 12 months we have:  "
        },
        {
            "text": "To give you a bit more detail: "
        },
        {
            "heading": 2,
            "text": "1. Establishing a new team structure and aligning work to the right team  "
        },
        {
            "text": "Over the last year we’ve undergone an exciting transformation in how we structure and organise our work. Previously, the service had 27 people split across two teams and we have now expanded to approximately 40 talented people – some joining us following MHCLG's innovative digital and data recruitment days – to maximise our impact and restructured our operations to focus on the following core capabilities:  "
        },
        {
            "text": "This new structure allows the teams within the service to focus their expertise in the right areas, streamline our workflows and deliver results more effectively and at pace. Each team plays a vital role in delivering the platform and wider digital improvements.  "
        },
        {
            "heading": 2,
            "text": "2. Setting up agile cadences across the teams   "
        },
        {
            "text": "Establishing an effective workflow across our newly structured teams was the next important improvement.  "
        },
        {
            "text": "We synchronised our sprint cycles, with most teams now moving to a co-ordinated two-week sprint pattern, which helps in managing dependencies. And we set up a quarterly planning process.   To support good practices, we have established clear team expectations – including stand ups, our weekly weeknote contributions, blogging in the open, collaboration, retrospectives, objective setting, a focus on the delivery of outcomes over outputs, and continuous improvement initiatives.  These strike a balance between productivity and purpose and ensure we are all contributing towards the overall goals of the Digital Planning programme."
        },
        {
            "text": "Establishing an effective workflow across our newly structured teams was the next important improvement.  "
        },
        {
            "heading": 2,
            "text": "3. Maturing our objectives and key results (OKR) processes "
        },
        {
            "text": "Setting and achieving meaningful objectives is at the heart of our Digital Planning programme. Each team in the programme therefore sets themselves quarterly OKRs to work towards.  "
        },
        {
            "text": "In the Planning Data service we have moved away from a top-down approach to OKRs to one that blends perspectives, with both leadership and team members contributing to setting our objectives and the results we want to achieve. This is helping us to own and prioritise our work and keeps everyone engaged in the work that they are doing.  "
        },
        {
            "text": "Regular check-ins are important to ensure we’re heading in the right direction, so we’ve established bi-weekly OKR and risk review sessions. These meetings bring together team leads, product managers and delivery managers to track progress, remove blockers and overcome challenges. "
        },
        {
            "heading": 2,
            "text": "4. ‘Show the thing’ - our Show and Tell drumbeat  "
        },
        {
            "text": "One of the valued practices within the Digital Planning programme are our show and tell sessions. These are not just focused on progress updates but are an important opportunity for colleagues across the programme to come together, showcase their latest work, share any insights and lessons learned, and collaborate. They have been an important way for us to create a culture of openness and learning.  "
        },
        {
            "text": "We hold the Planning Data Show and Tells every 2 weeks without fail, providing a drumbeat to our delivery and product focus. These internal sessions have played a pivotal role in joining up our work as a team, receiving feedback from our peers, and to develop confidence in what we are building and how we are building it.   "
        },
        {
            "heading": 2,
            "text": "5. Bringing the team together "
        },
        {
            "text": "Having seen a lot of change and growth it was important to bring our dispersed team together for a face-to-face away day. In the autumn, the team joined up for an energising day in London from the far-flung corners of Bristol, Manchester, Reading, Darlington, Devon, Dorset, Deal and a few other locations. The gathering was an opportunity to explore the new government’s planning reform agenda and how Planning Data can enable and supercharge the delivery of these outcomes.  "
        },
        {
            "text": "We spent our time together discussing key challenges and emerging opportunities, and how to use lean principles to deliver our outcomes faster. It was valuable for our teams to take this time to build stronger cross-team connections and spark new ideas for innovation.  "
        },
        {
            "text": "It was great to see everyone’s energy, and spending time away from our screens to think, discuss and innovate together, gave us all a renewed focus and enthusiasm for the work we’re doing. "
        },
        {
            "heading": 2,
            "text": "Celebrating successes on the road ahead  "
        },
        {
            "text": "We’re starting to see momentum in our mission to transform land and housing data accessibility and reliability. Our latest figures, for the last 12 months, show an increase in the number of datasets being published on the platform. "
        },
        {
            "text": "It’s clear that more and more LPAs are improving their digital capabilities and recognising the value of sharing their data through the platform, for faster, more informed decision-making. "
        },
        {
            "heading": 2,
            "text": "What’s next   "
        },
        {
            "text": "In 2025, we’re looking to build on this momentum and better enable a planning system fit for the demands of the 21st century. "
        },
        {
            "text": "Meanwhile the value of the planning data platform is being recognised across the sector with Savills and Tract recently highlighting its transformative potential in blog posts. Savills highlight the central role of data to analyse, make decisions and streamline planning processes while Tract express their gratitude for the open data, which they have been able to use to develop new services to make planning more accessible for everyone.   "
        },
        {
            "text": "And the benefits for local planning authorities in making their data available on the platform is clearly demonstrated by Castle Point Borough Council, who wanted to stem the number of Freedom of Information requests they were receiving due to limitations with the council’s existing mapping systems. They joined the Open Digital Planning community and have proved that even with limited resources, councils can achieve great results, transforming their data and making positive changes to how they work.  "
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "For more information about the planning data team within the Digital Planning programme follow us on LinkedIn to stay connected, and subscribe to our newsletter for the latest updates.  "
        },
        {
            "text": "Look out for more case studies about local planning authorities modernising their planning practices and improving their data, on the Open Digital Planning website. "
        },
        {
            "text": "You can also take a look at this previous MHCLG Digital blog about the programme, which was chosen as a case study to showcase the department's digital goals and progress. "
        }
    ]
}