{
    "url": "https://naturalengland.blog.gov.uk/2025/02/07/helping-nature-to-recover-and-thrive-in-the-wye-valley-in-derbyshire/",
    "title": "Helping nature to recover and thrive in the Wye Valley in Derbyshire",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environmental Improvement Plan",
        "Farming",
        "Landscapes",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2025-02-07T15:26:53+00:00",
    "content": [
        {
            "text": "Ruth Keeley, Wye Valley Nature Recovery Project Senior Officer"
        },
        {
            "text": "Back in 2022, Natural England and Defra announced five unique Nature Recovery Projects (NRP) across the Peak District, West Midlands, Cambridgeshire, Norfolk and Somerset. Since then, a further seven projects have been introduced, covering more than 285,000ha across England."
        },
        {
            "text": "These multi-partnership projects are designed to fast-track nature recovery by working collaboratively and at a landscape scale to create and restore wildlife-rich habitats, corridors and stepping-stones to help wildlife populations to move around freely."
        },
        {
            "text": "I’m the Natural England Senior Advisor for the Wye Valley Nature Recovery Project in the Peak District where we're running several schemes to help nature recover and thrive in the area. We know that helping nature to recover is a powerful tool with multiple benefits for improving people's health, generating wealth and building the country's resilience to climate change and for food security."
        },
        {
            "text": "Promoting biodiversity with herbal leys"
        },
        {
            "text": "One of the ways the East Midlands Area Team is helping to promote nature recovery is by working with farmers to plant herbal leys (a mix of grasses rich in legumes and herb grasses) to encourage pollinating insects such as bees."
        },
        {
            "text": "The White Peak area of the Peak District has lots of dairy and beef farms, and silage is produced over the summer months to feed cattle over winter. However, silage fields are not great for biodiversity as they lack floristic interest and usually need fertiliser. This is not only expensive for farmers but can also inadvertently filter through the limestone geology into areas beyond which can have a detrimental impact to some of the sensitive habitats in the surrounding dales."
        },
        {
            "text": "Farmers have told us they were keen to boost biodiversity on their land, so the Catchment Sensitive Farming team (CSF) have been working with them to show how herbal leys help to attract pollinators. They are also drought-tolerant, nutritious for livestock and do not require fertilisers. Some early adopters are already seeing the benefits and our CSF colleagues have been organising walks for farmers to take them to herbal leys to see them in action. These are proving popular, with some farmers travelling from out of the area to take part."
        },
        {
            "text": "Rosemary Furness is a farmer at Beech Farm, Taddington, and has a longstanding relationship with Natural England and the CSF team. She said:"
        },
        {
            "text": "“We have been working with Natural England to trial nature-friendly farming practices on the edge of the Dales for several years now. This year we put in our first herbal ley, and we have been blown away the wildlife it has attracted – if it does half as well for the lambs this autumn, we will be very happy!”"
        },
        {
            "text": "The NRP funded pollinator surveys – carried out by the Bumblebee Trust, which was founded in response to growing concerns about the plight of the bumblebee –  have shown the herbal leys are working and numbers of bumblebees and hoverflies are increasing at these sites. We will continue these surveys over the coming years to see how the pollinator numbers change as the herbal leys develop and new ones are planted up. "
        },
        {
            "text": "Improving the River Lathkill's flow"
        },
        {
            "text": "We’re also looking at ways to improve the flow of the River Lathkill which runs through the Derbyshire Dales National Nature Reserve (NNR), working in conjunction with the reserve staff."
        },
        {
            "text": "While the river flows well during the winter, the Lathkill can disappear in the summer months due to low water levels and leakage into the ground due to the limestone and historical mining works beneath the ground. We have funded research to look at the above ground features which might be having an impact on the flow and making suggestions as to how these might be remedied."
        },
        {
            "text": "This could involve removing weirs or walls and allowing some areas to form more natural wetlands. Over the next two years we will be helping the NNR team to complete some below ground survey work to investigate the historic underground mining features that also impact the low flows."
        },
        {
            "text": "Improving the river flow throughout the year will support fish and other species that rely on the river ecosystem such as the dipper bird and invertebrates. This would also support the wider river system of the River Derwent, Trent and Wye and promote a natural flood plain in the winter."
        },
        {
            "text": "Utilising roadside verges as wildlife corridors"
        },
        {
            "text": "Another way  we're giving wildlife a helping hand is by making use of roadside verges in the Derbyshire Dales. Many of the high-quality sites rich in wildlife are quite isolated in the Wye Valley, surrounded by quite intensively managed farmland. Elsewhere in the country hedgerows can act as a network of wildlife corridors, but as the Peak District tends to have drystone walls instead of hedges, we need to look at alternative ways to allow species to travel between sites.Roadside verges can contain a diverse range of plants and support birds, small mammals, insects, butterflies and bees especially if they are managed a bit more like a wildflower meadow rather than being cut back too intensively. We are working with the county council and local authorities in the project area to investigate the ways that these verges are managed."
        },
        {
            "text": "From this roadside verge work we also identified other areas of grassland, including around campsites and village greens, that could be managed differently for wildlife. We are currently carrying out a project with the operators of some camping and caravan sites in the NRP project area to identify what opportunities might exist for nature recovery here. "
        },
        {
            "text": "Dewpond restoration at Ferndale"
        },
        {
            "text": "Many of these projects are still in progress but one where we're already seeing results is the restoration of two dewponds at Ferndale, an area directly adjacent to the Derbyshire Dales NNR."
        },
        {
            "text": "Dewponds are traditionally used by cattle for drinking but can also provide habitats for the great crested newt and invertebrates such as dragonflies and act as a stepping-stone for wildlife to move onto other areas. The ponds at Ferndale were no longer used by livestock and had become a bit neglected and stopped holding water, but by working with the National Trust who owns the site we now have two functioning ponds and we will be monitoring them over the next few years to see what wildlife returns to use them. By working with local farmers and land owners over the coming months, we hope to restore more of these important pond habitats. It has been very satisfying to see them restored and adding another piece to the jigsaw puzzle of supporting nature recovery in and around the Derbyshire Dales."
        },
        {
            "text": "As previously appeared in the February issue of Derbyshire Life.  "
        }
    ]
}