{
    "url": "https://apprenticeships.blog.gov.uk/2025/02/07/we-asked-our-apprentice-panel-for-their-favourite-things-about-gaining-skillsforlife-as-an-apprentice/",
    "title": "We asked our Apprentice Panel for their favourite things about gaining #SkillsForLife as an apprentice",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2025-02-07T08:59:30+00:00",
    "content": [
        {
            "text": "In the run up to National Apprenticeship Week 2025, we asked the IfATE Panel of Apprentices for their favourite things about being an apprentice."
        },
        {
            "text": "The apprentice panel brings together apprentices from a wide range of backgrounds, across all 15 of our routes. Their different experiences and views help to inform all areas of IfATE’s work."
        },
        {
            "text": "Here’s what five panel members said were their favourite things about being an apprentice:"
        },
        {
            "heading": 2,
            "text": "Alexia Williams – Through Life Technical Lead at Rolls-Royce, Apprentice Panel Chair"
        },
        {
            "text": "My Favourite thing about being an apprentice was the opportunity to explore various areas of the business through placement rotations."
        },
        {
            "text": "This allowed me to experience the different roles available to an Engineer at Rolls-Royce, ranging from Engine Testing and Naval Controls to Manufacturing Engineering, Future Product Design, and even business-focused roles like Sales and Business Development."
        },
        {
            "text": "I also appreciated meeting new people across the organisation and expanding my professional network before moving into a full-time position after my apprenticeship."
        },
        {
            "text": "Additionally, applying what I was learning at university to real-world scenarios at work helped solidify my understanding of aerospace engineering concepts and gave me practical, hands-on experience."
        },
        {
            "heading": 2,
            "text": "Hannah Linden - Metrology Technican at Jaguar Landrover, Apprentice Panel Vice Chair"
        },
        {
            "text": "My favourite thing about being an apprentice is the amount of exposure I get to real work life. From this I have gained so much more confidence, practical knowledge, and improved my communication skills."
        },
        {
            "text": "The best part is gaining relevant qualifications too, whilst doing a job I love and have so much passion for."
        },
        {
            "heading": 2,
            "text": "Alex Pearson – Operations Manager at Parkdean Resorts"
        },
        {
            "text": "The most rewarding thing about being an apprentice is being able to implement the learning you are doing in real-time and being able to put into practice different theories and rationale in my working environment. Making use of my new knowledge and skills also feeds into continuous improvement in both a personal and professional sense."
        },
        {
            "text": "Undertaking an apprenticeship has allowed me to display to my direct reports the value of continued learning. I have then been able to assist with the continuous professional development of my team through enrolling them in apprenticeships for their development."
        },
        {
            "heading": 2,
            "text": "Hannah Wright – Project Manager and Education Liaison Officer at Digital Innovators"
        },
        {
            "text": "One of my favourite things about being an apprentice has got to be the fact that I can learn so much, all whilst earning a salary and having a job. I am able to learn from my University studies, and experience life as a student, as well as growing my career and learning practically through my role and from my colleagues."
        },
        {
            "text": "Another thing I love about being an apprentice is being part of networks and events that allow me to meet and work with like-minded individuals, and spread the word about apprenticeships."
        },
        {
            "heading": 2,
            "text": "Esme Freitas - Chartered Surveyor at Derry Building Services"
        },
        {
            "text": "The best thing about being a quantity surveying apprentice is the varied opportunities I’m given, gaining hands on experience whilst learning the technical aspects of the profession and wider construction industry."
        },
        {
            "text": "In a typical week, I attend university, visit sites, and work in an office environment. No day is ever the same!"
        },
        {
            "text": "I get to work alongside experienced professionals who are always willing to support and encourage my learning, seeing my confidence grow over the years. Having 5 years practical experience under my wing alongside my formal education sets me up for a successful career in the construction industry, having gained the knowledge, skills and behaviours it takes to ‘hold your own’ in this field."
        },
        {
            "text": "With ever changing technologies and practices, I know my job will never get boring!"
        }
    ]
}