{
    "url": "https://educationhub.blog.gov.uk/2025/02/welcome-to-the-department-for-educations-new-non-executive-board-members/",
    "title": "Welcome to the Department for Education’s new non-executive board members",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Department for Education Board",
        "Leadership"
    ],
    "pub_date": "2025-02-07T12:32:15+00:00",
    "content": [
        {
            "text": "The Department for Education (DfE) has announced four new non-executive members."
        },
        {
            "text": "The appointments bring a wealth of skills and experience to the department as we take forward our vital work - from giving the best start in life to our youngest learners, providing the highest standards of school education, and opening up skills pathways for lifelong learning.  "
        },
        {
            "heading": 3,
            "text": "Who are the new non-executive directors at the DfE? "
        },
        {
            "text": "Naomi Eisenstadt brings extensive experience in early childhood education and tackling educational inequality, including as a former Director of Sure Start.  "
        },
        {
            "text": "Steve Crocker has impressive local authority leadership expertise in children’s social care with a deep understanding of service delivery and sector-wide improvement."
        },
        {
            "text": "Rebecca George has a strong track record leading large-scale digital and skills transformation as a Partner at Deloitte and a non-executive director at the MET Police. "
        },
        {
            "text": "Margaret Casely-Hayford is highly regarded for her strategic oversight, risk and governance experience having held key positions as Director of Legal Services at the John Lewis Partnership and Non-Executive Director at NHS England. "
        },
        {
            "heading": 3,
            "text": "What is a non-executive director?"
        },
        {
            "text": "Non-executive directors sit on the Department for Education’s Board which is chaired by the Secretary of State for Education. They provide independent challenge as well as support to ministers and senior leaders. "
        },
        {
            "text": "You can read more about departmental governance here.  "
        },
        {
            "heading": 3,
            "text": "Who else is on the board? "
        },
        {
            "text": "The Department’s new non-executive board members will work with Sir Kevan Collins, who takes up the lead non-executive director role on 11 February 2025.  Sir Kevan was Chief Executive of the Education Endowment Foundation, a classroom teacher and a Director of Children’s Services in Tower Hamlets.  "
        },
        {
            "text": "The board will also benefit from the skills and experience of Stuart McMinnies and Sir Peter Bazalgette who will remain as non-executive board members.  "
        },
        {
            "text": "The Department is grateful for the contributions of outgoing board members in 2025. Richard Pennycook will step down as lead non-executive board member, as well as Toby Peyton-Jones whose tenure will come to an end in February 2025, and to Jack Boyer who will remain in post until his tenure ends in May 2025.   "
        }
    ]
}