{
    "url": "https://civilservicelocal.blog.gov.uk/2022/01/19/a-modern-civil-service-building-our-capability/",
    "title": "A Modern Civil Service - Building Our Capability",
    "authors": [
        "J Placide, CSRF"
    ],
    "categories": [
        "A National Spotlight",
        "East, South East & London"
    ],
    "pub_date": "2022-01-19T07:23:43+00:00",
    "content": [
        {
            "text": "Civil Service Local East, South-East & London (ESEL) has been working with the Civil Service Race Forum (CSRF) to understand the knowledge gaps that exist among civil servants, and the factors that hold aspiring staff members back from achieving their full potential - particularly those from diverse backgrounds that are less well-represented at senior grades."
        },
        {
            "text": "Consultation undertaken by CSRF indicates that many people want to understand how they can provide stronger evidence in the Success Profiles framework, and so we are planning to work in conjunction with CSRF to create peer-led sessions to address this issue."
        },
        {
            "heading": 4,
            "text": "Join us for a session on ‘Seeing the Big Picture’"
        },
        {
            "text": "You are invited to join us for a new series of Lunch and Learn capability events which will directly explore each individual behaviour under the Success Profiles Framework. We will breakdown what is being asked for in that behaviour, particularly in the context of job applications and interviews."
        },
        {
            "text": "These behaviour writing tips can be applied to most generalist roles between grade AO – G7 and should give you the confidence to strengthen any behaviours that you have already formulated or the behaviours that you plan to write."
        },
        {
            "heading": 4,
            "text": "Get involved"
        },
        {
            "text": "Should you be interested in presenting a future Lunch and Learn workshop in this series (or giving other interview/job application tips), please email csraceforum@beis.gov.uk"
        }
    ]
}