{
    "url": "https://deframedia.blog.gov.uk/2022/01/19/coverage-of-the-government-and-devolved-governments-announcement-that-they-are-seeking-views-on-the-joint-fisheries-statement/",
    "title": "Coverage of the Government and Devolved Governments' announcement that they are seeking views on the Joint Fisheries Statement",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-19T15:25:25+00:00",
    "content": [
        {
            "text": "On the 18th of January we announced that the UK Government and Devolved Governments are now seeking views on the Joint Fisheries Statement (JFS). The JFS sets out the legally binding policies which the UK Government and Devolved Governments will follow, at a UK level and individually, as they work together to deliver world-class sustainable fisheries and aquaculture management."
        },
        {
            "text": "There has been widespread positive coverage on the announcement across the UK, including op-eds from the Environment Secretary published in the Western Morning News, Aberdeen Press and Journal and Yorkshire Post, as well as an interview with the Environment Secretary broadcast on Good Morning Scotland."
        },
        {
            "text": "The Yorkshire Post underlines key ambitions of the plan to reduce the impact of fishing on the marine environment and support the industry, as well as a quote from the Environment Secretary outlining; how the Fisheries Act has given us the powers to implement our own independent fisheries policy, improve our marine environment, and make decisions based on the health of fish stocks and not vested interests."
        },
        {
            "text": "The op-ed in the Western Morning News details the announcement whilst highlighting the recent fisheries agreement with Norway as well as our £100 million investment via the UK Seafood Fund which will help rejuvenate coastal communities up and down the country."
        },
        {
            "text": "There is further positive coverage across the UK, in titles including the Independent, Belfast Telegraph, The Irish News, and Evening Standard. These titles all highlight our ambitions for an “ecosystem-based” approach to fishery management with a commitment to protecting and, where necessary, restoring fish stocks."
        },
        {
            "text": "All titles quote the Environment Secretary’s statement on the announcement with the Independent, Belfast Telegraph and Evening Standard also including statements from the Scottish Government’s Rural Affairs Secretary and the Irish News including a statement from Northern Ireland’s Agriculture Minister."
        },
        {
            "text": "Environment Secretary George Eustice, said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}