{
    "url": "https://educationhub.blog.gov.uk/2022/01/face-masks-in-classrooms-will-no-longer-be-required-from-20-january-and-in-communal-areas-from-27-january-what-you-need-to-know/",
    "title": "Face masks in classrooms will no longer be required from 20 January and in communal areas from 27 January - what you need to know",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2022-01-19T17:59:00+00:00",
    "content": [
        {
            "text": "EDIT: This post was updated in July 2022 to ensure it reflects up-to-date guidance and information "
        },
        {
            "text": "Since January, we have advised that face coverings in classrooms in schools and colleges are no longer required, and face coverings in communal areas are likewise no longer required. Here we provide an update on what you need to know."
        },
        {
            "heading": 3,
            "text": "What have you announced?"
        },
        {
            "text": "The confirmation that face coverings no longer need to be worn in classrooms came into effect on Thursday 20 January, or in communal areas of schools and colleges on Thursday 27 January."
        },
        {
            "text": "This decision was made in response to national infection data showing the prevalence of COVID-19 is on a downward trajectory."
        },
        {
            "heading": 3,
            "text": "Are there any circumstances where I still might need to wear a mask?"
        },
        {
            "text": "Local Health Protection Team’s (HPT) can recommend the use of face coverings in communal areas—across their area only—where DfE and public health experts judge the measure to be proportionate due to specific health concerns. This is a temporary measure."
        },
        {
            "text": "HPT’s will also continue to advise individual settings experiencing outbreaks. Any local introduction of face coverings will be subject to routine review and removed at the earliest opportunity."
        },
        {
            "heading": 3,
            "text": "Do pupils, families and staff still have to take regular COVID tests and get vaccinated?"
        },
        {
            "text": "From 1 April, regular testing stopped being recommended in education, childcare and children’s social care settings. As individuals are now mixing in an otherwise open society, regular testing within a setting is no longer as effective as it once was."
        },
        {
            "text": "Public health advice is that testing in education and childcare settings is no longer needed. It is not recommended that children and young people are tested for COVID-19 unless directed to by a health professional. If children and young people aged 18 and under are unwell and have a high temperature then they should stay at home and avoid contact with other people, where they can."
        },
        {
            "text": "It is also important that all those eligible get a vaccine or booster. For information on the importance of getting a vaccine or boosted, please visit our piece here: How getting a booster will help protect education - The Education Hub (blog.gov.uk)."
        }
    ]
}