{
    "url": "https://designnotes.blog.gov.uk/2022/01/19/how-to-run-a-careers-event-to-increase-the-diversity-of-your-team/",
    "title": "How to run a careers event to increase the diversity of your team",
    "authors": [
        "Keeley Robertson",
        "Clara Greo – former Lead Designer, GDS"
    ],
    "categories": [
        "Equity",
        "Tried & tested"
    ],
    "pub_date": "2022-01-19T14:00:04+00:00",
    "content": [
        {
            "text": "We believe that diversity and inclusion matters. "
        },
        {
            "text": "Diverse teams are better and deliver better outputs. The makeup of our team should reflect the people we serve. To build equitable and inclusive products, we must have people with a wide variety of lived experience in our teams. "
        },
        {
            "text": "We’ve found that running careers events for underrepresented groups is one of the most effective things we’ve done to increase the diversity of the team. "
        },
        {
            "text": "We have run careers events 7 times now, with over 450 attendees. "
        },
        {
            "text": "Prospective candidates get a feel for what GDS and Cabinet Office is like and what it’s like to work as a designer or researcher at GDS or Cabinet Office. They hear from and talk to a variety of designers and researchers at GDS and Cabinet Office. It gives people an opening to GDS, creates personal connections and demonstrates that we care about equity and diversity and that we’re doing something about it. "
        },
        {
            "text": "The evidence for how effective these events are is anecdotal but consistent and substantial. We’ve had many candidates tell us that attending an event was a turning point for them which helped them decide to apply for a job in the GDS design team, and we now have members of the team who first encountered GDS at a careers event and now help run the events. "
        },
        {
            "text": "We also had many teams across GDS and government ask for support and advice on running their own events. There are lots of other teams doing good work in this area and reflecting on why it’s hard to do. This blog post aims to document how we have run these events to encourage others to do the same. "
        },
        {
            "heading": 2,
            "text": "How to run a careers event"
        },
        {
            "text": "When we run it, the event takes about 2 hours, though we always try to include some contingency time as the lightning talks often overrun. "
        },
        {
            "text": "This is a typical agenda for the event: "
        },
        {
            "text": "5.30pm - 6pm – A talk about GDS and user-centred design (UCD)"
        },
        {
            "text": "6pm - 6.40pm – Lightning talks on topics such as user research, content design, technical writing, interaction design and service design"
        },
        {
            "text": "6.40pm - 7pm – A talk about applying for jobs in government"
        },
        {
            "text": "Attendees can request a follow up chat, email or portfolio review with someone over the next few days. They do this via a form (this form isn’t active, so no data will be saved if you fill it in) which we share towards the end of the session. Usually about 50% of attendees request a chat, and the ones who do really value the 1-to-1 contact and support it provides. Doing 1 or 2 follow-up chats of 15 minutes each is usually not too much of a burden for volunteers."
        },
        {
            "text": "This is the to-do list we use to make the events happen:"
        },
        {
            "heading": 3,
            "text": "1. Choose a date and time"
        },
        {
            "text": "It’s great if you have roles open or opening soon, but it’s ok if you don’t. "
        },
        {
            "text": "We’ve run the event after work (starting at 5.30pm) and at lunch time (starting at 12pm). Attendance after work is better, but both are needed to ensure people can choose the option that best suits them."
        },
        {
            "heading": 3,
            "text": "2. ​​Work with the recruitment team on the event "
        },
        {
            "text": "Invite them to participate or support if they have capacity. Our recruitment team has always been very encouraging and has supported the events when they can."
        },
        {
            "heading": 3,
            "text": "3. Book a room (if you’re hosting an in-person event)"
        },
        {
            "heading": 3,
            "text": "4. Create a registration form"
        },
        {
            "text": "We use tools like Eventbrite."
        },
        {
            "text": "Different teams might want to promote to different groups, and you might want to reserve tickets for some groups or limit tickets to others. "
        },
        {
            "text": "Currently we reserve pools of tickets for these groups:"
        },
        {
            "heading": 3,
            "text": "5. Publicise and promote the event to the communities you want to reach"
        },
        {
            "text": "We put a lot of effort into promoting the event outside our usual circles - using Twitter, LinkedIn, email newsletters and other individuals and groups who can help us reach people who might not otherwise hear from us. It can take a bit longer to get through to more distant communities, so 2-3 weeks is a good lead time. "
        },
        {
            "text": "Take time to do research into where these groups exist. "
        },
        {
            "text": "Be conscious of asking for favours and not doing or giving anything in return."
        },
        {
            "heading": 3,
            "text": "6. Find volunteers to speak at the event"
        },
        {
            "text": "Setting the tone of the event is really important, as it gives people a feel for the culture and values of the organisation. Attendees pay attention to things like how speakers interact with each other, how people talk about their work and the diversity of the people speaking at the event. "
        },
        {
            "text": "You will need an MC and people to present each section, including lightning talks, so choose an MC who can keep the event inclusive and fun. You might also like to line up some volunteers to do follow-up chats."
        },
        {
            "heading": 3,
            "text": "7. Put the slide deck together "
        },
        {
            "text": "Ask volunteers to review the slides they’re presenting if they already exist, or to add their slides if they’ve made new ones. "
        },
        {
            "heading": 3,
            "text": "8. Set up the video call and share the details with the attendees and volunteers (if it’s an online event)"
        },
        {
            "heading": 3,
            "text": "9. Set up a tool for taking questions"
        },
        {
            "text": "Using a tool like sli.do to manage questions is very helpful, particularly if it allows attendees to ask questions anonymously, allows attendees to upvote other people’s questions and allows multiple people to answer questions live during the event. We usually leave a time for people to answer questions in a panel format towards the end of the event."
        },
        {
            "heading": 3,
            "text": "10. Make sure speakers are feeling confident and ready to go"
        },
        {
            "text": "Presenting can be scary"
        },
        {
            "heading": 3,
            "text": "11. Run the event"
        },
        {
            "text": "Have fun!"
        },
        {
            "heading": 3,
            "text": "12. Delegate follow-up chats to volunteers"
        },
        {
            "text": "Let them know it's up to them to get in touch with people and arrange the conversations. Set the expectation that they should reach out within 1-2 days and aim to have the chat within a week of the event."
        },
        {
            "heading": 3,
            "text": "13. Make sure follow-up chats happened"
        },
        {
            "heading": 3,
            "text": "14. Collect and analyse feedback and measure impact"
        },
        {
            "text": "We collect feedback from attendees and volunteers, and we also review the questions attendees asked. It’s great to report back what you found to your team and share what you would change next time; and also to benchmark what effect the events has if you can."
        },
        {
            "heading": 2,
            "text": "What prospective candidates want to find out"
        },
        {
            "text": "We invite attendees to tell us what they want to find out on the registration form for the event, during the event, in feedback at the end of the event and in the form to request a follow-up chat. These are the things that prospective candidates usually want to find out:"
        },
        {
            "text": "What the work actually looks like and what someone in a design or research role does day-to-day. Who they work with, what tools they use, what types of problems they work on. Photos can be a big help in communicating this."
        },
        {
            "text": "How people at GDS interact with each other and what the culture and values of GDS are. What GDS is like to work for as an employee, how flexible we can be in terms of locations, hours and holidays. What GDS is like to work for as a parent or carer, or as a disabled person."
        },
        {
            "text": "What the application process is like and what are we looking for during this process."
        },
        {
            "text": "What skills they need to do the role and to be successful in the application process. We are often asked for advice on how they can build up the skills, particularly if someone is not able to attend and pay for further education or training."
        },
        {
            "text": "What the transferable skills are to help someone into these roles from other roles."
        },
        {
            "text": "What the career progression opportunities are like at GDS, and what support and training is available to staff."
        },
        {
            "text": "What the visas and citizenship requirements are for working at GDS."
        },
        {
            "heading": 2,
            "text": "Have a go"
        },
        {
            "text": "We encourage you to measure the diversity of your teams, reflect on why it’s like that and how you’d like to change it. "
        },
        {
            "text": "We encourage teams to make sure they are inclusive and equitable places to work. The career events work best when teams acknowledge and talk about their shortcomings and are open about what they’re doing to address them. "
        },
        {
            "text": "Finally, we encourage you to have a go at running a careers event. It takes a bit of organising, but it’s not hard to do!"
        }
    ]
}