{
    "url": "https://defrafarming.blog.gov.uk/2022/01/19/improving-farm-productivity-grants-open-for-applications/",
    "title": "Improving Farm Productivity grants: open for applications",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-01-19T13:54:58+00:00",
    "content": [
        {
            "text": "At the end of last year, we published a manual on the Improving Farm Productivity grant, which is part of the Farming Transformation Fund. "
        },
        {
            "text": "The manual explains what the Improving Farm Productivity grant is for, who is eligible to apply and how to apply. We wanted to give people a little more time to plan and consider their options before opening the application window. "
        },
        {
            "text": "Today we opened the window for applications. We’re also hosting a webinar next week for you to find out more. I'll add links at the end of the post."
        },
        {
            "heading": 3,
            "text": "A quick recap "
        },
        {
            "text": "The Farming Transformation Fund provides grants to improve productivity, profitability and enhance environmental sustainability, and includes 3 different themes."
        },
        {
            "text": "The Improving Farm Productivity grant sits alongside 2 other themes in the fund: Water Management and Adding Value."
        },
        {
            "text": "We previously launched the Water Management theme and the Farming Equipment and Technology Fund."
        },
        {
            "text": "The Adding Value theme, aimed at adding value in food production, will be available in Spring 2022."
        },
        {
            "heading": 3,
            "text": "Getting started "
        },
        {
            "text": "As with the Water Management theme which launched in November, there is a 2-step application process for the Improving Farm Productivity grant. "
        },
        {
            "text": "The process starts with an online eligibility checker."
        },
        {
            "text": "The online checker opens today and will remain open until the 16 March 2022. "
        },
        {
            "text": "Those who are invited to make a full application will have until 14 September 2022 to do so.  "
        },
        {
            "text": "If planning permission is then required for the project to proceed, this will need to be in place by 31 December 2022. "
        },
        {
            "heading": 3,
            "text": "Eligibility and equipment recap "
        },
        {
            "text": "The Improving Farm Productivity theme is open to farmers, growers and related contractors with the minimum grant of £35,000. The maximum grant available under this theme is £500,000 per applicant. "
        },
        {
            "text": "The grants awarded through ‘improving farm productivity’ will pay for capital items to improve farm and horticulture productivity through: "
        },
        {
            "heading": 3,
            "text": "Watch the webinar"
        },
        {
            "text": "If you have any questions relating to what the theme will pay for, please email the Rural Payments Agency at FTF@rpa.gov.uk "
        }
    ]
}