{
    "url": "https://ssac.blog.gov.uk/2022/01/19/new-style-contributory-benefits-how-well-are-they-working/",
    "title": "New Style contributory benefits: how well are they working?",
    "authors": [
        "Carl Emmerson"
    ],
    "categories": [
        "Consultation",
        "Contributory benefits",
        "DWP",
        "New style ESA",
        "New style JSA",
        "social security",
        "SSAC Independent Work Programme"
    ],
    "pub_date": "2022-01-19T08:09:54+00:00",
    "content": [
        {
            "text": "As part of our independent work programme we have recently started a detailed study into New Style Jobseeker’s Allowance and New Style Employment and Support Allowance. These two contributory benefits are for working age individuals who have been in paid work for most of the last few years – and therefore have been making National Insurance Contributions – but are now out-of-work. Unlike Universal Credit they are largely not means-tested, that is to say individuals can receive these benefits regardless of their savings or of the earnings of their partner."
        },
        {
            "text": "Because of the Covid-19 pandemic, the numbers receiving New Style Jobseeker’s Allowance have shot up: there were 24,000 claimants in 2019–20 and this rose six-fold over the following twelve months to 157,000 in 2020–21. While the numbers receiving this benefit has fallen back sharply since they still remain above pre-pandemic levels and will do for some years to come. This makes it all the more crucial that it is working well. And while Universal Credit rightly gets much attention we want to know how well these lower profile, but still important, contributory benefits are working alongside Universal Credit."
        },
        {
            "text": "Our study follows on from the joint report we did earlier this year with the Institute for Government on what lessons for the social security system can be learned from the experience of the COVID-19 pandemic. That report recommended a modest strengthening of New Style Jobseeker’s Allowance and for careful consideration of whether reforms should go further. Our new study will delve more deeply into how the system works for those who are out of work but have recently made National Insurance Contributions, and also ask whether they should be treated more favourably."
        },
        {
            "text": "Part of our research involves talking to those involved in administering and delivering these benefits. And it also vital that we hear from those who have experience of applying for, and of receiving, these benefits across England, Scotland, Wales and Northern Ireland. This will give us insights into what is working well, and what can be improved, right across the country."
        },
        {
            "text": "To help get this information we have set up a short, simple, online survey – available here. So if you have moved out of paid work and applied for one of these benefits then please do fill it in. It should only take five minutes of your time and could help ensure your experiences of the system – both good and bad – can be reflected in our report and in our recommendations, and – we very much hope – lead to lessons being learned and improvements being made."
        },
        {
            "text": "An Easy Read version of our survey is available here."
        },
        {
            "text": "Our survey closes on 25th February 2022."
        }
    ]
}