{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2022/01/19/new-year-new-digital-you/",
    "title": "New Year, New Digital You.",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "Cyber",
        "Technology"
    ],
    "pub_date": "2022-01-19T16:55:59+00:00",
    "content": [
        {
            "text": "As visions of mince pies and too much wine fade into memory and the reality of a new year rolls around, lots of us become self-reflective and consider what we are going to do differently for the next 12 months."
        },
        {
            "text": "Many of us have experienced the guilt of finding that woefully underused gym membership card or watching that layer of dust build up on the resistance bands we bought in a fit of January enthusiasm.  By June they’ll be sold in the local car boot sale."
        },
        {
            "text": "We’ve all turned down that chocolate biscuit on the first day back into the office, proudly claiming “sorry, but I’ve given that stuff up this year”, only to see in February stress-munching our way through an entire pack of chocolate hobnobs with zero shame."
        },
        {
            "text": "Making change is hard, and many of us set ourselves up to fail. We try to force ourselves to do too much too quickly, or make too radical a change, and then we beat ourselves up when we don’t succeed, before swearing we’ll do better next year."
        },
        {
            "text": "So, for 2022 Strategic Command would like to offer you three simple changes which you can make that will not only make your life better, but will keep you safer too. It’s a new year and time for a new digital you."
        },
        {
            "heading": 3,
            "text": "Step 1: Change your passwords!"
        },
        {
            "text": "Passwords are like underwear. Essential in almost every situation, and generally you shouldn’t leave home without them. Also, like underwear, you probably shouldn’t use the same ones for every occasion."
        },
        {
            "text": "If you’ve had the same passwords for a while, then it’s a good idea to change them.  A fresh change will help keep you safe, because cyber criminals have a habit of stealing your digital underwear and then selling it online for other people to exploit."
        },
        {
            "text": "You may also want to consider a password manager. These applications generate and store all your passwords for you in a secure and encrypted manner.  It can then automatically input them for you when they need to be used."
        },
        {
            "text": "Not only does this reduce the risk of people stealing your passwords, it also stops you having to remember thirty plus passwords, and then giving up and having to just click “reset password” because you can’t remember."
        },
        {
            "heading": 3,
            "text": "Step 2: Put on that two-factor!"
        },
        {
            "text": "Skincare experts will tell you never to be without your factor 15, because SPF helps protect your skin from premature ageing even in the grim grey days of a British January.  We’re not even going that far, and only asking you to make sure you have your two-factor on."
        },
        {
            "text": "Two-factor authentication (often abbreviated to 2FA) is offered by most email providers and major websites.  It’s an additional layer of protection that ensures that even if someone was to steal your passwords, then they won’t necessarily be able to access your accounts."
        },
        {
            "text": "There are a number of different 2FA options, including receiving a pin or a code via text message, or through to a separate email address. It may seem like an extra inconvenience, but like the person that forgot their sunscreen – you’ll regret it once you get burned."
        },
        {
            "heading": 3,
            "text": "Step 3: Keep up!"
        },
        {
            "text": "Fergie from the Black-Eyed Peas might still be so three thousand and eight, but that doesn’t mean you have to be two thousand and late. In fact, it’s very easy to ensure you’re up to date. Checking that essential programs, such as your operating system, your antivirus, and your internet browser are up to date is a quick and easy way of making sure that you aren’t exposing yourself to online threats unnecessarily."
        },
        {
            "text": "It’s not just your PC either, make sure any of your smart devices, such as phones, watches, fitbits, etc, are running the latest software. You should also make sure you’ve updated any apps you regularly use which hold personal data, such as social media platforms."
        },
        {
            "heading": 4,
            "text": "If you follow these simple tips then you can carry on in 2022 as a new digital you. Whilst the advice we’ve offered here is very simple, it’s important that all of us make sure that we’re staying safe online.  If we all play our part then we make the whole cyber ecosystem stronger and safer."
        }
    ]
}