{
    "url": "https://deframedia.blog.gov.uk/2022/01/19/windrush-against-sewage-pollution-report-on-illegal-sewage-spills/",
    "title": "Windrush Against Sewage Pollution report on illegal sewage spills",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-19T12:53:10+00:00",
    "content": [
        {
            "text": "There has been coverage today in The Times and BBC News regarding a report by the campaign group Windrush Against Sewage Pollution on illegal sewage spills."
        },
        {
            "text": "The report suggests that several water companies - Southern Water, South West Water, Thames Water, Welsh Water, Wessex Water, Yorkshire Water and United Utilities - have illegally spilt sewage from treatment works into rivers thousands of times between 2017 and 2021."
        },
        {
            "text": "It is the clear legal responsibility of water companies to report any spills – both permitted and unpermitted – to the Environment Agency. If there is evidence that this is not happening the EA will pursue the water companies concerned and take appropriate action. In November it launched a major investigation into possible unauthorised spills at more than 2,000 sewage treatment works. This is in addition to 1,300 storm overflows and storm tanks that have been identified as spilling frequently and prioritised for further scrutiny."
        },
        {
            "text": "Water companies were handed record fines last year, making clear that polluters will be made to pay for damage to the environment. In 2021 the EA concluded seven prosecutions against water companies with fines of £90 million, 2 of £4 million, £2.3 million, £1.5 million, £150,000 and £540,000. More prosecutions are progressing in court."
        },
        {
            "text": "The EA is also playing a central role in driving better monitoring and transparency, placing new requirements on water companies so that everyone can see what is happening."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "Follow the Environment Agency on Twitter, and sign up for email alerts."
        }
    ]
}