{
    "url": "https://kingsawards.blog.gov.uk/2024/06/07/alchemy-technology-services-receive-the-kings-award-for-international-trade/",
    "title": "Alchemy Technology Services Receive The King's Award for International Trade",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Recipients"
    ],
    "pub_date": "2024-06-07T16:55:29+01:00",
    "content": [
        {
            "text": "Alchemy Technology Services is a global centre of excellence specialising in insurance software implementation and professional services."
        },
        {
            "text": "Founded as start up in September 2018 in Derry/Londonderry, Alchemy has grown from a staff of zero to over 200 based in Northern Ireland, London, USA and across Europe. Embracing Derry/Londonderry as our headquarters, we have contributed to the region's socio-economic growth by providing fulfilling and lasting careers for people in the North-West City Region and beyond."
        },
        {
            "text": "Alchemy was awarded the Guidewire Partner Excellence Award (Select) for Outstanding Market Growth in the Americas FY23."
        },
        {
            "text": "\"Receiving the King's Award for International Trade is an incredible honour for our entire team. It's a testament to the dedication, innovation, and hard work of everyone at Alchemy. This award recognises our commitment to excellence in international trade and reinforces our position as a leader in the industry. We are incredibly grateful for this prestigious recognition and look forward to continuing to build on our success.\" – John Harkin, CEO and Founder, Alchemy Technology Services"
        },
        {
            "heading": 2,
            "text": "Why did you apply?"
        },
        {
            "text": "Receiving a King's Award would bring international recognition to Alchemy, showcasing our expertise in global software implementation and acknowledgment as a leader in our industry."
        },
        {
            "text": "It demonstrates our commitment to excellence in customer service, project management, and successful software implementation. It shows our continued commitment to quality and successful projects for our customers."
        },
        {
            "text": "This award is a fantastic recognition of our people’s professionalism, hard work and dedication to Alchemy and the industry that we serve."
        },
        {
            "heading": 2,
            "text": "Why you chose that category "
        },
        {
            "text": "Alchemy has experienced significant growth across Europe and North America since we were founded in September 2018. This award and recognition will help us in our plans for further expansion in international markets. The International Trade category is the perfect fit to showcase our success on the global stage."
        },
        {
            "heading": 2,
            "text": "How you found the application process "
        },
        {
            "text": "The application process was a good opportunity for us to reflect on our achievements and successes over the past 5.5 years. The application was also a chance for us to quantify our impact, from sales to ESG."
        },
        {
            "heading": 2,
            "text": "How you feel about receiving the Award"
        },
        {
            "text": "We are immensely proud to receive a King’s Award. It is a true reflection of the hard work and dedication our people show and exemplify in their daily work. We hope that this award will help us drive our expansion overseas and also attract new customers in the UK market."
        },
        {
            "heading": 2,
            "text": "Top tips for potential applicants "
        },
        {
            "text": "LinkedIn: Alchemy Technology Services "
        },
        {
            "text": "Instagram: @alchemytechnologyservices"
        },
        {
            "text": "Facebook: Alchemy Technology Services"
        },
        {
            "text": "X: @alchemytechs"
        }
    ]
}