{
    "url": "https://kingsawards.blog.gov.uk/2024/06/07/vyta-northern-ireland-business-receive-kings-award-for-enterprise-for-sustainable-development/",
    "title": "Vyta - Northern Ireland Business Receive King’s Award for Enterprise for Sustainable Development",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Recipients"
    ],
    "pub_date": "2024-06-07T15:55:38+01:00",
    "content": [
        {
            "text": "Established in 2001, Vyta is a global leader in IT Asset Disposition and Lifecycle Management (ITAD and ITALM), offering comprehensive, sustainable, compliant and totally secure solutions covering the entire IT lifecycle in over 50 countries around the world."
        },
        {
            "text": "In 2023, Vyta collected, recycled and processed 450,000 devices as part of its IT Asset Disposition service. Devices included laptops, PCs, servers, USB sticks, hard drives, smartphones, and tablets. By refurbishing these devices for reuse, Vyta prevented nearly 40,000 tonnes of CO2 emissions, representing the weight of 7,000 male African elephants and carbon dioxide absorption equivalent of 678,000 mature trees."
        },
        {
            "text": "Vyta is committed to supporting the wider community and circular economy through various charity and social enterprise partnerships. In 2022, Vyta facilitated the reuse of 2,167 computers, transforming learning opportunities for over 30,000 disadvantaged students, equating to a reduction of 6000 tonnes of CO2 emissions, equivalent to planting 1,520 trees."
        },
        {
            "heading": 3,
            "text": "Watch their video on our YouTube page here."
        },
        {
            "heading": 2,
            "text": "Why you applied for the Award"
        },
        {
            "text": "The King’s Award for Enterprise is the highest honour a UK business can receive."
        },
        {
            "text": "Each year, only a small number of Northern Ireland companies succeed in achieving the prestigious Award."
        },
        {
            "text": "Vyta’s people are very much at the core of our operations and we are deeply committed to fostering a positive culture and purpose for our people."
        },
        {
            "text": "We recognised the significance of entering the Award as an opportunity to engage and reward our people. Winning a King’s Award has been an enormous boost to our entire team as it is a testament to what, for many, is a lifetime’s work in the sector."
        },
        {
            "text": "The rigorous assessment process, allowing us to benchmark ourselves against the highest standards in our industry, was also a motivating factor in Vyta’s decision to enter the Awards."
        },
        {
            "text": "As a company operating within a heavily regulated industry, compliance is crucial. As one of the most highly accredited IT Asset Disposition companies in the UK and Ireland, we recognised that the addition of a King’s Award would significantly add to our credibility on a national and international level."
        },
        {
            "heading": 2,
            "text": "Why you chose that category "
        },
        {
            "text": "The King’s Award for Enterprise in Sustainable Development is the ultimate validation of a company’s commitment to sustainability in the UK."
        },
        {
            "text": "For Vyta, sustainability has been in our DNA since the company formed in 2001.  The company’s entire business model is focused on helping organisations to manage their IT responsibly and to reduce their environmental impact."
        },
        {
            "text": "We realised that entering the King’s Awards would place us in some very esteemed company and that, if successful, the accolade would recognise and endorse our commitment to sustainable business practices, enhancing our credibility and trust with stakeholders globally."
        },
        {
            "heading": 2,
            "text": "How you found the application process "
        },
        {
            "text": "While the application process for the King’s Award involved an unparalleled level of detail and was definitely one of the most challenging to date, it was also one of the most rewarding we have ever undertaken."
        },
        {
            "text": "The application process was a collaborative effort involving input from all areas of the business and created a sense of shared purpose within the company. Vyta also recognises the assistance received from Antrim and Newtownabbey Borough Council, which gave invaluable support prior to and during the application process."
        },
        {
            "text": "Overall, the application process was a comprehensive and enlightening experience, allowing us to showcase our dedication to excellence and sustainability, and to reaffirm our commitment to our core values."
        },
        {
            "heading": 2,
            "text": "How you feel about receiving the Award."
        },
        {
            "text": "It is a huge honour to have received the King’s Award for Enterprise as one of only two Northern Ireland businesses to achieve recognition for excellence in sustainable development – and one of 29 companies UK-wide."
        },
        {
            "text": "The Award recognises both our commitment to minimising our own environmental footprint and that of our customers and partners, as well as our dedication to fostering initiatives within the wider communities in which we operate."
        },
        {
            "text": "Winning the Award has enhanced Vyta’s standing and reputation with all key stakeholders including our partners and clients, regulatory bodies and industry groups."
        },
        {
            "heading": 2,
            "text": "How did you hear about the Awards?"
        },
        {
            "text": "We participated in a workshop organised by the Council in 2023, during which we received valuable insight into the award process from past recipients of the King’s Award and from the King’s Award Office."
        },
        {
            "text": "Find out more: https://vyta.com/"
        },
        {
            "text": "Apply for the next round of King's Awards here: https://www.gov.uk/kings-awards-for-enterprise/how-to-apply"
        }
    ]
}