{
    "url": "https://dvladigital.blog.gov.uk/2022/10/11/celebrating-ada-lovelace-day-2022-in-conversation-with-karen-and-claire/",
    "title": "Celebrating Ada Lovelace Day 2022 – in conversation with Karen and Claire",
    "authors": [
        "Karen Clark",
        "Claire Barry"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2022-10-11T12:29:40+01:00",
    "content": [
        {
            "text": "Today is Ada Lovelace Day - an annual international celebration of the achievements of women in STEM. To mark the day, we caught up with Karen Clark, Agile Delivery Manager, and Claire Barry, Technical Product Manager, to tell us about their experience of working in a digital profession."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Can you tell us a bit about yourself and your current role?"
        },
        {
            "text": "Karen: I’m an Agile Delivery Manager, which involves actively building and promoting an Agile environment and approach to work, while ensuring my team has everything they need to succeed. Helping my team is what I enjoy the most – my job includes removing obstacles or ‘blockers’ to progress, helping the team to self-organise and creating a culture of learning and transparency."
        },
        {
            "text": "Claire: I’m the Technical Product Manager for the Emerging Technology Lab. My role is responsible for the product strategy and involves working with our development squads to solve problems and implement changes. It has provided me the opportunity to collaborate with highly skilled, passionate, and creative people from across the organisation - I really enjoy working with them! We all work together to provide best in class digital services that meet the needs of our customers."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Have you always worked within the digital profession? What skills do you need to get started? "
        },
        {
            "text": "Karen: Not always; before moving into digital, I worked in a Capability & Talent role which ensured colleagues within the Digital, Data and Technology Profession (DDaT) had access to training and development opportunities."
        },
        {
            "text": "There are many opportunities to move to different roles and you don’t always need a technology-related degree! I have a degree in business and a postgraduate degree in law and I was able to transfer a lot of skills gained throughout my career over to my current role. For example, part of a lawyer’s role is case management, which follows similar steps to that of managing a project - the only difference is the subject. I have found that the sector values people from diverse backgrounds, with transferable skills, and a motivation to work in technology."
        },
        {
            "text": "In terms of training, there are endless opportunities to learn and develop at DVLA, so don’t hesitate to apply for a digital role! I have been able to continue my Agile development path, completing my professional scrum master and coaching qualifications. I have also expanded my technical knowledge using on demand learning provided by DVLA."
        },
        {
            "text": "Claire: I’ve been in Product Management and Product Owner roles for 5 years. Prior to this, I worked in a variety of customer service and operational roles. I’ve worked in retail as a sales assistant, call centres and on to senior leadership positions. One thing that has remained consistent across all these roles is my passion for customer service and solving complex problems. Technology is a great enabler to provide solutions for these problems. There are so many transferrable skills that you gain across so many different aspects of your life."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "You both recently spoke at the STEM Women UK Technology Careers event - can you tell us a bit more and how did you end up on the panel?"
        },
        {
            "text": "Claire: The UK Technology Careers Event was aimed at female and non-binary students who are hoping to start a career in technology. It was a great opportunity for us to talk to students and provide them with information about the types of roles DVLA offers. It also gave the students a chance to connect with us and other potential employers."
        },
        {
            "text": "Karen: Claire and I were delighted to be chosen to represent DVLA on the panel, sharing an insight into the work we do and our shared experiences of working in the digital sector. It was also fascinating to hear other women’s inspiring stories of how they overcame challenges to pursue their digital careers."
        },
        {
            "heading": 2,
            "text": "Why do you think it’s important to inspire other women to consider a career in digital?"
        },
        {
            "text": "Claire: The opportunities in digital are so wide and vast - not every role requires coding, although there are lots of opportunities if that’s your passion. There are many transferrable skills such as problem solving, communication, facilitation, planning and prioritisation that will set you up for success. So don’t be afraid to try something different!"
        },
        {
            "text": "As technology takes forefront in our lives, it’s important that women are engaged and afforded the opportunity to shape decisions, while ensuring that the advancements made are representative of a diverse range of users."
        },
        {
            "text": "Karen: It’s crucial that we encourage women to apply for digital careers, but it’s equally important that we make these careers accessible to all. My role provides me with a great work-life balance and flexibility. I’m proud to be part of an organisation where representation matters."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Pursue a digital career"
        },
        {
            "text": "Lastly, we are both members of DVLA’s Digital Voices advocacy group, which believes strongly in opportunities for all and champions digital diversity at DVLA. We support colleagues who want to build their confidence, knowledge, and skills as well as those seeking a new career path."
        },
        {
            "text": "If a digital career sounds interesting to you, why not join us at DVLA? Keep an eye out on Civil Service Jobs for all the latest career opportunities. You can also visit our Reed.com site or learn more about digital careers at DVLA."
        }
    ]
}