{
    "url": "https://openpolicy.blog.gov.uk/2022/10/11/cutting-through-complexity-using-collective-intelligence/",
    "title": "Cutting through complexity using collective intelligence",
    "authors": [
        "prateekbuch"
    ],
    "categories": [
        "Collective Intelligence",
        "Policy Lab"
    ],
    "pub_date": "2022-10-11T08:53:36+01:00",
    "content": [
        {
            "text": "This post sets out Collective Intelligence Lab’s reflections on our experiments to date and how this approach could be applied to complex policy areas such as climate change."
        },
        {
            "heading": 2,
            "text": "What is collective intelligence?"
        },
        {
            "text": "At Policy Lab, we strive to radically improve policymaking by experimenting with innovative, people-centred methods. These approaches are well suited to complex, persistent and systemic challenges like those faced by policymakers working on aspects of climate change - as we set out in recent posts about art in policy, systems mapping and co-design."
        },
        {
            "text": "In November 2021 we established a Collective Intelligence Lab (CILab), with the aim of improving policy outcomes by tapping into collective intelligence (CI). We define CI as the diversity of thought and experience that is distributed across groups of people, from public servants and domain experts to members of the public. We have been experimenting with a digital tool, Pol.is, to capture diverse perspectives and new ideas on key government priority areas. To date we have run eight debates on issues as diverse as Civil Service modernisation, fisheries management and national security. Across these debates over 2400 civil servants, subject matter experts and members of the public have participated. We will be blogging about some of these areas in coming months. This post sets out our approach to CI so far, and describes three ways in which we think it helps to develop policy in complex settings."
        },
        {
            "heading": 2,
            "text": "Our approach to collective intelligence at CI Lab"
        },
        {
            "text": "Pol.is is an open source online platform that invites participants to enrich a debate by adding their viewpoints to a small number of initial seed statements, by submitting their own statements and voting on each others’ perspectives (see image below). Participants can therefore frame the discussion more in their own terms than they can in many other modes of engagement."
        },
        {
            "text": "The software then uses machine learning to group participants according to how they vote on all statements in the debate."
        },
        {
            "text": "Building on our initial experiments in partnership with Demos, we have adapted our approach to using Pol.is in three ways by:"
        },
        {
            "heading": 2,
            "text": "Collective intelligence for addressing complexity"
        },
        {
            "text": "From our experience using CILab on live policy issues, we have identified a series of policy use cases that echo findings from the government of Taiwan and organisations such as Nesta. These use cases include: 1) stress-testing existing policies and current thinking, 2) drawing out consensus and divergence on complex, contentious issues, and 3) identifying novel policy ideas. "
        },
        {
            "text": "1) Stress-testing existing policy and current thinking"
        },
        {
            "text": "CI could be used to gauge expert and public sentiment towards existing policy ideas by asking participants to discuss existing policies and current thinking on Pol.is. This is well suited to testing public and expert opinions on current policy proposals, especially where their success depends on securing buy-in and action from stakeholders. It can also help collate views and identify barriers to effective implementation of existing policy."
        },
        {
            "text": "From the initial set of eight CILab policy debates, we have learnt that it is sometimes useful to design a ‘crossover point' into the process. This is where part way through a debate, statements submitted by policymakers, subject matter experts and members of the public can be shown to each other, in a bid to break down groupthink across those groups. We used this approach in a Pol.is debate on a topic relating to UK foreign policy, and think it could help test how existing policies on complex areas such as climate change or social care are perceived within and outside government."
        },
        {
            "text": "2) Drawing out consensus and divergence on complex, contentious issues"
        },
        {
            "text": "Policy is often difficult to design when different groups of people - say across regions, sectors, or demographic characteristics - appear to disagree on the nature of a challenge, and/or on ways to address it."
        },
        {
            "text": "Because tools such as Pol.is are well-suited to showing where groups of people agree, CI could be used to test where different policy options lie within the Overton Window - defined as the range of interventions that mainstream opinion considers politically acceptable. This could enable policymakers to:"
        },
        {
            "text": "3) Identifying novel policy ideas"
        },
        {
            "text": "In the face of emergent and complex challenges such as climate change, no individual or group can claim a monopoly on ideas for effective policy. By harnessing the ideas of a diverse group of people beyond those who traditionally contribute to policymaking, a CI exercise could help reveal new ideas to be tested. CI has already identified novel climate change solutions. For example, a teenage participant in the Climate CoLab, another CI initiative, won funding to scale up an innovative rainwater-powered sun-tracking solar panel through outreach in the developing world. "
        },
        {
            "text": "In our early experimentation in CILab, participants have proposed new policy ideas that had not previously emerged. Combined with traditional methods such as focus groups, and more innovative methods such as co-design, CILab debates can encourage participants to put forward new ideas for policy teams to develop into policies, services or other interventions."
        },
        {
            "heading": 2,
            "text": "Join in"
        },
        {
            "text": "If you think collective intelligence can help your team develop better policy in complex settings, please get in touch. We would love to work with teams across the public sector as we continue to learn how best to apply collective intelligence methods to policymaking."
        }
    ]
}