{
    "url": "https://lifeathmrc.blog.gov.uk/2022/10/11/get-to-know-the-hmrc-mindsets-team/",
    "title": "Get to know the HMRC Mindsets team",
    "authors": [
        "Kay Patel"
    ],
    "categories": [
        "Accessibility",
        "Digital services",
        "Digital workplace",
        "User research"
    ],
    "pub_date": "2022-10-11T14:46:30+00:00",
    "content": [
        {
            "text": "Back in May 2022 following the huge success of the Mindsets Global Accessibility Awareness Day session which was ran by us, the Mindsets team at HMRC, there has been a lot of interest from across government to share more detail on what we do, what mindsets are, and what we have learned from using mindsets across HMRC."
        },
        {
            "text": "We work in the Product and User Centred Design team which is part of the Chief Technology & Design Office. The vision of our area is to make tax easy for everyone. By using mindsets, we understand how people’s behaviours impact their needs and are able to develop specific opportunities to make tax easier for them."
        },
        {
            "heading": 2,
            "text": "Firstly, what are mindsets?"
        },
        {
            "text": "Mindsets look at the behavioural tensions of users which help us understand how they may approach certain tasks. By uncovering and understanding the linking of these tensions we can much better understand users. The methodology focuses on underlying psychology and personality traits, which are much more stable than traditional socio-demographic segmentations."
        },
        {
            "text": "To explain more about mindsets, we created a 5 minute video"
        },
        {
            "heading": 2,
            "text": "What problem were we trying to solve?"
        },
        {
            "text": "There were multiple teams looking at the same user group and creating multiple personas. This created a piled upon dynamic and it became quite confusing when trying to understand our users - their needs, pain points and opportunities."
        },
        {
            "heading": 2,
            "text": "What did we do?"
        },
        {
            "text": "We took an innovative approach in our design and research methodologies and experimented with new ways of looking at the problem space.  We wanted to ensure we were looking at the wider context of users and create an output that could be shared across HMRC. As such, we partnered with Fjord, Accenture who had success with a methodology called mindsets."
        },
        {
            "text": "In 2021, we conducted the first HMRC mindsets research and ideation project with Fjord, Accenture, which focused on understanding a user group outside the context of HMRC services. Since then, we have completed another two mindsets projects which have focused on different user groups."
        },
        {
            "heading": 2,
            "text": "What have we learned from using mindsets?"
        },
        {
            "heading": 3,
            "text": "As user researchers and service designers we were able to look at the wider context"
        },
        {
            "heading": 3,
            "text": "Using mindsets has helped us design for the future, whereas personas focus on the present"
        },
        {
            "heading": 3,
            "text": "We don’t have all the answers!"
        },
        {
            "heading": 3,
            "text": "It takes more time to fully analyse, and that’s ok"
        },
        {
            "heading": 2,
            "text": "Did we solve the problem?"
        },
        {
            "text": "Yes."
        },
        {
            "text": "As a Product and User Centred Design team, we used this robust research methodology to show how mindsets are distinct from each other and account for all the ways people can think about a topic."
        },
        {
            "text": "The working groups were key to the process in order to collaborate, break down the silos and create mindsets that can be used across HMRC."
        },
        {
            "heading": 2,
            "text": "So, what next?"
        },
        {
            "text": "With this still being fairly new to HMRC, we are continuously learning and trying to improve ways of working with new mindsets projects."
        },
        {
            "text": "We will update you on these learnings from these new mindsets projects. If you'd like to get in touch with us in the meantime, please contact the mindsets team - mindsets@hmrc.gov.uk."
        }
    ]
}