{
    "url": "https://disabilityunit.blog.gov.uk/2022/10/11/health-care-artificial-intelligence-and-climate-action-building-global-action-on-disability-inclusion-a-meeting-of-the-g7/",
    "title": "Health care, Artificial Intelligence and Climate Action:  Building global action on Disability Inclusion  a meeting of the G7",
    "authors": [
        "Disability Unit",
        "Stephanie Harvey"
    ],
    "categories": [
        "International",
        "Policy"
    ],
    "pub_date": "2022-10-11T17:17:26+01:00",
    "content": [
        {
            "text": "In the last few years, we have witnessed an increasing focus on disability issues at the international level. Working in the disability policy space for many years, and now heading up the UK’s Disability Unit International, Futures and Complex Issues team, I’ve had the privilege of seeing focus on disability inclusion between State Parties grow at the international level. "
        },
        {
            "text": "The latest evidence of this has come in the form of the G7 (Group of Seven) Inclusion Summit that took place in Berlin in September 2022, which I had the honour of attending. The German government - who currently hold the G7 presidency - chose to use their presidency as an opportunity to organise the first ever G7 Global Inclusion summit."
        },
        {
            "text": "Events like the annual Conference of State Parties to the UN Convention on the Rights of Persons with Disabilities have facilitated the sharing of knowledge and practices for some years now. However, increasing numbers of conferences are being organised by State Parties together with disabled people’s organisations. "
        },
        {
            "text": "In 2018, the UK government, International Disability Alliance (IDA) and Kenyian government set a precedent with the Global Disability Summit. This summit set the bar for action on international collaboration to drive forward disability inclusion, with a follow-up summit held in 2022  by the Norwegian and Ghanian governments, and a third due in 2025 hosted by Germany and Jordan."
        },
        {
            "text": "These events are supporting a growing appetite among global leaders to address disability issues in a way that we have not seen before. Keynote speeches at the opening evening reception - from German Disability Commissioner Jürgen Dusel and Canadian Minister for Employment, Workforce Development and Disability Inclusion Carla Qualtrough - were passionately made. Commissioner Dusel and Minister Qualtrough set a clear call to action: that we - as G7 representatives - work together to drive forward Disability Inclusion, both domestically and abroad. "
        },
        {
            "heading": 2,
            "text": "The Summit: getting into the issues"
        },
        {
            "text": "With expectations set high, the summit opened formally on Friday the 2nd September 2022 with further impassioned speeches from the IDA, Commissioner Dusel, and German Minister for Labour and Social Affairs Dr. Rolf Schmachtenberg. "
        },
        {
            "text": "The three areas of priority were:"
        },
        {
            "heading": 3,
            "text": "1. Improving health care "
        },
        {
            "text": "Keynote speakers from Germany and Australia explored lessons for those providing health care for disabled people, learning from their governments responses to COVID-19. Dr. Leander Palleit, Head of the German CRPD independent monitoring mechanism (similar to the UK’s Equalities and Human Rights Commission, highlighted that the pandemic had really demonstrated how different rights can come into conflict in times of crisis. For example, right to life versus right to assembly. His take home message - resonating with the drive towards mainstreaming disability inclusion - was the importance of building inclusive structures in ‘normal’ times if we are to have hope of inclusive practices in times of crisis. "
        },
        {
            "heading": 3,
            "text": "2. AI and digitalisation"
        },
        {
            "text": "Taking us forward to issues of increasing importance in the years to come, session two explored disability inclusion in the context of AI and digitalisation. This is an area of great interest for the UK as we progress work both domestically and on the global stage in this area, for example through our funding and support of the Global Disability Innovation hub. "
        },
        {
            "text": "Professor Aimee van Wynsberghe provided a fascinating overview of the latest thinking in Ethics around AI. Highlighting the current gap in consideration of disability, she illustrated clearly the tangible issues that are likely to arise for disabled people if disability inclusion is not integrated into thinking. For example, she spoke of machine learning for automated cars not knowing how to interpret coming across people in wheelchairs. Because the AI did not know how to interpret wheelchairs or the people sitting in them, the system in one simulation initially chose to keep driving rather than stopping! "
        },
        {
            "text": "She certainly left delegates with a challenge to think about how we can support the mainstreaming of disability inclusive and sustainable approaches to AI and digitalisation. "
        },
        {
            "heading": 3,
            "text": "3. Climate Action and adaptation"
        },
        {
            "text": "This discussion led on well to the final topic of the day; climate action and the importance of ensuring that disabled people are included in planning and wider policy considerations. This is an issue that features heavily in the UK government’s international Disability inclusion and rights strategy (2022)."
        },
        {
            "text": "Keynotes were given by Professor Schmidt of Bristol University and Professor Sébastien Jodoin of McGill University. Having provided an overview of the reasons why many disabled people might be at risk of disproportionately negative impacts resulting from climate change, both highlighted the need for policies addressing climate change to consider the impact on disabled people if we are to ensure disability inclusive societies in the future. For example, restrictions in cities for cars need to factor in accessibility issues disabled people who can’t use public transport. "
        },
        {
            "heading": 2,
            "text": "Coming to a close, and ensuring legacy"
        },
        {
            "text": "The summit ended with a discussion of the Chair’s summary, a document which all G7 delegates signed up to. This document sets out a joint commitment to driving forward action on Disability Inclusion on global - as well as domestic issues. "
        },
        {
            "text": "Making sure this commitment is followed through, the UK is actively following up with speakers and other delegates on a range of issues, sharing our learning and learning from others. The Disability Unit together with colleagues across government continue to work to ensure disability inclusion across departments to build a more inclusive society for all. "
        },
        {
            "text": "Photos provided by: Behindertenbeauftragter and Anna Spindelndreier, Germany representative. Disability Commissioner Germany and Anna Spindelndreier."
        }
    ]
}