{
    "url": "https://educationhub.blog.gov.uk/2022/10/how-were-helping-young-people-find-their-next-step-in-education-and-training/",
    "title": "How we’re helping young people find their next step in education and training",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Higher Education",
        "Vocational education"
    ],
    "pub_date": "2022-10-11T16:52:24+01:00",
    "content": [
        {
            "text": "Here’s how we’re helping young people find their next step in education and training and navigate the many options available to them."
        },
        {
            "heading": 3,
            "text": "Qualifications that combine work and study"
        },
        {
            "heading": 4,
            "text": "Apprenticeships"
        },
        {
            "text": "Apprenticeships are a brilliant option for people of all ages to launch their careers in a huge range of exciting industries or upskill at various levels."
        },
        {
            "text": "There are thousands of apprenticeship vacancies on offer, with more than 640 high-quality apprenticeships approved for use by employers – meaning someone could pursue a career in anything from space engineering to advertising."
        },
        {
            "text": "We have also launched Career Starter Apprenticeships which are a great opportunity for those with limited work experience."
        },
        {
            "text": "With an apprenticeship, students can earn while they learn, while receiving high quality training."
        },
        {
            "text": "For those who are considering an apprenticeship, check out Five reasons why you should consider an apprenticeship - The Education Hub (blog.gov.uk)."
        },
        {
            "heading": 4,
            "text": "T Levels"
        },
        {
            "text": "Our ground-breaking new qualifications, T Levels, which are broadly equivalent in size to three A Levels, are proving very popular."
        },
        {
            "text": "T levels focus on technical and vocational skills. They combine study in a learning environment with a substantial industry placement so that students gain the skills and experience they need to progress into work, an apprenticeship or higher study."
        },
        {
            "text": "Students spend 80% of their time in the classroom (either in school with a sixth form or college) and 20% on a minimum 45 day placement with an employer."
        },
        {
            "text": "There are 16 subjects available now in England, including digital, science, construction, accounting, and health."
        },
        {
            "text": "More subjects are coming in September 2023 and others will be introduced over the next few years."
        },
        {
            "text": "To explore more on your choices when you reach 16/17 check out the Get the Jump pages on the National Careers Service website: Get the Jump: explore your education and training choices | National Careers Service."
        },
        {
            "heading": 4,
            "text": "Vocational technical qualifications (VTQs)"
        },
        {
            "text": "VTQs are practical qualifications for over 16s. They're designed to help students get the skills they need to start their career or go on to higher levels of education."
        },
        {
            "text": "VTQs focus on a specific job or a broad employment area, such as childcare, engineering or IT."
        },
        {
            "text": "They’re usually taken at a school or college. They might be an appropriate avenue for someone if they have a strong interest in working in a particular industry."
        },
        {
            "text": "Visit Vocational technical qualifications (VTQs) | National Careers Service for more information."
        },
        {
            "heading": 3,
            "text": "Higher Education"
        },
        {
            "text": "Higher education is the name for qualifications and courses you can take after 18. It includes diplomas, foundation years, bachelor degrees and more. Some options combine work and study, some are solely study based."
        },
        {
            "text": "Some students may go to university or into another type of higher education earlier than 18 years old."
        },
        {
            "text": "Students can often study flexibly at their own pace by learning online or part-time. Courses are usually taught in universities, colleges or specialist institutions like art schools."
        },
        {
            "heading": 3,
            "text": "Qualifications based on study alone"
        },
        {
            "heading": 4,
            "text": "Higher technical qualifications (HTQs)"
        },
        {
            "text": "HTQs are technical qualifications that are approved by employers. There are many different types and are usually taught in the classroom at colleges, universities or independent training providers."
        },
        {
            "text": "HTQs are an alternative to apprenticeships or degrees. They may suit someone if they want a more practical, employer-led study programme."
        },
        {
            "text": "Information on HTQs is available here: Higher technical qualifications (HTQs) | National Careers Service."
        },
        {
            "heading": 4,
            "text": "A levels"
        },
        {
            "text": "A levels are subject-based qualifications usually assessed by exams. They can lead to further study, training or work. You usually study A levels over 2 years. Most students choose 3 subjects to study but you can take more or fewer."
        },
        {
            "text": "You can even study for a BTEC or other qualification at the same time."
        },
        {
            "heading": 3,
            "text": "For people who want to go straight into work"
        },
        {
            "heading": 4,
            "text": "Supported internships with an education, health and care plan"
        },
        {
            "text": "These are unpaid work-based study programme that usually lasts for one year. It includes an extended work placement that lasts for at least 6 months."
        },
        {
            "text": "Students can take the first step from education into the workplace while gaining the skills they need to get a paid job."
        },
        {
            "heading": 4,
            "text": "School leavers scheme"
        },
        {
            "text": "Some companies offer school leaver schemes to young people who have completed A levels."
        },
        {
            "text": "The schemes allow young people to learn and train with a large company while earning a wage."
        },
        {
            "text": "School leaver schemes are usually like graduate schemes, except they’re aimed at school leavers."
        },
        {
            "text": "These can be applied for while students are still in school. Employers create their own schemes so students need to check each company’s website to see if a school leaver scheme is available and to apply."
        },
        {
            "heading": 3,
            "text": "Still unsure? Help is available"
        },
        {
            "text": "Whatever someone’s choice, and for those still unsure, help is available."
        },
        {
            "text": "Visit www.gov.uk/get-the-jump to find out more and chat to an expert."
        }
    ]
}