{
    "url": "https://hmlandregistry.blog.gov.uk/2022/10/11/how-can-i-get-my-urgent-application-to-hm-land-registry-fast-tracked/",
    "title": "How can I get my urgent application to HM Land Registry fast-tracked?",
    "authors": [
        "Katie Dawson"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2022-10-11T12:42:23+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Anyone browsing the property pages of a news website in the last year will have seen countless articles about how busy the UK housing market has been and continues to be. We have seen a big increase in demand for our services as a result."
        },
        {
            "text": "It is not unusual for your name not to appear in the Land Register for some time after you have moved into your new home. You don’t need to worry about this, as your property ownership remains securely held as soon as we receive your application, even while the register is being updated, as we cover in more detail here."
        },
        {
            "text": "We recognise that, in certain circumstances, you may need your application to be completed urgently. In this blog, we’ll look at how to request our expedite service if you have an application that is urgent and where you can go for information on how long we are taking to process applications."
        },
        {
            "heading": 2,
            "text": "What is HM Land Registry’s fast-track process?"
        },
        {
            "text": "If you need an application to be completed urgently, let us know as soon as possible so that we can help you. You can tell us by applying to have your application fast-tracked. This is called our expedite service and it is free. It is available for applications where a delay would either put a property sale or any kind of property transaction at risk or cause problems not related to a land transaction."
        },
        {
            "text": "We are currently processing around 1,000 fast-tracked applications every day and complete 95% of them within 10 working days."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Does my application qualify to be fast-tracked?"
        },
        {
            "text": "If you believe you may qualify for an expedite, please put in a request as soon as possible, stating why your application is urgent – for example, your mortgage offer is set to expire – rather than waiting until those problems arise."
        },
        {
            "text": "Although it is extremely rare that any delays to our services would affect a property sale, sometimes an application must be completed before a transaction can proceed or to prevent some other negative impact."
        },
        {
            "heading": 2,
            "text": "How long are applications taking?"
        },
        {
            "text": "Throughout this busy period for the housing market, our priority has been to deliver the essential services that enable property transactions to continue uninterrupted. These are mainly searches of the register before a property is bought or sold. Our searches of the title register and title plan will prove the seller is actually the legal owner of the property they are selling and will give other important details, such as any debts registered against the property or any rights of way over the property. We get around 100,000 search requests every day and deliver nearly all of them within seconds."
        },
        {
            "text": "As well as requests for searches before a transaction, we have also seen a big increase in the number of applications we receive after a property or piece of land has changed hands, such as applications to update the register to add a new owner’s name or details about their mortgage."
        },
        {
            "text": "The time taken to complete an application should not affect a property sale because it usually takes place after a transaction. The applicant’s legal interest in the property is protected the moment we receive the application, not when it is completed."
        },
        {
            "text": "We can’t tell you how long your individual application will take, as different applications vary greatly. However, we can give an estimate based on recent processing times. We publish the latest information on our processing times online. This page is updated monthly so it is the best place to go for information on how long we take to process applications."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Improving the speed of our services is our top priority"
        },
        {
            "text": "HM Land Registry’s programme to improve efficiency has meant that we are completing more applications per month than we did three years ago. However, because of the increased demand in the housing market, some applications are currently taking longer than they usually would."
        },
        {
            "text": "In August, we published our new Strategy and Business Plan, a roadmap for how we will improve our services over the next few years. This includes our plan to automate up to 70% of simpler applications to update the register so that they are completed in seconds. This will allow us to refocus our expert staff onto bringing down wait times on complicated applications. You can learn more about our clear and ambitious plans here."
        }
    ]
}