{
    "url": "https://marinedevelopments.blog.gov.uk/2022/10/11/mmo-marine-licensing-update/",
    "title": "MMO Marine Licensing update",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Coastal",
        "marine licensing"
    ],
    "pub_date": "2022-10-11T16:45:17+01:00",
    "content": [
        {
            "text": "Through marine licensing, the MMO plays a key role in providing advice and making decisions on what happens in England’s seas. There are many things to consider when handling marine licence applications, from protecting the marine environment to helping the UK achieve renewable energy targets to enabling sustainable economic growth."
        },
        {
            "text": "The work of the MMO Marine Licensing team is vast and varied. We aim to provide applicants with a positive and supportive experience with a focus on joint working and collaboration across government. Here are some examples of the cases we have determined recently."
        },
        {
            "text": " "
        },
        {
            "text": "Cable removal to clean up seabed is UK first"
        },
        {
            "text": "TAT-14 is a transatlantic telecommunications subsea cable which connects the USA and Europe. The system was formally retired in 2020 with all equipment being turned off shortly after. Segment G of the system comes in from USA and lands in Bude, Cornwall while Segment H comes in from France and lands at Mevagissey, Cornwall."
        },
        {
            "text": "As part of the retiring system, this application is for the UK based decommissioning activities for Segment G and H to remove the cable from the seabed. It is believed to be the first case of cable removal/decommissioning in UK Territorial Waters."
        },
        {
            "text": "British Telecom (BT) applied for a marine licence to remove and decommission two segments of the TAT-14 subsea cable, which were approximately 19 years old and had come to the end of their economic life."
        },
        {
            "text": "The MMO Marine Licensing team worked closely with the applicant, providing progress updates throughout. Issues raised during consultation were addressed by adding conditions to the licence, ensuring the activity would have no adverse impacts on the environment or sea users."
        },
        {
            "text": " "
        },
        {
            "text": "East Anglia offshore windfarms get go-ahead"
        },
        {
            "text": "On 31 March 2022 the Secretary of State from the Department for Business, Energy & Industrial Strategy gave consent to the development of the East Anglia ONE North Offshore Windfarm and East Anglia TWO Offshore Windfarm."
        },
        {
            "text": "Applicants Scottish Power Renewables applied to the Planning Inspectorate for a Development Consent Order (DCO), including a deemed marine licence to make a substantial contribution to the UK’s 2030 energy targets."
        },
        {
            "text": "Both sites are located off the Suffolk coast between Lowestoft and Southwold."
        },
        {
            "text": "East Anglia ONE North Offshore Windfarm was consented for an installed capacity of up to 800MW and East Anglia TWO Offshore Windfarm an installed capacity of up to 900MW."
        },
        {
            "text": "The Marine Management Organisation (MMO) provided detailed comments in relation to the deemed marine licence, as an interested party in the application. The MMO Marine Licensing team members engaged with the statutory consultation, working closely with Natural England and Defra."
        },
        {
            "text": "Following Examinations during which the public, Statutory Consultees and Interested Parties were given the opportunity to give evidence to the Examining Authority, recommendations were made to the Secretary of State on 06 October 2021."
        },
        {
            "text": "Now consented it becomes the responsibility of the MMO for enforcing, post-consent monitoring, varying, suspending, and revoking any deemed marine licences."
        },
        {
            "text": " "
        },
        {
            "text": "Masts removed from shipwreck to prevent potential explosions "
        },
        {
            "text": "The SS Richard Montgomery is a World War II wreck in the Medway Estuary containing approximately 1,400 tonnes of explosive munitions. The Department for Transport applied for a marine licence to reduce the masts of the wreck, and therefore their weight, to prevent them collapsing on the deck below."
        },
        {
            "text": "The American cargo ship ran aground in 1944 on a sandbank near the Medway Approach Channel. Attempts to salvage the cargo were abandoned when the vessel broke in two, meaning munitions are still stored in the wreck."
        },
        {
            "text": "The Marine Licensing team consulted experts on unexploded ordnance in the area to ensure the works could be safely. A Habitats Regulations Assessment and Marine Conservation Zone Assessment were also undertaken to confirm nearby sites would not be adversely affected."
        },
        {
            "text": "The works will greatly minimise the risk to public health as if the masts were to fall on the deck it could result in the munitions exploding."
        },
        {
            "text": " "
        },
        {
            "text": "Refurbishing and extending a pontoon"
        },
        {
            "text": "Scroby Sands, located just off the Norfolk coast, is one of the UK’s first commercial wind farms. RWE Renewables applied to the MMO for a marine licence for the construction of new works and maintenance of existing works. The applicant wished to refurbish the existing pontoon and extend to allow for two vessels to be able to dock."
        },
        {
            "text": "The existing pontoon is used by the Crew Transfer Vessels (CTVs) that transfer the maintenance technicians from the onshore base to the offshore wind farm. The works were to allow the continued, safe maintenance of the offshore wind farm and to reduce risks to staff who otherwise were required to climb down a ladder to the second vessel docked against the wall."
        },
        {
            "text": " "
        },
        {
            "text": "Southampton Sea Cadets- Slipway repairs, installation of additional pontoon berths"
        },
        {
            "text": "The MMO Marine Licensing team also consider applications for smaller projects at sea."
        },
        {
            "text": "A recent application from Southampton Sea Cadets proposed to undertake slipway repairs, extend pontoon berths out further and install additional plastic pontoon berths."
        },
        {
            "text": "Southampton Sea Cadets is a registered youth charity which provides young people with an opportunity to learn about ships, boats and the sea in a structured, disciplined environment."
        },
        {
            "text": "The proposed repairs and improvements will maintain and enhance the range of waterborne activities which the unit can offer."
        },
        {
            "text": " "
        },
        {
            "text": "1km sea wall off North Wirral coast"
        },
        {
            "text": "Wirral Council applied for a marine licence to protect more than one kilometre of coastline. The work, which will see 9,000 tonnes of rock added to existing defences, is nearing completion."
        },
        {
            "text": "The proposal for the work was put forward in 2020 due to concerns over erosion at the base of the Wallasey Embankment."
        },
        {
            "text": "When considering the application, the MMO Marine Licensing team conducted a Habitats Regulations Assessment as the works were to take place near designated areas of conservation. Work was carried out during the summer months to mitigate any impact on wildlife in the area including wintering bird species."
        },
        {
            "text": "The barrier will protect nearly 1,300 homes from flooding and coastal erosion."
        },
        {
            "text": "You can find out more about the MMO and Marine Licensing on GOV.UK."
        }
    ]
}