{
    "url": "https://insidehmcts.blog.gov.uk/2022/10/11/modernising-justice-systems-an-international-perspective/",
    "title": "Modernising justice systems: an international perspective",
    "authors": [
        "Amar Morjaria - Senior Project Manager, HMCTS Strategy and Change"
    ],
    "categories": [
        "Court and tribunal reform"
    ],
    "pub_date": "2022-10-11T10:50:36+01:00",
    "content": [
        {
            "text": "As we continue to focus on immediate operational priorities, it’s sometimes helpful to remind ourselves of the wider international context in which we operate. As an organisation, we’re not alone in our reform programme ambitions."
        },
        {
            "text": "Many countries around the world are also modernising their justice systems and processes. Most are being updated to reflect not only advances in technology but to better meet the evolving and diverse needs of the societies they serve."
        },
        {
            "text": "Our reform programme remains one of the most ambitious in the world. When we started in 2016, we committed to reforming the whole system, including all jurisdictions. During that time, we’ve collaborated with international jurisdictions to measure ourselves, share expertise and learn from others’ experiences."
        },
        {
            "heading": 2,
            "text": "Fact-finding in India"
        },
        {
            "text": "The Rule of Law and Multilateral Engagement Team in the Ministry of Justice (MoJ) runs a number of cooperation projects with priority countries to exchange expertise and share best practice on justice reform."
        },
        {
            "text": "The UK has a long-standing agreement with India which acknowledges our shared history, values and culture. It identifies opportunities for enhanced cooperation between politicians, judges, executive agencies and public bodies, to foster deeper mutual understanding and strengthen our democratic and institutional partnership (2030 Roadmap for India-UK Relations)."
        },
        {
            "text": "I joined a scoping visit to Delhi in May this year, representing HMCTS alongside Judicial Office and MoJ officials."
        },
        {
            "text": "The one-week trip aimed to strengthen relations and identify areas for potential cooperation on court reform. India is doing similar work to ours in its e-courts project. While our 2 programmes align at a strategic level, the differences in scale and breadth of challenge facing the Indian government is stark."
        },
        {
            "heading": 2,
            "text": "India’s priorities"
        },
        {
            "text": "A pressing issue is to tackle its large case backlog - 31 million criminal and 10 million civil cases pending. Of those cases, three quarters are over a year old, and 70% of the prison population is pre-trial."
        },
        {
            "text": "India started a sophisticated court digitisation programme in 2011. They have successfully introduced video hearings and encouraged dispute resolution via mediation, among other services. Although many aspects of the programme have been beneficial, not least during the pandemic, ongoing risks around connectivity and digital literacy are significant. In 2021, only 47% of the population had access to the internet."
        },
        {
            "text": "Unlike the UK system, Indian judges are entirely responsible for the management of the court and the budget, which can be a significant burden on their time. There’s no organisation with a remit similar to that of HMCTS. They have a high level of court judicial vacancies (21% across all courts and 38% at high courts in 2020) and the issue of judicial independence continues to present challenges."
        },
        {
            "heading": 2,
            "text": "What have we learned?"
        },
        {
            "text": "Shared intelligence at judicial and technical levels, as well as around changing culture and ways of workings, will be invaluable for HMCTS and counterparts in India."
        },
        {
            "text": "Where India leads in implementation of certain projects to widen access to justice, for example live-streaming from courts before us, their experiences can be helpful to us in the early stages of implementation."
        },
        {
            "text": "The public has access to a National Judicial Data Grid detailing real-time case data which is sometimes displayed on large screens outside court buildings. It’s used to encourage judicial colleagues, as well as for transparency. It demonstrates the robustness of India’s new systems to capture data accurately and enables easy data-sharing with other government departments."
        },
        {
            "text": "The government is considering sharing data directly with law firms and other related organisations. Although we’re unlikely to adopt the same public-display approach in the UK, there are undoubtedly successes in data capture and insights from which we can learn."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We’re working with MoJ’s International team to build momentum from this latest visit. We’re planning a return study visit to the UK for Indian judges, possible webinars and conferences on digitisation and court administration, as well as potential secondments."
        },
        {
            "text": "We’ve had further interest to collaborate more closely with a number of other countries, to share our reform programme expertise. International jurisdictions with modernising agendas see the UK justice system as inspirational, which is worth reminding ourselves of occasionally."
        },
        {
            "text": "Our Chief Executive recently recorded a podcast with DAKSH - a leading Indian leading law and justice system think tank - on the UK's experience in court administration, broadcast on 11 October. Feedback so far has been extremely positive. This podcast is hosted on a third-party website."
        },
        {
            "text": "I’d like to thank all those colleagues at HMCTS, MoJ and Judicial Office who planned the visit and all our counterparts in the Indian justice system who made it so successful."
        }
    ]
}