{
    "url": "https://civilservice.blog.gov.uk/2022/10/11/the-nhs-needs-you/",
    "title": "The NHS Needs You",
    "authors": [
        "Joe Smith"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-10-11T09:01:09+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Blood is something we all need. As co-leader of the Civil Service Blood Drive, Joe Smith is on a mission to persuade civil servants to take time out of their day to donate blood and help a stranger.  "
        },
        {
            "text": "The COVID-19 pandemic has affected our world in a myriad of different ways. We are more cautious than we were before, the nation now has lengthy backlogs in medical care and the judicial system, and supply chains have been stretched as demand has switched back on. Yet lockdown measures are still in place in some parts of the world."
        },
        {
            "text": "All this has made me think about what I can do to help others who are less fortunate than me. Not in financial terms, but in the pure sense of the word, those who suffer bad fortune, people who are simply struck with bad luck. And any one of us, no matter our circumstances, can be struck by bad luck at any time, as can our loved ones."
        },
        {
            "text": "That's why I give blood."
        },
        {
            "text": "Emerging from lockdown, we are all more aware of the risks we take in our daily lives, with our health, even with our journeys to work. All it takes is to be struck by poor fortune, as we all are from time to time, to put us in the unpleasant position of needing a blood transfusion."
        },
        {
            "text": "The fact is, blood stocks are incredibly low right now, yet millions of people every year depend on emergency blood transfusions for care in A&E, as well as those undergoing routine operations and regular treatment. According to NHS Blood and Transplant, around 135,000 new donors are needed every year in England to ensure demand can be met. It’s needed more than ever."
        },
        {
            "text": "If blood stocks fall further then routine operations will not be possible. However, your positive decision to become a blood donor does not depend on luck. By spending a small amount of time and energy (and incurring minor discomfort), you can help make sure blood stocks remain at reliable levels."
        },
        {
            "text": "If enough of us do this, then our families who are unfortunate enough to have an accident or to experience a deterioration in their health are saved by the safety net that blood donors provide. Then, the NHS will be able to care for its patients effectively and in good time."
        },
        {
            "text": "We need donors"
        },
        {
            "text": "Stocks of blood are at 4.5 days remaining as we speak, and thousands more donors are needed to make sure that number is not depleted further. O-negative, A-negative and B-negative donors are especially needed."
        },
        {
            "text": "I founded and lead the Civil Service Blood Drive, and I implore you, at this time more than ever, to find out your blood type, find out if you can donate, and do so if you possibly can."
        },
        {
            "text": "The donation process is painless, and is now more open that ever with the change of the law surrounding homosexual men in June 2021. "
        },
        {
            "heading": 4,
            "text": "Why do it?"
        },
        {
            "text": "Do it for yourself in case you ever need care, do it for your family in case they have an accident, do it for a stranger who is less fortunate than yourself."
        },
        {
            "text": "If you are able to join the blood drive team to encourage other people to donate, please do contact me on Joe.Smith2@cabinetoffice.gov.uk. I’ll be grateful for any additions to the team to help us with this important work."
        },
        {
            "text": "Thank you on behalf of anyone who has ever received a blood transfusion, and for those who may need one in future. For civil servants who selflessly donate blood, you can be assured, it really is the greatest gift you can give."
        }
    ]
}