{
    "url": "https://buyingforschools.blog.gov.uk/2022/10/11/ypos-buildings-in-use-framework-explained/",
    "title": "YPO's Buildings in Use framework explained",
    "authors": [
        "Megan Grimshaw, Procurement Projects Delivery Lead at YPO"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-10-11T11:48:29+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Are you looking at buying catering or cleaning services for your school?"
        },
        {
            "text": "For some, the start of a new academic year means planning well in advance for buying those important services such as catering and cleaning. You can use our Find a Framework tool to explore the DfE approved frameworks that offer catering and cleaning solutions."
        },
        {
            "text": "In this blog post, Megan Grimshaw, Procurement Projects Delivery Lead at YPO, highlights YPO’s Buildings in Use framework, which includes both catering and cleaning lots as well as much more. Megan will explain what the framework can offer, how it works, and how it can benefit schools. If you are looking for a catering service or want to outsource your cleaning, this could be the framework for you."
        },
        {
            "heading": 2,
            "text": "What is the Buildings in Use framework?"
        },
        {
            "text": "The Buildings in Use framework can provide key support services to your school such as catering and cleaning. This buying option has been set up as a DPS or ‘Dynamic Purchasing System’. A DPS is a procurement technique used by the public sector to purchase commonly used goods, works or services. A DPS differs from a framework because it’s open to new suppliers to join at any time, as long as they meet selection criteria. This means any new or local suppliers can apply to join at any time. It is open to and suitable for both national and regional suppliers."
        },
        {
            "heading": 3,
            "text": "What does the framework cover?"
        },
        {
            "text": "The Buildings in Use framework is flexible because it allows customers to choose the services they require for their building depending on their needs and requirements. The framework consists of 9 lots in total covering:"
        },
        {
            "text": "This covers the supply of staff, infrastructure, and/or equipment to serve food and"
        },
        {
            "text": "This covers the supply of staff, infrastructure, and/or equipment to carry out cleaning services in your educational setting"
        },
        {
            "text": "Covering the provision of staff and/or infrastructure for reception duties and security services in your building"
        },
        {
            "text": "This lot provides equipment and/or staff for CCTV monitoring, either on-site or remotely"
        },
        {
            "text": "This lot includes the facilities to provide car park management, which includes access control, cash collection, management of vehicles (including penalty issues and removal of vehicles)"
        },
        {
            "text": "Covering the provision of mobile patrols of premises, and key holding service for out-of-hours access, for staff and accompanying vehicles"
        },
        {
            "text": "Providing food hygiene inspection services, including reporting on findings and options for corrections of any issues identified"
        },
        {
            "text": "This covers the supply of staff and/or infrastructure for the management and removal of waste, ensuring legal disposal"
        },
        {
            "text": "This covers all of the above lots, managing the entire needs of your school"
        },
        {
            "heading": 3,
            "text": "How can it help schools?"
        },
        {
            "text": "Using a DfE approved framework will ensure that your buying is compliant, will save you time and provide value for money."
        },
        {
            "text": "In addition, if you choose to use YPO’s Buildings in Use framework, YPO will provide you with a range of benefits including:"
        },
        {
            "heading": 3,
            "text": "How can I start using the Buildings in Use framework?"
        },
        {
            "text": "Contact Get help buying for schools to access the Buildings in Use framework. Working closely with YPO and our other framework suppliers, the Get help buying for schools service will help you navigate the buying process, buy compliantly, save you time, and secure great value for your school."
        }
    ]
}