{
    "url": "https://ukhsa.blog.gov.uk/2022/05/11/a-voice-to-lead-international-nurses-day-2022/",
    "title": "A voice to lead: International Nurses Day 2022",
    "authors": [
        "Jamie Waterall"
    ],
    "categories": [
        "Nursing"
    ],
    "pub_date": "2022-05-11T22:10:33+01:00",
    "content": [
        {
            "text": "Each year, on 12 May, I take great pride in celebrating and showing my appreciation for nursing colleagues working across the health and care system on International Nurses Day.  This date marks the birth date of Florence Nightingale in 1820."
        },
        {
            "text": "Many of us immediately think of Nightingale holding a lamp.  In your mind’s eye, if you know a little more about her history, you may place her in Crimea, helping the injured British soldiers. Few people – or fewer than she deserves – know to credit her for the immensely important public health leadership role which she played.  She recognised that too many people were dying from poor sanitation and the lack of effective infection prevention control interventions."
        },
        {
            "text": "It was not until I started working in public health that I fully appreciated how Nightingale had used statistics to achieve major health reform. Having collected hospital mortality data for 2 years, while out in Crimea, Nightingale used a then pioneering way to present her findings. Using her rose diagrams, she was able to illustrate that most people were dying from poor sanitation and infection, which was considered largely preventable."
        },
        {
            "text": "I also think about the bravery and leadership of Mary Jane Seacole, a nurse whose work and impact were lost in time because of her colour.  Seacole, born 23 November 1805, showed immense courage in setting up the British Hotel and in visiting the front line to provide care to injured soldiers during the Crimean war."
        },
        {
            "text": "Her story has finally come to light and she rightly deserves to be remembered for her bravery, tenacity and inclusivity.  This is something which has never been more important to our nursing profession, as we recognise the huge inequalities which exist across our communities."
        },
        {
            "heading": 2,
            "text": "Celebrating nursing heritage"
        },
        {
            "text": "So, in 2022, we should celebrate both Seacole and Nightingale, who demonstrated that our nursing profession could be a voice to lead. They were courageous leaders, statisticians and public health pioneers who challenged the world to do things differently to save and improve lives."
        },
        {
            "text": "Our access to data has certainly improved since the 1800s and so has our understanding of the major causes of premature morbidity and mortality. We have also advanced our knowledge of the evidenced based interventions which can be used to reduce preventable death and ill health across the life course, from preconception to older age. However, there is still a tendency for our profession to focus on the management and treatment of disease and ill health, rather than us placing an equal focus on preventing, protecting and promoting the public’s health."
        },
        {
            "text": "As the world starts to recover from the COVID-19 pandemic, it will be important for the nursing profession to consider the lessons learnt and what needs to change to allow us to truly build back better and fairer."
        },
        {
            "text": "The pandemic has provided us all with an opportunity to see with greater clarity that all nurses play an important public health role, regardless of their speciality or setting. It is now essential that we build on this knowledge and consider the ways in which we can take a greater role in preventing illness, protecting health and promoting wellbeing. The nursing profession will also play an important role in addressing the widening health inequalities which has been made ever clearer by the COVID-19 pandemic."
        },
        {
            "text": "This International Nurses Day I will celebrate nursing colleagues from the past – a heritage we can be proud of.  I will also take pleasure in thanking all the colleagues in the present and future who are building on our strong track record as a profession and who are, collectively, a voice to lead."
        },
        {
            "text": "Nursing is an amazing occupation and I am proud to be part of the most trusted profession.  We nurses will play an important role in driving a decade of transformation and change in the 2020s, which will result in more people living longer and healthier lives, regardless of where you live and how your life started. Centre to this achievement is for all nurses to see themselves as public health professionals who, like Mary and Florence, can act with bravery and candour to improve health outcomes for everyone."
        },
        {
            "text": "Happy International Nurses Day!"
        },
        {
            "text": " "
        }
    ]
}