{
    "url": "https://defrafarming.blog.gov.uk/2022/05/11/adjusting-fertiliser-application-rates-to-reduce-costs/",
    "title": " Adjusting fertiliser application rates to reduce costs ",
    "authors": [
        "Leah Coyne"
    ],
    "categories": [
        "The Fertiliser Taskforce"
    ],
    "pub_date": "2022-05-11T13:54:51+01:00",
    "content": [
        {
            "text": "In this post, I'll provide an update on the work of the fertiliser roundtable, which recently held its first meeting. I’ll also share some analysis on the impact of varying fertiliser application rates to help reduce costs. "
        },
        {
            "heading": 2,
            "text": "The Fertiliser Taskforce "
        },
        {
            "text": "In March, we blogged about some of the ways through which we’re supporting farmers in the face of increased fertiliser costs."
        },
        {
            "text": "You might remember that one way was through the creation of a fertiliser roundtable. It's now known as the Fertiliser Taskforce. "
        },
        {
            "text": "Through the taskforce, government and industry will work together to improve market confidence and help provide farmers with the information needed to make business decisions on fertiliser use. "
        },
        {
            "text": "The first taskforce meeting was chaired by Minister Victoria Prentis. "
        },
        {
            "heading": 2,
            "text": "New analysis on fertiliser application strategies "
        },
        {
            "text": "One member of the taskforce  is the Agriculture and Horticulture Development Board (AHDB). "
        },
        {
            "text": "The AHDB shared its analysis of fertiliser buying and application strategies, which you might find helpful, so I'll share it in this post. "
        },
        {
            "text": "It explored 3 approaches:  "
        },
        {
            "text": "The right strategy will depend on the attitude to risk to yields, and where you feel fertiliser and grain prices will go over the next 18 months or so. "
        },
        {
            "text": "However, according to this scenario analysis, there is no significant difference between these expected common approaches. "
        },
        {
            "text": "So, whether fertiliser was purchased before the higher prices of late or not, some judicious reduction in application rates will pay off. "
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "AHDB has created a new page bringing together information on how farmers can approach current high input costs, especially those working in the livestock and cereal sectors. "
        },
        {
            "text": "The page brings together information on adjusting nitrogen application rates and alternative fertiliser management options. It also includes useful fertiliser calculation adjustment tools for grassland and cereals and oilseeds. "
        },
        {
            "text": "AHDB also hosted a series of webinars advising on how to apply fertiliser when costs are high: "
        },
        {
            "text": "The next Fertiliser Taskforce meeting will be chaired by Minister Jo Churchill. We’ll blog after the next meeting here on the blog, so do subscribe.  "
        },
        {
            "text": "If you missed it, we recently blogged about the changes we’ve made to Basic Payment Scheme payments to help farmers plan around increased costs. "
        }
    ]
}