{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/05/11/chief-social-worker-for-adults-annual-report-2021-22-strength-from-adversity/",
    "title": "Chief Social Worker for Adults Annual Report 2021-22: strength from adversity",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Co-production",
        "Guidance",
        "Knowledge and skills",
        "Mental health",
        "Safeguarding"
    ],
    "pub_date": "2022-05-11T15:37:41+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Coming out the other side"
        },
        {
            "text": "It is with a sense of relief, but also pride in our collective resilience as a profession, that we are able to publish the Chief Social Worker for Adults Annual Report 2021-22 in a world which has, at long last, regained some of the familiar trappings of normality."
        },
        {
            "text": "Now that we have a largely fully vaccinated population, COVID-19 is not the threat it once was. Society has opened up again and some of the safeguarding and access challenges faced by our profession have begun to drop away."
        },
        {
            "text": "Of course, sector pressure is still high. Social workers and social care and health colleagues continue to help individuals and families process the disruption, loss and trauma of the last two and half years. Now of course, they will be contending with the stresses of the cost of living crisis and the war in Ukraine, both of which exact a mental and physical toll, even on those not directly affected."
        },
        {
            "text": "So, it’s appropriate that we publish this report in the midst of Mental Health Awareness Week. Social work’s contribution to this area is needed now more than ever."
        },
        {
            "text": "On this very point, following publication of the Mental Health Act Reform consultation, we were delighted to appoint Jason Brandon on a two-year secondment into the role of Mental Health Social Work Lead. He is working hard with the MHA Reform team and stakeholders to strengthen the approved mental health professional (AMHP) workforce – an often unseen bastion of brilliance!"
        },
        {
            "text": "Although the vast majority are social workers, in the spirit of the reforming integration agenda, there is a growing cohort of AMHPs drawn from clinical disciplines. This is a great opportunity for social workers to share their years of experience and likewise for NHS colleagues to contribute to our practice."
        },
        {
            "heading": 2,
            "text": "Continuity in a crisis"
        },
        {
            "text": "Of course, this report, by its nature, looks back on the challenges and achievements of a difficult 12 months. In the darkest days of the pandemic, I am so glad the adult social work profession had the benefit of the collective wisdom of not one, but two Chief Social Workers, Fran Leddra and Mark Harvey."
        },
        {
            "text": "Whilst I took time away from the role to care for my mother in the last few months of her life, Fran and Mark picked up the baton and delivered some incredibly important work, whilst also demonstrating the compassionate leadership, insight and support our colleagues needed."
        },
        {
            "text": "They helped shepherd the ‘Revisiting Safeguarding’ guidance to publication and enabled practitioners and others involved in adult safeguarding to re-evaluate their practice and maximise responsiveness to those at risk of harm. A companion piece, Bridging the Gap, focused on our role in improving practice and support for young people moving into adulthood."
        },
        {
            "text": "Meanwhile, they also championed the much needed social care workplace race equality standard (WRES), currently concluding its first phase of cultural and institutional reform in 18 local authorities. I do hope we see this determination to reflect, honour and promote diversity adopted in all social care settings and allow everyone, regardless of background, to achieve their potential. Social work – and social care generally – can only be truly effective if it mirrors the society it serves."
        },
        {
            "heading": 2,
            "text": "Our voice in the reform agenda"
        },
        {
            "text": "Looking ahead, serving society will assume even greater importance as social work lends its support to social care reform and strengthens its voice within it. There are many challenges ahead in preparing for its implementation, addressing workforce challenges and preparing for assurance of local authority social care responses to supporting people."
        },
        {
            "text": "I continue to be amazed by the way in which social workers step up to meet such challenges, as they continue to focus on people, the outcomes that matter to them, and relentlessly ensure that people’s human rights and their chances to have the best possible"
        }
    ]
}