{
    "url": "https://socialcareinspection.blog.gov.uk/2022/05/11/foster-care-fortnight-9-to-22-may-2022/",
    "title": "Foster Care Fortnight – 9 to 22 May 2022",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's services",
        "fostering",
        "local authorities",
        "mental health",
        "social care professionals"
    ],
    "pub_date": "2022-05-11T12:00:43+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director for Social Care, celebrates foster carers’ invaluable contribution to the lives of the children they care for."
        },
        {
            "text": "This Foster Care Fortnight, as ever, we take our collective hats off to all foster carers, for the difference they make to the lives of tens of thousands of children each year."
        },
        {
            "text": "I recently had the privilege of attending an event in Dorset to thank foster carers for all they do for children in Dorset. It also gave me an opportunity to reflect on the many foster carers whose dedication has had a positive impact on the children in my care as a director for children, schools and families."
        },
        {
            "text": "I remember Baby S, who was initially relinquished by his young Polish mother because she was fearful of the reception they would receive from her very religious family. I remember the generosity of the foster carer and the tenacity of the social worker, who enabled the birth mother to maintain contact with Baby S and to build the confidence and skills to eventually take him home to Poland."
        },
        {
            "text": "I remember hearing about Baby J, who had a very rare life-limiting condition, being matched with very experienced foster carers. They rose to the huge challenges of his 24/7 tube-feeding and care, while knowing his time with us might be very short. I recall their pride on his very unexpected first day at nursery and the absolute confidence we had that however long we were blessed with having him, he was in a home where his presence was very much seen as a blessing."
        },
        {
            "text": "I remember 2 sisters: the younger one who had autism spectrum disorder and the elder one who always played the role of ‘mum’. The trauma of their early years often played out in their behaviour at home and school. I recall their second Christmas in care, when they wore their ‘Frozen’ princess outfits and told me about their ballet lessons and their ambitions for the future. They had many challenges before them, but were settled and beginning to blossom in so many ways."
        },
        {
            "text": "I remember the fostering family who maintained regular contact with a teenage boy who was in their care briefly but needed many months of in-patient mental health care. The support of the foster carers and his ‘foster siblings’ was key to his own belief that he would recover."
        },
        {
            "text": "I recall proud foster parents celebrating their foster children’s success. They told me about children’s exam results, and about children getting a belt in karate, making successful contact with either a brother or a sister, getting a place at university, passing their driving test or getting a Saturday job. The important events in the child’s journey stay with us, as well as the sad times we support them through."
        },
        {
            "text": "Foster carers’ contributions cannot be captured in league tables or performance data, but we see them in abundance during our inspections of local areas and agencies. We hear of it from children, social workers and independent reviewing officers, and from rightly proud directors for children’s services, fostering managers and teams. Where possible, we hear direct testimony from foster carers too."
        },
        {
            "text": "So, I’ll end as I began: with my huge thanks."
        }
    ]
}