{
    "url": "https://educationhub.blog.gov.uk/2022/05/how-the-post-16-qualifications-review-will-affect-you/",
    "title": "Post-16 qualifications review: How it will affect you",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2022-05-11T16:32:58+01:00",
    "content": [
        {
            "text": "Choosing your next steps at 16 can be a daunting process, which is why it’s so important young people are able to pick from qualifications they know will give them the necessary skills to achieve their goals."
        },
        {
            "text": "We are reviewing the qualifications available to people aged 16 to18 to ensure that they are meeting the high standards young people and their parents rightly expect."
        },
        {
            "text": "Qualifications are grouped into different levels according to their difficulty. For more information you can follow this link. Many post-16 qualifications are level 3 qualifications – this includes things like A levels, our newly introduced T Levels, and advanced apprenticeships."
        },
        {
            "text": "As part of this review we plan to remove public funding for a small number of Level 3 qualifications that overlap with T Levels - new technical qualifications comparable to three A levels - to simplify and streamline the options available for young people."
        },
        {
            "text": "Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "So, which qualifications will be affected?"
        },
        {
            "text": "The qualifications that we plan to remove funding from all have significant similarities to the first ten T Levels, such as similar content or intended purpose. By removing these overlaps, we’re making the system simpler, easier, and better for young people."
        },
        {
            "text": "A provisional list of 160 qualifications at level 3 has been published. There is now an appeals process in which the awarding bodies that run the affected qualifications can raise any issues. The final list of qualifications that will have funding removed will be published in September."
        },
        {
            "heading": 3,
            "text": "What does having their funding removed mean in practice?"
        },
        {
            "text": "It means schools and colleges won’t receive Government funding for pupils on these courses once these changes come into effect."
        },
        {
            "heading": 3,
            "text": "Does this mean those courses will be scrapped?"
        },
        {
            "text": "Where providers receive public funding for the courses, these qualifications will no longer be available. Awarding bodies can still choose to make them available, but the cost would need to be met another way. It’s important to be clear, though, that the reason we’re removing funding from these courses is because we believe the content they offer is available through other state funded qualifications, such as T Levels."
        },
        {
            "heading": 3,
            "text": "When will funding be removed?"
        },
        {
            "text": "Not just yet. A final list of qualifications which will have funding withdrawn is expected to be published in September and funding will be withdrawn from qualifications in August 2024."
        },
        {
            "heading": 3,
            "text": "How were these qualifications assessed?"
        },
        {
            "text": "The level 3 qualifications on the provisional list published today were tested against three criteria to streamline the options available to young people:"
        },
        {
            "heading": 3,
            "text": "Will this affect adults?"
        },
        {
            "text": "No. These changes will only affect qualifications taken at Level 3 for students aged 16 to 18. These reforms are being carried out to ensure young people across the country are getting the best possible deal when choosing qualifications."
        },
        {
            "heading": 3,
            "text": "I am already on one of these courses, how will this affect me? "
        },
        {
            "text": "Don’t worry - all qualifications on the final list will be funded until current students have completed their studies. We also expect your college or provider to continue to support you while you take these courses."
        },
        {
            "text": "Please contact your training provider directly for more information on your specific case."
        },
        {
            "heading": 3,
            "text": "What qualifications are on offer to young people post-16"
        },
        {
            "text": "A levels will continue to be the main academic qualifications young people will take while T Levels are a great choice for young people wishing to pursue a technical route."
        },
        {
            "text": "T Levels offer students a mixture of study and ‘on-the-job’ experience during industry placements of at least nine weeks, so they gain the skills and knowledge they need to progress into work, further study, or an apprenticeship. They are now available in schools and colleges across England."
        },
        {
            "text": "Other qualifications will also be available alongside A levels or T Levels where they are proven to support young people to progress onto further study or work."
        },
        {
            "text": "You may also want to consider a traineeship or an apprenticeship. Traineeships last between 6 weeks and a year and give students aged 16-24 the chance to develop skills on the job, splitting their time between the classroom and practical learning, while getting a real feel for a particular profession."
        },
        {
            "text": "Apprenticeships are paid jobs, which give thousands of people the opportunity to gain the skills and on-the-job experience needed to hit the ground running in their chosen profession."
        },
        {
            "heading": 3,
            "text": "What support is out there to help me choose the best route for me? "
        },
        {
            "text": "There is plenty of support out there to help you decide what the best route is for you, whether you choose to enter further study or jumpstart your career."
        },
        {
            "text": "For more information on the choices available to you visit:"
        }
    ]
}