{
    "url": "https://traderemedies.blog.gov.uk/2022/05/11/how-we-use-uk-industry-data-in-setting-trade-tariffs/",
    "title": "How we use UK industry data in setting trade tariffs ",
    "authors": [
        "John Kirkpatrick, Investigations Delivery Director"
    ],
    "categories": [
        "Investigations"
    ],
    "pub_date": "2022-05-11T17:44:49+01:00",
    "content": [
        {
            "text": "In a blog back in March, I set out why it is so important to the TRA to get industry data to do our job. This blog will say a bit more about what we do with that data when we get it. "
        },
        {
            "text": "The law that governs us, which was derived from the World Trade Organization (WTO) treaties, sets out what we do to decide whether a trade remedy measure is justified. To initiate an investigation, we first need evidence from a UK industry, both that imports are dumped or subsidised and that they are harming UK business. You can see the detail in our guidance on how we carry out investigations.  "
        },
        {
            "text": "We recognise that you won’t always have all the information. In markets where prices are not public, you may not know the exact price at which an overseas competitor is winning business from you, for example. So where an overseas competitor is undercutting your prices, we need the best available intelligence available to you to help us establish whether we can initiate a case. "
        },
        {
            "text": "We have prescribed calculations and analyses we then have to conduct during a case. If we have an allegation of dumping, we have to be able to demonstrate that the price overseas businesses are selling at in the UK is less than the price they charge customers at home. Clearly, we need to ensure we are making a fair comparison, so if the domestic price is distorted – for example by government intervention in the market for energy as we have seen in some cases – we need to be able to adjust that price to what it would be if it was set in a competitive market. The more information we have the better. Why should we believe that a market is distorted? What would a price set in open markets without distortions be? All insights into these questions will help us reach more robust conclusions. We check all the supporting evidence collated and is consistent with the law and the requirements of the WTO. "
        },
        {
            "text": "We also need to quantify the harm caused to UK industry by unfairly traded imports. That means we need to understand the costs incurred by domestic industry in producing goods and what reasonable level of profit they could expect if not competing with unfairly traded imports. This is not a measurable fact but a matter of judgement. But we need credible evidence. We verify the facts provided and test the assumptions underlying the numbers.  "
        },
        {
            "heading": 3,
            "text": "Case study: UK imports of biodiesel "
        },
        {
            "text": "Ultimately the decision on what happens – whether we should impose measures, usually tariffs, to protect UK industry from unfair competition – rests with ministers. And ministers will be looking at wider public interest considerations when deciding on our recommendations. But we ensure that our recommendations are well founded. A wide range of good evidence we can trust, robustly analysed, is the best foundation for that.   "
        },
        {
            "text": "We are always happy to explain what we are doing, how we do it and what inputs we need. If you think you have something to contribute, we are always keen to hear from you. "
        },
        {
            "text": "TRA’s mission is to protect UK economic interests against unfair international trade practices. Find out more about our live cases on our public file. "
        }
    ]
}