{
    "url": "https://defrafarming.blog.gov.uk/2022/05/11/meet-farmer-rose-sustainable-farming-incentive-pilot-participant/",
    "title": "Meet Rose, Sustainable Farming Incentive pilot participant",
    "authors": [
        "The Team",
        "Joseph Evans"
    ],
    "categories": [
        "Sustainable Farming Incentive pilot",
        "Things we've learned"
    ],
    "pub_date": "2022-05-11T09:43:36+01:00",
    "content": [
        {
            "text": "Nestled in the historic landscape of Cornwall’s north coast, Wicca Farm dates back to the Bronze Age."
        },
        {
            "text": " The associated cliff land is a Site of Special Scientific Interest (SSSI) well known for its maritime grassland coastal health as well as its diverse range of wildlife. "
        },
        {
            "text": "Rose Nankervis manages this traditional family farm. As a livestock farmer, she oversees the conservation grazing of over a hundred cattle.  "
        },
        {
            "text": "Rose decided to join the Sustainable Farming Incentive pilot, having been involved in various schemes over the years. By testing the pilot version of the scheme, Rose is helping us to improve it. "
        },
        {
            "text": " She chose to adopt the new environmental schemes early on, given their fit with her farming expertise, while giving her an additional income to the farm business. Rose opted for a grassland standard that works best for her and her land. "
        },
        {
            "text": "Many thanks to Rose for taking part in the video and the pilot.  "
        },
        {
            "text": " Applications for the Sustainable Farming Incentive pilot have now closed. The full scheme is due to open in June 2022. Read more about the Sustainable Farming Incentive and how to apply."
        },
        {
            "text": "We'll soon blog about what we've learned from the pilot over the past 6 months and our approach to developing the standards. Subscribe to the blog for the latest."
        }
    ]
}