{
    "url": "https://teaching.blog.gov.uk/2022/05/11/mental-health-and-wellbeing-support-that-prepares-students-for-classroom-learning/",
    "title": "Mental health and wellbeing support that prepares students for classroom learning",
    "authors": [
        "Thomas McMorrin",
        "Sally Singh"
    ],
    "categories": [
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2022-05-11T14:08:27+01:00",
    "content": [
        {
            "text": "Thomas McMorrin, headteacher, and Sally Singh, welfare manager of City Academy Whitehawk in East Brighton, share how they have developed a whole school approach to mental health and wellbeing."
        },
        {
            "text": "At City Academy Whitehawk, we understand our school community and its context, so we know that some children might start school not yet ready for the classroom. The senior leaders in our school are determined that we meet the primary needs of children, which means our mental health and wellbeing provision is as carefully considered as our academic offer. It’s important to us that our staff understand and respect the community we serve, so that children are not shoehorned into classroom success without addressing their primary needs."
        },
        {
            "heading": 3,
            "text": "An open-door policy for professionals"
        },
        {
            "text": "Once a social emotional and mental health (SEMH) need has been recognised, we work with a wide network of professionals towards the most appropriate intervention or provision. With our team of learning mentors, we also work weekly with our primary mental health worker, play therapist, family support worker, counsellor and CAW attendance officer. The positive impact of this provision is widely recognised; our staff and children are proud of what they achieve together with their key professional and their families."
        },
        {
            "text": "To support children with SEMH needs in the transition between early years and KS1, we use the Boxall profile to better understand their SEMH profile. On their entry to KS1, a group of six to eight children receive two hours of teaching each morning from an accredited Nurturing Schools Programme Teacher. As children ‘graduate’ from this phase having met their SEMH targets, they are prepared for classroom learning and the best possible start to Year 1."
        },
        {
            "heading": 3,
            "text": "A huge positive impact on children"
        },
        {
            "text": "We can see the Nurturing Schools Programme is having a huge positive impact on children in achieving ‘next phase readiness’, helping to improve their self-esteem, self-regulation strategies and gain a sense of belonging. For children transitioning to KS2, our afternoon provision promotes social communication. It can lead to rapid progress in the classroom, reduced incidents of unsafe behaviour and a culture that acknowledges the importance of prioritising mental wellbeing. Children feel valued here at Whitehawk, with 97% of children reporting that they feel safe at school and 94% reporting that they feel a sense of belonging."
        },
        {
            "text": "Our welfare provision is something that our staff feel very proud of. It’s hugely rewarding to see the positive impact we’re having on children’s wellbeing. Ultimately, we have one piece of advice: your whole organisation has to believe in the impact of meaningful, well designed and well delivered SEMH provision. If colleagues from every team subscribe to the ethos of ‘meeting the child’s primary needs’ we can achieve a culture of respect for mental health and wellbeing."
        }
    ]
}