{
    "url": "https://homeofficemedia.blog.gov.uk/2022/05/11/national-security-bill-factsheet/",
    "title": "National Security Bill - Factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-05-11T11:00:10+01:00",
    "content": [
        {
            "text": "On 11 May 2022, the Home Secretary introduced the National Security Bill, formerly known as the Counter State Threats Bill, which brings together vital new measures to further protect our national security and modernise existing counter espionage laws to reflect the modern threat. "
        },
        {
            "text": "Why do we need the bill? "
        },
        {
            "text": " You have seen in the news some of the threats we face, and many others are disrupted by our law enforcement and intelligence agencies who work round the clock to protect the UK and the public. We must legislate to get ahead of this threat. "
        },
        {
            "text": " The threat of hostile activity against the UK’s interests from foreign states is growing. States are becoming increasingly assertive in how they advance their own objectives and undermine the safety and interests of the UK. As the Home Secretary has previously stated, there are times when state actors act with malign intent, operating covertly to interfere with our national security, economy, and democracy. "
        },
        {
            "text": " These diverse threats are persistent and take many forms, including espionage, foreign interference in our political system, sabotage, disinformation, cyber operations, and even assassination and poisonings.  "
        },
        {
            "text": " These actions often take place in the shadows, but the harm is very real. We must be able to deter, detect and disrupt those state actors who seek to harm the UK by covertly targeting our national interests, sensitive information, trade secrets and democratic way of life. "
        },
        {
            "text": " How will it work? "
        },
        {
            "text": " Proposed measures in the Bill will: "
        },
        {
            "text": "Individual Measures – Further Detail "
        },
        {
            "text": "Foreign power condition "
        },
        {
            "text": "The foreign power condition ensures that there is a single consistent approach to determining whether activity under the bill offences or aggravated offences is being carried out for or on behalf of, or with the intention to benefit a foreign power and therefore whether that activity falls within scope of the offences and other provisions in the bill. "
        },
        {
            "text": "Generally speaking, an offence will be made out when the specified harmful activity has taken place and where the foreign power condition is met.  "
        },
        {
            "text": "Espionage  "
        },
        {
            "text": "The Bill will provide effective legislation for our law enforcement and intelligence services to tackle the modern threat from foreign states. Three new offences will come together to tackle the harmful activity covered by the existing espionage offence. "
        },
        {
            "text": "This offence ensures that the UK can take robust action where hostile activity is targeted at information which is protected for the purpose of defending the safety or interests of the state from acquisition by a foreign power. "
        },
        {
            "text": "The offence will specifically target the illicit acquisition or disclosure for a foreign power of sensitive trade, commercial or economic information, the value of which is linked to its secrecy. "
        },
        {
            "text": "Under the Bill, it will be a criminal offence to aid the UK-related activities of a foreign intelligence service. That means it will become an offence to be an undeclared foreign spy in the UK for the first time. "
        },
        {
            "text": "Prohibited Places "
        },
        {
            "text": "The Bill will modernise the way that the law protects sensitive sites, providing greater scope to respond to new tactics and technology, and deter those who would violate the security of the places vital to UK national security. "
        },
        {
            "text": "New Offence: Sabotage "
        },
        {
            "text": "The offence will address the serious threat from state-backed attacks on assets, including sites, data, and infrastructure critical to the UK’s safety or interests.  "
        },
        {
            "text": "New Offence: Foreign Interference  "
        },
        {
            "text": "A new foreign interference offence will enable the disruption of illegitimate influence activity by, or on behalf of, foreign states designed to advance their interests or harm the UK. It will be an offence for foreign powers to improperly interfere with the UK’s democracy and civil society through covert influence, disinformation, and attacks against our electoral processes. "
        },
        {
            "text": "Modernised and Extended Offence: Acts Preparatory "
        },
        {
            "text": "We will criminalise those preparing to commit acts which constitute state threats offences and other harmful activity, meaning that the perpetrators can be disrupted before severe damage is done. "
        },
        {
            "text": "State Threats Aggravating Factor "
        },
        {
            "text": "Judges will be able to reflect any connection to state threats activities and harms when sentencing individuals convicted of other crimes. Sentencing can then recognise the seriousness of hostile activity done for or on behalf of foreign states. "
        },
        {
            "text": "Search and Seizure Powers  "
        },
        {
            "text": "Those working for states are often skilled in how to keep their activities hidden. This Bill will bring forward search and seizure powers to replace the existing investigative tool to counter complex state threats investigations.  "
        },
        {
            "text": "New Power: State Threat Prevention and Investigation Measures "
        },
        {
            "text": "Notwithstanding new measures in this Bill, in an exceedingly small number of cases, it will not be possible to bring a prosecution. The Bill will allow the Home Secretary to impose targeted restrictions to prevent the most serious forms of harm. It will be used where intelligence exists to confirm highly damaging threat activity is planned or being undertaken, but prosecution is not realistic. These measures will be subject to rigorous checks and balances, including by the courts (provided for in the Bill) to guarantee their appropriate use.  "
        },
        {
            "text": "Improvements: Schedule 3 Reform "
        },
        {
            "text": "The Bill improves the Schedule Three power (from the Counter-Terrorism and Border Security Act 2019), which grants police officers the ability to stop individuals at ports to ascertain their involvement in hostile activity by foreign states.  "
        },
        {
            "text": "Improvements: Ministry of Justice Measures "
        },
        {
            "text": "The legislation will restrict convicted terrorists from access to civil legal aid; and provide the courts with the ability to order those civil damages awarded to terrorists are frozen or forfeited, where these funds might be used for terrorism.  "
        },
        {
            "text": "Improvements: Serious Crime Act (2007) Amendments "
        },
        {
            "text": "The Bill aims to provide better protection to those discharging their proper national security functions on behalf of Her Majesty’s Government, to enable more effective joint working with international partners and to improve operational agility. "
        },
        {
            "text": "Timeline "
        },
        {
            "text": "The National Security Bill was introduced to Parliament on 11 May 2022 and will progress through further stages as parliamentary time allows. "
        }
    ]
}