{
    "url": "https://homeofficemedia.blog.gov.uk/2022/05/11/the-national-security-bill-is-a-vital-tool-to-keep-the-british-public-safe-priti-patel/",
    "title": "'The National Security Bill is a vital tool to keep the British public safe' - Priti Patel",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Ministerial opinion"
    ],
    "pub_date": "2022-05-11T10:15:27+01:00",
    "content": [
        {
            "text": "This Government will do all it can to protect the country from hostile foreign activity whether abroad or on our soil."
        },
        {
            "text": "The nature of the threat to the United Kingdom from foreign states may change, but it is ever-present. Over recent years, it has become even more sophisticated and varied."
        },
        {
            "text": "The Government will give every possible support to intelligence services and law enforcement agencies to address it. One of our tasks is to ensure that the legal framework in which they operate is up to date."
        },
        {
            "text": "The whole country has been united in outrage by high-profile cases such as Salisbury when Russian operatives entered our country to commit murder. In January, I made a statement in the House of Commons about individuals who engaged in political interference activities on behalf of the Chinese Communist Party and targeted members of Parliament. Of course, there are many more threats that cannot be made public."
        },
        {
            "text": "We refer to the hostile activity of foreign countries as “state threats”. Defeating the hostile activity that threatens our people, property, economy, democracy, and freedom requires us to be even more sophisticated than those who would hurt us."
        },
        {
            "text": "Therefore, we must give those who keep us safe from these harms the tools they need to prepare, plan, and take action to protect us. They may never get public recognition for this work, but we all owe them a huge debt of gratitude for their courage and their constancy."
        },
        {
            "heading": 2,
            "text": "Protecting data and infrastructure from foreign states"
        },
        {
            "text": "Like them, I will do everything in my power to keep our country safe from those who would seek to do us harm. That is why I am introducing the National Security Bill, which will better arm us against state threats and keep us at the forefront of the global intelligence community."
        },
        {
            "text": "The Bill will, for the first time, make it an offence to be a covert foreign spy on our soil. We will introduce a new foreign interference offence, to disrupt illegitimate interference activity conducted for, or on behalf of, foreign states."
        },
        {
            "text": "A new sabotage offence will be brought in to more effectively respond to state-backed attacks on the sites, data or infrastructure critical to the UK’s safety and interests."
        },
        {
            "text": "This National Security Bill is critical for those on the front line of deterrence and disruption. It will include stronger laws and updated tools for our law enforcement agencies, along with new investigative powers and capabilities."
        },
        {
            "heading": 2,
            "text": "Foreign Influence Registration Scheme"
        },
        {
            "text": "These new offences and those we are bringing into the modern age are backed up by an increase in existing maximum sentences. It is vital to give our courts the power to put those who would harm us behind bars for longer."
        },
        {
            "text": "The Bill will introduce a Foreign Influence Registration Scheme, requiring individuals to register certain arrangements with foreign governments, to deter or disrupt state threats activity in the UK."
        },
        {
            "text": "The Bill also repeals and replaces existing espionage laws, many of which were primarily designed to counter the threat from German spies around the time of the First World War."
        },
        {
            "heading": 2,
            "text": "Modern laws to reflect a modern world"
        },
        {
            "text": "It is vital that we have modern laws to reflect the way the world has changed since then and to reflect the way that modern technology can be used to do harm."
        },
        {
            "text": "In doing so, it creates a suite of new offences covering the harmful activities that we see today. It will create a modern set of offences making it illegal to obtain and disclose sensitive information and trade secrets whether doing so for or on behalf of a foreign state."
        },
        {
            "text": "It will also allow intervention in state threats activity much earlier, by criminalising conduct in preparation for state threats activity meaning that arrests can be made at an earlier stage before damage is done."
        },
        {
            "text": "When sentencing for offences outside of the Bill, judges will be required to consider any connection to state threats activity and reflect on the seriousness of that when handing down a sentence."
        },
        {
            "text": "There is also a new range of measures to manage those who pose a threat but whom it has not been possible to prosecute. The use of these measures will of course be subject to rigorous checks and balances, including from the courts."
        },
        {
            "heading": 2,
            "text": "A vital tool in the fight against hostile actors"
        },
        {
            "text": "But we must be better able to pursue potential threats, and not wait for a hostile actor to target this great country and conduct another terrible attack."
        },
        {
            "text": "And there are measures to combat the enduring threat of terrorism and those who abuse our legal systems. These will restrict the access of convicted terrorists to civil legal aid and cut them off from civil damages where these might go towards harmful acts."
        },
        {
            "text": "The National Security Bill is not our only tool, but it is a vital one. Nobody, at home or abroad, should doubt that this government will do whatever it takes to keep the British people safe."
        }
    ]
}