{
    "url": "https://socialcare.blog.gov.uk/2021/11/25/carers-rights-day-knowledge-access-support/",
    "title": "Carers Rights Day: knowledge, access, support",
    "authors": [
        "Helen Walker"
    ],
    "categories": [
        "Care and support",
        "Carers"
    ],
    "pub_date": "2021-11-25T10:10:37+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Realisation is the first step"
        },
        {
            "text": "Every year, when we hold Carers Rights Day, it’s an opportunity to raise awareness of caring. People don’t see themselves as unpaid carers but as partners, wives, husbands, sons, daughters, and close friends first. Yet, providing unpaid care to someone who has a health condition, who is older or who has a disability, can have a profound impact on their health, wellbeing, paid work and relationships."
        },
        {
            "text": "Around 6,000 people are new to caring every day. On average, it takes two years for someone to identify as a carer and, as a result, they often miss out on practical and financial support. During the pandemic, supporting carers has become more important than ever.  Carers UK estimated a potential growth of carers of 4.5 million, 2.8 million of whom were working – many becoming carers overnight."
        },
        {
            "text": "Our mission, as part of Carers Rights Day, is to encourage action which raises awareness of caring and carers and supports them to find out moreabout their rights and entitlements. Our resources focus on important carers’ rights that are almost universal – including the right to an assessment, eligibility for a free flu jab, asking GP practices to identify them as carers, and the right to be identified and consulted before a relative is discharged from hospital."
        },
        {
            "heading": 2,
            "text": "Working and caring"
        },
        {
            "text": "We’re also focusing on carers’ rights at work, including the right to request flexible working and time off to care if there is an emergency. Our new research finds that 72% of carers worry about juggling work and care and nearly half of carers (52%) say they have an understanding employer."
        },
        {
            "text": "However, one in four carers don’t have supportive employers, which is something we can and must change if we are to keep carers within the labour market. We know that, whilst employers have made changes during the pandemic to support carers in the workplace, others still need to go further, otherwise their employees will have no choice but to reduce their working hours or give up altogether. Find out more about supporting carers at work in our new report."
        },
        {
            "text": "Unpaid carers make up an important part of our workforce. A staggering one in three people identified as unpaid carers in the NHS staff survey and similar proportions of employees in social care are doing the same.  Most of us will assume caring responsibilities during our lifetime. We have a 50:50 chance of providing care by the time we are 50 years old – women by the time they are 46 and men 57; 11 years later. Some people start their journey as young carers, others when they are thinking about retirement."
        },
        {
            "heading": 2,
            "text": "The business case"
        },
        {
            "text": "Helping carers to juggle work and care also makes economic sense. Employers are very familiar with the recruitment and productivity costs of staff turnover, particularly within social care."
        },
        {
            "text": "Government has pledged to introduce up to a week’s unpaid carer’s leave, which Carers UK has welcomed, along with a consultation from the Department for Business, Energy and Industrial Strategy (BEIS) proposing the right to request flexible working from day one rather than after 26 weeks of employment. Both measures would help carers to remain in work for longer, which is what the majority of carers want to do."
        },
        {
            "text": "If you want to support carers, then encourage your employer to be an early adopter of carer’s leave and encourage them to go one step further to make this paid. Encourage them to join Carers UK’s good practice forum, Employers for Carers. Look at measures like Carers Passports in the workplace. Above all, help people you know or connect with to identify themselves as a carer and signpost them to support. Help us use Carers Rights Day to make sure that carers don’t miss out."
        }
    ]
}