{
    "url": "https://civilservice.blog.gov.uk/2021/11/25/championing-the-carer-agenda/",
    "title": "Championing the Carer agenda",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary",
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-11-25T09:05:59+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Alex Chisholm, Civil Service Inclusion Champion, and Rebecca Sudworth, Deputy Champion for Carers, highlight the importance of carer awareness."
        },
        {
            "text": "Today 25 November is Carers Rights Day, an opportunity to recognise the skills and insights our carers bring to their work and to raise awareness about the support we provide. "
        },
        {
            "text": "Around one fifth of civil servants are carers for loved ones who are disabled, ill or elderly. This is a significant proportion of our colleagues. The pandemic has also had a huge knock-on effect on the lives of carers that has impinged their access to services and, as a result, their ability to combine work and caring. "
        },
        {
            "text": "As A Modern Civil Service, we recognise that the challenges for carers can be a real struggle at times - and we want to help. We believe it’s important to enable you to access support that’s available as soon as you need it."
        },
        {
            "text": "This week, we attended the annual Celebrating Carers Event run by the Civil Service Carers Network, the fourth event of its kind. We were moved to hear how our carers have dealt with the challenges over the last year while continuing to make a valuable contribution to the work of the Civil Service. We would like to convey our heartfelt thanks to you all."
        },
        {
            "heading": 4,
            "text": "Support"
        },
        {
            "text": "Carers may juggle extensive caring throughout their careers, both inside and outside the Civil Service. Our ambition as Carer Champions is to ensure we take practical steps to help you and celebrate your dedication to managing both of your roles. "
        },
        {
            "text": "We are keen advocates of the Carer’s Passport and we want to help carers and their managers understand the benefits of filling one out. If you’re a carer, please talk to your manager about completing a Carer’s Passport.  This can help you consider what flexibilities you need to be able to combine caring and work. You can then write these down and take them from job to job."
        },
        {
            "heading": 4,
            "text": "Managers’ toolkit"
        },
        {
            "text": "The support of managers is crucial in enabling carers to cope and stay in work. This week, in partnership with the Civil Service Carers Network, we’ve launched a managers’ toolkit. If you’re a manager, we hope this will help you understand the issues carers face as well as the extent of support they may need. "
        },
        {
            "heading": 4,
            "text": "Young Carers "
        },
        {
            "text": "We are delighted a number of young carers have teamed up to launch a new network for young adult carers in the Civil Service. Their vision is for young carers to support each other and share experiences. If you are interested in being part of this, email COCarers@cabinetoffice.gov.uk."
        },
        {
            "heading": 4,
            "text": "Carer strategy"
        },
        {
            "text": "Back in 2020, we launched a five-year carer strategy, and we are making real strides in implementing its various priorities. We know that a huge amount of work on this takes place across departments every day, and we look forward to following through with the next stages of the five-year plan. "
        },
        {
            "text": "The Civil Service takes part in a national benchmarking scheme called Carer Confident. This has three levels of recognition. "
        },
        {
            "text": "We are delighted that the Department for Business, Energy and Industrial Strategy has now achieved Level 2 accreditation, Crown Commercial Service Level 1, and the Department for Work and Pensions Level 3, which is the highest level of accreditation. DWP is the first Civil Service department to achieve this level which is a fantastic achievement."
        },
        {
            "text": "Some people don’t recognise that they are carers. Yet carers can come from all backgrounds, ages and levels of seniority. You may be looking after an elderly parent, a disabled child or adult, or sometimes both. Caring can start out of the blue and be unpredictable. Look on your department’s website for the Carers Charter which will link you to all the support your department provides."
        },
        {
            "text": "► There are lots of events taking place in departments to mark Carers Rights Day. Please try to find the time to attend some of these."
        }
    ]
}