{
    "url": "https://stratcommand.blog.gov.uk/2021/11/25/clear-eyed-and-looking-ahead-the-strategic-command-strategy/",
    "title": "Clear-eyed and looking ahead: The Strategic Command Strategy",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "FAQ",
        "Innovation",
        "Integration",
        "Personnel",
        "Policy",
        "Technology"
    ],
    "pub_date": "2021-11-25T07:45:51+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Following the publication of the Strategic Command strategy, Strategic Command’s Director Strategy Air Vice Marshal Justin Reuter reflects on how and why we need to embrace change."
        },
        {
            "text": "Following the publication of the Integrated Review earlier this year, it was clear that all of us in Strategic Command had an important task ahead and that integration was a critical part of Defence’s future.   "
        },
        {
            "text": "Quite rightly, Strategic Command was looked to as the organisation which would be the driving force for that integration. Our experience of collaborating with partners across government in areas such as cyber and space; working with international allies and partners on operations; and the critical cross-Defence enabling functions we perform such as intelligence, medical, logistics, and digital technology; placed us in the vanguard to lead that change.  "
        },
        {
            "text": "We were then faced with the inevitable question: how are we going to achieve that change? To communicate what we needed to do, and how we were to do it, we needed a clear strategy. However, despite being an organisation with a strategic focus, developing that strategy was no easy feat.   "
        },
        {
            "text": "Our unique structure and broad remit created many challenges in developing a strategy. We needed to ensure we stayed true to the direction given in the IR, but we also needed to face the realities of our existing organisation. Most critically, we needed to ensure we had a clear vision. To do this we looked to who we are as an organisation, and to what had been asked of us.  "
        },
        {
            "text": "The vision we chose was: “Strategic Command is the transformative Command. We are the driving force behind integration, and the enabling foundation for Defence’s enhanced global posture.”  "
        },
        {
            "text": "Next, we considered what outcomes we must achieve in order to reach that vision. In determining what these should be, we began by considering the objectives of our Multi-Domain Integration Change Programme (MDICP). We started here because we knew that it was critical that our strategy objectives aligned with the objectives of the MDICP.  "
        },
        {
            "text": "With that in mind, we developed five strategic outcomes that we had to achieve. They are: integrated capabilities, orchestrated activity and effects, improved understanding, enhanced global reach, and disruptive capabilities. By achieving these outcomes, we’ll help contribute towards integrated Armed Forces that can act in ways that our adversaries cannot match. "
        },
        {
            "text": "Once we had our objectives, our next challenge was to consider how we go about achieving them. We quickly realised that, in order to achieve our objectives, we were going to have to make some changes to key capabilities within the Command. These key capabilities were the things we determined must be transformed across the Command in order to create a more agile, capable and integrated Defence. They are; people, data, technology, and authority. "
        },
        {
            "text": "As I said, the development of this strategy was no easy feat. But the real hard work begins now. We are now armed with a strategy which sets out what Strategic Command must do in order to lead this crucial period of change in UK defence. But a strategy is only as good as those who can implement it.   "
        },
        {
            "text": "But in that regard, I have no concerns. Strategic Command is fortunate to have one of the most diverse and capable workforces in defence. Our people have proven time and again that they can achieve, no matter the odds. I look forward to working with them to make this strategy a reality.  "
        },
        {
            "heading": 4,
            "text": "The Strategic Command Strategy is now live on gov.uk and it can either be read in full or in an accessible html version."
        }
    ]
}