{
    "url": "https://deframedia.blog.gov.uk/2021/11/25/great-british-beach-clean-coverage/",
    "title": "Great British Beach Clean coverage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-11-25T13:30:11+00:00",
    "content": [
        {
            "text": "There has been coverage today in the Guardian, the Daily Mail, The Times and The Telegraph of the results of the Marine Conservation Society’s (MCS) 2021 Great British Beach Clean, which found that litter on UK beaches has fallen to the lowest level for more than 20 years."
        },
        {
            "text": "The Government is taking action to tackle waste at its source. We have recently launched a consultation on banning a range of single-use plastics, including plastic cutlery, plates, balloon sticks, and expanded and extruded polystyrene food and beverage containers, while our call for evidence is seeking views on tackling a number of commonly littered single-use plastics, including wet wipes, cigarette filters, sachets, and other single-use cups."
        },
        {
            "text": "Through our landmark Environment Act, we will have powers to introduce a deposit return scheme for drinks containers - which will see consumers incentivised to recycle their bottles and cans - as well as to make companies more responsible for the packaging they produce. We have also launched a consultation on creating consistent recycling collections in England, which will transform the way we deal with rubbish."
        },
        {
            "text": "According to the MCS, the amount of waste washing up on beaches is falling year by year, with single-use plastic bags having fallen from a high of 13 for every 100 metres in 2013 to just three in 2021 following the introduction of the plastic bag charge in 2015, which has cut consumption in supermarkets by 95%. The charge was recently increased to 10p and extended to all retailers, a move which is expected to take billions more bags out of circulation."
        },
        {
            "text": "Plastic cotton bud sticks have dropped out of the top 10 most common types of litter following the Government’s restriction of the supply of those items in 2020, which also extended to straws and stirrers."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "We will also introduce a world-leading plastic packaging tax from April 2022, set at £200 per tonne, on plastic packaging which doesn’t meet a minimum threshold of at least 30% recycled content. This will encourage greater use of recycled plastic, leading to increased levels of recycling and plastic waste collection, helping to tackle the problem of plastic waste and protect our environment."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}