{
    "url": "https://onlinesafetydata.blog.gov.uk/2021/11/25/identifying-the-challenges-and-solutions-for-tackling-online-violence-against-women-and-girls/",
    "title": "Identifying the challenges and solutions for tackling online Violence Against Women and Girls",
    "authors": [
        "Fiona Hallett, Project Delivery Lead, Online Safety Data Initiative"
    ],
    "categories": [
        "Project deepdives"
    ],
    "pub_date": "2021-11-25T08:45:57+00:00",
    "content": [
        {
            "text": "As part of the Online Safety Data Initiative, DCMS is working with the Home Office to carry out a 6-week Discovery project into online Violence Against Women and Girls (VAWG1). This project will scope out research into the dynamics of online VAWG, and explore some of the potential solutions. In this blog post, we outline some of the issues of online VAWG and some of the key challenges to understanding the problem and developing these solutions."
        },
        {
            "text": "Today, women and girls around the world are at far greater risk of being subjected to certain forms of online violence compared to the wider population. This year, Thursday 25th November marks the International Day for the Elimination of Violence Against Women. "
        },
        {
            "text": "The cross-Government Tackling Violence Against Women and Girls Strategy recognises the emergence of new forms of violence against women and girls. In 2017, Amnesty International and Ipsos Mori conducted a survey relating to online abuse or harassment of women aged 18-55 years in the UK, US, New Zealand, Spain, Italy, Poland, Sweden and Denmark. It found that in the UK a total of 21% of respondents had experienced abuse or harassment online at least once (the average was 23% across the countries, ranging from 17% to 30%). In addition, it found that female BAME Members of Parliament receive a disproportionate amount of online hate compared to white colleagues (Amnesty 2017). Other research in this space (see for example Refuge 2021) has highlighted how online abuse disproportionately affects women and girls within protected groups, for example, those who identify as LGBT+.\n"
        },
        {
            "text": "Like crimes committed offline, online VAWG can have a range of impacts on the women and girls experiencing it, including negative impacts on mental health and wellbeing, and related risks to physical safety. Additionally, experiencing online violence can lead to behavioural changes, including limiting the ways in which women and girls navigate and participate within online spaces."
        },
        {
            "text": "In order to continue improving the safety of women and girls online, and ensuring online spaces are accessible to all, new approaches are critical to tackling the problem of online VAWG. This includes exploring how to utilise existing and emerging technology solutions to support the automated identification of harmful illegal online content so that it can be removed. Moving forward, work around improving Safety by Design principles presents another opportunity, ensuring online platforms are designing vital safety tools and resources into the way that their platforms and services are built."
        },
        {
            "text": "There are already excellent initiatives being led by civil society and academia to both further understandings of online VAWG, and to take steps to tackle the problem. Additionally, wider work, including the Government’s recently published Tackling VAWG Strategy has furthered progress in this area, setting out proposals from prevention through to offender management. It details the actions the Government will take to increase support for survivors, bring perpetrators to justice, and, ultimately, reduce the prevalence of violence against women and girls."
        },
        {
            "text": "We recognise that there is an urgent need to tackle online VAWG, but there remain many challenges to understanding the problems and identifying solutions. One of the key challenges is the lack of consistent definitions. There is a lack of cross-industry frameworks or taxonomies for characterising and describing different types of online VAWG, which creates barriers to both understanding the complexities of the problem, and developing technical and policy solutions."
        },
        {
            "text": "As part of the Online Safety Data Initiative, DCMS, OSTIA, Faculty and PUBLIC are working with the Home Office to deliver a 6-week discovery project researching online VAWG. The aim of this discovery work is to further build our understanding of the problem, including the robust evidence that highlights both the challenges and potential solutions currently present in this space. At the end of this 6-week project, we will identify specific areas for further research into online VAWG, and make some early recommendations for technical and policy solutions."
        },
        {
            "text": "1 The term ‘violence against women and girls’ refers to acts of violence or abuse that we know disproportionately affect women and girls. Crimes and behaviour covered by this term include rape and other sexual offences, domestic abuse, stalking, ‘honour’-based abuse (including female genital mutilation forced marriage, and ‘honour’ killings), as well as many others, including offences committed online."
        }
    ]
}