{
    "url": "https://deframedia.blog.gov.uk/2021/11/25/new-report-into-sewage-discharges-during-the-bathing-season/",
    "title": "New report into sewage discharges during the bathing season",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-11-25T12:07:12+00:00",
    "content": [
        {
            "text": "There has been widespread coverage today including in the Daily Mail, the Guardian, the Independent, the Times, the Telegraph, Daily Express, and Sky News about a new annual report by Surfers Against Sewage."
        },
        {
            "text": "Using data gathered from water company alerts of spills via storm overflows, it reports that more than 5,000 discharge notifications were issued by water companies over the 12-month period (1 October 2020 to 30 September 2021)."
        },
        {
            "text": "The Environment Agency welcomes this focus from Surfers Against Sewage – and as an organisation is significantly driving up the monitoring and transparency around sewage spills. That means we have a much clearer picture of the data so that we can better tackle the issue."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "More than 12,000 of England’s 15,000 storm overflows now have Event Duration Monitors, and the remaining 3,000 will have them by the end of 2023. All the data is published online, so the public can see what is happening in their local area. Because we are monitoring more, it also isn’t always straightforward to make year-on-year comparisons."
        },
        {
            "text": "This new monitoring is in addition to the many other measures that the government is taking. The Environment Act was passed into law on 9 November. It will improve the performance of water and wastewater companies by introducing clear new duties, including to progressively reduce the adverse impacts of discharges from storm overflows."
        },
        {
            "text": "Follow the Environment Agency and Defra on Twitter, and sign up for email alerts here."
        }
    ]
}