{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/11/25/what-do-you-need-to-thrive-in-your-job/",
    "title": "What do you need to thrive in your job?",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Events",
        "Research"
    ],
    "pub_date": "2021-11-25T17:14:48+00:00",
    "content": [
        {
            "text": "We’ve talked extensively on this blog about what we found in our ground-breaking report on reforming policymaking in the UK. It now time to take action and we need your help."
        },
        {
            "text": "We’re working with organisations across the UK government to create the environment that people who make public policies and services need to excel in their jobs. We need you to tell us what those things are and to help us put them in place."
        },
        {
            "heading": 2,
            "text": "Building momentum for change"
        },
        {
            "text": "In 2020, the Policy Design Community partnered with the Policy Profession which supports the UK’s 30,000 policymakers. We worked together with hundreds of policymakers to ask how we might deliver better outcomes for citizens. Our recommendations were welcomed by the government and a real sense of momentum has begun to build up…"
        },
        {
            "heading": 2,
            "text": "Commitment from the top"
        },
        {
            "text": " Our transformation work is supported at the highest levels of the UK’s government."
        },
        {
            "text": "Led by Tamara Finkelstein, Permanent Secretary of Department for Environment, Food & Rural Affairs, the Policy Profession brings together a board of senior departmental heads of Policy Profession from across government to focus on the continued development of policymakers, the improvement of policymaking, and to support us all in strengthening our identity and supporting us to do the best policy work we can."
        },
        {
            "text": "Jonathan Mills, Director General Labour Market Policy and Implementation at Department for Work and Pensions, and the Senior Responsible Owner for our transformation work, wants to ensure that we add value by bringing in the expertise and experience that is found right across government."
        },
        {
            "heading": 2,
            "text": "Now it’s your turn to get involved"
        },
        {
            "text": "We want to work with people who make public policies and services to co-create a working environment that you can thrive in - and to work together as a community to improve it.  We want you to be at the centre of that change now and through 2022. Here are some ways that you can get involved…"
        }
    ]
}