{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/10/10/application-are-now-open-for-science-and-engineering-fast-stream-2025/",
    "title": "Application are now open for Science and Engineering Fast Stream 2025",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Engineering",
        "GSE Offer",
        "GSE Opportunities",
        "Science"
    ],
    "pub_date": "2024-10-10T12:42:35+01:00",
    "content": [
        {
            "text": "What do climate change, food safety, transport emissions and sustainable housing all have in common? They are all underpinned by science and engineering. Recruiting more scientists and engineers is essential to ensure scientific evidence provides quality government decision making. "
        },
        {
            "text": "The government requires highly talented and versatile scientists and engineers that reflect the rich diversity of our population. This diversity is crucial as it brings a variety of perspectives and ideas, which are essential for innovation and progress."
        },
        {
            "heading": 4,
            "text": "Grow like nowhere else"
        },
        {
            "text": "We are recruiting for the 2025 Science and Engineering scheme in the Civil Service Fast Stream’s award-winning leadership development programme. Grow like nowhere else! The Fast Stream is the Government's flagship graduate development programme, which equips the brightest candidates with the knowledge, skills and experience they need to become future leaders of the Civil Service."
        },
        {
            "text": "You may be a science or engineering graduate straight out of university, an experienced postgraduate academic, a seasoned industry professional or a current civil servant with relevant experience, this scheme allows you to become part of a modern community of science and engineering professionals. Whatever your background, you will provide a unique skill set that helps us achieve our goal of a more scientific civil service."
        },
        {
            "text": "On the Fast Stream, you will experience a wide range of exciting and rewarding postings while being supported to grow through a tailored personal development programme and mentoring."
        },
        {
            "text": "Over three years, you will experience a wide range of rewarding postings across the Civil Service which could include the Ministry of Defence, Department for Science, Innovation and Technology, Department for Environment, Food and Rural Affairs, or the Department of Business and Trade, among others."
        },
        {
            "text": "This means that you will likely work in areas outside of your immediate scientific/engineering knowledge, bringing with you a fresh approach. You will use your experience and expertise to grow through a tailored and accelerated leadership development programme. You will also get the opportunity to join different Fast Stream networks and meet new people and gain new skills."
        },
        {
            "text": "The Government Science Engineering Profession are keen to provide a broad experience within our scheme, and we offer a unique interchange placement which may include working in local government, charity and private sector roles. Together, these postings will develop your ability to apply your scientific mindset and your leadership potential, to prepare you to become a future senior leader in the Civil Service."
        },
        {
            "heading": 4,
            "text": "How to apply"
        },
        {
            "text": "The Science and Engineering Fast Stream will develop you into a confident and inspiring future senior leader in the Civil Service – supporting our ambition to put science and engineering at the heart of government policy. So, if you are passionate about science and engineering, this is a great opportunity."
        },
        {
            "text": "For more information and to apply, please visit the Science and Engineering Fast Stream on the Civil Service Fast Stream website."
        },
        {
            "text": "Applications open midday 10 October 2024 and close midday 7 November."
        },
        {
            "text": "Find out more about the scheme from our Science and Engineering Fast Stream Alumni in this case study."
        }
    ]
}