{
    "url": "https://defrafmp.blog.gov.uk/2024/10/10/live-today-fmp-and-jfs-consultations-and-publication-of-flatfish-fmp/",
    "title": "Live today- FMP and JFS consultations and publication of flatfish FMP",
    "authors": [
        "Fi Pearson - Head of FMP Development and Publication, Defra"
    ],
    "categories": [
        "Cockle FMP",
        "North Sea and Channel sprat FMP",
        "Queen scallop FMP",
        "Southern North Sea and Channel skates and rays FMP",
        "Southern North Sea and Eastern Channel mixed flatfish FMP",
        "Southern North Sea demersal non-quota FMP"
    ],
    "pub_date": "2024-10-10T10:59:59+01:00",
    "content": [
        {
            "text": "Fisheries Management Plans (FMPs) will enhance food security, support economic growth in coastal communities and restore and protect nature. "
        },
        {
            "text": "Today, we are publishing a package of FMP material: "
        },
        {
            "text": "We want your views on the consultations now and as we start to implement the flatfish FMP there will be opportunities to engage. "
        },
        {
            "text": "The consultations on the next five  draft FMPs "
        },
        {
            "text": "The FMPs were developed collaboratively over several months.  They gather evidence of what we know about the state of the stocks, the management and set out short, medium and long term actions to restore or maintain the stocks at sustainable levels. "
        },
        {
            "text": "Read the consultation documents and share your views here: "
        },
        {
            "text": "You can submit your consultation response through an online questionnaire, or by email or post.  "
        },
        {
            "text": "We will also be running coastal and online events to discuss these plans in more detail. You can also feed your views into the consultations this way.  "
        },
        {
            "text": "Dates and locations will be announced on the blog very soon! "
        },
        {
            "text": "Technical changes to FMPs "
        },
        {
            "text": "Experience has shown that we need more time to produce the remaining FMPs. "
        },
        {
            "text": "We therefore propose to amend the deadlines for publication of the remaining FMPs as set out in the Joint Fisheries Statement.  "
        },
        {
            "text": "There are also a number of technical changes proposed: "
        },
        {
            "text": "Read the consultation document and share your views here: https://www.gov.uk/government/consultations/joint-fisheries-statement-proposed-amendments-to-annex-a  "
        },
        {
            "text": "Publication of the Southern North Sea and Eastern Channel mixed flatfish FMP "
        },
        {
            "text": "This was consulted on last year.  The published plan, summary of responses and government response can be found here: https://www.gov.uk/government/publications/southern-north-sea-and-eastern-channel-mixed-flatfish-fisheries-management-plan-fmp  "
        },
        {
            "text": "Key elements of the published plan are:   "
        },
        {
            "text": "We will now start to implement the plan and want to do so collaboratively with interested parties.  "
        },
        {
            "text": "Make sure to subscribe to the blog for the latest updates on these and more! "
        }
    ]
}