{
    "url": "https://moderncivilservice.blog.gov.uk/2024/10/10/meet-the-modern-civil-service-jo-shanmugalingam/",
    "title": "Meet the Modern Civil Service: Jo Shanmugalingam",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Innovation",
        "Interview",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-10-10T12:59:53+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Jo is the Second Permanent Secretary at the Department for Transport."
        },
        {
            "heading": 2,
            "text": "What does a Modern Civil Service mean to you? "
        },
        {
            "text": "It means exactly what it says: skilled, innovative, ambitious civil service. It's a celebration of everything fantastic about the civil service today. It's also about how we need to continue to change for the future to meet our challenges, to support this government and governments over the decades ahead. "
        },
        {
            "heading": 3,
            "text": "You are the sponsor of One Big Thing this year, the theme being Innovation. What motivated you to take on this role?"
        },
        {
            "text": "One Big Thing is a fantastic example of innovation itself, and this year it is also focused around innovation. In my last job, as director general for science and innovation, I was involved in innovation in the economy, how we support innovators, and how we bring that into the civil service. There are fantastic innovations across the civil service today,  but the challenges we see are ever greater. I believe passionately in encouraging innovation in the civil service to deliver the best for the public. "
        },
        {
            "heading": 3,
            "text": "Can you tell us about how innovation is transforming the civil service. What is your favourite example/case study of innovation in practice?"
        },
        {
            "text": "There are incredible innovations taking place across various sectors, but one that we are particularly proud of is the government's strong commitment to making electric vehicles the preferred choice in the UK. This initiative is crucial in order for us to fulfil our climate obligations. For years, we have been implementing various strategies to encourage people to feel confident in purchasing and using electric vehicles. This includes providing subsidies for charging points. However, we were aware of the issues surrounding fraud, which proved to be challenging to detect. A dedicated team within the department developed a cutting-edge AI model that is capable of identifying errors and fraudulent applications. Some individuals were using stock images from the internet as false evidence. The implementation of this AI model for verifying charge points eligible for government funding has saved years of effort that would have been spent manually comparing images. "
        },
        {
            "text": "While technology plays a significant role in this process, organisational strategies are also key. In my previous role, I played a key part in establishing a new research funding agency called ARIA - Advanced Research and Invention Agency. This agency represents a unique approach to supporting innovators and researchers in the UK to address complex global challenges. It presents exciting opportunities for scientific advancements to tackle these challenges beyond the confines of the civil service."
        },
        {
            "text": "I would also like to talk about Places for Growth. Today, I am in Leeds, at one of the new Department of Transport offices, which is part of the government's initiative to decentralise jobs from London. This move to government hubs is a game-changer, revolutionising the way departments operate. For the Department of Transport, having employees across different regions is essential for understanding transportation needs nationwide. I find this shift incredibly exciting and believe we are just beginning to see the benefits of Places for Growth for the civil service and our workforce."
        },
        {
            "text": "From my personal experience, I often discuss the changes that COVID has brought to some schools and the more effective ways they organise i.e. morning routines now. These practical changes highlight that innovation is not solely about technology but also about rethinking our processes. "
        },
        {
            "heading": 3,
            "text": "Innovative ways of working"
        },
        {
            "text": "I shared a job for many years with Susanna Storey, who is now the Permanent Secretary at the Department for Culture, Media and Sport. At the time we were strategy directors at the Department for Energy and Climate Change. Job sharing, in particular, presents an intriguing opportunity for both innovation and resilience. How can we incorporate moments of reflection into our work? Taking a step back to assess our goals and ensure coherence is essential, and job sharing facilitates this process on a weekly basis. For instance, I would spend Mondays and Tuesdays at home with my children, allowing me to ponder work matters in the background without the pressure of immediate tasks, thanks to my job-sharing partner, Susanna."
        },
        {
            "text": "Susanna would handle work responsibilities on those days, and upon my return on Wednesday, I could offer fresh perspectives on our direction. Similarly, Susanna would have her time off on Thursdays and Fridays, returning on Monday with valuable insights. This collaborative approach highlights the power of job sharing, although it may not be suitable for everyone or every pairing. Personally, job sharing has been instrumental in my career progression. When my children were young, job sharing enabled me to balance work and family commitments effectively."
        },
        {
            "heading": 3,
            "text": "What changes do you plan at One Big Thing 2024? "
        },
        {
            "text": "Making it simple for the department to operate is something we can influence by looking at how we work together is something we will be doing. "
        },
        {
            "text": "I'm obsessed with efficient processes, so I'm sure it'll be something about AI and reducing electric vehicle charge point fraud. It will be a small practical step, but those are important. "
        }
    ]
}