{
    "url": "https://mhclgdigital.blog.gov.uk/2024/10/10/prioritising-mental-health-in-the-workplace/",
    "title": "Prioritising mental health in the workplace  ",
    "authors": [
        "Noor Taha, DELTA Operations Analyst"
    ],
    "categories": [
        "Ways of working"
    ],
    "pub_date": "2024-10-10T10:37:52+01:00",
    "content": [
        {
            "text": "My interest in mental health stems from a personal experience, having supported my wife through very traumatic times, which has also affected my own mental health in different ways. This lived experience has shown me the importance of both having and providing mental health support, both for the individual going through the crisis and the people who are caring for them.  "
        },
        {
            "heading": 2,
            "text": "My journey with mental health in the workplace "
        },
        {
            "text": "Soon after, I began having conversations with friends and colleagues in the department, and I found that there were quite a few people trying to deal with mental health issues on their own. Where possible, I supported them as best as I could or directed them to where they could get professional help. That’s when the irony of it all struck me – here we are, all working at the same department, but we didn’t seem to have realised that there was a community right here too and with its own real needs. "
        },
        {
            "text": "So that’s when I decided to set up a self-help peer support group for colleagues in the department who were struggling with their own mental wellbeing or were caring for someone with a mental health illness. "
        },
        {
            "text": "I wanted to offer colleagues the opportunity to share their experiences in a safe and understanding atmosphere, where everyone would be listened to without being judged.  "
        },
        {
            "text": "The support group also provided colleagues with general information about mental health and what help is available through the department, and also to external support pathways, so they could begin taking their own steps towards recovery and good mental wellbeing. "
        },
        {
            "text": "From the start, my vision for the Mental Health Support Group (MHSG) in MHCLG was for it to become a community of members, who support and help each other, sharing what’s troubling them in a safe and confidential environment, exchanging advice on better mental wellbeing, as well as peer advice on support at work. "
        },
        {
            "text": "This year’s World Mental Health Day theme is ‘workplace mental health’. Many of you already know how strongly this resonates within me, and it is something that I have passionately devoted my significant attention to for the last 9 years in this department. "
        },
        {
            "text": "In addition to my ‘day job’ as a DELTA Operations Analyst, I have been deeply involved in mental health initiatives in the department over the past 9 years. I would like to use this blog post to talk about some of those initiatives and share some insights and tips on how employers can support mental health in the workplace. "
        },
        {
            "heading": 2,
            "text": "The challenges of the Covid lockdowns  "
        },
        {
            "text": "My journey in advocating for better mental health in the workplace evolved a few years ago, when I asked to move the monthly in-person MHSG sessions into weekly virtual sessions to support and advise all colleagues in England as we went into lockdown. Since April 2020, the Mental Health Ambassadors and the MHSG team have provided a safe and supportive environment for colleagues to meet, share, and support each other. "
        },
        {
            "text": "The Covid lockdowns, in particular, were a time when the MHSG really thrived due to the many challenges colleagues were facing, as well as the isolation of working from home, which was also felt by many, but also feelings of guilt – guilt because they felt they weren’t able to work to their usual standard, and/or guilt because they felt they were neglecting their family/home responsibilities. The work-life balance was most definitely off-kilter.  "
        },
        {
            "text": "I’m very proud of what the MHSG has achieved so far. Its impactful work was even recognised by the mental health charity Mind, which has showcased it as a case study twice in its prominent publications (the Workplace Wellbeing Index and the Mentally Healthy Universities Programme). "
        },
        {
            "text": "The MHSG sessions run every Wednesday, and we’ve not missed a single week since lockdown started.  "
        },
        {
            "heading": 2,
            "text": "This year’s World Mental Health Day "
        },
        {
            "text": "The theme of this year’s World Mental Health Day, ‘workplace mental health’, is something that our department has already been thinking about and acting upon for many years.  "
        },
        {
            "text": "Mental health problems are very common. Here are some statistics: "
        },
        {
            "text": "In the 2022-23 financial year, the estimated working days lost due to work-related ill health and non-fatal workplace injuries totalled 35.2 million days. More than 875,000 workers suffered from work-related stress, depression or anxiety (new or long-standing). "
        },
        {
            "text": "A total of 17.1 million working days were lost due to work-related stress, depression or anxiety in the 2022-23 financial year, which accounted for 49.4% of all work-related ill health cases and 54.3% of all working days lost due to work-related ill health. This equated to an average of 19.6 days for stress, depression or anxiety lost per case. "
        },
        {
            "text": "It’s estimated that in the 2021-22 financial year, the annual cost of workers suffering from stress, depression or anxiety cost Great Britain £10.58bn. 1"
        },
        {
            "text": "Beyond our successful Mental Health Support Group, MHCLG has also implemented initiatives like Mental Health First Aiders and Mental Health Ambassadors.  "
        },
        {
            "text": "This sets a noteworthy example for other employers, and it enhances our appeal to potential candidates who are looking for their next career move and may consider MHCLG as somewhere they work.  "
        },
        {
            "heading": 2,
            "text": "Strategies for managing mental health in the workplace "
        },
        {
            "text": "In terms of managing mental health in the workplace, there are several key strategies that I would encourage.  "
        },
        {
            "text": "For team members, prioritising self-care routines, including regular breaks and exercise, is crucial. Employers should also encourage open communication with colleagues and make it clear that people can seek support when it’s needed, and that they’re able to make the most of the mental health resources provided by the department. "
        },
        {
            "text": "For line managers, fostering a supportive work environment where mental health is openly discussed is essential. They should be attentive to signs of stress or burnout in team members, and offer guidance, encouraging a healthy work-life balance and leading by example in promoting good mental wellbeing. "
        },
        {
            "heading": 2,
            "text": "Navigating the challenges of remote working and working in small teams "
        },
        {
            "text": "In remote working scenarios, it's vital to establish clear boundaries between work and personal life to maintain balance. Regular online catch-ups can help maintain team cohesion and offer support. "
        },
        {
            "text": "But it’s not just those who work remotely on a regular basis that can feel isolated. In very small teams, isolation can also be a challenge, where team meetings or interactions with colleagues don’t happen as often.    "
        },
        {
            "text": "One way to combat the effects of this is for the workplace to facilitate team-building activities or peer support networks, encouraging open dialogue on mental health within the team, even in one-to-one settings, and providing opportunities for social interaction, whether virtually or in person, to mitigate feelings of loneliness. "
        },
        {
            "heading": 2,
            "text": "Fostering a supportive workplace environment in MHCLG  "
        },
        {
            "text": "In many cases, recovery from a mental health illness is possible; sometimes it’s a one-time permanent recovery and other times it is a lifelong journey to recovery. "
        },
        {
            "text": "By implementing these strategies and fostering a workplace culture that values mental health, organisations like MHCLG can create a supportive and nurturing environment for all employees, ensuring their wellbeing is a top priority not only on World Mental Health Day but also every other single day. "
        }
    ]
}