{
    "url": "https://naturalengland.blog.gov.uk/2024/10/10/reclaiming-the-narrative-celebrating-heritage-and-connection-to-nature/",
    "title": "Reclaiming the Narrative: Celebrating Heritage and Connection to Nature",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Coast and access",
        "Connecting People with Nature",
        "Countryside Code",
        "Education",
        "Mental health and wellbeing",
        "Natural England",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2024-10-10T09:37:27+01:00",
    "content": [
        {
            "text": "Michelle Mangal, Senior Manager, Connecting People with Nature team"
        },
        {
            "text": "As we celebrate Black History Month this October, the theme “Reclaiming the Narrative: Reclaiming Connections with Nature,”  feels more relevant than ever. At Natural England, we’re proud to highlight the fantastic work happening within our organisation that is helping to build and strengthen those connections between communities and the natural world."
        },
        {
            "text": "Communities of colour have long had rich, meaningful relationships with nature, but too often those stories have been overlooked. This month is a chance for us to celebrate that heritage and highlight the work we're doing to reconnect with those traditions."
        },
        {
            "text": "One of our most impactful partnerships has been with Black Girls Hike (BGH), an inspiring group that encourages Black women to get out into the countryside, enjoy the outdoors, and build a sense of belonging in nature. As part of this collaboration, we created a short film to help raise awareness of the Countryside Code. The code is all about helping people enjoy the countryside responsibly by respecting wildlife, leaving no trace, and keeping dogs under control. "
        },
        {
            "text": "Through this project with BGH, we’ve helped to not only spread the word about the Countryside Code but also hopefully encouraged more Black women to reclaim their space in the outdoors. "
        },
        {
            "text": "We’ve also had the pleasure of working with several high-profile influencers as part of the #ChampionYourCode campaign, which highlights the Countryside Code and celebrates the diversity of people who love and protect the outdoors. Wildlife cameraman Hamza Yassin—known for his work on CBeebies as Ranger Hamza and as the winner of Strictly Come Dancing—has been a fantastic ambassador. His passion for wildlife, especially birds, and his advocacy for getting more people outdoors has helped inspire a new generation of nature lovers. His work encourages people of colour, particularly children, to connect with nature in meaningful ways."
        },
        {
            "text": "We’ve also been lucky to work with Alice Dearing, a retired international open-water swimmer who represented Great Britain at the Olympics. Alice is a changemaker as co-founder of the Black Swimming Association, and now as a Champion of the Countryside Code, she continues to encourage diverse communities to engage with nature. Her work has a big impact, particularly in highlighting the need for inclusivity in outdoor and aquatic environments, making sure everyone feels welcome and confident in these spaces."
        },
        {
            "text": "On a local level, earlier this year the East Midlands Area Team invited Yvonne Witter, Chair of Peak District Mosaic, to join The Inclusion Hub, our peer support network that helps individuals and groups make nature recovery more inclusive. Yvonne has been doing pioneering work for years, encouraging Black community groups to enjoy and care for the Peak District National Park. Her energy, insights into relationship-building, and personal connection to nature through her poetry have inspired so many of us. Yvonne’s passion for the natural world and her ability to bring communities together has been invaluable, and her leadership continues to guide us in building more inclusive relationships with underrepresented groups."
        },
        {
            "text": "In addition to these fantastic partnerships, we’ve also been part of projects like Putting Down Routes, a scheme in the Kent Downs Area of Outstanding Natural Beauty that has been working to engage diverse communities, including groups like Black Girls Hike, in exploring and appreciating the countryside. This project is all about encouraging underrepresented groups to feel a deeper connection with nature and providing more inclusive opportunities to enjoy the outdoors. By working with these incredible individuals and groups, Natural England is helping to reclaim the narrative and ensure that the countryside is a welcoming and accessible space for everyone. "
        },
        {
            "text": "This Black History Month, we celebrate these ongoing efforts to reconnect Black communities with nature and promote inclusivity in the spaces we all share. Together, we’re reclaiming those stories, recognising our shared heritage, and building a future where everyone feels at home in nature."
        }
    ]
}