{
    "url": "https://environmentagency.blog.gov.uk/2024/10/10/regulating-the-water-industry-our-approach-what-were-changing-and-new-powers-in-the-water-bill/",
    "title": "Regulating the water industry - our approach, what we’re changing and new powers in the Water Bill ",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-10-10T11:07:27+00:00",
    "content": [
        {
            "text": "As the environmental regulator for England, we are here to protect, support and improve the environment – including our rivers, lakes and seas.  "
        },
        {
            "text": "A key focus for us is driving a step change in performance from the water industry, as set out in our Business Plan earlier this year."
        },
        {
            "text": "Our remit covers thousands of miles of river and coastline in England. We take that responsibility extremely seriously."
        },
        {
            "text": "There are multiple pressures on our waterways including treated wastewater and storm overflows, agriculture and roads."
        },
        {
            "text": "This blog sets out how we are taking action to tackle dry day spills from storm overflows now, and what is changing."
        },
        {
            "text": "Dry day spills  "
        },
        {
            "text": "Water company performance isn’t where it needs to be and a major area for company improvement is in stopping unacceptable ‘dry day spills’."
        },
        {
            "text": "A ‘dry day spill’ is when wastewater enters rivers or seas outside of the conditions in the permit – i.e. under dry conditions. This is defined as less than 0.25mm of rainfall on that calendar day and the previous calendar day. Spills should not happen on those days."
        },
        {
            "text": "We know these spills are occurring because the Environment Agency required water companies to install event duration monitors (EDM) on all storm overflows by the end of 2023, so everyone can see what is going on. Now that we have this data from the monitors, we are using it to take action in a way that we were previously unable to do."
        },
        {
            "text": "Our detailed analysis of 2022 EDM data identified a shocking 20,000 potential dry day spills across over 3,000 assets, and roughly 18,000 spills from the same number for 2023."
        },
        {
            "text": "This should not be happening. While there are exceptions – such as in large areas where the water takes a long time to drain down from where it landed upstream down into the pipes – it is very clear that these spills are happening too often."
        },
        {
            "text": "As you would expect, we treat all dry day spills as a potential breach pending further investigation. "
        },
        {
            "text": "Our current approach  "
        },
        {
            "text": "Further investigation is always required on ‘dry day spills’ as we need to have a certain level of evidence to take enforcement action, whether criminal or civil. Given the volume of potentially illegal dry spills, the EA is prioritising investigations in areas of the environment most at risk, including sites of special scientific interest and bathing waters. Our investigations will often include a site inspection and a requirement for the company to provide detailed evidence on the spill in question.  "
        },
        {
            "text": "We base our decisions for enforcement action on many factors including harm, culpability, severity of breach and previous performance by the company. Our enforcement and sanctions policy sets out more detail on this."
        },
        {
            "text": "Our enforcement action so far has already led to over £151m in fines since 2015, but also many instances where water companies have improved water systems to prevent spills from happening in the first place. We are also conducting our largest ever criminal investigation into potential widespread non-compliance by water companies at thousands of sewage treatment works. "
        },
        {
            "text": "What is changing?  "
        },
        {
            "text": "The scale of the problem that has been uncovered by storm overflow monitoring means we are acting now to change our approach. To take action on dry spills we currently need to gather the data from water company monitors and assess thousands of lines of data. This analysis will be made significantly easier by the commitment secured from water companies to publish near real-time sewage maps from January 2025."
        },
        {
            "text": "This will allow us to see spills as and when they happen, rather than through data submitted annually. We’re investing around £15 million on enhancing our digital systems and tools. Data and information from lots of sources will be combined to turn data rapidly into regulatory intelligence to easily identify and tackle the highest priority issues."
        },
        {
            "text": "We are also"
        },
        {
            "text": "These additional resources will be used to investigate pollution incidents across the water industry and other areas the EA regulates, to ensure parts of the environment that are most at risk of harm are protected."
        },
        {
            "text": "The government has recently introduced new legislation – the Water (Special Measures) Bill. Most importantly for us, it will introduce new powers to bring automatic and severe fines for pollution and water resources offences.This means we can impose penalties more easily and quickly, without having to direct significant resources to lengthy investigations."
        },
        {
            "text": "As the Bill progresses, we will consider the wider impacts to the water industry and ensure that these penalties provide an appropriate deterrent to drive improved performance. Prosecution and civil sanction options will remain for the most serious offences."
        },
        {
            "text": "Other measures in the Bill include:  "
        },
        {
            "text": "We will always play our part to hold companies to account if they don’t comply with environmental laws, providing stronger protection to the environment, communities and nature. "
        }
    ]
}