{
    "url": "https://civilservice.blog.gov.uk/2026/02/20/a-message-from-the-cabinet-secretary/",
    "title": "A message from the Cabinet Secretary",
    "authors": [
        "Antonia Romeo, Cabinet Secretary and Head of the Civil Service"
    ],
    "categories": [
        "Civil Service Leaders"
    ],
    "pub_date": "2026-02-20T13:21:52+00:00",
    "content": [
        {
            "text": "Dame Antonia Romeo was appointed as the Cabinet Secretary and Head of the Civil Service on 19 February 2026. In her first message to the organisation, she set out her reflections on the role and her pride in public service."
        },
        {
            "text": "Dear colleagues,"
        },
        {
            "text": "I still remember my first day in the Civil Service, 25 years ago. I was an economist on a temporary contract, with limited understanding of what the Civil Service was or what it did - just a powerful belief that government could change lives for the better. 25 years later, I hold that same belief more strongly than ever."
        },
        {
            "text": "The Civil Service is a remarkable institution, which I love. I’ve had the privilege of working in some extraordinary departments on some extraordinary things: from global trade negotiations to courts and prisons, from economics to national security. I’ve seen first-hand the expertise and commitment of colleagues - in frontline services, across departments and agencies, and across the country. So it is with a profound sense of pride that I take up this role as your Cabinet Secretary and Head of the Civil Service. I don't take this responsibility lightly."
        },
        {
            "text": "Our job is to deliver for the Government. I want us to be known for excellence in delivery, and to serve the government with purpose, and with the pride that comes from high-performance. The Prime Minister has an ambitious agenda for the country that will require us to work at pace, collaboratively, and with agility. The challenges facing our country are significant and the public's expectations of us are, rightly, high. Everything we do should move us closer to the outcomes that matter for the public. We must be curious about why we are doing what we are doing, and relentless in scrutinising our performance and removing barriers to delivery."
        },
        {
            "text": "The Civil Service has deep skills and expertise, but we need to continue to modernise and innovate. I have spent much of the past five years talking to civil servants across the country about what they want from the Civil Service. What you have told me is that you want to change the things that get in the way of you doing your jobs. You want us to be more productive, to do things differently. You want to be proud of what you achieve. Civil Service modernisation needs to embrace your ideas and have innovation at its core."
        },
        {
            "text": "I have given my career to public service because I care passionately about the country and the importance of democracy. No one will be a stronger advocate of the Civil Service than I am. I will stand up strongly for the Civil Service and I will work with you all to maintain and build trust in our institution. In 25 years I have seen civil servants respond to huge challenges with creativity, resilience, and determination. I know what we can achieve together."
        },
        {
            "text": "Finally, my commitment to you as your Cabinet Secretary is to provide the energy, direction and support you need to excel. I will always take pride in what we do. You do some of the hardest jobs in the country - and you do them because they are hard, not in spite of them being hard."
        },
        {
            "text": "That is the heart of public service. Every single person in the country, every day, depends on our work. That should be a matter of pride for us all, and something we should all carry with us."
        },
        {
            "text": "I’m looking forward to working with you."
        },
        {
            "text": "Antonia"
        },
        {
            "heading": 4,
            "text": "Dame Antonia Romeo"
        },
        {
            "heading": 4,
            "text": "Cabinet Secretary and Head of the Civil Service"
        }
    ]
}