{
    "url": "https://space.blog.gov.uk/2026/02/20/uk-backed-space-weather-mission-sets-sail-for-launch-site/",
    "title": "UK-backed space weather mission sets sail for launch site",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Astronomy",
        "Delivering Missions and Capabilities",
        "Protecting our planet and outer space"
    ],
    "pub_date": "2026-02-20T10:33:18+00:00",
    "content": [
        {
            "text": "A landmark joint European-Chinese space mission, with significant UK involvement, has departed Europe for its launch site in French Guiana ahead of a planned April launch. "
        },
        {
            "text": "The SMILE spacecraft — the Solar wind Magnetosphere Ionosphere Link Explorer — left ESA’s technical centre in the Netherlands on 11 February, travelling by truck to the Port of Amsterdam before setting sail aboard the cargo ship Colibri. The vessel, which also transported the James Webb Space Telescope in 2021, is carrying the spacecraft across the Atlantic Ocean and is expected to arrive before the end of February. "
        },
        {
            "text": "SMILE has a launch window of 8 April to 7 May 2026, when it will lift off on a Vega-C rocket. Once in orbit, it will give scientists their first complete picture of how Earth responds to the solar wind — the streams of particles and bursts of radiation constantly emitted by the Sun. "
        },
        {
            "heading": 3,
            "text": "UK at the heart of the mission "
        },
        {
            "text": "The UK has played a central role in SMILE, with British researchers leading the soft X-ray imager (SXI) instrument — one of four scientific instruments aboard the spacecraft — and co-leading the overall mission science. UK companies Teledyne e2v and Photek Ltd have also made vital hardware contributions to the mission. "
        },
        {
            "text": "Read more about UK involvement in Smile."
        },
        {
            "heading": 3,
            "text": "The journey to space "
        },
        {
            "text": "The Colibri is carrying 12 containers of spacecraft equipment and a small team of European and Chinese mission specialists. To keep the spacecraft in perfect condition during the voyage, its container is continuously flushed with nitrogen to remove oxygen, water vapour and other potential contaminants, with temperature, pressure and humidity monitored throughout. "
        },
        {
            "text": "On its way south, the ship made a stop in Saint Nazaire, France, to collect the Vega-C upper stage that will carry SMILE into orbit — meaning the rocket and spacecraft will make the final leg of the sea journey together. "
        },
        {
            "text": "Once the ship docks in Kourou, engineers from both Europe and China will begin final launch preparations, including unpacking, testing, fuelling, and mating the spacecraft to its rocket. "
        },
        {
            "heading": 3,
            "text": "About SMILE "
        },
        {
            "text": "SMILE is a joint mission between the European Space Agency (ESA) and the Chinese Academy of Sciences (CAS). It will use four science instruments — including ultraviolet and soft X-ray cameras, as well as particle and magnetic field detectors — to study how Earth's magnetic environment responds to the solar wind. The mission forms part of ESA’s Cosmic Vision programme. "
        }
    ]
}