{
    "url": "https://civilservicelocal.blog.gov.uk/2021/10/18/addiction-awareness-mental-health-and-well-being/",
    "title": "Addiction Awareness Mental Health and Well-being",
    "authors": [
        "Heather Flanagan"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-10-18T10:29:12+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Alcohol awareness week is 15 to 21 November and the theme is alcohol and relationships. This made me think. There are so many more addictions that have an impact on your mental health, well-being and relationships with family, friends and or colleagues."
        },
        {
            "text": "As a Scottish citizen I am aware that Scotland has a troubled relationship with both alcohol and drug use. In the media we have all seen reports on substantially increased alcohol consumption levels, and consequently high levels of alcohol-related harm during the past 18 months "
        },
        {
            "text": "The UK has the highest prevalence of drug misuse in Europe, with approximately one third of all adults in England and Wales reported to have used drugs at least once in their lifetime"
        },
        {
            "text": "Addiction is a chronic psychiatric disease, where there is dysfunction in the brain reward and memory system. The addiction forces the individual to pursue reward via substance use."
        },
        {
            "text": "With this in mind I have reached out to external stakeholders who have agreed to provide civil servants with an insight on how to spot signs and symptoms of addiction and where to get help and support. Everyone is welcome to join, all you have to do is register for the events below using your Civil Service email address, please seek approval from your line manager to attend."
        },
        {
            "text": "The sessions will all be on MS Teams."
        },
        {
            "text": "CS Local Scotland Well-being network would love to hear from you if you are interested in becoming a member or if you have any questions about the events listed please email the team CSLocalScotlandandNorthernIreland@cabinetoffice.gov.uk"
        }
    ]
}