{
    "url": "https://homeofficemedia.blog.gov.uk/2021/10/18/factsheet-prevent-and-channel-2021/",
    "title": "FACTSHEET: Prevent and Channel - 2021",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2021-10-18T16:14:04+01:00",
    "content": [
        {
            "text": "Due to recent media interest in Prevent, the following information has been updated to provide factual background on the programme. "
        },
        {
            "text": "What is the Prevent programme?"
        },
        {
            "text": "The early intervention support provided by Prevent addresses the personal and social factors which make people more receptive to radicalisation, diverting people away from being drawn into violent ideologies and criminal behaviour."
        },
        {
            "text": "The programme:"
        },
        {
            "text": "What is a Prevent referral?"
        },
        {
            "text": "A Prevent referral can be made by anyone who is concerned about someone they know being at risk of radicalisation or drawn into terrorism. This could be a family member, friend, colleague, or a professional."
        },
        {
            "text": "If an individual is found to represent a security threat, they will always be referred to the police for further investigation."
        },
        {
            "text": "Prevent referrals are not made to the Home Office; they are handled by expert officers in the local police force."
        },
        {
            "text": "When a referral is made, initial checks will be conducted and if the individual is found to not be at risk of radicalisation, the case is immediately closed to Prevent."
        },
        {
            "text": "Making a referral"
        },
        {
            "text": "If someone is worried about another individual becoming radicalised and would like to seek advice before making a referral, they can contact their local authority safeguarding team, or speak to a teacher, healthcare provider or another trusted authority. Contacting the authorities will not get the person into trouble if a criminal act has not been committed. The local authority or police can discuss concerns, suggest how they can best help and provide access to relevant support and advice."
        },
        {
            "text": "Alternatively, people can visit Counter Terrorism Policing’s safeguarding website, ACT Early or call the national police Prevent advice line on 0800 011 3764 to discuss their concerns."
        },
        {
            "text": "Teachers and parents can also learn more on the Educate Against Hate website."
        },
        {
            "text": "What is Channel?"
        },
        {
            "text": "If the referral progresses and it is assessed that there is a genuine risk of radicalisation, the case is considered by a multi-agency ‘Channel Panel’ of safeguarding professionals who collectively assess the risk to a person and decide on a tailored package of support that can be offered to the person to help them move away from harmful activity."
        },
        {
            "text": "The Channel panel is chaired by the local authority and can include a variety of partners such as the police, children’s services, social services, education professionals and mental health care professionals."
        },
        {
            "text": "What kind of support is offered via Channel?"
        },
        {
            "text": "If a Channel intervention is required, a tailored support package will be offered. This could include mentoring, theological guidance, education, and careers assistance to those assessed as being at risk of radicalisation and requiring support. This is known as Channel in England and Wales, and Prevent Multi-Agency Panels (PMAP) in Scotland."
        },
        {
            "text": "Channel is voluntary and people who are referred to Prevent must give consent (via a parent or guardian if they are underage) before they can be given support."
        },
        {
            "text": "If a person does not engage with Channel or decides not to continue with the process for any reason, alternative forms of support may be available from the local authority or other providers. Any risks are then carefully managed by the police."
        },
        {
            "text": "Key statistics and facts"
        },
        {
            "text": "Since the introduction of the Prevent Duty in 2015, 3,037 referrals have been supported through the Channel Programme. Channel aims to move vulnerable individuals away from violent ideologies that could have resulted in harm to themselves. 4,915 referrals to Prevent were made in the year ending on 31 March 2021."
        },
        {
            "text": "This represents a decrease of 22% compared to the previous year (6,287) and the lowest number of referrals received since comparable data are available (year ending March 2016). This decrease is likely to have been driven by the effects of public health restrictions that were in place throughout the year to control the spread of the COVID-19 virus."
        },
        {
            "text": "Of all the referrals in 2020/2021:"
        },
        {
            "text": "* Mixed, unstable or unclear reflects instances where the ideology presented may involve a combination of elements from multiple ideologies (mixed), shift between different ideologies (unstable), or where the individual does not present a coherent ideology yet may still be vulnerable to being drawn into terrorism (unclear)."
        },
        {
            "text": "There were 688 referrals adopted as a case in the year ending March 2021, four less cases compared with the previous year (692). 14% of referrals to Prevent were adopted as a Channel case, up from 11% of referrals adopted in the previous year (692 of 6,287)."
        },
        {
            "text": "Prevent addresses all forms of terrorism. Of all the Channel cases adopted in 2020/2021:"
        },
        {
            "text": "Prevent makes up an extremely small part of overall safeguarding referrals. In 2018-19, over one million safeguarding referrals were made, in comparison to just 6,287 Prevent referrals in 2019-20 and 4,915 in 2020-21."
        },
        {
            "text": "A network of partners delivers Prevent in local communities"
        },
        {
            "text": "Statutory partners: Under the 2015 Prevent duty, institutions including schools, colleges, universities, health, local authorities, police, and prisons must consider the risk of radicalisation as part of their day-to-day safeguarding work. This duty is in line with these institutions’ other safeguarding obligations and means having ‘due regard’ to the need to prevent people from being drawn into terrorism. The duty has been supported with guidance for each sector and a dedicated package of training and support."
        },
        {
            "text": "Prevent coordinators: They oversee delivery of the programme locally in areas where the threat from terrorism and radicalisation is assessed to be the highest, collaborating with partners to understand and respond to local risks. To support local authorities without dedicated Prevent Coordinators, the Home Office fund Regional Advisors to help improve Prevent delivery in these areas."
        },
        {
            "text": "Civil society organisations: Prevent provides funding for a wide range of organisations across the country. Projects include a variety of initiatives, such as critical thinking workshops, the use of sport as intervention and online safety training for parents. This empowers and builds resilience in communities enabling them to challenge extremism and terrorism wherever it tries to take root. Prevent supported 225 community-based projects in 2020/21, reaching over 133,000 participants including children, young people, teachers, parents, carers, and frontline staff."
        },
        {
            "text": "Rehabilitation"
        },
        {
            "text": "The Desistance and Disengagement Programme (DDP) works with individuals who have crossed the line into terrorist activity, aiming to reduce the risk they pose to the UK. The programme works by providing intensive, tailored interventions which support them to stop engaging in terrorist related activity (desist) and to move away from terrorist ideology (disengage)."
        },
        {
            "text": "The programme runs alongside existing statutory risk assessment and management processes such as the Multi Agency Public Protection Arrangements (MAPPA) for managing offenders, to ensure it bolsters and complements work being done through existing frameworks. It is not a replacement for any police investigation or prosecution on individuals who have committed terrorism offences, either abroad or at home."
        }
    ]
}