{
    "url": "https://mhclgdigital.blog.gov.uk/2021/10/18/how-our-training-offer-is-supporting-local-government/",
    "title": "How our training offer is supporting local government with day-to-day working",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Training"
    ],
    "pub_date": "2021-10-18T10:47:52+01:00",
    "content": [
        {
            "text": "It’s been seven months since we launched an online library of training courses to support our local government colleagues to develop their digital skills while working remotely. In that time, we’ve had 218 applications from people working in more than 100 councils for more than 40 courses."
        },
        {
            "text": "The training library is built around a selection of funded courses, carefully chosen based on the needs of local government staff, that people can apply to and which are paid for in full by the Department for Levelling Up, Housing & Communities (DLUHC). The courses are provided by FutureLearn, an online learning platform that offers flexible, virtual training from world class universities and industry experts."
        },
        {
            "heading": 2,
            "text": "Why we designed this training offer"
        },
        {
            "text": "The training offer forms part of the department’s commitment to supporting councils to develop their digital capability through the principles set out in the Local Digital Declaration."
        },
        {
            "text": "By providing these funded training opportunities, our goal is to help councils accelerate their digital transformation journey, grow awareness of digital ways of working (such as agile), and acquire the skills they need to move away from legacy software to modern tools and platforms."
        },
        {
            "heading": 2,
            "text": "How the training offer is supporting local government staff with skills they can use day-to-day"
        },
        {
            "text": "To date, around 13% of applicants have told us that they signed up to learn practical digital skills that will help them with their day-to-day work, such as collaborative coding and accessibility skills. A further 19% of applicants had a specific project or problem that they believed the course would help them with."
        },
        {
            "text": "We’ve been keeping a close eye on course uptake to make sure that the offer continues to meet the needs of people working in local government. This includes checking in with some of our local government colleagues to find out what they’ve learned and how the training they received has benefited them in their role."
        },
        {
            "text": "For this blog post, we spoke to three people about their experiences and how the training they received is supporting their work."
        },
        {
            "text": "Learning about your experiences really helps us to learn and improve our training offer for local government. If you’d like to provide feedback or thoughts on any aspect of our training, please let us know at skills@localdigital.gov.uk."
        },
        {
            "heading": 3,
            "text": "Tass Smith, Transformation Lead at Warwick District Council"
        },
        {
            "text": "Tass has taken two courses with FutureLearn, including Introduction to User Experience Principles and Processes."
        },
        {
            "heading": 4,
            "text": "Why did you choose to do this course?"
        },
        {
            "text": "Tass: “I kept hearing about Human Centred Design (HCD) but didn’t have the chance to really see it in action. It’s one thing knowing a phrase, but how do you actually do it in practice and what's it all about? This course had some examples of how other people had used HCD, which was useful, and then there were little projects and activities to take you through design thinking.”"
        },
        {
            "heading": 4,
            "text": "What is the key thing you took away from this course?"
        },
        {
            "text": "Tass: “You need to understand if the problem you’re trying to solve is the right problem or if it’s just a symptom of another problem. In the ‘Introduction to User Experience’ course, I learned how prototyping and empathy maps can help you to understand the actual problem before you jump in.”"
        },
        {
            "heading": 4,
            "text": "How are you using what you’ve learned in your day-to-day role?"
        },
        {
            "text": "Tass: “At the time I was doing this course I started a discovery, and it was the first discovery I’ve ever done. Having that bit of training gave me the confidence that we definitely needed to do a discovery instead of launching straight in to solve a problem. It gave me permission to step back from the problem being presented, to peel back the layers and understand what the core problems might be.”"
        },
        {
            "heading": 3,
            "text": "Kevin Buckthorpe, Planning Digital Project Lead at Buckinghamshire Council (partner council for Local Digital funded projects RIPA and BOPS)"
        },
        {
            "text": "Kevin has taken three courses with FutureLearn, including Managing Innovation: Learning to prototype for business and Decision making: Choosing the right problem to solve."
        },
        {
            "heading": 4,
            "text": "What did you enjoy the most and why?"
        },
        {
            "text": "Kevin: “I really enjoyed the prototyping course, I found the content good and the presenters cool. They had little intro videos and engaged you with what they were trying to teach."
        },
        {
            "text": "“I’ve already used some of the skills I learned on the course. For example, they taught something called the ‘SPIN’ process, which stands for Situation, Problem, Implication and Need. It involves getting customer feedback and going back again, understanding what the user needs me to build for them. I hadn’t heard of that before. It gives you a technique to understand what users actually require - which is really cool. That’s been a problem for planning over the years; we build stuff that we believe is the solution rather than what users actually need.”"
        },
        {
            "heading": 4,
            "text": "How are you using what you learned in your day-to-day role?"
        },
        {
            "text": "Kevin: “I enjoyed the decision making course because it built on the prototyping course and gave me tools to prioritise work. I found the Product Value Matrix really useful, to work out what’s high value and low value, high complexity and low complexity. We’ve taken that into our work, to prioritise our backlog in Trello. If a task is high value and low complexity, that means we can deliver it easily, whereas tasks that are complex but high value become a separate project.”"
        },
        {
            "heading": 3,
            "text": "Maxine Simons, Digital Designer at Huntingdonshire District Council"
        },
        {
            "text": "Maxine has taken one course with FutureLearn, Create Accessible Interfaces, and has already signed up for another."
        },
        {
            "heading": 4,
            "text": "What prompted you to apply for training?"
        },
        {
            "text": "Maxine: “My role is a new role, and it’s a little bit of a hodge podge, but fundamentally it’s to make any digital offering that the council provides as user friendly as possible, and to make sure that people can engage with the council easily. This is my first time doing this work, it’s new and it’s varied and that’s why I like the courses offered in the Local Digital Training Library."
        },
        {
            "heading": 4,
            "text": "What did you learn on this course?"
        },
        {
            "text": "Maxine: “The ‘Create Accessible Interfaces’ course makes you consider accessibility issues as central to the design process - it’s often considered an add-on and it shouldn’t be. Part of the course included building an accessible web page, taking you through stylesheets, CSS and HTML, all done through a platform called Mimic. I also learned about WCAG and W3 as well as government guidelines for accessibility.”"
        },
        {
            "heading": 4,
            "text": "How are you using what you’ve learned in your day-to-day work?"
        },
        {
            "text": "Maxine: “I’ve applied some of what I learned already. We’ve moved to a sign-in portal, which meant we needed to transfer our website forms onto eforms. Previously these would have just been copied over exactly as they had been. I completed a forms review and went through everything that could be updated or changed to be more accessible."
        },
        {
            "text": "“I have made a number of recommendations for improvements to the accessibility, including changes to the contrast options and language of the forms, as a lot of the language was too advanced. I also recommended changes to the layout so that the information isn’t so close together and more readable. Little things like that.”"
        },
        {
            "heading": 2,
            "text": "How you can get involved in our training offer"
        },
        {
            "text": "We only have a limited number of funded places left, so make sure you take advantage of this opportunity to brush up on your existing digital skills or learn something new! Visit the Local Digital training library and browse for FutureLearn courses using the ‘LDCU funded’ filter."
        },
        {
            "text": "If you’ve recently completed a course, remember to have your say by filling out the feedback form you have been emailed. Your feedback will play an important role in helping to shape the future of our training offer."
        },
        {
            "text": "If you have any more general feedback about the courses or our training offer, please email skills@localdigital.gov.uk."
        }
    ]
}