{
    "url": "https://vets.blog.gov.uk/2021/10/18/job-vacancy-head-of-animal-welfare-and-delivery-assurance/",
    "title": "Job Vacancy: Head of Animal Welfare and Delivery Assurance",
    "authors": [
        "Blog team"
    ],
    "categories": [
        "Jobs and Experiences"
    ],
    "pub_date": "2021-10-18T15:36:38+01:00",
    "content": [
        {
            "text": "I should like to draw your attention to a veterinary related vacancy within the Food Standards Agency (FSA) for an exciting leadership position.  The role provides for a mix of strategy, policy, change management, operational delivery, and assurance."
        },
        {
            "text": "As a member of the Operations Assurance and Transformation (OAT) management team you will provide direct leadership for three teams. In addition, you will also contribute to the strategic leadership across wider operational and policy areas. This is a great opportunity for a veterinary professional to demonstrate their transferrable skills and ability, underpinned by their veterinary knowledge and experience, for leading delivery of the “Deter, Prevent, Detect, Enforce” animal welfare programme, developing the FSA’s strategy to improve animal welfare and ensure FSA policy interests are effectively represented in negotiations with Defra, Welsh Government and industry."
        },
        {
            "text": "Alongside delivering the animal welfare programme you will have responsibility for the operational delivery of major operational contracts, service level agreements and lead on central assurance of operational performance and planning."
        },
        {
            "text": "If you are an effective communicator and leader, capable of inspiring teams to achieve the timely delivery of quality work to the very highest standards, the FSA would like to hear from you."
        },
        {
            "text": "Completed applications need to be submitted before 11:55 pm on Sunday 31st October 2021."
        },
        {
            "text": "Further information for the vacancy can be found on Civil Service Jobs at the following link: Head of Animal Welfare and Delivery Assurance.  Alternatively, richard.wynn-davies@food.gov.uk and/or darren.whitby@food.gov.uk would be happy to discuss the role further with potential applicants."
        },
        {
            "text": "Good luck!"
        }
    ]
}