{
    "url": "https://prisonjobs.blog.gov.uk/2022/08/09/career-journeys-pqip-and-beyond/",
    "title": "Career journeys: PQiP and beyond",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "PQiP",
        "Probation"
    ],
    "pub_date": "2022-08-09T17:10:44+01:00",
    "content": [
        {
            "heading": 3,
            "text": "A career in the Probation Service can take you in many directions. Through the PQiP programme, you will start your career as a trainee probation officer but from there it’s for you to decide which path you take.  "
        },
        {
            "text": "We bring you stories from our colleagues Jenny, Naden and Leanne as they give an overview of how their careers have progressed since completing their PQiP training. Reflecting on their experience and time in the Probation Service, they also offer their top tips for anyone joining the programme. "
        },
        {
            "heading": 3,
            "text": "Jenny McKie "
        },
        {
            "text": "Joining PQiP  "
        },
        {
            "text": "Jenny decided to pursue a career in the Probation Service while working in a hostel for disabled people, as she found she enjoyed working with and supporting people.  "
        },
        {
            "text": "Jenny stepped into the Probation Service in 1992 through a part-time role supporting the Thinking Skills programme. After several years in part-time roles in the Probation Service, Jenny joined the PQiP programme in 1999, becoming a trainee probation officer. "
        },
        {
            "text": "Following PQiP  "
        },
        {
            "text": "Jenny became a qualified probation officer in 2001, taking a job in a Specialist Women’s Team in Southampton. After two years, she moved to a Youth Offending. "
        },
        {
            "text": "In 2005, Jenny became a senior probation officer and moved into a new role working in Approved Premises - a standout in her career. She loved working with the people living in the premises, getting to know them and building the trust which enabled her to make a difference in their lives. "
        },
        {
            "text": "Jenny worked in Approved Premises for 13 years before deciding to move to the Courts Team in 2018. "
        },
        {
            "text": "The probation officers Jenny worked with when she first joined the PQiP programme proved to be a huge influence on her career. Their work ethic, knowledge and professionalism taught Jenny a lot and ultimately inspired her to share her own experiences and knowledge with the next generation of trainee probation officers. Jenny has since encouraged several probation service officers (PSO) to join the programme, who have now gone on to become probation officers themselves."
        },
        {
            "text": "Where are they now? "
        },
        {
            "text": "Jenny is now a senior probation officer in the Courts Team, Southampton. "
        },
        {
            "text": "Jenny’s advice:  "
        },
        {
            "heading": 3,
            "text": "Naden Friend "
        },
        {
            "text": "Joining PQiP  "
        },
        {
            "text": "Naden started working in the Probation Service as a trainee probation officer in 2007 through the PQiP programme. Two years later, he completed the programme, achieving a Bachelor of Arts degree as part of his Diploma in Probation Studies. "
        },
        {
            "text": "Following PQiP "
        },
        {
            "text": "Once qualified, Naden joined the Community Offender Management Team in Bexleyheath Probation Office as a probation officer in 2009. "
        },
        {
            "text": "In 2011, he continued his probation officer role and took a two-year secondment with Bexleyheath Youth Offending Service. Naden found this role hugely rewarding as he enjoyed working collaboratively for the support of the young people he worked with. "
        },
        {
            "text": "Another two years followed as a probation officer in Youth Offending Institute (YOI) Custody at HMP YOI ISIS. "
        },
        {
            "text": "In 2015, Naden was promoted to senior probation officer and began working in Custody at HMP YOI ISIS. Three years later, Naden moved to Lewisham Probation Office as a senior probation officer in a community-based team for a year."
        },
        {
            "text": "Where are they now? "
        },
        {
            "text": "In 2020, Naden began his current role as a Probation Learning Manager at Mitre House in London. "
        },
        {
            "text": "Naden’s advice: "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Leanne Barnett "
        },
        {
            "text": "Joining PQiP  "
        },
        {
            "text": "Leanne joined the Probation Service having completed a Psychology and Criminology degree at Keele University. "
        },
        {
            "text": "As part of her PQiP training, Leanne completed a two-year Crime and Community Justice degree and a vocational qualification at De Montford University. This included a Court placement and working on the Drink Impaired Drivers programme. "
        },
        {
            "text": "Following PQiP  "
        },
        {
            "text": "Once qualified, Leanne spent the next 10 years working as a probation officer and mentored many trainee probation officers as they start their careers in the Probation Service. "
        },
        {
            "text": "While Leanne loves all aspects of her work in the Probation Service, being promoted to senior probation officer was a particular highlight as it gave her the opportunity to lead a team. "
        },
        {
            "text": "As a senior probation officer, Leanne led an integrated offender management team, involving multi-agency partnership working with police, mental health and substance use services. She also became a PRISM (PRomoting Inclusion Staff Mentoring programmes) mentor. "
        },
        {
            "text": "Leading her team for four years, Leanne met great people from who she learned a lot and felt honoured to support them to develop their own careers. Leanne secured a Deputy Head secondment as an Operational Policy Officer in Ministry of Justice’s Prison’s Leavers Project where she works up to a year. She went on to gain a permanent band 6 Deputy Head position in Walsall and Wolverhampton PDU. "
        },
        {
            "text": "Where are they now? "
        },
        {
            "text": "Leanne is three years into a chartered management degree apprenticeship. She is now based in stoke and Stafford PDU as Deputy Head of Stoke. "
        },
        {
            "text": "Leanne’s advice: "
        },
        {
            "text": " "
        }
    ]
}