{
    "url": "https://designnotes.blog.gov.uk/2022/08/09/content-crits-theyre-not-scary/",
    "title": "Content crits: they're not scary!",
    "authors": [
        "Virginia Brown – Senior Content Designer, Department for Education"
    ],
    "categories": [
        "Content Design"
    ],
    "pub_date": "2022-08-09T09:00:16+01:00",
    "content": [
        {
            "text": "Content critiques, or crits, are when a content designer shares a piece of work with their peers to get feedback. "
        },
        {
            "text": "The idea is you share an unfinished piece of work early on before you get too attached to your creation.  "
        },
        {
            "text": "A content crit is a great opportunity to check in with other content designers who are not too close to the project you’re working on."
        },
        {
            "heading": 2,
            "text": "Sharing your work makes it better"
        },
        {
            "text": "We’re taught throughout our education and work life to only show a finished product. However, working as a content designer in the user-centred design space especially in government we are encouraged to work transparently. "
        },
        {
            "text": "Working in content design changes your way of thinking. The words don’t belong to you. The ideas need to work for the users so there is no point working away in isolation to present something untested that doesn’t work. "
        },
        {
            "text": "I’ve told my team on many occasions it’s better to fail fast. This means sharing ideas early and often to ensure we’re doing something that makes sense. "
        },
        {
            "text": "Accepting feedback from their peers takes some practice. A regular space dedicated to a content crits helps this. "
        },
        {
            "heading": 2,
            "text": "Creating the right environment "
        },
        {
            "text": "In the Apprenticeships Service we introduced twice weekly, 30 minute content crits. It’s really important to create a safe, judgement-free zone for content crits. "
        },
        {
            "text": "Before these sessions we didn’t have any dedicated time set aside for crits which meant crits didn’t happen. Now, the content designers on the service know there is always dedicated time available to share work in a safe space to receive feedback and share ideas. "
        },
        {
            "text": "We encourage the content designers to share content that isn’t complete. It’s much better to share content that is still in draft and before you become too attached to what you are creating."
        },
        {
            "heading": 2,
            "text": "Finding a pattern that works for you"
        },
        {
            "text": "Before we had the twice weekly session in place I ran a trial with the content designers on the service of having daily content crits. "
        },
        {
            "text": "For two weeks we trialled daily 30 minute crits in the afternoon. Initially it was great as the team were keen to share ideas, however after the first few days it was clear daily crits were too much. Especially because people are busy with other meetings such as sprint retros, stand ups and the other meetings that take up time. "
        },
        {
            "text": "Also there was a limit on how much the content designers could share depending on what phase their project was in. There is a lot more to share in the alpha and beta phases of a project compared to discovery. "
        },
        {
            "heading": 2,
            "text": "How content crits help with the wider delivery team"
        },
        {
            "text": "In the Apprenticeships Service most of the teams are aware that we have dedicated time set aside for content crits.  "
        },
        {
            "text": "Often delivery managers actively asked content designers to take something back for a crit. "
        },
        {
            "text": "Sharing the feedback from other content designers gives product owners and delivery managers the reassurance that a content decision has been reviewed by other professionals."
        }
    ]
}