{
    "url": "https://insideDIO.blog.gov.uk/2022/08/09/dios-respect-the-range-campaign-takes-to-the-beach/",
    "title": "DIO’s Respect the Range campaign takes to the beach",
    "authors": [
        "Spencer George"
    ],
    "categories": [
        "Armed Forces",
        "Defence Training Estate (DTE)",
        "Training Estate Public Safety"
    ],
    "pub_date": "2022-08-09T14:36:49+00:00",
    "content": [
        {
            "text": "The 100m Chinook sand artwork on Saunton Sands beach, north Devon [Crown Copyright / MOD 2022]Last week, I had the pleasure of visiting Saunton Sands beach, near Braunton Burrows Training Area to launch the 2022 ‘Respect the Range’ Campaign. The launch saw the creation of a 100m Chinook helicopter sand artwork that generated national media coverage for this important safety campaign."
        },
        {
            "text": "About the Respect the Range campaign"
        },
        {
            "text": "I’ve been involved with the Training Estate Public Safety (TEPS) campaign since its inception in 2020. It’s an initiative that encourages users of the military training estate to do so with caution, and to be aware of the risks they face to their personal safety."
        },
        {
            "text": "When I joined DIO, I was astounded to discover that thousands of people enter areas of the military training estate where they shouldn’t be every year. More worryingly, hundreds come within close proximity to live training. It’s a testament to our safety marshals, Defence Training Estate staff and Landmarc colleagues that the vast majority are seen and moved on before they are injured (or worse)."
        },
        {
            "text": "Respect the Range is a multi-faceted behavioural change campaign, and is the most challenging I’ve worked on in my career due to the many varied audiences we need to reach and persuade with our messaging. Following a successful pilot in 2021, the campaign has this year been extended to several UK coastal locations shared by the public and the military, including Lulworth, Lydd & Hythe, Donna Nook & Holbeach and Barry Buddon. We are also continuing our work targeting the Salisbury Plain and Aldershot training areas."
        },
        {
            "text": "Military training areas that are shared with the public can quickly become dangerous, so it's important to access them safely and responsibly. [Crown Copyright / MOD 2022]The campaign draws upon the mutual respect that exists between the public and our Armed Forces. The public respect the military’s need to train and prepare for deployment, and we respect the public’s desire to explore and enjoy the Defence estate, much of which has public access. This enables people to discover some of the most beautiful and unique rural areas in the UK."
        },
        {
            "text": "Launching the 2022 campaign"
        },
        {
            "text": "We wanted to ensure maximum coverage for our campaign launch, so we chose an area popular with holiday makers near an active training area in north Devon."
        },
        {
            "text": "Saunton Sands beach was the perfect location, allowing us to engage with our target audience of tourists on a coastal holiday. We interrupted their holiday in a way that captured their imagination, while also attracting the attention of national and regional news outlets with our impressive sand art."
        },
        {
            "text": "Working with a fantastically talented company called Sand in Your Eye, our plan was two-fold. Firstly, to engage with beach-goers using a sand sculpture of a Type 2 Challenger tank as an eye-catching conversation starter. Secondly, to produce a giant, visually stunning piece of sand artwork that would capture media interest and provide a platform to share our campaign’s key safety messages."
        },
        {
            "text": "The Challenger 2 tank sculpture, created as part of the campaign launch event [Crown Copyright / MOD 2022]I hope you’ll agree the end results are really impressive and they allowed us to engage with hundreds of people including locals, visitors, Army veterans, families and young children."
        },
        {
            "text": "The Chinook sand drawing was simply stunning. It took the Sand in Your Eye team five hours to prepare, and a further two hours to create. From ground level it was difficult to fully immerse yourself in the image, but once the drone was sent up to capture the full context, the drawing was breath-taking. One of the propeller blades alone was 45m in length!"
        },
        {
            "text": "Respect the Range in the media"
        },
        {
            "text": "The results speak for themselves. At the time of writing, the campaign launch news story has been picked up in over 25 national and regional media outlets including the BBC, The Independent and The Guardian. That means far more people will have seen it than just those at the beach last week, and hopefully it will stick in their minds and they’ll remember to be responsible and safe when accessing training areas."
        },
        {
            "text": "To see a project that has taken some eight months to pull together have such a successful launch is incredibly satisfying. More importantly, it helps establish the campaign with many sections of our audience and adds credibility and authority to our safety message. The project has been a real endorsement of DIO’s core values – working together with multiple stakeholders as one team and leaning into the skills and knowledge of partners to deliver an excellent campaign launch event, the first of its kind for DIO."
        },
        {
            "text": "But our work is not yet done. We’ll continue to promote the campaign throughout the summer via targeted online advertising, press articles and radio adverts. In September, we begin the planning phase of the campaign for launch in Germany, one of several overseas locations where the UK military also train."
        },
        {
            "text": "Despite having only just launched this year’s activities, my thoughts are already turning to next year and what we’ll need to do to ensure similar levels of national coverage."
        },
        {
            "text": "#RespectTheRange"
        }
    ]
}