{
    "url": "https://dcmslibraries.blog.gov.uk/2022/08/09/meet-the-gadgeteers-science-and-reading-are-perfect-partners/",
    "title": "Meet the Gadgeteers – science and reading are perfect partners",
    "authors": [
        "Emma Braithwaite - Head of Skills and Engagement, The Reading Agency"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-08-09T13:00:13+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Libraries across the country have kicked off a whole summer of fun activity for families with the annual Summer Reading Challenge.  This year The Reading Agency has partnered with Science Museum Group to introduce the 'Gadgeteers'."
        },
        {
            "text": "What’s it all about?"
        },
        {
            "text": "The Summer Reading Challenge, run by The Reading Agency in partnership with the UK public library service since 1999, is one of the country’s biggest reading for pleasure programmes for children aged 4-11. Children are encouraged to set themselves a reading goal and then borrow books from their local library. They receive fun incentives and rewards as they read, and it is all totally free to take part."
        },
        {
            "text": "The Challenge regularly encourages over 700,000 children to keep up with their reading over the summer. We know that the programme helps to tackle the ‘dip’ in reading engagement some children experience during the school holidays, as well as increasing their confidence with reading and overall well-being."
        },
        {
            "text": "Meet the Gadgeteers!"
        },
        {
            "text": "Each year, the Challenge has a different creative theme to get children excited about reading. The focus for 2021 was nature and the environment, and we saw first-hand how engaged children and families were with this topic, as well as our library partners and schools. It was clear that children were motivated to learn about the world around them and how to make a real difference to their community and their future."
        },
        {
            "text": "We wanted to continue with this idea for 2022 with a celebration of science and innovation. The 2022 ‘Gadgeteers’ Summer Reading Challenge will show children that science is for everyone, and that innovation and invention are all around us. We believe that science and reading are perfect partners – both requiring creativity, curiosity, and imagination, and able to unlock a world of potential in children and young people."
        },
        {
            "text": "We were delighted to collaborate on the project with the Science Museum Group – the world’s leading group of science museums. We worked closely with them to develop our theme, characters and story, which sees a group of young friends solving problems and inventing gadgets, in order to put on a brilliant summer party at their local community centre."
        },
        {
            "text": "Susan Raikes, Director of Learning at the Science Museum Group, said:"
        },
        {
            "text": "Science Museum Group also helped to activate the Challenge by delivering online science engagement training to library staff and making available a huge range of their science activities and resources. The Group are also working closely on local activity with library services that neighbour their museums in Bradford, London, Manchester, County Durham, and York."
        },
        {
            "text": "We were thrilled to launch the 2022 Summer Reading Challenge with a special event at the National Science and Media Museum in Bradford, where local school children were treated to fun science workshops and storytelling sessions, organised by the museum and Bradford Libraries."
        }
    ]
}