{
    "url": "https://civilservice.blog.gov.uk/2022/08/09/planning-for-a-secure-future/",
    "title": "Planning for a secure future",
    "authors": [
        "Maryam Teschke-Panah"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-08-09T08:07:28+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Maryam Teschke-Panah, the Civil Service’s Deputy Age Champion, encourages civil servants to learn more about their pensions."
        },
        {
            "text": "It's never too early (or too late) to be thinking about your future income. Your pension can be the last thing on your mind when you need money for other things but it is a really good investment for your future. The Civil Service Pension Scheme provides many benefits and options to help you plan the lifestyle you want after you retire."
        },
        {
            "text": "Regardless of your grade, age, whether you have recently joined, or are close to retirement, you can learn more about one of the best benefits of being in the Civil Service - your pension! "
        },
        {
            "text": "At Civil Service Live, experts from the Civil Service Pensions Team helped attendees understand why their pension is so important, how to boost retirement savings and how to look after your loved ones if anything happens to you."
        },
        {
            "text": "The Pensions team answered hundreds of questions. Many attendees were interested in how they could save more money to ensure they had a better retirement. Partial retirement was discussed as one of the options for achieving a better work/life balance. The 2015 Remedy Programme and the move to alpha also generated a lot of interest. "
        },
        {
            "text": "If you missed those sessions or just want to learn more, the Civil Service Pensions team will be running another series of online events in September as part of Pensions Awareness Week. Last year over 35,000 people registered to attend."
        },
        {
            "text": "You can book onto these sessions by clicking on this link. The sessions will be recorded so if you don’t get the opportunity to attend, you can view them at a later date."
        },
        {
            "text": "If you want to know more in the meantime, please go to the Civil Service Pensions website."
        }
    ]
}