{
    "url": "https://insidehmcts.blog.gov.uk/2022/08/09/preparing-for-the-police-crime-sentencing-and-courts-act-2022/",
    "title": "Preparing for the Police, Crime, Sentencing and Courts Act 2022",
    "authors": [
        "Kara Gallear"
    ],
    "categories": [
        "Crime",
        "Working at HMCTS"
    ],
    "pub_date": "2022-08-09T11:10:56+01:00",
    "content": [
        {
            "text": "In April 2022, the Police, Crime, Sentencing and Courts Act 2022 came into force. The Act has affected various aspects of criminal law including legislation on:  "
        },
        {
            "text": "The passing of a new bill relating to criminal justice requires a lot of preparation in the courts. Part of my role was to make sure that the magistrates’ and the Crown Courts were ready for the changes. This included informing and preparing colleagues by checking and updating staff guidance around offences affected by the Act, and creating new guidance around the introduction of new offences. "
        },
        {
            "text": "One of our most important and complex pieces of work was making sure all our IT systems were ready to accommodate the changes. We needed to understand exactly how the changes would affect our IT systems, and make sure that the necessary upgrades were designed, developed, tested and built into our systems in time.  "
        },
        {
            "heading": 3,
            "text": "Collaborating with other teams"
        },
        {
            "text": "Preparing for a major legislation change of this kind means cooperating with colleagues in other teams. I initially spent time with Ministry of Justice (MoJ) and Home Office colleagues who drafted the provisions. This allowed me to gain a better understanding of the legislation and why it was needed. Their input has been essential for us in drafting our guidance.  "
        },
        {
            "text": "There are strict rules on procedure in the criminal courts which must be followed in every criminal case.  These apply to:  "
        },
        {
            "text": "A key responsibility for us has been working with the Criminal Procedure Rules Committee, to make sure all the changes are covered in the rules. "
        },
        {
            "heading": 3,
            "text": "A bill’s journey through Parliament"
        },
        {
            "text": "A bill can be introduced into Parliament in either the House of Commons or the House of Lords. It must be approved by both Houses before becoming an Act.  "
        },
        {
            "text": "The first reading does not allow for debate – it’s a straightforward introduction of the legislation. The second reading is followed by a debate of the general principles of the proposed legislation, before the committee stage where every line is carefully scrutinised.  "
        },
        {
            "text": "This is followed by the report stage – a chance for the whole House to discuss and amend the bill – and a third reading, which is the opportunity for final debate. "
        },
        {
            "text": "The same process then follows in the other House.  "
        },
        {
            "text": "If that House wants to make amendments, there’s a process known as “ping-pong”. This is when the bill is sent back and forth between Houses as they try to resolve disagreements about the final text. "
        },
        {
            "text": "Once the bill has passed all the required stages in both the House of Commons and the House of Lords, it’s presented for royal assent. "
        },
        {
            "text": "The complexities involved mean that the Police, Crime, Sentencing and Courts Act took more than a year to reach this stage. "
        },
        {
            "heading": 3,
            "text": "What the Act has changed"
        },
        {
            "text": "The Act has introduced a range of new criminal offences, including:  "
        },
        {
            "text": "Provisions in the Act include enabling judges to give whole life orders for the premeditated murder of a child, and life sentences for drivers who kill. The maximum sentence for criminal damage to a memorial has been increased from 3 months to 10 years. The Act also gives police forces broad authority to place restrictions on protests and public assembly. "
        },
        {
            "text": "It’s introduced changes which I think are pivotal in bringing the court system more in line with the ‘modern world'. For example, anyone can now apply to the court to observe any hearing remotely, and jurors can now have the assistance of British Sign Language interpreters in the jury deliberation room for the first time. "
        },
        {
            "text": "There have been some significant changes that courts have needed to familiarise themselves with. For example, the Probation Service now has the power to vary electronically monitored curfews in limited circumstances. We’ve had to do a lot of work and testing to prepare for this, as well as familiarisation sessions and staff guidance to make sure courts know about the changes and understand the processes. "
        },
        {
            "text": "Not all of the Act is currently in effect. There are still various provisions that need  a commencement order before they can be enacted. We continue to work closely with the MoJ and colleagues in partner agencies to make sure we’re well prepared. "
        }
    ]
}