{
    "url": "https://prisonleaversproject.blog.gov.uk/2022/08/09/the-day-of-release/",
    "title": "The day of release from prison: a springboard for a stable life",
    "authors": [
        "Diana Hidalgo"
    ],
    "categories": [
        "Service Communities"
    ],
    "pub_date": "2022-08-09T12:00:47+01:00",
    "content": [
        {
            "text": "We know that the day that people are released from prison can set the tone for their reintegration into society. Getting this right is vital for breaking the cycle of crime."
        },
        {
            "text": "It has been over ten months since the Prison Leavers Project launched the Day of Release Service Community (amongst other Service Communities) to understand the challenges that prison leavers can face."
        },
        {
            "heading": 2,
            "text": "Prison leavers at the centre of our work"
        },
        {
            "text": "We are a multidisciplinary team formed by policy and operational experts as well as a user researcher and a services designer. Our team aims to design and test ideas and interventions that will improve how prison leavers resettle back into the community in order to reduce reoffending and keep communities even safer."
        },
        {
            "text": "To achieve this, we need to put prison leavers at the centre of our design process because these perspectives will enable us to develop more effective interventions that will work on the ground. We have undertaken user research to identify their needs and challenges when it comes to the day of release, as well as the needs of the frontline staff that provide services and support during that crucial day. Engaging with stakeholders across the criminal justice system and co-designing how we can best improve outcomes for people leaving prison has been integrated into our practice. We want the day of release to be a springboard for a stable life."
        },
        {
            "heading": 2,
            "text": "Our vision for the ideal day of release"
        },
        {
            "text": "We started by thinking about the ideal day of release, and our vision is that the day of release provides a smooth transition for prison leavers from prison back into society."
        },
        {
            "text": "This means that people leaving prison and - on the day of release itself - are secure in the knowledge that they have somewhere safe and suitable to stay, enough money to support themselves in the community, and the right support for their health and wellbeing - as well as a sense of purpose and security about their identity, community, and future prospects, such as employment or education. All these things play an important part in reducing the risk of reoffending on release through improved resettlement for those leaving prison."
        },
        {
            "text": "Thinking about a gold standard day of release brought out some of the ingredients that could best prepare people for the world outside of prison and this is what we are striving to deliver."
        },
        {
            "heading": 2,
            "text": "What are we doing?"
        },
        {
            "text": "We have been exploring the ‘whys’ and the root causes of the common challenges that can arise for prison leavers on the day of release. We have engaged with prison leavers, people in custody, front-line staff and senior management of government and non-government run services, as well as key stakeholders in the Criminal Justice System and beyond to have a full picture of the day of release."
        },
        {
            "text": "Our findings range from the preparation for release and the booking out process of leaving custody, to the appointments and accommodation on the day of release. For example, people leaving prison can have difficulties attending all their appointments on release due to lack of resources and the distance between them. Based on our research, we have identified areas of opportunity to better support prison leavers on the day of release. These opportunities include exploring whether what is currently happening on the day of release can instead be done pre-release, easing time and psychological pressure on prison leavers, and creating multi-agency ways of working where services can collaborate to maximise resources and streamline efforts."
        },
        {
            "text": "In the past months, we have co-designed potential interventions that will be testing our assumptions and iterating our work as we continuously learn the best ways to meet prison leavers’ needs, and so ultimately reduces reoffending."
        },
        {
            "heading": 2,
            "text": "Interested in our work?"
        }
    ]
}