{
    "url": "https://defrafarming.blog.gov.uk/2022/08/09/tree-planting-and-food-production-a-joined-up-approach/",
    "title": "Tree planting and food production: a joined-up approach",
    "authors": [
        "Matt McGuire"
    ],
    "categories": [
        "Payments to plant trees and manage woodland"
    ],
    "pub_date": "2022-08-09T13:39:47+01:00",
    "content": [
        {
            "text": "The England Woodland Creation Offer (EWCO) is one of a number of ongoing payments that can support farmers to manage their land in an environmentally sustainable way while continuing to produce food.  "
        },
        {
            "text": "We're offering the opportunity to create woodland of various types and sizes in a flexible way that works for both land managers and farmers. "
        },
        {
            "text": "We are inviting eligible farmers and land managers to apply for a share of £25 million available this financial year to support woodland creation in England. "
        },
        {
            "text": "Land areas as small as 1 hectare and up can enter a EWCO agreement to access this funding. "
        },
        {
            "text": "There is no reason to delay planting trees on your land. "
        },
        {
            "text": "The England Woodland Creation Offer will, from 2025, become part of Local Nature Recovery – one of our new environmental land management schemes. "
        },
        {
            "text": "The tree planting offer within Local Nature Recovery, and the approach to payment rates, will largely mirror those of the England Woodland Creation Offer, allowing for some changes in response to user feedback."
        },
        {
            "text": "You could get a one-off payment of £8,500 per hectare, followed by annual maintenance payments of £300 per hectare for 10 years. "
        },
        {
            "heading": 2,
            "text": "Woodland and food production work hand-in-hand "
        },
        {
            "text": "Planting trees doesn’t have to come at the expense of food production. Trees grow well in less productive soils. Well-designed and well-managed woodlands can also support the foundations of food production: healthy soil, cleaner water, and biodiverse ecosystems. "
        },
        {
            "text": "Trees and woodlands can help farm businesses become more diverse, economically and ecologically resilient. They can provide new streams of income from timber, carbon units, and through recreation. "
        },
        {
            "text": "That’s why we are investing £750 million of the Nature for Climate Fund into planting, expanding, and managing woodlands over this parliament. The overwhelming majority of woodland creation in England is on lower-grade agricultural land (3b or below). Forestry Commission are required to consult the public on any new woodland creation proposal paid for by grant, or which is significant enough to require an Environmental Impact Assessment, which would include any large or commercial project. "
        },
        {
            "text": "Planting more trees and woodlands is a key part of the government’s plan to level up the rural economy and deliver for nature, people and jobs. Not only do trees absorb and lock up carbon, helping to tackle climate change, but the right tree in the right place can improve water quality, reduce flood risks, clean the air, improve soil health and reduce nutrient loss from surface run off, provide shelter for livestock in adverse weather, and provide green spaces for people to enjoy."
        },
        {
            "text": "Growing more timber at home will reduce our dependence on imports, and help to increase the use of timber – a low cost, renewable material - in construction."
        },
        {
            "heading": 2,
            "text": "Greater reward and recognition"
        },
        {
            "text": "Trees are a precious natural asset and central to the fight against climate change. EWCO also offers additional incentives for woodland that will help to mitigate climate change, deliver nature recovery and provide wider environmental and social benefits. "
        },
        {
            "text": "In addition to covering the standard costs of tree planting and annual maintenance, EWCO will pay more for tree planting that can benefit society and contribute towards ecosystem services. "
        },
        {
            "text": "This means more financial reward for planting and managing trees, in particular: "
        },
        {
            "text": "The additional contributions are optional, but they recognise the benefits woodland can provide for people and wildlife, and they can even be combined as part of an application.  "
        },
        {
            "text": "You could receive:  "
        },
        {
            "heading": 2,
            "text": "Eligibility  "
        },
        {
            "text": "Anyone with management control over eligible land can apply for EWCO.  Land managers can also come together and make joint applications across multiple land holdings."
        },
        {
            "text": "Check your eligibility on GOV.UK."
        },
        {
            "heading": 2,
            "text": "The applications process "
        },
        {
            "text": "You can submit an application at any time of the year. There is no deadline. You can find a step-by-step guide on GOV.UK. "
        },
        {
            "text": "EWCO is a criteria-based competitive scheme, with funding offered on a first come, first served basis. Applicants need to score their own applications which the Forestry Commission will then review. The Forestry Commission will offer agreements to applicants whose proposal score meet or exceed a threshold score. "
        },
        {
            "text": "The threshold score set is based on the available budget and is reviewed every 3 months. The most up-to-date score will be shown on GOV.UK. It is currently set at 10 points."
        },
        {
            "text": "If you are considering making an application to EWCO, we recommend that you contact your local Woodland Creation Officer as early as possible. "
        },
        {
            "heading": 2,
            "text": "After 2025 "
        },
        {
            "text": "As mentioned above, the England Woodland Creation Offer will eventually become part of Local Nature Recovery. The majority of new applications for woodland creation payments from 2025 will be made through Local Nature Recovery."
        },
        {
            "text": " We expect existing England Woodland Creation Offer agreement holders to have the opportunity to transition their maintenance payments into Local Nature Recovery from 2026. "
        },
        {
            "text": "If you have any questions about the scheme, leave a comment below."
        }
    ]
}