{
    "url": "https://defradigital.blog.gov.uk/2022/08/09/why-i-keep-an-allotment/",
    "title": "Why I keep an allotment",
    "authors": [
        "Dom Burton"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-08-09T07:30:50+01:00",
    "content": [
        {
            "text": "In National Allotments Week, Dom Burton shares his passion for growing his own and the work-life balance benefits, along with some tips to help you to have a wildlife-friendly plot. "
        },
        {
            "text": "National Allotments Week is a way of raising awareness of allotments, and the role they play in helping people to live healthier lifestyles, to grow their own food, and to help bolster communities."
        },
        {
            "text": "I want to share what we have learned from our allotment, and the benefits of having one. I work our allotment with my partner Kerry and her daughter Shea in our hometown of Ripon in North Yorkshire."
        },
        {
            "text": "It’s our first year running the allotment - we took it on at the end of March 2022, after being on the waiting list for about a year (see picture below of how it was when we took it over)."
        },
        {
            "text": "An allotment plot is a complex web of plants, micro-organisms, fungi, insects and animals, that not only produces food but also supports eco-system ‘services’ such as pollination and offers a refuge for wildlife in urban areas. So, they are incredibly important to the biodiversity of towns and cities especially."
        },
        {
            "heading": 2,
            "text": "Fun fact alert"
        },
        {
            "text": "Here’s a fun fact: did you know that an allotment is traditionally measured in rods or poles? It’s an old measurement dating back to Anglo-Saxon times. An allotment is usually 10 poles, the equivalent of 250 square metres or about the size of a tennis court."
        },
        {
            "text": "An allotment is an area of land, leased either from a private or local authority landlord, for the use of growing fruit and vegetables. In some cases, this land will also be used for the growing of ornamental plants, and the keeping of hens, rabbits, and bees."
        },
        {
            "text": "If your allotment is on land owned by the local authority, then it will either be classed as a statutory or temporary site. Statutory sites are protected by the Allotments Acts."
        },
        {
            "text": "The theme of this year’s National Allotment Week is Bugs, Bees and Broccoli. As you can probably see from our pictures, we’ve cultivated some areas for fruit and veg but left other areas quite wild to give habitat for insects and wildlife. We don’t keep any animals as such, at least not yet……."
        },
        {
            "text": "Bugs are important to the healthy functioning of allotments. As gardeners we tend to focus on the ‘pests’ and ignore all the work the other bugs are doing for us - like pollinating our fruit and veg, controlling pests or improving our soil."
        },
        {
            "text": "Our allotment produces enough food to reduce the cost of our weekly shop (which will be of increasing help during the current cost of living crisis). It also helps to bring our carbon footprint down, as our fruit and veg are all produced locally, without a supply chain. We try to avoid using pesticides, to minimise ingesting the sorts of chemicals that are likely to be present on shop bought fruit and vegetables."
        },
        {
            "heading": 2,
            "text": "Being flexible with the allotment and reaping the benefits"
        },
        {
            "text": "I feel lucky to work for Defra as it supports flexible and blended working, which enables me to run to the allotment on a morning with my dog in case I need to water plants in the greenhouse. I can flex my hours and manage my deadlines, knowing that if I do need to get to the allotment to do something, such as watering during the dry period, then I can do that and can make the time up later on."
        },
        {
            "text": "Working on the allotment has also had a positive impact on my mental wellbeing. It’s relaxing just being together on the plot, nurturing plants and observing nature. There’s also the sense of satisfaction when you eat your first home grown tomato or potato!"
        },
        {
            "text": "Allotments can be social spaces too. They are, in and of themselves, micro communities, where people swap and share produce and equipment, share ideas and experiences, and offer each other help."
        },
        {
            "heading": 2,
            "text": "Challenging perceptions of your ‘common or garden’ allotment"
        },
        {
            "text": "It’s easy to think of allotments as being run by older, retired people, mostly men; perhaps those members of society who have a bit more time on their hands. Although for some that traditional image of an allotment holder might still be the older, retired man, that’s changing, and the demographic has been broadening in recent years."
        },
        {
            "text": "Fewer than half of all plot-holders are retired on average, and the proportion of women plot-holders has also increased significantly."
        },
        {
            "text": "In our allotment site there‘s a real mix of people - older couples, younger families and some that tend their allotment alone. Everyone’s friendly so there’s a real sense of community and a desire to help each other."
        },
        {
            "heading": 2,
            "text": "Some tips for a wildlife friendly plot:"
        }
    ]
}