{
    "url": "https://deframedia.blog.gov.uk/2025/05/14/coverage-following-the-national-drought-group-meeting/",
    "title": "Coverage following the National Drought Group meeting",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "water"
    ],
    "pub_date": "2025-05-14T16:04:36+01:00",
    "content": [
        {
            "text": "There has been widespread media coverage following the driest start to spring in 69 years across England."
        },
        {
            "text": "Publications include BBC, The Sun, The Daily Mail, The Mirror and The Telegraph. Environment Agency Area Manager Matthew Gable was also interviewed on BBC Breakfast this morning (Wednesday 14 May)."
        },
        {
            "text": "This follows the National Drought Group meeting convened by Environment Agency last week (Wednesday 7 May) to urge water companies to do more to safeguard water supplies. Whilst there are currently no plans for hosepipe bans, if the prolonged dry weather continues, water companies may need to implement their dry weather plans in the weeks and months ahead.  "
        },
        {
            "text": "In England, March was the driest since 1961 and April received just half its normal rainfall. Farmers have had to start irrigating crops earlier and reservoir levels are either notably low or exceptionally low across the North East and North West of England. Both these regions have seen their driest start to the year since 1929.   "
        },
        {
            "text": "While no area is currently officially in drought there is a medium risk of one this summer without sustained rainfall."
        },
        {
            "text": "Environment Agency Deputy Director of Water, Richard Thompson, said:   "
        },
        {
            "text": "With rapid population growth and climate change, pressure on our water system is skyrocketing. That is why this Government is taking action to increase our water supply, including urgent action to reduce water company leaks and use water more efficiently, alongside new supply infrastructure. Water companies have committed to deliver nine new reservoirs and multiple new water transfer schemes to share resources."
        },
        {
            "text": "A Defra spokesperson said:"
        }
    ]
}