{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/05/14/lifting-the-lid-on-the-uk-digital-identity-ecosystem-digital-identity-sectoral-analysis-2025/",
    "title": "Lifting the lid on the UK digital identity ecosystem: Digital Identity Sectoral Analysis 2025 ",
    "authors": [
        "Henri McKenzie-Freedman",
        "Graham Francis"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-05-14T15:29:31+01:00",
    "content": [
        {
            "text": "Today, we publish our first full sectoral analysis of the UK’s digital identity ecosystem.  "
        },
        {
            "text": "The aim of the report – which was produced by an independent research consortium – is to establish a baseline of measures of the digital identity sector so that we can capture trends, tracking these on a regular basis to understand how the market is performing. "
        },
        {
            "text": "In this blog post, we’ll try to give a snapshot of a few of the key findings – but for full details, head over to GOV.UK to read the full report. "
        },
        {
            "heading": 3,
            "text": "Consumer attitudes and use of digital identity products "
        },
        {
            "text": "The most significant change to the interim report published last year is the inclusion of findings from an online and telephone survey of 3,561 consumers across the UK, including people from a range of backgrounds and levels of digital access and skill. "
        },
        {
            "text": "Through our survey questions, we wanted to explore peoples’ understanding of digital identity, usage of products, benefits derived, and barriers to adoption.  "
        },
        {
            "text": "Among the key findings were that that: "
        },
        {
            "text": "The report also includes new analysis of understanding, attitudes and adoption of digital identity based on different demographics (age, ethnicity, household income), varying forms of existing ID, and levels of digital access and skill. "
        },
        {
            "text": "And it highlights the important role of government, with 75% of respondents saying it was important to them that a service was tested against government standards. "
        },
        {
            "heading": 3,
            "text": "A £2.1 billion UK digital identity provider market "
        },
        {
            "text": "The full report updates core figures on UK digital identity sector size and scale, with findings including: "
        },
        {
            "text": "The report takes a deeper dive than previously into the global perspective, finding that the UK sector is highly internationalised. For example, 1 in 4 firms based in the UK are headquartered internationally, suggesting the UK is an attractive place for Foreign Direct Investment (FDI). It also finds that: "
        },
        {
            "text": "Looking into the wider innovation and research & development ecosystem in the UK, the report finds that 1 in 20 firms (6%) have received publicly-funded investment for research. Innovative solutions produced by the sector are exported globally, for example to support social vouching.  "
        },
        {
            "heading": 3,
            "text": "A few initial reflections"
        },
        {
            "text": "We’ve found the results of this work fascinating, and there’s still much to chew through from our published report. But for us, a few key things are emerging from the findings:  "
        },
        {
            "heading": 3,
            "text": "Towards the next report"
        },
        {
            "text": "Producing this report has been no small task, and we’re really grateful to our consortium of providers – Oliver Wyman, Perspective Economics and Projects by If – for providing expert insight and challenge through the process. We’re also grateful to all the digital identity providers who commented on the methodology and approach. "
        },
        {
            "text": "We’ll be repeating this research on an annual basis, to help us track market trends and consumer attitudes – in part, helping to inform the annual report that OfDIA will produce as required by the Data Bill.  We’ll be coming back out to stakeholders in due course to help guide priorities for future research, based on this year’s findings.  "
        }
    ]
}