{
    "url": "https://aphascience.blog.gov.uk/2025/05/14/protecting-the-uks-potatoes-from-the-colorado-beetle/",
    "title": "Protecting the UK’s potatoes from the Colorado beetle",
    "authors": [
        "Kelvin Hughes"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2025-05-14T10:24:40+01:00",
    "content": [
        {
            "text": "Next week we’ll be at the RHS Chelsea Flower Show calling on gardeners, allotment owners and the general public to look out for the Colorado beetle – a plant pest that poses a major threat to the UK’s food security."
        },
        {
            "text": "The Colorado beetle (Leptinotarsa decemlineata) has an insatiable appetite for potato foliage.  Within days of appearing, its larvae and adult beetles can strip plants bare, which can have a devastating effect on the production of potato tubers and, consequently, food supply. "
        },
        {
            "text": "Over two thirds of potatoes consumed in the UK are grown here, so if the beetle is found, we must act quickly to eradicate it. "
        },
        {
            "text": "The beetle was first found in Europe at the end of the nineteenth century, having been accidentally imported from the USA, leading to the destruction of crops. Fortunately, it has not established in the UK, thanks to public and grower vigilance plus regulation which goes back to the Destructive Insects Act of 1877."
        },
        {
            "heading": 2,
            "text": "Working together to keep the beetle at bay"
        },
        {
            "text": "APHA and partners play a vital role in protecting the UK from plant diseases and pests, including the Colorado beetle."
        },
        {
            "text": "The UK’s response plan for Colorado beetle ensures we are well prepared for any potential outbreaks.  In July 2023, following a report from a responsible and vigilant potato grower, our Plant Health and Seeds Inspectors put this plan into action, after identifying the presence of Colorado beetle larvae in the grower’s potato field. This was the first time the pest had been confirmed in a UK potato crop since 1977.   "
        },
        {
            "text": "The grower’s vigilance and prompt action led to extensive field inspection and pest management, resulting in the swift destruction of the pest. This has been confirmed by extensive surveying of the infected and surrounding area, which continues into 2025. "
        },
        {
            "heading": 2,
            "text": "Impact on trade and the economy"
        },
        {
            "text": "In 2023, the UK produced over 4.7 million tonnes of potatoes, and our potato industry was valued at £1 billion. An outbreak of Colorado beetle, if not eradicated when detected, would have a significant economic impact on the industry and the wider economy, including export markets."
        },
        {
            "text": "As well as feeding on potato foliage, adult beetles and their larvae feed on other plants in the nightshade family, including tomatoes and woody nightshade. They do not pose a threat to human or animal health."
        },
        {
            "text": "The Colorado beetle remains a high threat to UK agriculture. The pest is now present across large parts of Continental Europe, North America and Central Asia and each year our inspectors respond to several findings, often reported by the public. "
        },
        {
            "heading": 2,
            "text": "What do the beetles look like?"
        },
        {
            "text": "The Colorado beetle’s body is yellow or cream with 10 black stripes and it has an orange head with irregular black spots. It is usually between 6 to 11mm in length and 3mm in width. Its larvae are a pinkish red or orange colour, with black spots along each side and a black head and are up to 15mm in length. "
        },
        {
            "text": "Although distinctive in appearance, there are several beetles that are frequently mistaken for them, such as the Harlequin ladybird and the Burying beetle. The Colorado potato beetle plant pest factsheet provides more information about the beetle’s life cycle and provides information on how to differentiate it from some of our native beetle species.  "
        },
        {
            "heading": 2,
            "text": "Where to spot them"
        },
        {
            "text": "Farmers, allotmenteers and home gardeners who grow potatoes should look out for the beetles and larvae on their vegetable patches or fields. "
        },
        {
            "text": "It is important to remain vigilant, because the beetle can easily fly between allotments, home vegetable patches and commercial plots."
        },
        {
            "text": "The pests have been known to come into the UK as ‘hitchhikers’ on non-host plant material grown and packaged on the continent, such as leafy vegetables, salad leaves, fresh herbs, grain and frozen peas, so do keep an eye out when handling these items."
        },
        {
            "heading": 2,
            "text": "How to report sightings"
        },
        {
            "text": "If you find a Colorado beetle, please do not let it go – capture it in a secure container and report it to APHA as soon as possible. To report a sighting, you can:"
        },
        {
            "text": "All sightings reported on email should include a photograph and location details.  "
        },
        {
            "text": "You can find further information in the pest specific plant health response plan and in our previous GOV.UK news story."
        },
        {
            "heading": 2,
            "text": "Spreading the word at the RHS Chelsea Flower Show"
        },
        {
            "text": "If you want to find out more about the Colorado beetle, you can find APHA in the GreenSTEM area of the Great Pavilion at the RHS Chelsea Flower Show from Tuesday 20 May to Saturday 24 May."
        },
        {
            "text": "Our exhibit offers an immersive experience, with practical tips on how to play your part in keeping the pest out of Great Britain to ‘save our spuds’!"
        }
    ]
}