{
    "url": "https://mhclgdigital.blog.gov.uk/2025/05/14/unlocking-planning-innovation-150-brilliant-minds-collaborate-in-leeds/",
    "title": "Unlocking planning innovation: 150 brilliant minds collaborate in Leeds ",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2025-05-14T13:40:29+01:00",
    "content": [
        {
            "text": "Innovation came to life at the recent Local Government Innovation Hackathon, in Leeds. "
        },
        {
            "text": "This high-energy, two-day event, saw 150 of the brightest planners, technologists, and digital leaders from across local and central government and industry, collaborate to tackle real-world planning challenges.  "
        },
        {
            "text": "From AI powered solutions to data-driven insights, the atmosphere buzzed with creativity.  "
        },
        {
            "text": "At the Ministry for Housing, Communities and Local Government (MHCLG), we were proud to help organise the event, which was hosted by the Government Digital Service (GDS) and Incubator for AI (i.AI) and reimagine the future of local government planning services. "
        },
        {
            "text": "The hackathon is one of many ways that MHCLG and Digital Planning are exploring more collaborative, hands-on approaches to technology and AI, bringing together different perspectives and creating a safe space for innovation. "
        },
        {
            "heading": 2,
            "text": "Designing challenges based on real-world experience "
        },
        {
            "text": "We worked closely with local authorities, many from the Open Digital Planning community, in the lead-up to the event to shape four problem statements, grounded in the real challenges they face daily. We were committed to supporting innovation that’s rooted in lived experience. "
        },
        {
            "text": "The problem statements we arrived at focused on the following areas: "
        },
        {
            "heading": 2,
            "text": "Successful collaborative partnerships  "
        },
        {
            "text": "Through our partnership with the Open Digital Planning community, we helped to fund and support local government teams to participate, bringing valuable planning expertise to the exercise.   "
        },
        {
            "text": "A standout moment was one of the introductory presentations, on the first day, in which members of the Open Digital Planning community – Angela Barnicle, Head of City Development, and Martin Elliott, Head of Strategic Planning – both from Leeds City Council, Lisa Maryott, Head of Business Development at Medway Council, and Jo Sterrick, Digital Engagement Lead at West Oxfordshire and Cotswold Council, brought to life the key challenges for planning and the problem statements. It was great to have these local government voices explore the challenges in depth for everyone.  "
        },
        {
            "text": "What made this event especially exciting was the collaborative approach between MHCLG, the Department for Science, Innovation and Technology (including GDS and the i.AI) and Open Digital Planning. Each partner contributed different perspectives and approaches, with the blend helping to shape the event’s design, focus, facilitation and energy.   "
        },
        {
            "text": "This spirit of collaboration was mirrored in the participating teams, which combined planners, AI technologists, delivery leaders, data and digital specialists, working together to tackle the complex planning challenges. "
        },
        {
            "text": "It was this mix of skills and mindsets that that was instrumental in generating such impressive outputs.  "
        },
        {
            "heading": 2,
            "text": "Outstanding innovation in a short timeframe "
        },
        {
            "text": "Despite the limited time available, the quality of work produced was genuinely outstanding. The creativity, ambition, and technical skill on show was inspiring and impressed our judging panel, which included Chief Planner Joanna Averley and Milan Bogunovic, Digital Planning Programme Director.  "
        },
        {
            "text": "They had a tough job and were incredibly impressed – not just by the ideas, but by the clarity of thinking and potential impact. "
        },
        {
            "text": "The winning team created ‘Clio’, an innovative AI tool that transforms data from planning decision and enforcement notices into instant insights about a site’s planning history, helping officers assess planning applications more efficiently. As their prize, the team will present their working prototype to the Minister for AI and Digital Government, Feryal Clark MP, and explore their solution further with the i.AI team. "
        },
        {
            "heading": 2,
            "text": "The power of cross-discipline collaboration "
        },
        {
            "text": "The hackathon was a reminder of what’s possible when we create the right environment for ambition and innovation. It showed that meaningful progress doesn’t happen in silos – it emerges when diverse voices unite around shared challenges with the space to build something new. "
        },
        {
            "text": "MHCLG recently set up a new Artificial Intelligence (AI) Directorate to support better use of AI across MHCLG and local government with the aim of maximising efficiency and improving service delivery. "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "This hackathon represents a significant step in our ongoing work to harness innovative technology, including AI, to transform planning processes in England. By bringing together diverse expertise and focusing on practical solutions, we're helping build the foundations for more efficient, accessible and data-driven planning systems that better serve our communities. "
        }
    ]
}