{
    "url": "https://socialcare.blog.gov.uk/2021/10/26/black-history-month-and-the-wres-have-something-in-common/",
    "title": "Black History Month and the WRES have something in common",
    "authors": [
        "Nimal Jude"
    ],
    "categories": [
        "Events",
        "Recognition",
        "Viewpoint",
        "Workforce",
        "WRES"
    ],
    "pub_date": "2021-10-26T17:54:20+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Data, definition and delivery"
        },
        {
            "text": "Nothing like thinking about good quality data to concentrate the mind. I never thought I’d be saying that. Truth is, since leading phase one of the Workforce Race Equality Standard (WRES) in social care, we have noticed how the sites have been considering their WRES data and what it means for the wellbeing of the workforce and the communities they serve."
        },
        {
            "text": "The fact that I am posting this blog during Black History Month gives this work particular resonance. Four weeks of recognition, celebration and awareness raising of black culture and its incredible contribution to the cultural richness of our world. Our workplaces have benefited too, but not always at the individual level."
        },
        {
            "text": "That such a month is needed, after hundreds of years of literal whitewashing, also explains why the WRES is essential in our efforts to recognise, support and elevate the diversity of the social care workforce."
        },
        {
            "text": "In phase one of the social care WRES, 18 local authority social work departments, across children’s and adults services, have been reporting on nine metrics and developing improvement action plans."
        },
        {
            "heading": 2,
            "text": "Pioneers of parity"
        },
        {
            "text": "This endeavour is drawing people together from across social care, who may not have ordinarily been working on the same things. As a result, other directorates are sitting up and considering a whole council approach to the WRES. There is power in unity."
        },
        {
            "text": "I’ve said before good data is great and tells a story, but when it comes to the WRES, data without action is useless (sorry to my analyst colleagues). Each site will be publishing their action plans on their websites. This may not be an easy thing to do, to show the world your strengths and weaknesses. But these sites are brave and courageous. They know they are pioneers of something we can look back on and say: “This is when racial equity in the social care workforce was mobilised.”"
        },
        {
            "text": "This is a long game, not a quick fix, of course. It takes dedication, commitment and strong values to be better and do better. Activism comes in many forms."
        },
        {
            "text": "We have been here before when it comes to pursuing race equity. We have seen the dangers of thinking up a policy or strategy, followed by a few years of activity, before momentum gives way to inertia. We can understand when colleagues roll their eyes and say “whatever...”"
        },
        {
            "text": "An enterprise like this requires constant peddling - sometimes fast, sometime slow, uphill and downhill. It can be painful to bare the scars of previous mistakes – it can be a struggle and a worry. Hold that feeling, because that’s what it’s like for our global majority staff."
        },
        {
            "text": "Black History Month, despite the title, isn’t just about giving credit where it is most certainly due, it’s also about creating a societal mindset that recognises the values, abilities and aspirations of our diverse communities. The WRES is part of that noble calling. We are creating history… are you?"
        }
    ]
}