{
    "url": "https://civilservice.blog.gov.uk/2021/10/26/cop26-time-for-talks-at-green-summit-then-action/",
    "title": "COP26: Time for talks at green summit... then action",
    "authors": [
        "Clare Nasir, Author, Meteorologist, Climate Communicator and Mostly Climate podcast producer and TV broadcaster"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-10-26T09:18:29+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Clare Nasir looks at why the evolving landscape of climate science fuels a note of optimism for Glasgow "
        },
        {
            "text": "When I first heard the announcement that the Nobel Prize in Physics winners were climate scientists, Fatboy Slim’s epic album You’ve Come a Long Way, Baby instantly came to mind - released a month before COP4 in Buenos Aires back in autumn 1998. "
        },
        {
            "text": "Climate visionaries "
        },
        {
            "text": "The ground-breaking work of Syukuro Manabe and Klaus Hasselmann took place in the sixties when Manabe predicted how the climate would respond to rising greenhouse gases. He was the first climate modeller to provide a realistic representation of our climate and how it would change. He captured many features of climate change that we see today. "
        },
        {
            "text": "Hasselmann founded work on climate attribution - a method of unpicking extreme weather to reveal how human-induced greenhouse gases have contributed to worsening environmental conditions. Today, climate attribution studies are an effective tool in detecting and quantifying the climate change fingerprint on any one extreme weather event. "
        },
        {
            "text": "Attribution is another layer of warning that helps us understand nature’s response to a warming world; ice melt, sea level rise, violent storms, flooding, heatwaves and wildfires all more frequent than ever before. The results of this swift analysis tool often screams real, clear and present danger. "
        },
        {
            "heading": 4,
            "text": "Language everyone understands"
        },
        {
            "text": "Manabe and Hasselmann were not only academic visionaries. For me, they get a salute for their incredible patience over these past five decades. "
        },
        {
            "text": "We have indeed come a long way, baby."
        },
        {
            "text": "Some would argue that only in the last five years has the world caught up with what’s happening outside, as well as within the pages of climate scientific papers. "
        },
        {
            "text": "We now see a significant change in the universal use of tense and tone of climate change. From future to present; from change to crisis; and from bearing the costly burden to investing in shared future benefits."
        },
        {
            "heading": 4,
            "text": "So, what’s changed? "
        },
        {
            "text": "Huge leaps in super-computers allow climate models to reveal more about future weather and how it will affect us. Small yet mighty weather systems such as violent thunderstorms require greater computing capacity to be resolved accurately on a fine grid - another key step into understanding how climate change bores down on local environments, from flooding to lightning and wind damage. "
        },
        {
            "text": "At the other end of the scale, grand systems such as Amazon rainforests, Arctic Sea ice, and ocean currents represent a complex, interactive web of processes. These require meticulous mapping to understand how close we are to climate tipping points across the world.  "
        },
        {
            "text": "Already parts of the temperate forests in Brazil, south of the Amazon rainforest, have ‘tipped’ from a carbon sink to a source, where ecosystems are emitting more carbon dioxide than they are absorbing. "
        },
        {
            "text": "Furthermore, fresh insights into ‘abrupt’ permafrost thawing have been instrumental in adding vital information to global projections of methane and carbon dioxide. "
        },
        {
            "text": "It all feeds into global climate models that, in turn, disclose future scenarios - many of which we are now witnessing. "
        },
        {
            "text": "The evidence of climate change plays out every day before our eyes: anomalous weather, unprecedented natural disasters, and the devastation it unleashes on communities, wildlife and ecosystems.  "
        },
        {
            "text": "The clear and consistent detail delivered by climate scientists means we know why it’s happening, and more importantly, what could happen next. "
        },
        {
            "text": "Globally, we need immediate, rapid and large-scale reductions in greenhouse gases to keep warming below 1.5 degrees celsius."
        },
        {
            "text": "Recently published papers by the International Panel on Climate Change pack a punch. The language is strong and decisive, the content stark, conclusions authoritative and unequivocal. Each page is populated by eye-catching infographics that allow for clever analysis at a glance."
        },
        {
            "text": "Climate science is now accessible to everyone, digestible to all"
        },
        {
            "text": "Interpretation of future climate trends and impacts feeds into every part of life: health, housing, transport, energy, business, banking, insurance, technology and agriculture. "
        },
        {
            "text": "It’s important that everyone gets it. "
        },
        {
            "text": "Gen Z totally understands; their united determination and relentless campaigning utilises the simplicity of this science to deliver hard-hitting demands.  "
        },
        {
            "text": "The mainstream media has followed suit, ousting the handful of deniers that overwhelmed airtime with flawed arguments, and instead committing to quality climate stories and debates."
        },
        {
            "text": "Meanwhile, policy-makers work hand-in-hand with climatologists to understand risk, regulation and investment in town planning, energy use, infrastructure and new technologies. "
        },
        {
            "text": "People are choosing green. Consumer demand is driving down costs of clean technologies from meatless meat to electric vehicles to renewable energy."
        },
        {
            "text": "Climate science has been tightened up through decades of hard work by researchers and the innovation of computing power. Response and progress have dragged, scuppered, amongst other things, by doubt and delay. "
        },
        {
            "heading": 4,
            "text": "Yet now the landscape is transforming - faster than ever before \nWe have come a long way, baby."
        },
        {
            "text": "Now it feels like all roads are converging. We’re losing coal, the car is transitioning, maybe the cow will be next as nations realise their net zero commitments pledges."
        },
        {
            "text": "Recent momentum provides a solid background as nations come together at COP26 with a shared international goal. I only hope that this transfers into national action with a lasting legacy that benefits all."
        },
        {
            "text": "◼︎For more on COP26 and the science behind the international negotiations, check out the Met Office’s Mostly Climate podcast."
        }
    ]
}