{
    "url": "https://ipo.blog.gov.uk/2021/10/26/creeping-it-real-this-halloween/",
    "title": "Creeping it real this Halloween",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Enforcement",
        "Licensing"
    ],
    "pub_date": "2021-10-26T13:06:51+01:00",
    "content": [
        {
            "text": "Getting into costume can be fun for any occasion, but there’s one universal time of year when you’re more likely to see anyone and everyone dressing up."
        },
        {
            "text": "As 2021 seems more hopeful than the last year, I’m sure many will be digging out that vampire or zombie costume from the back of the wardrobe for a Halloween party. Parents across the country are heading to the shops to stock up on the latest costumes for their children for a fun night of trick or treating."
        },
        {
            "text": "[Image] Creeping it real at Halloween - how to stay safe by avoiding counterfeit costumes.One thing you may not have considered, is making sure your costume is a legitimately sourced, quality tested item."
        },
        {
            "text": "IP infringement online can be carried out by scammers pretending to be legitimate online retailers, often using fake websites. At the IPO we want to keep everyone safe at Halloween when buying their paranormal products. That means ensuring you buy real this October and avoid the counterfeits."
        },
        {
            "heading": 3,
            "text": "A license to sell"
        },
        {
            "text": "Counterfeit sellers target seasonal events to list their products in markets, on online marketplaces and promote their products on social media. If the price seems too good to be true, it probably is."
        },
        {
            "text": "These products often breach the intellectual property rights of the brand owner, but there can be much worse consequences. If goods have not been properly tested, they could be flammable and costume make-up could be dangerous."
        },
        {
            "text": "As the convenience of online shopping rises, unfortunately counterfeits do too. Sellers are getting better at marketing cheap deals for popular costumes."
        },
        {
            "text": "This doesn’t mean you need to buy from Disney for a princess or Pirates of the Caribbean costume though. Other retailers can sell official costumes created by big brands by using an intellectual property licensing agreement. This means the retailer has the license to use the IP of other brands. You can sometimes check details of their licensing on the supplier’s website."
        },
        {
            "text": "We spoke to worldwide fancy dress brand Smiffy’s about how they enforce their intellectual property rights in this case study."
        },
        {
            "heading": 3,
            "text": "Tell-tale signs of a counterfeit"
        },
        {
            "text": "It can be hard to tell counterfeits, especially when you shop online and don’t have the chance to look at the product properly. But taking precautions is worth it. Have a look out for some of these red flags when shopping for yours or your children’s costumes:"
        },
        {
            "text": "Watch our quick animation video on IP crime and infringement:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Keeping the counterfeits at bay"
        },
        {
            "text": "If you come across a counterfeit seller, you can report them to the UK Trading Standards, find out more via the Citizens Advice website."
        },
        {
            "text": "Buy real, keep safe and have a fang-tastic time this Halloween."
        }
    ]
}