{
    "url": "https://insidehmcts.blog.gov.uk/2021/10/26/explaining-the-single-justice-procedure-in-the-magistrates-court/",
    "title": "Explaining the Single Justice Procedure in the magistrates’ court",
    "authors": [
        "Siân Jones"
    ],
    "categories": [
        "Crime"
    ],
    "pub_date": "2021-10-26T11:00:46+01:00",
    "content": [
        {
            "text": "535,000 cases were heard by magistrates via the Single Justice Procedure (SJP) in 2020. It's an accessible, proportionate, effective and more efficient way – for both the defendant and the courts – to hear less serious cases that will not involve a prison sentence while maintaining the rigour, fairness and transparency of a standard court hearing."
        },
        {
            "text": "SJP was particularly important during the pandemic, when pressure on the court system increased as social distancing limited the capacity for hearings and some people were shielding. For those who chose to plead guilty, SJP meant that they did not need to attend court and allowed magistrates to deal with their cases from any location. This meant they did not add pressure to magistrates’ courts’ physical capacity and prevented further delay to more serious offences such as assault, sexual offences or burglary."
        },
        {
            "text": "How does the Single Justice Procedure work?"
        },
        {
            "text": "SJP was introduced by the Criminal Justice and Courts Act 2015. It allows prosecutors – who decide whether a case should be taken through the procedure – to deal with cases involving adult defendants accused of lesser offences that cannot result in a prison sentence, such as speeding, driving without insurance, TV license evasion and train fare evasion."
        },
        {
            "text": "Defendants receive a notice containing the charge by post, with a statement setting out the facts of the offence and guidance on what steps to take, including their right to a lawyer. They have the option to plead guilty by post or online, or ask for a court hearing.  There must be a hearing if they want to plead not guilty, but defendants sometimes ask for a hearing to plead guilty, for example if they want to argue against a driving ban."
        },
        {
            "text": "If they plead guilty or do not respond within the 21-day time limit, their case will be dealt with through the SJP. If they plead not guilty or ask for a court hearing, the case goes to a hearing in open court. No defendant can be dealt with via the SJP against their will."
        },
        {
            "text": "A single magistrate conducts SJP, advised by a professional lawyer dealing with the case on paper.  There's no prosecutor or defendant present. They can deal with the case at any time, rather than on a specific date."
        },
        {
            "text": "The same law and principles apply to trials in a single justice procedure as a traditional trial.  The prosecution must prove their case beyond reasonable doubt and their written evidence must satisfy the same rules as evidence in a trial in open court."
        },
        {
            "text": "Advantages of the Single Justice Procedure"
        },
        {
            "text": "Previously, defendants were sent a requisition inviting them to either plead guilty by post or attend a specific magistrates’ court on a day already allocated and resourced by the court."
        },
        {
            "text": "But predicting defendants’ attendance at court was difficult – they had no obligation to attend but could do so without notice. This meant magistrate and court time was wasted if the defendant did not show up and the matter was resolved in their absence. Conversely, cases could be delayed if lots of defendants attended on the same day and hearings over-ran."
        },
        {
            "text": "With SJP, a defendant must ask for a court hearing – court time is not automatically allocated. This gives courts the ability to understand demand and better plan their resources, avoiding wasted time for all involved."
        },
        {
            "text": "It also streamlines activity for other participants in the criminal justice system. Because magistrates read the evidence themselves, prosecutors do not have to attend court to prosecute. Defendants have the same flexibility, either to attend court or plead remotely.  Technological improvements mean they can plead online which is simpler and cheaper than by post."
        },
        {
            "text": "There are advantages across the justice system too as we can focus resource on more serious offences. The Crown Prosecution Service (CPS) are only involved in prosecuting cases where a defendant pleads not guilty – the police prosecute the rest – so they can focus on more serious and complex cases."
        },
        {
            "text": "A modification to standard procedure"
        },
        {
            "text": "SJP is not a radical new innovation, but a modification of existing procedures dating from the Magistrates’ Courts Act 1957. The modifications are:"
        },
        {
            "text": "A historic basis"
        },
        {
            "text": "Many features of SJP are not new:"
        },
        {
            "text": "Maintaining transparency"
        },
        {
            "text": "Although SJP cases may be heard by one magistrate sitting in private with a legal adviser present, they are still open to scrutiny and information shared with public and the media."
        },
        {
            "text": "In our media protocol, we set out an approach to circulating lists of pending SJP cases, verdicts (results/register) and sentences. Sentencing is not available in other proceedings – in those the media must travel to the court and write it down as it’s said out loud. But we know we have more to do to execute this consistently and are working to make improvements."
        },
        {
            "text": "Any member of the public is entitled to request the outcome of an SJP case (or any other case)."
        },
        {
            "text": "Summing up"
        },
        {
            "text": "SJP gives defendants accused of minor, non-imprisonable offences the option to plead guilty and have their case heard by a magistrate without having to go to court, or choose a trial in court if they want to plead not guilty. And it also allows courts and prosecutors to better manage their time and resource.  Most of its features are not new, but have been in place without complaint for decades or even centuries."
        }
    ]
}