{
    "url": "https://digitaltrade.blog.gov.uk/2021/10/26/how-the-digital-data-and-technology-team-champion-wellbeing-inclusion-and-collaboration/",
    "title": "How the Digital, Data and Technology team champion wellbeing, inclusion, and collaboration",
    "authors": [
        "Zuz Kopecka, Delivery Manager",
        "Erica Campolongo, Senior Agile Delivery Manager",
        "Stuart Watson, Senior Agile Delivery Manager"
    ],
    "categories": [
        "Culture",
        "Diversity and Inclusion",
        "Flexible working",
        "People and Skills"
    ],
    "pub_date": "2021-10-26T10:31:57+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Stock image of a remote meeting"
        },
        {
            "text": "Exploring how to collaborate effectively as a team became even more important during the shift to home working. Prioritising the wellbeing of our team was essential to delivering objectives in a remote setting, as was the need to use software and technology in an innovative way."
        },
        {
            "text": "We spoke to colleagues across DDaT to understand how they structure their team meetings to consider their individual team members’ needs. As we are gradually returning to the office, in a hybrid way, in the Department for International Trade (DIT), we asked teams to share how they have approached this."
        },
        {
            "heading": 3,
            "text": "Zuz Kopecka, Delivery Manager"
        },
        {
            "heading": 3,
            "text": "How has your team prioritised wellbeing while working remotely?"
        },
        {
            "text": "Ensuring the safety and wellbeing of everyone in the team was always our number one concern, but the global pandemic brought new challenges. Our team has always worked in an agile way so adapted with ease, as daily collaboration and finding new ways to improve is routine. We had daily stand-ups which helped check that everyone was present and coping. Additionally, there were regular retrospectives, health checks, team agreements, a dedicated Microsoft Teams wellbeing channel, and DDaT-wide social presentations."
        },
        {
            "text": "It was important to understand why collaborative activities may be disrupted, such as connection issues or home-schooling children during the pandemic. Many of us also found ourselves working longer hours when at home. We remained resilient throughout as we tackled the new circumstances we were experiencing."
        },
        {
            "text": "We reminded each other to take breaks, having meetings on the phone rather than on video. We also made use of the department’s flexible working and compressed hours policies. For example, a member of our team found themselves working more hours every day, so they changed their working pattern to take Fridays off."
        },
        {
            "heading": 3,
            "text": "How has your team approached returning to the office?"
        },
        {
            "text": "While the recommended return to the office is an average of 2-3 days a week per rota, our team is not based in one office, nor all present at the same time. This means it will be important for us to maintain the hybrid model of working."
        },
        {
            "text": "We have had several workshops looking at the different aspects of collaboration, communication, and socialising to agree how we want to work with each other. Everyone contributed to digital planning boards in their own time with issues and ideas. When we met, we voted on specific actions and norms we wanted to maintain."
        },
        {
            "heading": 3,
            "text": "Erica Campolongo, Senior Agile Delivery Manager"
        },
        {
            "heading": 3,
            "text": "How are your team meetings structured?"
        },
        {
            "text": "This summer, DDaT's digital services and products aligned to similar DIT objectives were grouped in portfolios. This was to boost collaboration and encourage knowledge sharing among teams. Each portfolio is led by a cross-functional strategy team."
        },
        {
            "text": "The Trading Environment Portfolio’s strategy team has recently set up the Portfolio Hub. The Portfolio Hub is a regular meeting for everyone in the Trading Environment Portfolio to attend."
        },
        {
            "text": "In these meetings, teams can openly discuss:"
        },
        {
            "text": "During September, these Hub meetings were used to discuss teams’ plans for the next quarter. The Tariff Application Platform and the Live Services teams came to present main deliverables in their Quarter 3 roadmap. The rest of the teams in the portfolio will present their roadmap in October. This will enable communication of the objectives and ambitions of each team, so everyone is aware of the work undertaken by the portfolio."
        },
        {
            "heading": 3,
            "text": "Stuart Watson, Senior Agile Delivery Manager"
        },
        {
            "heading": 3,
            "text": "What challenges has your team faced while working remotely, and how have you worked together to overcome them?"
        },
        {
            "text": "As a technical team, we quickly learned how to use tools effectively. Nevertheless, joining DIT remotely made it difficult to learn where and how the team worked together on tasks."
        },
        {
            "text": "However, my team and I overcame this together. I asked questions and they gave me guidance and support. This helped to build strong relationships based on trust. We also held a remote team working activity where we brainstormed what ‘good’ looks like for our team."
        },
        {
            "text": "This outlined how we value each other in the team. We listened and understood each other's opinions, which ensured that we are all recognised as individuals."
        },
        {
            "heading": 3,
            "text": "How has your team integrated technology to support team collaboration on projects while home working?"
        },
        {
            "text": "We used many tools to support collaboration while working remotely. Microsoft Teams was used for meetings when the team needed to work with stakeholders across DIT, while our regular team calls were on Google Meet."
        },
        {
            "text": "We engaged with key stakeholders in an agile way to focus on our sprint goals. Google Suite allowed anyone to make real-time changes and know that they had the most recent version of the file. Jira boards helped the team to visualise goals so we could break our project down into stories that we completed in two-week sprints to deliver overall objectives."
        },
        {
            "heading": 3,
            "text": "Our priority is our people"
        },
        {
            "text": "DDaT has successfully transitioned into a hybrid working model iterating our processes as we go along. Centralising wellbeing in our teams means that we continue to collaborate inclusively, ensuring people are given time to reflect and share experiences."
        },
        {
            "text": "The effective use of technology keeps us connected to all our colleagues, regardless of their individual circumstances. This approach helps to explain why our DDaT team has excelled during challenging times."
        }
    ]
}