{
    "url": "https://sfadigital.blog.gov.uk/2021/10/26/how-the-covid-19-pandemic-has-shaped-a-new-way-of-managing-my-level-7-master-degree-apprenticeship/",
    "title": "How the Covid-19 pandemic has shaped a new way of managing my level 7 Master degree apprenticeship",
    "authors": [
        "Alexandra Pyatt"
    ],
    "categories": [
        "Apprenticeship service",
        "Apprenticeships",
        "Jobs and careers",
        "Public sector"
    ],
    "pub_date": "2021-10-26T12:23:12+01:00",
    "content": [
        {
            "text": "It’s a pandemic, I’m a single mum with 3 boys, a school governor at two schools, I have a full-time job as a Senior Apprenticeship Policy Manager in the Apprenticeship Service, and I’m a Level 7 Senior Leaders Master’s Degree Apprentice. What was I thinking?"
        },
        {
            "heading": 2,
            "text": "Professional and personal benefits"
        },
        {
            "text": "The Master of Business Administration in Leadership and Management was originally focused heavily on businesses and private organisations. However, they have rewritten the modules to have a much bigger focus on Public Sector Organisations which has been great to fit the work within the Education Skills Funding Agency (ESFA)."
        },
        {
            "text": "My apprenticeship has involved a huge amount of organisation and time management in every aspect of my life, even during the COVID-19 pandemic when I wasn’t able to go out and do anything else. I am able to manage my workload to incorporate the 20% off the job training, however, at the level I am studying there needs to be a personal commitment. I study at least as many hours in my own time, especially when assignments and exams are due."
        },
        {
            "text": "I find that some of the biggest benefits to me have been around personal discipline and time management, having committed to three years of studying. I have realised:"
        },
        {
            "text": "⦁ Professionally it has developed so many skills and vastly increased my knowledge and understanding of theory in areas such as strategy, finance, marketing, people management and change management. I now hope to put more of these into practice."
        },
        {
            "text": "⦁ Personally, I like to be learning something all the time, and firmly believe in the quote from a colleague ‘every day is a school day’."
        },
        {
            "text": "⦁ Last but not least, I am looking forward to my MBA graduation when I go up on that stage and my children, hopefully, will sit in the audience. I want them to be proud of me, I’m hoping to inspire them to do and be whatever they want to be in life."
        },
        {
            "heading": 2,
            "text": "Organisational benefits"
        },
        {
            "text": "I feel that the biggest benefit to the organisation has been the new skills that I have acquired on my apprenticeship journey. The academic learning has been extremely useful and fits well with a lot of the work I do, but developing new skills and abilities can be used for further knowledge building and development. All aspects of the course build on required skills, the residential schools are extremely good for building close working relationships and trust with others very quickly, working closely together throughout residentials on theories and knowledge, culminating in a group presentation to the school at the end."
        },
        {
            "heading": 2,
            "text": "How apprenticeships work in practice"
        },
        {
            "text": "Working within the apprenticeship service has given me insight to see apprenticeships from the ‘other side’ and has greatly supported my development. I am more aware of training provider behaviour and the practicality of implementing funding rules requirements and ways they can be interpreted. I have been able to see a wider view of the way apprenticeships work in practice."
        },
        {
            "text": "At this level of study there is a big emphasis on reflective practice and critical analysis rather than just learning things. Self-reflection is perhaps the hardest part for me. At times it can be uncomfortable for everyone, but self-reflection is an important skill to have in all areas of your life, to look back at an activity or day and objectively see what you did, did well, can do better and what you would change next time."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "My apprenticeship has really allowed me to apply new skills, knowledge, and behaviours to my job. I have found some aspects easy to evidence for my portfolio, whilst other areas including the last module Strategic Finance more stretching, who knows when I will need to use my knowledge of hedge funds in the future?"
        },
        {
            "text": "Now, I have the last academic module, a six-month research project putting into practice all the knowledge and skills I have developed. This is made up of a 10,000 word academic assignment to complete the MBA, and a 4,000 word business report which will be used in my professional discussion and presentation with the end- point assessment panel."
        },
        {
            "text": "My apprenticeship experience has brought about lots of feelings, from a great sense of accomplishment when I have achieved merits in a difficult topic like Strategy, to how am I going to get it all done in time! I’ve learnt so much, but at times I’ve felt the challenge of juggling family, work and trying to get assignments in on time. In my heart I know it’s worth it, often overcoming the greatest challenges are the most rewarding."
        }
    ]
}