{
    "url": "https://lifeathmrc.blog.gov.uk/2021/10/26/how-hmrc-user-researchers-stay-at-the-top-of-their-game/",
    "title": "How HMRC user researchers stay at the top of their game",
    "authors": [
        "Sara Woodman"
    ],
    "categories": [
        "Digital services",
        "Digital Skills",
        "Digital workplace",
        "General",
        "Innovation",
        "User research"
    ],
    "pub_date": "2021-10-26T08:36:04+00:00",
    "content": [
        {
            "text": "I’m Sara Woodman a Senior User Researcher and I lead Learning and Development for HMRC User Research."
        },
        {
            "text": "As a user researcher, I am part of a team that work on some of the largest digital transformation programmes undertaken by government. Our team's main role is to ensure that user needs are fundamental to the design and implementation of HMRC services. The work we do affects the vast majority of people across the whole of the UK."
        },
        {
            "text": "We support our people with their professional development and continual learning which is an essential part of being a user researcher. User researchers get a minimum of five days training a year and we encourage and support our people to take up training opportunities specific to their learning needs. That could be things like a particular user research or analysis method, how to do inclusive research or stakeholder engagement and communication."
        },
        {
            "text": "Finding specific user research training can be difficult, so we decided to do something about it and create our own programme of training. With a large community of user researchers, we have a lot of knowledge and experience in-house. We wanted to harness this to learn from each other."
        },
        {
            "text": "Our unique User Research Training Programme is a mixture of internal training, external courses and on the job learning. Being user researchers ourselves, we created the training material around the needs of the community. We used volunteers who worked closely with end users, turning topics into engaging training material. It now covers a wide range of skills and development based on what our people felt they needed."
        },
        {
            "text": "Our in-house learning programme was complimented with external training to make sure we’re kept up to date with the latest developments in our profession."
        },
        {
            "text": "Our people also have access to resources that support on the job learning, such as bite-size collections of material on topics such as wellbeing, storytelling, and journey maps. This takes the form of short videos, how-to guides, and e-learning."
        },
        {
            "text": "We continue to learn from each other in our day-to-day work, with things such as a mentoring scheme and bi-weekly community meetings where we share knowledge and discuss topics. As well as an annual conference where we hear from internal and external speakers."
        },
        {
            "text": "Our bespoke learning has been tailored to meet our needs. We support everyone's development through blended learning which is both engaging and adaptive to the different ways people learn."
        },
        {
            "text": "Of course, the training needs of our people are constantly evolving, so we’re not resting on our laurels. We’re updating the user research skills framework and developing ways for our people to identify skills gaps and find the relevant development opportunities. We’re using data to get smarter about how we assess the skills of the community and more tailored training is next on the to do list."
        }
    ]
}