{
    "url": "https://hmlandregistry.blog.gov.uk/2021/10/26/simplifying-conveyancing-making-our-digital-channels-easier-to-use/",
    "title": "Simplifying conveyancing: making our digital channels easier to use",
    "authors": [
        "Karina Singh, Director of Transformation"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services"
    ],
    "pub_date": "2021-10-26T15:23:21+01:00",
    "content": [
        {
            "text": "Our absolute priority at HM Land Registry is to make our services faster for our customers. While improvements are being made through  recruiting more caseworkers and streamlining our internal processes, we believe real improvement needs to ensure we are making the most of digital technology in the way we provide our land registration services."
        },
        {
            "text": "Our digital transformation has been gathering pace with our investment in both internal and customer-facing systems delivering important milestones in 2022. We expect our customers to  experience some significant change and benefit to the way they interact with HM Land Registry over the next 6 months."
        },
        {
            "text": "Making our digital channels easier to use and enabling the transfer of digital data across organisational boundaries will reduce requisitions, progress calls and speed up completion of cases."
        },
        {
            "heading": 2,
            "text": "Making our existing tools easier"
        },
        {
            "text": "More than 90% of our customers interact with us through the HM Land Registry portal to do searches, submit applications and manage their applications. We have spoken to these customers about how we might improve the service and using their feedback we have added a feature called View My Applications, where users can quickly see all their applications in one place – with an estimated completion date for each – and download relevant documents or respond to requisitions directly."
        },
        {
            "text": "Over the last 2 years we have greatly enhanced the portal, to make it more user friendly and easier to navigate. We aim to continue this upgrade in early 2022 so that customers can see their colleagues’ applications. This will enable much more flexibility for team working, which customers have told us is a top priority at the moment."
        },
        {
            "heading": 2,
            "text": "Collaboration with customers"
        },
        {
            "text": "Our Business Gateway platform is used by customers who submit large volumes of applications and are looking for greater levels of automation. This service connects customers’ case management systems with ours, simplifying our customers’ work by enabling the direct transfer of digital information."
        },
        {
            "text": "Earlier this year we launched the Business Gateway community to collaborate with customers and find out which new developments we should prioritise. We published a roadmap that our community members can use to suggest new features, and vote and comment on the ones that will be most useful to them."
        },
        {
            "text": "The enthusiasm from the community has been significant and, on their advice, we have prioritised new services providing information on official copies of document availability and registered proprietor name services. We are now discussing what other improvements could be introduced in future."
        },
        {
            "heading": 2,
            "text": "A completely digital way to apply "
        },
        {
            "text": "An important new feature we’ve added to the portal is the Digital Registration Service. Essentially it allows customers to submit applications digitally."
        },
        {
            "text": "Currently many customers use our electronic Document Registration Service (e-DRS) which enables them to upload a scanned or PDF version of our forms. While e-DRS has served customers for nearly a decade, to build greater levels of automation we need to move towards the use of digital data over paper or electronic information."
        },
        {
            "text": "Today customers can apply to make simple updates to the register in an entirely digital way and we have recently added the ability to do this for applications with more than one title. Information can be inputted and verified by our systems before submission, meaning things such as name or fee errors are identified and corrected before they even reach a caseworker. The guided process also checks that the correct evidence has been supplied. With nearly 20% of all applications requiring a requisition this ability to provide customers with upfront checking will help reduce delays for all parties."
        },
        {
            "text": "We intend to improve and expand the ability to make a digital application for all register updates types (across both the portal and Business Gateway) by the end of next year. If you haven’t yet tried it then start using the Digital Registration Service  today! We will continue to keep customers up to date on new features and new application types and will work with them as we build and test over the coming months."
        },
        {
            "heading": 2,
            "text": "Welcoming new digital tools"
        },
        {
            "text": "As well as making land registration as digital as possible, we are also working with customers on how HM Land Registry can encourage the adoption of digital tools to develop an improved, faster, data-led conveyancing process overall. Ultimately, we believe this will lead to HM Land Registry services that are increasingly near instant or real-time."
        },
        {
            "text": "By accepting electronic signatures and remote digital identity checks we are able to see how these tools can really help conveyancers and their clients. We cannot hope to do this successfully without the collaboration and support of all our partners and customers."
        },
        {
            "text": "Over the next few months we are running a pilot on how we can increase automation by regulated legal professionals digitally assuring the information they are submitting as part of their application. This investment in our future ability to automate much more of our simpler transactions will create further speed and efficiency for conveyancers. If you are interested in finding out more about the pilot, get in touch at QES_Pilot@landregistry.gov.uk."
        },
        {
            "text": "We are also taking our work on Qualified Electronic Signatures forward, and will soon be seeking feedback on our draft practice guidance."
        }
    ]
}