{
    "url": "https://mhclgdigital.blog.gov.uk/2024/08/07/delivering-at-pace-introducing-common-tools-as-a-service/",
    "title": "Delivering at pace: introducing Common Tools as a Service",
    "authors": [
        "Elisha Khan, Senior Product Manager"
    ],
    "categories": [
        "Common tools"
    ],
    "pub_date": "2024-08-07T14:23:55+01:00",
    "content": [
        {
            "text": "For the past 18 months, my team and I have been leading a new initiative at MHCLG called Common Tools as a Service (CTaaS). This work has emerged from MHCLG Digital’s previous experiences and lessons learned in building services at pace and scale, particularly during emergency scenarios. After conducting a thorough discovery and alpha phase, CTaaS has officially taken shape as a vital area in MHCLG Digital. "
        },
        {
            "text": "CTaaS is set to become an expanding area of MHCLG Digital, with multiple product teams expected to develop products and services under its umbrella over the next 3 years. "
        },
        {
            "text": "Our mission is threefold: "
        },
        {
            "text": "Throughout our journey, we’ve uncovered crucial insights that have shaped the CTaaS approach. I will talk about them below.   "
        },
        {
            "heading": 2,
            "text": "Interoperability is key"
        },
        {
            "text": "We discovered that tools cannot exist in isolation. The ability of different systems and tools to work together seamlessly is paramount. This realisation led to the creation of our Common Tools Principles, which guide the development and implementation of all CTaaS offerings:  "
        },
        {
            "heading": 2,
            "text": "User support is essential to the success of CTaaS"
        },
        {
            "text": "Another critical lesson was the importance of robust user support. As a result, CTaaS will likely consist of product teams that not only build tools but also incorporate a service delivery model that includes comprehensive support for users. This approach ensures that teams can maximise the benefits of the tools provided. "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "Looking ahead, CTaaS aims to: "
        },
        {
            "text": "By providing a foundation of common tools and services, CTaaS will enable MHCLG Digital to respond more effectively to both routine and emergency scenarios. This initiative represents a significant step forward in our commitment to digital transformation and efficient service delivery. "
        },
        {
            "text": "As we continue to develop and refine CTaaS, we look forward to seeing its positive impact on MHCLG’s digital capabilities and, ultimately, on the services we provide to the public. "
        }
    ]
}