{
    "url": "https://ruralpayments.blog.gov.uk/2024/08/07/rpa-annual-report-and-accounts-2023-24/",
    "title": "RPA Annual Report and Accounts 2023-2024",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Rural Payments service"
    ],
    "pub_date": "2024-08-07T16:53:05+01:00",
    "content": [
        {
            "text": "RPA has now published its Annual Report and Accounts for 2023-24 which tells our story, outlines the objectives we've achieved and the challenges we've faced."
        },
        {
            "text": "It can be accessed here Rural Payments Agency Annual Report and Accounts 2023-24 "
        },
        {
            "text": "The report includes information about the great work RPA colleagues have done as well as details of our achievements throughout the year, our performance as an Agency, a financial review and a sustainability report."
        },
        {
            "text": "You can read a variety of stories about our partnership approach to farm visits, innovation case studies and the improvements we’ve made. One example is the introduction of the digital Rural Land Changes service which has significantly reduced the length of time it takes us to action mapping requests from customers."
        },
        {
            "text": "Read about how we’ve increased our face-to-face engagement at over 40 agricultural shows and events and 17 MP roundtables. Find out about the work our RPA’s Ambassadors do to engage with a wide variety of people and building relationships with local communities."
        },
        {
            "text": "There is also information on our outreach and volunteering work, and collaboration with farming welfare organisations, as well as on the RPA Feedback Panel and how it provides RPA with valuable insight."
        },
        {
            "text": "Paul Caldwell, RPA CEO said:"
        },
        {
            "text": "“It is now three years into our 5-year strategy, published back in February 2021. In 2023-24, we have made considerable progress against these and are ahead of expectations. This is even more remarkable given the considerable challenges posed by external factors affecting the agency and its people. Delivering on these commitments has been no small feat. It represents the dedication, professionalism and commitment of the people that work in RPA that this year has seen significant progress toward achieving our goals.”"
        },
        {
            "text": "We hope you enjoy reading this insight into the Rural Payments Agency."
        }
    ]
}