{
    "url": "https://prisonjobs.blog.gov.uk/2022/08/31/a-day-in-the-life-of-a-case-administrator/",
    "title": "A day in the life of a Case Administrator",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2022-08-31T14:52:02+01:00",
    "content": [
        {
            "text": "Working as a Case Administrator"
        },
        {
            "text": "Are you looking for a rewarding role where you can make a difference and where your personal qualities are just as important as experience or qualifications? We spoke to Case Administrator, Emily, about her role and why she enjoys it."
        },
        {
            "text": "Tell us a bit about the role"
        },
        {
            "text": "I started in March 2019. There has been so much going on over the past couple of years, especially with COVID as well. It's been a bit of a roller coaster."
        },
        {
            "text": "Our team are quite multi-functional. We do a lot of different things with a wide variety. We're a small team within the Service Centre."
        },
        {
            "text": "We do housing training, employment and education, so that's updating our database with all the information about people on probation. We send details to the probation team so they've got the picture of what needs to happen on probation with that person. They also can learn how many people on probation have accommodation and employment. We send out breach notices if someone has failed to attend or comply with their appointment."
        },
        {
            "text": "We have a help desk within our Service Centre as well - that's probably one of the most challenging roles, it's very constant, you have to be on the ball."
        },
        {
            "text": "We do so much. We really do. And I love it."
        },
        {
            "text": "Sounds like you find it a very rewarding role"
        },
        {
            "text": "The bits I find absolutely rewarding are the interventions that we do in our team. Not only supporting the person to have a perception of their crime and to stop reoffending, but I feel these interventions really support the wider community as well."
        },
        {
            "text": "A lot of people have this perception of admin work and it's just sort of nine to five sitting at a computer screen. But you’re doing so much more. You have a really big impact on so many people within the organisation and people on probation. We are a very big support role."
        },
        {
            "text": "Many people on probation rely on their probation officers. They rely on us admin staff. You can make such a big difference even doing the Case Admin role."
        },
        {
            "text": "Would you recommend the role to others?"
        },
        {
            "text": "This role can be such a good stepping stone, but equally, if you wanted to stay as a Case Administrator you can grow within that role as well. There's so much you can do with this role, it’s a really good opportunity, I think. I would recommend it."
        }
    ]
}