{
    "url": "https://lifeathmrc.blog.gov.uk/2022/08/31/customer-service-group-my-journey-so-far/",
    "title": "Customer Service Group: my journey so far",
    "authors": [
        "Christopher Godwin"
    ],
    "categories": [
        "General",
        "Recruitment"
    ],
    "pub_date": "2022-08-31T13:13:36+00:00",
    "content": [
        {
            "text": "The Customer Service Group (CSG) within HMRC handles more than 50 million customer calls each year. The Tax Operations team supports customers on one of CSG’s busiest telephone helplines, answering around 450,000 calls each week, helping with a wide range of tax and National Insurance queries."
        },
        {
            "text": "The helpline is split into different services including: Self Assessment, Pay as You Earn, National Insurance, Construction Industry Scheme, Employers Helpline and Online Services Helpdesk."
        },
        {
            "text": "We caught up with Pay as You Earn Advisor, Christopher Godwin, as he takes us though his journey at HMRC since joining the Personal Tax team."
        },
        {
            "text": "How my journey began"
        },
        {
            "text": "My journey with HMRC started back in November 2021 when my friend sent me a message with a link to a job advert which took me to the civil service jobs site. I was nervous about applying because I’ve always wanted to work for HMRC, my dad worked at HMRC all his working life and I wanted to follow in his footsteps."
        },
        {
            "text": "I took the plunge, filled out the application form and waited. I then had an online interview which was very straightforward. I had to record my answer to three questions and then submit them. After the interview, I waited a few weeks and then one morning I opened my emails to an email congratulation me on my successful application!"
        },
        {
            "text": "Overall, I found the application process very straightforward from start to finish."
        },
        {
            "text": "My first few weeks in the role"
        },
        {
            "text": "I first started my role in March 2022, my first few weeks weren’t what I was expecting as I didn’t go into the office until the very end of my second week! But we were still coming out of the pandemic. Spending my first couple of weeks at home, I was able to read over the materials I had been sent by the Onboarding team. My laptop and IT equipment were also sent out to me and once it arrived, to my surprise, I was able to set everything up relatively easily as I’m not the best with new technology. I then made a start on the online learning modules to get me ready for my formal training that started in week 3."
        },
        {
            "text": "The formal training was thorough and very intense as it covered all aspects of my role as a Personal Tax Operations Pay as You Earn Advisor. From simple tax code changes to more complex cases of adding multiple employer benefits to a tax code, and everything in between. After the training, I had another few weeks of dedicated ‘floor walking support’ to get me through those all-important first calls."
        },
        {
            "text": "A typical day"
        },
        {
            "text": "In the office we operate a hot desking policy, so my day begins by picking which desk I want to sit at. Once I’ve chosen my desk, I get my laptop and screens all set up for the day, then it’s time to hit ‘ready’ and start taking Pay as You Earn calls."
        },
        {
            "text": "Calls vary from simple tax code enquiries to more complex enquiries about different company benefits and multiple sources of income. But there’s no need to worry, there’s comprehensive guidance to follow for every situation, and your teammates are only a quick call or Teams message away and are always happy to help if you’re struggling with an enquiry. Not only are my teammates there to help me when I’m struggling, we all get along and have fun on lunch breaks and talk about all the goings on in the world."
        },
        {
            "text": "My day isn’t always about taking calls though, we have team meetings three times a week, as well as investment time once a week. The investment time is normally with my team leader, and I choose what I want to discuss. For example, when I first joined, I really struggled with car benefit, so I mentioned this to my team leader. We then spent our investment time going over this aspect of my role until I became more confident. Now when I get a call about it, I feel confident and know how to deal with it."
        },
        {
            "text": "What’s next"
        },
        {
            "text": "The next thing for me is to successfully complete my six-month probation which I’m on track to do in September. Once I pass my probation, the plan is for me to be upskilled in post, which will mean I’ll be able to work on postal correspondents for Pay as You Earn, as well as taking phone calls."
        },
        {
            "text": "I am looking forward to the new challenge of learning new skills and developing my knowledge in new areas within HMRC."
        },
        {
            "text": "Why should you join HMRC?"
        },
        {
            "text": "This was the exact same question I asked myself when my friend sent me the link for the job application back in November 2021, and it’s been the best career move I’ve ever made. My advice to you is go and apply for a role with HMRC, you won’t regret it and it will be the best career move you make, trust me."
        },
        {
            "text": "The reason I say it was the best career move I have ever made is because as soon as I join HMRC, I have not only been made to feel welcome, but my team leader has really helped with my personal development which has helped me with my role and has put me in a very good position for a long and successful career with HMRC."
        },
        {
            "text": "Come work for us!"
        },
        {
            "text": "We have lots of vacancies available within the Customer Service Group, take a look at the roles on offer and apply now, as Christopher says, you won’t regret it!"
        }
    ]
}