{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/08/31/dit-director-of-science-and-technology-exports-and-investment-scs2/",
    "title": "DIT – Director of Science and Technology Exports and Investment – SCS2",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-08-31T14:01:12+01:00",
    "content": [
        {
            "text": "Summary "
        },
        {
            "text": "The Department for International Trade (DIT) are recruiting for a new Director role at the forefront of the UK’s science and technology superpower ambitions. This Director will lead the newly formed Science and Technology Directorate. The work of the Directorate is critical to the future of the global economy and to the UK's position as a leading exporting economy and investment destination. The work of the Directorate will ensure that UK exporters capitalise on opportunities offered by new trade agreements and will help attract inward investment in future-oriented sectors from Healthcare and Life Sciences to Emerging Technology and Chemicals."
        },
        {
            "text": "The role "
        },
        {
            "text": "This Director role takes the lead on developing the department’s technology and science strategy and will forge constructive working partnerships within the department, internationally and across Government. This is a highly challenging and rewarding opportunity for a senior professional with strong leadership capabilities, interested to champion new and emerging sectors to drive exports and investment and jobs and growth."
        },
        {
            "text": "The successful candidate will have to have strong strategic thinking skills with the ability to bring various viewpoints and options together to create a coherent strategy. You will need to be innovative and open and agile. Likewise, you will bring a demonstrable track record of building high-performing teams and creating a culture of respect and making DIT a brilliant place to work where people can meet their aspirations. You understand that real change can only succeed through communication, collaboration and a drive to continually improve. We are determined to ensure that the department is representative of the UK and welcome and will support applications from the widest range of people of different backgrounds, cultures and experiences."
        },
        {
            "text": "Further information"
        },
        {
            "text": "For more information, including the full job description and how to apply, please see Civil Service Jobs webpage here"
        },
        {
            "text": "Apply before 23:55 on Sunday 25th September 2022"
        }
    ]
}