{
    "url": "https://insideDIO.blog.gov.uk/2022/08/31/excavating-a-2500-year-old-iron-age-hill-fort/",
    "title": "Excavating a 2,500-year-old, Iron Age hill fort",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Archaeology",
        "Defence Training Estate (DTE)",
        "Lulworth Training Area",
        "Operation Nightingale"
    ],
    "pub_date": "2022-08-31T11:54:33+00:00",
    "content": [
        {
            "text": "A team of archaeologists and volunteers has just finished excavating part of a 2,500-year-old Iron Age hillfort on Lulworth Training Area. The impressively sited Flower’s Barrow hillfort is sadly being lost to the sea due to coastal erosion due to its location vulnerably perched on the edge of an unstable cliff. As a result, it is on Historic England’s Heritage at Risk Register. "
        },
        {
            "heading": 2,
            "text": "Aim of the excavation "
        },
        {
            "text": "The site is expected to be gradually lost to the sea over the next 100 years or so. Therefore, the goal of the excavation was to gather as much information as possible about the site and those who lived there, hopefully allowing it to be removed from the Heritage at Risk Register in the process. DIO has also arranged for scrub to be cleared from the site which will allow Historic England to carry out a drone survey. This will be used to create a detailed model of the site to demonstrate changes over time.  "
        },
        {
            "text": "The hope is that the combination of all of this information will lead to a clearer picture of the site, allowing Historic England to remove it from the Heritage at Risk Register as no more information can realistically be learned. Regardless, increasing understanding of the site and the surrounding historic landscape and preserving as much as possible by record will create a valuable resource for current and future generations to study and understand. "
        },
        {
            "text": "Previous finds at Flowers Barrow include what is thought to be slingshot and this year’s excavation has confirmed the location of what the team of archaeologists believe to be several houses. A small amount of pottery was also found. This will need to be cleaned up and properly dated in due course, but the team tentatively dated it as ranging from mid-late Iron Age.  "
        },
        {
            "text": "One of these bits of pottery was discovered by one of the volunteer participants, a military veteran taking part under a programme called Operation Nightingale. This award-winning scheme sees wounded, injured and sick service personnel and veterans taking part in archaeological digs on the Defence estate.  "
        },
        {
            "text": "The participants are generally very enthusiastic about their experiences and talk about the sense of purpose and camaraderie of being on a dig with like-minded people. Many find it benefits their physical and mental wellbeing. It’s always a positive sign of the success and the scheme when we find previous participants signing up to take part in more excavations!  "
        },
        {
            "heading": 2,
            "text": "Important considerations "
        },
        {
            "text": "Organising the excavations can be a lengthy process. In this case Guy Salkeld, the DIO archaeologist leading this dig, had to work particularly closely with a number of collaborators. This included colleagues at Historic England, who set the conditions for the excavation, as well as our contractors at Wessex Archaeology. "
        },
        {
            "text": "Lulworth Training Area is used for firing from tanks and armoured vehicles, so the risk of unexploded ordnance (UXO) was ever present. Obviously, safety was therefore the top priority in the planning of the dig and throughout. The site was cleared by a UXO team before the excavation commenced and a unexploded ordnance expert was on site at all times in case of any discoveries a bit more modern than the Iron Age. All participants had to be briefed on the limits of the cleared area so they didn’t stray into potentially dangerous territory.  "
        },
        {
            "text": "Given that the South West Coast Path goes through the site, it was also a reminder of the importance of visitors staying safe on the Defence Training Estate by obeying the byelaws and sticking to the Public Rights of Way. Lots of the passers-by were interested in what the team were up to and the participants and archaeologists were happy to field their questions and explain their theories about the site.  "
        },
        {
            "text": "Looking after our land and heritage is really important to DIO and archaeology on military land is often better preserved than it would otherwise be, as it’s protected from development and industrial agriculture. The excavation was successful thanks to the hard work and enthusiasm of the participants and the support from colleagues in the Army and DIO, demonstrating how seriously we take our responsibilities to protect our heritage. "
        }
    ]
}