{
    "url": "https://vets.blog.gov.uk/2022/08/31/international-dog-day-what-to-consider-when-buying-a-new-pet/",
    "title": "International Dog Day: what to consider when buying a new pet",
    "authors": [
        "Richard Irvine"
    ],
    "categories": [
        "Government Veterinary Services",
        "Policy Work"
    ],
    "pub_date": "2022-08-31T07:54:29+01:00",
    "content": [
        {
            "text": "On International Dog Day I was pleased as the UK’s Deputy Chief Veterinary Officer to be asked to talk about the importance of buying a new dog responsibly."
        },
        {
            "text": "For the last two years Defra has promoted a national communications campaign called Petfished to target prospective pet owners to buy responsibly and improve the welfare of dogs bred for sale in England."
        },
        {
            "text": "The campaign brings together extensive work between government officials, including policy, media and press teams and veterinary advisors, and representatives from numerous external organisations, including veterinary organisations, online sales platforms, and animal welfare organisations."
        },
        {
            "text": "Buyers looking to purchase or rehome are urged not to get Petfished and are advised on the pitfalls they may encounter."
        },
        {
            "text": "Members of the public visiting the website are offered guidance and advice on three important areas. Buying from a breeder, a step-by-step guide to buying a dog, and, what to consider when adopting a cat or dog."
        },
        {
            "text": "You can find advice on importing a dog on our blog on World Zoonoses Day."
        },
        {
            "heading": 3,
            "text": "Buying from a breeder"
        },
        {
            "text": "Evidence indicates that there are far less concerns about the welfare of dogs sourced from breeders who are licensed under the Animal Welfare (Licensing of Activities Involving Animals) (England) Regulations 2018, or breeders who are part or reputable assurance schemes, such as the Kennel Club’s Assured Breeder Scheme. Given this, the breeding section suggests that purchasers begin by checking these aspects."
        },
        {
            "text": "That section also guides visitors to consider advice provided by the Canine and Feline Sector Group on the dog’s physical features. These have become an important factor in purchasing decisions, for example the very specific features of brachycephalic (short-nosed) breeds of dog which include the French Bulldog. One of the most popular breeds in the country, but one which can have notable health and welfare issues."
        },
        {
            "heading": 3,
            "text": "Step by Step Guide"
        },
        {
            "text": "The step-by-step guide aims to inform the prospective purchaser of the steps they should take when purchasing a dog. By more widely disseminating this information to the purchasing public we hope to see more people requesting information from breeders, driving breeders to improve welfare provisions for the dogs they breed from."
        },
        {
            "heading": 3,
            "text": "Adopting a rescue"
        },
        {
            "text": "In relation to the rescue and rehoming of dogs, the campaign urges prospective owners to consider rehoming from a reputable UK organisation, as bringing a dog from overseas can have increased animal health and welfare risks. The campaign suggests that members of the public should check if the rescue centre they use is a member of the Association of Dogs and Cats Homes, as they have set clear standards that all members adhere to."
        },
        {
            "text": "Lastly, across the site visitors are provided with red flags which may indicate that the seller is an unscrupulous individual who is only interested in financial gain at the expense of the animal’s health and welfare and potentially also yours!"
        },
        {
            "text": "The two public relations moments carried out during last year’s campaign included the UK CVO being interviewed by a national news channel and numerous radio stations and resulted in 185 pieces of coverage across national print and online media reaching millions of members of the public."
        },
        {
            "text": "An assessment of last year’s campaign told us that 75% of people know what a 'low welfare/deceitful seller' is and 84% could spot the signs, and that 85% of people who had been exposed to our campaign advertising feel confident in knowing how to research a seller properly."
        },
        {
            "text": "In finishing, I’d like to share with you the last two campaign videos which I hope you enjoy. The first video won an award and the second video was Defra’s most viewed social media reel!"
        }
    ]
}