{
    "url": "https://socialcareinspection.blog.gov.uk/2022/08/31/supported-accommodation-we-need-strong-oversight-to-make-sure-young-people-are-safe-secure-and-doing-well/",
    "title": "Supported accommodation – we need strong oversight to make sure young people are safe, secure and doing well",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care experienced",
        "children looked after",
        "social care professionals",
        "supported accommodation"
    ],
    "pub_date": "2022-08-31T15:00:38+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director Regulation and Social Care, discusses the progress we have made in our plans for regulating supported accommodation, as we seek to recruit inspectors.  "
        },
        {
            "text": "In December 2021, Amanda Spielman agreed to the government’s request that Ofsted should regulate supported accommodation for 16- and 17-year-old children in care and care leavers."
        },
        {
            "text": "While supported accommodation remains unregulated, we cannot say with any real degree of confidence what we’ll see when we begin our inspections. I hope, and expect, that we will see some good and excellent practice. However, we know from our local authority inspections and the testimony of others that the quality is likely to be variable. Quality standards and regulatory oversight are, therefore, absolutely necessary."
        },
        {
            "text": "What we know about supported accommodation"
        },
        {
            "text": "In order to prepare and plan for our work in the supported accommodation sector, we sent a survey to local authorities in February this year. I’m very grateful for the responses we received. The response rate was 97% which, given the other challenges that local authorities faced at the time, is fantastic."
        },
        {
            "text": "From the survey responses we received, we found that:"
        },
        {
            "text": "In terms of the young people in supported accommodation, we found that:"
        },
        {
            "text": "As we expected, it’s a hugely diverse sector where accommodation can come in many shapes and sizes. Supported accommodation can mean single-occupancy flats or larger hostel-type provision that may accommodate people aged over 18 who may not be care experienced. It can include ‘supported lodgings’ in a private home or relatively small ‘group living’ arrangements."
        },
        {
            "text": "To add to the complexity, the terms used by local authorities to describe broadly similar types of support can vary tremendously."
        },
        {
            "text": "A rising number of young people in supported accommodation"
        },
        {
            "text": "Based on our findings, there are around 7,000 16- and 17-year-old looked after children living in supported accommodation."
        },
        {
            "text": "From any perspective, that’s a staggering figure. It’s close to the number of children living in children’s homes across England. And the figure appears to be rising steadily. Although it’s not a direct comparison, it’s more than double the number of children in care who were reported to be in semi-independent or independent accommodation in 2014."
        },
        {
            "text": "I am all too aware of the challenges that local authorities face in identifying the right care and support for children and young people. The overall lack of sufficiency is undoubtedly contributing to the rise in the number of young people in supported accommodation, and we will work with government and colleagues across the sector to help address that urgent issue separately."
        },
        {
            "text": "Our findings, as always, will help shape policy thinking. First and foremost, though, inspections will focus on the experiences of young people. Whatever type of support that young people receive, we will expect it to meet young people’s individual needs and that the decisions taken on their behalf are led by their best interests. Regardless of the wider policy context, when practice falls short, we will report that and take any necessary enforcement action."
        },
        {
            "text": "Getting ready for regulation"
        },
        {
            "text": "The government expects to lay the supported accommodation regulations by January 2023, at the same time as publishing quality standards. We’ll start to register supported accommodation providers in April 2023, and we’ll begin to carry out our inspections in April 2024. We, and others, have a lot to do to make sure we’re ready."
        },
        {
            "text": "We know that many local authorities have been talking to providers of supported accommodation to find out if they intend to register and to consider what contingency plans might need to be made for young people. This is critically important. No one wants regulation to lead to unnecessary uncertainty or instability for young people. Planning needs to take account of the expectation that the regulations and standards will become mandatory before the end of 2023."
        },
        {
            "text": "We’ll be consulting widely on our proposals for inspection, and we hope to share more details soon. We’re already speaking informally to stakeholders, but the conversations are really only just beginning."
        },
        {
            "text": "When we consult, we will do all we can to ask the right questions, in the right way. To that end, we expect to have the help of care experienced people to co-design our consultation. Of course, their views on what good support looks like will be central to our thinking. Our inspections must reflect young people’s priorities and aspirations."
        },
        {
            "text": "We’re recruiting!"
        },
        {
            "text": "This is all new work for Ofsted and our responsibilities are expanding generally, so we need more inspectors."
        },
        {
            "text": "We’re very pleased to launch our recruitment campaign today – please take a look. There’s a video clip of me telling you more about the ways that people with the right skills and experience can make a real difference to the lives of children, young people and families. There’s a range of opportunities to make that difference – not just in supported accommodation. Please share widely!"
        }
    ]
}