{
    "url": "https://gdsgeospatial.blog.gov.uk/2022/08/31/un-ggim-the-uk-view-on-a-successful-12th-session/",
    "title": "UN-GGIM: The UK view on a successful 12th Session",
    "authors": [
        "Caitlin Ballard, International Policy Adviser, Geospatial Commission"
    ],
    "categories": [
        "Data",
        "International"
    ],
    "pub_date": "2022-08-31T16:23:17+01:00",
    "content": [
        {
            "text": "Caitlin Ballard, International Policy Advisor at the Geospatial Commission, summarises the UK delegation’s reflections on the 12th Session of the UN Committee of Experts on Global Geospatial Information Management (UN-GGIM) in New York."
        },
        {
            "text": "In early August, after a three-year hiatus of in-person meetings, a UK delegation attended the 12th Session of the UN Committee of Experts on Global Geospatial Information Management (UN-GGIM) in New York.  "
        },
        {
            "text": "\"UN-GGIM-12\" was a well-attended event with 73 Member States sending 256 delegates and another 105 delegates attended as observers representing a mix of private sector and industry bodies."
        },
        {
            "text": "The UK delegation was made up of colleagues from Ordnance Survey, Geospatial Commission, UK Hydrographic Office, Office for National Statistics, Foreign, Commonwealth and Development Office, and Satellite Applications Catapult."
        },
        {
            "text": "It was a packed week which kicked off with two days of pre-Session side events - 35 were organised over the week in total, featuring some great contributions from the UK delegation. Other notable events included an inspiring session from Women+ in Geospatial and an event promoting the upcoming UN World Geospatial Information Congress. "
        },
        {
            "text": "The rest of the week consisted of the formal UN-GGIM-12 meeting covering pre-agreed agenda items which allowed for substantial discussion and several important decisions to be taken. "
        },
        {
            "text": "Given the depth and breadth of what was covered, we are limiting ourselves to just three of our main UK takeaways from the 12th Session. They were:"
        },
        {
            "text": "1. Interesting debates on the future geospatial “ecosystem” "
        },
        {
            "text": "The future geospatial ecosystem was the subject of much discussion, with a dedicated side event and formal agenda item. Building on the last Future Trends report prepared for UN-GGIM by Ordnance Survey, new concepts, terms and visualisations were open for consideration and debate, such as the “geoverse” - the geospatial elements of the metaverse."
        },
        {
            "text": "The various opinions and perspectives were valuable for us to bring back and appraise potential opportunities and challenges for the UK and its geospatial community. We look forward to taking part on behalf of the UK in the global consultation on the relevant background papers which closes in October."
        },
        {
            "text": "2. Powerful testimonials of the UN-GGIM's frameworks and guidance in action "
        },
        {
            "text": "There were countless examples which demonstrated the significant benefits of national implementation of the UN-GGIM's frameworks, such as the Integrated Geospatial Information Framework (IGIF). Use cases such as flooding mitigation, natural resource management and land administration brought to life the potential influence that the IGIF and other UN-GGIM guiding frameworks can have when implemented. Several countries cited the Global Statistical Geospatial Framework (GSGF) as an important part of their national census planning and the Framework for Effective Land Administration (FELA) as crucial in securing land rights and modernising national systems for land registration."
        },
        {
            "text": "Thanks to outstanding UN-GGIM expert and working group efforts, new resources are developing all the time, such as the Disaster Risk Reduction inventory hub and the Policy & Legal Resource Kit. There are also two new country-based UN-GGIM centres being established: the Global Geodetic Centre of Excellence in Germany and the Global Geospatial Knowledge and Innovation Centre in China, both of which we will continue to engage with through the Committee of Experts and respective working groups."
        },
        {
            "text": "As part of the UK’s role on the High Level Group for the IGIF, we will be working with other Member States and partners to further the development and implementation of the IGIF around the world, for the benefit of countries and overall global sustainable development. We are keen to collect case studies of IGIF implementation and benefits so please get in touch with us if you have a story to tell."
        },
        {
            "text": "3. The UK can offer and learn a lot "
        },
        {
            "text": "It remains notable how much the UK expertise, leadership and contribution is looked to by others across the global geospatial ecosystem. UN-GGIM-12 enabled us to share our experiences through active participation in the various expert and working groups.  "
        },
        {
            "text": "For example, Dr Gerald J Wong from the UK Hydrographic Office delivered a joint presentation with Kathrine Kelm of the World Bank, introducing the World Bank’s IGIF Methodology and the IGIF Marine Spatial Data Infrastructure (MSDI) Maturity Roadmap.  "
        },
        {
            "text": "We were also able to share our insights around the ethical use of geospatial data (see the Geospatial Commission’s ABC ethics guidance) and suggested methodologies for valuing geospatial data (see the Geospatial Commission’s latest guidance on how to assess the value of investments in location data) "
        },
        {
            "text": "The Ordnance Survey and Satellite Applications Catapult, in partnership with the Group on Earth Observations, shared experiences of using earth observation data to enhance the applicability of national geospatial data in support of climate action and disaster relief applications. The discussion centred on the importance of responding adequately to assist those disproportionately affected by climate change."
        },
        {
            "text": "UK representatives were also able to use the in-person meeting to bring together a number of the donor agencies, who are working with developing countries on improving data systems, to discuss how best to align strategy, avoid duplication and to maximise the impacts of the range of support available. This includes consideration of how donor organisations can work together to support the integration of data into policy-making and the ethical use of data."
        },
        {
            "text": "Both themes are critical if countries are to achieve international commitments such as the 2030 Agenda on Sustainable Development, the Paris Agreement and the Sendai Framework. The return to in-person meetings offered a fantastic opportunity to convene these organisations in a room, build relationships and commence what will be an ongoing engagement."
        },
        {
            "text": "And finally, attending as a UN-GGIM observer was Peter Parslow, Standards Lead at the Ordnance Survey, in his capacity as the new chair of the International Standardization Organisation (ISO) geographic information/geomatics technical committee (TC 211). Along with the International Hydrographic Organisation and the Open Geospatial Consortium, ISO TC211 is committed to ensuring that the work of UN-GGIM is well supported by the international standards bodies, with whom the UK continues to play an active and leading role."
        },
        {
            "text": "It was a busy and hugely beneficial week, especially given the in-person format with its opportunities for networking both rekindling old relationships and creating new connections.   "
        },
        {
            "text": "We were proud to be part of the delegation representing the UK. The 12th Session brought home the impact and potential of the work of the Geospatial Commission, our Geo6 partner bodies, wider public sector organisations and the UK geospatial ecosystem."
        },
        {
            "text": "The UK congratulates the UN-GGIM Secretariat, Bureau, Co-Chairs and all Member States on a successful 12th Session and we look forward to supporting further work. The UN-GGIM is an important forum to enable countries to work together as a collective to promote all things geospatial."
        },
        {
            "text": "Sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}