{
    "url": "https://civilservicelocal.blog.gov.uk/2021/08/12/applications-open-for-facilitator-coaches-for-future-leaders-academy-online-2021/",
    "title": "Applications Open for facilitator/coaches for Future Leaders Academy Online 2021",
    "authors": [
        "Heather Flanagan"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-08-12T15:00:03+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Are you enthusiastic, energetic and a good communicator. Then this may be the role for you. "
        },
        {
            "heading": 4,
            "text": " Facilitator/coaches for our Future Leaders Academy Online (FLAO) are required in all our CS Local areas:"
        },
        {
            "heading": 4,
            "text": "What is the Future Leaders Academy Online (FLAO)?"
        },
        {
            "text": "The FLAO is a cross-departmental leadership development programme. It  provides civil servants with the opportunity to develop and strengthen their leadership capabilities."
        },
        {
            "heading": 4,
            "text": "How is the FLAO different from existing departmental development programmes?"
        },
        {
            "heading": 4,
            "text": " FLAO is open to the whole of the UK Civil Service. This enables participants to develop skills that can be transferred between departments/agencies and establish networks which facilitate working together and encourage the sharing of good practice."
        },
        {
            "heading": 4,
            "text": "Who is the FLAO for?"
        },
        {
            "text": "The FLAO is aimed at building the leadership capabilities of administrative assistants (AA/AO) and executive officers (EO), or equivalent, with an aspiration to become a future senior leader."
        },
        {
            "heading": 4,
            "text": "What does being an FLAO facilitator/project coach involve?"
        },
        {
            "text": "This is a fantastic opportunity for your own development whilst you assist in the development of fellow civil servants. The facilitator/coach role is one of the most important during the initial stage of the FLAO."
        },
        {
            "text": "Your role will be to lead and guide an assigned group of between 6 and 8 people, (administrative assistants (AA/AO) and executive officers (EO), or equivalent) through a series of activities especially designed to develop their skills and capability beginning 3 November 2021, one day per week for 6 weeks, time will also be necessary for preparation."
        },
        {
            "text": "Thereafter, you will continue to provide support and coaching to your group for the subsequent 9 months on a more ad hoc basis until the completion of their assigned project. (subject to your continuing availability)"
        },
        {
            "heading": 4,
            "text": "Will you receive any learning ?"
        },
        {
            "text": "We will provide you with mandatory learning  to support your role beginning mid October."
        },
        {
            "heading": 4,
            "text": "Who will fund my placement?"
        },
        {
            "text": "Home departments will need to meet salary and expense costs during the placement.  Line Managers permission must be obtained before expressing interest in this opportunity."
        },
        {
            "heading": 4,
            "text": "Who will be my Line Manager?"
        },
        {
            "text": "The post holder will retain their current line management and the CS Local locality will agree and report on a development objective for this work."
        },
        {
            "heading": 2,
            "text": "Closing date for applications is 16 September 2021"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}