{
    "url": "https://environmentagency.blog.gov.uk/2021/08/12/help-protect-our-beaches/",
    "title": "Help protect our beaches",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-08-12T11:22:44+00:00",
    "content": [
        {
            "text": "With the pandemic influencing travelling this year, many of us are looking forward to holidaying closer to home."
        },
        {
            "text": "That’s no bad thing, particularly when you consider we have some of the best beaches in the world - for example, Sea Palling in Norfolk could rival the best, with its fine pale sand and picturesque dunes."
        },
        {
            "text": "I work as a field officer for the Environment Agency in the National Monitoring Field Team and I am lucky that, during the summer, I get to travel around Norfolk’s stunning coastline to test the water quality."
        },
        {
            "text": "I have been doing this role for 20 years now and over that time, the cleanliness of our beaches has improved. However, two of the problems that I see far too often are litter and dog mess. It only takes two minutes to dispose of your litter or take it home with you and just one teaspoon of dog poo can have a nasty impact on the bathing water quality."
        },
        {
            "text": "Dog poo contaminates the sea with E. coli, which can make people sick. Other litter, like single-use plastics, can also devastate sea life and birds."
        },
        {
            "text": "We can all play our part in keeping beaches clean and better protect the environment."
        },
        {
            "text": "It is also important to follow guidance and keep dogs off bathing beaches between May to September. These areas are signed and there is plenty of beach left to walk dogs elsewhere."
        },
        {
            "text": "The bathing water season runs from May until September and our teams collect and analyse around 7,000 samples during that period. This data is uploaded onto our Swimfo website, which allows you to check the quality of over 400 designated bathing waters before you decide to go for a swim."
        },
        {
            "text": "My job during the bathing water season involves wading out into the sea wearing waders and a life jacket (while others around me are in their swimsuits!) and collect samples."
        },
        {
            "text": "Once I’ve collected the sample, it’s put in a fridge in the back of my van and then sent to the EA’s National Monitoring Laboratories to be analysed. We test the water for two types of harmful bacteria – E. coli and Intestinal Enterococci. You can read more about this and the role DNA testing has in sampling in our earlier blog."
        },
        {
            "text": "Thankfully most dog owners and beach goers are responsible and nationally a record 93% of English bathing waters were classified as either Good or Excellent in 2019."
        },
        {
            "text": "I am very fortunate as I genuinely love my job and enjoy the fact that I can make a difference. You can also make a difference by becoming a #WaterWarrior this summer and take some small steps to protect water quality:"
        },
        {
            "text": "Follow the Environment Agency on Twitter. Be a #WaterWarrior and always bag and bin your dog’s poo – any bin will do."
        }
    ]
}