{
    "url": "https://phescreening.blog.gov.uk/2021/08/12/tell-us-what-you-think-about-the-draft-idps-laboratory-handbook/",
    "title": "Tell us what you think about the draft IDPS laboratory handbook",
    "authors": [
        "Jenny Neal"
    ],
    "categories": [
        "NHS Infectious Diseases in Pregnancy Screening Programme"
    ],
    "pub_date": "2021-08-12T09:43:09+01:00",
    "content": [
        {
            "text": "The PHE infectious diseases in pregnancy screening (IDPS) programme national team is updating one of the programme’s most important publications – the laboratory handbook."
        },
        {
            "text": "We have set up an online survey for people to comment on the updated draft guidance. We are particularly keen to hear from:"
        },
        {
            "text": "We also want feedback from the wider screening service, including:"
        },
        {
            "text": "We’re hoping to publish the revised laboratory handbook around December 2021, with implementation from April 2022."
        },
        {
            "heading": 2,
            "text": "Please complete the survey"
        },
        {
            "text": "Please read the updated draft laboratory handbook carefully before completing the survey. You can also refer to the existing IDPS programme laboratory handbook."
        },
        {
            "text": "Responses are anonymous, unless you choose to include your contact details. It would be useful to know if you work in a laboratory, maternity service, in commissioning or elsewhere. But the decision is up to you."
        },
        {
            "text": "The survey is open until midnight on Wednesday 8 September 2021."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "Your feedback will help us make sure the handbook meets the needs of users and contains the information services need."
        },
        {
            "text": "Thank you in advance. We are looking forward to hearing from you."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}