{
    "url": "https://defrafarming.blog.gov.uk/2021/08/12/update-on-how-were-getting-on-with-details-and-delivery/",
    "title": "Update: how we’re getting on with details and delivery",
    "authors": [
        "Janet Hughes"
    ],
    "categories": [
        "Future Farming and Countryside Programme"
    ],
    "pub_date": "2021-08-12T14:56:02+01:00",
    "content": [
        {
            "text": "At the start of this year I wrote about what we had in store for the year. This post is about how we’re getting on and what’s coming next."
        },
        {
            "heading": 3,
            "text": "Designing and building environmental, climate and animal health and welfare schemes"
        },
        {
            "text": "We’ve been working hard to improve our existing schemes and services, including:"
        },
        {
            "text": "We’ve continued to test and learn to inform the design of our new schemes. We’ve: "
        },
        {
            "text": "In the second half of the year, we’ll be:"
        },
        {
            "heading": 3,
            "text": "Farming prosperity"
        },
        {
            "text": "Alongside our work to invest in environment, climate and welfare outcomes, we’re also looking to support prosperity in the agriculture sector. "
        },
        {
            "text": "So far this year, we’ve:"
        },
        {
            "text": "In the remainder of the year, we’ll:"
        },
        {
            "heading": 3,
            "text": "Regulation and enforcement"
        },
        {
            "text": "We’ve:"
        },
        {
            "text": "Alongside designing the government’s future regulatory approach, we are also making improvements, where possible, to our current regulatory system."
        },
        {
            "heading": 3,
            "text": "Sharing details so people can plan"
        },
        {
            "text": "We know it’s really important to farmers to have details about what our environmental land management and animal health and welfare schemes will pay for. This year, we’re working hard to nail down the important details and share them so that everyone can plan. "
        },
        {
            "text": "In June, we published information about what the Sustainable Farming Incentive will pay for in 2022. "
        },
        {
            "text": "We’ve set up a page on this blog that lists all the changes that are coming, so that you can find them in one place. We’ve also been out and about at the agricultural shows, sharing information and answering people’s questions, and taking part in lots of online Q&As with membership organisations and local groups."
        },
        {
            "text": "Over the rest of the year, we’ll be publishing:"
        },
        {
            "text": "You can find information about the full range of schemes in Future farming: what’s changing."
        }
    ]
}