{
    "url": "https://educationhub.blog.gov.uk/2021/08/12/what-students-need-to-know-about-transitioning-into-higher-education/",
    "title": "What students need to know about transitioning into higher education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2021-08-12T14:43:19+01:00",
    "content": [
        {
            "text": "Now that we’re past A level results day, many of you will be rightly thinking about what’s next. You have a lot of choice, and some of you will be heading into, or deciding whether to go onto higher education (HE)."
        },
        {
            "text": "To support you on your journey, we’ve developed the below guide to answer any questions you may have, point you to useful resources and help alleviate any worries."
        },
        {
            "text": "If you have been offered a place at university or are looking to secure a place through UCAS clearing this year, you still have some time to prepare before you head to campus to start your studies in the autumn."
        },
        {
            "text": "But if you’re wanting to brush up on subject specific knowledge, gain an insight into study skills, talk to a peer, or if you’re worried about your mental health and want to see what support is available, this guide is for you."
        },
        {
            "text": "If you’re unsure whether university is the right choice for you, then please do take a look at some Post 18 options from the National Careers Service."
        },
        {
            "heading": 3,
            "text": "So what you can expect from your university?"
        },
        {
            "heading": 3,
            "text": "Preparing for higher education and supporting yourself during the transition"
        },
        {
            "text": "We know the main worries for new students are around mental health support, student finance and adjusting to university life and study. Many of you are also keen to interact with other students to ask those all-important last-minute questions."
        },
        {
            "heading": 3,
            "text": "Mental health"
        },
        {
            "text": "Your HE provider will have mental health support in place should you need it and there are lots of resources out there which can help you over the summer. Student Minds have produced Know Before You Go – a guide designed to help you prepare and there are useful resources on mental health available from Mind and The Student Room."
        },
        {
            "text": "You can also check out Student Space which is run by Student Minds and provides access to information and advice. It is a dedicated support service for students which includes information about what support is available through your provider."
        },
        {
            "heading": 3,
            "text": "Money"
        },
        {
            "text": "Money can be a worry for students, especially those of you moving away from home for the first time."
        },
        {
            "text": "Thankfully, there is lots of support in the sector to help you with funding and budgeting. You might want to find out more about student finance and, if you have not already and are eligible, apply for funding for this year. Should you face financial difficulties during your course, your provider will have support available which you can apply for."
        },
        {
            "text": "There are also lots of resources around to help you make the most of your money, including guides from Money Saving Expert, UCAS and Save the Student, as well as information on how to get value for money from the Office for Students."
        },
        {
            "heading": 3,
            "text": "Study skills"
        },
        {
            "text": "HE providers are well equipped to support you in developing study skills while you are on course. However, there are lots of resources available if you would like to refresh these skills over summer to give yourself a little confidence boost."
        },
        {
            "text": "Whether you feel you need to brush up on your essay writing skills, improve your time management or familiarise yourself with how to make your online studying more effective, there are plenty of helpful webpages out there."
        },
        {
            "text": "The Open University has published content dedicated to improving your study skills to get the most out of your learning, and there are also online courses on taking your first steps in higher education and preparing for success at university which detail how university will work for you and help you to enhance your skillset."
        },
        {
            "text": "Whether you’re considering university or other pathways, there are plenty of online courses available through The Skills Toolkit to help boost your skills and support you in your next steps and throughout your career."
        },
        {
            "heading": 3,
            "text": "Peer support and questions"
        },
        {
            "text": "While you can find out a lot about university life from online guides, virtual open days, and guidance from experts, we know that one of the best ways to really find out about the support and experience you can expect is from talking to current students."
        },
        {
            "text": "Some HE providers will be encouraging current students to reach out to you as transition mentors to provide advice during this time. Even if that is not the case at your university, there are lots of ways in which you can contact current students."
        },
        {
            "text": "Many providers have official social media pages for new students, and there are numerous routes online through which you can talk to current students about issues you might be concerned about and to get tips for preparing to study your chosen subject."
        },
        {
            "text": "The Student Room is the UK's largest online student community, and if you have questions about studying your course, going to your university, or anything about the student experience, there will be a forum where you can ask. You can also chat to current students, filtered by course and university, through UCAS."
        },
        {
            "heading": 3,
            "text": "Subject specific resources"
        },
        {
            "text": "If you have an offer from a HE provider, you should be contacted in the coming weeks, with some tips on how you can prepare for the start of your course. For those of you who have not yet decided where, or indeed if you are going to university, there are still plenty of resources for you to explore if you want to brush up on your subject specific knowledge."
        },
        {
            "text": "Future Learn is an online learning platform with a number of free courses produced by universities from across the UK, many of which include modules preparing students for study in HE, including introductory courses on Law, Business, Biosciences and Interdisciplinary study. Their whole catalogue can be found here."
        },
        {
            "text": " The Open University has several online articles and courses that you may find helpful, including courses on Mathematics for Science and Technology, Music Research and Social Work. Check out Open Learn to see if there is anything useful for you. The Open University have also produced a resource alongside universities in Wales, entitled University Ready, which includes plenty of content relevant to students regardless of where you plan to study."
        },
        {
            "text": "Some of you may be going to study subjects linked to professions (such as law, dentistry, architecture etc). If that is the case, then the industry most closely linked to your course may have some useful material for you to look at. These bodies may also include information for those of you undertaking other pathways such as apprenticeships. For example, the Royal Society of Chemistry have a set of resources on introductory maths for higher education, the Architects Registration Board have a microsite for current and future students and the General Medical Council have practical tips for students starting medical school. Check to see if your course has any professional bodies and see what advice and guidance they have to offer."
        },
        {
            "text": "Regardless of whether you would like to brush up on some academic material or not, please be confident that your HE provider is primed to support all students to ensure you have the knowledge needed to succeed on your course."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "We encourage you to reach out to your provider if you have any questions about your university experience, and to reach out to your teachers and to current students through the networks identified for additional support. You are not alone!"
        },
        {
            "text": "The main thing to note is that if you are going on to HE, you will be supported by your provider when you get there and there is help available before and after you start. Discover Uni also has a handy guide to help you prepare for starting university along with OpenLearn's Jumpstart University hub."
        },
        {
            "text": "If HE is not for you and you are unsure of your next steps, we encourage you to talk to your teachers and take the time to explore the careers advice available through the National Careers Service and explore your options."
        },
        {
            "text": "As well as the resources listed above, the UCAS Hub and The Student Room both of have lots of resources and advice regardless of your chosen pathway."
        },
        {
            "text": "Whatever the future holds after you get your qualifications this summer, we wish you every success."
        }
    ]
}