{
    "url": "https://stratcommand.blog.gov.uk/2024/05/23/a-day-in-the-life-of-a-1435-engineer/",
    "title": "A day in the life of a 1435 Engineer",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-23T09:23:03+01:00",
    "content": [
        {
            "text": "Meet Air Specialist (Class 1) Technician (AS1(T)) Matthew Cashmore. He shares insights into his life, highlights and contributions as part of 1435 Flight (Flt), 905 Expeditionary Air Wing (EAW)  in the Falklands."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Could you introduce yourself and your role?"
        },
        {
            "text": "AS1(T) Cashmore: My name is AS1(T) Matthew Cashmore and I am a weapons technician on Typhoon, currently deployed to 1435 Flt in the Falkland Islands."
        },
        {
            "text": "Interviewer: What does a day in the life of a technician on 1435 Flt look like?"
        },
        {
            "text": "AS1(T) Cashmore: A day in the Falklands does not differ that much from a day back home, we come into work for around 8 am and complete all relevant jobs for the day. This can range from: making sure the aircraft are fit and ready for flight through servicing, and conducting see offs and see ins to send the jets off, general maintenance such as ejection seat swaps or fuel tank installations/removals, or even weapon loads."
        },
        {
            "text": "Weekends down here also tend to be similar to weekends back home. There’s plenty of welfare facilities here such as the café where you can go with your mates for a brew, cake and a game of monopoly, there’s a bowling alley and cinema, a library to rent out Xbox games and DVDs for film nights back in the block. There’s also plenty of opportunities to get out and about to see the islands with bimble wagons or heli bids. All in all, the Falklands is a really enjoyable place to come down to and there’s a lot of provisions to help pass the time during your tour."
        },
        {
            "text": "Interviewer: What is your favourite part of your role?"
        },
        {
            "text": "AS1(T) Cashmore: My favourite part of my role is that I am in a position whereby I can constantly get to work alongside new people and see their differing engineering methods to help complete a task. There is always someone who knows a different way to get the job done and as such there is a lot of scope for learning. Moreover, I find working alongside weapons systems and ejection seats very interesting!"
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What's it like being based in the Falklands?"
        },
        {
            "text": "AS1(T) Cashmore: The Falklands is brilliant, genuinely! I have loved every minute I’ve spent down here and I’m already looking forward to my next trip down (hopefully with 1435 Flt again). There hasn’t been a dull moment during my tour and even on the days where you are feeling homesick there’s plenty of other people who will get you out of your room to go out and do something to keep you occupied. Everywhere you go people always say it’s the people you work with that make it what it is and that’s true for the Falklands too, everyone you work with becomes your family while you’re here and you all help each other out as much as you can."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: \nWhat would your advice be to someone who was hesitant to deploy to the Falklands?"
        },
        {
            "text": "AS1(T) Cashmore: Do it, 100%. There’s so much to see and do and you’ll never get another chance like it. It is without a doubt one of the most interesting places you can be deployed to, especially with the vast array of wildlife down here! I was hesitant and nervous to come but I’m so glad I did come down, I have loved every single minute and can’t wait to come back down again!"
        }
    ]
}