{
    "url": "https://moderncivilservice.blog.gov.uk/2024/05/23/a-modern-civil-service-hub-is-now-live/",
    "title": "A Modern Civil Service hub is now live!",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-05-23T14:49:24+01:00",
    "content": [
        {
            "text": "We’re delighted to announce our new A Modern Civil Service hub launched on 20 May 2024, thanks to an amazing collaborative effort across government."
        },
        {
            "text": "As part of building a skilled, innovative and ambitious Civil Service, we’ve launched a brand new website: A Modern Civil Service hub. Getting the hub site created and online couldn’t have been done without a huge cross-department collaborative effort."
        },
        {
            "text": "The idea for a hub site as a single destination to learn more about cross-government change came from many colleagues  telling us they wanted to get involved and be informed of changes happening across the Civil Service. We started scoping the work in Autumn 2023 as we looked at the intended outcomes, who and what we’d need to build it, and what the longer term plan would be. "
        },
        {
            "text": "Back in November 2023, the Cabinet Office Digital team and the Modernisation and Reform Unit conducted a rapid ideation sprint exercise in Bristol to explore the problem space and generated ideas for solutions. We considered what kind of content we’d need, who our audience would be and what their needs would be. We created a number of prototypes as a minimum viable product and tested them with civil servants before zeroing on the hub as a solution."
        },
        {
            "text": "From February 2024 until launch, we’ve been flat out working with colleagues from several departments, including Cabinet Office Digital, Government Communication Service (GCS), Heads of Internal Communication, Profession communications leads, Cabinet Office Press Office, and more. "
        },
        {
            "text": "What the Hub does"
        },
        {
            "text": "The hub was designed by and for civil servants across the UK. Its aim is to educate and inspire civil servants to upskill themselves and come up with new and better ways of working. By sharing stories from leaders and colleagues across-government, we hope that it’ll remind colleagues to take pride in the fantastic work they do in delivering the best service possible for the public. "
        },
        {
            "text": "By reading more about the cross-government change missions — that’s capability, place, digital and data, innovation and delivery — civil servants will be able to better understand why continuous improvements and change matter. Whether that’s by improving interoperability between departments, upskilling yourself via Government Campus or collaborating with other teams on projects; our aim is to support you through that change."
        },
        {
            "text": "While also sharing ways to be a more skilled, innovative and ambitious Civil Service, the hub site also acts as a way to celebrate colleagues. We will be refreshing our Modern Civil Service Stories page and case studies monthly, and you can submit stories and blog ideas to us."
        },
        {
            "text": "When building the site and creating content, we took into consideration the potential needs of the user — our wonderful civil service colleagues! — to make sure that anything we include is easy to read and understand. We are trying to influence positive change, and that’s only achievable if we explain things simply."
        },
        {
            "text": "Successful collaboration with the right people and teams is vital, and in doing so we were able to tackle any obstacles we came up against, such as accessible language and site stylistics. By involving the right professions and civil servants, we developed a more streamlined approach that simplified the overall process. "
        },
        {
            "text": "From the initial OASIS plan, to the Government Communications Service supporting us with the GOV.UK Campaigns platform, to writing the content itself, testing the site and updating it based on feedback, we have continuously worked together with a wide range of experts to build something we hope civil servants will regularly visit. "
        },
        {
            "text": "Of course, before we got to this point, we meticulously gathered data and insight from a variety of stakeholders to present the business case as to why the A Modern Civil Service hub  should exist in the first place. Throughout the build process we continually engaged with key stakeholders, sharing with them the most up-to-date builds and content on a regular basis. We worked with internal communications leads to make sure we had the most accurate data, figures and wording so we present a cohesive, coherent message in case studies we referenced from different departments. "
        }
    ]
}