{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/05/23/heads-together-for-enhanced-brain-injury-support/",
    "title": "Heads Together for enhanced brain injury support",
    "authors": [
        "Michael Clark",
        "Caroline Bald"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Knowledge and skills"
    ],
    "pub_date": "2024-05-23T14:58:25+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Plugging the gap between knowledge and need"
        },
        {
            "text": "People living with traumatic brain injuries can have many long-term needs. These may manifest in obvious ways, such as clear disabilities, but often they need more exploration to identify and examine the full extent of their impacts."
        },
        {
            "text": "This includes chronic fatigue and memory problems. Problems with insight into their predicament, the frontal lobe paradox, can also be challenging."
        },
        {
            "text": "It is clear from their experiences and the testimony of families or carers they often feel unsupported and their needs not addressed."
        },
        {
            "text": "Social work is one area people in this situation sometimes feel let down by. This is perhaps not a surprise as social workers are rarely trained in head injury issues and social work’s potential to mitigate them."
        },
        {
            "text": "To address this gap between people’s needs and practice knowledge, a multi-disciplinary team has been working on the Heads Together research project."
        },
        {
            "heading": 2,
            "text": "A fully accessible platform for adult social work"
        },
        {
            "text": "Heads Together is a multi-university, inter-disciplinary two-year project funded by the National Institute for Health and Care Research (NIHR). Partnering with people who have experienced traumatic brain injury has been at the core of the work and Heads Together centres lived experience alongside existing research evidence to develop the Heads Together Social Work Education Platform."
        },
        {
            "text": "This will provide training for social workers to help them understand head injuries, when they might encounter them with clients, how problems manifest, and how the issues fit with social work practice and legislation."
        },
        {
            "text": "We are working on publications and sharing the platform to educators and employers while considering next steps to build on interprofessional learning."
        },
        {
            "text": "The platform has been developed in collaboration with the charity, Brain Injury Social Work Group (BISWG), who are giving it a permanent, freely accessible home on their website."
        },
        {
            "text": "We have also been privileged to work with a local Headway (Essex) and theatre group, Packing Shed to adapt a play, Making Headway, as an interdisciplinary teaching tool."
        },
        {
            "text": "The play shares brain injury lived experience stories with adapted workshops, allowing students to speak with the actors in character. We have so far been able to use the research project to pilot Making Headway as an interprofessional creative education opportunity in four universities to over six hundred health and social care students."
        },
        {
            "text": "A key aspect of the project has been building research capacity to further develop the evidence base. This includes establishing a group of people who have experienced head injuries to guide the research and help co-produce the education platform."
        },
        {
            "heading": 2,
            "text": "Encouraging research"
        },
        {
            "text": "Another has been developing the careers of social workers to be more engaged in research. Caroline is an example of this goal. After working as a social worker, she became a social work lecturer, specialising in curriculum design with inclusive human rights social work in mind. She later joined the team developing the proposal for what became the Heads Together project."
        },
        {
            "text": "Caroline is especially proud of our ethical approach, centring the project on the inclusive experts by experience group. In doing so, we have ensured the platform can help social workers working with people with brain injuries, from A&E to employment and all life experiences in between and beyond."
        },
        {
            "text": "She is now considering research proposals to develop with colleagues. Caroline’s pathway is helping to make the Charter for Social Work Research in Adult Social Care real for social workers and build research capacity."
        },
        {
            "text": "If you would like to hear more about Heads Together, including Making Headway, please get in touch: caroline.bald@essex.ac.uk"
        }
    ]
}