{
    "url": "https://defrafarming.blog.gov.uk/2024/05/23/hedgerow-regulations-now-law/",
    "title": "Hedgerow regulations now law",
    "authors": [
        "Richard Harrison"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-05-23T13:33:55+01:00",
    "content": [
        {
            "text": "In a post published last month, I said I’d let you know when Parliament passed the new hedgerow regulations. Today, I’m doing just that. "
        },
        {
            "text": "The Management of Hedgerows (England) Regulations 2024 puts the baseline for hedgerow management practices into law, providing a consistent approach for their protection across the country. "
        },
        {
            "text": "This includes:"
        },
        {
            "text": "As I mentioned in my last post, these practices are subject to exceptions which you can find in the legislation. They broadly mirror the previous approach under cross compliance. This will make it straightforward for farmers and others who are familiar with the requirements."
        },
        {
            "text": "You can find guidance on these rules and exemptions in the buffer strip guidance and the cutting and trimming guidance on GOV.UK. "
        },
        {
            "text": "Many farmers and land managers are already going much further than the rules contained in the new regulations.  "
        },
        {
            "text": "This is shown through the uptake of hedgerow management actions through our environmental land management schemes. Over 20,000 agreements contribute to the management of over 60,000 miles of hedgerows in England. "
        },
        {
            "text": "The new regulations support those participating in our schemes or receiving grants by providing a basis of good hedgerow management that all must follow.  "
        },
        {
            "text": "Further details on how to get involved in hedgerow management offer can be found on the Funding for farmers, growers and land managers page on GOV.UK and through our dedicated Sustainable Farming Incentive (SFI) site."
        },
        {
            "text": "The regulations will be enforced by the Rural Payments Agency (RPA), in a fair and proportionate way and they have been talking to farmers and others about the best approaches. From day one, they will take an advice-led approach, with stronger actions in only the worst cases. "
        },
        {
            "text": "The RPA will hold a public consultation on how to implement and enforce these protections in due course. "
        },
        {
            "text": "The regulations are designed to provide an extra level of reassurance that the same management approach is used across the country.  "
        },
        {
            "text": "Follow the Rural Payments Agency blog for the latest. "
        }
    ]
}