{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/05/23/join-us-on-our-mission-to-promote-greater-competition-and-innovation-in-digital-markets/",
    "title": "Join us on our mission to promote greater competition and innovation in digital markets",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA"
    ],
    "pub_date": "2024-05-23T15:25:35+01:00",
    "content": [
        {
            "text": "The largest digital platforms hold a uniquely powerful position – many of us rely on them every day, whether to search, connect with family and friends, to shop or to work. And similarly, they can be unavoidable for many businesses who want to advertise or sell their products or services,or distribute their apps."
        },
        {
            "text": "Given the important role these firms play, it is imperative that they do not take advantage of their positions to the detriment of people or other businesses. This is where the Digital Markets Unit (DMU) can play a significant role to shape the future of digital markets."
        },
        {
            "text": "The DMU continues to recruit as we get ready for the Digital Markets Competition and Consumers Bill to become law, which places new responsibilities on us to improve outcomes in digital markets for people, businesses and the UK economy."
        },
        {
            "text": "Apply now to join us! The following roles are available:"
        },
        {
            "text": "Check back from Friday 24 May for links to the roles or search on Civil Service Jobs. "
        },
        {
            "text": "It is an exciting time to join the team as we offer a variety of interesting work and the CMA continues to work hard to promote innovation and competition in digital markets. The CMA’s current and recent work includes:"
        },
        {
            "heading": 2,
            "text": "How can you make a difference by joining the Digital Markets Unit (DMU)?"
        },
        {
            "text": "In joining the Digital Markets Unit, you will have an opportunity to make a difference for people, businesses and the UK economy. Working with the DMU you could be involved in:"
        },
        {
            "text": "The roles we are recruiting for draw upon a breadth of skills including research and analysis, strategic thinking, stakeholder engagement, project and case management, as well as writing and communication."
        },
        {
            "heading": 2,
            "text": "Develop your career and skills at the CMA"
        },
        {
            "heading": 2,
            "text": "Want to find out more about the work of the DMU?"
        },
        {
            "text": "You can hear more about these roles and the work of the DMU directly from our colleagues at our online ‘open house’ event on Tuesday 4th June 2024."
        }
    ]
}