{
    "url": "https://kingsawards.blog.gov.uk/2024/05/23/mobilityways-are-proud-to-receive-the-kings-award-for-enterprise-in-sustainable-development/",
    "title": "Mobilityways are proud to receive the King's Award for Enterprise in Sustainable Development",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Recipients"
    ],
    "pub_date": "2024-05-23T17:32:30+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Mobilityways is a climate-tech organisation and social enterprise that enables large employers to measure, reduce and report their commuter emissions. Founded as Liftshare in 1998, we have helped to remove over 1.5 billion miles from UK roads since our inception – that’s the equivalent number of miles it would take to get to the Sun and back more than eight times."
        },
        {
            "text": "Julie Furnell, CEO:"
        },
        {
            "text": "Watch the full video here."
        },
        {
            "heading": 3,
            "text": "Why you applied for the Awards"
        },
        {
            "text": "We already felt extremely privileged to be a current Queen’s award recipient, having last achieved recognition in 2019. We knew that it was important to continue with this prestigious recognition and acknowledge how far as a company we have grown. Since 2019, we have officially launched a full (and ever-evolving) suite of products under our new name Mobilityways, making us the only B2B SaaS product that has the power to measure, reduce and report on an employer’s commuting emissions."
        },
        {
            "heading": 3,
            "text": "Why you chose Sustainable Development"
        },
        {
            "text": "Sustainable Development is at the heart of everything we do, and the core of our company mission to make zero carbon commuting a reality. It's also integral to our CLUB values and our strategic and tactical OKRs - both for the company as a whole, our teams and our individuals - we are all working together to ensure that sustainable development is not only achievable for us but our clients across the UK."
        },
        {
            "text": "The prestigious King’s Award gives recognition to these achievements and allows us a wider reach across the whole country so that we may help many other employers analyse and address their commuting emissions and sustainability goals."
        },
        {
            "heading": 3,
            "text": " How you found the application process "
        },
        {
            "text": "The application process was certainly intense and - rightly so - took an in-depth looking into all of our operations, business strategy and successes. We would recommend the application for any company making a sustainable impact."
        },
        {
            "heading": 3,
            "text": "How you feel about receiving the Award"
        },
        {
            "text": "The whole company are so thrilled to have won the award. It is a true reflection of everyone's hard work and dedication, and to know that this has been recognised by the King and his representatives means a lot to us."
        },
        {
            "text": "We hope to benefit by drawing further attention to Scope 3 commuter emissions and how organisations can successfully measure, report and reduce them, empowering them to achieve and take accountability for their net-zero goals."
        },
        {
            "heading": 3,
            "text": "Top tips for potential applicants "
        },
        {
            "text": "Focus on the importance of why you are doing what you are doing at your company, and what it means in terms of impact and the future for all of us. Support this with a clear demonstration as to how you are achieving against your mission statement."
        },
        {
            "text": " "
        },
        {
            "text": "www.mobilityways.com"
        },
        {
            "text": "Mobilityways on LinkedIn"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}