{
    "url": "https://aphascience.blog.gov.uk/2024/05/23/non-native-species/",
    "title": "APHA protecting our borders from non-native species",
    "authors": [
        "Emma Brand"
    ],
    "categories": [
        "Bee health",
        "Plant health",
        "Wildlife"
    ],
    "pub_date": "2024-05-23T14:00:01+01:00",
    "content": [
        {
            "text": "Invasive non-native species harm the environment, cost the economy almost £2 billion per year, and can even harm our health. Emma Brand from the Non-Native Species Inspectorate tells us about her work in this important area."
        },
        {
            "text": "---"
        },
        {
            "text": "The Non-Native Species Inspectorate (NNSI) was established in 2021 to help protect Great Britain from the threat posed by invasive non-native species. We work on a range of activities, and in this blog post I will cover just a few of the things we get up to!"
        },
        {
            "heading": 3,
            "text": "What are invasive non-native species?"
        },
        {
            "text": "Over 2,000 plants and animals have been introduced to Great Britain from all over the world by people. These are known as non-native species."
        },
        {
            "text": "Most are harmless, but around 10 to 15% become invasive non-native species which spread and have a harmful impact, such as the grey squirrel."
        },
        {
            "text": "Invasive non-native species (INNS) harm the environment, cost the economy almost £2 billion per year, and can even harm our health. Approximately 12 new non-native species are introduced each year, and it is our job in the NNSI to prevent these from establishing and becoming invasive."
        },
        {
            "text": "Our team works as enforcement officers under the Invasive Alien Species (Enforcement and Permitting) Order 2019, which lists 66 plants and animals which are tightly controlled due to their invasive nature; they are banned from sale, import, and breeding. These are split into ‘widely spread’ species, such as grey squirrel Sciurus carolinensis and floating pennywort Hydrocotyle ranunculoides; and ‘non-widely spread’ species such as raccoon Procyon lotor and tree of heaven Ailanthus altissima. It is these non-widely spread species that we want to prevent entering the country and gaining a foothold."
        },
        {
            "text": "There are a wide range of sectors in which there is a risk of animals and plants entering and spreading throughout the country. One of our main roles is to inspect these sectors to identify any possible threats or legislative non-compliance. Because invasive species can come from anywhere, our job has no ‘average’ day."
        },
        {
            "heading": 3,
            "text": "Horticulture"
        },
        {
            "text": "Horticultural escapes (accidental spreading of plants into the wild, usually from domestic properties/botanical gardens for example) are one of the major pathways of entry of INNS that we deal with in the team. During a regular week, we visit garden centres and aquatic stores to inspect for listed species. We often find mislabelling of plants (or no labels at all), and one of our biggest repeat offenders is curly waterweed Lagarosiphon major being sold simply as ‘oxygenating plant’, but when established can cause severe problems for native UK plants, wildlife and the environment! An important part of our role is education, and we talk to retailers about non-native species legislation and their responsibilities. In future I would like to see guidance on plant labels highlighting invasive plants and how to manage them. We also check for contamination of plants, especially Azolla in aquatic pond plant tanks. Azolla is very invasive, creating ‘carpets’ of green across waterbodies where it is present and can be dangerous for unsuspecting animals (and people!)."
        },
        {
            "heading": 3,
            "text": "Recreational water users"
        },
        {
            "text": "Some of my favourite days on the job are when we undertake angling and boating inspections. I have been lucky enough to spend some sunny summer days in the lake district, speaking with members of the public about invasive species as well as looking over their boats and boards for any contamination present. Check, Clean, Dry is a campaign run by our colleagues in the Non-Native Species Secretariat, reminding water users to clean and dry equipment in between uses to prevent the spread of invasive aquatic species between waterbodies. I have also helped run washdown stations (areas where canoes and kit can be cleaned) for participants at national canoeing events with The Wildlife Trusts and PaddleUK. Working with like-minded people and spreading the word about biosecurity is very enjoyable, especially when the sun is shining!"
        },
        {
            "text": "Unfortunately, at one of these events, I was reminded of the importance of washdown stations, as I found two demon shrimp Dikerogammarus haemobaphes on a canoe. These invasive shrimp prey on fish, their eggs, and other native animals and can hugely affect freshwater ecology. They are already present in the UK in some freshwater habitats, but it is vital to stop them from spreading further."
        },
        {
            "heading": 3,
            "text": "Inspecting containers at the border"
        },
        {
            "text": "We work with port authorities and the Plant Health and Seeds Inspectorate all over the country to inspect containers as they are unloaded or loaded at check points. Our aim is to understand the level of contamination that containers and shipments can bring. Some of our team members have found non-native ant species, seeds, and even a dead lizard in containers across the UK. We hope that our presence at the border and our continuing container inspections will reduce the likelihood that INNS will establish in the country from this pathway."
        },
        {
            "heading": 3,
            "text": "Zoos, wildlife parks and rescue centres"
        },
        {
            "text": "We check that premises holding any listed animal species have a permit or a licence to do so, so we can monitor movements of these animals and ensure there is no breeding or further import. We also determine whether enclosures for these animals are suitable (do they prevent escape, are they fit for purpose and so on) and ensure that listed animals are not used for members of the public to meet at ‘animal encounters’ or any extra commercial purpose. This is important to ensure the public understands the risks these animals pose and that there are no unnecessary movements of animals which could cause issues."
        },
        {
            "heading": 3,
            "text": "Engagement and awareness raising"
        },
        {
            "text": "Whilst out on inspections we like to focus on awareness raising of INNS, the legislation, and biosecurity, as many people are unaware of INNS and their impacts. We also attend trade shows and other events to speak with exhibitors or host stalls ourselves, and we cover a huge range of different events."
        },
        {
            "text": "Most recently, I attended an ant show, the Harrogate Flower Show, and the Plant Health and Seeds Inspectorate internal conference. We have had really good feedback following our attendance at events and members of the public are interested in what they can do to help which is fantastic."
        },
        {
            "heading": 3,
            "text": "Responding to the threat of Asian hornets"
        },
        {
            "text": "As well as the varied inspection role, we also respond to any reports of non-widely spread species in the wild. Our priorities are very dependent on season, location within the country, and reports of INNS in the wild. For example, my colleague, based on the south coast, spends a large portion of his spring and summer on deployment to the Animal and Plant Agency’s National Bee Unit responding to Asian Hornet sightings."
        },
        {
            "text": "I was able to spend some time on detached duty in Kent in mid-April to help with Asian Hornet queen monitoring. This was an interesting job, driving around the Kent countryside checking traps for hornets. I met several members of the public who were interested in doing what they could to help which was great to see."
        },
        {
            "text": "This week, I also did some engagement at our gold medal winning Asian Hornet themed Chelsea Flower Show exhibit. The exhibit uses informative panels, interactive visuals, and representative models to highlight the threat of Asian hornet to pollinators, especially honey bees, and helps people identify and report sightings using the Asian hornet app or online. It also promotes ways we can all help pollinators through plant choices in our gardens and window boxes."
        },
        {
            "text": "I feel very fortunate to be in this role, and I enjoy the hugely varied nature of the job. As we enter summer, I wonder what will come into my radar for the rest of the year. Could it be more tracking and camera trapping a raccoon in the wild? Spending more time with the hornet team? Another few weeks’ population monitoring for the invasive greater white toothed shrew? Who knows..."
        },
        {
            "heading": 3,
            "text": "Find out more:"
        },
        {
            "text": "20 - 26 May is Invasive Species Week. Find out more and take part!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}