{
    "url": "https://homeofficemedia.blog.gov.uk/2024/05/23/reducing-net-migration-factsheet-december-2023/",
    "title": "Reducing Net Migration Factsheet – May 2024",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-05-23T16:40:08+01:00",
    "content": [
        {
            "text": "The UK has experienced high levels of immigration in recent years."
        },
        {
            "text": "Last year resulted in over 95,000 people immigrating to the UK through our various schemes for those seeking sanctuary. Recent rises are also the result of more students and care workers, including their dependants, coming to the UK."
        },
        {
            "text": "The government  made a commitment to bring numbers down and, this year,  brought into a force a series of measures which would mean approximately 300,000 people who came to the UK last year would now not be able to - the largest ever reduction in legal migration."
        },
        {
            "text": "The latest official estimates from the Office for National Statistics (ONS) indicate that net migration in the year ending December 2023 stood at 685,000, compared with an updated estimate of 764,000 for the year ending December 2022. This latest estimate does not take into account any of the government’s policy reforms, which have since come into force throughout early 2024."
        },
        {
            "text": "The latest show:"
        },
        {
            "heading": 3,
            "text": "Reforms to Reduce Legal Migration"
        },
        {
            "text": "Policy reforms that the government has brought into force from the start of this year include:"
        },
        {
            "heading": 3,
            "text": "Student Visas and Graduate route"
        },
        {
            "text": "From courses starting on the 1 January, international students have been restricted from bringing family members, aside from those taking postgraduate research courses and those with government-funded scholarships."
        },
        {
            "text": "The UK’s world-leading universities attract some of the best students from around the world to the UK, but we have seen a surge in the number of dependants accompanying students. The government has introduced policy reforms in an attempt to limit the number of student arrivals.. In the first four months of this year, dependant applications have fallen by 79% with more than 30,000 fewer applications compared to the same period last year."
        },
        {
            "text": "The changes, first announced last May, have also stopped people from using the student visa as a route to work in the UK by removing the right for students to switch into work visa routes before they complete their studies."
        },
        {
            "text": "In March, the government commissioned the Migration Advisory Committee (MAC) to conduct a rapid review of the Graduate route. The government has accepted the MAC’s recommendations and has announced a series of measures to tackle abuse and crack down on any misuse of student visas. These include:"
        },
        {
            "text": "Is the government committed to its International Education Strategy and international students?"
        },
        {
            "text": "How is the government supporting universities?"
        },
        {
            "text": "Why haven’t you closed the Graduate route? "
        },
        {
            "text": "When will new measures announced in May take effect?"
        },
        {
            "text": " Will these new measures affect universities in the devolved nations?"
        },
        {
            "heading": 3,
            "text": "Care Worker Visas"
        },
        {
            "text": "From 11 March, care workers can no longer bring dependants with them.. In the first full month that this measure had been in force, applications for Health & Care dependant visas fell by 58%, from 15,100 in April 2023 to 6,400 in April 2024."
        },
        {
            "text": "Care providers sponsoring migrant workers in England are also now required to register with the Care Quality Commission (CQC) – the industry regulator for Health and Social Care – in order to address concerns about non-compliance, worker exploitation and abuse within the sector of overseas workers."
        },
        {
            "heading": 4,
            "text": "Care Worker Dependants"
        },
        {
            "text": "Do these measures limit care workers?"
        },
        {
            "text": "What is the government doing to recruit more domestic based care workers?"
        },
        {
            "heading": 4,
            "text": "Care Quality Commission Registration "
        },
        {
            "text": "Have any care workers already here lost their jobs because their sponsor is not currently CQC registered?"
        },
        {
            "text": "How will this requirement address concerns of abuse and exploitation?"
        },
        {
            "heading": 3,
            "text": "Skilled Worker Visas and Immigration Salary List"
        },
        {
            "text": "From 4 April, the salary threshold for a Skilled Worker visa has risen by 48% to £38,700, ensuring businesses pay significantly more if they recruit from overseas."
        },
        {
            "text": "The Shortage Occupation List has been replaced with a new Immigration Salary List and the 20% going-rate discount has been abolished. These measures will ensure employers can no longer pay migrants less than UK workers in shortage occupations."
        },
        {
            "text": "Roles on the list are only included where they are skilled and in shortage., and if it is sensible to include them considering the efforts being made by sectors to invest in the resident workforce. Inclusion on the list must not serve to reduce pay and undermine the recruitment of British workers."
        },
        {
            "text": "This follows the government introducing the £2.5 billion Back to Work Plan with the intention to support a further 1.1 million people who are long-term unemployed, long-term sick or disabled break down barriers to work."
        },
        {
            "text": " What specifically is the government doing to support British workers into work?"
        },
        {
            "text": " Why was the salary threshold increased to 48%?"
        },
        {
            "text": "How is the new Immigration Salary List different to the Shortage Occupation List?"
        },
        {
            "heading": 3,
            "text": "Family Visas"
        },
        {
            "text": "On 11 April, the minimum income required to sponsor someone coming to the UK on a family visa increased from £18,600 to £29,000 – an increase of more than 55%. By early 2025, this will have increased 2 more times, rising to £38,700 – to meet the new salary threshold for a Skilled Worker visa."
        },
        {
            "text": "The government’s longstanding principle is that anyone bringing dependants to live in the UK must be able to financially support them. The minimum income requirement ensures that families are self-sufficient instead of relying on public funds, with the ability to integrate if they are to play a full part in British life."
        },
        {
            "text": "How will it apply to those already here?"
        },
        {
            "text": "Why did you pick £38,700?"
        },
        {
            "text": "How can the applicant’s income be taken into account?"
        },
        {
            "text": "Will families be split up?"
        }
    ]
}