{
    "url": "https://nationalscreening.blog.gov.uk/2023/08/07/consultation-opens-on-use-of-digital-pathology-in-breast-bowel-and-cervical-cancer-screening/",
    "title": "Consultation opens on use of digital pathology in breast, bowel and cervical cancer screening ",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-08-07T09:05:29+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is consulting on the use of digital pathology in the analysis of cancer screening samples."
        },
        {
            "text": "We are consulting on whether providers and commissioners can safely use digital pathology in existing cancer screening programmes, excluding cytology, as an alternative to light microscopy."
        },
        {
            "text": "The consultation opens today and will close on Friday 15 September at 5pm."
        },
        {
            "text": "Digital pathology is a technology that allows glass histopathology slides to be reviewed digitally on a computer screen, rather than with a microscope. This has advantages in terms of flexibility, efficiency and workforce pressures."
        },
        {
            "text": "The results of a Health Technology Assessment (HTA) multi-site study, along with expert opinions, have led the committee to agree that digital pathology performs as well as light microscopy for histopathology in cancer screening."
        },
        {
            "text": "The study focused on breast and bowel cancer, but our expert stakeholders are confident its findings are also likely to be robust for cervix histopathology. The UK NSC did not carry out a cost effectiveness exercise."
        },
        {
            "text": "Responses to the consultation should be emailed to screeninginformation@dhsc.gov.uk by Friday 15 September."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}