{
    "url": "https://ssac.blog.gov.uk/2023/08/07/disability-health-and-social-security-the-importance-of-effective-scrutiny/",
    "title": "Disability, health and social security: the importance of effective scrutiny",
    "authors": [
        "Liz Sayce"
    ],
    "categories": [
        "Department for Communities (Northern Ireland)",
        "Disabled People",
        "DWP",
        "Independent advice",
        "Legislation",
        "social security",
        "Stakeholders"
    ],
    "pub_date": "2023-08-07T09:04:27+01:00",
    "content": [
        {
            "text": "As I move on from being part of the Social Security Advisory Committee (SSAC) I’m doing a little reflecting. SSAC may not be the highest profile body – its activities are technical and detailed by nature - but its work to advise Government and scrutinise draft regulations can make policy better. The Hansard Society, for instance, recently suggested it would be in the interests of Government to consider whether other departments (in addition to the Department for Work and Pensions (DWP) and Northern Ireland’s Department for Communities (DfC(NI)) would benefit from establishing similar bodies to ensure there was full consideration of draft regulations before they were finalised.[1]  SSAC, through the diverse expertise of its members, can advise on whether proposed measures would effectively meet their purpose, whether they risk unintended consequences (and if so, for whom), whether these risks could be mitigated, whether the plans are deliverable and so forth."
        },
        {
            "text": "Nowhere, perhaps, are scrutiny and advice more important than in relation to the large number of disabled people who rely on social security benefits for financial, housing, food, mobility and other forms of security in their lives. Over four million claim extra costs benefits (Personal Independence Payment, Disability Living Allowance or Adult Disability Payment) and 1.7 million claim the out of work benefit Employment and Support Allowance - in addition to those claiming regular (not disability-specific) out of work benefits.[2] Social security is central to many disabled people’s lives."
        },
        {
            "text": "The Joseph Rowntree Foundation (2023)[3] note that of all families living in poverty, just under half include at least one disabled member. Working age disabled people (including of course those living with long-term health conditions that adversely impact on day to day activities) are more likely than non-disabled people to experience deep poverty and food insecurity. Disabled people in work are more likely than others to work part-time and/or in lower paid roles, thereby requiring social security support to supplement wages."
        },
        {
            "text": "It is outside SSAC’s remit to comment on benefit levels, this being a decision for Government. The discussion on proposals to link rates to costs of essentials is well documented elsewhere.[4]"
        },
        {
            "text": "But what SSAC can and does do is to analyse draft regulations and offer advice in relation to their potential impact on disabled people. To that end SSAC has suggested improved overall approaches to assessing impacts on different groups in society, now being taken forward; and has repeatedly probed potential impacts of specific regulations, in relation to both the substance of proposals and the accessibility of services and processes. All SSAC’s minutes are published so examples of scrutiny are available. SSAC has also produced advice on issues including:"
        },
        {
            "text": "All of the Committee’s reports, and Government responses, can be found on our website."
        },
        {
            "text": "In all this work it has been imperative to start from evidence and from an appreciation of disabled people’s experiences, future ideas and challenges that many face, including barriers to employment, poverty and trust in the social security system. That appreciation only comes through engagement with disabled people with diverse experiences and perspectives.  At best social security can and could offer a bedrock of security from which people can take steps to improve their lives and those of their families. As I move on from SSAC, I’d like to thank all the disabled people, Disabled People’s Organisations, academics and policy experts that have contributed. It’s been a privilege to be part of the process of generating scrutiny and advice - and I wish all my successors well, including in centrally reflecting the impacts of social security on disabled people’s lives and security."
        },
        {
            "text": " "
        },
        {
            "text": "[1] Proposals for a New System for Delegated Legislation: A Working Paper of the Hansard Society Delegated Legislation (2023)"
        },
        {
            "text": "[2]  DWP Benefit Statistics (February 2023)"
        },
        {
            "text": "[3] Joseph Rowntree Foundation, UK Poverty 2023: The essential guide to understanding poverty in the UK"
        },
        {
            "text": "[4] See, for instance, the Trussell Trust"
        }
    ]
}