{
    "url": "https://ruralpayments.blog.gov.uk/2023/08/07/introducing-you-to-20/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2023-08-07T12:52:18+01:00",
    "content": [
        {
            "text": "Hello, I’m Vaneshree and I work on the Sustainable Farming Incentive (SFI) Pilot, based in Worcester. I help to resolve queries from land managers and agents, as well as processing applications and monitoring agreements."
        },
        {
            "text": "I’ve been with for RPA for five year years now, joining the Sustainable Farming Incentive Pilot in 2021, after more than three years with Countryside Stewardship."
        },
        {
            "text": "Working on the frontline of operational delivery, my days are very varied. I’ll speak to land managers who have varied questions, that can range from what capital items they may be eligible for on their land, to queries on the new SFI schemes."
        },
        {
            "text": "I’ve built fantastic relationships with my immediate team as well as with colleagues across our offices. This strong network helps us all find vital information and make sure we’ve got the right answers for farmers and land managers, helping them to make informed decisions."
        },
        {
            "text": "Where I think my role has the greatest impact on farmers and land managers is being able to take responsibility for a case and see it through to completion. I process Capital Grant applications where land managers can apply for items that are beneficial for them to carry out their environmental actions. Once their agreements are live, I help with validating the evidence for any completed work so their claim can be processed and paid promptly. Due to the initial outlay of expenditure to carry out any work, farmers are pleased to have their claim processed very quickly."
        },
        {
            "text": "I draw a great deal of satisfaction from being able to help everyone, but especially those that require special assistance, such as being challenged with digital technology. The Sustainable Farming Incentive Pilot has been mostly digital, but exceptions have been made and wherever possible, I help by providing the necessary information."
        },
        {
            "text": "I recently helped a vulnerable customer during a phone call involving a submission of their annual declaration. They were experiencing a major financial hardship and desperate for the payment that was due on their Pilot agreement. I contacted them with regular updates and sought advice from my manager on ways we could expedite their payment. Following confirmation of their completed environmental actions and declaration submission, we were able to process their payment and offer some relief during their crisis."
        },
        {
            "text": "Many customers enjoy being able to interact on a personal level and I regularly offer the opportunity for customers to get in touch with the helpline and request a direct call back."
        },
        {
            "text": "I’m regularly involved in multiple work areas and I also enjoy volunteering opportunities, for example, I’m presently training as an Emergency Reserve for Defra, which involves mixing with people from across the whole of Defra and possibly be able to be of assistance in an emergency."
        },
        {
            "text": "Outside of work cooking has always been a passion of mine and I love experimenting with different ingredients – I’m now playing around with Korean recipes. My culinary skills acquired through the years helped nurture a dream of owning a vegetarian restaurant which was finally realised and successfully run for almost 10 years."
        },
        {
            "text": "I also love meeting up with my friends and going on long walks, while my absolute favourite treat is getting away to the seaside."
        },
        {
            "text": "Growing up in South Africa, which is known as the ‘rainbow nation’, has allowed me the opportunity to embrace the cultural diversity of people from all over the world. My family ties are quite strong even though I’m thousands of miles away. Growing up within our Hindu household, my parents had implanted wonderful, wholesome traditions that my sisters and I continue to draw from, daily, be it through our shared love of vegetarian cooking, celebrating the special holidays or our passion for Indian fashion. I’ve lived in the UK for about 20 years and have made it my special second home and I love it here. The mantra I live by is ‘Be the change you wish to see in the world.’"
        }
    ]
}