{
    "url": "https://marinescience.blog.gov.uk/2023/08/07/one-year-on-cefas-generates-new-tools-and-evidence-to-support-marine-natural-capital-programme/",
    "title": "One year on: Cefas generates new tools and evidence to support marine natural capital programme",
    "authors": [
        "Michelle Devlin",
        "Will Le Quesne",
        "Naomi Greenwood",
        "Clement Garcia",
        "Ruth Parker"
    ],
    "categories": [
        "adaptation",
        "biodiversity",
        "Climate Change",
        "mNCEA",
        "Policy",
        "Science"
    ],
    "pub_date": "2023-08-07T08:52:23+01:00",
    "content": [
        {
            "text": "Natural capital refers to parts of the natural environment, such as forests, fisheries, rivers, biodiversity, land and minerals, that provide valuable goods and services to society. Much like human capital (labour, skills and experience), recent reviews recognise that natural capital should be seen as an economic asset that if managed effectively, can bring a whole range of benefits for society and environment."
        },
        {
            "text": "In the ocean, the natural capital approach helps us consider the value of things like natural resources, fishing, recreation, coastal protection and/or offshore wind. It also helps us see the ocean as an interconnected system rather than individual parts. This helps address a key challenge where a lack of clear evidence and data results in markets and institutions not reflecting the true value of the goods and services that our oceans provides. With increasing pressure on our oceans for food and energy production, effective policy making requires considering a broad range of economic, social, and environmental data to make complex decisions and trade-offs."
        },
        {
            "text": "Our understanding of the true benefits that our oceans provide is improving through the  Marine Natural Capital and Ecosystem Assessment (mNCEA) programme. Part of Defra’s flagship Natural Capital and Ecosystem Assessment (NCEA) programme and started in 2022, mNCEA is a 3-year programme which aims to deliver the evidence, tools and guidance needed to help policymakers integrate natural capital approaches into policy and decision making for marine and coastal environments. Taking into account the whole marine system, Cefas works alongside its partners the Environment Agency, Joint Nature Conservation Committee, Marine Management Organisation, and Natural England to deliver these projects and outcomes."
        },
        {
            "text": "Having completed its first year, we are pleased to announce the following outputs are now available as proof-of-concept:"
        },
        {
            "text": "Dr Michelle Devlin, Cefas Principal Investigator  for Nearshore Water Quality said:"
        },
        {
            "text": "“The mNCEA programme is an exciting and innovative approach to valuing the many different aspects of our marine environment. We all intrinsically know there is value, but it means many different things to many different people, and the work under this programme will help provide increased clarity and understanding of those values, and how we can protect them”."
        },
        {
            "text": "Dr Clement Garcia, Lead of the mNCEA Seascapes programme added:"
        },
        {
            "text": "“The first year of mNCEA has laid a the ground work for better understanding and assessing marine natural capital. From this baseline understanding, we are now working on year 2 and beyond projects, and look forward to delivering a more comprehensive understanding of the benefits provided by our marine environment.”"
        },
        {
            "text": "Please reach out to marineNCEA@defra.gov.uk with questions or if you would like to be put in touch with project leads."
        },
        {
            "text": "We will continue to share outputs from our proof-of-concepts and first year of the programme as these become available.  Follow the link to  https://randd.defra.gov.uk/ to see all reports."
        }
    ]
}