{
    "url": "https://space.blog.gov.uk/2023/08/07/perseids-and-planets-the-night-sky-in-august/",
    "title": "Perseids and planets: the night sky in August",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-08-07T15:29:57+01:00",
    "content": [
        {
            "text": "With the Milky Way overhead, Saturn at its brightest, a very exciting meteor shower and the chance to see noctilucent clouds, August is the perfect month for some nights of stargazing!"
        },
        {
            "heading": 2,
            "text": "The Perseid Meteor Shower"
        },
        {
            "text": "Around the middle of August each month, Earth’s journey around the Sun intersects with the orbit of another object, Comet Swift-Tuttle.  This comet only passes through the inner solar system every 133 years, but at this time each year, Earth ploughs through the trail of debris left behind this 26km (16 mile)-wide ball of rock, ice and dust."
        },
        {
            "text": "As the debris fragments fall into our atmosphere, most of them no larger than the size of a pea, they’re travelling at around 58km (36 miles) per second.  This causes them to heat up to around 1,600 degrees Celsius, burning up and streaking across our skies as meteors or ‘shooting stars’."
        },
        {
            "text": "The fragments from Comet Swift-Tuttle create one of best meteor showers of the year, and excitingly, the peak of the shower this year coincides with the darker skies of the new Moon.  While meteors will be visible all month, numbers rise significantly between 9 and 16 August, and up to 100 meteors an hour could be visible on the nights of 12 – 13 August."
        },
        {
            "text": "Comet Swift-Tuttle’s size makes it the largest known object to cross Earth’s path.  Its highly eccentric orbit takes it far out beyond the orbit of Pluto, the rocky, icy body that was formerly classified as a planet, and that orbits around 8 billion kilometres (5 billion miles) away from Earth – some 40 times further from the Sun than we are."
        },
        {
            "text": "Chinese astronomers recorded observations of this comet over 2,300 years ago, and its next pass through the inner Solar System in 2125 will be a phenomenal sight.  Some ten times larger than Comet Neowise (pictured) that passed 105 million km (65 million miles) from Earth in 2020, Comet Swift-Tuttle will pass just over 16 million km (10 million miles) from Earth."
        },
        {
            "heading": 3,
            "text": "Perseid Meteor Shower observing tips"
        },
        {
            "text": "Wishing you clear skies and lots of meteors!"
        },
        {
            "heading": 2,
            "text": "Other night sky sights"
        },
        {
            "text": "Saturn and Earth are at their closest point to each other in their orbits around the Sun this month, meaning the ringed planet is currently at its brightest in our night skies.  It rises in the south-east soon after dark and is at its best in the early hours of the morning, high in the south."
        },
        {
            "text": "If you’re waiting up to try and spot Saturn and the meteors, you’ll see Jupiter, which rises in the east a couple of hours after Saturn, and there’s also a chance of spotting rare Noctilucent Clouds.  Check out our recent blog for more information on how to spot this beautiful phenomenon."
        },
        {
            "heading": 2,
            "text": "A Blue Super Moon"
        },
        {
            "text": "When two full moons appear in one calendar month, the second is referred to as a ‘Blue Moon’.  With a full lunar cycle (the time between two full moons) taking around 29.5 days you can see how the expression “once in a blue Moon” has come to mean “very rarely”.  Blue moons usually occur once every 2 or 3 years, and August’s Blue Moon will fall on the night of 30-31 August."
        },
        {
            "text": "Did you know?"
        },
        {
            "text": "It takes around 27.3 days for the Moon to orbit the Earth, but a full lunar cycle (the time between full moons) is around 29.5 days. This is because the Earth has moved in its orbit around the Sun in that time, so the Moon must travel further to be in the same position relative to the Sun and the Earth."
        },
        {
            "text": "While this month’s ‘Blue Moon’ won’t appear blue, the Moon can appear in a range of different colours, depending on how particles in our atmosphere scatter light.  Ash in the atmosphere following the explosion of the Krakatoa volcano in the 1880s led to several reports of the Moon appearing blue.  It’s more normal to see the Moon appear yellow orange when it’s close to the horizon, and it can appear red during a lunar eclipse."
        },
        {
            "text": "The orbit of the Moon around Earth is not completely circular, so it moves closer and further away from our planet.  This month’s ‘Blue Moon’ will occur when the Moon is near its closest point to Earth, and will therefore appear around 8% larger, and 15% brighter in our night sky, an event recently termed a ‘supermoon’."
        },
        {
            "text": "If you catch any photos of the blue supermoon or the Perseid meteor shower this month, share them with us on social media!"
        },
        {
            "heading": 2,
            "text": "Space science and exploration"
        },
        {
            "text": "NASA’s James Webb Space Telescope completed its first year of science last month.  Check out some of the stunning images it has captured here."
        },
        {
            "text": "The European Space Agency’s Euclid mission to study the composition and evolution of our universe has successfully arrived at its deep-space destination following last month’s launch.  Find out more about the mission and see the images it has captured during its testing phase here."
        }
    ]
}