{
    "url": "https://moderncivilservice.blog.gov.uk/2023/08/07/take-a-peek-at-the-government-campus/",
    "title": "Take a peek at the Government Campus",
    "authors": [
        "Modernisation and Reform unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Modernisation and Reform",
        "Skilled"
    ],
    "pub_date": "2023-08-07T15:35:40+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is the Government Campus?"
        },
        {
            "text": "The aim of the Government Campus is to help all civil servants build the skills, knowledge and networks they need to serve the government now and in the future."
        },
        {
            "text": "The Government Campus was launched in 2020 by the Government Skills and Curriculum unit, to nurture a culture of learning across the Civil Service, giving us all the capability to keep adapting our services to support, improve and save the lives of millions of people across the UK."
        },
        {
            "text": "The Campus makes it easier to source, select and attend training, also acting as a central resource for all departments, helping to provide effective learning and development at a lower cost and with less duplication. It plays an important role in delivering the Capability mission for A Modern Civil Service, one of our five missions for reform. "
        },
        {
            "heading": 2,
            "text": "How does the Government Campus support the learning and development of civil servants?"
        },
        {
            "text": "The Government Campus provides access to quality assured, evaluated and accessible training - both online and in-person. The five strands of the curriculum, set out in the image below, are:"
        },
        {
            "heading": 2,
            "text": "What’s been delivered so far?"
        },
        {
            "text": "In the first quarter of  2023 around 82,000 bookings were made for training through the Campus, equivalent to one sixth of the Civil Service. Some of the most popular learning courses include:"
        },
        {
            "text": "The Campus also helps to upskill new and existing staff through apprenticeships. Working with a range of learning providers it offers over 40 apprenticeship standards, across priority areas such as digital, policy, project delivery and HR. Alongside this, it has now successfully completed the 2023 fast stream recruitment campaign, making 1,084 offers across 15 schemes."
        },
        {
            "heading": 2,
            "text": "What’s coming up?"
        },
        {
            "text": "The Campus is constantly refreshing, improving and expanding the courses on offer, making sure we have the right tools, skills and leadership to serve the nation in the most effective way we can. In 2023 it will offer the next phase of the Digital Excellence Programme as well as supporting One Big Thing, a new annual initiative for civil servants to take shared action each year around a reform priority. The focus for 2023 is data upskilling, with all civil servants undertaking a day’s worth of data training in Autumn."
        },
        {
            "text": "A new senior practitioner management programme, a new drafting excellence course and a new advising and briefing course for those working with senior officials will also be available."
        },
        {
            "heading": 2,
            "text": "Next steps for civil servants"
        },
        {
            "text": "Good quality learning and development helps people deliver their personal and departmental goals. All civil servants should regularly review and discuss with their line manager the skills, knowledge and networks they need to meet their objectives and build their career. Skills development is best planned using the 70:20:10 model:"
        },
        {
            "text": "Civil servants can find information on GOV.UK about the curriculum, along with help to navigate what’s on offer and recommendations for popular and relevant courses. The Government Campus Prospectus sets out the wider learning offer. "
        },
        {
            "text": "Many courses are free and are available from the Civil Service Learning portal (registration required). Civil servants can also receive monthly updates on the Government Campus by signing up to Campus News."
        }
    ]
}