{
    "url": "https://ukhsa.blog.gov.uk/2023/08/07/the-importance-of-global-surveillance-to-identify-pandemic-threats/",
    "title": "The importance of global surveillance to identify pandemic threats",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-08-07T16:34:59+01:00",
    "content": [
        {
            "text": "As UKHSA’s new Strategic Plan sets out in detail, one of our most important goals is to prepare for future health security hazards, including pandemics."
        },
        {
            "text": "The COVID-19 pandemic reinforced to the world that the early days of a pandemic are crucial, with swift action required by governments, industry and academia to translate science into public health action."
        },
        {
            "text": "In 2021, under the UK’s G7 presidency, a global public-private initiative called the 100 Days Mission was launched to ensure that key interventions we have to defeat pandemics – diagnostics, therapeutics and vaccines – could be deployed equitably within 100 days of recognising a new threat."
        },
        {
            "text": "A UK Secretariat for the 100 Days Mission has been established in UKHSA with responsibility to co-ordinate and champion UK progress, and today we have published a new report The 100 Days Mission – how the UK is contributing to the global mission to develop pandemic-fighting tools within 100 days."
        },
        {
            "text": "In a future pandemic, quickly deploying tests, vaccines and treatments could save countless lives but the 100 Days Mission also recognises the importance of surveillance; the ability to identify threats with pandemic potential as quickly as possible and share data widely."
        },
        {
            "text": "The 100 Days Mission report sets out a range of work under way to help meet ambitions such as building the UK's and supporting the world's global surveillance capability. In this blog post we are focussing on one of the initiatives UKHSA leads to support surveillance around the world: the New Variant Assessment Platform (NVAP)."
        },
        {
            "heading": 3,
            "text": "What is the New Variant Assessment Platform?"
        },
        {
            "text": "Launched in April 2021, NVAP is a global genomic surveillance programme, which initially offered support to countries that wanted to build their capacity and capability to effectively identify, assess and track new COVID-19 variants among their population. The initiative is now expanding to cover other pathogens."
        },
        {
            "text": "Through NVAP, UKHSA supports partners across the globe to strengthen their genomic sequencing capability, either by building on existing infrastructure or by conducting sequencing and analysis of samples here in the UK if requested."
        },
        {
            "text": "By improving global genomic surveillance, we can better track the emergence or spread of a virus, how it is changing, and how those changes may affect public health."
        },
        {
            "text": "The improvements in genomic sequencing and surveillance through global partnerships that NVAP has established has a much wider use beyond COVID-19. For example, sequencing can be used to understand and control public health threats such as tuberculosis, antimicrobial resistance, polio and HIV, as well as for future pandemic risks due to new and emerging infections."
        },
        {
            "text": "Initiatives like NVAP are crucial, as COVID-19 highlighted that no nation is safe until every nation is safe. Through countries learning from each other, sharing expertise, training and practical support we can make all nations better prepared."
        },
        {
            "heading": 3,
            "text": "What has NVAP achieved so far?"
        },
        {
            "text": "The UK was well placed to set up NVAP during the COVID-19 pandemic as we have large-scale sequencing capacity and extensive specialist expertise."
        },
        {
            "text": "NVAP currently has collaborations with 18 countries and 6 regional partners across the globe, including Brazil, Ethiopia, Kenya, Pakistan and Chile."
        },
        {
            "text": "Each partnership is bespoke and based on the specific needs of the particular country or region, whether that be training of scientists, provision of supplies or equipment, expert advice on development of genomic sequencing systems, or arranging for testing of overseas samples in UK laboratories to study the impact of variants on drugs, vaccines or therapeutics."
        },
        {
            "text": "For instance, we have provided equipment like sequencers and sequencing reagents and kits for many international partners, facilitated scientific exchanges with UKHSA experts and conducted structured training on bioinformatics, characterisation of variants, risk assessment and provided advice on biological assessment on variants."
        },
        {
            "text": "Through every one of these partnerships we gain great mutual benefit, as we share learning and experiences on how we can rapidly detect and characterise novel pathogens and strengthen surveillance systems to monitor for future threats."
        },
        {
            "text": "Along with supporting the 100 Days Mission, NVAP is also a significant example of the UK’s contribution to the World Health Organization’s global genomic surveillance 10-year plan and the International Pathogen Surveillance Network (IPSN) that aims to accelerate and sustain the developments in genomics for improving health security."
        },
        {
            "heading": 3,
            "text": "What’s the future for NVAP?"
        },
        {
            "text": "NVAP will continue to be a vital initiative for monitoring COVID-19 and become increasingly important for identifying emerging pathogens of concern, with more partners sharing genomic data globally to inform early alert and response."
        },
        {
            "text": "Its close integration with the 100 Days Mission highlights the importance of global cooperation, continuing to expand UKHSA’s work to other countries and regions worldwide to help global health security efforts."
        },
        {
            "text": "By working together to monitor and assess new COVID-19 variants or new and emerging viruses we can take proactive measures to strengthen global health security – protecting people here in the UK and abroad."
        },
        {
            "text": "The 100 Days Mission recognises that speed is of the essence in a pandemic, but it is also committed to equity, resilience and security, both domestically and globally. The initiative reinforces the vital importance of ensuring surveillance systems, diagnostics, therapeutics and vaccines are available in a timely manner in low- and middle-income countries."
        },
        {
            "text": "For more information about the UK contribution to the 100 Days Mission please read the new report on GOV.UK which, along with surveillance, also features progress on research and development of diagnostics, therapeutics and vaccines, manufacturing capacity and capability, clinical trials and regulation and financing."
        },
        {
            "text": "You can also read the 2022 100 Days Mission annual implementation report, published in January 2023 by the International Pandemic Preparedness Secretariat, for information on global progress towards this important mission"
        }
    ]
}