{
    "url": "https://ukhsa.blog.gov.uk/2023/08/07/the-science-behind-life-saving-vaccines/",
    "title": "The science behind life-saving vaccines",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-08-07T10:14:56+01:00",
    "content": [
        {
            "text": "UKHSA recently published a new Strategic Plan setting out how we will prepare for future health threats, respond to threats around us now and build health security capability."
        },
        {
            "text": "One of our 6 strategic priorities for the next 3 years is to improve health outcomes through vaccination and the work we do in our labs to develop and evaluate vaccines is a crucial aspect of this."
        },
        {
            "text": "It’s well known that vaccines have been a vital public health tool in recent generations, saving millions of lives every year around the world, in turn protecting public services and economies."
        },
        {
            "text": "But the COVID-19 pandemic marked the start of a new era in in vaccine development, prompting collaboration, commitment and speed that would previously have been unimaginable."
        },
        {
            "text": "And with the knowledge we now have on the art of the possible, further exciting vaccines will follow in the coming years, saving many more lives."
        },
        {
            "text": "This can only be achieved through a network of scientific partnerships including organisations like the World Health Organisation and Coalition for Epidemic Preparedness Innovations (CEPI), through to multinational pharmaceutical companies, universities and national public health agencies."
        },
        {
            "text": "UKHSA is privileged to play a central role, and we are well placed to contribute globally due to our expertise in every aspect of a vaccine’s life cycle."
        },
        {
            "text": "An exciting aspect of UKHSA’s contribution is the establishment of our Vaccine Development and Evaluation Centre (VDEC) at Porton Down, which will help to ensure that the UK has the vaccines we need to protect the public from major infectious disease threats we face in future."
        },
        {
            "text": "VDEC brings together our combination of expertise and facilities – often rare or unique in the UK and worldwide – from our ability to safely handle the world’s most dangerous pathogens through to our quality-systems which mean the data we generate is trusted by national and international regulators."
        },
        {
            "text": "In this blog we’ll talk about how VDEC works with partners to ensure life-saving vaccines get to the people who need them, both here in the UK and across the world."
        },
        {
            "heading": 3,
            "text": "Identifying potential vaccines"
        },
        {
            "text": "Our research programmes look at vaccines which could tackle pathogens that have the ability to cause a future pandemic, including  “disease X” through to studying vaccines that could better protect against the viruses and bacteria we already know about."
        },
        {
            "text": "Current UKHSA activity includes studying common infections like Tuberculosis (TB), a bacterial infection that kills millions, or Clostridium difficile, a bacterial infection that can cause significant problems in healthcare settings."
        },
        {
            "text": "We also look at pathogens with the potential to cause future health emergencies such as hantavirus, a severe infection that can pass from rodents to humans and Crimean-Congo haemorrhagic fever, a virus that is spread by the bite of an infected tick and is sadly fatal in about 30% of cases."
        },
        {
            "text": "Antimicrobial resistance is a major concern in the UK and beyond and our scientists are working  collaboratly with national and international partners to ensure new treatments are developed, evaluated and licensed."
        },
        {
            "text": "In all of these cases, we identified that there is a public health risk, and that vaccines either don’t exist, aren’t regulated for UK use or could be improved, so we work to develop the antigens (weakened or inactive parts of a particular organism that triggers an immune response within the body) that could make a vaccine."
        },
        {
            "text": "Our partnerships are crucial as we use our links with pharmaceutical companies to discuss the potential to manufacture these vaccines in future, which UKHSA would then support through the rest of the vaccine life cycle."
        },
        {
            "heading": 3,
            "text": "Ensuring emerging vaccines are safe and effective "
        },
        {
            "text": "Before vaccines can enter clinical trials, we must assure ourselves they are safe and effective for testing in humans."
        },
        {
            "text": "This requires the use of biological models, created by carrying out research using animals to mimic the process of infection and vaccination in humans."
        },
        {
            "text": "The use of animals in this work is currently essential as national and global laws require that vaccines are tested on animals before being licensed for use."
        },
        {
            "text": "UKHSA is fully committed to openness and transparency with the public about when, how and why we use animals in our research, and we publish a report on this each year and maintain an active programme to replace, reduce and refine the use of animals in our research."
        },
        {
            "text": "An example of where biological models played a vital role is the work to develop a Crimean-Congo haemorrhagic fever vaccine referenced above. This vaccine is now progressing into clinical trials and could be used to protect both humans and animals from the virus."
        },
        {
            "heading": 3,
            "text": "Supporting clinical trials"
        },
        {
            "text": "Before a vaccine is distributed to the whole population significant work is required to study safety and effectiveness and UKHSA works with international organisations and pharmaceutical companies who are carrying out clinical trials."
        },
        {
            "text": "We operate at the most stringent regulatory standards to ensure the data we produce is of a high quality and where we are working with volunteers (who may for instance provide blood samples for lab work) we explain and protect their rights."
        },
        {
            "text": "A project we are proud of is the development of a test method which involves combining a blood sample containing antibodies generated by vaccines with the COVID-19 virus to determine how effective antibodies are at preventing infection."
        },
        {
            "text": "This led onto a partnership with CEPI to share this method with other labs around the world to support and speed up their pandemic response."
        },
        {
            "text": "We have now transferred this “Micro neutralisation test” to labs in Europe and Asia, with further transfers to South American and African labs planned. The CEPI Central Labs Network is now expanding to support capability for other vaccines including mpox."
        },
        {
            "text": "And while diseases like COVID-19 and mpox hit the headlines, behind the scenes UKHSA has also contributed to the roll out of other vaccines such as routine vaccines offered to children every year, from the flu nasal spray to diphtheria and pertussis."
        },
        {
            "heading": 3,
            "text": "Ongoing monitoring of vaccines"
        },
        {
            "text": "Work to assess the effectiveness of a vaccine doesn’t stop even when it’s in widespread use."
        },
        {
            "text": "The safety of vaccines, such as reports of side effects, are closely monitored by regulators like MHRA and at UKHSA our science, using studies in our labs and real-world data from the community, plays a key role in shaping policy decisions on the vaccines that are purchased and used in the UK."
        },
        {
            "text": "For instance, we know that COVID-19 remains a risk so we must ensure vaccines are available and effective against circulating variants. Our science supports UKHSA’s COVID-19 vaccine unit (a recent addition to UKHSA, previously known as the Vaccine Task Force) who ensure that the UK has access to the right vaccines at the right time for different groups across our population."
        },
        {
            "heading": 3,
            "text": "The future of vaccine development"
        },
        {
            "text": "As UKHSA progresses through its second year in operation we are continuing to develop our Vaccine Development and Evaluation Centre to strengthen our capability further."
        },
        {
            "text": "Our ambitions have been driven and shaped by the COVID-19 pandemic, for instance through additional Government investment in new lab capacity (over 2,800 square meters of additional laboratory space) and our involvement in projects such as the 100 Days Mission, an international effort to deploy vaccines, treatments and tests within 100 days of identifying a new pandemic threat."
        },
        {
            "text": "Partnerships are at the heart of everything we do, and we are more committed than ever to taking an innovative approach to partnerships with industry, academia and international agencies that will ultimately save lives but also boost the UK’s prosperity."
        },
        {
            "text": "Even within UKHSA, our ability to connect with a vast array of expertise is a key strength of ours, combining our science with expertise in procurement and cost-effectiveness, stockpiling and vaccine deployment to create a true end-to-end vaccine capability. As well protecting health this provides a wide range of exciting careers for scientists and public health experts."
        },
        {
            "text": "Finally, we are also fortunate to have a great regulator in MHRA and of course our NHS that spans the length and breadth of the nation and gets vaccines to the people who need them."
        },
        {
            "text": "Health threats are sadly always around us, but VDEC will play a key role in mitigating these, including exciting new frontiers such as working with industry to assess the safety and effectiveness of multi-valent vaccines (vaccines that protect against more than one infection) and exploring the potential of vaccines that protect against antimicrobial resistant bacteria."
        }
    ]
}