{
    "url": "https://traderemedies.blog.gov.uk/2023/08/07/the-blurring-of-boundaries-between-goods-and-services-what-is-the-future-for-trade-remedies/",
    "title": "The blurring of boundaries between goods and services: what is the future for trade remedies?",
    "authors": [
        "Nabeel Sharif, Assistant Economist"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2023-08-07T12:30:33+01:00",
    "content": [
        {
            "text": "In today’s age of economic digitisation, we live in a world that is not only more interconnected than ever, but also increasingly dominated by trade in services. Undoubtedly, this poses both challenges and opportunities for trade policy, as it tries to keep pace with the rapidly changing nature of the global economy.  "
        },
        {
            "text": "The trade remedies framework, which tackles unfair international trading practices currently only applies to trade in goods but not to trade in services. Whilst goods are tangible objects that physically cross international borders, services, including technology, consulting or banking, are intangible. This means their cross-border movements can be significantly more difficult to monitor. "
        },
        {
            "text": "The boundaries between goods and services are, however, becoming increasingly blurred. Within trade policy, attempts have been made to clarify how to determine whether a product is a good or service, and the World Trade Organisation’s (WTO) work programme on e-commerce, which is still being negotiated, could shed further light. At the same time, trade in services is also becoming increasingly important. In light of this, it is worth considering whether and how trade remedies could evolve in future."
        },
        {
            "heading": 2,
            "text": "Are services important for the global economy? "
        },
        {
            "text": "Services are undoubtedly a key driver of global economic growth. As stated by the OECD, this sector generated over 66% of global GDP growth, alongside attracting over 75% of Foreign Direct Investment (FDI). Furthermore, a research report for the House of Commons shows that services made up approximately 79% of the UK’s GDP in 2023, accounting for 82% of employment.  "
        },
        {
            "text": "Services have also provided the catalyst for growth in emerging economies. For example, India has had among the world’s fastest-growing services sectors, particularly within IT and telecoms. Additionally, Artificial Intelligence (AI) can be considered an increasingly prominent service, which will have a particularly revolutionary impact on the economy and our daily lives: ChatGPT (an AI chat bot) is a particularly prominent example of this. "
        },
        {
            "text": "Despite a collapse in the trade of services during the pandemic, the sector rebounded, albeit at a slower pace than trade in goods. This is in stark contrast to the experiences of the 2008-09 Global Financial Crisis, where trade in goods was less resilient.  "
        },
        {
            "text": "The contrasting fortunes of the services sector can largely be attributed to two key factors. Firstly, transactions involving services typically involve long-term contracts, helping insulate services from fluctuations in demand that are often associated with recession. Secondly, the mode of delivery also influences the services sector’s performance.  "
        },
        {
            "text": "The four modes of delivery of international services trade, under the General Agreement on Trade in Services (GATS), are as below."
        },
        {
            "text": "Source: WTO "
        },
        {
            "text": "Expectedly, services that relied on the cross-border movement of individuals, such as tourism, experienced higher disruption (modes 2 and 4) during the pandemic according to the WTO, compared to services that could be provided electronically, such as a research report or through a commercial presence within other countries (modes 1 and 3). Additionally, some service sectors, including finance, saw relatively limited disruption, especially with teleworking. "
        },
        {
            "heading": 2,
            "text": "How are the lines between goods and services increasingly blurred? "
        },
        {
            "text": "With technological advancements, goods and services are becoming increasingly intertwined. For example, consider a self-driving car, which is a good, but has embedded services in the form of software within it, which would add value to the price of the good. Similarly, operating software undoubtedly adds value to laptops, computers and, perhaps more recently, tablets and mobile phones – this further substantiates the integration of goods and services, particularly within global value chains. This has not gone unnoticed, with mode 5 services trade attempting to integrate services within manufactured goods.   "
        },
        {
            "text": "Given the differences between goods and services, there are differences in the way they are governed, whether within national legislation or under WTO law. The GATS, which entered into force in 1995, facilitates and liberalises trade within services by increasing market access for services and promoting competition alongside increased foreign investment. However, critics point towards a loss of domestic sovereignty and unequal distribution of benefits across businesses and economies.  "
        },
        {
            "text": "A trade remedies framework for services could potentially address these issues by seeking to level the playing field. However, given the blurred lines between goods and services, policymakers will undoubtedly be faced with a challenge when attempting to regulate trade that does not physically cross borders.  "
        },
        {
            "heading": 2,
            "text": "Trade remedies for services: a possibility? "
        },
        {
            "text": "Whilst the concept of applying trade remedies to services is far from novel, with discussions in this area spanning decades, the challenges in doing so remain significant. Indeed, applying measures to flows of services poses significantly more challenges than in goods due to the intangible nature of the former.  "
        },
        {
            "text": "Trade remedies investigations involve assessments of whether domestically produced and imported products are ‘like’ each other. Comparing the physical, chemical and technical characteristics of two or more tangible goods to establish whether they are alike is much easier than it would be for services. The notion of ‘dumping’ in trade remedies rests on comparing the prices at which products are exported abroad at a price low enough to cause injury to domestic producers. This requires a large volume of robust and verifiable data from businesses (including domestic producers and overseas exporters), which is typically much easier to obtain for goods than for services.  "
        },
        {
            "text": "When it comes to application of trade remedy measures at the border, imposing tariffs for imports is feasible for goods but would be harder for services. Since services can be provided remotely, or electronically, identifying their country of origin can become difficult, even more so in the context of technological advancements, alongside the cross-border mobility of the individuals providing such services. "
        },
        {
            "text": "Also, trade remedy measures for goods remain subject to attempts of circumvention, with some overseas exporters attempting to circumnavigate measures by changing the specifications of goods, or by exporting goods via third countries not subject to any measures. Needless to say, detecting attempts to circumvent trade remedy measures would pose significantly more challenges for services.  "
        },
        {
            "text": "Services are playing an increasingly prominent role within global trade, so trade policy needs to keep pace with recent developments aided by advancements in technology. To effectively regulate flows in services, trade policy must effectively be able to monitor the flows and countries of origin of services and come to an agreement as to how to distinguish between goods and services within value chains. Despite the challenges, there could certainly be a role for trade remedies to ensure that trade in services is fair and that it works for businesses and consumers across the world. "
        }
    ]
}