{
    "url": "https://ipa.blog.gov.uk/2024/12/11/beyond-qualifications-how-experience-relationships-and-learning-shaped-my-civil-service-career/",
    "title": "Beyond qualifications: how experience, relationships and learning shaped my Civil Service career",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Project Delivery"
    ],
    "pub_date": "2024-12-11T09:41:59+00:00",
    "content": [
        {
            "text": "Paul Compton, Deputy Director for Capability and Capacity at the Infrastructure and Projects Authority, reflects on his career journey and learning, ranging from the RAF to SCS in the Civil Service. "
        },
        {
            "text": "As the Deputy Director for Capability and Capacity at the Infrastructure and Projects Authority, I've had a unique journey through the Civil Service. My story demonstrates the power of lifelong learning and how the 70/20/10 model shapes our personal and professional growth."
        },
        {
            "text": "Growing up in a lower socio-economic area and leaving school at 15 without GCSEs, my path to the Civil Service was unconventional. My early career included stints in factories, takeaways and even as a dental technician. While these jobs gave me a steady wage, at 17, seeking structure, I joined the Royal Air Force as a policeman and later became an attack dog handler."
        },
        {
            "text": "The 70%: learning through experience"
        },
        {
            "text": "The RAF taught me my first crucial lessons: consistency and self-standards. As an attack dog handler and later a shift leader, I learned the importance of punctuality, maintaining high standards, and always being at my best for the team."
        },
        {
            "text": "After six years in the RAF, I joined the Highways Agency as a traffic officer. This role brought new challenges, including being first on the scene at fatal accidents. It taught me a valuable lesson: most work decisions aren't life or death. This realisation allows us to take risks, experiment, and learn from our mistakes."
        },
        {
            "text": "My career then took me to HM Prison and Probation Service, where I served as the Learning and Development Commissioner for Public Sector Prisons. This role taught me about the inextricable link between career and personal values. It shifted my perspective from being \"tough on crime\" to understanding the importance of reform and how our work as civil servants can directly change people's lives."
        },
        {
            "text": "Subsequently, I held various roles including Head of Learning and Talent at HMRC, temporarily leading the Surge and Rapid Response Team, and serving as Head of Briefing for HMRC's COVID-19 response. Each role brought new challenges and learning opportunities, reinforcing the 70/20/10 learning model - where 70% of our development comes from job-related experiences."
        },
        {
            "text": "The 20%: learning through relationships"
        },
        {
            "text": "In 2020, I experienced a personal tragedy that reshaped my understanding of leadership and compassion. This personal tragedy shattered my self-image as a confident, resilient leader and my mental health. In that moment of vulnerability, I chose to be transparent with my colleagues, embodying the principles I'd often preached: \"it's okay not to be okay.\""
        },
        {
            "text": "During my absence from work, I experienced the profound impact of the '20%' in the 70/20/10 model - learning through relationships. The support from the Civil Service and my colleagues was extraordinary. "
        },
        {
            "text": "These experiences taught me invaluable lessons about leadership, compassion, and human connection that no formal training could have provided. They've inspired me to pay it forward, mentoring others and speaking at social mobility events to help create pathways for people from diverse backgrounds."
        },
        {
            "text": "The 10%: formal learning"
        },
        {
            "text": "Despite leaving school with limited qualifications, but with a lot of life and career experience, I found myself on the Cabinet Office's Future Leaders Scheme. On this scheme, I found myself overwhelmed by the academic requirements seemingly needed, and so, I nearly quit. However, with encouragement from my line manager and perseverance, I not only completed the programme but earned a distinction on my first assignment. "
        },
        {
            "text": "Since then, I've continued my formal education, becoming a CIPD fellow and undertaking various other qualifications. These experiences have taught me that formal learning, while challenging, can be immensely empowering and validating."
        },
        {
            "text": "My journey illustrates how the 70/20/10 model intertwines in lifelong learning"
        },
        {
            "text": "As civil servants, we should embrace all aspects of this model. Experience will shape you, relationships will support you, and formal learning will empower you. Remember, in moments of self-doubt, you are good enough, and you can always lean on those around you for support."
        },
        {
            "text": "Embrace your journey of lifelong learning. It's through these diverse experiences and connections that we grow not just as professionals, but as individuals committed to public service."
        },
        {
            "text": "To find out more about a career in the UK government, click here: https://www.civil-service-careers.gov.uk/ "
        }
    ]
}