{
    "url": "https://naturalengland.blog.gov.uk/2024/12/11/details-released-of-new-countryside-stewardship-higher-tier-natural-england-to-work-with-invited-farmers-to-develop-applications/",
    "title": "Details released of new Countryside Stewardship Higher Tier – Natural England to work with invited farmers to develop applications",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Farming",
        "Natural England",
        "Nature",
        "wildlife and farming"
    ],
    "pub_date": "2024-12-11T10:15:18+00:00",
    "content": [
        {
            "text": "By Peter Craven, Head of Agriculture "
        },
        {
            "text": "Defra has today announced the new Countryside Stewardship Higher Tier (CSHT) offer, one of three Environmental Land Management (ELM) schemes, to help incentivise farmers to deliver improvements for nature and support sustainable food production. "
        },
        {
            "text": "Farmers and land managers can now review the management actions and capital items that will offer funding under new CSHT scheme to protect and enhance the environment, including sensitive sites like SSSIs.  "
        },
        {
            "text": "CSHT is an important scheme for Natural England, enabling us to support and help farmers make the right choice for nature as well as their farm businesses. "
        },
        {
            "text": "What’s available for farmers and land managers  "
        },
        {
            "text": "Controlled roll-out  "
        },
        {
            "text": "As with the Sustainable Farming Incentive, CSHT will initially open through a controlled rollout to ensure early adopters invited to join the scheme receive the necessary support and any necessary adjustments required can be made. "
        },
        {
            "text": "Natural England’s role  "
        },
        {
            "text": "Natural England and Forestry Commission will work with farmers and land managers invited to join the new CSHT scheme to develop their applications. "
        },
        {
            "text": "From 6 January 2025, we will work together with invited farmers and land managers to secure greater outcomes for nature. Natural England will initially focus on working with customers with expiring agri-environment or mixed agreements expiring in 2025, applicants who have completed preparatory work, and have approved plans such as an implementation plan. We will do this through pre-application visits in readiness for the first applications in summer 2025.  "
        },
        {
            "text": "We will engage with groups of these farmers and land managers monthly, so that there will be a bank of applicants ready to go once the CSHT scheme is fully open for applicants later in 2025. "
        },
        {
            "text": "Existing scheme agreements "
        },
        {
            "text": "To ensure continuity, farmers whose existing CSHT agreements expire in 2024 will be offered mirror agreements lasting 5 or 10 years. Those with Higher Level Stewardship (HLS) agreements expiring in 2024 will be offered two-year extensions, while those expiring in 2025 will be offered one or two-year extensions. Further information can be found on the Defra farming blogsite.  "
        },
        {
            "text": "Sustainable Farming Incentive update "
        },
        {
            "text": "Defra has also announced that there will be an additional 14 Sustainable Farming Incentive (SFI) endorsed actions, available from summer 2025, to enable farmers and land managers to contribute further benefits to Grassland, Heritage and Coastal sites, among others. "
        },
        {
            "text": "Next steps "
        },
        {
            "text": "Initially in 2025/26, applications will be by invitation – on a rolling monthly basis – where we and the Forestry Commission will work with farmers and land managers to develop an application. "
        },
        {
            "text": "This will include farmers and land managers in existing agreements as well as new.  "
        },
        {
            "text": "RPA will then contact invited customers directly, from 6 January 2025 to start the pre-application process with first applications submitted in summer 2025. "
        },
        {
            "text": "Defra will publish more details on the timing and approach to widening applications further in 2025.   "
        }
    ]
}