{
    "url": "https://forestrycommission.blog.gov.uk/2024/12/11/getting-ready-to-apply-for-countryside-stewardship-higher-tier/",
    "title": "Getting ready to apply for Countryside Stewardship Higher Tier",
    "authors": [
        "Becky Hawkey"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2024-12-11T16:40:36+00:00",
    "content": [
        {
            "text": "The Countryside Stewardship Higher Tier (CSHT) scheme provides important funding to secure enhanced environmental benefits and deliver for nature recovery, including woodland."
        },
        {
            "text": "With the improved CSHT scheme opening in 2025, Defra has published guidance on GOV.UK to help get you ready to apply."
        },
        {
            "text": "Once the scheme is open for applications, farmers and land managers will be invited to apply by invitation. You may need to wait to be considered and not everyone that would like to apply will be able to do so when CSHT first opens."
        },
        {
            "heading": 2,
            "text": "What will happen next"
        },
        {
            "text": "From January 2025, farmers and land managers will be invited into the pre-application process in phases. Pre-application will guide you through the preparatory work you will need to complete before applying for CSHT. You must complete the pre-application process before you can apply for CSHT when it opens next year."
        },
        {
            "text": "On a rolling monthly basis, Natural England and the Forestry Commission will work with farmers and land managers to get ready to apply for CSHT.  More about who will receive pre-application invitations first is available in the recent guidance published by Defra. "
        },
        {
            "text": "The Forestry Commission will initially prioritise inviting customers who have an approved Woodland Management Plan."
        },
        {
            "text": "Before receiving an invitation to the process, we recommend reviewing the actions, supplements and capital items available in the new guidance."
        },
        {
            "heading": 2,
            "text": "Extending existing agreements"
        },
        {
            "text": "Some existing agreement holders will be offered continued funding, or they can wait to be invited to apply for the new CSHT scheme. "
        },
        {
            "text": "Existing Environmental Stewardship Higher Level Stewardship (HLS) agreement holders may have the option to extend their existing agreement for 2 years.  "
        },
        {
            "text": "Existing CSHT agri-environment agreement holders with an agreement expiring at the end of 2024 will have the option for a 5 or 10 year mirror agreement.  "
        },
        {
            "text": "We will not be able to offer existing CSHT woodland agreement customers a 5 year mirror agreement. This is because many woodland agreements include actions that cannot be repeated on the same area.  In addition, they may also need woodland management plans, licences and consents.  "
        },
        {
            "heading": 2,
            "text": "Getting ready for the CSHT Woodland Improvement offer "
        },
        {
            "text": "The CSHT Woodland Improvement offer is one of the offers available in CSHT. This land management action and supplementary actions aim to bring woodlands into sustainable management in line with the UK Forestry Standard. "
        },
        {
            "text": "The Forestry Commission will invite you to complete the CSHT pre-application process. We will prioritise inviting applicants with a Forestry Commission approved Woodland Management Plan "
        },
        {
            "text": "Once you receive an invitation to the pre-application process, let us know if you plan to apply for CSHT woodland actions. You must complete the pre-application process before you can apply for these actions in CSHT. "
        },
        {
            "text": "The pre-application form will help you make sure that: "
        },
        {
            "text": "Alongside your Woodland Management Plan, you may also need to complete other plans during the CSHT pre-application process. You can use the following items to fund your plans or studies:"
        },
        {
            "heading": 2,
            "text": "Getting ready for the CSHT Agroforestry offer"
        },
        {
            "text": "Defra’s recent announcement outlines changes to the CSHT agroforestry offer. The offer now includes support for in-field agroforestry systems at higher density planting or on more sensitive land than is available through the Sustainable Farming Incentive. "
        },
        {
            "text": "Before you can apply for the CSHT agroforestry actions, you must have an approved Agroforestry Plan from the Forestry Commission. Capital funding is available to produce a plan using PA4 Agroforestry Plan."
        },
        {
            "text": "To learn more about agroforestry and other funding available through the Sustainable Farming Incentive, please read our blog Is agroforestry right for your farm?  "
        },
        {
            "heading": 2,
            "text": "Capital grants currently unavailable"
        },
        {
            "text": "As announced by Defra in November, due to unprecedented demand, some capital grant items are temporarily closed to new applications including: "
        },
        {
            "text": "Agreements that have already been signed are not affected and you should continue with the work set out in your agreement. The RPA will continue to process the applications already received, and accept new applications for:  "
        }
    ]
}