{
    "url": "https://cddo.blog.gov.uk/2024/12/11/government-digital-and-data-in-review-top-reads-of-2024/",
    "title": "Government Digital and Data in review: Top reads of 2024",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "AI",
        "CDDO",
        "Cross-government strategy",
        "Cyber security",
        "Data",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-12-11T11:13:07+00:00",
    "content": [
        {
            "text": "As the year draws to a close, it’s the perfect time to look back on the stories that have resonated most with our Government Digital and Data community. From groundbreaking AI advancements to best practices in digital transformation, these articles have sparked discussions, inspired innovation, and provided valuable insights across the public sector."
        },
        {
            "text": "In this blog, we’re revisiting the most-read articles from the past year, according to click throughs from our monthly Government Digital and Data Bulletin - each showcasing the incredible work happening across government and the role data and technology play in driving meaningful change. Whether you’re catching up or revisiting an old favourite, these highlights are a testament to the progress we’ve made together."
        },
        {
            "text": "Let’s dive in!"
        },
        {
            "heading": 3,
            "text": "January"
        },
        {
            "text": "A new year, a fresh perspective as we jumped into the world of generative AI with CDDO’s new series of online courses. This blog explored how public sector professionals can upskill in this transformative technology via Civil Service Learning."
        },
        {
            "text": "Artificial Intelligence: introducing our series of online courses on generative AI"
        },
        {
            "heading": 3,
            "text": "February"
        },
        {
            "text": "This month saw a deep dive into getting the data fundamentals right at the Ministry of Justice with the Data in government blog ​focussing on better data and skills to enable better decision-making."
        },
        {
            "text": "Getting the data fundamentals right "
        },
        {
            "heading": 3,
            "text": "March"
        },
        {
            "text": "Spring brought fresh energy as we read about GOV.UK’s most-used publishing tool getting a major upgrade. Discover how the move to the GOV.UK Design System is improving consistency and usability."
        },
        {
            "text": "Moving our most used publishing tool to the GOV.UK design system"
        },
        {
            "heading": 3,
            "text": "April"
        },
        {
            "text": "Accessibility took centre stage with the development of the GOV.UK ID Check app. Learn how the team prioritised inclusive design to create a user-friendly digital identity tool."
        },
        {
            "text": "Building an accessible digital identity app"
        },
        {
            "heading": 3,
            "text": "May"
        },
        {
            "text": "Just before the election was announced, the Ministry of Justice discussed efforts to improve data quality and accessibility within the criminal justice system, enabling better decision-making and outcomes. "
        },
        {
            "text": "Improving data in the criminal justice system"
        },
        {
            "heading": 3,
            "text": "June"
        },
        {
            "text": "As we hit mid-year, this blog became a summer favourite. Want to become a digital superhero? This blog shares three actionable steps to make your ICT practices more sustainable and impactful."
        },
        {
            "text": "Three steps to becoming a digital superhero"
        },
        {
            "heading": 3,
            "text": "July"
        },
        {
            "text": "In July, the Department for Business and Trade shared their approach to leveraging generative AI to enhance government services and operations. Highlighting next steps, including exploring innovative use cases, ensuring ethical implementation, and fostering collaboration across departments to maximise AI's potential."
        },
        {
            "text": "Generative AI in government DBTs next steps"
        },
        {
            "heading": 3,
            "text": "August"
        },
        {
            "text": "As summer peaked, so did insights. Combining AI with content design is revolutionising service assessment reporting. This blog showcases the innovative approach and its potential for data insights."
        },
        {
            "text": "Combining AI and content design to extract insights from Service Assessment Reports"
        },
        {
            "heading": 3,
            "text": "September"
        },
        {
            "text": "With over 2 million users, DVLA’s Driver and Vehicle Account continues to grow. This September blog highlights its journey and the features driving its success."
        },
        {
            "text": "2 million users and counting DVLA's driver and vehicle account is growing"
        },
        {
            "heading": 3,
            "text": "October"
        },
        {
            "text": "Autumn leaves and transformative ideas and this month’s blogs highlights new opportunities for civil servants to gain Cloud certifications through partnerships with leading providers like AWS, Microsoft, and Google Cloud. "
        },
        {
            "text": "Get Cloud certified this Autumn"
        },
        {
            "heading": 3,
            "text": "November"
        },
        {
            "text": "Readers learnt more about how the new digital centre is being shaped in the latest Digital People blog. This follows the announcement earlier this year that the Department for Science, Innovation and Technology (DSIT) would expand to include GDS, CDDO, and i.AI to unite digital efforts."
        },
        {
            "text": "Shaping a new digital centre of government: how we’re listening"
        },
        {
            "text": "And well, December, we haven’t shared this month’s bulletin yet, so if you work in the public sector and want to have all the latest news in digital transformation straight into your inbox, you can sign up here. Also, look out for more information about Services Week 2025, details coming soon!"
        },
        {
            "text": "If your favourite GOV.UK blog from 2024 isn’t featured in this list, please share a link via the comments below. "
        }
    ]
}