{
    "url": "https://defrafarming.blog.gov.uk/2024/12/11/guidance-now-available-for-improved-countryside-stewardship-higher-tier-offer/",
    "title": "Guidance now available for improved Countryside Stewardship Higher Tier offer ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2024-12-11T17:14:46+00:00",
    "content": [
        {
            "text": "Ahead of the improved Countryside Stewardship Higher Tier (CSHT) scheme opening for applications, we’ve published the new scheme guidance on GOV.UK.  "
        },
        {
            "text": "You can use it to take a look at the actions and capital grants on offer and start preparing. The offer includes new actions and capital items. "
        },
        {
            "text": "In this post, we’ll give an overview of the scheme and how to get ready. We’ll also include the improvements we’ve made.  "
        },
        {
            "text": "We’re hosting a webinar on 8 January 2025 for you to learn more and to put your questions to the team. A link to sign up is included in this post. "
        },
        {
            "heading": 2,
            "text": "Protecting, restoring and enhancing "
        },
        {
            "text": "CSHT pays farmers, land managers and foresters to carry out location-specific actions that restore, protect or enhance the environment.  "
        },
        {
            "text": "This includes sensitive sites, such as Sites of Special Scientific Interest (SSSIs), and land that requires more complex, long-term management. "
        },
        {
            "text": "With support from CSHT, valuable work has been carried out — and continues — across the country. This includes managing woodlands, conserving rare species and restoring historical features."
        },
        {
            "text": "We’ve worked to improve the offer to encourage even more people to apply for an agreement. It includes 132 actions, including many that are new or improved. "
        },
        {
            "text": "CSHT will also offer grants for 145 capital items, including 25 new items. These grants support delivery of management, restoration or creation of sites. An additional 6 capital items are available to support the preparation of plans for CSHT applications."
        },
        {
            "text": "We’ve tried to make the actions less prescriptive where possible, while ensuring they continue to deliver vital environmental outcomes. "
        },
        {
            "text": "The improved CSHT supports the government’s priorities for improved food security and nature recovery.  "
        },
        {
            "text": "We’ll continue to evolve the CSHT offer over the next few years. We’re aiming to get more applications in place and bring in more new land to help meet our Environmental Improvement Plan targets. "
        },
        {
            "text": "We’re aiming for around 1,200 new Higher Tier agreements by March 2026, more than the last round of CSHT."
        },
        {
            "heading": 2,
            "text": "Preparing for CSHT "
        },
        {
            "text": "Read the guidance "
        },
        {
            "text": "The new Countryside Stewardship Higher Tier guidance is on GOV.UK. It includes: "
        },
        {
            "text": "Check you are eligible  "
        },
        {
            "text": "The guidance explains who can apply. It also outlines the requirements you must meet. "
        },
        {
            "text": "Register with RPA "
        },
        {
            "text": "Make sure you’ve registered your rural land on the Rural Payments service. "
        },
        {
            "text": "You’ll need to check that your land cover and use are correct and that your permissions and contact details are up to date.  "
        },
        {
            "text": "Complete plans or studies "
        },
        {
            "text": "Before applying, you may need to prepare specific plans or studies, such as a woodland management plan or a species management plan. "
        },
        {
            "text": "These can help determine the most suitable actions for your land and ensure you meet the requirements for your application. "
        },
        {
            "text": "Grants are available to help cover the cost of completing these plans.  "
        },
        {
            "heading": 2,
            "text": "After you’ve prepared "
        },
        {
            "text": "As with all our schemes, we’re rolling out CSHT gradually. This means we’re prioritising certain groups first, before opening it up more widely. "
        },
        {
            "text": "At first, applications will be by invitation only. This controlled roll-out will ensure the service works for farmers and land managers and allows time for you to consider the opportunities CSHT can provide. "
        },
        {
            "text": "Natural England (NE) and the Forestry Commission (FC) will identify who is invited initially. This will include: "
        },
        {
            "text": "The Rural Payments Agency (RPA) will contact these groups directly, with an invitation, from 6 January 2025. Customers will be invited to receive advice in tranches each month on a rolling basis. "
        },
        {
            "text": "You will need to be invited to receive pre-application advice and then later apply. If you are not in one of the groups above, we’ll provide further details in February on how to contact the RPA to let them know you are interested in applying. Please do not contact the RPA about this until then. "
        },
        {
            "text": "Once invited, and after completing the relevant permissions and plans, you’ll be able to prepare your application with support from advisers and arm’s-length bodies (ALBs). "
        },
        {
            "text": "You’ll then be ready to submit an application through the Rural Payments service, which will open in summer 2025. "
        },
        {
            "text": "The RPA will then review your application. If successful, you’ll be offered an agreement. After you review the agreement and sign, you’ll be ready to go."
        },
        {
            "text": "The first payment will be made 4 months after you accept your agreement. To help with cash flow, payments will be made every 3 months, rather than one payment per year. "
        },
        {
            "text": "To ensure a smooth transition and provide continuity for farmers and land under agreement, we are offering 1 or 2-year extensions to agri-environment agreement holders with Higher Level Stewardship (HLS) agreements ending in 2024 or 2025."
        },
        {
            "text": "For those with existing agri-environment Higher Tier agreements ending in 2024, we are offering mirror agreements lasting 5 to 10 years."
        },
        {
            "text": "We recently published a post about CSHT mirror agreements and HLS extensions. "
        },
        {
            "text": "From the summer, a wider range of customers will be identified and invited to prepare an application. We will publish more details in 2025 on the timing and approach to widening applications further. "
        },
        {
            "text": "We will introduce rolling applications so you can apply throughout the year, with monthly start dates. "
        },
        {
            "text": "More detailed information on the process, including how we will assess potential applications if you are interested in applying, will be shared in due course. "
        },
        {
            "text": "Starting this summer, we will move to an online application process that will be open year-round. This will help us handle applications more efficiently. "
        },
        {
            "text": "We are also improving the tools available to applicants for planning their proposals. "
        },
        {
            "text": "These tools will reduce the need for intensive pre-application advice from arm’s-length bodies (ALBs). Implementation Plans, Woodland Management Plans, Agroforestry Plans, Species Management Plans and Feasibility Studies will help you prepare applications, cutting down on lengthy negotiations. "
        },
        {
            "text": "Advice will focus on CSHT actions. Previously, advice from NE and FC covered the entire holding. "
        },
        {
            "heading": 2,
            "text": "Join our webinar "
        },
        {
            "text": "On Wednesday 8 January, we’re hosting a webinar. We’ll cover the guidance and the process of working with Natural England and the Forestry Commission on your application. "
        },
        {
            "text": "The webinar will start at 14:30 and will finish at 16:00."
        },
        {
            "text": "There will be an opportunity for you to put questions to the team. "
        },
        {
            "text": "Sign up to attend. "
        }
    ]
}