{
    "url": "https://defradigital.blog.gov.uk/2024/12/11/improving-and-evolving-defras-content-community-projects/",
    "title": "Improving and evolving: Defra's content community projects",
    "authors": [
        "Graeme Claridge"
    ],
    "categories": [
        "Defra content design"
    ],
    "pub_date": "2024-12-11T13:33:15+00:00",
    "content": [
        {
            "text": "I’m Graeme Claridge, and I’ve been head of content design at Defra since April 2024."
        },
        {
            "text": "We’re a large community, with around 70 content designers. There's a lot to celebrate about our community: we’re incredibly supportive of each other, we’re highly motivated and we’re passionate about making our users’ lives easier."
        },
        {
            "text": "It’s a group of people I feel proud to lead and support."
        },
        {
            "text": "But like all communities, there are things we could do better – areas where we could work more efficiently, or to a higher standard. "
        },
        {
            "text": "Naturally, as a group of conscientious content designers, these are things we’ve wanted to fix or improve. The problem has been finding the time and space to do the work."
        },
        {
            "text": "The content leadership team had been thinking for a while about how to make better use of the appetite and ability in the community to make improvements to our governance, standards and so on. We have working groups tied to topics that matter to us (for example, ‘measuring success’), and while some great ideas have come from these, they are not set up to deliver on these aspirations."
        },
        {
            "heading": 2,
            "text": "Enter community projects"
        },
        {
            "text": "Community projects have been set up to turn those ideas and enthusiasm into action. Each project has a team of content designers, led by a senior content designer and sponsored by a lead content designer. Together, they work towards a SMART goal set by the content leadership team. These goals focus on making a tangible improvement to an area that’s important to our community."
        },
        {
            "text": "Everyone involved is doing this alongside the ‘day job’, so the scope and timelines of each project takes that into account. While we’d all like to make everything perfect overnight, we know that’s not realistic, so we’re focusing on incremental but demonstrable improvements instead."
        },
        {
            "text": "We have recently completed our first round of community projects:"
        },
        {
            "text": " And because they’ve been so successful, we’re getting ready to start on the next set of projects. We asked our content designers to submit proposals  for what these next projects should focus on and had a really healthy response. We had 12 proposals and asked all our content designers to vote on the 3 they thought we should prioritise, to make sure we’re focusing on what’s most important to our community. The winners were:"
        },
        {
            "text": "Over the coming weeks, we’ll share blog posts from members of our community project teams. You’ll be able to find out about their project, the challenges and successes and what they learned along the way. I encourage you to give each of them a read."
        },
        {
            "text": "Graeme Claridge is head of content design at Defra."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}