{
    "url": "https://educationinspection.blog.gov.uk/2024/12/11/our-review-of-the-area-send-inspection-framework/",
    "title": "Our review of the area SEND inspection framework",
    "authors": [
        "Yvette Stanley, National Director, Social Care and Regulation",
        "Lee Owston, National Director Education"
    ],
    "categories": [
        "Area SEND",
        "SEND",
        "SEND inspections"
    ],
    "pub_date": "2024-12-11T15:12:13+00:00",
    "content": [
        {
            "text": "Through the Big Listen, children, parents, carers and professionals told us that the special educational needs and disabilities (SEND) system is ‘broken’. Families shared heartbreaking stories of their fight to get the right support. Frustrated professionals told us that they are striving to do their best for children and young people with SEND, but are hamstrung by a lack of resources."
        },
        {
            "text": "In response to what we heard, we committed to a range of actions to increase our focus on how providers are meeting the needs of children and young people with SEND. These include:"
        },
        {
            "text": "Joint area SEND inspections with the Care Quality Commission (CQC) have been in operation for nearly 2 years.  We’ve learned a lot about what works well, and where improvements can be made. This, along with the feedback we received as part of the Big Listen, will form the basis for our joint review of the inspection framework that we started last month."
        },
        {
            "text": "What will be included in our review"
        },
        {
            "text": "The review, and any actions that Ofsted and CQC take as a result, will not reduce accountability for children and young people with SEND. We will focus on how we can enhance the existing framework, so that it supports quicker but sustained improvement. We will not be making any fundamental changes such as changes to the inspection cycle or the evaluation criteria."
        },
        {
            "text": "Working with CQC, we will look at what we have learned from the first 2 years of inspections. And we will listen to the feedback we received from local areas inspected, as well as parents and carers. We will publish a summary report on the national issues local area partnerships face, as well as examples of good practice. We will also consider how we can best support improvement through our monitoring inspections and engagement meetings."
        },
        {
            "text": "We know that many leaders are frustrated at being held to account for national and systemic challenges. Some want us to stop inspecting until there is national reform of the SEND system. But we think it’s important that area SEND inspections continue. They provide an important voice for children with SEND and their families. And they hold local leaders to account for their vital role in providing high-quality services."
        },
        {
            "text": "We do recognise the challenging context that leaders are working in. We know that they feel as though they are held responsible for issues that they do not have the levers to change. This includes:"
        },
        {
            "text": "Where improvements are needed, we want our inspection reporting to be clear about who needs to act. This will be true whether it is the local authority, the integrated care board, local health providers, education providers, or multi-academy trusts (or a combination of these partners working together)."
        },
        {
            "text": "We’ll also look at where we can reduce the inspection-related workload for local areas. For example, we will consider what information we ask for, and how we best train our workforce to lead these complex inspections."
        },
        {
            "text": "We have paused the introduction of our monitoring inspections under the new framework. Before we do introduce them, we will use the review to ensure that they are well designed. They should foster a constructive, professional dialogue that supports improvement and helps a local area to understand its progress against its areas for priority action."
        },
        {
            "text": "We will also explore how we can use engagement meetings to their best effect. We must keep the spotlight on SEND and on supporting areas to improve between inspections, but we will take care not to distract areas from the vital work they are doing as part of their improvement journey."
        },
        {
            "text": "What’s next"
        },
        {
            "text": "Over the next few months, we will be talking to children and young people with SEND, their families, SEND professionals and local area leaders. This will inform any changes that Ofsted and CQC will make. We want to hear from local area leaders to understand how our inspection activity can be as supportive as possible, while continuing to hold local area partnerships to account."
        },
        {
            "text": "We will shortly be consulting on proposed wider changes across Ofsted to support children and young people with SEND. These will include proposals to increase our focus on inclusion in schools and other education providers through our updated education inspection framework. This will help us to hold schools to account for the important role they play in their local area partnership."
        },
        {
            "text": "We are also replacing single-word overall effectiveness judgements with inspection ‘report cards’ in all areas that Ofsted inspects. This will provide a more nuanced and detailed assessment of providers’ work."
        },
        {
            "text": "Finally, we'll complement these changes with a continued emphasis on working with relevant government bodies to understand and influence their plans for SEND system reform."
        },
        {
            "text": "We plan to finish our review in spring 2025. Until then, our full inspections and thematic visits will continue, but we will keep monitoring inspections on pause. We will publish our review findings and updated guidance for monitoring inspections before they restart in the summer term. There are only a very small number of local areas affected by the pause and we will be prioritising their monitoring inspections when they restart."
        }
    ]
}