{
    "url": "https://openpolicy.blog.gov.uk/2024/12/11/why-we-are-experimenting-with-ethnography-in-the-metaverse/",
    "title": "Why we are experimenting with ethnography in the metaverse  ",
    "authors": [
        "Kyna Gourley",
        "isabelleintrona"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-12-11T13:35:55+01:00",
    "content": [
        {
            "text": "Over the past decade Policy Lab has established a foundational practice in film ethnography. Throughout this time, we have continued to push the boundaries of how this method can support policymakers to ground policy in lived experience. This year we have broken new territory by taking our film ethnography method into ‘the metaverse’. This is part of our ongoing testing of our experimental policy design methods launched in 2022.  "
        },
        {
            "text": "While ‘the metaverse’ is still emerging, it typically includes any virtual worlds where people connect socially, usually within a 3D digital space. Many online video games, such as ‘Fortnite’ or ‘World of Warcraft’, can be classed as part of the metaverse. The popularity and potential impact of virtual worlds should not be underestimated. ‘Fortnite’ alone has an average of 1-3.5 million global concurrent users at any given time and the average ‘Fortnite’ user spends 8-10 hours per week within the game. With the growing popularity and significance of such virtual worlds, it is crucial that policymakers take them into account and include them in their evidence base. The publication of the Video Games Research Framework by Department for Digital, Culture, Media & Sport last year highlights the need for high-quality research in this area. "
        },
        {
            "text": "Anthropologists have long studied people’s virtual worlds. Tom Bolstorff’s groundbreaking 2008 book ‘Coming of Age in Second Life’ showed that in-depth accounts of people’s virtual lives could be just as valuable as studying their non-digital realities. More recently, documentary-makers have started capturing immersive metaverse stories, entirely shot within the digital world.  We were inspired by the award-winning documentary ‘Grand Theft Hamlet’, directed by Pinny Grylls and Sam Crane, which tells the true story of two actors trying to develop a full production of Hamlet inside ‘Grand Theft Auto’. Films like these sparked our curiosity for how ethnographic films created in the metaverse could deepen our understanding of policy issues and engage communities who traditional methods may struggle to access. "
        },
        {
            "text": "With support from the Grand Theft Hamlet creators, we adapted our existing methods to spend time with participants in video games they played regularly. Our researchers built avatars and experienced the world alongside our participants by observing their in-game interactions and asking questions within the platform. "
        },
        {
            "text": "Our tests revealed many potential benefits to conducting film ethnography in the metaverse:  "
        },
        {
            "text": "Our experiment with ethnography in ‘the metaverse’ shows the value this methodology brings as a complement to our other ethnographic methods. There is still immense value in capturing in-person cues like facial expressions, body language, and physical environments. These not only reveal impactful insights about people’s lived experience but can also help the researchers to create an emotionally safe space by tuning into the participant’s experience during research. Observing participants in both their online and offline spaces could perhaps provide a fuller picture of their lives.  "
        },
        {
            "text": "Not everyone will be comfortable sharing in online spaces, especially if they’re unfamiliar with them. Nevertheless, using our methods in ‘the metaverse’ offers the potential to overcome barriers for some participants, shape different kinds of relationships and reveal novel insights. "
        },
        {
            "text": "If this inspires you to explore how you can use ethnographic methods or virtual worlds in your policymaking, please get in touch at  team@policylab.gov.uk and see our broader methods, offer and impact in our prospectus here.  "
        }
    ]
}