{
    "url": "https://educationhub.blog.gov.uk/2021/12/5-ways-institutes-of-technology-are-revolutionising-technical-education/",
    "title": "5 ways Institutes of Technology are revolutionising technical education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2021-12-17T00:01:31+00:00",
    "content": [
        {
            "text": "Institutes of Technology (IoTs) are new employer-focused providers specialising in delivering higher technical education across England."
        },
        {
            "text": "Created to increase the supply of the higher-level technical skills, they are part of the government’s plans to reform technical training to help employers get the skilled workforce they need and offer local people access to rewarding jobs."
        },
        {
            "text": "Here are 5 ways they are changing the landscape:"
        },
        {
            "heading": 3,
            "text": "1. They are a nationwide network "
        },
        {
            "text": "There are currently 12 Institutes of Technology across the country, with a further 9 to be established in 2022/23. More than 40 Colleges, 18 universities and around 60 leading employers are directly involved in IoTs, with more to follow. Learning is being delivered across over 50 sites at present. This means best practice and ideas can be shared across the network."
        },
        {
            "heading": 3,
            "text": "2. They are collaborative"
        },
        {
            "text": "Each IoT has its own distinct identity, a result of the innovative collaboration of colleges, universities, and employers. Being closely aligned with business means that they can react quickly to the current and evolving higher level technical skills needs locally."
        },
        {
            "heading": 3,
            "text": "3. They offer access to industry standard facilities"
        },
        {
            "text": "Each IoT will benefit from the latest state of the art, industry standard facilities for learners, with up to £290m of capital funding available. Over 60 capital projects are underway with more to follow. These include new builds, refurbishments and specialist equipment. Many of these are now complete and in use, including the Centre for Precision Agriculture (Yorkshire and Humber IoT), the Black Country and the Marches IoT, and the cyber and engineering facilities West of England IoT."
        },
        {
            "heading": 3,
            "text": "4. They offer the skills our economy needs"
        },
        {
            "text": "IoTs specialise in STEM skills including construction, advanced engineering/manufacturing and digital which reflect the skills needs locally. Their focus is on higher technical courses and higher apprenticeships, although many also offer T Levels, technical degrees and flexible courses for those who are looking to reskill or upskill. Engaging approaches to how this learning is delivered will ensure compelling high level technical training experiences. Inspiring learners whilst broadening accessibility, raising aspirations, and improving inclusivity."
        },
        {
            "heading": 3,
            "text": "5. They’re backed by experts"
        },
        {
            "text": "Ian Green, Senior Controller/Section Manager, Nissan (North East IoT employer partner):"
        },
        {
            "text": "Dr Jon Hall, Chief Innovation and Technology Officer, Babcock (South West IoT employer partner):"
        },
        {
            "text": "Christopher Allan: Graduate Engineer at SGS UK Ltd - Greater Birmingham & Solihull Institute of Technology (gbsiot.ac.uk)."
        },
        {
            "text": "Find out more about IoT's here:"
        }
    ]
}