{
    "url": "https://valuationoffice.blog.gov.uk/2021/12/17/how-we-value-pubs/",
    "title": "How We Value: Pubs",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2021-12-17T12:05:57+00:00",
    "content": [
        {
            "text": "Paul May is a National Valuation Lead in the VOA, where one of his roles is to oversee the valuation of pubs in England and Wales. In this instalment of our How We Value series, Paul runs through the process for valuing the famous, and not so famous, pubs of England and Wales."
        },
        {
            "text": "The pub sector"
        },
        {
            "text": "There are around 51,000 pubs and bars in England and Wales – accounting for nearly £1.8 billion worth of rateable value."
        },
        {
            "text": "Beer and pubs contribute £23 billion to the UK GDP with £13 billion generated in various tax revenues. Pubs are often seen as cherished hubs of their local community, so it is important their rateable values, and therefore business rates, are calculated as fairly and accurately as possible."
        },
        {
            "text": "There’s plenty of variation in pubs as a type of property. They’re located everywhere from busy city centres to the middle of the countryside. Some cater to the upper end markets, with clientele among the rich and famous, while others offer local families a quiet drink or meal in a more traditional setting."
        },
        {
            "text": "The valuing process"
        },
        {
            "text": "So how do we go about working out the valuations for licensed premises with so much variation? Well, we look at a combination of rent and turnover."
        },
        {
            "text": "The rent for most pubs is agreed between landlords and tenants after both parties have established what’s known as the ‘fair maintainable receipts’. This is the yearly level of trading receipts a pub could be expected to achieve and is based on the trade of previous years to give a rough idea."
        },
        {
            "text": "Valuations will generally be made by considering types of income including drinks, food and accommodation."
        },
        {
            "text": "Due to the various factors that need to be looked at, our valuers use a valuation scheme for this class of property that is discussed and agreed with representatives of the pub industry. We hold regular discussions with these representatives, listening to their concerns and their views on the state of trade so we can understand the full picture."
        },
        {
            "text": "The final steps"
        },
        {
            "text": "By understanding and applying the approved pub guide to a particular pub the intention is that two experienced pub valuers will be able to agree a fair rateable value."
        },
        {
            "text": "As pubs act as such pillars of their communities, it is essential that our scheme takes into account all aspects of cost and revenue, giving them the most accurate rateable value which is reflected in their business rates bill."
        }
    ]
}