{
    "url": "https://companieshouse.blog.gov.uk/2021/12/17/how-public-support-has-helped-small-businesses-throughout-the-pandemic/",
    "title": "How public support has helped small businesses throughout the pandemic",
    "authors": [
        "Innovation and Enterprise team, the British Library"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2021-12-17T13:16:01+00:00",
    "content": [
        {
            "text": "As businesses across the country closed their doors in March 2020, it was unclear just how long these doors would remain closed. Small businesses found themselves facing a frightening and confusing time, having to adjust to the continually changing landscape."
        },
        {
            "text": "In many cases, however, this pause in time allowed some people to reflect on their career goals and prompted them to launch their own businesses."
        },
        {
            "text": "We spoke to 3 businesses, who either pivoted or started up during the coronavirus (COVID-19) pandemic and found out how they were able to grow in unpredictable circumstances."
        },
        {
            "heading": 2,
            "text": "Afrori Books"
        },
        {
            "text": "For Carolynn Bain, the pandemic and the civil rights uprising that started to unfold in the summer of 2020 highlighted the importance and need for her to start up her Brighton based business - Afrori Books."
        },
        {
            "text": "Afrori Books is an online bookshop that specialises in books by black authors. Their mission statement is simple - to support black authors, create diverse bookshelves and be a voice for justice."
        },
        {
            "text": "As a Business & IP Centre National Network business, we were able to assist Carolynn by providing local information and resources to help her grow during this time, specifically ways to source funding to expand the business into a physical shop through our Business & IP Centre Brighton & Hove."
        },
        {
            "text": "\"Starting a business during the pandemic is an unusual thing to do. However, I think what had a bigger impact on us was starting a business during a pandemic and during a civil rights uprising in terms of Black Lives Matter – they cannot be separated for us. Many people were at home, reading books and for the first time ever really the world was sitting still, watching these things unfold before them. That had a massive impact on us and, in a positive sense, bought customers to us who previously maybe would not have considered looking at books by black authors."
        },
        {
            "text": "As we go forward, we are in the middle of crowd funding as we are looking to open a physical shop – working in partnership with a charity in Brighton who have given us a shop space. That has also come off the back of the civil rights movement, as they want to see Brighton change and become a safe space for black authors and black people living in the city. It’s all interconnected.\""
        },
        {
            "heading": 2,
            "text": "The Woodlife Project"
        },
        {
            "text": "Another National Network business, who recently took part in our Innovating for Growth programme, which has seen growth during the pandemic, is The Woodlife Project. The Norfolk based business, founded by Hazel Russell manufactures eco-friendly wooden products for family meal times."
        },
        {
            "text": "The Woodlife Project, who got support from BIPC Norfolk, mostly sell online on their own website and wholesale through a variety of different retailers. They are now available online at John Lewis and, like Afrori Books, will be looking to have in store product space soon too."
        },
        {
            "text": "\"Our proudest moment in business so far has been getting into John Lewis, as they were one of our ideal retailers from the offset. We are online - in the nursery section with our bear, fox and rabbit plates. If all goes well we will be in store soon.\""
        },
        {
            "heading": 2,
            "text": "Stitch and Story"
        },
        {
            "text": "Jennifer Lam also took part in our Innovating for Growth programme. She is the co-founder and CEO of Stitch and Story based in London, an online crafting company on a mission to make crafting simple and easy to learn. During the numerous lockdowns, confined to their homes, people were getting back in touch with their creative side which bode well for this crafting business."
        },
        {
            "text": "\"During the pandemic Stitch and Story grew enormously. I think we were one of the lucky companies who were able to grow because everybody was in lockdown, looking for a new skill or hobby to pick up at home. We provided many customers with a new skill in knitting and crocheting and so we expanded very quickly online predominantly.”"
        },
        {
            "text": "One of the biggest changes to Stitch and Story was the team. They more than doubled the team during the pandemic from 7 to 22."
        },
        {
            "text": "\"We had to recruit everyone virtually at the time and it was stressful as we had no experience in doing that before - the BIPC really helped in providing us resources for this.\""
        },
        {
            "heading": 2,
            "text": "The importance of small business"
        },
        {
            "text": "Despite the devastating effects of the pandemic, we’re pleased to see small businesses surviving, thriving and growing through it. It has highlighted the importance of small businesses – being innovative, providing jobs and supporting local communities."
        },
        {
            "text": "In turn, there has been an increase in public support for local small businesses, to help make sure they remained profitable – a trend we hope continues long after the pandemic has ended."
        }
    ]
}