{
    "url": "https://stratcommand.blog.gov.uk/2021/12/17/overseas-bases-in-focus-8-things-you-probably-didnt-know-about-gibraltar/",
    "title": "Overseas Bases in focus: 8 things you probably didn't know about Gibraltar",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "FAQ",
        "International",
        "Overseas Bases"
    ],
    "pub_date": "2021-12-17T07:00:55+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Travel around 1000 miles south of London and you’ll be on the southern tip of the Iberian Peninsula. A small-town bordering Spain, with a population of wild monkeys, which uses the Great British Pound Sterling as its currency."
        },
        {
            "heading": 4,
            "text": "We’re talking of course about the British Overseas Territory of Gibraltar. Dominated by the Rock of Gibraltar, and with a population of around 32,000, you may be forgiven for thinking this small town is quiet, but it’s a hive of activity."
        },
        {
            "heading": 4,
            "text": "As a British territory the Royal Navy, British Army, and Royal Air Force all have a presence there and there’s much more to Gibraltar than meets the eye. So here are 8 things you may not have known:"
        },
        {
            "heading": 3,
            "text": "The airport has a road in the middle of its runway"
        },
        {
            "text": "Yes, you read that correctly. The airport has a road in the middle of its runway. At four lanes wide, Winston Churchill Avenue is the main road leading in and out of Gibraltar and it has to be closed every time a plane takes off or lands. The airport is managed by the RAF, who co-ordinate all of Gibraltar’s air traffic, including civilian flights."
        },
        {
            "text": "RAF personnel are also responsible for making sure the runway is checked for Foreign Object Debris (or FOD) every time it’s used. This is extremely important, as even a small piece of FOD could cause serious damage to an aircraft, putting the passengers and crew at risk. But having a road running through it isn’t the only special thing about the Gibraltar runway, as it also extends out into the sea with a third of its total length being built into the water."
        },
        {
            "heading": 3,
            "text": "The Rock of Gibraltar is bigger than the Empire State building"
        },
        {
            "text": "Well, if you don’t count the Empire State Building’s antenna at least. At 426 metres high, the rock is almost 50 metres taller than the roof height of the New York City skyscraper. This height means that the rock offers a major strategical advantage, and the radar equipment positioned on top of its summit helps to track flight paths from the airfield below."
        },
        {
            "heading": 3,
            "text": "Every year over 50,000 vessels pass through its waters"
        },
        {
            "text": "The waters of Gibraltar are in a prime location, acting as a crossroads between the Mediterranean and Atlantic shipping lanes. This unique geographic position means that the port acts as a great supply point for passing ships with approximately 60,000 vessels passing through its waters each year."
        },
        {
            "heading": 3,
            "text": "Wild monkeys roam the rock"
        },
        {
            "text": "The rock is home to around 300 Barbary Macaques. Originally from Morocco, the monkeys have been in Gibraltar for over 300 years. Legend says that as long as the monkeys exist in Gibraltar the territory will remain under British rule. During World War II the population dwindled to just seven monkeys, so Prime Minister Winston Churchill ordered that their numbers be replenished from both Algeria and Morocco."
        },
        {
            "heading": 3,
            "text": "There are around 34 miles of tunnels inside the rock"
        },
        {
            "text": "34 miles of tunnels may sound like a lot, especially considering that Gibraltar is only 2.6 square miles. Well, that’s because it is a lot!  It’s almost twice the length of its entire road network. During World War II the tunnels become an underground fortress that could hold 16,000 personnel and their equipment and supplies. Whilst parts of the tunnels are now open to the public, other parts have been repurposed into a training ground for the Armed Forces. Earlier this year the Royal Gibraltar Regiment completed a four-day exercise in the tunnels aimed at simulating underground offensive actions."
        },
        {
            "heading": 3,
            "text": "Its police force is the oldest overseas force in the Commonwealth "
        },
        {
            "text": "Becoming operational in 1830, the Gibraltar Police is the oldest overseas police force in the Commonwealth and the second oldest British Police Force in the world. Only the Metropolitan Police in London is older, having been established just nine months earlier. The Royal Gibraltar Police work closely with many other organisations, including the Ministry of Defence policing and security service, and the Gibraltar Defence Police. "
        },
        {
            "heading": 3,
            "text": "The naval squadron there patrol every single day"
        },
        {
            "text": "The Royal Navy Squadron contribute to the maritime defence and security of Gibraltar, taking part in operations to protect the integrity of British Gibraltar Territorial Waters. To achieve their mission, the squadron patrol the waters every single day, whilst also being ready to respond to calls to action between 10 minutes and an hour’s notice depending on the time of the day."
        },
        {
            "heading": 3,
            "text": "It was the site of the longest ever siege endured by the British Armed Forces"
        },
        {
            "text": "At three years, seven months and 12 days the Great Siege of Gibraltar is the longest endured by the British Armed Forces. Beginning on the 24 June 1779 the siege was an attempt by Spain and France to capture Gibraltar from the British. After three years the siege came to an end when a British convoy of 31 transport ships managed to break the blockade, bringing in vital supplies, food, ammunition, and troops. With these reinforcements negotiations were reopened and a peace treaty was finally signed."
        },
        {
            "text": "\nSupport to overseas bases is just one of the essential functions which Strategic Command performs for UK defence."
        },
        {
            "text": "You can find out more about who we are, and what we do, in our blog \"What do you really know about Strategic Command?\"  "
        },
        {
            "text": "Alternatively, you can follow us on Twitter or LinkedIn, or subscribe to our blog."
        }
    ]
}