{
    "url": "https://gds.blog.gov.uk/2021/12/17/podcast-how-to-start-a-career-in-tech/",
    "title": "Podcast: How to start a career in tech",
    "authors": [
        "The GDS Team"
    ],
    "categories": [
        "Digital, Data and Technology",
        "GDS team",
        "People and skills",
        "Podcast"
    ],
    "pub_date": "2021-12-17T10:01:15+00:00",
    "content": [
        {
            "text": "In this month’s episode of the Government Digital Service (GDS) Podcast, we’re going to be talking about careers in tech."
        },
        {
            "text": "Digital, data and technology roles in government - like the ones here at at the Government Digital Service - come with stacks of flexibility and career opportunities, the chance to be creative, and to work on stuff that really matters."
        },
        {
            "text": "But according to a Tech Nation Talent report, young people could be counting themselves out of a fulfilling career in technology because they’re worried about things like their skills background, where they came from or their lack of “network”."
        },
        {
            "text": "We don’t want anyone to miss out on a great career in digital, data or technology. Because diverse teams that reflect the society they serve are more effective and better to be a part of (and those are the types of teams we’re trying to build)."
        },
        {
            "text": "So in this episode we asked senior developers Rosa Fox, Iqbal Ahmed and Kelvin Gan to reflect on the report’s findings and hopefully, put some of those myths and misconceptions to bed."
        },
        {
            "heading": 2,
            "text": "Jobs at the Government Digital Service"
        },
        {
            "text": "If what you’ve read or heard has given you the confidence to pursue a career in technology, why not start your tech career here at the Government Digital Service? And you can always comment on this post if you have any questions."
        },
        {
            "heading": 2,
            "text": "Subscribe to our podcast"
        },
        {
            "text": "You can subscribe to the GDS Podcast on Spotify, Apple Podcasts and all other major podcast platforms. You can read a transcript of the podcast on Podbean."
        },
        {
            "text": "Do you enjoy the GDS Podcast? Help us to make it even better by completing our short, anonymous survey."
        }
    ]
}