{
    "url": "https://design102.blog.gov.uk/2021/12/17/rebrand-vs-refresh-whats-right-for-your-project/",
    "title": "Rebrand vs refresh: what’s right for your project?",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Advice",
        "Branding",
        "Creative",
        "Design",
        "Services"
    ],
    "pub_date": "2021-12-17T12:00:44+00:00",
    "content": [
        {
            "text": "Your brand affects how your organisation looks, feels and comes across to others, so it’s important to get it right. This blog post explains the differences between rebranding and refreshing your brand to help you decide what’s best for your organisation."
        },
        {
            "heading": 2,
            "text": "What makes a brand?"
        },
        {
            "text": "Branding is made up of various components which can include:"
        },
        {
            "text": "Your brand can be communicated across every touch point your organisation uses, however small or large. This includes your website, adverts and campaigns, publications, stationery, email signatures, and office environment."
        },
        {
            "heading": 2,
            "text": "Why rebrand or refresh?"
        },
        {
            "text": "There are many reasons you may wish to consider a rebrand or brand refresh, including if you are changing your services or offerings, undergoing a structural change or merger, pursuing a new strategic direction, or underperforming in some way and in need of a re-route."
        },
        {
            "text": "However, proceed with caution if the team or organisation is simply bored of current branding, new members of staff are looking to ‘make their mark’ by rebranding, or if current branding is under-performing because it has not been well-managed."
        },
        {
            "heading": 2,
            "text": "What’s the difference between a rebrand and a brand refresh?"
        },
        {
            "text": "A large change from your existing branding would be classed as a rebrand; for instance, changing the name and logo beyond recognition. Smaller changes, such as adjusting the colour palette, tweaking the logo, or sharpening the messaging would be considered a brand refresh. A rebrand is sometimes referred to as a ‘revolution’ and a refresh, an ‘evolution’."
        },
        {
            "heading": 2,
            "text": "Which one is right for your project?"
        },
        {
            "text": "This comes down to how big a change your organisation needs and how much equity you have in your existing brand elements. You don’t always have to start again with a full rebrand when faced with change—sometimes a refresh which makes small tweaks can enable you to use your brand to its full potential."
        },
        {
            "text": "Conducting an audit at the beginning of the project is a useful way to assess your current branding and see how well the elements reflect your brand positioning. It can also highlight any issues that may need addressing and help you to work out the scope of your project. Types of audits that may be beneficial include visual audits, verbal audits, behavioural audits, and competitor and peer audits. Design102 can help you with these."
        },
        {
            "heading": 2,
            "text": "Design102 rebranding and brand refreshing examples"
        },
        {
            "heading": 3,
            "text": "Refresh: Ministry of Justice (MoJ)"
        },
        {
            "text": "MoJ felt their branding had become repetitive and corporate, with communications overusing the same layouts and dark blue from the colour palette. They wanted a new look and feel that would be bright, dynamic and modern and that would communicate the organisation’s gravitas without appearing dark and sombre."
        },
        {
            "text": "We presented two routes, a rebrand and a refresh. The refresh option was chosen as we were able to show MoJ how their existing branding could be used to its full potential by:"
        },
        {
            "text": "This project is considered a refresh because the existing brand elements were evolved to allow for more variation in designs and to create a more modern look and feel."
        },
        {
            "heading": 3,
            "text": "Rebrand: Government Campus"
        },
        {
            "text": "A new curriculum for government skills was launched in January 2021 to provide training opportunities to civil servants. The Campus for Government Skills asked us to create a brand that was clear, versatile and easily recognisable. We presented three logos with accompanying identities, each focusing on important elements from the new brand strategy. The chosen route incorporated:"
        },
        {
            "text": "This project is considered a rebrand because everything about the branding changed, including the name."
        },
        {
            "heading": 3,
            "text": "Refresh: UK Space Agency"
        },
        {
            "text": "The UK Space Agency felt their brand had become stale and wasn’t fully resonating with their audience. They wanted a new look and feel that reflected the dynamic and modern work they do and their status as global thought leaders within their field."
        },
        {
            "text": "We presented three routes, two of which were rebrands and one which was a substantial refresh. They chose the refresh which involved:"
        },
        {
            "text": "This project is considered a substantial refresh as we kept the essential elements of the existing logo due to it being well-recognised within the industry, while all other brand elements were changed."
        },
        {
            "heading": 3,
            "text": "Rebrand: Department for Education (DfE)"
        },
        {
            "text": "DfE felt their brand guidelines were limited and had become outdated. They wanted us to create a brand that reflected their purpose and empowered staff when creating branded communications. The design solution included:"
        },
        {
            "text": "This project is considered a rebrand as although the dark blue colour and logo (which aligned with existing government identity system logos) were unchanged, all other brand elements were new."
        },
        {
            "heading": 2,
            "text": "Still unsure what’s right for you? We can help"
        },
        {
            "text": "At Design102 we have successfully rebranded and refreshed brands for numerous public sector organisations, so if you’re considering either please get in touch at hello@design102.co.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}