{
    "url": "https://rpc.blog.gov.uk/2021/12/17/scrutiny-of-government-impact-assessments/",
    "title": "Scrutiny of Government Impact Assessments",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-12-17T15:50:43+00:00",
    "content": [
        {
            "text": "Regulatory Impact Assessments (IAs) are an important part of the government decision-making process. They set out the objectives of policy proposals and the costs, benefits and risks of different ways (non-regulatory as well as regulatory) of achieving those objectives. IAs help ministers and Parliament decide on the appropriate (regulatory or non-regulatory) approach when faced with a policy question."
        },
        {
            "text": "To give ministers and Parliament confidence that the evidence and analysis in the IAs is fit for purpose, the independent Regulatory Policy Committee (RPC) reviews all qualifying IAs (produced either by government departments or regulators), and publishes an opinion to support parliamentary scrutiny."
        },
        {
            "text": "Our opinions provide:"
        },
        {
            "text": "Over the past year, we have issued 94 opinions covering a wide range of policy areas. Based on analysis of these opinions, we highlight below areas that have generally been undertaken well and those where there remains room for improvement."
        },
        {
            "heading": 2,
            "text": "Consultation stage IAs – as a policy is developed"
        },
        {
            "text": "For the 41 consultation stage IAs we have reviewed over the year, almost one-third (32%) received a Red (not fit for purpose) rating for rationale and options (Figure 1). The most common weakness was insufficient identification and analysis of credible non-regulatory options. The Government’s review of the Better Regulation Framework (BRF) is considering ways to focus policymaking on these non-regulatory options, and our experience over the last year highlights the importance of independent scrutiny in understanding whether non-regulatory options may be a better way to tackle a particular problem than a regulatory approach."
        },
        {
            "text": "Over a fifth (21%) of consultation stage opinions were rated as not fit for purpose on the identification of impacts and the SaMBA. This suggests that departments need to develop the analysis of their policy proposals in more detail before they get to the stage where they are consulting with stakeholders."
        },
        {
            "text": "Across the other quality ratings in our opinions, nearly a half (46%) of consultation stage IAs received at least one ‘weak’ or ‘very weak’ rating. Analysis of wider impacts is a particular area for improvement, with only 10% of IAs being rated ‘good’ (Figure 2). This supports the case that we make in our blog post for using the Better Regulation Framework review to make our assessment of these wider impacts red-rateable."
        },
        {
            "heading": 4,
            "text": "Figure 1: Red and green ratings by category for consultation stage IAs"
        },
        {
            "heading": 4,
            "text": "Figure 2: Quality ratings by category for consultation stage IAs"
        },
        {
            "heading": 2,
            "text": "Final stage IAs – supporting the selected approach to regulation"
        },
        {
            "text": "At final stage, rather than directly issue a not fit for purpose (Red) rating, we typically issue an Initial Review Notice (IRN) which identifies issues that would otherwise lead to a Red rating and offers the department the opportunity to resubmit their IA. Of the 53 final stage IAs we scrutinised this year, 9 received an IRN, of which all but 2 received a Green rating when revised and resubmitted."
        },
        {
            "text": "Similar to consultation stage, we often identify weaknesses in the quality of the analysis at final stage, with 43% of IAs receiving at least one ‘weak' or ‘very weak’ rating. Wider impacts is again an area that needs to be improved, with only 19% being rated ‘good’ (Figure 3)."
        },
        {
            "text": "In addition, there is considerable scope to improve the quality of the monitoring and evaluation plans, with only 25% rated ‘good’ and 27% ‘weak’ or ‘very weak’. Given the importance of evaluating the effectiveness of regulations, we believe that it is essential that impact assessments contain good M&E plans to ensure early arrangements are put in place to deliver robust post implementation reviews that inform future decisions to retain or amend regulations. Again, this is an issue that is being considered as part of the Government’s current review of the BRF."
        },
        {
            "heading": 4,
            "text": "Figure 3: Quality ratings by category at final stage"
        },
        {
            "heading": 2,
            "text": "The impact of early scrutiny on the quality of impact assessments"
        },
        {
            "text": "Under the current BRF, some IAs are submitted to the RPC for scrutiny at both consultation and final stages while others are only reviewed at final stage. By looking across our quality ratings, we find that 100% of final stage IAs received a ‘good’ or ‘satisfactory’ rating for rationale and options when the RPC had previously provided a consultation stage opinion compared to 68% when there was no earlier scrutiny. Similarly, our rating of wider impacts (81% compared to 70%) and monitoring and evaluation plans (90% compared to 60%) were higher for IAs that had had earlier RPC scrutiny. We continue to argue for mandatory early scrutiny of IAs to improve the quality of analysis and help policy-makers and ministers to make better and more effective regulation."
        },
        {
            "heading": 2,
            "text": "Post Implementation Reviews (PIRs)"
        },
        {
            "text": "As noted above, we are concerned that the weakness of M&E plans in IAs impacts on departments’ ability to undertake robust PIRs after the regulation has been in place for 5 years. Over the last year, we have received only 12 PIRs for scrutiny. This highlights the need for departments to be more conscientious in carrying PIRs out in order to inform decisions over whether regulations should be retained, revised or replaced. Again, we argue in a blog post for the Government to improve this situation in its review of the BRF."
        }
    ]
}