{
    "url": "https://socialcare.blog.gov.uk/2021/12/17/time-all-voices-were-heard/",
    "title": "Time all voices were heard",
    "authors": [
        "Clenton Farquharson MBE"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Viewpoint"
    ],
    "pub_date": "2021-12-17T08:58:58+00:00",
    "content": [
        {
            "text": "I believe social care exists to support people to live healthy, meaningful lives. This requires government commitment for the long term and sustained investment in the future we are wanting to build."
        },
        {
            "text": "The current social care system is not set up in a way which provides equity of access and does not do enough to support fairness or the desired outcome of a meaningful life."
        },
        {
            "text": "Too much of the current system remains inflexible and siloed, looking at people through the lens of single conditions, as an older person, a disabled person, or someone with a long-term condition."
        },
        {
            "text": "It doesn’t take into account the intersectionality of a person or look at their life from a person-centred perspective, considering all their experience, history, culture, beliefs and needs. This means an individual’s ability to access support and opportunities to have a meaningful life can often be compromised"
        },
        {
            "text": "Equality, or treating everyone equally, in principle is good, but in a world where systemic inequalities are rife, we need to treat people differently until we have eradicated the barriers stopping people achieving their hopes, dreams and aspirations."
        },
        {
            "heading": 2,
            "text": "What can government do?"
        },
        {
            "text": "If inequality is designed in, can it be redesigned out? If so, how?"
        },
        {
            "text": "By ensuring central government involves all people, especially the most marginalised, in the decisions which affect their life. Tackling inequalities successfully can only be achieved by working as closely as possible with people who are currently excluded and seeing their experiences of care and support from their perspective."
        },
        {
            "text": "TLAP’s Making it Real framework, developed with people with lived experience of social care, is a great place to start having these conversations."
        },
        {
            "text": "Inequalities in access to care and support at a social level can lead to inequalities in health outcomes for people, neighbourhoods, and communities."
        },
        {
            "text": "Isn’t it better to promote, support and sustain good health than it is to treat poor health? Isn’t it also better to have rich, diverse, supportive communities, in addition to residential care and homecare which are often seen as the only viable option for people to leave hospital?"
        },
        {
            "text": "To achieve change we need to start doing things differently. This will take time and is why I welcome the Government’s acknowledgement of reform being a 10 year process. There is no quick fix here, but progress can start today if we are facing the right direction when we take those initial steps."
        },
        {
            "text": "I applaud the Government’s recent commitment in the white paper to do this in partnership with the people who draw on care and support. By working with TLAP and others, we all have an opportunity to bring people and groups, currently excluded or marginalised, into the heart of the conversation."
        },
        {
            "heading": 2,
            "text": "Hope and a helpful start"
        },
        {
            "text": "Through co-production and collaboration we can help shape the reforms, create shared spaces to resolve long standing barriers, and support local implementation and ultimately improvement."
        },
        {
            "text": "The DHSC white paper, ‘People at the Heart of Care’, is a helpful and welcome start, but there is a lot of heavy lifting to come to add the detail and attract the investment that transformation will require over the next decade of reforms."
        },
        {
            "text": "What we hear and who we meet will shape what we think. This will set what we prioritise, what we plan towards, and invest in. It will shape what we do, what we achieve and the outcomes for people and for the system."
        },
        {
            "text": "It’s too important to do that without lived experience at the table, where our common and entwined futures will take shape."
        }
    ]
}