{
    "url": "https://forestrycommission.blog.gov.uk/2021/12/17/tree-production-innovation-fund-spotlight-on-successful-applicants/",
    "title": "Tree Production Innovation Fund - Spotlight on successful applicants",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2021-12-17T10:14:50+00:00",
    "content": [
        {
            "text": "During National Tree Week it was announced that the Tree Production Innovation Fund would be making over £1 million available to 16 innovative projects striving to increase and diversify our domestic tree production"
        },
        {
            "text": "In our Tree Production Innovation Fund success stories blog post we gave a brief introduction into those 16 successful projects."
        },
        {
            "text": "Here we take a look at three of those projects in more detail and the organisations behind them."
        },
        {
            "heading": 2,
            "text": "SilviBio Ltd"
        },
        {
            "heading": 3,
            "text": "Exploring pelletisation of broadleaf tree seed to facilitate moisture retention, mechanised planting, seedling growth and germination"
        },
        {
            "text": "In order to achieve the England Trees Action Plan’s goal of “putting the right tree in the right place,” we must diversify the tree species planted in commercial plantations and ecosystem restoration and revitalisation projects. These tree species include broadleaf species, such as silver birch, willow, alder and rowan, which grow easily in otherwise challenging conditions, such as poor soil fertility and mountainous terrain."
        },
        {
            "text": "Given England’s tree planting commitments and need to increase sustainable timber production, these broadleaf species must be considered in tree planting projects. However, these species are difficult to integrate into mechanised sowing operations due to their small sized and/or irregularly shaped seed. Furthermore, much like other tree species, there is a limited amount of broadleaf seed supply, which therefore must be used efficiently."
        },
        {
            "text": "Seed pelleting can be used to resolve this issue. However, the pelleting process commonly used in the horticultural industry may cause moisture deprivation in broadleaf seeds. Given that these species are acutely sensitive to moisture deprivation, using standard pelleting techniques and materials may cause germination failures."
        },
        {
            "text": "SilviBio’s project supported by the Tree Production Innovation Fund will use our patent-pending moisture retaining seed coating within a seed pellet to address the moisture needs of broadleaf seeds. By increasing seed weight, size and uniformity, our pelleting process will make these seeds easier to handle and uniform enough for mechanised planting."
        },
        {
            "text": "Later in the project we will investigate the addition of growth and germination promoters to the seed pellet to assess if these additions improve germination and seedling establishment. Through commercialisation of the technology developed in this project, we hope to increase the efficiency of seed use, while improving the quality and diversity of trees planted."
        },
        {
            "heading": 2,
            "text": "Rhizocore Technologies Ltd and the Cheshire Wildlife Trust"
        },
        {
            "heading": 3,
            "text": "Improving the growth, health and resiliency of forests through the use of locally sourced mycorrhizal fungi"
        },
        {
            "text": "Almost all trees are infused with networks of symbiotic fungi that support the trees by supplying essential nutrients through their roots. These fungi, known as mycorrhizal fungi, quickly die whenever their host trees are missing, such as in upland, clear-felled or ex-agricultural sites that have little connectivity to other nearby woodlands. When we try to replant these areas, trees have a harder time establishing, leading to slower growth rates, higher mortality, and lost potential for carbon sequestration."
        },
        {
            "text": "This project is a collaboration between Rhizocore Technologies and the Cheshire Wildlife Trust to reconnect newly planted trees to their fungal symbionts. During this project the Rhizocore team will isolate mycorrhizal fungi from healthy, locally established woodlands in Cheshire. These fungi will then be grown at scale using fermentation technology before being encapsulated in pellets that can be applied to the planting hole prior to a tree being planted."
        },
        {
            "text": "The Cheshire Wildlife Trust (CWT) are involved in planting up to 200 hectares of trees over the next four years and would like to incorporate natural, locally-sourced mycorrhizal fungi into their planting operations, giving their trees the greatest chance of survival. Without this project there would be no supply of local mycorrhizal fungi to be used in tree planting operations resulting in slow growing forests with high susceptibility to droughts and disease."
        },
        {
            "text": "Therefore, this project aims to decrease tree mortality rates during planting, increase tree growth rates and increase woodland carbon sequestration in the newly planted forests in Cheshire. In addition, this project will provide a new fungal resource that can be used in any tree planting operation in the North West of England."
        },
        {
            "text": "Toby Parkes, CEO Rhizocore Technologies said:"
        },
        {
            "heading": 2,
            "text": "Intelligent Growth Solutions Ltd"
        },
        {
            "heading": 3,
            "text": "Total Controlled Environment Agriculture in Forestry Seedlings Production"
        },
        {
            "text": "The UK Government has pledged to increase the rate of tree planting to 7000Ha per annum (The England Trees Action Plan 2021-2024, May 2021, UK Government). To achieve these ambitious targets IGS believes that new technological solutions must be explored. The traditional production for tree seedlings in glasshouse nurseries is labour intensive, inefficient and expensive."
        },
        {
            "text": "The use of Total Controlled Environment Agriculture (TCEA) in a vertical farming environment guarantees fully controlled growth, year-round production and a 100-fold increase in productivity per ground area compared to greenhouse nurseries. Additionally, these systems are not susceptible to the external climate. TCEA techniques have been explored as a solution to optimise tree seedling production in the past with some positive results including: stronger roots; more robust plants; and cold and frost resistance."
        },
        {
            "text": "This specific project plans to adapt IGS' vertical farming technology systems to produce softwood seedlings all year round, working alongside identified nurseries to deliver the crops they are looking for. The anticipated results include a lower failure rate, higher biosecurity, and lower cost per seedling. The IGS systems are fully modular and allow greater flexibility than other comparable systems to enable the specific optimisation of certain species and seasonal flexibility."
        },
        {
            "text": "For example, in a 10,000m2 growth area with a ground footprint of 1,086m2, an IGS system could produce 226,008,000 tree seedlings year-round (619,200 trees per day). The objective of our project is to demonstrate the feasibility of using TCEA to produce year-round forestry seedlings while improving the quality of seedling production and reducing wastage/cost compared to traditional methods. We will also be testing some TreeTape trays for forestry seedlings."
        },
        {
            "text": "Goncalo Neves, IGS says:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}