{
    "url": "https://marinedevelopments.blog.gov.uk/2022/07/22/catching-fishers-view-of-the-future-of-channel-non-pressure-stocks/",
    "title": "Catching fishers’ view of the future of Channel non-pressure stocks",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-07-22T12:49:29+01:00",
    "content": [
        {
            "text": "In June MMO colleagues visited 21 ports stretching from Kent to Cornwall to speak with commercial fishers about their experiences of fishing for non-quota species (NQS, also known as non-pressure stocks) – and their aspirations for future management of these key stocks."
        },
        {
            "text": "Thanks to the dozens of fishers who took the time to give us their views, we are now in a much better place to understand what the new Channel demersal NQS fisheries management plan (FMP) needs to cover."
        },
        {
            "text": "This includes the species we should be looking at as well as the best ways to communicate and engage with commercial fishers to ensure their voice is included in the development of the FMP."
        },
        {
            "text": "FMPs are a cornerstone of the Government’s approach to fisheries management now the UK has left the EU’s Common Fisheries Policy and are geared to ensuring fish stocks remain sustainable for the long-term health of industry and protection of our marine environment."
        },
        {
            "text": "The Channel demersal NQS FMP will include ICES divisions 7d and 7e and cover a wide range of demersal species."
        },
        {
            "text": "Development of a plan specifically for demersal NQS in the Channel was highlighted by the fishing industry and other key marine stakeholders as a necessary move because of concern about potential over-exploitation of some stocks and a lack of data about non-quota stocks in general."
        },
        {
            "text": "Fishers in different ports expressed a wide range of views and we are now considering them, alongside the opinions of fellow marine stakeholders including recreational fishers, eNGOs and seafood businesses."
        },
        {
            "text": "We have published a more detailed overview of the feedback we received here and we encourage fishers to keep on giving us their thoughts at fmp@marinemanagement.org.uk"
        },
        {
            "text": "Here are some of the highlights of what we learned from these conversations:"
        },
        {
            "text": "We want to express our thanks to all those fishers who gave up their time to speak to us – we are committed to an on-going discussion with commercial fishers as we make progress with the FMP."
        }
    ]
}