{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/07/22/celebrating-south-asian-heritage-month-18-july-17-august-2022/",
    "title": "Celebrating South Asian Heritage Month – 18 July - 17 August 2022",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Latest Stories",
        "Uncategorized"
    ],
    "pub_date": "2022-07-22T15:08:00+01:00",
    "content": [
        {
            "text": "Join us as we mark the third year of South Asian Heritage Month, an event established to honour and celebrate South Asian history and culture. This year’s theme is Journeys of Empire and explores the history of empires founded from the 1300s through to the journey of families migrating to the UK following WWII."
        },
        {
            "text": "Look out for notifications and promotion in the media about events that are being hosted. Let us know about your local events and we will share the details across the profession so that GSE members can participate and learn."
        },
        {
            "text": "In this feature, some of our members share their stories what south Asian Heritage Month means to them. We hope you enjoy reading them in the same way that we have - and if you feel inspired and want to write a piece to be included in this feature, get in touch with us."
        },
        {
            "text": " "
        },
        {
            "text": "Our family Journey of Empire"
        },
        {
            "text": "\"Without question the one thing that all South Asians I know have in common is their love of food, whether it’s cooking a desi recipe, eating it, sharing it or the banter of debating who cooks it better and from which region!"
        },
        {
            "text": "But there is more to South Asians than just food and that is why this month is important to me.   We get the opportunity to share and hear amazing family stories.  Whenever I asked the question of why we live in the UK growing up, the response I received from my parents was ‘we’re here because your grandfather served in Burma (Myanmar), helped defeat the Japanese, refused US citizenship and came to the UK after the war for a better life for us all’. That’s it. No more information.  I didn’t even realise how significant the war in Burma was until I was an adult and I never met my grandfather to ask him about his experience.  But a few years ago following a story I read about during south Asian Heritage Month it prompted me to ask questions and verify our family story with family members."
        },
        {
            "text": "It makes me proud to know that my grandfather played a role in the war. He and other South Asians should be celebrated for the freedoms we enjoy today, but this will only happen if we share the history.  I’m also proud that this month will highlight many more stories like mine. So if you have any information about your family heritage, take the time to ask some questions and share.  Don’t get me wrong, I’m definitely in the ‘foodie’ category of South Asians but I know we have great stories to share over a meal…\""
        },
        {
            "text": "Story shared by a GSE Profession member"
        },
        {
            "text": " "
        },
        {
            "text": "What South Asian Heritage Month means to me:"
        },
        {
            "text": "\"Every time I go back to Sri-Lanka, my aunt waits at the airport arrivals gate in Colombo with a tub of freshly fried fish cutlets and patties. My stomach, plagued for the last 13 hours with travel sickness, gains a new life – it knows the joy that is coming. Cold Milo milk after swimming in the sea, Hopper pancakes at breakfast, fresh mangoes and coconuts from the garden, the umami-ness of Maldive fish sambols and the smell of cinnamon, cardamom, cumin and cloves wafting through the air."
        },
        {
            "text": "I was born in Sri-Lanka and spent my early childhood there. Having now forgotten my native Sinhalese language, food has become my cultural mediator. It allows me to navigate and strengthen ties with family who live in a world, now so culturally different from my own. I am indebted to the power of the lentil – my love for dhal in all its forms (chana, urad, moong, parrippu curry) has allowed me to connect with, and cook for, other Sri-Lankans and South Asians in the UK. Bring me into any conversation about my mum’s recipe and I will happily talk for hours. That’s what, in essence, South Asian History Month means to me – traversing the paths of my childhood and bringing others along with me\""
        },
        {
            "text": "Story shared by Eshitha Vaz, Department of Health and Social Care  -‘My role as a Policy Advisor in the Seasonal Flu team is my first in the civil service – I am three months old in civil service time. Prior to my current role, I studied vaccine hesitancy and worked in global health research funding. Now, I spend most of my time stretching myself across the vaccines space and trying to soak up as many new policy experiences as possible’."
        },
        {
            "text": " "
        },
        {
            "text": "Proud to be Asian"
        },
        {
            "text": "\"When I was a child, I was embarrassed to be Asian. I wanted to be like everyone else in my school. I hated the fact I was different and was ashamed to walk with my parents. But here I am in 2022 proud of my Asian heritage and walk proudly with my mum."
        },
        {
            "text": "My language skills are not bad in my opinion. I like to name it Benglish, a mix of Bengali and English. I have traditional parents so learning the language was a must. However, not being too keen in the culture in my younger days meant that I missed out on learning about both my parents’ background/childhood and how it was for them when they moved from Bangladesh to England. My father has passed away, and I hear some of the stories about him from my brother and live with the regret of not taking the interest when I had the chance."
        },
        {
            "text": "However, over the past 10 years I have tried to learn more about the Bengali culture, how to cook some of the curries. I think I probably watch more videos on cooking than actually cooking, although this photo shows some of the dishes I like to prepare.  If asked what my favourite curry is, then that’s undoubtedly fresh potato and chicken curry."
        },
        {
            "text": "I like to think myself as a bit of a Bollywood guru as I enjoy watching and know all the movies/ TV series out there, although the latest ones just don’t match up to the old Bollywood movies."
        },
        {
            "text": "Asian culture is like a magic box where you keep finding things. There is such an amazing diversity in culture, the spices, the desserts, the entertainment, the community feel and the amount of greenery when you travel to a south Asian country."
        },
        {
            "text": "I am a proud Asian and happy we are celebrating South Asian Heritage Month - it’s been great seeing all these amazing events happening across the Civil Service.\""
        },
        {
            "text": "Story shared by a GSE Profession member"
        },
        {
            "text": " "
        },
        {
            "text": "What South Asian Heritage Month means to me:"
        },
        {
            "text": "South Asian Heritage Month for me is an opportunity to reflect on and celebrate the stories and experiences of south Asian people both in the UK and globally. This month is personally important to me as I am of both Pakistani and Bangladeshi heritage, and I use this month to reflect on the beautiful and resilient history of my ancestors.  It is important we honour and learn from our history and continue to create spaces where people can learn from each other. Growing up in the UK, I didn’t always feel represented in the media, hence why I feel so grateful for initiatives such as SAHM."
        },
        {
            "text": "Surraya Chowdhury, Co-Chair of DHSC Race Equality Matters Network and Programme Officer for UK Vaccine Network"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}