{
    "url": "https://ruralpayments.blog.gov.uk/2022/07/22/introducing-you-to-8/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Introducing You To"
    ],
    "pub_date": "2022-07-22T16:22:02+01:00",
    "content": [
        {
            "text": "Hi, I’m Simon and I’m an Operational Mapping Query Team Leader with RPA based at the Reading Office."
        },
        {
            "text": "I joined RPA 15 years ago straight from studying Geography at university and I’ve worked in mapping ever since. "
        },
        {
            "text": "If a customer wants to make a mapping change or to correct a land area they send us an RLE1 form. We then send the form to our digitisers to update the mapping, but if there are any issues they will raise a query with my team. About a third of all mapping jobs result in a query being generated. Queries are usually generated when the digitisers need more information to support the mapping change request. We get a huge variety of queries and there can be a whole range of questions for us to deal with."
        },
        {
            "text": "In our busiest periods we can get several hundred queries a day and we work hard to complete them all in time to support the business in making as many customer payments as early in the payment window as possible. A typical day for me starts with me assigning work to my team, and then for the rest of the day I will be helping them out answering questions, liaising with customers and quality assuring our outputs."
        },
        {
            "text": "The work we do helps our customers by ensuring the mapping of their land is done accurately and in a timely manner. This supports the Basic Payment Scheme, Countryside Stewardship, Environmental Stewardship and more recently the pilot for the new Sustainable Farming Incentive. These get prioritised at different times of the year to ensure the mapping is done for when the customer needs it."
        },
        {
            "text": "I really enjoy the mapping side of my role because I love looking at maps and investigating any issues that might arise. I like investigating how and why land parcels have been mapped in a certain way. It can often be like solving a puzzle, particularly with historical mapping. Our mapping system allows us to look at requests going back to 2015 when BPS started, and I can see what was requested at the time. I have access to the maps that the customers submitted and we can then use ordnance survey, aerial images (from planes) and remote sensing imagery from satellites, which are all taken at different times/years and from there I can build up a picture of how land parcels have changed over time."
        },
        {
            "text": "There are 2.5m land parcels in England and we check over 900,000 of these every year to see if any amendments are required - that might be because a new road has been built, for instance. Every year land parcels need amending, but year after year we need to make less changes which means our accuracy is getting better. We do this in a short timeframe, normally December to March to minimise the impact on claim forms and payments."
        },
        {
            "text": "We are always looking to improve our mapping standards and continue to look at the mapping protocol especially with the onset of the new schemes such as Sustainable Farming Incentive previously mentioned."
        },
        {
            "text": "Outside of work I enjoy going to the cinema and reading. I have a poodle called Harry and I love taking him for walks."
        }
    ]
}