{
    "url": "https://naturalengland.blog.gov.uk/2022/07/22/nutrient-mitigation-scheme-can-help-provide-the-nature-and-housing-we-need/",
    "title": "Nutrient mitigation scheme can help provide the nature and housing we need",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity",
        "Protected sites and species",
        "Site of Special Scientific Interest",
        "Wildlife"
    ],
    "pub_date": "2022-07-22T16:38:51+01:00",
    "content": [
        {
            "text": "\nBy Mel Hughes, Director of Sustainable Development, Natural England"
        },
        {
            "text": "Solutions to the pressing issue of how to bring forward plans for sustainable new homes without adding further nutrients to our already polluted waterbodies have been strengthened this week by Natural England (NE) and government."
        },
        {
            "text": "A new funded strategic mitigation scheme which we have developed in partnership with government will support a number of local planning authorities (LPAs) as they consider development applications alongside nutrient neutrality advice."
        },
        {
            "text": "The rationale behind nutrient neutrality has been widely publicised over the last few months and my previous blog explains why NE gave the advice it did in liaison with Defra and the Department for Levelling Up, Housing and Communities (DLUHC). The underlying problem isn’t the legal framework surrounding our waterbodies and the nature they sustain, rather it’s the effects of pollution taking place over decades; fortunately the legal protections have acted as a safety net and provided the means to take action before it’s too late."
        },
        {
            "text": "Without the Habitats Regulations our precious sites would have continued to suffer growing pollution, damaging the very environment we need to support us through climate change adaptation and resilience. We are though working with government to streamline approaches and consider issues earlier. What will really enable us to make a substantial difference are the measures that have now been accelerated on nutrient pollution. Water companies will legally be required to reduce pollution significantly by 2030, employing technically achievable limits as their goal. That will address part of the problem at source and, in the near future, reduce the need for a neutral approach for development."
        },
        {
            "text": "In the meantime, nature-based solutions such as creation of wetlands and woodlands will help, supported by shorter-term measures to buffer watercourses and fallow land. These will help reduce the nutrients going into our rivers and estuaries and effectively mitigate the additional inputs from new homes."
        },
        {
            "text": "Developing the relationships between landowners, LPAs and developers that are needed for successful mitigations to be agreed takes time and this is new territory for many. Similarly, finance can be a barrier, whereby funds are needed up front to secure mitigation such that developers can rely on solutions before they get spades in the ground."
        },
        {
            "text": "We’re therefore really pleased that Defra and DLUHC will provide new funding to pump-prime this scheme. In essence this will enable Natural England, who will implement the scheme, to facilitate and drive forward mitigation where it’s most needed."
        },
        {
            "text": "We are mindful of the fact that there are a number of mitigation schemes already operating and strategic mitigation does not replace those. Rather, the new scheme will focus on the creation of new solutions where they are needed and the provision of support to those currently under development that need help to reach implementation stage."
        },
        {
            "text": "Operational details are currently being developed and we’d like to engage with as many as possible to get this right. It is expected that under the strategic mitigation scheme:"
        },
        {
            "text": "We will need to consider priorities to ensure that there is a strong enough supply of mitigation where it is most needed. We may need to phase availability to enable this when we launch the scheme in the Autumn."
        },
        {
            "text": "Current figures from LGA show tens of thousands of homes waiting for planning permission in affected areas though nutrient neutrality may not be the only factor in every case. We want to get ahead of the curve, managing a revolving fund of selling mitigation funded by up-front investment and reinvesting in new mitigation ahead of need. We therefore don’t anticipate the up-front scheme funding to be the only monies achieving neutrality."
        },
        {
            "text": "Get this scheme right and it will:"
        },
        {
            "text": "It’s also timely to note that on 15 July 2022 the Court of Appeal firmly rejected criticism of our advice and the way that the LPA applied it in Fareham, Hants. This positive outcome should give all those involved confidence in the approach and methodology Natural England has proposed to help LPAs address nutrient impacts from new development."
        },
        {
            "text": "We know that many will have questions relating to this and a central mailbox (nutrientmitigation@naturalengland.org.uk) has been established to capture these."
        },
        {
            "text": "There is a tremendous amount to do in a short space of time; we don’t yet have all the answers, but working together we will get there. As much as possible we’d like to use workshop events to work through issues and we will share information via existing platforms including the Planning Advisory Service in due course."
        },
        {
            "text": "We look forward to working with LPAs, developers, landowners and other stakeholders to maximise the benefits of this significant investment."
        },
        {
            "text": " "
        }
    ]
}