{
    "url": "https://deframedia.blog.gov.uk/2022/07/22/plan-to-tackle-nutrient-pollution-announced/",
    "title": "Plan to tackle nutrient pollution announced",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Natural England",
        "water",
        "Weekly stories"
    ],
    "pub_date": "2022-07-22T15:45:30+01:00",
    "content": [
        {
            "text": "There has been coverage in the Financial Times, Eastern Daily Press and trade publications such as Business Green, Ends Report and Housing Today of government action on nutrient pollution."
        },
        {
            "text": "Nutrient pollution is an urgent problem for freshwater habitats and estuaries which provide a home to wetland birds, fish and insects. Increased levels of nutrients like nitrogen and phosphorus can speed up the growth of certain plants, disrupting natural processes and devastating wildlife."
        },
        {
            "text": "Plans announced this week will help safeguard England’s precious protected wildlife sites by driving down nutrient pollution and allowing for the construction of sustainable new homes for families across the country."
        },
        {
            "text": "This includes a new legal duty on water companies in England to upgrade wastewater treatment works by 2030 in ‘nutrient neutrality’ areas to the highest achievable technological levels."
        },
        {
            "text": "We also announced that a Nutrient Mitigation Scheme is to be established by Natural England, helping wildlife and boosting access to nature by investing in projects like new and expanded wetlands and woodlands. This will allow local planning authorities to grant planning permission for new developments in areas with nutrient pollution issues."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "\"The plans we have announced today will protect England’s wildlife and precious habitats from the impacts of nutrient pollution, whilst ensuring communities receive the new homes they need."
        },
        {
            "text": "This is just one part of ongoing Government action to improve water quality across the country, from targets in our world-leading Environment Act to action on storm overflows.\""
        },
        {
            "text": "Levelling Up Secretary Greg Clark said:"
        },
        {
            "text": "\"It is essential that new homes do not impair the quality of our rivers, streams and wetlands. These measures will ensure the development can take place, but only where there is practical action taken to protect our precious aquatic habitats.\""
        },
        {
            "text": "Natural England chair Tony Juniper said:"
        },
        {
            "text": "“Wetlands and estuaries are home to a wide variety of internationally-important wildlife species, from wading birds to insects and from fish to special plants. Pollution from excess nutrients is causing serious damage to many of these fragile places and if we are to meet our national targets for Nature recovery it is vital that we take concerted, coordinated action to protect them.”"
        },
        {
            "text": "“The duty on water companies and the Nutrient Mitigation Scheme mark significant steps forward, and will help join up the various approaches to improving water quality and bring about multiple other benefits. They will provide the tools needed to help planning authorities, developers and water and land managers to both build new homes and support the healthy rivers and lakes that are vital for restoring Nature and creating beautiful places for everyone to enjoy.”"
        },
        {
            "text": "The plans announced this week build on our comprehensive action to significantly reduce water pollution, including proposed targets under the Environment Act to reduce the key sources of river pollution; a plan for the largest water company infrastructure project ever to reduce discharges from storm overflows; new funding to the Environment Agency to increase farm inspections to at least 4,000 inspections a year by 2023 and new farming schemes that will reward farmers and land managers for environmental actions, such as introducing cover crops and buffering rivers, to reduce run-off."
        }
    ]
}