{
    "url": "https://queensawards.blog.gov.uk/2022/07/22/the-queens-awards-for-enterprise-has-been-enerquips-springboard-to-further-growth/",
    "title": "The Queen’s Awards For Enterprise: Has Been Enerquip’s Springboard To Further Growth",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "International trade",
        "Queen's Award",
        "queensawards",
        "Scotland",
        "Winners"
    ],
    "pub_date": "2022-07-22T09:00:59+01:00",
    "content": [
        {
            "text": "EnerQuip was just five years old when it was awarded The Queen’s Award for Enterprise in 2020, for outstanding achievement in International Trade and there is no doubt that this prestigious accolade has provided an important springboard for further growth. "
        },
        {
            "text": "To be rewarded in a way which is so widely recognised and held in such high esteem was an important milestone in our corporate journey, and one which continues to play an important role in our ongoing growth. "
        },
        {
            "text": "Despite our comparative youth, EnerQuip rapidly expanded its global footprint and was quickly dealing with all four corners of the globe soon after it was set up in 2015.  Now, 95% of revenue is generated through export, with 80% from outside Europe, so overseas markets have always been central to sustainability and expansion.  There is, however, no doubt that taking the Best of British manufacturing and expertise to the world is always even more meaningful with external endorsement of this high calibre. "
        },
        {
            "text": "That will continue indefinitely as the company expands its corporate horizons on many fronts. Against the odds another geographical landmark was reached earlier this year when Enerquip landed its first ever contract to supply equipment to Uganda.  "
        },
        {
            "text": "Late 2021 also saw Enerquip land its largest ever single contract, valued at US$1.2 million, from a new client in Abu Dhabi. The first phase was delivered during the last quarter of 2021 with two further phases of additional work scheduled for this year set to bring the total package to US$4 million.   "
        },
        {
            "text": "There is no doubt that the kudos of being a Queen’s Award for Enterprise recipient is crucial in adding traction and gravitas to these and other overseas activities, and the endorsement associated with this accolade stands us in good stead particularly when entering hitherto unexplored markets.  In an era of diversity, pushing geographic boundaries is an important strategy in order to achieve future sustainability and being awarded a Queen’s Award for Enterprise affords us an even firmer foothold in new marketplaces from the outset. "
        },
        {
            "text": "Learn about EnerQuip here: https://enerquiptorque.com/ "
        },
        {
            "text": "Do you want to springboard your company’s growth to the next level? Applications are now open for 2023 and close midday 6th September. "
        },
        {
            "text": "Apply here: https://www.gov.uk/queens-awards-for-enterprise "
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880 "
        }
    ]
}