{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/07/22/the-retail-banking-order-what-it-means-for-you/",
    "title": "The Retail Banking Order: what it means for you",
    "authors": [
        "Peter Hill"
    ],
    "categories": [
        "Markets",
        "Remedies"
    ],
    "pub_date": "2022-07-22T11:12:58+01:00",
    "content": [
        {
            "text": "Have you stuck with your bank for years, unsure if you’re getting a good deal or not?"
        },
        {
            "text": "We know that people and businesses don’t switch current accounts very often: they think it takes too long, it’s complicated, and ultimately wouldn’t benefit them."
        },
        {
            "text": "But, thanks to the work that we’ve done, switching is quicker and easier."
        },
        {
            "heading": 2,
            "text": "Finding a better bank"
        },
        {
            "text": "Whether you’re a personal or a business banking customer, the Retail Banking Order means that there are ways you can find out if you’d be better off somewhere else."
        },
        {
            "heading": 3,
            "text": "Service quality"
        },
        {
            "text": "Banks have to publish customer satisfaction league tables which show how willing customers and businesses would be to recommend the service they provide to others. The league tables compare a bank’s results to their rivals."
        },
        {
            "text": "Your bank is required to show you its service quality rating:"
        },
        {
            "text": "Banks publish service quality information for personal current accounts and business current accounts twice a year, so you can see where your bank ranks."
        },
        {
            "text": "If your bank is in the relegation zone, why not consider switching?"
        },
        {
            "heading": 3,
            "text": "Personal overdraft charges"
        },
        {
            "text": "Your bank has a maximum amount that it can charge you each month for going overdrawn on your personal current account. Each bank sets its own maximum, so to see if you could be paying less at another bank, you could check what your maximum monthly charge is and use a comparison site."
        },
        {
            "heading": 3,
            "text": "Business loans and overdrafts"
        },
        {
            "text": "With business accounts, your bank must display the indicative cost of unsecured loans and overdrafts. You may be paying more interest than you would elsewhere, so shop around and see if another bank charges less."
        },
        {
            "heading": 3,
            "text": "Backing up your transaction history"
        },
        {
            "text": "You may be hesitant to switch because you’re worried that you won’t be able to see your account history once you leave your current bank."
        },
        {
            "text": "This isn’t the case: your bank is required to send a history of transactions to you when you leave. This means you still have access to a list of previous transactions, which you can use to prove your credit history when applying for a loan or mortgage."
        },
        {
            "heading": 2,
            "text": "Break up with your bank easily: Current Account Switch guarantee"
        },
        {
            "text": "If you’ve found another bank that could give you a better deal, the Current Account Switch Service helps to make the process of switching much simpler. This free service is available to anyone with a personal or business current account in the UK."
        },
        {
            "text": "Check the list of participating banks and building societies to make sure you can use the Current Account Switch Service."
        },
        {
            "heading": 2,
            "text": "If your bank breaches the order"
        },
        {
            "text": "We enforce the Retail Banking Order, and regularly check that banks are doing what they’re required to do. If we find the Order is being breached, we can take action."
        },
        {
            "text": "Learn more about what happens when banks breach the Order."
        },
        {
            "heading": 3,
            "text": "Report a bank"
        },
        {
            "text": "Tell us if you think your bank has breached the Retail Banking Order. Get in touch by emailing general.enquiries@cma.gov.uk."
        },
        {
            "text": "The CMA doesn’t intervene on behalf of individual customers, but we do enforce the requirements of the Order. If you think your supplier has misinformed or overcharged you, contact Citizens Advice or the Financial Ombudsman Service."
        }
    ]
}