{
    "url": "https://defrafarming.blog.gov.uk/2024/03/20/animal-health-and-welfare-grant-now-available/",
    "title": "Animal Health and Welfare grants now available",
    "authors": [
        "Laurren March"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2024-03-20T11:04:31+00:00",
    "content": [
        {
            "text": "You can now apply for an Animal Health and Welfare grant through the Farming Equipment and Technology Fund (FETF) 2024. "
        },
        {
            "text": "Last month, I blogged about the FETF and improvements we've made to it. I also included a link to the official FETF 2024 guidance, which explains that there are 3 types of grants on offer to help you buy equipment or technology to:"
        },
        {
            "text": "You can apply for a grant from each of the 3 themes. We recently updated the guidance. GOV.UK will always be the place to find the very latest guidance for all our schemes."
        },
        {
            "text": "In this post, I’ll give a quick recap of the Animal Health and Welfare grant and let you know how to apply. "
        },
        {
            "heading": 2,
            "text": "Overview "
        },
        {
            "text": "Part of the Animal Health and Welfare Pathway, which offers a range of support to farmers, this particular FETF grant goes towards the cost of items on a list that help to improve animal health and welfare. We developed this list with farmers, vets and other experts. "
        },
        {
            "text": "There are over 130 items on the list and 29 are new additions. You'll see a range of items: from mobile cattle handling systems to enclosed piglet creeps to poultry perches. So, if you’re a cattle, sheep, pig or poultry farmer, it’s worth looking at the items. If you’re a contractor to these sectors, you can apply too.  "
        },
        {
            "text": "You can apply for a minimum of £1,000 and a maximum of £25,000. We'll pay a percentage of the cost depending on the item. The percentages are in the guidance."
        },
        {
            "text": "For many items, this percentage is an increase on last year. This funding will go towards either:"
        },
        {
            "text": " The deadline to apply is midday 1 May 2024. "
        },
        {
            "heading": 2,
            "text": "Improving your application score "
        },
        {
            "text": "The fund is competitive. If you decide to apply, you can increase your application score by providing evidence that you’ve discussed your application with a vet.   "
        },
        {
            "text": "You can get vet advice by telephone, email, or as part of a vet visit. You may be eligible to apply for a fully-funded vet visit as part of the Sustainable Farming Incentive (SFI) annual health and welfare review.    "
        },
        {
            "text": "You must receive advice on your application after 1 January 2024 and before 1 January 2025 for it to be eligible for the increase.    "
        },
        {
            "text": "You’ll need to provide your vet’s details, the date of the discussion and permission for us to contact your vet when you apply. "
        },
        {
            "heading": 2,
            "text": "Steps to apply "
        },
        {
            "text": "Your application should take around 20 minutes to complete. You’ll receive an acknowledgement email within 24 hours of applying – you may need to check your junk folder for emails about your application.    "
        },
        {
            "text": "The RPA will allocate funding once all the applications have been received and scored. You may not receive any, or all, of the funding you apply for.  "
        },
        {
            "text": "If your application is successful, the RPA will send you a Grant Funding Agreement (GFA). GFAs for each grant will be sent separately. If your application is unsuccessful, the RPA will write to you to tell you why. "
        },
        {
            "text": "Use the Farming Investment Fund service to accept your GFA by the deadline which will be in the email. You’ll need to select each grant to accept each GFA.   "
        },
        {
            "text": "We've set out the steps you’ll need to follow to claim your FETF 2024 grant payment on GOV.UK.   "
        },
        {
            "heading": 2,
            "text": "Future application windows "
        },
        {
            "text": "We’re planning 2 more opportunities to apply for productivity, slurry and animal health and welfare grants later this year. "
        },
        {
            "text": "The item specifications and their costs will be the same in each application window. The budget for each grant is split evenly across the application windows. "
        },
        {
            "text": "If your application falls below the scoring threshold and is unsuccessful, the RPA will reject it. You will be able to apply again. "
        },
        {
            "text": "If you've accepted a grant funding agreement (GFA) to buy items from a grant, you cannot apply again for the same grant in 2024. "
        },
        {
            "text": "Finally, don’t forget the window to apply for productivity and slurry management grants will close midday 17 April. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "Last week, our team hosted a webinar covering the FETF grants."
        },
        {
            "text": "Watch the recording."
        },
        {
            "text": "We will blog again soon with answers to the questions that were submitted at the webinar. "
        }
    ]
}