{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/20/enhancing-science-and-engineering-capability-a-year-of-the-gse-awareness-courses/",
    "title": "Enhancing Science and Engineering Capability: A Year of the GSE Awareness Courses",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Capability & Skills",
        "GSE Offer",
        "Learning & Development",
        "Uncategorized"
    ],
    "pub_date": "2024-03-20T16:26:44+00:00",
    "content": [
        {
            "text": "As we approach the one-year anniversary of the GSE Awareness Level Courses, we reflect on the impact they’ve had in shaping science and engineering capability across government. Your feedback has been instrumental in improving these courses, and we’re excited to share the progress. You asked a number of questions and we have responded."
        },
        {
            "text": "Understanding Science and Engineering in Devolved Governments "
        },
        {
            "text": "You asked: “How does Science and Engineering work in devolved governments?” "
        },
        {
            "text": "We did: "
        },
        {
            "text": "Enhancing Policy Development through Government Engineers "
        },
        {
            "text": "You asked: “How can engineers support my policy advice area?” "
        },
        {
            "text": "We did: "
        },
        {
            "text": "Engaging Experts with Policymakers "
        },
        {
            "text": "You asked: “As an expert, how can I contact policymakers?” "
        },
        {
            "text": "We did: "
        },
        {
            "text": "Find out more "
        },
        {
            "text": "If you’re eager for updates, the GSE Awareness Courses are still available on Civil Service Learning and FutureLearn. Dive in and continue your journey towards enhancing science and engineering capability across government. "
        },
        {
            "text": "Do you want to enhance science and engineering capability in your organisation? Become a GSE L&D Champion and share information about this and many more GSE Offers. Contact us through gse@go-science.gov.uk to become a GSE L&D Champion.   "
        }
    ]
}