{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/03/20/royal-engineers-gibraltar/",
    "title": "Royal Engineers continue Northern Defences transformation",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-03-20T14:47:41+00:00",
    "content": [
        {
            "text": "Exercise STRONGHOLD took place last week in Gibraltar with Royal Engineers conducting various technical training exercises up at Buffadero Training Centre as well as a Civil Works Task alongside HM Government of Gibraltar’s Project Director, Mr Carl Viagas, at the Northern Defences."
        },
        {
            "text": "The Royal Engineers are regular visitors to Gibraltar."
        },
        {
            "text": "Due to the technical side of being Royal Engineers Officers, they are used to producing Detailed Engineering Plans."
        },
        {
            "text": " "
        },
        {
            "text": "The Northern Defences, which are situated just behind Grand Casemates Square, had been neglected for decades."
        },
        {
            "text": "Over the years, there has been a significant transformation which has exposed the skills of the Royal Artificer Corps, who carved into the northern face of the rock a formidable network of military defences, in the late 18th century."
        },
        {
            "text": "Back in 2015, the Royal Engineers initiated the second phase of the transformation which included the clearing up of King’s, Queen’s and Prince’s Lines. They returned in 2023 and once again last week to continue the transformation."
        },
        {
            "text": "The Engineers managed to allocate some downtime to explore and see the sights of Gibraltar, with visits to the World War II Tunnels."
        },
        {
            "text": "As with every visit, Ex STRONGHOLD took part in the legendary Gibraltar Rock Run, where they ascended the 426 metres to the Top of the Rock of Gibraltar before retreating to HMNB to take advantage of the Gunwharf facilities and participate in various water sports."
        },
        {
            "text": "On their final evening, the Royal Engineers held a social dinner in the Garrison Library with Commander British Forces, Commodore Tom Guy."
        }
    ]
}