{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/20/spotlight-a-catchment-coordinators-work-on-the-dart-saltmarshes/",
    "title": "Spotlight: a catchment coordinator's work on the Dart Saltmarshes",
    "authors": [
        "Emma Magee"
    ],
    "categories": [
        "Environmental Improvement Plan",
        "Land Use",
        "Nature",
        "Saltmarsh",
        "Water",
        "Wetland"
    ],
    "pub_date": "2024-03-20T09:00:23+00:00",
    "content": [
        {
            "text": "Over the next few months, we'll be publishing 'spotlight' posts to highlight the work of individual Defra group workers. This is our first one."
        },
        {
            "text": "South Devon is a place of inspiring natural beauty, from the deep richness of the peatlands of Dartmoor down to the salty fringe where land meets sea. Through this landscape runs a network of South Devon Rivers – the Teign, the Dart, the Avon, the Erme and the Yealm.  "
        },
        {
            "text": "I am the catchment co-ordinator for South Devon. And like many who live, work and play here, I love this landscape profoundly. "
        },
        {
            "text": "This is as true on the gloriously sunny days as it is on the wet ones, when white horses top the main channel, wind whips spray into our faces, and the iron-red Devon mud clings tight to our boots. It is very grounding to realise you are less cut out for these places than the unassuming plants at your feet – cord grass, sea asters and glassworts. "
        },
        {
            "text": "It is my happy job to deliver improvements in these precious environments that contribute to the delivery of the Environmental Improvement Plan, the Water Environment Regulations (previously the Water Framework Directive) and  Defra’s Plan for Water.  "
        },
        {
            "text": "I do this by working in partnership with colleagues across the Environment Agency as well as our external partners and stakeholders. I work on a catchment scale, looking at the pressures and challenges across the whole land area (the watershed) that drains water off the land, from source to sea. The pressures, the geographies, and people’s priorities and interests are as diverse as the natural habitats and – while it is a cliché – no two days are ever the same. "
        },
        {
            "text": "One of the habitats present in South Devon that has faced acute pressure is saltmarsh. Nationally, we have lost over 85% of our saltmarshes in recent centuries. The Dart estuary, like many in South Devon, is a ria (a narrow, flooded river valley) with pockets of saltmarsh nestled among a mosaic of mudflats, reedbeds, rocky shores and open water. "
        },
        {
            "text": "This variety of habitats is beautiful and incredibly valuable for the diversity of niches it provides to wildlife. But it is also vulnerable. There are pressures from rising sea levels, grazing (by livestock and wildlife), erosion, development and land use changes, invasive species, pollution and the footfall of human visitors. "
        },
        {
            "text": "To help improve the resilience of the Dart saltmarshes in the face of these pressures, I have worked with others to establish a multi-partner team to survey their condition. This work is to understand the challenges more acutely, raise awareness and appreciation for these places, and develop some prescriptions to help us decide how best to protect and enhance them. "
        },
        {
            "text": "Together we are looking at how we can work with landowners to encourage and fund land management decisions that work with and support saltmarshes. We are working with leisure users and authorities to encourage considerate behaviours from boats and other water users. We are helping people to understand and connect better with saltmarsh communities without threatening their future.   "
        },
        {
            "text": "Much of the work I do and influence is grant funded (both from the Environment Agency and other sources), which can mean the future of projects is relatively uncertain, even where there are clear benefits. As is often the case in conservation, you must have faith in your ability and that of your partners to match funding with delivery opportunities as they arise. "
        },
        {
            "text": "Our list of partners and delivery options keeps on growing as we all learn more about working with these habitats. I would love to be able to look back on this work in years to come and know that we helped make the future of these habitats more secure. "
        },
        {
            "text": "Note: The Dart Saltmarsh project has been funded by the Environment Agency through Championing Coastal Coordination and Water Environment Improvement Fund. It is hosted by the Bioregional Learning Centre, and delivery partners include: "
        },
        {
            "text": " "
        }
    ]
}