{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/03/20/we-are-strategic-command-with-robert-jaffier/",
    "title": "We Are Strategic Command with Robert Jaffier",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-20T10:30:33+00:00",
    "content": [
        {
            "text": "Learn more about the crucial role of Human Security in Defence with Cdr Robert Jaffier, Human Security Lead at Strategic Command."
        },
        {
            "text": "Interviewer: Could you introduce yourself and your role in this context?"
        },
        {
            "text": "Robert Jaffier: My name is Robert Jaffier, and I serve as Staff Officer 1 at Strategic Command, leading the efforts on Human Security. Essentially, my role involves looking after humans - addressing anything that affects their lives during and after operations, ensuring their survival and support for their families."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you explain what Human Security entails and why it's important?"
        },
        {
            "text": "Robert Jaffier: Human Security revolves around meeting the basic needs of individuals, ensuring their safety and well-being during and after operations. It's essential because, fundamentally, we all need to care for one another to ensure our survival."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What drives your passion for diversity and equality in your work?"
        },
        {
            "text": "Robert Jaffier: My passion for diversity and equality stems from a deep-seated belief in fairness and inclusivity. I've taken on roles such as being a race champion to promote these values within Strategic Command. This perspective enables me to offer support to Senior Command in approaching various challenges across Defence viewed with a different lens, leveraging my lived experiences and skills."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Do you have any other duties outside of your role?"
        },
        {
            "text": "Robert Jaffier: I am effectively a full-time reservist, and have been so for the last 5 years, having resigned from my civilian job in 2020. This decision to commit fully to my reservist duties was driven by my dedication to serving my country and fulfilling the responsibilities of my role to the best of my abilities."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you share a rewarding aspect of your work in supporting Human Security?"
        },
        {
            "text": "Robert Jaffier: One of the most rewarding aspects is the tangible difference we make in people's lives. Recent events worldwide highlight the prominence of Human Security on the agenda. It's fulfilling to know that we, within the Ministry of Defence, can contribute to safeguarding civilian populations wherever we operate globally."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What makes Strategic Command a unique environment for this work?"
        },
        {
            "text": "Robert Jaffier: Strategic Command offers a unique platform for collaborative efforts across Defence. It serves as a hub where we can collectively address some of the challenges within our operations and provide the necessary support to enhance Human Security. This collaborative spirit acts as a social glue, fostering a better environment for all within Defence."
        }
    ]
}