{
    "url": "https://mhclgdigital.blog.gov.uk/2019/03/28/defining-policy-outcomes-for-event-fees/",
    "title": "Defining policy outcomes for event fees",
    "authors": [
        "Sheldon Ferguson"
    ],
    "categories": [
        "Policy design"
    ],
    "pub_date": "2019-03-28T13:20:11+00:00",
    "content": [
        {
            "text": "My name is Sheldon Ferguson and I’m part of the policy team that deals with leasehold reform. I lead on event fees in retirement leasehold properties."
        },
        {
            "text": "You may be wondering what event fees are. Essentially, they are fees for services (like the maintenance of communal areas or the provision of care services, or even social gatherings for residents like garden parties), which are collected after the homeowner leaves the property."
        },
        {
            "text": "In 2013, the Office of Fair Trading's investigation into retirement home transfer fee terms found that some leases that included these fees were unfair. For example, some older people and their families weren’t told about the fees. In the worst cases, people were unexpectedly charged for moving in a partner or carer to assist with their care. This wasn’t happening in every case, but it was worrying for my team."
        },
        {
            "text": "As a result, in 2014, we asked the Law Commission to investigate. We received their report in April 2017."
        },
        {
            "text": "One of the report’s recommendations was for a national database of retirement leasehold properties to improve the transparency and presentation of event fee information ahead of purchase. This sounded great to me and I asked MHCLG’s Digital team to approve the database."
        },
        {
            "text": "I was surprised to discover they wanted a lot more information than I had. What would be in the database? Who would administer it? How did we know it would meet the needs of our users and solve the problem we’d identified? The team suggested doing a discovery exercise to really understand the issue. MHCLG ran an open procurement and Agilesphere were appointed to deliver the discovery."
        },
        {
            "text": "For a policy officer with my background, this was a new way of working which was culturally different to anything I’d done before. I had to get my head round new approaches such as stand-ups, show and tells, retrospectives, scrums and sprints. But what I did like about it was the openness and transparency of the methodology – even though we are very familiar with engaging with stakeholders and consulting on policy proposals. This enabled us to get external stakeholders on board and help shape the research and solutions. Publishing this report is part of our commitment to those stakeholders that we would publicly share the findings."
        },
        {
            "text": "But the biggest cultural shift I found was on the focus to define the policy outcome we wanted, rather than starting to consider the solution. The discovery team and I would investigate and test solutions with real users throughout the discovery."
        },
        {
            "text": "We looked at the entire landscape, what are the blockers and the enablers of achieving the desired outcomes. Equipped with these findings, the discovery was able to draw up some design principles of a solution."
        },
        {
            "heading": 2,
            "text": "Proposed Actions"
        },
        {
            "text": "Now, at the end of discovery, we have the following set of proposed actions - one of which looks (on the surface) very similar to the recommendation from the Law Commission:"
        },
        {
            "text": "You will find the rationale and reasons behind these proposed actions in the discovery report linked to this article. But essentially, the solutions stemmed from user-based research and what actual consumers said they needed or thought would be useful."
        },
        {
            "text": "A clear message was that, without a global understanding of all the fees included in the purchase price, a homebuyer can’t make an informed choice as to whether they can afford to purchase one of these retirement properties. Event fees are only a small part of that picture, which means that a database that only held information on event fees may only partially meet the needs of consumers."
        },
        {
            "text": "In the end, our discovery looked at all fees which affect leasehold retirees - these include service charges, ground rents and permission fees. Our work and these recommendations have implications for wider leasehold reform and the sales and marketing of these properties, but it all fits in with the current leasehold reform agenda and the future direction of travel for improving the home buying and selling process."
        },
        {
            "text": "The benefit of the discovery exercise, I feel, is that it’s built on and gone further than the findings of the Law Commission’s original database recommendation."
        },
        {
            "text": "The discovery report is now with Ministers and they will respond on whether to accept these recommendations in due course."
        }
    ]
}