{
    "url": "https://naturalengland.blog.gov.uk/2023/10/15/sunday-telegraph-article-about-natural-englands-position-on-housebuilding/",
    "title": "Sunday Telegraph article about Natural England’s position on housebuilding",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2023-10-15T13:23:21+01:00",
    "content": [
        {
            "text": "An article in the Telegraph (14 October) picks up on comments made by Natural England chair Tony Juniper on X (formally Twitter) regarding media reports about the role of housebuilding on scrubland. The article suggests Tony is criticising housebuilding policy set out by Labour at its recent party conference.  The Telegraph also includes criticism from some quarters that Tony is opposed to housebuilding."
        },
        {
            "text": "The suggestion that Natural England or its Chair are against house building is simply not true and the facts speak for themselves.  Out of the tens of thousands of planning applications that we are consulted on each year, 99% result in Natural England and developers finding ways for development to proceed while protecting Nature.  A mere 1% result in an objection. This not only refutes claims of being against house building but proves that as a society, we do not need to choose between much needed housing and protecting equally needed Nature.  We can and must build in a way that helps Nature thrive. As such, when objections are raised, our experts are always available to developers to collaborate on solutions which work for both people and Nature."
        },
        {
            "text": "Natural England and its Chair put a great deal of thought, time and effort into advancing the aim of sustainable development, which is the process of integrating economic and environmental goals. This is a Government priority and in the statutes that set out the purpose of Natural England. With multiple targets to meet for new housing, Nature recovery, climate change and for public health, Natural England is clear that the way to seek good outcomes is to find ways to integrate these goals, rather to have a starting point where we choose which one is most important than the others."
        },
        {
            "text": "As the country’s expert Nature recovery body, it is Natural England’s role to provide scientific advice to the Government, local authorities, and developers so they can design and build sustainable communities without harming Nature. It is not our job to say whether it is more important than other priorities. Natural England’s role in the planning system - as defined by Parliament - is to ensure that the potential environmental impacts of any proposal are taken into account by the relevant decision-making body. That body will weigh up our advice alongside other factors in reaching its decision. This advisory role is in line with part of our statutory purpose to contribute to sustainable development."
        },
        {
            "text": "Comments by Tony Juniper referenced in the piece about scrubland are taken out of context and misinterpreted.  We wholeheartedly agree that there is a significant amount of land suitable for housing, some of which can be described as ‘scrubby’. However, as Tony explained, scrub land itself is a distinctive habitat home to an abundance of wildlife which must be protected if we are to achieve our legally binding targets for Nature recovery. We also fully agree that the greenbelt can sometimes be a logical place to build, especially where there is low ecological or agricultural value. In fact, combining house building with Nature recovery offers huge opportunities for increasing the environmental value of greenbelt, while creating great places for people to live. To achieve this integrated approach, we have new processes to enable this, such as the Local Nature Recovery Strategies that were recently adopted under the 2021 Environment Act."
        },
        {
            "text": "In response, Natural England chair Tony Juniper added:"
        },
        {
            "text": "Further evidence that Nature recovery and housebuilding is entirely possible, is provided by the results we are seeing on the ground through the Natural England administered Nutrient Mitigation Scheme. Rather than blocking new homes, since July 2022, Natural England has worked in partnership to provide enough mitigation against further pollution in rivers to enable the building of 50,000 new homes, with more to come. This means local authorities and developers are bringing forward the housing they consider right for their area, while protecting fragile rivers, beautiful lakes, estuaries and wildlife from any further harm resulting from nutrient pollution."
        },
        {
            "text": "Concerted action is needed across every part of society – the public, business, farmers, government at a national and local level, and homebuilders – to reverse the decline in Nature and support clean and healthy rivers.  We will continue to play our role in achieving this."
        }
    ]
}