{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/01/30/a-short-guide-to-unit-pricing/",
    "title": "A short guide to unit pricing",
    "authors": [
        "Debbie Kitcher-Jones"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2024-01-30T11:00:06+00:00",
    "content": [
        {
            "text": "What kind of shopper are you? Do you buy exactly the same things when you shop? Or maybe you’re happy with whatever’s on offer? "
        },
        {
            "text": "However you like to shop, we all know there’s pressure on household budgets right now. People are really aware of the cost of living, and we’re all looking for ways to save money.  "
        },
        {
            "text": "Unit pricing can be a good way to check you are getting value for money at the supermarket. We’ve put together this short guide to help you understand what unit pricing is, and how it can help you make smart choices.  "
        },
        {
            "text": "You won’t become a millionaire overnight, of course. But over time, these little savings can add up, so it’s worth thinking about. We’ve also published some research into this if you’d like to know more."
        },
        {
            "heading": 2,
            "text": "What is unit pricing and how can it help you? "
        },
        {
            "text": "Unit pricing is when the price of an item is provided using a standard measure. This might be by: "
        },
        {
            "heading": 2,
            "text": "Where can I find unit prices? "
        },
        {
            "text": "You can find unit prices on the shelf label in store and online. They’re usually displayed next to or below the selling price of the item. The unit price may be in smaller print, and so you may need to look harder if there is a loyalty or promotional offer happening. "
        },
        {
            "text": "Here’s how a unit price might be displayed on a shelf label: "
        },
        {
            "text": "Here’s how a unit price might be displayed online: "
        },
        {
            "heading": 2,
            "text": "How unit pricing helps you spot the best value for money "
        },
        {
            "text": "There are a number of common assumptions out there about how to get the best value for money. Our analysis found the unit prices of some products compared to others can be surprising. "
        },
        {
            "text": "You should know that: "
        },
        {
            "text": "So check the unit price on the label before you buy. "
        },
        {
            "text": "Here’s an example that shows that items on a promotional offer aren’t necessarily the best value for money: "
        },
        {
            "heading": 2,
            "text": "Beware! Unit prices can change, so they’re worth checking  "
        },
        {
            "text": "It’s always worth checking the unit price of items when shopping, whether you're doing so online or in a store. We know that some shoppers have favourite items that they always buy, and you might be one of these people. But do check the unit price, because they: "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "To learn more about unit pricing, read our latest report and related consumer research. "
        }
    ]
}