{
    "url": "https://dluhcmedia.blog.gov.uk/2024/01/30/coverage-of-new-social-housing-reforms/",
    "title": "Coverage of new social housing reforms",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-01-30T11:43:54+00:00",
    "content": [
        {
            "text": "There is significant reporting on the announcement of new social housing reforms to make the system fairer and not available to those who abuse it."
        },
        {
            "text": "The measures proposed in the new DLUHC consultation could ban those who blight communities and repeatedly make their neighbours’ lives hell through anti-social behaviour or evict them through a ‘three strikes and you’re out’ policy."
        },
        {
            "text": "The proposals also prioritise households who have a close connection to the UK and their local area."
        },
        {
            "text": "The Telegraph, Mail, the Evening Standard, PA and ITV have all picked up on the announcement, with the Telegraph and Mail pieces focusing on the plans to ban anti-social tenants from applying for council housing and evict them for persistent offending. Meanwhile the ITV, PA and Evening Standard pieces lead on people with “close connections” to the UK and their local area being favoured for social housing."
        },
        {
            "text": "Alongside a press notice, the Housing Minister Lee Rowley appeared on today’s morning broadcast round. The Minister spoke to GB News, Times Radio, Sky, Radio 4’s Today programme, ITV’s Good Morning Britain, ITN and Bauer. He was asked about the department’s social housing reforms announcement, amongst the other news issues of the day."
        },
        {
            "text": "Housing Minister Lee Rowley said:    "
        },
        {
            "text": "The Government is seeking views from the public, councils, social housing tenants and providers and wants to bring forward the reforms as soon as possible. The consultation will run until 26 March and can be accessed via an online survey."
        }
    ]
}