{
    "url": "https://dataingovernment.blog.gov.uk/2024/01/30/getting-the-data-fundamentals-right/",
    "title": "Getting the data fundamentals right at the Ministry of Justice",
    "authors": [
        "Sarah Blake – Deputy Director, Ministry of Justice"
    ],
    "categories": [
        "Data Strategy"
    ],
    "pub_date": "2024-01-30T13:20:31+00:00",
    "content": [
        {
            "text": "The Ministry of Justice (MoJ) launched its Data Strategy in August 2022 and since then we’ve been making progress against the goals we set out. We’re also looking to the future - planning our roadmap for the next three years to deliver critical data improvement work and understanding how we will monitor and measure our progress."
        },
        {
            "text": "In this post we’ll look at our work in the MoJ, and in the next blog we’ll share plans for data improvement in the wider criminal justice system."
        },
        {
            "heading": 2,
            "text": "Better data and skills to enable better decision-making"
        },
        {
            "text": "Data underpins our work in delivering justice outcomes. It helps us measure the impact of policy interventions, gives us operational insight into prisons and probation, and deliver better services for our users – along with so much more. Yet too often, our data is fragmented, hard to share and not exploited to its fullest extent. "
        },
        {
            "text": "The Data Improvement team is focused on improving the quality of data, access to data and the data skills of staff, so that MoJ and the wider criminal justice system will make better decisions based on data and improve the outcomes for the millions of people that rely on the justice system. "
        },
        {
            "text": "We are creating the foundations for our colleagues – in data science, data linking, analysis, operations and more – to be able to deliver the data-driven insight the MoJ relies on. "
        },
        {
            "heading": 2,
            "text": "Our three-year strategy "
        },
        {
            "text": "Our roadmap outlines our data improvement strategy for the next three years. As with any roadmap, we have most confidence about the activity that’s coming up in the near future, and our work in the next few months will inform our work over the coming years. "
        },
        {
            "heading": 3,
            "text": "Phase 1 – Prototyping"
        },
        {
            "text": "Following on from our discovery work, we’ve been developing prototypes of processes and tools to improve data quality, access to data and data skills. For the next few months, we’ll continue to test these solutions with users and iterate them. We will:"
        },
        {
            "heading": 3,
            "text": "Phase 2 – Learning by doing"
        },
        {
            "text": "Next, we need to build up our improvement toolkit, by testing our ideas with more partners. From the middle of 2024, we’ll draw together our different prototypes and strands of work on exemplar end-to-end services or datasets. We will: "
        },
        {
            "heading": 3,
            "text": "Phase 3 – Scaling by empowering others"
        },
        {
            "text": "Once we have confidence in our approach and our skills, we can support other teams to lead within their own area.  We can enable them to use their subject matter expertise and our processes and tools, alongside our advisory and consultancy support, to solve problems for themselves. We expect this phase to start in mid-2025."
        },
        {
            "heading": 2,
            "text": "Talk to us"
        },
        {
            "text": "Getting the fundamentals right in data is an important topic and there are growing number of government teams working on these complex issues. If you’re looking into any of these issues or solutions, please get in touch so we can continue to collaborate across the criminal justice system and public sector, and share lessons learned. "
        },
        {
            "text": "To deliver this ambitious programme, we’ll need passionate data professionals to join our growing team. If you’re interested in working with us to solve some knotty problems, keep an eye on Civil Service Jobs or email us for an informal chat."
        }
    ]
}