{
    "url": "https://mojdigital.blog.gov.uk/2024/01/30/hmp-highpoint-the-circular-economy-of-it-disposal/",
    "title": "HMP Highpoint - The Circular Economy of IT Disposal",
    "authors": [
        "Karen Gedge"
    ],
    "categories": [
        "collaboration",
        "digital workshop",
        "Our services",
        "partnership",
        "sustainable practices",
        "transferable skills"
    ],
    "pub_date": "2024-01-30T11:34:34+01:00",
    "content": [
        {
            "text": "I was recently fortunate enough to visit HMP Highpoint to see a fully operational ‘Prison Industry’ digital workshop, where old or end-of-life printers are taken to be dismantled and recycled."
        },
        {
            "text": "HMP Highpoint is a category C training and resettlement prison, housing a combined capacity of 1310 prisoners, split 943 (South) and 367 (North) with an expansion of ~700 planned for January 2027.  The prison industry in focus is operated on the Southern element of the establishment.  Daily life focuses heavily on rehabilitation and many of the life skills that will be needed on release. "
        },
        {
            "text": "Inside the Digital Workshop"
        },
        {
            "text": "The Digital Workshop is a partnership agreement between DSA Connect, Xerox and HMP Highpoint"
        },
        {
            "text": "DSA Connect provides the necessary technical skills and accreditations to prisoners to perform the dismantling and separation of waste streams under the Waste Electrical and Electronic Equipment regulations."
        },
        {
            "text": "The target for the workshop is to process and dismantle up to 600 devices per month. There are currently 12 men employed, with a capacity for 16.  There is a good supply of machines in stock to be disassembled, with many more waiting at Xerox distribution centre in Northamptonshire. "
        },
        {
            "text": "There is always a list of applicants who would like to come and work in the printer workshop. A job here means prisoners must meet a set of criteria such as good behaviour, positive engagement with prison life, etc and then they have to be successful in the application process, just as if they were having to apply for a job outside prison. "
        },
        {
            "text": "Why HMP Highpoint? "
        },
        {
            "text": "It’s the ideal location as it is approximately a 90-minute drive from the distribution centre, thereby reducing carbon emissions, freight movements, and so on. In turn, it’s also a great way of supporting the environment, both right now and in the future, and will deliver cold, hard cash savings which will no doubt be quantified going forward. "
        },
        {
            "text": "Much research was carried out in the early stages to find a suitable location for the workshop within the prison. Space and lighting were key, as was access to outside so the vans bringing in the devices could get them into the workshop. The space is now filled with everything that is needed to reduce a printer down to its last tiny metal nut and bolt, significantly reducing the volume of plastic (in particular!) ending up in landfill!"
        },
        {
            "text": "The workflow of a device through the workshop comprises of the following:"
        },
        {
            "text": "In other words, it looks something like this:"
        },
        {
            "text": " "
        },
        {
            "text": "It’s a smooth operation with everyone making their own contribution to what could be a massive opportunity with its potential to evolve and expand way beyond just printers."
        },
        {
            "text": "The work done here is prisoner outcome-focused"
        },
        {
            "text": "Whilst each individual has their own ‘back story’, this work is all about moving forward to become a good citizen. It offers individuals a chance to earn accreditations and develop transferable skills for post-prison employment, fostering meaningful work and a pathway to employment. The environment also facilitates the acquisition of softer skills, such as interpersonal interaction which is equally available across the other workshops on site. The pride and dedication observed among both the workshop workers and staff contribute to a well-coordinated and efficient operation, despite its relatively short existence."
        },
        {
            "text": "Winning prisoners’ hearts and minds to get the message across that they are making a positive difference to the wider world can be a little more challenging however this work is supported by weekly facts and figures displayed on a big screen in the workshop. It serves as a reminder of just how much they are doing and offers real-time insight into how they are closing the loop on waste. "
        },
        {
            "text": "Reducing the carbon footprint with sustainable practices "
        },
        {
            "text": "Xerox has committed to ensure all end-of-life equipment from their UK customer base (both Corporate and Government clients) will be routed to HMP Highpoint as opposed to being shipped to mainland Europe for disposal as was previously the case. "
        },
        {
            "text": "When broken down, the target is to recycle 40% of fire retardant plastic (the most tricky to do because it has to be incinerated). Overall 66% of plastic is recycled as a result of the work these men carry out. Importantly, only 0.02% of the original equipment (by weight) that comes in is categorised as ‘waste’ that may end up in landfill."
        },
        {
            "text": " "
        },
        {
            "text": "This initiative would not have been possible without the commitment and dedication of Harry Benham, Chairman of DSA Connect (pictured above), Steve O’Neill and Alex Taylor, Client Directors, Xerox, Warren Higgs, AUM Industries at HMP Highpoint and Steve Phillips, Head of Reducing Reoffending at HMP Highpoint. They have been ably supported by an onsite team working tirelessly to gain customer and prisoner buy-in and actually make this initiative in an exceptionally busy, challenging category C environment work!"
        },
        {
            "text": "It is such a wonderful example of what can be achieved with a vision and people behind it to drive it through to the success this work already is proving to be."
        },
        {
            "text": "I could wax lyrical on this topic for far longer but I am conscious that I have only a finite amount of space for writing and readers will only have a finite amount of time for reading so I will close now!  "
        },
        {
            "text": "However, should you require any further information about this great work, I will be happy to facilitate your request so please contact me at Karen.Gedge@justice.gov.uk"
        }
    ]
}