{
    "url": "https://openpolicy.blog.gov.uk/2024/01/30/launching-the-healthy-system-indicators-a-new-way-of-relational-working-across-local-and-national-systems/",
    "title": "Launching the Healthy System Indicators: A new way of relational working across local and national systems",
    "authors": [
        "alexfleming",
        "vanessalefton"
    ],
    "categories": [
        "Policy Lab",
        "Skills, tools and techniques"
    ],
    "pub_date": "2024-01-30T10:53:58+01:00",
    "content": [
        {
            "text": "How do we know if we are healthy? What do we look out for? We have a regular temperature, we know our energy levels, our body doesn't ache. These are indicators of good health.  "
        },
        {
            "text": "Much like the body, we can understand the environment within which a policy or services is being delivered as a system and we can assess how well that system is functioning. "
        },
        {
            "text": "In our recent project with the Changing Futures team in Department for Levelling Up, Housing and Communities (DLUHC), we created and tested Healthy System Indicators. We learnt that the Indicators can help policymakers and stakeholders assess a policy/ delivery system together, and diagnose where interventions can be made to ensure the system can improve, ultimately resulting in better outcomes for citizens. "
        },
        {
            "text": "This blog is the third in a four-part series sharing what we learnt about systems change in policymaking. You can read our first and second blogs here.  "
        },
        {
            "heading": 3,
            "text": "A case study: Working towards systems health in the multiple disadvantage policy area "
        },
        {
            "text": "The Changing Futures project focused on services delivering support for people facing multiple disadvantage. Our challenge question was: “How can we ensure that central government enables flexible and person-centred frontline delivery models on an ongoing basis for people facing multiple disadvantage?”  "
        },
        {
            "text": "We worked with 126 people, including people with lived experience of multiple disadvantage, sector experts, and local and national policymakers, to understand multiple disadvantage systems.  "
        },
        {
            "text": "The conception and development of the Indicators is deeply rooted in a sense of place. They were designed by people with lived experience, policymakers and sector experts from across England, living and working at multiple levels and across regional systems.  "
        },
        {
            "heading": 3,
            "text": "Healthy System Indicators - a tool for improving systems "
        },
        {
            "text": "The Healthy Systems Indicators provide a potential framework for strategy and present a different way of delivering policy at a national and local level. Many policy professionals and stakeholders increasingly see their domains as complex policy systems, where single interventions may have limited or even unintended effects. The Indicators articulate a shared understanding and common language of system health. They provide a novel and innovative way of aiding policy development and delivery, not because they materialise new policy ideas, but because they interrogate – and ultimately could improve - the very structures by which policy relates to delivery and citizens. "
        },
        {
            "text": "The indicators are intended to be used both locally and nationally. They aim to unify actors across geographical and policy silos, build stronger relationships, and create higher levels of trust and flexibility in service delivery. We think that creating healthier systems will lead to better service delivery, which ultimately will lead to better outcomes for people facing challenges nested in complex policy systems, such as multiple disadvantage.   "
        },
        {
            "text": "Whilst the Indicators were developed for our work on multiple disadvantage, our hypothesis is that they are transferable across different policy areas. From our vantage point as a cross-government Lab, we hear similar systemic challenges faced by different teams in different departments. We think that the Indicators provide a practical response to some of these systemic challenges which often include lack of join up, strong silos, short term thinking and top heavy accountability metrics. The next stage is to adapt them to other policy areas, and test them in local and national policy areas.  "
        },
        {
            "text": "Test, iterate, test, iterate. This is a beta product. Please feel free to adapt and iterate the product – and let us know how you get on. "
        },
        {
            "text": "Resources  "
        },
        {
            "text": "We have developed a freely available PDF guide which introduces you to the Healthy System indicators, explains when, why and how to use the indicators and provides guidance on first steps to take. "
        },
        {
            "text": "We are interested in your thoughts and reflections on the Indicators and we are keen to identify further projects to test this way of working. If you are interested in using the Healthy System Indicators and would like some help to get started, Policy Lab is able to help advise and run a ‘Half Day Workshop in a Box’ to diagnose your system, identify system stakeholders and use the Healthy System Indicators to improve the health of your system. Please get in touch if you would like to work with us. "
        },
        {
            "text": "Note: The Healthy Systems Indicators are still at the prototyping stage and do not represent government policy.  "
        },
        {
            "text": "With thanks to: "
        },
        {
            "text": "The Changing Futures team "
        },
        {
            "text": "Nigel Ball, former Director of GO Lab, Blavatnik School of Government "
        }
    ]
}