{
    "url": "https://naturalengland.blog.gov.uk/2024/01/30/losses-of-tagged-hen-harriers-higher-than-normal/",
    "title": "Losses of tagged hen harriers higher than normal",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Hen Harriers",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2024-01-30T11:38:29+00:00",
    "content": [
        {
            "text": "Hen harriers are rare birds of prey that breed in the uplands of northern England. While we have welcomed increases in breeding numbers in recent years, up to a high of 54 nests in 2023, their recovery remains threatened by ongoing illegal persecution."
        },
        {
            "text": "As part of our work under the Hen Harrier Action Plan, and along with our partners, we monitor hen harriers using satellite tags to track where they go and the causes of deaths, which can be due to natural predation, starvation, and disease, as well as illegal killing. We periodically share information about the status of tagged birds monitored by Natural England on the Hen Harrier Tracking Programme Update page, which now includes the status of birds up to December 2023."
        },
        {
            "text": "Unfortunately, this latest update shows that a high proportion of last summer’s nestlings have been lost, in comparison to other recent years. Seventeen of the 141 chicks fledged last year were tagged by Natural England, but only six were still being tracked 150 days after tagging. This is around 35% of birds still alive and being tracked, lower than other recent years in which we have seen 50%–70% still being tracked 150 days after tagging. We are concerned about this apparent increase in mortality, and are, as always, working with the police who investigate any possible illegal persecution."
        },
        {
            "text": "Why tags stop transmitting, and what happens when they do "
        },
        {
            "text": "Satellite tags on hen harriers are powered by small solar panels. If a bird dies and the panel is no longer exposed to light, tags lose power, and transmissions stop. While birds are alive, tags generally transmit regular accurate locations, though they may miss transmissions due to low daylight, or provide low accuracy locations due to poor satellite signal. Tags can spontaneously fail due to malfunction, although this is rare, and they will all eventually reach the end of their life and stop transmitting."
        },
        {
            "text": "Natural mortality is expected to be high for young hen harriers, especially during their first winter. However, when a tag stops transmitting, we always consider the possibility that the bird could have been illegally killed. We inform the police and, depending on their assessment of the evidence, either the police or NE fieldworkers will attempt to find the bird and retrieve the tag. If a dead bird is found, it will be sent to a laboratory for post-mortem, and the police informed of any evidence of criminality. It is the role of the police and Crown Prosecution Service to investigate and prosecute wildlife crime including hen harrier persecution, and the role of NE to provide information, assistance and support."
        },
        {
            "text": "There are ongoing police investigations into the deaths of two birds found dead in Cumbria in 2023 (brood managed birds R2-F2-20 and R3-F1-22), and we will be able to report on these when the investigations are concluded."
        },
        {
            "text": "If the tag is never found, the bird will be marked on our spreadsheet as ‘missing fate unknown’. These ‘missing’ birds may be birds that have died naturally and could not be found, perhaps due to low accuracy final transmissions or another technical reason – or they could be alive, but with a tag that is no longer transmitting. However, it’s also the case that birds that are illegally killed are very unlikely to be found, as people who kill hen harriers illegally are likely to dispose of the evidence. Of the birds tagged in 2023, and since lost, none have been found."
        },
        {
            "text": "Heightened concerns about illegal persecution"
        },
        {
            "text": "We cannot know for sure whether any individual ‘missing’ bird died naturally, was illegally killed, or if the tag failed. We expect a high proportion of young birds to die due to natural mortality, and the more birds that are tagged, the more individual losses we would naturally expect to see, perhaps particularly in the stormy weather that we saw in autumn 2023. However, the high numbers of birds going missing, and not found despite intensive searches, heightens concerns about illegal persecution."
        },
        {
            "text": "Natural England will continue to pass all relevant information to the police to ensure they are able to investigate losses of tagged birds where illegal killing is suspected. We will also continue our work on the ground to monitor birds and gather information about causes of deaths where persecution is not suspected, and we value our continued good working relationships with landowners who allow our fieldworkers access to carry out monitoring work."
        },
        {
            "text": "Natural England assists with the tagging and monitoring of hen harriers reared in captivity under the Brood Management Trial, and these captive-reared birds are included on the spreadsheet. The Brood Management Trial is a partnership between the Moorland Association, the International Centre for Birds of Prey, Natural England, the Game and Wildlife Conservation Trust and the Hawk and Owl Trust. The increased numbers of ‘missing’ birds, in comparison with recent years, applies to both wild and brood managed birds, and we are disappointed to have lost five of the nine brood managed birds tagged in 2023. The survival rates of brood managed birds, and hen harriers generally, will be considered under the evaluation of the brood management trial due in 2024."
        },
        {
            "text": "Natural England remains committed to working with our partners on hen harrier recovery, with our resources directed to monitoring and tracking of the northern population, support for investigation of suspected persecution incidents, and the Hen Harrier Southern Reintroduction. While we welcome the increases in breeding numbers and chicks fledged seen in recent years, we also need good survival rates of adults for hen harrier populations to recover, and we are disappointed to see the high losses this winter. Any illegal persecution detracts from the strong efforts made by all partners to support the as-yet fragile recovery of these special birds."
        }
    ]
}