{
    "url": "https://environmentagency.blog.gov.uk/2024/01/30/the-coast-is-clear-strengthening-shoreline-management-planning/",
    "title": "The coast is clear: strengthening shoreline management planning",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Flood",
        "Flood Planning"
    ],
    "pub_date": "2024-01-30T11:31:04+00:00",
    "content": [
        {
            "text": "Article written by Julie Foley, our Director of Flood Risk Strategy and National Adaptation, Environment Agency"
        },
        {
            "text": "Our treasured coast is a dynamic and exciting place for all those that live, work and play there. It’s a complex environment and how it is managed can have lasting impacts spanning hundreds of years."
        },
        {
            "text": "In England, 1.9 million homes are currently at risk of coastal flooding and erosion. We also have some of the fastest eroding coastlines in Europe with hundreds of properties currently at risk of coastal erosion. In all future climate scenarios, we’ll experience a continued rise in sea level well into the next century, so it is vital that we help policy makers and coastal practitioners to plan and adapt to a changing climate."
        },
        {
            "text": "The good news is we have a plan! Indeed, we have 20 of them spanning the 6,000 kilometres of open coast we have in England. Known as Shoreline Management Plans – SMPs - they are not just any plans. They are world-leading in their strategic approach to managing the combined hazards of erosion and flooding in coastal areas. No other country has such comprehensive plans for coastal adaptation looking forward not just 20 or 50 years, but over 100 years and beyond."
        },
        {
            "text": "What makes SMPs unique is the way in which they set out a range of management approaches for our coastline, setting out a pathway for action. This can include seeking to keep the coastline more or less where it is by maintaining or upgrading sea defences. It can involve working with nature to realign the shoreline, through the creation of inter-tidal habitat, whilst still protecting communities as much as we can. And in a specific number of places, it may involve letting nature take its course where it may not be technically feasible to provide protection over the longer term in the face of a changing climate. In such cases, we recognise this will require public bodies to be proactive in their engagement with communities and to actively empower local people to jointly develop options for coastal transition."
        },
        {
            "text": "In the last few years, the Environment Agency has been working with coastal groups to refresh SMPs and to ensure they are underpinned by good evidence, local leadership and strong governance. A key priority has been to strengthen their influence on steering local planning decisions and development policies so we can avoid unsafe new development happening in areas at high risk of coastal flooding and erosion."
        },
        {
            "text": "Following all this work, we don’t want SMPs to just sit on the shelf. So we have invested in a new map-based digital tool to make them easier to access, understand and use for coastal practitioners and the public alike. The new SMP Explorer will enable coastal practitioners and local planners to find the information they need more easily whilst improving the Environment Agency’s ability to monitor the risks of flooding and erosion around England’s coasts throughout this century."
        },
        {
            "text": "We will be keeping SMP Explorer up to date with the best available evidence and information starting with the new National Coastal Erosion Risk Map. Using ten years of coastal monitoring data, the latest climate change evidence and coastal geomorphology information, we are updating our predictions for properties and infrastructure at coastal erosion risk through this century. When the Environment Agency publishes the updated National Coastal Erosion Risk Map later in 2024, we will also upload it on to SMP Explorer."
        },
        {
            "text": "Investments in coastal projects account for approximately £1.3 billion of our £5.2 billion flood and coastal investment programme for 2021-2027. These projects aim to better protect over 100,000 properties as well as critical infrastructure on our coastline. The refreshed SMPs will be well placed to inform the next generation of projects for coastal protection, as well as habitat compensation and restoration. In the coming years we want to strengthen the role of SMPs in informing the coastal investment choices of both the Environment Agency and coastal authorities."
        },
        {
            "text": "Alongside, we also know we need to keep innovating. And that is why as part of the government funded flood and coastal innovation programme, the Environment Agency is currently running the £36 million Coastal Transition Accelerator Programme. Working in partnership with coastal authorities in East Riding of Yorkshire, North Norfolk and Dorset and Cornwall, we are exploring innovative approaches to adapting to the effects of coastal erosion."
        },
        {
            "text": "So the coast is clear for ensuring that SMPs are central to translating the ambitions of the National Flood and Coastal Erosion Risk Management Strategy into action at the coast. In the coming years the Environment Agency is committed to working hand in hand with Coastal Groups and other local partners to ensure SMPs remain fit for the future."
        }
    ]
}