{
    "url": "https://defrafarming.blog.gov.uk/2024/01/30/the-current-offer-for-horticultural-growers-and-farmers/",
    "title": "The current offer for horticultural growers and farmers ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-30T10:43:11+00:00",
    "content": [
        {
            "text": "The horticultural sector is a vital part of the UK economy. It contributed £4.3 billion in 2022. Ornamental growers make a significant contribution to promoting wellbeing and contribute £1.5 billion to the economy.  "
        },
        {
            "text": "Growers nourish the nation. Every year, they produce more than 3 million tonnes of over 300 different fruits and vegetables."
        },
        {
            "text": "Many horticulture growers and farmers are already benefiting from our schemes and grants, helping us to meet our commitment to produce at least 60% of the food we consume in the UK as they take care of the environment.  "
        },
        {
            "text": "The horticulture industry in England is diverse. As such, we have a range of different offers available for farmers and growers. "
        },
        {
            "text": "Whether you grow carrots or strawberries, daffodils or apples there is support you can access to help increase your productivity, improve the environment and innovate.  "
        },
        {
            "text": "In this post, we’ll summarise the schemes and grants horticultural famers and growers can access now. It follows the post we published yesterday which looked at the new environmental land management actions for the sector."
        },
        {
            "heading": 2,
            "text": "A recap "
        },
        {
            "text": "This year will see the biggest upgrade to farming schemes since the start of the agricultural transition. We're increasing payment rates by an average of 10% for Sustainable Farming Incentive and Countryside Stewardship agreements.  "
        },
        {
            "text": "We will make around 50 new actions available this year, including actions to support uptake of precision farming. This will enable horticulture farmers to reduce their use of costly pesticides or fertilisers, as well as improve yields, productivity, air and water quality, and benefit biodiversity and soil health.  "
        },
        {
            "text": "We go into more detail about the support available to the sector through Countryside Stewardship and SFI in this post.  "
        },
        {
            "text": "By offering payments which support agricultural technology, such as for robotics, automation and solar technologies, we are helping farmers and growers adopt new technology or practices, so they can grow more, sell more and have more resilient businesses.  "
        },
        {
            "text": "Not only will there be more choice, but the way you access the offer will improve. From summer, there will be a streamlined single application service to help eligible farmers and growers apply for Sustainable Farming Incentive and Countryside Stewardship Mid Tier actions. It will replace separate application windows and processes.  "
        },
        {
            "text": "Farmers and growers can also sign up as a member to access the full complement of resources from The Institute for Agriculture and Horticulture (TIAH). TIAH, which is part-funded by Defra, will play a pivotal role in creating a highly skilled, technically proficient workforce.  "
        },
        {
            "text": "Our extended offer builds on what’s already there and works well for businesses, food production and the natural environment.  "
        },
        {
            "text": "The update to the Agricultural Transition plan on GOV.UK sets out further details of our progress and plans.  "
        },
        {
            "heading": 2,
            "text": "Environmental land management schemes  "
        },
        {
            "text": "Farmers and growers producing field horticulture crops and permanent horticulture crops are eligible for a range of funding under our environmental land management schemes."
        },
        {
            "text": "These schemes pay for sustainable farming practices and help us to achieve our 25 Year Environment Plan ambitions and carbon net zero goals."
        },
        {
            "text": "Farmers and growers can be in more than one scheme, as long as the actions they undertake are compatible and we’re not paying for the same actions twice.  "
        },
        {
            "text": "Countryside Stewardship provides financial incentives for farmers, foresters and land managers to look after and improve the environment. Farmers and growers in the horticulture sector can be paid to deliver a range of actions including establishing flower mixes for wildlife, managing hedgerows, or creating and maintaining traditional orchards.  "
        },
        {
            "text": "The Sustainable Farming Incentive rewards farmers and growers for farming practices that help produce food sustainably and protect the environment.  "
        },
        {
            "text": "Farmers and growers can pick and choose from a range of actions on soils, integrated pest management, nutrient management and for farmland wildlife to create an offer that works for their business."
        },
        {
            "text": " The actions available now are summarised in the following table. Even more actions will be available in the summer. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": " Farming Investment Fund    "
        },
        {
            "text": "The Farming Investment Fund offers grants to improve productivity and bring about environmental benefits. These are open to all types of horticultural business, across both edible and ornamental crops. "
        },
        {
            "text": "Open now:  "
        },
        {
            "text": "New rounds of the following funds and grants will open later in 2024: "
        },
        {
            "heading": 2,
            "text": " Farming Innovation Programme   "
        },
        {
            "text": "The Farming Innovation Programme is part of Defra’s investment in innovation, research and development. These funds can help horticulture farmers and growers to collaborate and explore ideas, check if an idea works in practice, develop a new product or service, and work on longer term innovations.  "
        },
        {
            "text": "These funds are open to horticultural businesses, across both edible and ornamental crops, as well as agri-tech businesses and research bodies. There are two funding competitions open for applications now:  "
        },
        {
            "heading": 2,
            "text": "Fruit & Vegetables Aid scheme  "
        },
        {
            "text": "Fruit and vegetable growers who are part of a Producer Organisation (PO) have also been able to access the EU-legacy Fruit & Vegetables Aid Scheme, which offers funding for actions that contribute to improved competitiveness, with particular focus on collaboration and productivity. "
        },
        {
            "text": "This has been funded by Defra’s Farming Programme since October 2020. Producer Organistations who take part have been awarded around £40 million per year in funding for a range of different measures, including those targeting improving product quality, along with environmental actions.  "
        },
        {
            "text": " At the No. 10 Farm to Fork Summit in May last year, the Prime Minister committed to replace the Fruit and Vegetables Aid Scheme  when it comes to an end after 2025. "
        },
        {
            "text": "Following this announcement, we have been working to gather feedback from the sector and are continuing to work with producer organisations, cooperative growers, independent growers, controlled environment horticulture and representative organisations to help inform our overall plans for designing the replacement.  "
        },
        {
            "heading": 2,
            "text": "Energy support for Controlled Environment Horticulture   "
        },
        {
            "text": " We are aware of the unique opportunities and challenges faced by the Controlled Environment Horticulture (CEH) sector. We are working to improve representation of this sector in Defra's Farming Innovation Programme and Farming Innovation Fund. For example, we are exploring expanding equipment lists to cover vertical farming and glasshouse growing equipment. "
        },
        {
            "text": "We are also working with other departments to increase representation of CEH in other department’s funding and support schemes."
        },
        {
            "text": " We worked with the Department for Energy Security and Net Zero to ensure the CEH sector is eligible to apply for the upcoming Phase 3 of the Industrial Energy Transformation Fund (IETF). This is a £185 million fund for businesses to cut their bills and carbon emissions by investing in energy efficient and low carbon technologies. "
        },
        {
            "text": "Two application windows will run in 2024, with the first opening in the spring. "
        },
        {
            "text": "As CEH is a newly eligible sector, we hope to hold a Q&A session with the IETF team soon. If you would like to be added to the invite list please email: defrahorticulture@defra.gov.uk "
        },
        {
            "heading": 2,
            "text": "Working with the horticulture sector "
        },
        {
            "text": "We want to create an offer that is workable for every farmer and farm type in England. With that in mind, we’ve worked hard to ensure that the opinions of growers are not only heard, but also shape our schemes and support for the sector.  "
        },
        {
            "text": "We are also supporting the sector beyond our schemes. In December, we launched a review to improve fairness in the fresh produce supply chain. "
        },
        {
            "text": "The Fresh Produce Supply Chain Review seeks the views of the industry on issues including the fairness of contracts between producers and purchasers in the sector, and how supply chain data can be used to support transparency in the negotiation process. "
        },
        {
            "text": "All stakeholders with a link to the fresh produce sector are invited to share their views before the review closes on 22 February.  "
        },
        {
            "text": "We also announced that in both 2023 and 2024, 45,000 visas will be available to support horticultural businesses. This will help to tackle labour shortages and rising input costs. "
        },
        {
            "heading": 2,
            "text": "Learn more at our webinars"
        },
        {
            "text": "At 11am on Wednesday 31 January, we’re hosting a webinar specifically about the Improving Farm Productivity grant for horticulture farmers. Register to attend. "
        },
        {
            "text": "At 2pm on Monday 12 February, you can learn more about our range of funding support on offer through our farming schemes. Register to attend.  In this webinar, we will explain what is available for horticulture farmers and growers across both the edible and ornamental sectors in the current offer. You’ll be able to put your questions to the team.  "
        }
    ]
}