{
    "url": "https://defradigital.blog.gov.uk/2017/01/02/undesigning-for-open-government-and-enterprise/",
    "title": "(Un)designing for open government and enterprise",
    "authors": [
        "Clare Moriarty, Permanent Secretary, Defra"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra services",
        "Open data"
    ],
    "pub_date": "2017-01-02T08:27:11+00:00",
    "content": [
        {
            "text": "At the Open Data Institute's annual Summit at the BFI Southbank in London in November, Defra's Permanent Secretary, Clare Moriarty, spoke about open ways of working, open culture and open data."
        },
        {
            "text": "This is what she had to say about the role data and openness are playing in delivering better outcomes across Defra group."
        },
        {
            "text": "MrMikeRose took this video, which we've transcribed below for your convenience"
        },
        {
            "text": "I’ve just got the one slide – I’m going to leave it up there; it means I can put this thing [slide contoller] down on the floor."
        },
        {
            "text": "I’m here as the second of the government speakers today, and I’m from Defra. Defra is a government department, but we also talk increasingly about the Defra group, and that’s a group of over 30 organisations, who in combination do all the central government functions in the areas of Environment, Food and Rural Affairs."
        },
        {
            "text": "What you can see on the slide is some of the things that we do across organisations like the Environment Agency, Natural England, the Forestry Commission, Rural Payments Agency, as well as the central Department."
        },
        {
            "text": "We are, in total, 22,000 people, and 80% of all the people in Defra group are delivering services directly to customers. Quite a lot of our customers deal with multiple organisations within the group, so if you’re a farmer, you’ll be dealing with the Rural Payments Agency, you may also be dealing with the Animal and Plant Health Agency, you may also be dealing with the Environment Agency – and we know that, for some of our customers, the experience of dealing with our multiple instances isn’t necessarily the best; it can feel a bit duplicative, and overlapped. So, one of the things we’ve been doing over the last year, is really trying to understand how we can improve that service for customers; how can we organise ourselves and our work better, to give them a better experience; by joining up, by standardising, by streamlining the processes."
        },
        {
            "text": "I was very much taken by the existence of the word design in the title of this session. In government, we like design: we like to plan; we like structure; we like order – personally, I’m a mathematician; I like patterns…so I like this stuff. So when we started thinking about how we could make ourselves better, we started with design principles – and we came up with five design principles, which are:"
        },
        {
            "text": "And I’ll come back to those, at the end."
        },
        {
            "text": "But one of the things that we found, when I was talking to my team abut what I might say today, was what came to mind were things that were substantially in the non-design end of the design spectrum. So I just want to tell you a couple of stories about those and then come back to the question of designing for open government."
        },
        {
            "text": "So, I’ll start with Defra’s 8000 datasets."
        },
        {
            "text": "Just after the last election in May 2015, Liz Truss, who was then the Environment Secretary, stood up in front of a group of people and said, “Defra is going to publish 8000 datasets by the end of June 2016”. Now, there was no particular magic to the 8000 number; it wasn’t something that was the product of lots and lots of very careful calculations by loads of civil servants; we didn’t have reams of explanation about what exactly a dataset was and wasn’t; it was just something that was put out there. In short, it wasn’t a particularly designed process that we went into. But it worked. What it did, was to galvanise teams across Defra to see what we could put out there in the way of data."
        },
        {
            "text": "People didn’t game the target – they didn’t try to see what was the smallest possible dataset they could put out so they could claim the maximum number of datasets in order to be able to say, ‘we’ve hit the 8000,’ – they looked for data that we currently held ourselves and which we could put out there for other people to use."
        },
        {
            "text": "And, in fact, we beat the target, so we published not just 8000 but over 10,000 datasets by the end of June; and we’ve gone on publishing, so if you go on data.gov.uk, you will find over 13,000 Defra datasets on that website, and some of them are massive, massive datasets."
        },
        {
            "text": "Because, even more importantly than just putting out the data, is the stuff that other people have been able to do with it."
        },
        {
            "text": "People have built digital tools and services. So things like the gaugemap API, which allows apps from the Red Cross, from Facebook, from all sorts of places to access Environment Agency data and use that to inform people about flood risk. And the work that John Murray’s done with LiDAR data; taking several layers of LiDAR data, putting it together to tell you things abut the heights of buildings, gutters, trees, of things which have got practical application, for example, in the insurance industry."
        },
        {
            "text": "So, our quite undesigned process is giving people space to innovate."
        },
        {
            "text": "And maybe that is a bit of design. If you go back to the Steve Jobs principle, that the first decision in design is actually what not to do; in a sense, we’ve got out of the space to allow other people to do things in it."
        },
        {
            "text": "Now, I think open government is about more than open data. Data doesn’t have a monopoly on ‘open’. But, for some reason, they seem to go together."
        },
        {
            "text": "So here’s my second story:"
        },
        {
            "text": "On Good Friday, I was sitting in the car with my family on the way to a ferry. The traffic was terrible. I thought we were going to miss the ferry. So, as a bit of a distraction activity, I started scanning Twitter."
        },
        {
            "text": "I found a blog about ’10 ways which policy can learn from product’, and I tweeted it on to my colleagues in opendefra to see how much of this stuff are we doing already. That prompted a lot of discussion, leading to an open document, which lots of people then contributed to, called #ifiwasthegaffer, about people telling me what they would do if they had my job. All sorts of things have followed on from that. I’ve had great conversations with my data team, through social media – occasionally I even get them to come in the room and talk to me, but we have more conversations on Twitter. We’ve got our own hashtags, #defraselfie – which I’ll come back to – and #defranauts. I’ve given explicit permission and trust to my data team to do things, and they have in return given me help, Lego, cake and egg timers."
        },
        {
            "text": "But, underlying this is a different way of working. It’s given me a window into a much more non-hierarchical way of working, which is relatively uncommon for government. A bit less structure, a bit less design, but more collaboration and more open culture. And that is something that, although it’s come quite substantially from the data team, who tend to be more up for this than other people, has rubbed off more generally on the whole of the Defra group. So, now as a group, we have unconferences, where we bring people together in a slightly less designed way, to explore issues of mutual interest."
        },
        {
            "text": "I’m just going to give a plug here to the #DefraDataFunction Unconference on 29 November. It is open – we have certainly some places for friends of Defra, so if you’re interested in that, tweet @opendefra and they will get back to you."
        },
        {
            "text": "The common factor in those two stories is not about conscious design for open government. But neither is it about chaos. I think it’s about creating the conditions where openness can happen. Not trying to create a rigid framework for something which by definition doesn’t want to go in a rigid framework."
        },
        {
            "text": "Maybe that’s the point about designing for open government. There’s an important place for plans and structure, but we also need space for fluidity, for curiosity, and willingness to try something new."
        },
        {
            "text": "So I’m just going to finish by going back to our Defra design principles: Act together; Make it simpler; Avoid duplication; Maximise impact; and Embrace data and digital."
        },
        {
            "text": "Now, the last one of those is obviously the one with the ‘data’ tag attached to it, but actually everything we do in the open data, open government space aligns with the design principles. When we’re collaborating, within and outside the Defra group, we’re ‘’acting together; when we’re communicating straightforwardly, we’re ‘making it simpler’. When we’re trying to break out of silos, we’re ‘avoiding duplication’; and when we’re creating space for others to innovate, that’s when we’re really ‘maximising impact’ – because the most valuable thing we can do is create a space where the maximum number of people can get involved in what’s really important, which is delivering outcomes."
        },
        {
            "text": "The outcomes that we want to deliver are about having a healthy environment, about having a world-leading food and farming industry, about having a thriving rural economy, and a nation better-protected against natural threats and hazards. And open data, open ways of working, and open culture are things that can really make that happen for us."
        },
        {
            "text": "I’m going to finish there, but there’s one thing that I need to crave your indulgence on – because I talked about #defraselfie, and my data team have challenged me to do a #defraselfie from the stage."
        },
        {
            "text": "So, I’m hoping ( – thankyou very much Martin – ) that with the aid of my trusty phone, I can produce a defraselfie, and it will be real."
        },
        {
            "text": "Thank you very much indeed."
        }
    ]
}