{
    "url": "https://planninginspectorate.blog.gov.uk/2022/01/26/a-week-in-the-life-of-a-planning-inspector/",
    "title": "A week in the life of a planning inspector",
    "authors": [
        "pinscomms"
    ],
    "categories": [
        "Recruitment"
    ],
    "pub_date": "2022-01-26T11:45:22+00:00",
    "content": [
        {
            "text": "The Planning Inspectorate is currently recruiting for Band 1 planning inspectors."
        },
        {
            "text": "Not all inspectors are town planners! We’re looking for accomplished professionals with enthusiasm, relevant skills and a commitment to public service to do an intellectually stimulating and challenging job, working for a highly regarded organisation. If that sounds appealing, check out a week in the life of an inspector below."
        },
        {
            "heading": 3,
            "text": "A week in the life"
        },
        {
            "text": "Is there such a thing as a typical week for a planning inspector? Probably not, given the range of their work and the flexibility around where and how it is completed. We have inspectors working from home in urban and rural areas, from Cornwall to Norfolk and from Hampshire to Northumberland. Some work full-time, some part-week and some part-year."
        },
        {
            "text": "Some days you may decide to start work early, or to work late, in order to fit in a bike ride, to meet a friend for coffee or to go to the gym during the day. If you have children, you may enjoy the school run or attending daytime events such as sports days or assemblies. If your partner is at home during the day, you may enjoy being able to spend more time with them. So long as you deliver your work to the required quality and timeliness standards, when and how you work is largely up to you. But you will always have the support and assistance of colleagues when you need it."
        },
        {
            "text": "In general terms, if you are a full-time Band 1 planning inspector, your day-to-day experience could be something like that set out below (part-time inspectors would follow a similar pattern but with fewer cases over fewer days). If you were conducting a public hearing your week would, instead, be taken up with preparing for and holding the event, followed by writing up your decision."
        },
        {
            "heading": 3,
            "text": "Day 1"
        },
        {
            "text": "Prepare for your site visits. Read all of the written evidence for each appeal. This is provided by the appellant, the local planning authority and by any interested local residents and/or groups. What are the main issues you will need to consider? What additional factors are important for the appellant, the council and any neighbours? What will you need to look at on site? Plan your route between the sites. Will you drive, use public transport, walk, or cycle?"
        },
        {
            "heading": 3,
            "text": "Day 2"
        },
        {
            "text": "Site visits. Travel to the sites to put the written evidence into context. You may be visiting somebody's back garden to consider proposals for an extension; walking up and down a high street to consider changes to a takeaway's opening hours; or looking around a village to consider a scheme for a new dwelling or two. Sometimes you will meet the appellant, their representative and/or someone from the local planning authority. Make sure you see everything you need to – and take careful notes of what you see!"
        },
        {
            "text": "Enjoy getting to see a different part of the country. Find somewhere decent to get lunch (if you haven't packed one) and to take a comfort break. If the weather looks bad, remember your waterproofs; you could be outside for a while."
        },
        {
            "heading": 3,
            "text": "Days 3–5"
        },
        {
            "text": "Decision-writing. With the benefit of your site visit notes, in addition to the evidence you have already reviewed, write your decisions. You may call your manager or another colleague with any queries or problems, or just to have a chat."
        },
        {
            "text": "Once completed, send your decisions to be despatched (or, while you are in training, to be reviewed). Complete any administration and catch up on professional and organisational updates."
        },
        {
            "heading": 3,
            "text": "Days 6–7"
        },
        {
            "text": "Take the days off! Turn off all of your IT kit, hide your smartphone and take a well-earned break, to be ready for next week."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about the planning inspector vacancies and apply on Civil Service Jobs."
        }
    ]
}