{
    "url": "https://healthcareleaders.blog.gov.uk/2022/01/26/annual-consultant-awards-a-new-name-and-a-new-scheme/",
    "title": "Annual Consultant Awards – a new name, and a new scheme",
    "authors": [
        "Professor Kevin Davies - Medical Director of the Advisory Committee on Clinical Impact Awards"
    ],
    "categories": [
        "Supporting NHS staff"
    ],
    "pub_date": "2022-01-26T15:33:01+00:00",
    "content": [
        {
            "text": "There has been a national scheme to reward and incentivise the highest-performing consultants in the NHS for as long as the institution itself has existed. And although the details of the reward scheme have changed greatly in that time (much like the NHS itself), at its heart remains a core principle: to recognise and champion excellence in the workforce."
        },
        {
            "text": "Since my appointment as Medical Director of the Advisory Committee on Clinical Excellence Awards (ACCEA) in 2020, I have been working closely with our Chair, Dr Stuart Dollow, and colleagues in the Department of Health and Social Care, to deliver the current 2021 ‘award round’, in which over 500 new awards were awarded."
        },
        {
            "text": "Importantly, we have also been working collaboratively to design a new, reformed reward scheme, which is due to launch in April 2022."
        },
        {
            "text": "The renamed ‘National Clinical Impact Awards’ will deliver a cost-effective way of incentivising hard-working senior doctors, leaders and role models at a time when the NHS workforce is under more pressure than ever. Following the reforms (and funding permitting), our aim is to grant around 600 awards in England each year."
        },
        {
            "text": "Our reforms build on the findings of stakeholder focus groups, academic research into the awards scoring processes (led by the University of Exeter), our learnings from recent award rounds, and a formal consultation process in late 2021."
        },
        {
            "text": "So why are we changing things?"
        },
        {
            "text": "Firstly, it’s clear from our feedback that many eligible doctors, dentists and academic GPs are either unaware of how the scheme works, or feel they have little chance of success, and do not therefore apply. This is particularly the case among younger consultants, many from the BAME community, and female doctors."
        },
        {
            "text": "These reforms aim to encourage applications from these previously under-represented groups to ensure that the scheme more accurately reflects the full diversity of the NHS’s consultant workforce. This includes building on the introduction in 2020 of a more flexible system of scorer allocation between regions to enhance diversity and introduce greater externality (much like the ‘external examiner’ model in a University)."
        },
        {
            "text": "Under the reformed scheme, there will be a single ‘non-stratified’ application process, meaning that any applicants new to the process will be as eligible for the highest-level award as a previous award holder. The awards will also no longer be pensionable, and they will be in effect for 5 years, at which point a consultant can apply again. Any consultant who has been in post for at least a year and who feels they are making a contribution at a national level can apply."
        },
        {
            "text": "We also know that many of those working less than full time (LTFT) make fantastic contributions to service delivery, education and research, and it is widely felt that the current scheme does not sufficiently recognise this section of the consultant workforce."
        },
        {
            "text": "LTFT consultants will be eligible for full awards (not paid pro rata, as is currently the case), and we will be introducing a new scoring domain to widen the net and make it easier for consultants to apply. This might consider relevant international activity, work to address healthcare inequalities, and patient-focused work on health literacy and improving health at a community level. Research, innovation and education are more important than ever to the NHS, and we will, of course, be retaining these assessment areas."
        },
        {
            "text": "Finally – what about the name?"
        },
        {
            "text": "We feel that from 2022, our explicit focus should be on the impact of consultants’ national work; ACCEA will now be called ACCIA – the Advisory Committee on Clinical Impact Awards. The awards themselves will be re-named ‘National Clinical Impact Awards’."
        },
        {
            "text": "Over the last two years – and indeed, throughout the NHS’s extraordinary 73-year history – NHS doctors have helped keep our country going through their compassion, skill, and innovation. These new awards will increase the reach and prestige of the scheme, while continuing to reward work that is making such a difference to the NHS, and for us all."
        },
        {
            "text": "Professor Kevin Davies, Medical Director of the Advisory Committee on Clinical Impact Awards"
        }
    ]
}