{
    "url": "https://despatch.blog.gov.uk/2022/01/26/changes-to-the-highway-code/",
    "title": "Changes to The Highway Code: how they affect driving tests",
    "authors": [
        "Mark Winn"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Learning to drive",
        "Learning to ride",
        "Motorcycle test",
        "Motorcycle trainers",
        "Ready to Pass?",
        "Resources for instructors",
        "Vocational trainers"
    ],
    "pub_date": "2022-01-26T14:33:01+00:00",
    "content": [
        {
            "text": "You may have heard or read about the new changes being made to The Highway Code. From 29 January 2022 new rules will be introduced to improve safety for people cycling, walking and riding horses."
        },
        {
            "text": "Most of what’s new places a greater responsibility on drivers to look out for people horse riding, cycling and walking. In total, 9 sections of the code are being updated, with 50 rules being added or updated – so you really need to know what’s new."
        },
        {
            "heading": 2,
            "text": "Reinforcing good behaviour"
        },
        {
            "text": "Most of the changes reinforce existing good driving behaviour and do not alter how we assess driving tests. However, some will result in a change in how we assess candidates."
        },
        {
            "text": "A new ‘hierarchy of road users’ will be added to the code. Those in charge of vehicles that can cause the greatest harm in the event of a collision will bear the greatest responsibility to take care and reduce the danger they pose to others. This principle applies most strongly to drivers of large goods and passenger vehicles, cars and motorcycles."
        },
        {
            "text": "Other road users, who may be vulnerable themselves, will have a responsibility to reduce danger to people walking. And of course, none of this detracts from the responsibility of ALL road users, including people walking, cycling and horse riding, to have regard for their own and other road users’ safety."
        },
        {
            "text": "The most notable change for candidates and trainers is; “At a junction you should give way to people crossing or waiting to cross a road into which or from you are turning”."
        },
        {
            "text": "People driving or riding a motorcycle will need to take this new requirement to give way to people crossing into account as they plan their approach to the junction. This includes being aware of:"
        },
        {
            "text": "If someone is waiting to cross, they’ll normally be standing at the edge of the pavement, actively looking in the direction of the traffic and the direction they intend to cross."
        },
        {
            "text": "People driving or riding a motorcycle need to be aware of the person crossing’s  actions and those of the other road users, so they can plan their approach safely and take the right action as they negotiate the junction."
        },
        {
            "heading": 2,
            "text": "Assessment on test"
        },
        {
            "text": "On a driving or riding test, failure to give way to someone who is clearly waiting to cross the road but is standing safely on the pavement would normally be assessed as a driving or riding fault. This is because the candidate would be deviating from the defined outcome. It’s clear though that our examiners will need to consider all factors, including:"
        },
        {
            "heading": 2,
            "text": "Serious or dangerous fault"
        },
        {
            "text": "We won’t be changing the assessment level of a serious or dangerous fault with the introduction of this new rule."
        },
        {
            "text": "If the learner driver or riders’ actions place a person crossing at risk, for example if they fail to give way to someone who is actually in the road, a serious fault would normally be recorded."
        },
        {
            "text": "But the actions of the person walking and other road users nearby will have a bearing on how our examiner assesses the action."
        },
        {
            "text": "They’ll consider things like:"
        },
        {
            "text": "As novice drivers, candidates are more likely to err on the side of caution and this will be considered."
        },
        {
            "heading": 2,
            "text": "Bedding in period"
        },
        {
            "text": "The new rules will influence the behaviour of all road users and it will take time for everyone, including people driving, riding motorcycles, people walking, cycling or riding a horse to adapt to the changes."
        },
        {
            "text": "Our examiners will be taking this into account, and I feel it’s important that all road users and driver trainers do the same, as some people may not be aware of the changes and may react differently to the way novice drivers might be expecting."
        },
        {
            "text": "Read our news story for changes to The Highway Code in full."
        },
        {
            "heading": 2,
            "text": "Staying up to date"
        },
        {
            "text": "The Highway Code is essential reading for everyone. It’s updated regularly, so it’s important that everyone reads it - not just learner drivers.  Many of the rules in the code are legal requirements, and if you disobey these rules, you’re committing a criminal offence."
        },
        {
            "text": "If you do not follow the other rules in the code, it can be used in evidence in court proceedings to establish liability."
        },
        {
            "text": "The full version of The Highway Code is available, free of charge, on GOV.UK. This will be updated on 29 January 2022."
        },
        {
            "text": "You’ll be able to buy an updated version of The Highway Code book online and at most high street bookshops from April 2022. It will have a new cover design so it’s easy to recognise."
        }
    ]
}