{
    "url": "https://civilservice.blog.gov.uk/2022/01/26/civil-service-awards-no-secret-sauce-to-leadership/",
    "title": "Civil Service Awards: ‘No secret sauce to leadership’",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-01-26T09:49:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Steve Glass topped the Outstanding Leader category for his role rising to the challenge of COVID-19."
        },
        {
            "text": "Steve Glass, officially the Civil Service Awards 2021 Outstanding Leader, is the personal pick of Cabinet Secretary Simon Case who championed this category. Steve won for his ‘incredible leadership’ as Programme Director within the Vaccine Taskforce, and there’s no doubt the supply of vaccine to enable the mammoth jab rollout has been a triumph."
        },
        {
            "text": "Unwavering commitment"
        },
        {
            "text": "Four out of every five adults are now fully vaccinated against COVID-19 and the booster campaign is well underway, with a total supply of 123 million doses administered in the UK (soaring daily). Judges commended Steve’s unwavering commitment to serving the public and development of a spirit of resilient confidence in his teams, who collectively delivered a high-risk, hugely complex vaccine programme. "
        },
        {
            "text": "Complete surprise"
        },
        {
            "text": "Despite daunting media expectation, Steve handled the pressures with panache. The first impression is that this victory conceals an innate modesty. Despite the programme’s steamrolling success, the BEIS senior civil servant says victory was a “complete surprise,” but sees it as an endorsement of his “amazing” team, comprising civil servants, academics and industry experts. "
        },
        {
            "text": "“I think this is something that will grow on me over time,” reflects Steve. “I do see this as a team win, as I’m only as good as the team around me and they’re an amazingly capable and committed bunch.”"
        },
        {
            "text": "Pretty special"
        },
        {
            "text": "“It’s a real privilege to be part of the vaccine programme and do my bit,” continued Steve. “I’ve had lots of great opportunities in my career but the unique thing about this is that it’s touched every single member of society in the UK and beyond - that makes it pretty special.”"
        },
        {
            "text": "Steve has experience gained over many years. He joined the Civil Service in the late 80s and devoted his career to defence; the delivery of complex projects and programmes stood him in good stead for his current responsibilities."
        },
        {
            "text": "“My career in defence equipped me very well for the Vaccine Taskforce role. Leading a diverse team to deal with a complex, high-paced, operational programme with technical, manufacturing, scientific, logistical, and regulatory challenges to counter an unpredictable and adaptable threat in the shape of COVID-19 has many synergies with defence. It’s been a hugely rewarding experience.”"
        },
        {
            "text": "Early inspiration"
        },
        {
            "text": "Asked which leader - past or present - inspires him, Steve cites one of his earliest bosses, Terry. “He was an ex-Yorkshire coal miner and on day one he said, ‘You’ll get things wrong, don’t worry, whilst we might have words in private, I’ll always have your back in public and we will fix anything that needs fixing.’”"
        },
        {
            "text": "No secret sauce"
        },
        {
            "text": "When it comes to great leadership, Steve says: “There is no secret sauce, you have to want to do it, it’s not for the half-hearted. I have a born desire to fix problems or overcome challenges and that often means taking the lead. But you also must be open to listening and learning, understanding enough to make well-informed decisions, and tuned in to the needs of your people and your team in different situations."
        },
        {
            "text": "“I learn something every day about myself and how I deal with different situations. Motivating people to do their best at any level in any role means you need to know and care about your people and how they respond to you in a given situation.”"
        },
        {
            "text": "Regarding any award celebrations, Steve’s content to wait until COVID-19 subsides, when he can finally get his team together."
        },
        {
            "text": "“It will be great to enjoy some downtime reflecting on everything that we’ve achieved and been through as a team when we get the chance,” says Steve."
        },
        {
            "text": "A Modern Civil Service"
        },
        {
            "text": "With the Civil Service evolving, Steve believes strong leadership is a fundamental part and parcel of A Modern Civil Service. "
        },
        {
            "text": "“There is immense capability within the Civil Service. We need people leading at all levels who are bold to take on difficult problems in difficult circumstances, that are prepared to be accountable for their actions and decisions and who are driven to provide the highest professional quality of work on behalf of everyone in the country.”"
        },
        {
            "text": "Better place"
        },
        {
            "text": "Asked what he cherishes about being a civil servant, Steve says: “I always have been and remain proud to be a civil servant. Our work often goes unnoticed except when criticised, but I’m proud of the work that we all do to tackle really complicated societal and delivery challenges to ultimately make the country a better place for all of us - the vaccine programme has been a great example of what the Civil Service can do.”"
        }
    ]
}