{
    "url": "https://civilservice.blog.gov.uk/2022/01/26/civil-service-awards-2021-vaccines-victorious/",
    "title": "Civil Service Awards 2021: Vaccines victorious",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-26T17:30:39+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Vaccine Taskforce, from the Department for Business, Energy and Industrial Strategy, the hub of vaccine supply to the UK and beyond is home to the AstraZeneca and Pfizer Project Teams. They have recently been crowned the winner of the Excellence in Delivery Award."
        },
        {
            "text": "We’ve all heard lots about AstraZeneca and Pfizer over the past year, so it’s little wonder that the project teams behind these three vaccines were jointly victorious in this year’s Excellence in Delivery Award. On behalf of the team, Marc Haywood (Deputy Director - Operations), David Edwards (Deputy Director – Delivery & Supply chains) and Andy McIntyre (Operations Manager) shared some insights into what the win means for them."
        },
        {
            "text": "Tremendous team effort"
        },
        {
            "text": "They credit the success to the dedication of their team members. “Every single person has dedicated all of their time, energy and professionalism to the task of supplying vaccines to the UK and internationally,” they said. “It has been a tremendous team effort and showed how the Civil Service at its best can work with industry and academia to deliver incredible things.”"
        },
        {
            "text": "Unique challenge"
        },
        {
            "text": "The team notes that being part of the response to such a unique challenge, “a (hopefully) once in a lifetime situation”, brought their highest standards to the fore and placed renewed emphasis on their own best expectations of Civil Service potential. It hasn’t been an easy road, though: “The resilience the team has shown during this time is unprecedented and it’s fantastic that this has been recognised.”"
        },
        {
            "text": "Looking ahead to celebrating their win, Marc, David and Andy share that “As a team we try to pause for a few hours every so often to reflect on the achievements and celebrate some of the individual and collective successes.” Sadly, Omicron meant their plans to celebrate together had to be put on ice, “but it will be great to get everyone together for a proper celebration at some point in 2022 - the VTF has only all met on one occasion so far!”"
        },
        {
            "text": "Huge effort"
        },
        {
            "text": "Of course, delivery of the vaccine programme to citizens of the UK relied on efforts from many different teams in many different areas. “The whole team is proud of the fact we were the first country to supply and administer vaccines and have had sustained uninterrupted supply ever since. It has taken huge effort from others beyond the VTF to achieve vaccines in arms of the population, but all of that is only possible if vaccine supply is available in the first place.”"
        },
        {
            "text": "Everyday benefits"
        },
        {
            "text": "Working at the centre of a global event has proved a very unusual experience for this team. They have enjoyed seeing their hard work on shaping, planning and delivering vaccine supply translate into real-life everyday benefits for people across the UK and more widely to our overseas territories and internationally via COVAX and bilateral donations. "
        },
        {
            "text": "“To see our parents, family, friends all get vaccinated - it is just a wonderful feeling knowing that is down to the work of the team,” they explain - not to mention being part of a national and international endeavour to make a real difference for the country."
        },
        {
            "text": "Real boost"
        },
        {
            "text": "Looking at the experience of winning this award, Marc, David and Andy explain that being singled out for recognition across the huge range of work the Civil Service does is a real boost for everyone involved. It also reinforces the significance of what the team has done - “something I think most will only truly reflect on when the pace has settled.”"
        },
        {
            "text": "Summing up the win, they share that working in the Vaccine Taskforce is “an incredible and somewhat unique experience,” and that following the announcement of their award win, “everyone, past and present, will single this experience out as a career highlight.”"
        }
    ]
}