{
    "url": "https://civilservice.blog.gov.uk/2022/01/26/civil-service-awards-win-for-the-caring-collaborators/",
    "title": "Civil Service Awards: Big win for the caring collaborators",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-01-26T12:31:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Department of Health and Social Care’s ventilator team scoops the award for best Civil Service-wide collaboration - and they have never even met each other."
        },
        {
            "text": "Dubbed as a ‘career highlight’, the team responsible for the COVID-19 Oxygen, Ventilation, Medical Devices and Clinical Consumables Programme has worked tirelessly over the last two years pulling all aspects of the Civil Service together to provide life-saving equipment to patients across the country."
        },
        {
            "text": "Like many of us have also been doing, a lot of this work was completed virtually due to lockdowns and restrictions - meaning that some of the individuals working on this project only know what their colleagues look like in 2D, and from the shoulders up!"
        },
        {
            "text": "Exceptional demands"
        },
        {
            "text": "Despite the immense pressure, under extraordinary circumstances, the team managed to bring together all the diverse organisations and people involved from across the Civil Service, NHS and other private and public sector partners to meet the exceptional demands of COVID-19 - and at great speed. Everyone pulling in the same direction as a focused team, they believe, is probably what caught the attention of the judges."
        },
        {
            "text": "“In the same way as the UK has not had to face anything like COVID-19 in living memory, most of our people have never worked on something that has such a big impact on so many people before,” - Sian Greenley - Head of Office for Medical Technologies, DHSC"
        },
        {
            "text": "Tangible effects"
        },
        {
            "text": "In a way, perhaps one of the best aspects of being a civil servant is seeing such tangible effects of your efforts on the citizens you serve. Winning an award to recognise the achievements, out of hundreds of nominations, is simply the icing on the cake. Indeed, the team has found the impact of this programme on vulnerable lives to be “motivating and energising, in what’s been a really challenging time for the world”."
        },
        {
            "text": "But the good work doesn’t stop there. Although most people in the team have either gone back to substantive posts or started new ones, they will all be taking new skills and confidence from this exceptional experience into their next challenges."
        }
    ]
}