{
    "url": "https://foresightprojects.blog.gov.uk/2022/01/26/genomics-beyond-health-preparing-for-a-genomic-future/",
    "title": "Genomics beyond health: preparing for a genomic future",
    "authors": [
        "Melissa Jackson"
    ],
    "categories": [
        "Foresight projects"
    ],
    "pub_date": "2022-01-26T16:03:52+00:00",
    "content": [
        {
            "text": "If current progress in genomics continues, these are the kinds of questions we might have to grapple with in the not-too-distant future."
        },
        {
            "text": "As it stands, a person’s genomic information (their unique DNA sequence) can already be used to make medical diagnosis and to personalise their treatment."
        },
        {
            "text": "Research is even underway to develop tools which predict someone’s risk of disease, based on analysing their DNA sequence for genetic variants associated with that disease."
        },
        {
            "text": "However, we are also beginning to understand how the genome can influence traits and behaviours beyond health. There is already evidence that specific behavioural traits, such as risk-taking and substance abuse, are influenced by the genome. One day, genomic science will reach a point where it might be possible to predict these non-health traits too."
        },
        {
            "text": "The genomic future"
        },
        {
            "text": "Genomic science could enable a variety of interventions in many sectors: educational programmes designed to suit different learning styles and capabilities; criminal sentencing which takes into account people’s genetic predisposition to certain behaviours; or identifying people with potential health issues (like inherited cardiac conditions) and advising them against certain occupations. However, the ability to do these things doesn’t necessarily mean that we should: we will need to think carefully about the potential opportunities and risks posed by using genomics in this way."
        },
        {
            "text": "Up until now, our thinking around genomics has been mostly confined to the health and medical sectors, but it’s clear this is changing. Genomics presents risks and opportunities to a wide range of sectors, one of which may be yours. These include practical considerations, ethical dilemmas, and questions around equality and discrimination. The genomic revolution is already happening – the question is, will we be ready for it?"
        },
        {
            "text": "Our report ‘Genomics Beyond Health’, published today, introduces genomics, explores how the science is developing, and considers where it might lead to, in several sectors including education and criminal justice. It considers what new possibilities might emerge in the future and what all this might mean for policy in areas including education, insurance, criminal justice, and employment. We will be working with policy officials across departments to support them in considering how genomics might impact their departments’ areas of policy and explore what action might be necessary to prepare for the opportunities and risks that the application of this fast-developing science will bring with it."
        },
        {
            "text": "Find out more about genomics and its potential here in our new report: Genomics Beyond Health."
        },
        {
            "text": "For further information please contact the Foresight projects team on foresight@go-science.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}