{
    "url": "https://grantscommunity.blog.gov.uk/2022/01/26/measuring-success-based-on-your-experience/",
    "title": "Measuring success based on your experience",
    "authors": [
        "Laura Greenup"
    ],
    "categories": [
        "Digital transformation",
        "Evaluation",
        "Grants Applicant Programme"
    ],
    "pub_date": "2022-01-26T11:08:33+00:00",
    "content": [
        {
            "text": "Evaluation is an essential part of any programme. It allows us to assess the failure, success or green shoots of promise in any project. In the Government Grants Management Function, my job is to formulate how we evaluate our work and understand our impact."
        },
        {
            "text": "The Grants Applicant Programme (GAP) is no different. In fact, evaluation will be critical for us to assess in 12 months from now, if there is a case for a government-wide rollout of the pilot grants service - or not."
        },
        {
            "text": "If successful, the pilot would pave the way for a single place for all government grants applications - for the whole of government. This innovative model would enable a step change in UK government grant making and completely reset the way in which government and public sector bodies interact with civil society organisations and small to medium-sized businesses."
        },
        {
            "heading": 2,
            "text": "What constitutes success for GAP?"
        },
        {
            "text": "As one of the HMT Shared Outcomes Fund projects, we will use evaluation to understand these 6 questions:"
        },
        {
            "heading": 2,
            "text": "Saving time, reducing costs and levelling up"
        },
        {
            "text": "The only way we can assess if in 12 months the pilot has been successful (or not) is to create a baseline of what life is like today. "
        },
        {
            "text": "So we have produced a survey to understand your experience of finding and applying for government grants. If you have previously tried to find and apply for a single grant or multiple grants (successfully or unsuccessfully) between 6 April 2020 and 5 April 2021, administered by UK government departments or arm's length bodies, then we’d really like you to complete the survey by Friday 25 February."
        },
        {
            "text": "In it, we ask questions about your experience of finding and applying for grants and the resources required for each. "
        },
        {
            "heading": 2,
            "text": "Spread the word"
        },
        {
            "text": "If you are reading this and thinking this survey is not for me, but I know someone who might be interested, please feel free to forward this blog or survey to any colleagues and others in your network."
        },
        {
            "text": "The more data we have, the more confidence we can have in our findings and assertions. As from the results, we will establish a baseline of current experience, including the time and costs involved in finding and applying for government grants.  "
        },
        {
            "text": "Then, as we develop the online grants service over the next 12 months, we will gather data on metrics, such as user experience and time taken to apply, in order to compare and measure the improvements enabled by the service. This will allow us to understand what does or doesn’t work to help us continuously improve.  "
        },
        {
            "text": "Volume of applications, success rates and the geographical spread of applications will also be monitored to help us understand the impact on competition and levelling up."
        },
        {
            "heading": 2,
            "text": "Join the Government Grants Community"
        },
        {
            "text": "If this work is of interest to you, you can also join the Government Grants Community. Once you are a member, you will get updates on our progress on the Grants Applicant Programme and be invited to help co-create the online service with us over the weeks and months to come. "
        },
        {
            "text": "With a fair wind, the first iteration of the Find A Grant service - featuring a small number of grants in the first instance - will be shared with the Government Grants Community next month."
        },
        {
            "text": "Laura Greenup\nHead of Analysis and Insight, Government Grants Management Function."
        }
    ]
}