{
    "url": "https://gds.blog.gov.uk/2022/01/26/podcast-understanding-the-complexity-of-users-lives/",
    "title": "Podcast: Understanding the complexity of users' lives",
    "authors": [
        "The GDS Team"
    ],
    "categories": [
        "Identity Assurance",
        "Podcast",
        "User research"
    ],
    "pub_date": "2022-01-26T10:22:00+00:00",
    "content": [
        {
            "text": "In this month's episode of the Government Digital Service (GDS) Podcast, we're talking about user needs."
        },
        {
            "text": "We have 2 user researchers (URs) from GDS, Lauren Gorton and Charlotte Crossland, joining us on this episode to share the work they and their colleagues have been doing to understand more about what service teams and their users need from government's new single sign-on and digital identity solution, GOV.UK Sign-In."
        },
        {
            "text": "'Start with user needs' is the first of the government's Design Principles, but what does that mean in practice? We wanted to learn more about the approaches URs take to understand what services and products need to deliver."
        },
        {
            "text": "In this episode, Lauren and Charlotte detail how they've collaborated with teams from different government departments to build on existing insights and gather new learning that is being used to help shape GDS's One Login for Government programme."
        },
        {
            "text": "Also in this episode, we discuss the impacts of COVID-19 on the research community and how the mindsets model was used in favour of personas to provide a more accurate view of the complexity of real life."
        },
        {
            "heading": 2,
            "text": "Work with us"
        },
        {
            "text": "Interested in becoming an early adopter of government’s new single sign-on and digital identity solution, GOV.UK - or perhaps you’d like to share your insights with our programme team? Register your interest on our product page."
        },
        {
            "heading": 2,
            "text": "Subscribe to our podcast"
        }
    ]
}