{
    "url": "https://hmlandregistry.blog.gov.uk/2022/01/26/private-sector-collaboration-helps-local-land-charges-programme-delivery/",
    "title": "Private sector collaboration helps Local Land Charges Programme delivery",
    "authors": [
        "Gary Williams, Senior Delivery Partner/Supplier Manager"
    ],
    "categories": [
        "Local Land Charges"
    ],
    "pub_date": "2022-01-26T16:42:32+00:00",
    "content": [
        {
            "text": "The transfer of local land charges data to the national Local Land Charges Register continues to gain momentum. More than 1.5 million charges from 32 local authorities are now available to be searched in the register."
        },
        {
            "text": "The processes involved in moving local land charges data from all 331 local authorities in England and Wales to the register are complex and time consuming. Since ‘migrations’ (the term we use for transferring data) began, we have collaborated with the local authorities’ existing Land Charges IT systems suppliers. They provide data extract, import and integration services and build the Application Programming Interface (API)."
        },
        {
            "text": "In June, we partnered with two market leading companies, Cyient Europe and Landmark Information Group. These private sector delivery partners provide expertise in data transformation services, preparing the data to business standards set by HM Land Registry."
        },
        {
            "heading": 2,
            "text": "Sharing best practice"
        },
        {
            "text": "We have undertaken extensive knowledge sharing with Cyient and Landmark during a series of meetings and workshops. Roles and responsibilities have been defined and we are now ready to ‘continuously improve whilst doing’. We are really excited about having market leading delivery partners join our team. They will now start to prepare local authority data for transfer to the register."
        },
        {
            "text": "During the next six months, the implementation phase, we will ‘buddy up’ with Cyient and Landmark UK-based teams to refine and perfect their approach, while they work on the data. Cyient, Landmark and our teams will all work to the same data quality standards and delivery outcomes. All teams have a licence to innovate and improve how these outcomes are achieved. We have incentivised punctual delivery and quality standards through a work allocation model, based on “the better you do the more work you can have”."
        },
        {
            "text": "Having Cyient and Landmark’s capacity and expertise in place is the final component of our strategy to deliver the programme in an ambitious four-year timescale. We can now ramp up the number of migrations, while maintaining data quality standards and the same level of support we offer local authorities."
        },
        {
            "heading": 2,
            "text": "The valuable work of our suppliers  "
        },
        {
            "text": "We are working with software suppliers Idox, NEC, DEF, Agile Applications and Arcus Global to ensure local authorities can update the Local Land Charges Register through an API built into their IT systems. We also plan to work with Civica, Ocella and StatMap."
        },
        {
            "text": "We will continue to share information about our work with our suppliers and customers. Webinars hosted with local authorities and their suppliers were well received. The programme now has a good momentum and more than 100 local authorities are ready to start working with us. We are working with the suppliers on plans to complete deployment to all local authorities by September 2022. This approach involves a lot of planning and collaboration across HM Land Registry, the local authorities and suppliers."
        },
        {
            "heading": 2,
            "text": "Working as a team with the end in mind"
        },
        {
            "text": "We can only achieve our goals if our relationships are based on openness, transparency and flexibility with all our partners. Although change is constant and challenges inevitable, we believe the measures we have put in place align with best practice. As we increase the scale of our operations, we are certain this joint effort will visibly quicken the pace of delivery to meet the ambitious programme timescales."
        }
    ]
}