{
    "url": "https://teaching.blog.gov.uk/2022/01/26/rediscovering-teaching-my-experience-of-returning-to-the-classroom/",
    "title": "Rediscovering teaching: my experience of returning to the classroom",
    "authors": [
        "Loic Menzies"
    ],
    "categories": [
        "COVID-19 support",
        "Flexible working",
        "Inspiring teachers",
        "Teachers' reflections"
    ],
    "pub_date": "2022-01-26T15:47:21+00:00",
    "content": [
        {
            "text": "Loic Menzies is the former Chief Executive of the Centre for Education and Youth, who has answered the call for teachers to return to the classroom to support schools with staffing pressures. We’re inviting qualified ex-teachers to step in and help teach children and young people in school and college on a temporary basis and in this blog Loic describes his experience so far. You can follow him on twitter @LoicMnzs"
        },
        {
            "text": "Even when I first left teaching, back in 2009, I knew I couldn’t go cold-turkey and that I probably wasn’t stepping out for good."
        },
        {
            "text": "Initially, my desire to stay connected to the classroom meant I continued going back to my former school. I did some supply teaching and helped out with revision classes, but over time, my work running the ‘think and action-tank’ at The Centre for Education and Youth (CfEY) stretched the umbilical-cord further and further. It was never really severed though, which is why when I heard about how hard teachers were working to cope with pandemic-induced staff shortages, I decided to put my tie back on and pick up my board-pen."
        },
        {
            "text": "Truth be told, I was pretty nervous about my first day back. Would I still know how to be “Mr Menzies”? I’d always been good at building rapport with students, but ten years back there was no Instagram and certainly no TikTok; would I know how to connect with pupils born in the 21st Century? And would I still be able to project any sort of authority?"
        },
        {
            "text": "First day back"
        },
        {
            "text": "I know that tight staffing can mean teachers end up being scrambled into extra-lunch duties and at the moment, some schools are having to combine multiple classes in an effort to keep schools open. I realised I’d only be making a small contribution, but I hoped I could at least lighten the burden a little."
        },
        {
            "text": "One of the main things I’ve been doing in my first two days back has been helping out with the one-to-one and small group support that has had to be cut-back while schools keep their heads above water. For example, as a native French speaker, I’ve been able to do some speaking practice with small groups who, pre-pandemic, would have had regular time with a French assistant. I’ve also had conversations with pupils wanting to talk through their future A-level and university options. Now that I’ve revived the Mr Menzies alter-ego I’m hoping that next week I’ll feel comfortable taking on a bit more responsibility with a full class."
        },
        {
            "text": "Even though I’m only able to help-out one day a week, I’ve loved meeting brilliant students and deeply committed staff. Today, for example, I met a Year 12 who loves photography so much that he’s set up his own business capturing people’s portraits and recording events. It was great to be able to give him some impromptu advice on registering as self-employed and developing his business."
        },
        {
            "text": "An added bit of interest for me has come from working somewhere completely different to the school I used to teach in. Back in the early 2000s I worked in an extremely diverse central London school, squeezed onto a tiny site. In contrast, the school I’ve returned to is more rural and stretched over a vast and sprawling site. Of course, every context has its own challenges, but I’ve really enjoyed looking out of the window and seeing soaring red kites instead of swarming pigeons."
        },
        {
            "text": "It’s still early days but it’s been a great experience so far and it’s wonderful (and a relief) to hear that the school have found it useful. I’d certainly recommend it to any other former teachers who might not be ready to step away completely."
        },
        {
            "text": "Call for qualified teachers"
        },
        {
            "text": "If you would like to get back in to the classroom and teach supply,  find out more."
        }
    ]
}