{
    "url": "https://socialcare.blog.gov.uk/2022/01/26/technology-takes-off/",
    "title": "Technology takes off",
    "authors": [
        "Ewan King",
        "Ralph Cook"
    ],
    "categories": [
        "Care and support",
        "Innovation",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2022-01-26T12:45:05+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Leading fulfilled lives in homes and communities"
        },
        {
            "text": "The Social Care White Paper asserts ‘When technology is embedded into care and support services, it can be transformative, helping people to live happy, fulfilled lives in their homes and communities.’  It sets out several promising initiatives, including a new scheme to test new care technology."
        },
        {
            "text": "We couldn’t agree more: digital technology can transform lives. If the pandemic has taught us any positive lessons, it’s that technology must be at the heart of future approaches to care. Digital platforms like Facebook and WhatsApp have become a lifeline for many, enabling people who draw on care to connect easily with their care workers, friends and family."
        },
        {
            "text": "There is now a seismic shift in the care sector’s digital focus and ambition. To a large degree, this comes from the realisation that current models of care are not sustainable, with the workforce needing to stretch and grow beyond traditional approaches. Some estimates suggest an additional 600,000 care staff may be needed in the next two years alone."
        },
        {
            "heading": 2,
            "text": "Implementing bold plans"
        },
        {
            "text": "Many leaders are now developing fantastic visions of digital enablement. Lack of commitment is no longer a problem. The challenge now lies in implementing these bold plans."
        },
        {
            "text": "A couple of years ago, SCIE (Social Care Institute for Excellence) surveyed over 1000 social workers for NHS Digital. We found that, whilst there was a growing recognition of the importance of technology, people often lacked the training, skills and tools needed to take advantage. More significantly, there were concerns technology could undermine relationship-based ways of working, including strengths-based practice."
        },
        {
            "text": "Unless the cultural concerns of frontline staff are overcome, the sector will never deliver digital innovation at scale."
        },
        {
            "heading": 2,
            "text": "Digital skills and reframing the argument"
        },
        {
            "text": "SCIE and Channel 3 Consulting believe the sector needs to focus on two interventions. Firstly: building digital skills and confidence in frontline teams. This is a relatively simple first step."
        },
        {
            "text": "Many councils recognise this and already invest in their people. Others will need to move quickly. In the Royal Borough of Kingston, for instance, SCIE is helping care workers develop basic technology literacy, and the council is working on a cultural change programme to help all staff and partners adapt to new technology."
        },
        {
            "text": "The second intervention is about reframing arguments around the impact of digital technology on frontline practice. Technology, used well, can augment and enhance human conversations, create more resources and assets, and make sure people’s information is shared properly to avoid them having to repeat their story many times."
        },
        {
            "heading": 2,
            "text": "On the periphery?"
        },
        {
            "text": "Embedding digital as part of every conversation needs to become the norm. For the government to realise its vision and the sector to unlock new models of care, we need to look at technology in the round. It’s not a project or pilot. It’s not just about data or assistive technology. It is a whole way of thinking, working and supporting people. So, let’s think big!"
        },
        {
            "text": "Channel 3 Consulting’s experience of delivering digitally-enabled change has helped them identify ideal conditions for successful implementation."
        },
        {
            "text": "For a start, digital must be seen as an essential driver of social care’s transformation, but in the context of ‘people first’, where technology allows an even greater focus on their needs and aspirations."
        },
        {
            "text": "It also requires leadership and ambition to prioritise the digital enablement of new models of care and inspire teams to have the confidence to get going and build momentum."
        },
        {
            "text": "Most importantly, technology can help care colleagues take frontline social care practice to the next level and support people to live fulfilled independent lives based on strong relationships."
        },
        {
            "text": "It can also position social care as a digitally-enabled profession able to attract and retain a new generation of care staff. But this won’t happen by accident. The sooner we start the journey, the sooner we can deliver a better future for social care."
        }
    ]
}