{
    "url": "https://naturalengland.blog.gov.uk/2025/02/04/guest-blog-showcasing-successful-onsite-biodiversity-net-gain-bng-project-management/",
    "title": "Guest blog: Showcasing successful onsite Biodiversity Net Gain (BNG) project management",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Climate change",
        "Development",
        "Uncategorized"
    ],
    "pub_date": "2025-02-04T12:10:11+00:00",
    "content": [
        {
            "text": "In the run up to the first anniversary (12 February) of the introduction of BNG as a mandatory approach to development, making BNG a statutory requirement in all (non-exempt) Town and Country Planning Act applications we invited two open space management experts to share their experiences of BNG over the last year."
        },
        {
            "text": "They provide examples of best practice and showcasing practical approaches, and show the value of early engagement with management companies to ensure successful long-term BNG delivery with trusted stakeholders."
        },
        {
            "text": "The impact of BNG on Open Space Management:Paul Cassidy, Ecology and Conservation Manager, Meadfleet"
        },
        {
            "text": "The designation of onsite areas as BNG habitats has introduced significant changes for open space management companies. Housebuilders require an ongoing management solution that protects their legacy with proven in-house expertise and experience to meet all the requirements of the legislation. A collaborative approach is beneficial, so that all parties can work together through the process to meet the various challenges with positive outcomes."
        },
        {
            "text": "Meadfleet has been voluntarily improving the biodiversity value of the open spaces for some time now. Areas have been assessed and enhanced following the principles of BNG. This has led to developments now supporting diverse grasslands, native wildflower areas, new hedgerows and associated margins, and areas of scrub and woodland. Whilst not compulsory on historic developments, this demonstrates how our approach combined with customer education and engagement, will ensure the success of BNG on future projects on behalf of housebuilders."
        },
        {
            "text": "BNG emphasises the importance of involving ecologists early in the planning process to evaluate habitat impacts and develop effective mitigation strategies. Equally critical, however, is input from land managers and contractors to ensure the habitats can be practically delivered and maintained."
        },
        {
            "text": "Traditionally, developers installed public open spaces according to approved landscape plans, which were later inspected by the management company before maintenance began. Meadfleet collaborates with developers during the planning stage, providing advice based on our 30 years’ experience and helping ensure developers optimise BNG opportunities."
        },
        {
            "text": "Incorporating landscape professionals during planning allows for consideration of factors like accessibility, topography, and drainage, all of which affect habitat success and maintenance costs. For example, well-drained, easily accessible grassland can be managed using standard equipment, while remote or poorly drained areas may require specialised contractors and higher costs."
        },
        {
            "text": "Traditional public open space maintenance focuses on keeping landscapes safe, tidy, and accessible. Meadfleet’s approach to BNG has required educating contractors on habitat-specific management practices. Training courses and guidance are provided to Regional Managers, who oversee monthly inspections to monitor habitat success."
        },
        {
            "text": "The shift from traditional, routine maintenance to BNG-focused management has highlighted several challenges:"
        },
        {
            "text": "Meadfleet’s Ecology Team is qualified to undertake BNG metrics and condition assessments, ensuring habitats are effectively managed. These efforts aim to overcome challenges and prioritise biodiversity while maintaining safe and accessible spaces for communities."
        },
        {
            "text": "By adopting innovative approaches to greenspace management and addressing practical challenges, Meadfleet continues to integrate BNG principles into residential developments, ensuring a positive impact on nature and the communities it supports."
        },
        {
            "text": "Becoming BNG ready:Richard Thomas, Environmental Social Governance Director, Trustgreen"
        },
        {
            "text": "Trustgreen has been providing open space management for residential developments for many years. This includes everything from simple amenity grass to ancient woodlands to SSSIs and everything in-between. We currently work with the majority of UK house builders and are known for delivering on the promises made regarding the planned open spaces they create and enhance."
        },
        {
            "text": "As such we knew that our developer partners would be looking to us to not only help deliver their BNG schemes but also to engage with their residents and communicate with them the social benefits as well as the environmental ones. We look at BNG as not only an opportunity for nature recovery but one of community growth too."
        },
        {
            "text": "At Trustgreen we have spent a number of years upskilling our employees and also reaching out to our industry to help educate and inform them about the opportunities and risks that BNG offers. We have hosted round table discussions, headlined conferences, and have run a number of BNG themed CPD workshops all with the aim of bringing the various parties involved with BNG delivery together."
        },
        {
            "text": "A common theme both from Natural England blogs and private discussions has been the need for early engagement between all parties – much earlier than traditionally has been the case when planning the open spaces associated with developments. In our experience, as an organisation that will be entrusted with safeguarding the envisioned habitats for at least 30 years it is vital that we have eyes on the scheme as early as possible."
        },
        {
            "text": "The reason for this is multi-faceted. Ultimately, we need to know that the scheme is deliverable over the 30 years and beyond. This includes not only how things look on the ground right now but also how things may look in the coming years – a lot can change in 30 years. Our weather patterns were different in 1994 and so it is safe to assume that they will be different again by 2054, the same can be said for technology."
        }
    ]
}