{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/02/04/national-apprenticeship-week-2025-my-apprenticeship-journey/",
    "title": "National Apprenticeship Week 2025:  My apprenticeship journey  ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Learning & Development"
    ],
    "pub_date": "2025-02-04T12:19:45+00:00",
    "content": [
        {
            "text": "Daniel Charles Smith – Assistant Scientist   "
        },
        {
            "text": "After a ten-year career in the aviation industry, I decided that it was time to follow my passion in science. Aside from wanting to do something that made an impact, I didn’t have specific ideas, so I decided to investigate the possibility of taking up an apprenticeship. During my search, I came across an advert for a level three apprenticeship in metrology at the National Physical Laboratory (NPL). After googling the definition of metrology, I decided, as a shot in the dark, I should just go for it, and I haven’t looked back since."
        },
        {
            "text": "I began my apprenticeship with the Nuclear Metrology Group (NMG) in 2021. My responsibilities included operating and maintaining a particle accelerator and creating bespoke target mounts through 3D printing. My first major project in the group was replacing a particular component on the accelerator with a more advanced model, increasing our capability for work important for research into nuclear fusion. I already felt like my time and efforts were making the impact I wanted. "
        },
        {
            "text": "I moved into the Quantum Electric Metrology group for my second year, becoming a part of the team that develops new technologies to continuously redefine the standards for the Ampere, the International System of Units (SI unit) of electricity. For my third year, returning to NMG with my newly gained experience and confidence, I began managing a research project. The project underpins the realisation of the next generation of nuclear reactor technologies, ensuring safer and more economical operation compared to existing reactors. The project has seen early success, and I even went to Paris to present our results."
        },
        {
            "text": "Throughout my apprenticeship, I have been involved in NPL’s Outreach scheme, which aims to inspire the next generation and raise awareness of STEM careers. I have enjoyed this element greatly, so much so that I have now become a STEM Ambassador. And finishing my apprenticeship on a high, I was awarded the Institute of Physics’ Apprentice of the year."
        },
        {
            "text": "If you had told me five years ago that I was going to achieve so much, I wouldn’t have believed you. Now, I have become a champion of apprenticeships, and I am a living example that proves they are a great way to learn new skills and achieve great things."
        }
    ]
}