{
    "url": "https://mhclgdigital.blog.gov.uk/2025/02/04/what-its-like-to-be-a-user-researcher-at-mhclg-digital/",
    "title": "What it’s like to be a user researcher at MHCLG Digital",
    "authors": [
        "James Higgins, User Researcher"
    ],
    "categories": [
        "Careers",
        "Homes for Ukraine",
        "Ways of working"
    ],
    "pub_date": "2025-02-04T09:39:31+00:00",
    "content": [
        {
            "text": "Hi, I’m James, a user researcher at the Ministry for Housing, Communities and Local Government (MHCLG). I’ve been working in the resettlement space since I arrived in the department just over a year ago, primarily focusing on the Homes for Ukraine (HfU) programme.  "
        },
        {
            "heading": 2,
            "text": "What I’m working on: Homes for Ukraine  "
        },
        {
            "text": "The Homes for Ukraine Sponsorship Scheme supports Ukrainians and their immediate family members to apply for permission to come to the UK. The scheme enables individuals to volunteer accommodation and provide a route to temporary sanctuary for Ukrainians. You can find out more about how the programme was set up as part of responding to a crisis at scale, what we did and what has been achieved so far in this case study. "
        },
        {
            "text": "Since joining the HfU digital team I’ve been involved with projects aimed at improving the way users interact with the current HfU digital tools, as well as exploring what these could look like in the future. These tools help local authorities and devolved administrations manage guest and sponsor relationships, give the Home Office information on the eligibility of sponsors and hosts, and assist MHCLG in their policy development and funding of the scheme.  "
        },
        {
            "heading": 2,
            "text": "My role: developing a true insight into user needs  "
        },
        {
            "text": "The fundamental role of a user researcher is to be an advocate for users. The common mantra in user-centred design is that ‘you are not the user’, and it is the user researcher’s role to gain an understanding of genuine user needs and pain points by speaking with the users directly. This goes a long way to removing assumptions and biases when designing digital products and services. "
        },
        {
            "text": "On a day-to-day basis this often entails recruiting and interviewing users, facilitating usability tests, launching surveys or digging into a platform’s analytics to tease out user behaviour. As a result, a user researcher is able to present validated needs and pain points to their wider team. This encourages the best practice of putting the users front and centre during the design and development phases of new or updated digital tools, products and services.  "
        },
        {
            "heading": 2,
            "text": "The importance of user research for the Homes for Ukraine programme  "
        },
        {
            "text": "The HfU Sponsorship Scheme is fluid in nature, and the movement of guests between hosts means local authorities, devolved administrations, MHCLG and the Home Office all have evolving requirements of the service, and the digital tools which sit at the centre of it.  My role is to ensure we have a clear understanding of how we can iterate this service in ways which specifically support these user groups.  "
        },
        {
            "text": "One example of how user research has made a positive impact for local authority users is how cases are managed when they’re assigned to more than one local authority (these are called ‘multi-local authority cases’). In a multi-local authority case, a guest will have applied to stay with different sponsors in more than one local authority. This caused potential issues amongst the local authorities with record ownership, and confusion around safeguarding responsibilities.  "
        },
        {
            "text": "To address these challenges, we facilitated a number of focus groups with several affected local authorities, seeking to define their pain points, and then test potential solutions. We were then able to iterate the platform with the confidence that our solutions would positively impact the majority of users, and the resulting changes were very warmly received.   "
        },
        {
            "heading": 2,
            "text": "How I came to work at MHCLG from the private sector "
        },
        {
            "text": "My background is in English Language Teaching and academic management, and I took the step to retrain in user experience design and research in 2021. I’ve found constructing and facilitating user research sessions to be strikingly similar to how I used to plan and deliver my classes, and can imagine others with similar backgrounds would find this transition relatable too.   "
        },
        {
            "text": "I applied to work at MHCLG following some time working in the private sector. This was firstly in the e-commerce digital design space, and then as a user researcher for an agency working with public sector clients, such as NHS England and the Royal Air Force.    "
        },
        {
            "text": "Moving into the Civil Service from this perspective has been particularly fulfilling as it has allowed me to become embedded within projects on a longer-term basis. In the private sector, I was often only required to fulfil 2 or 3-month discovery sprints with clients, and then hand over my findings for them to develop into solutions.  "
        },
        {
            "text": "However, in the year since I’ve been with the HfU digital team, I have been involved in the end-to-end process of implementing my foundational research and seen how this has positively impacted our users first-hand.  "
        },
        {
            "heading": 2,
            "text": "The crucial role of user research in policy-making   "
        },
        {
            "text": "Taking the step to work in this sector in government has helped me develop immensely, particularly as MHCLG has a supportive and active user research community of practice. Our department also has an ambitious vision of using digital ways of working, including user-centred approaches, to deliver improved outcomes."
        },
        {
            "text": "This is an exciting time to be a user researcher here. Beyond the role we play in the development of user-centred digital products and services, user research colleagues are also building good relationships with policy teams. There is a breadth of policy areas within MHCLG, such as planning reform, remediation, resettlement and devolution agenda, and user researchers are having an increasingly active role to play in many of these areas. "
        }
    ]
}