{
    "url": "https://naturalengland.blog.gov.uk/2024/01/29/biodiversity-net-gain-where-to-start/",
    "title": "Biodiversity net gain: where to start",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Environment Act",
        "Green Infrastructure",
        "Natural England"
    ],
    "pub_date": "2024-01-29T09:41:11+00:00",
    "content": [
        {
            "text": "\nBiodiversity net gain (BNG) is an ambitious government strategy to make sure that habitat for wildlife is in a better state than it was before development."
        },
        {
            "text": "We are delighted to celebrate Defra's confirmation that Biodiversity Net Gain (BNG) for major developments goes live on 12 February 2024."
        },
        {
            "text": "We will see for the first time, all habitats, no matter how important, being recognised in the planning system for their value for nature and people."
        },
        {
            "text": "What does BNG mean for you?"
        },
        {
            "text": "BNG requires developers to provide at least 110% of the biodiversity value found on the site prior to their development. BNG can be delivered either fully or in part through on-site habitat, off-site habitat, or as a last resort, the purchase of statutory biodiversity credits."
        },
        {
            "text": "You will need to understand the requirements of BNG if you’re a:"
        },
        {
            "text": "Created and enhanced habitat will be secured for a minimum of 30 years. Habitat is used as a proxy for calculating biodiversity."
        },
        {
            "text": "Find out more about biodiversity net gain."
        },
        {
            "text": "If you’re a developer"
        },
        {
            "text": "Through integrating on-site BNG delivery in project designs at the outset, developers will have the opportunity to be creative about incorporating nature. This could make:"
        },
        {
            "text": "The statutory biodiversity credit scheme aims to ensure that the pace of development in England is not impacted by the introduction of mandatory BNG by providing a last resort alternative if on-site and off-site options are unavailable."
        },
        {
            "text": "In BNG, there is a key difference between biodiversity units and credits:"
        },
        {
            "text": "Read steps for developers to meet BNG requirements."
        },
        {
            "text": "If you’re a local planning authority"
        },
        {
            "text": "Local planning authorities (LPAs) play a central role in BNG. BNG will primarily be consented and enforced through the planning regime. LPAs may also need to legally secure off-site gain sites on behalf of local landowners."
        },
        {
            "text": "LPAs will have to triage BNG applications and ensure a statutory metric is submitted, a biodiversity gain plan is received and check proportionate habitat management and monitoring information is provided for significant on-site gains."
        },
        {
            "text": "LPAs also have opportunities to pursue additional income streams, such as selling off-site units from your own local authority land."
        },
        {
            "text": "Read Biodiversity net gain: what local planning authorities should do."
        },
        {
            "text": "If you’re a land manager wanting to sell in the BNG market"
        },
        {
            "text": "BNG offers landowners another way to fund nature recovery, alongside providing an alternative income stream to complement other business activities."
        },
        {
            "text": "Landowners can sell off-site biodiversity units to developers, provided that the habitat sites are registered."
        },
        {
            "text": "Read Steps to take for land managers to meet your BNG requirements."
        },
        {
            "text": "Where do Defra, Natural England, and other governmental departments fit in?"
        },
        {
            "text": "Defra is responsible for the legislation, alongside DLUHC. Defra is also responsible for setting the legal guidance. Read BNG legal guidance and legislation."
        },
        {
            "text": "Natural England will run the gains site register and sell statutory biodiversity credits. The Register and Credit Sales Service will be accessible from GOV.UK. It will be subject to regular review and improvement on the basis of ongoing user testing and feedback."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "BNG will be mandatory for major developments from 12 February 2024. BNG will become mandatory for minor sites on 2 April 2024 and is expected to extend to Nationally Significant Infrastructure Projects, from late November 2025."
        },
        {
            "text": "This is a major step towards a nature recovery and and will play part in enhancing the places where people live and work. We look forward to collaborating with all our partners in making this happen."
        },
        {
            "text": "Visit GOV.UK for more information and guidance on Biodiversity net gain."
        }
    ]
}