{
    "url": "https://defraenvironment.blog.gov.uk/2024/01/29/bringing-more-environment-topics-to-the-blog/",
    "title": "Bringing more environment topics to the blog",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Environmental Improvement Plan",
        "Land Use"
    ],
    "pub_date": "2024-01-29T10:31:50+00:00",
    "content": [
        {
            "text": "On 31 January, the one-year anniversary of the Environmental Improvement Plan, we will permanently expand this Land Use blog into an Environment blog. That means we’ll change from defralanduse.blog.gov.uk to defraenvironment.blog.gov.uk."
        },
        {
            "text": "The new Environment blog will showcase the breadth of activity happening across the Defra group to help achieve the Environmental Improvement Plan’s targets. This change means more content and more context for our readers."
        },
        {
            "text": "Topics will include nature recovery, water, waste, biosecurity and science – and, of course, land use. We will publish at least one post per week, including case studies and news stories."
        },
        {
            "text": "We’re aiming for the blog to provide a more personal perspective to Defra’s work, and it will show what our policies and activities mean for people and nature."
        },
        {
            "text": "If you are only interested in reading about land use, don’t worry – you can filter the blog’s stories by using the ‘search blog’ function. Just type in ‘land use’, and you’ll see all the relevant posts in chronological order."
        },
        {
            "text": "We’d encourage you to subscribe to the blog. That way, you’ll get an email notification every time we publish a new post."
        },
        {
            "text": "If you are already subscribed to the Land Use blog, your subscription will automatically transfer when we change the URL on 31 January. You don’t need to do anything."
        },
        {
            "text": "We’d like to thank you for following the updates on this blog to date, and we hope that the content has been helpful. We’re looking forward to sharing posts with you on the Environment blog!"
        }
    ]
}