{
    "url": "https://educationhub.blog.gov.uk/2024/01/29/disposable-vape-ban-and-what-it-means-for-young-people/",
    "title": "Disposable vape ban and what it means for young people",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2024-01-29T09:01:23+00:00",
    "content": [
        {
            "text": "The number of children using vapes has tripled in the last three years and there is strong evidence to suggest that cheap and easy-to-use disposable vapes are partly to blame."
        },
        {
            "text": "Our research shows that in 2023, around 69 per cent of vapers aged 11 to 17 in Great Britain were using disposable vapes, up from 7.7 percent in 2021. This is extremely worrying given the unknown long-term health impacts and the addictive nature of the nicotine in vapes."
        },
        {
            "text": "While vaping can play a role in helping adult smokers to quit, the NHS advises that you shouldn’t take it up if you don’t already smoke– and children should never vape."
        },
        {
            "text": "Here’s what we’re doing to prevent children from vaping and smoking to protect their health, both in school and out."
        },
        {
            "heading": 3,
            "text": "Are disposable vapes being banned?"
        },
        {
            "text": "Yes, the sale and supply of disposable vapes is being banned in England, Scotland and Wales because of their appeal to young people. Northern Ireland will also consider introducing this in future."
        },
        {
            "text": "Alongside this, to make vapes less attractive to children, we're strengthening the regulation of vape flavours, packaging and how they are displayed in shops."
        },
        {
            "text": "To crack down on underage sales, trading standards officers will have the power to issue an ‘on the spot’ fine of up to £100 when they spot the sale of tobacco and vapes to children in England and Wales."
        },
        {
            "text": "The ban is being introduced after a public consultation on smoking and vaping showed nearly 70 percent of respondents including parents, teachers, healthcare professionals were in favour of the measure."
        },
        {
            "text": "Adults will still have access to non-disposable vapes to help them to stop smoking."
        },
        {
            "heading": 3,
            "text": "When will the disposable vape ban begin?"
        },
        {
            "text": "We aim to bring in legislation to ban disposable vapes as soon as possible."
        },
        {
            "text": "Any legislation will allow for a buffer period of at least 6 months, to allow businesses to adapt."
        },
        {
            "heading": 3,
            "text": "What action are you taking to stop young people smoking?"
        },
        {
            "text": "It will soon be illegal to sell tobacco products to anyone born on or after 1 January 2009."
        },
        {
            "text": "The measures, which we announced in October, means that children turning 15 this year or younger can never legally be sold tobacco."
        },
        {
            "text": "Stopping young people from ever starting to smoke will protect an entire generation from smoking harms as they grow up."
        },
        {
            "heading": 3,
            "text": "What are you doing to prevent vaping in schools?"
        },
        {
            "text": "Schools are legally required to have a behaviour policy that sets out what is expected of pupils, including what items are banned from school premises. Some schools have already banned vapes."
        },
        {
            "text": "In Relationships, Sex and Health Education (RSHE), pupils in primary and secondary school are taught the facts about legal and illegal harmful substances and their risks, including smoking, alcohol and drugs."
        },
        {
            "text": "We are currently reviewing the RSHE curriculum, including looking at strengthening content around smoking and vaping, and will launch a public consultation on a revised version as soon as possible."
        },
        {
            "text": "We have also published training resources for teachers, including one on drugs, alcohol and tobacco, which makes specific reference to e-cigarettes and vaping."
        }
    ]
}