{
    "url": "https://accessibility.blog.gov.uk/2024/01/29/government-communication-service-tips-to-deliver-better-british-sign-language-content/",
    "title": "Government Communication Service tips to deliver better British Sign Language content",
    "authors": [
        "Peter Serjent, Strategy and Planning Theme Lead, Government Communications Service"
    ],
    "categories": [
        "Access needs",
        "Accessibility",
        "BSL",
        "Content"
    ],
    "pub_date": "2024-01-29T09:40:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why produce BSL content? "
        },
        {
            "text": "Around 150,000 people in the UK use British Sign Language (BSL), over half of whom are Deaf. "
        },
        {
            "text": "The Royal National Institute for Deaf People (RNID) says ‘BSL involves a combination of hand shapes and movements, lip patterns, facial expressions and shoulder movements. It has its own grammar and is structured in a completely different way from English.’"
        },
        {
            "heading": 2,
            "text": "GCS publishes BSL guidance "
        },
        {
            "text": "The Government Communication Service (GCS) has published guidance on how to plan for and produce British Sign Language (BSL) content (GCS members only) where it is needed to meet the needs of Deaf BSL users. It has been written with the help of professionals and those with lived experience of British Sign Language. The GCS is the professional body for public service communicators working in government departments, agencies and arm’s length bodies. "
        },
        {
            "text": "The guidance includes what to consider when planning communications for Deaf BSL users, the different BSL options available, and what to consider when creating BSL content or when using interpreters. There are also important facts about deafness, BSL, background to the BSL Act 2022, additional resources, and case studies to bring the guidance to life. "
        },
        {
            "heading": 2,
            "text": "The British Sign Language Act 2022 requirement"
        },
        {
            "text": "The British Sign Language Act 2022 requires the government to report how ministerial departments are using BSL in communications with the public on policy and changes to the law. This includes plans, strategies, and consultation responses. The act also refers to press conferences, social media, and websites used to publicise government activities and policies. The act does not include Northern Ireland because equality law is devolved in Northern Ireland."
        },
        {
            "text": "There is no statutory requirement for all government communications to be translated into BSL. But, all government departments are expected to consider where the use of BSL will be of most interest and importance to Deaf BSL users."
        },
        {
            "heading": 2,
            "text": "Government’s first BSL report: room for improvement"
        },
        {
            "text": "In July 2023, the government published the first BSL report on how ministerial departments are using BSL. It showed pockets of good practice, but there is room for improvement. "
        },
        {
            "heading": 3,
            "text": "Examples of good practice"
        },
        {
            "text": "The Department for Work and Pensions (DWP) produced a BSL video on the Cost of Living Payments. Its YouTube channel has over 2,000 subscribers and almost 200 videos, covering topics from individual benefits to White Papers. "
        },
        {
            "text": "The Department for Education (DfE) produced BSL versions of its Special Education Needs and Disability consultation (500 views helping to achieve 6.000 responses) and Alternative Provision improvement plan (800 views at the launch). "
        },
        {
            "text": "The guidance includes further details on the DWP and DfE BSL approaches. "
        },
        {
            "text": "The Department for Culture Media and Sport (DCMS) produced a dedicated BSL explainer video about the Coronation of His Majesty the King, and how to get involved. It has currently attracted around 25,000 views across DCMS’ social media channels and 225,000 web page views. "
        },
        {
            "text": "The Ministry of Justice (MOJ) published BSL guides for victims of rape and sexual assault on GOV.UK. MOJ also produced BSL content for its social media channels to promote that Deaf people can now take part in jury service with a sign interpreter and advice in BSL for victims of rape and sexual assault. Across the social media channels, MoJ’s videos generated 60,000 impressions and 21,000 views."
        }
    ]
}