{
    "url": "https://mhrainspectorate.blog.gov.uk/2024/01/29/guidance-updates-on-to-how-to-notify-the-mhra-of-changes-to-the-pv-system/",
    "title": "Guidance updates on to how to notify the MHRA of changes to the PV System",
    "authors": [
        "Claire Longman"
    ],
    "categories": [
        "Good pharmacovigilance practice"
    ],
    "pub_date": "2024-01-29T18:36:32+00:00",
    "content": [
        {
            "text": "Amendments to the guidance on the MHRA website stipulating changes to the way updates to a MAH’s PV system should be notified to the MHRA have been published. The changes aim to make administration burden less for both MAHs and the Agency and do not require the submission of a Type IAIN variation any longer. The changes were made in May 2023 and further updates to the guidance have been made to provide clearer provisions in November 2023."
        },
        {
            "text": "Background"
        },
        {
            "text": "Marketing authorisation holders (MAH) for UK authorised products are required by law to keep the MHRA informed at all times of the details of the Pharmacovigilance (PV) system. This includes details of the UK Qualified Person for Pharmacovigilance (QPPV) and Pharmacovigilance System Master File (PSMF) UK location and number. These are submitted to the MHRA within the Summary of the Pharmacovigilance system (SPS) document."
        },
        {
            "text": "Statutory guidance, effective since 21 December 2020 within the Exceptions and modifications to the EU guidance on good pharmacovigilance practices that apply to UK MAHs and the MHRA - GOV.UK (www.gov.uk) and the MHRA website stated changes must be submitted to the MHRA via a Type IAIN variation within 14 days of the change."
        },
        {
            "text": "What is the new process for notifying the MHRA with changes to the PV system?"
        },
        {
            "text": "Where changes to the PV system have been made but the UK PSMF number remains the same"
        },
        {
            "text": "Where changes to the SPS have been made, a Type IAIN variation will no longer be required to be submitted to notify the MHRA in respect to the following:"
        },
        {
            "text": "Instead, an SPS update notification covering the affected product licenses (PL), needs to be submitted to register these changes. There will be no fee associated with these notifications. SPS update notifications will be processed by the MHRA within 30 days of the receipt of the notice."
        },
        {
            "text": "How to make a SPS Update notification"
        },
        {
            "text": "All notifications to update the SPS should be submitted via the MHRA Submissions Portal. The following documents will need to be supplied:"
        },
        {
            "text": "It is important to note that the notification for changes can only be processed by the MHRA if all the documents listed above are provided within the portal. A letter of acceptance will be issued once the changes have been made to our system."
        },
        {
            "text": "Changes to the PSMF number "
        },
        {
            "text": "If you have a change to the PSMF number for product licenses due to Change of Ownership (COA). This will not be able to be submitted via this simplified route and may instead be submitted either as part of the COA application or as a Type IAIN variation within 14 days of the COA being granted. Information referring to the changes to UK QPPV details and UK location of the UK PSMF can be submitted within this process."
        },
        {
            "text": "If there is a change to the UK PSMF number for PLs for any other reason or after 14 days after the COA grant, these will also need to be submitted as a Type IAIN variation within 14 days of the change taking effect."
        },
        {
            "text": "Changes to guidance"
        },
        {
            "text": "These changes came into effect on 11 May 2023 and have been updated on 17 November 2023."
        },
        {
            "text": "Although changes have been made to the MHRA webpage, Guidance on qualified person responsible for pharmacovigilance (QPPV) including pharmacovigilance system master files (PSMF) - GOV.UK (www.gov.uk) updates are not currently reflected within the Exceptions and modifications document. Updates to this document will be made in due course."
        },
        {
            "text": "It is important to note that there have been no changes made to the way MAHs should request PSMF numbers or submit applications for marketing authorisations. "
        }
    ]
}