{
    "url": "https://gds.blog.gov.uk/2024/01/29/how-we-are-improving-gov-uk-pay-with-user-satisfaction-feedback/",
    "title": "How we are improving GOV.UK Pay with user satisfaction feedback",
    "authors": [
        "Nadia Mugeni, Senior User Researcher, GDS"
    ],
    "categories": [
        "GOV.UK Pay"
    ],
    "pub_date": "2024-01-29T11:07:17+00:00",
    "content": [
        {
            "text": "GOV.UK Pay has grown every year since launching in 2016. 2023 has been our biggest year yet with 364 public sector organisations currently using Pay to take payments for 960 different services, an increase of 21%."
        },
        {
            "text": "The Pay customer satisfaction survey is one of the ways that we get feedback from Pay users, ensuring that we continue to deliver for the needs of diverse organisations and services that use Pay. "
        },
        {
            "text": "This survey allows us to collect quantitative data from a large group of people. We ask a range of different questions to understand how our public sector users feel about the different features available on Pay, and where we could improve. "
        },
        {
            "text": "In the questions, users are asked to rank the benefits of Pay and to score how satisfied they are with different features on a Likert-type scale. "
        },
        {
            "text": "In 2022 the survey was sent to 1,000 Pay public sector users who had logged in to the Pay admin tool at least five times in the last 12 months. We decided to widen the pool of people in 2023,  sending to public sector users who had logged in at least once in the last 12 months;  a total of 3,444 Pay users. "
        },
        {
            "heading": 2,
            "text": "Findings"
        },
        {
            "text": "We saw an increase in satisfaction for the majority of categories in 2023 compared to 2022. "
        },
        {
            "text": "Overall, 88% of respondents said they are satisfied with Pay,  a 2.7% increase from 2022. "
        },
        {
            "text": "Satisfaction with Pay’s 24/7 support increased from 72% in 2022 to 75% in 2023. Users said that the 24/7 email support is prompt and comprehensive, with one user from His Majesty's Passport Office stating: "
        },
        {
            "text": "The satisfaction levels for reconciliation increased by 17% from 2022 to 2023. The main theme for the high levels of satisfaction is the ease of use for reconciliation “Easy to use, simple to reconcile”."
        },
        {
            "text": "Some of the main benefits users were satisfied with included: "
        },
        {
            "text": "In the 2022 survey, 50% of people told Pay that they wanted a pay-by-bank feature where customers can pay directly from their bank account. In response, we started a discovery in 2023 into how we can offer pay-by-bank."
        },
        {
            "text": "46% of people surveyed in 2023 told us that they wanted to see an increase in the number of paying users that complete their payment. We are making improvements to the design of the payment journey to address this and these changes should be released soon."
        },
        {
            "text": "We also know from both the 2022 and 2023 surveys that Pay users want to see improvements in the reporting options available—in 2022 users told us that they wanted more detailed and auto-generated reports. “Ad hoc reporting is very good, but daily reports should be system generated, not user-generated”. We are exploring how we can do this. In 2023, 30% of users surveyed wanted to reduce the time it takes to reconcile payments."
        },
        {
            "text": "Some of our users also told us that they are not aware of new and existing Pay features, so we will be engaging with them to  ensure we advertise Pay’s features more regularly."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We will combine the findings from other user feedback sources such as support requests, user research and analytical data to prioritise improvements that we want to make on Pay."
        }
    ]
}