{
    "url": "https://onsdigital.blog.gov.uk/2024/01/29/our-business-analyst-development-programme-what-a-difference-a-year-makes/",
    "title": "Our Business Analyst development programme - what a difference a year makes",
    "authors": [
        "jodiestephens"
    ],
    "categories": [
        "Business analysis",
        "Digital and Data Academy",
        "ONS digital people",
        "People and skills"
    ],
    "pub_date": "2024-01-29T16:13:26+00:00",
    "content": [
        {
            "text": "In December 2022, ONS welcomed 11 new Executive Officer (EO) Business Analysts through our Business Analyst Development Programme and we published a blog last year covering details of the programme."
        },
        {
            "text": "One year on, I thought it'd be a good opportunity to share their incredible development following two, six-month placements and as they start their third and final placement."
        },
        {
            "heading": 2,
            "text": "Placements"
        },
        {
            "text": "A wide range of placements have been available, ranging from business-as-usual teams, discoveries, alphas and product teams. Providing huge opportunities in stakeholder management, requirement elicitation, requirements management, business modelling, plus many more.  They've experienced different areas within the organisation and have gained valuable business context whilst building a strong network of working colleagues."
        },
        {
            "text": "They have all been active members of their teams, carrying out presentations, facilitating meetings, workshops and team events while producing business analysis outputs, adding massive value to each team they’ve been with. All placements have been so grateful to have them in their teams."
        },
        {
            "heading": 2,
            "text": "Presentations"
        },
        {
            "text": "At the end of each placement, they presented their experiences, what they learnt, the work they've been involved in and their desires for the next placement.  Audiences started small, growing each time;  enabling a safe place to practice presentation skills whilst displaying the development they are achieving."
        },
        {
            "text": "I've been so very impressed with how much they've grown. From reserved, slightly nervous people to confident, strong and passionate about the work of a business analyst."
        },
        {
            "heading": 2,
            "text": "Training & learning"
        },
        {
            "text": "They have all taken two modules of the BCS International Diploma in Business Analysis with impressive results, bringing them halfway to completing the recognised qualification.  Nothing can beat on the job learning though - working alongside different experienced BAs and having a dedicated buddy, they have gained a wealth of knowledge and experience."
        },
        {
            "heading": 2,
            "text": "Problem based learning"
        },
        {
            "text": "As another aid to development, we trialled ‘problem based learning’, where they worked in small groups to solve a real-world problem. This provided the opportunity to strengthen their teamwork, communication and research skills, alongside sharpening critical thinking and problem-solving abilities.  The results of this approach were impressive, with innovative deliverables created and learning experiences for everyone involved - not only for them, but for me as well. This approach was presented at a South Wales BA community event and received outstanding feedback."
        },
        {
            "heading": 2,
            "text": "Feedback"
        },
        {
            "text": "We've had lots of positive comments and praise from everyone who has either worked alongside or been involved in an aspect of this development programme.  They have far surpassed the development that I imagined and are adding huge value to the teams they are working in - indeed 3 of the original 11 have been successful in either permanent or temporary promotions."
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "I believe they all have huge potential, and I can’t wait to see where their careers take them.  With the amazing results this scheme has produced, we are keen to do this again.  Learning from the experiences of doing it the first time, I’m sure we can make it even better."
        },
        {
            "text": "My sincere thanks goes to those who supported this scheme as they have been instrumental in such a positive outcome.  I feel proud indeed to be part of this community."
        }
    ]
}