{
    "url": "https://defrafarming.blog.gov.uk/2024/01/29/restoring-the-river-axe-a-landscape-recovery-spotlight/",
    "title": "Restoring the River Axe: a Landscape Recovery spotlight",
    "authors": [
        "Alasdair Moffett"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2024-01-29T12:57:41+00:00",
    "content": [
        {
            "text": "Flowing through Dorset, Somerset and Devon, the 35 kilometre-long River Axe is an ecologically diverse river. Its name derives from the Celtic, meaning ‘abounding in fish’. "
        },
        {
            "text": "The river is a lifeline to the people, animals and plants in the area and is a river environment modified by centuries of human activity. That said, it still retains many of its natural geomorphological and important ecological features. "
        },
        {
            "text": "It is a river of national significance, as both a Special Area of Conservation (SAC) and a Site of Special Scientific Interest (SSSI). "
        },
        {
            "text": "The designation cites the river habitat as a good example of active lowland river types, supporting a wide variety of plant, fish and invertebrate communities and species, including water crowfoot, sea lamprey, salmon, bullhead and otter. "
        },
        {
            "text": "But, in recent decades, we’ve seen a decline in health of both the water and on the land neighbouring the river. General soil health and biodiversity on the riparian land has declined, resulting in the build-up of sediment pollution and more nutrients being leached into the water. "
        },
        {
            "text": "This is where we – the Upper Axe Landscape Recovery Project team – saw an opportunity for action. "
        },
        {
            "text": "Our project is working with 32 farmers and landowners to improve the condition of the Upper Axe across 2,777 hectares of land. "
        },
        {
            "text": "Restoring habitats in the upper reaches of the river will also benefit the condition of the SSSI further downstream. "
        },
        {
            "text": "Just over a year ago, we were awarded project development funding from Defra, through Landscape Recovery to establish a plan to reduce pollution, restore nature and reconnect the Axe with its floodplain.  "
        },
        {
            "text": "Farmers are central to our plans to reverse this decline in nature both in the river and on the surrounding land. We want to work alongside farmers, using their knowledge of the land they farm to create both economic and environmental resilience within their farm businesses."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Collaboration  "
        },
        {
            "text": "Nature doesn’t conform to man-made borders, so it’s important that if we want to bring about significant change, we work together. "
        },
        {
            "text": "In 2022, we formed the Upper Axe Landscape Partnership Community Interest Company (CIC) to pave the journey ahead for the project, while also establishing strong partnerships between all the stakeholders involved, including: "
        },
        {
            "text": "Our collaborative approach is essential to the success of the project. Creating a holistic strategy for land use and taking into consideration all the needs of the land will give us the best possible chance of success. "
        },
        {
            "text": "Only by working alongside farmers can we realise the potential for the public to view farms and food production as part of the solution to biodiversity loss, greenhouse gas emissions and climate change.  "
        },
        {
            "text": "Productive agriculture, the natural environment and a will to counter climate change can co-exist!"
        },
        {
            "heading": 2,
            "text": "Our vision for the future  "
        },
        {
            "text": "In the Axe catchment and across the south-west, the soil has a high clay content. Soil with a high clay content is much more easily compacted and, as a result, can’t hold as much rainwater as other soil types. This leads to more surface-water runoff and more flooding. "
        },
        {
            "text": "Our project seeks to modify farm practices across the project area to improve soil structure to reduce runoff and improving the overall quality of the soil. We are looking to introduce minimum till techniques, exploring options to undersow arable crops and plant herbal leys to replace maize. "
        },
        {
            "text": "Biologically active soil is the foundation for a sustainable and economic farm. Active management of the soil will improve both its quality and its ability to sequester carbon. "
        },
        {
            "text": "There is a will from the farmers to improve the soil quality as the outcomes are cross cutting, with mutual benefits for people, plants, animals and the planet. "
        },
        {
            "text": "Alongside improvements to the soil, our project will improve and create biodiverse habitats (in and out the water) through tree planting and river channel restoration and reconnect the river to its floodplain to provide long-term flooding mitigation to towns downstream."
        },
        {
            "text": "River banks in the Axe catchment have been de-stabilised by the non-native plant species Himalayan Balsam. Our project will also explore options to stabilise the banks of the rivers where appropriate, to reduce the amount of sediment being moved downstream into the SSSI. "
        },
        {
            "text": "Along the river corridor, there will be the maintenance of controlled cattle grazing, contributing to a healthy river ecosystem and food production. "
        },
        {
            "text": "There will be a substantial tree planting scheme. We are focused on putting the right trees in the right places. This will: "
        },
        {
            "text": "We will couple tree planting with hedgerow planting and maintenance right across the project area.  "
        },
        {
            "text": "As advocates of a circular economy, we are looking to minimise waste from hedgerow maintenance as much as possible. We will take hedging products from in the catchment to make leaky dams; creating new habitats within the stream for the aquatic residents of the Axe. "
        },
        {
            "text": "Our project will also begin to engage further with the local community with the creation of the Upper Axe River trail. We want to encourage school groups and families to use the trail, so will provide educational resources accessible through QR codes.  "
        },
        {
            "text": "The project will also provide funding to turn a derelict barn into a new teaching space. This space is intended for the community, allowing an exchange of knowledge between farmers, but also making farming and the countryside more accessible for schools. At the moment, 4 farms in the catchment are already taking part in school visits and we want to build on their fantastic work. "
        },
        {
            "text": "We also want to create opportunities for volunteering, bringing together children and adults from deprived local communities. Our project aims to be an inspiring programme of environmental change that the whole community can get behind. "
        },
        {
            "text": "Pragmatic monitoring approaches will be used throughout the project, allowing each farm to assess their progress at regular intervals to see if they are moving in the right direction and, if needed, help inform and adapt their actions.  "
        },
        {
            "text": "Last month, we welcomed Environment Minister Rebecca Pow to our project to find out more about our vision for the River Axe. Defra just posted a video of her visit on X."
        },
        {
            "heading": 2,
            "text": "Laying groundwork "
        },
        {
            "text": "This project is long-term with a minimum length of 20 years. With long term aims comes long term rewards. Projects like these lay the groundwork and ensure more environmental and food security for future generations – not just immediate rewards. "
        },
        {
            "text": "We want to encourage generational changes towards economic and environmental resilience for the farmers, the environment and locals. "
        },
        {
            "text": "We are currently in the development phase where we are finalising our plans for the changes that are required. We are also finalising our plans for monitoring the success of our project. We need to constantly evaluate our environmental and social outcomes to determine the success of our efforts. "
        },
        {
            "text": "If you have any comments on our work, leave them below or visit our website. I'll include links for you to learn more below."
        }
    ]
}