{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/29/rpas-strong-performance-helps-farmers-and-rural-businesses-across-the-country-2/",
    "title": "RPA’s strong performance helps farmers and rural businesses across the country",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition"
    ],
    "pub_date": "2024-01-29T14:53:57+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Farmers and rural businesses across the country have been once again helped by a strong performance from the Rural Payments Agency (RPA) in all its services across 2023."
        },
        {
            "heading": 2,
            "text": "Ensuring consistent financial support for farmers "
        },
        {
            "text": "Throughout 2023, RPA has continued to support farmers to run productive businesses, that deliver positive environmental outcomes and ensure sustainable food production for the nation. This year has seen rising costs for farmers, as a result of global challenges and RPA has been working hard to ensure a consistent cashflow to support agricultural businesses."
        },
        {
            "text": "By the start of December, just over 97% of farmers had received their balance Basic Payment Scheme (BPS) payment, building on the advance payments made in August 2023. This means, by the end of 2023, the total amount paid to farmers across the BPS, Countryside Stewardship (CS) and Environmental Stewardship (ES) revenue schemes in 2023 came to approximately £1.2 billion, with over 91,000 applications and claims processed. This final BPS payment marks the closure of this scheme, with delinked payments replacing BPS in England this year and running until the end of 2027, ensuring financial support remains consistent while more businesses are encouraged to enter the environmental land management schemes."
        },
        {
            "text": "The evolution of Countryside Stewardship (CS) is a vital part of agricultural transition rewarding farmers and land managers for maintaining and enhancing nature. The application windows for higher tier and mid-tier and wildlife offer CS agreements were open during 2023, with RPA processing agreements which started on 1 January 2024. This saw an increase in interest from farmers and land managers across England. RPA has also been processing capital grant applications throughout 2023 which has helped, for instance, increase the planting and maintenance of hedgerows."
        },
        {
            "text": "A seventh round of the Countryside Stewardship Facilitation Fund and opening of the eighth round in October 2023 helped farmers and land managers work together to amplify the environmental outcomes they are achieving."
        },
        {
            "text": "From the start of 2023, increased payments were made through CS, alongside an expanded range of options, an average increase of 10 per cent to the revenue payment rates, and an increase to the majority of one-off capital payments for specific environmental actions – resulting in farmers being paid even more for taking action to protect the environment."
        },
        {
            "text": "RPA has also delivered the 2023 offer for the Sustainable Farming Incentive (SFI) scheme, for which advance payments worth 25% of the agreement’s annual value were issued to applicants with a live agreement before the end of 2023, to improve cashflow to businesses when needed most. A total of just under 2,200 rural businesses had received advance payments by the end of 2023, with a total value of just under £8 million."
        },
        {
            "text": "The straightforward application process, a rolling application window so farmers can apply at a time that suits them and the provision of quarterly payments for better cashflow have all been well received. All the information on the Sustainable Farming Incentive can be found on gov.uk."
        },
        {
            "text": "The 2023 offer has been expanded and made more flexible in response to farmer feedback with over 23 paid-for actions now on offer, including improving hedgerows, nutrient management, farmland wildlife and low input grassland. Other improvements mean that farmers can choose what combination of actions are right for them – unlike previously where actions were grouped into standards."
        },
        {
            "heading": 2,
            "text": "Visits"
        },
        {
            "text": "RPA has also started to introduce a more supportive, partnership-based approach to visits, moving away from the penalty-based system under the EU, to farmer-focused visits for schemes such as SFI and CS."
        },
        {
            "text": "Field Officers are a source of advice and guidance on holdings as well as remotely, supporting farmers, livestock and landowners with the delivery of their agreements. RPA Field Officers will continue to carry out visits to measure compliance with scheme controls and to ensure the requirements of the scheme are being met. However, with the aim of increasing the support for farmers, Field Officers will offer greater levels of advice, guidance and signposting during these visits to help farmers get the most out of their agreements, improving compliance with standards and scheme requirements and achieving better outcomes."
        },
        {
            "text": "Going forwards, RPA’s advice and guidance activity will also increase as it works with farmers and land managers to help them prevent issues before they arise or, where this isn’t possible, to minimise the impact of any issues at an early stage to help secure the outcomes of their agreements prior to measuring compliance with scheme controls."
        },
        {
            "text": "RPA has delivered a number of other schemes, services and improvements across 2023:"
        },
        {
            "heading": 3,
            "text": "Grants "
        },
        {
            "text": "RPA has continued to administer a wide range of grants throughout 2023, available to support farmers to develop their businesses by addressing one-off investments, making sure that production can go ahead in the most efficient way and continue adapting for the future."
        },
        {
            "text": "Under the Farming Investment Fund, RPA invited applications for five Farming Transformation Fund themes (FTF): Calf Housing for Health and Welfare, Slurry Infrastructure, Adding Value, Water Management and Improving Farm Productivity. A total of £22.8m has been awarded to agricultural businesses in 2023 through the FTF."
        },
        {
            "text": "RPA has made £31.2m payments in 2023 under the Farming Equipment and Technology Fund, which has provided investment towards specific items of equipment to improve productivity and slurry, as well as Animal Health and Welfare. Further opportunities to apply to this fund will be available in 2024."
        },
        {
            "heading": 3,
            "text": "Improving the mapping experience for farmers"
        },
        {
            "text": "Throughout 2023, as part of its commitment to improve the mapping experience for farmers, RPA has made further improvements to the RLE1 mapping process used by farmers and land agents to update land data, land links and entitlements. RPA also increased the use of geospatial data to reduce the visit burden."
        },
        {
            "text": "RPA has also just launched a new service called Rural Land Changes which can be used to request the changes to maps currently done with an RLE1 form."
        },
        {
            "text": "The Rural Land Changes service will replace the current RLE1 form and can be used to add new land, merge parcels, alter land cover or make more complex changes and enable farmers to quickly inform RPA of mapping changes ahead of application, allowing farmers to begin applications sooner and improve accuracy."
        },
        {
            "heading": 3,
            "text": " New data products available "
        },
        {
            "text": "During 2023 RPA made a number of new and existing spatial data products publicly available, which can be used by organisations and businesses to support the agricultural economy and research in the industry. Products that have been made available so far this year include Parcel point data; Less Favoured Areas (LFA) & Moorland Line dataset and Registered Common Land layer. All available datasets are hosted on the Defra Data Services Platform and regularly updated."
        },
        {
            "text": "Areas of industry that can make use of these datasets are universities, farmers and landowners with a specific interest in common land, as well as agri-tech companies providing geospatial solutions to farmers and the agriculture industry as well as national parks, wildlife organisations, property developers, land planners and companies or researchers concerned with natural capital or ecosystem service assessments and modelling."
        },
        {
            "heading": 3,
            "text": "BCMS 25 year anniversary"
        },
        {
            "text": "In September 2023 RPA celebrated 25 years of the British Cattle Movement Service (BCMS), which maintains the Cattle Tracing System, used by animal keepers to report the births, deaths and movements of their bovine animals."
        },
        {
            "text": " The services provided at BCMS make it possible to check which animals are present on a keeper’s holding, where an animal has been during its life, trace animals exposed to a disease risk and provide assurances to buyers about an animal’s life history. This all plays a key role in livestock traceability, disease control and maintaining consumer confidence in beef and its origin."
        },
        {
            "text": "Recently, the Livestock Information Service (LIS) sheep bureau moved into RPA. Working with Livestock Information Ltd RPA will now manage the movement traceability for sheep, goats, and deer for England, alongside existing cattle services. There will also be the ability for farmers to access and utilise the data for their own business purposes."
        },
        {
            "heading": 3,
            "text": "Web chat pilot"
        },
        {
            "text": "RPA has trialled a live web chat service, providing an additional contact route for users of the British Cattle Movement Service (BCMS), English livestock service and Pet Travel helpline."
        },
        {
            "text": "RPA will review how the live web chat service is being used and how effective it is in helping users find the information they need and then decide on the future of the new web chat tool and if it can be made available for other services."
        },
        {
            "text": "RPA will use all customer feedback from the web chat pilot, as well as other customer service channels, to continue to improve its services."
        },
        {
            "heading": 3,
            "text": "Roundtables and shows "
        },
        {
            "text": "In 2023 RPA engaged with more farmers and rural communities than ever before; listening, taking onboard feedback, sharing information on its schemes and services and offering support to those navigating agricultural transition. RPA attended 48 national and regional shows and events supported by around 100 RPA staff ‘ambassadors’, built relationships with local groups and hosted 17 roundtables across England with Members of Parliament and their constituents. RPA’s Research and Insight Network Group is an interactive panel of farmers, agents and rural businesses who take part in RPA and Defra customer research activities. Members have participated in over 40 research opportunities including surveys, user research and focus groups. In 2024 RPA aims to be even more visible and will continue to offer opportunities for rural communities to engage on the things that matter to them, supporting them to grow and thrive."
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, check out RPA News which is sent to all farmers, landowners and land agents via email, sign up to our blog and follow us on social media:"
        },
        {
            "text": "You can also listen to The RPA Podcast to keep up to date with the latest news from RPA."
        },
        {
            "text": "If you need to submit a query to RPA, you can use the online query form in the Rural Payments service. Follow the steps in the video guidance on how to submit questions and receive answers from RPA all in one place in the Rural Payments service."
        }
    ]
}