{
    "url": "https://rpc.blog.gov.uk/2024/01/29/rpc-holds-launch-event-for-the-better-regulation-framework/",
    "title": "RPC holds launch event for the Better Regulation Framework",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-01-29T11:22:08+00:00",
    "content": [
        {
            "text": "The Regulatory Policy Committee held an event at the House of Lords on Wednesday 24th January to promote the new Better Regulation Framework and the RPC’s role in it. Around 150 stakeholders from across Whitehall, the business community, civil society organisations, Parliamentarians and regulators attended."
        },
        {
            "text": "There were speeches from Lord Dominic Johnson (the RPC’s sponsoring minister), Stephen Gibson (RPC Chair), the Earl of Lindsay and Jon Geldart (Director-General of the Institute of Directors). All gave their support to the changes to the Framework and the RPC’s role as the independent scrutiny body within it."
        },
        {
            "text": "Stephen described how the RPC was supportive of the new Framework’s move to scrutiny at an earlier stage in the policy development process (so that RPC opinions can inform the choice of policy option), and also the move to consideration of a wider range of impacts in the scrutiny process (including the impact on households and the environment), so that policy choices are better informed by the consequences of different options. He flagged the need for the full support of ministers to make the Framework work and reiterated his concerns over Impact Assessments that the RPC has received that have been late, not fit for purpose, or have had sections that are weak or very weak. He also pointed out the poor performance of Departments in completing Post-Implementation Reviews of existing regulations and hoped that the new Framework, with its greater focus on evaluation would help to address this problem. He highlighted the high regard that the UK regulatory system is held in internationally and hoped that with the support of the stakeholders in the room, we could build on that strong base to ensure that the Framework works effectively for businesses, households and the economy in general."
        },
        {
            "text": "Aside from the speeches, attendees enjoyed the opportunity of networking and refreshing connections between interested parties who together ensure that the UK regulatory system is best able to serve society."
        }
    ]
}