{
    "url": "https://defrafarming.blog.gov.uk/2024/01/29/spotlight-on-new-sfi-actions-for-arable-and-horticulture-farmers/",
    "title": "Spotlight on new actions for arable and horticulture farmers",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-29T15:46:05+00:00",
    "content": [
        {
            "text": "At the beginning of the month, we published a post which summarised the recent Agricultural Transition Plan update. The update includes the full range of new and improved actions plus the payment rates available this year. "
        },
        {
            "text": "Following the update, we said we'd set out the new offer for each farm type in a series of posts. The focus of this post is the offer for arable and horticultural farmers.  "
        },
        {
            "text": "We’ll publish a post giving a full overview of the current offer for horticultural farmers tomorrow, so subscribe to the Farming blog for a notification as soon as it’s live. "
        },
        {
            "heading": 2,
            "text": "An offer that works for you"
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the 23 actions on offer. By waiting for the new actions coming in summer, you could be losing out on funding. If you apply now, you'll be able to add actions to your agreement annually — or have multiple agreements when the further actions are available — if you'd like to carry out further actions. "
        },
        {
            "text": "We have a strong existing offer for the arable and horticulture sector across our environmental land management schemes. We have strengthened this by increasing the choice available and improving existing actions. This includes the brand-new actions we are introducing on precision farming and for soil. These will be available in the combined Sustainable Farming Incentive (SFI) and Countryside Stewardship offer.  "
        },
        {
            "text": "A recap on the combined offer: we currently have separate SFI and CS Mid and Higher Tier schemes which offer different types of actions and agreements. We plan to offer most SFI and CS Mid Tier actions through a single application service in 2024, rather than having separate application windows and processes. We also plan to remove duplication between SFI and CS Mid Tier actions wherever possible. "
        },
        {
            "heading": 2,
            "text": "New precision farming actions   "
        },
        {
            "text": "Precision farming involves using technology to target crop inputs in response to variations within a field. "
        },
        {
            "text": "This can: "
        },
        {
            "text": "We are introducing 4 new actions to incentivise using precision farming approaches. "
        },
        {
            "text": "By offering payments which support agricultural technology, such as robotic mechanical weeding technology, in addition to launching more grants in 2024 we are helping farmers adopt new technology or practices so they can improve their productivity while benefitting the environment and have more resilient businesses.  "
        },
        {
            "text": "When developing the new actions, we discussed the proposals with industry experts, including the Agri-Epi centre, manufacturers, developers and farmers. We also spoke to the major providers of precision farming services/analysis, major agronomy groups and main stakeholders."
        },
        {
            "text": "More accurate application of fertilisers or manures reduces over-application of nutrients while optimising yield, benefitting water and air quality as well as contributing to net zero targets.  "
        },
        {
            "text": "You may also be able to apply for capital items under the Farm Equipment and Technology Fund (FETF) to help you buy precision farming equipment. "
        },
        {
            "heading": 3,
            "text": "The full list of Precision Farming actions"
        },
        {
            "heading": 2,
            "text": "New soil actions "
        },
        {
            "text": "The actions for soils are focused on improving soil health, structure, organic matter and biology.   "
        },
        {
            "text": "This can: "
        },
        {
            "text": "We are improving the existing offer by introducing new actions for no-till farming and multi-species spring/summer and summer/autumn cover crops as below."
        },
        {
            "text": "The new actions were developed with input from internal and external stakeholders including farmers and agricultural organisations.  "
        },
        {
            "text": "In addition to the above soil actions we are also improving our existing offer for protecting lowland peat and adding new actions. We recognise that many farmers face challenges in achieving the existing lowland peat offers for raising water levels, we are introducing new, more accessible options to better enable farmers to raise their water table in their peat soils to more achievable levels. "
        },
        {
            "heading": 2,
            "text": "Webinars: learn more about our offer"
        },
        {
            "text": "We’ll post the recordings on the blog once they’re over.  "
        },
        {
            "text": "You can also take a look at the full list of actions available in the combined Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS) offer in the Technical Annex to the ATP.  "
        },
        {
            "text": "Finally, if you have any questions about our work, do leave a comment below. "
        }
    ]
}