{
    "url": "https://educationhub.blog.gov.uk/2024/01/29/transforming-childrens-social-care/",
    "title": "How we’re transforming children’s social care",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Child protection",
        "children in care"
    ],
    "pub_date": "2024-01-29T10:57:10+00:00",
    "content": [
        {
            "text": "Children’s social care supports children, young people and families who need additional help to protect children and young people from harm.  "
        },
        {
            "text": "Its main aim is to keep families together, but when this isn’t possible, the system provides an alternative home to children and young people. But we know that these services can be improved.  "
        },
        {
            "text": "This is why we’re investing £200 million by 2025 to test the best ways to drive improvement, following recommendations from a series of reviews published in 2022. You can read more about our aims in our Stable Homes, Built on Love strategy.  "
        },
        {
            "text": "Here we explain more about the progress we’ve made so far. "
        },
        {
            "heading": 3,
            "text": "Working with children, young people and families  "
        },
        {
            "text": "We want to know we are getting it right for all children, young people and families no matter where they live or who they live with.  "
        },
        {
            "text": "This means we need to be better at understanding what is working and what isn’t by listening to children, young people and families much more and taking on board their views.  "
        },
        {
            "text": "Over the course of 2023, we worked alongside children’s charities Barnardo’s and Coram Voice who have run a series of workshops that gave young people an opportunity to feed their views directly into work underway to reform children’s social care.  "
        },
        {
            "text": "We have also launched the DfE’s Children and Young People’s Advisory Board for Children’s Social Care which is made up of over 20 young people aged 11-25 from across England with a range of experiences of children’s social care.  "
        },
        {
            "text": "The aim of the board is for children and young people to share their views and opinions on progress and next steps, which we will use to make a tangible impact.  "
        },
        {
            "text": "We have also used ideas shared by children and young people to release an animation and illustrated guide to explain what the first Children’s Social Care National Framework means for them and how it puts their wishes at the heart of the children’s social care system. "
        },
        {
            "text": "The framework brings together, in one place for the first time, the principles and purpose of children’s social care, the enablers of good practice and the outcomes that should be achieved for children, young people and families to thrive. "
        },
        {
            "heading": 3,
            "text": "What else have we achieved in the last year? "
        },
        {
            "text": "We are investing in pathfinders and programmes which are trying out innovative new ways of working in children’s social care. We have launched a £45million programme known as the Families First for Children Pathfinder.  "
        },
        {
            "text": "This is testing new ways to help children stay with their families in safe and loving homes, by providing better, earlier and proactive support without making families jump through hoops..  "
        },
        {
            "text": "If children can’t live with their parents, they should live with someone they already know, love and trust, if it is possible and safe. This is called kinship care. "
        },
        {
            "text": "We’ve invested a further £20 million to directly improve the lives and experiences of kinship families through the first ever National Kinship Care Strategy. "
        },
        {
            "text": "The strategy announced that we would test the introduction of a financial allowance for kinship carers in some local areas and that we would expand the role of virtual school heads – education champions within local authorities – to cover those children in kinship care. "
        },
        {
            "text": "We’re also focussed on removing some of the financial barriers facing care leavers, by increasing the leaving care allowance from £2,000 to £3,000, and the care leaver’s apprenticeships bursary from £1,000 to £3,000.  "
        },
        {
            "text": "This is on top of the £53 million we’re already investing to increase the number of young people leaving residential care to receive practical help with move-on accommodation through the Staying Close programme.   "
        },
        {
            "text": " We have also started to invest £36 million to recruit and retain more foster carers across the country – the largest amount ever allocated to this type of work in England. We launched the first regional recruitment support hub and the region are also working to further roll out ‘Mockingbird’ - a support system for fostering families.  "
        },
        {
            "text": "On top of this, foster parents are being supported with above-inflation allowances for two years running. "
        },
        {
            "text": "Here are some examples of further progress we’ve made over the last year:  "
        },
        {
            "heading": 3,
            "text": " Looking ahead "
        },
        {
            "text": "While we have made lots of progress, we know there is more work to do over the course of this year and beyond.  "
        },
        {
            "text": "In 2025, we will review progress we have made and what extra changes we might need to make. This includes spreading the changes we have been developing to more local areas. We might also need to make changes to the law. "
        },
        {
            "text": "We will keep talking to children, young people and families as we continue to deliver our reform programme. We are determined to make a positive difference to the lives of children and families all across the country.  "
        }
    ]
}