{
    "url": "https://teaching.blog.gov.uk/2024/01/29/use-the-national-tutoring-programme-to-prepare-your-pupils-for-exams/",
    "title": "Use the National Tutoring Programme to prepare your pupils for exams",
    "authors": [
        "Martin Leslie"
    ],
    "categories": [
        "Attendance"
    ],
    "pub_date": "2024-01-29T11:30:05+00:00",
    "content": [
        {
            "text": "Like other schools, Hall Mead School in Havering saw their attainment begin to fall following the Covid-19 pandemic. Since then, they’ve been using small group tutoring through the National Tutoring Programme (NTP), and it’s proven to be effective in boosting pupils’ preparedness for exams."
        },
        {
            "text": "We asked assistant headteacher, Martin Leslie, how he, and other staff at Hall Mead, used tutoring to help pupils prepare for their GCSE exams."
        },
        {
            "text": "Why did you use tutoring to support exam preparation?"
        },
        {
            "text": "We had some pupils who were looking like they wouldn’t achieve 4s in their GCSEs and so we were committed to ensure that they did achieve at least this standard pass mark."
        },
        {
            "text": "We had seen clear evidence of the impact tutoring had on pupils in our school previously, so were keen to use tutoring to support and enhance exam preparation."
        },
        {
            "text": "How did you tailor tutoring to meet pupil needs?"
        },
        {
            "text": "Our NTP tuition partner, MyTutor, helped significantly in allowing us to meet individual pupil needs."
        },
        {
            "text": "Setting up pupils on their online system was really straightforward, allowing leaders to see how pupils were progressing in real-time. It was easy to extrapolate content lists and topics pupils needed to learn about. MyTutor then used this information to inform the content and delivery of each session. This has simplified our interactions and reduced administrative burden for our staff."
        },
        {
            "text": "The tutors, who have all been excellent to work with, communicated with us regularly to discuss how the content of sessions might need to be adapted to meet individual needs."
        },
        {
            "text": "What was the impact of the sessions?"
        },
        {
            "text": "We monitored progress on a weekly basis, as well as looking at our exam results, which showed improvements for pupils who received tutoring."
        },
        {
            "text": "We also observed increased confidence and motivation, as well as hearing positive feedback anecdotally from pupils around school. This included some of our disadvantaged pupils being excited about their sessions and openly telling their friends they’ve ‘got tuition after school’."
        },
        {
            "text": "GCSE success for Jack"
        },
        {
            "text": "Jack, a pupil predicted 2s and 3s in his GCSEs, made a remarkable transformation through NTP. He keenly participated in English and maths sessions after school, on Saturdays and in the holidays, attending all sessions without fail."
        },
        {
            "text": "By doing so, he was able to leave school with 4s across the board, improving by 2 grades in some subjects. This enabled Jack to secure his dream apprenticeship in London, with a fantastic salary, aged just 16."
        },
        {
            "text": "Without tutoring, Jack may have fallen short of his potential. Whilst we have many success stories, his journey stands out as one I take immense pride in."
        },
        {
            "text": "Jack shares his experience below:"
        },
        {
            "text": "“I was able to receive online tuition because of NTP funding. I received tutoring in both English and maths and this definitely helped me close the gap in my knowledge. I was predicted a 3 in both subjects but left with a 4. This helped me secure my apprenticeship and I am grateful to my school for providing this opportunity to ensure I was well prepared for GCSE examinations last summer”."
        },
        {
            "text": "Information and guidance"
        }
    ]
}