{
    "url": "https://defrafmp.blog.gov.uk/2024/09/30/beyond-publishing-key-actions-from-our-first-five-plans/",
    "title": "Beyond publishing: key actions from our first five plans",
    "authors": [
        "Delyth Dyne - Policy Advisor, Defra",
        "Jan Elliott - Policy Advisor, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2024-09-30T12:00:00+01:00",
    "content": [
        {
            "text": "Alongside the development of new fisheries management plans (FMPs), the first five of Defra’s published FMPs are being implemented. "
        },
        {
            "text": "We’ve started to implement the measures in the published plans. "
        },
        {
            "text": "Fisheries management measures in the plans have been grouped into short-, medium- and long-term actions.  "
        },
        {
            "text": "This means that implementation of measures will move at different speeds. The approach and actions taken may also vary depending on whether we need more evidence before making decisions, or whether more engagement or consultation, or both, are needed.  "
        },
        {
            "text": "We have been making progress.  "
        },
        {
            "text": "In the crab and lobster fisheries management plan (FMP) we proposed to increase the minimum conservation reference size (MCRS) for crawfish to 110mm.  In line with this, and following productive workshops with stakeholders, the Marine Management Organisation (MMO) introduced a licence condition in January 2024 to increase the MCRS for crawfish to 110mm in ICES area 7 (Crawfish_MCRS_one_pager.pdf (publishing.service.gov.uk).  "
        },
        {
            "text": "As part of the work to develop a Cuttlefish Action Plan as set out in the Channel demersal non-quota species FMP, the MMO held a stakeholder workshop in February to explore the key issues of the fishery. This was followed by coastal events in Newlyn, Brixham, Shoreham and Hastings. This plan will be published soon. "
        },
        {
            "text": "In line with recommendations in the Channel demersal non-quota species FMP, the MMO has also introduced new codes on the Catch Recording App to differentiate between species of octopus and cuttlefish to help gather evidence of catches. MMO have been working with the Cornish Fish Producers Organisation to produce flashcards to help with the identification process.  You can request a copy from your local MMO office.  "
        },
        {
            "text": "In April, Seafish led a workshop on the principles that should be applied for any whelk permit scheme as set out in whelk FMP. The outputs from the workshop are being considered and the next steps planned. "
        },
        {
            "text": "The Scallop Industry Consultation Group, the Whelk Management Group and the Crab Management Group are looking at representation across their membership.  Working with SICG, Defra has set up a ‘shadow’ group tasked with designing and developing the structure, role and membership of a future scallop implementation group which will work with Defra and the MMO to implement the king scallop FMP.  Seafish is developing similar models for the crab, lobster and whelk plans. "
        },
        {
            "text": "Maintaining the positive engagement that we've built with our stakeholders throughout the development phase of the fisheries management plans is essential as we move along with implementation. "
        },
        {
            "text": "Learn more about implementation of our plans in other blog posts- click implementation next to 'Tags' below to show all relevant posts.  "
        }
    ]
}