{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/30/gse-awards-2024-meet-the-winners/",
    "title": "GSE awards 2024 – meet the winners",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Engineering",
        "GSE Profession Updates",
        "Learning & Development",
        "Science",
        "Talent & Leadership"
    ],
    "pub_date": "2024-09-30T12:43:01+01:00",
    "content": [
        {
            "text": "The inaugural GSE awards were held at the GSE conference at the Science Museum on 18 September."
        },
        {
            "text": "The GSE awards were drawn up by a team of volunteers from across the GSE Profession, under the guidance of the GSE Profession Team, with input from wider GSE members."
        },
        {
            "text": "There are seven permanent awards given out each year, along with one unique award that changes theme annually.  This year’s theme was ‘Innovation’ to align with the theme of the GSE Conference, ‘An innovative public sector’. The GSE Profession are excited to announce this year’s award winners."
        },
        {
            "heading": 3,
            "text": "Use of science and engineering award"
        },
        {
            "heading": 4,
            "text": "Winner: Gemma Cripps, DEFRA"
        },
        {
            "text": "This award recognises those who use science or engineering in their day-to-day role for the benefit of others. Gemma identified a gap in supporting the UK fishing industry to meet Net Zero targets and adapt to climate change. She developed a Climate Change and Fisheries Work Plan, outlining baseline evidence, gaps, and pathways for scientific and policy advancements. Persuading senior colleagues to fund R&D projects, she commissioned and managed the work. Gemma conducted strategic systems mapping to show the plan’s benefits across marine and fisheries policy areas. She also fostered collaborations with other government departments to align evidence collection and policy development. Through her scientific expertise, Gemma led significant change in this policy area"
        },
        {
            "heading": 3,
            "text": "Collaboration for the furthering of science and engineering award"
        },
        {
            "heading": 4,
            "text": "Winners: Scottish Government, Scottish Raptor Study Group, North of England Raptor Forum, National Wildlife Crime Unit, The PAW Forensic Working Group, Lucy Webster, Sarah Underwood, Jenny Kaden, George Smith, Steve Downing, Steven Irvine, Gavin Ross and Kat Smith."
        },
        {
            "text": "This award recognises collaboration on specific pieces of work or projects for the benefit of furthering science and engineering. Since 2009, exports of Peregrine Falcons and their hybrids from the UK have surged a hundredfold, raising concerns about illegal theft of wild Peregrine young. The Wildlife DNA Forensic unit at SASA developed a DNA profiling method to verify Peregrine parentage records, involving extensive lab work, volunteer sample collection, and collaboration with enforcement teams. This method has already uncovered multiple instances of illegal wild-theft, pinpointing exact nests. The teamwork of SASA’s scientists, enforcement, and volunteers is bringing criminals to justice and reshaping falconry policy to protect wild Peregrines, showcasing the power of collaborative efforts in wildlife protection."
        },
        {
            "heading": 3,
            "text": "Diversity and inclusion in science and engineering award"
        },
        {
            "heading": 4,
            "text": "Winner: Kate Whitehead, West Yorkshire Police Regional Scientific Support Services."
        },
        {
            "text": "This award is for those who have supported, promoted or inspired diversity and inclusion in their organisation or within science and engineering in the wider public. Kate developed a strategy to target forensic recruits across Yorkshire and Humber, creating a forensic career mailing group for sharing opportunities and offering support. In November 2023, she arranged a forensic-specific positive action event, inviting Eurofins Forensics. Over 100 potential recruits attended, with 40% from underrepresented groups traveling from Hull, Lincoln, Staffordshire, and Teesside. Kate also set up a volunteer group offering 1:1 advice, leading to increased ethnic minority representation within CSI practitioners, reaching over 30% in 2024 compared to zero a few years ago. Attendee feedback was excellent, highlighting the event’s success."
        },
        {
            "heading": 3,
            "text": "The GCSA GSE ambassador award"
        },
        {
            "heading": 4,
            "text": "Winners: Nick Daly, Department for Energy Security and Net Zero, David Kenyon, Scottish Government & Eann Munro, Scottish Government"
        },
        {
            "text": "This award is for the GSE member who goes above and beyond for the profession. It was extremely difficult to choose a winner from the shortlist of candidates because the field was so strong. So, exceptionally, the judges made the decision to award this to all three shortlisted nominations. All three candidates advocate for the role of science and engineering in government. They have supported GSE events; contributed to the creation of GSE materials, which benefit the whole membership; and actively raise awareness of the GSE and our offer. Their commitment to the profession is commendable, and their impact resonates far beyond their home departments."
        },
        {
            "heading": 3,
            "text": "Science and engineering leadership award "
        },
        {
            "heading": 4,
            "text": "Winner: Lynsay Blake from Resources and Waste at Defra"
        },
        {
            "text": "This award acknowledges the great leadership skills our profession requires, and someone who has supported and inspired colleagues to grow. Lynsay joined Resources and Waste (R&W) in 2022, transforming the department by building a new science function with seven scientists, interns, and fellows. She integrated science into policy making, ensuring visibility at all levels. Lynsay fostered collaborations with academic institutions, managed significant changes in R&D, and built consensus around Net Zero and Circular Economy. She secured financial support and influenced major funders like UKRI. Lynsay also co-leads a new UN centre and represented R&W at the UN. Her transformative and herculean efforts have embedded science at the core of R&W, earning her high regard within the directorate."
        },
        {
            "heading": 3,
            "text": "Training, talent and development science and engineering award"
        },
        {
            "heading": 4,
            "text": "Winner: Ruth Marshall from the Government Office for Science"
        },
        {
            "text": "This award is for those who have looked to better themselves in the last year, or those who have helped facilitate the development of others. Ruth spearheaded the creation, implementation, and assessment of innovative learning resources for the GSE Profession and government on Futures thinking, including masterclasses and online courses. She identified the need based on the GO-Science mission and Integrated Review priorities, using business development and product research to pinpoint knowledge gaps. Collaborating with government L&D professionals, external experts, and senior leaders, she employed an innovative approach with videos, quizzes, and case studies on a digital platform. This initiative raised the profile of Futures, with over 1,200 masterclass registrations and inspired further courses, fostering ongoing learning collaborations and enhancing personal L&D skills."
        },
        {
            "heading": 3,
            "text": "The infinity award"
        },
        {
            "heading": 4,
            "text": "Winners: Office for Life Sciences, Julia Heckenhast, Lennard Lee, Jo Parkes Newton and Beth Teo"
        },
        {
            "text": "The Infinity Award aims to recognise the breadth of roles represented by the members of the GSE Profession. It would be impossible to capture all the profession’s achievements in just a few categories, so this is an open category. Since 2020, the UK has led vaccine advances, saving millions of lives. The Office for Life Sciences (OLS) spurred a UK cancer vaccine initiative, partnering with BioNTech, Moderna, and MSD, and mobilising NHSE and NIHR. This created the Cancer Vaccine Launchpad and Vaccine Innovation Pathway, leading to expert groups within the MHRA. In 18 months, the UK became a global leader in cancer vaccine development, with over 500 patients in trials and investments from 12 manufacturers. By 2030, the UK aims to lead globally, with 10,000 patients in trials. The OLS Team’s efforts have positioned the UK at the forefront of this technology. "
        },
        {
            "heading": 3,
            "text": "2024 award: The innovation award"
        },
        {
            "heading": 4,
            "text": "Winner: Stacey Rothwell, Kent Constabulary"
        },
        {
            "text": "This award recognises those who utilise and embed innovation within their ways of working in the public sector. Rapid Video Response (RVR) exemplifies science-led innovation in the public sector. By providing domestic violence victims with immediate video-based officer responses, RVR reduces policing response times from 33 hours to 3 minutes, increasing trust and reducing victim anxiety. It also enhances evidence collection, shortens investigations by 40%, and boosts arrests by 50%, saving forces £195k annually. Stacey’s leadership was pivotal; she identified the problem, led trials proving RVR’s value, and developed a Blueprint for adoption. RVR has aided tens of thousands of women and girls and is poised for international success with interest from overseas forces."
        }
    ]
}