{
    "url": "https://ruralpayments.blog.gov.uk/2024/09/30/inside-the-rpa-kath-illidge/",
    "title": "Inside the RPA: Kath Illidge",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Inside the RPA"
    ],
    "pub_date": "2024-09-30T14:07:37+01:00",
    "content": [
        {
            "text": "In a series from the Rural Payments Agency’s customer team, we’re featuring video interviews and blogs from some of the key people whose roles are focussed on delivering and improving the services provided to customers. In the fifth video and blog of the series, Kath Illidge, Head of Customer Engagement and Support, talks about her role and the importance of customer service within RPA."
        },
        {
            "text": "Hi, I’m Kath, and as the Head of Customer Engagement and Support I work with customers, stakeholders and those at RPA who are working to improve the customer service we deliver. At RPA we’re always listening to our customers’ concerns and issues. My role is to support and lead change that improves the customer experience, as well as develop processes that make it easier for both customers and those who provide the services."
        },
        {
            "text": "A typical day for me would involve talking to customers, stakeholders and our people to understand how we can improve customer service. Interacting with customers is a really great part of my role that I enjoy, especially when I can help alleviate their concerns and support them in what they’re trying to achieve."
        },
        {
            "text": "We’re also looking at how we can be more approachable and accessible to our customers. I think the aspect of my role that will have the greatest impact on our customers in the future is reaching out to rural businesses that may have struggled in the past to connect with RPA. We’re also looking to expand our regional support networks so we’re more accessible and relevant at a local level."
        },
        {
            "text": "I’ve also been involved in the RPA ‘Customer Excellence’ initiative, which is an internal piece of work to promote a customer-focussed culture across RPA. It’s been challenging, but the reward is seeing how people have strengthened their attitude and approach towards customers and the benefits it gives them."
        },
        {
            "text": "I’ve worked for RPA, formerly the Ministry of Agriculture, Fisheries and Food (MAFF), for over 25 years. I’ve been mainly based in operational delivery, which has included leading teams from the call centre, the processing of schemes, complaints and appeals. I also have experience in planning and resourcing, and have been involved in a variety of projects that have delivered improvements for RPA and our customers."
        },
        {
            "text": "I really enjoy working at RPA, especially the variety of roles I’ve had over the years. Though there have been some very difficult times, for example during the Foot and Mouth Disease outbreak, the positives always outweigh the negatives."
        },
        {
            "text": "Having grown up on a farm in North Cumbria I have first-hand experience of the struggles of working in agriculture, the unpredictability of the weather, not to mention livestock – there are so many variables. My family no longer farm, but I still live in a rural area and I want to contribute to the rural economy and community."
        },
        {
            "text": "Outside work I play and coach hockey, and enjoy long walks with my dogs which are always made better if they end at a pub!"
        },
        {
            "text": "RPA has published more blogs / videos in this series to introduce you to the people that lead on key customer areas. You can watch them – an interview with Customer Director Marie Hardeman and her thoughts on customer service here, with Emily Edwards and Gareth Jones, as well as with Marie, Gareth and Emily, so if you haven’t already, do listen and read more about what they do and how they work together to support those who use our services."
        }
    ]
}