{
    "url": "https://aphascience.blog.gov.uk/2024/09/30/reducing-grey-squirrel-overpopulation/",
    "title": "Reducing grey squirrel overpopulation: The role of contraceptives in conservation",
    "authors": [
        "Sarah Beatham"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2024-09-30T10:13:30+01:00",
    "content": [
        {
            "text": "Managing grey squirrel populations is important to ensure the recovery of our native reds. Find out from APHA’s Sarah Beetham how her team are developing a contraceptive to reduce grey squirrel numbers."
        },
        {
            "text": "---------"
        },
        {
            "text": "For Red Squirrel Awareness week (30 September to 6 October) the UK Squirrel Accord will be hosting webinars on red squirrel ecology and conservation, supporting one of our most iconic and enigmatic wildlife species."
        },
        {
            "text": "In the APHA Wildlife Team, we have been doing our bit as well, developing a contraceptive, delivered in a bait, to reduce grey squirrel numbers. Managing grey squirrels is important to ensure the recovery of our native reds, with the greys being the main cause of their decline in the United Kingdom (UK). They do this through direct competition for resources and by spreading squirrelpox and other diseases, which are highly lethal to the reds. With over 2.5 million grey squirrels in the UK, compared with fewer than 300,000 reds, the reds need all the help they can get!"
        },
        {
            "text": "It is fair to say that the contraceptive research, led by APHA’s Bex Pinkham of the Wildlife Team, has been challenging. To be effective, a contraceptive will need to render most greys infertile throughout the main peaks of breeding (winter and early summer), will have to be cost-effective, practical to use in the field and deliverable to grey squirrels without affecting other wildlife (the contraceptives we are trialling may affect other mammals). We have made significant progress in pilot lab trials, achieving infertility in rats fed a contraceptive vaccine. This is (as far as we are aware) the first time any research group has managed to get a functional response from a contraceptive vaccine delivered in a voluntary bait. We have also recently achieved the important step of producing an immune response to the vaccine in captive grey squirrels."
        },
        {
            "text": "The next goal is to focus on developing a suitable bait, that can deliver the vaccine to squirrels in the right way, and at the right quantity, so that we can fully test how successful it is at preventing breeding. The bait will need to be palatable and attractive to squirrels, stable in different weather conditions and importantly it needs to be either a liquid or a paste so that squirrels cannot take it away and hide it in the field; to reduce the risk of the vaccine affecting other wildlife."
        },
        {
            "text": "To complement Bex’s work, I have had the task, together with our team of intrepid field ecologists, of developing and testing field suitable contraceptive delivery methods. This is also a personal endeavour, as in 2018 I embarked on a part-time PhD with APHA and Durham University based on the research."
        },
        {
            "text": "From numerous trials simulating contraceptive delivery, we have demonstrated that a bait can be delivered, via purpose-designed feeders with weighted doors, to most grey squirrels in most woodlands, with minimal impact on other wildlife (other than hundreds of grey squirrels, only a few mice were able to access the bait). This month, after much toing and froing with reviewers, I have published my 4th squirrel research paper (and penultimate thesis chapter); An assessment of seasonal bait uptake by individual grey squirrels to develop a delivery system for oral contraceptives. By microchipping 202 squirrels in six woodlands trialled in different seasons, we demonstrated that male and female squirrels would take, on average, 40g of bait from feeders over most days of a four-day bait deployment. This is important information for designing suitable contraceptive dosing schedules in the future."
        },
        {
            "text": "My final thesis chapter, the last step before hopefully becoming a doctor (of squirrels presumably), focuses on developing a contraceptive feeder that can be used in areas where red squirrels are present. Red squirrels are smaller and lighter than greys, so we have been exploring using body weight to exclude them from bait. In development is an automatic weighing platform that uses a minimum squirrel body weight to open a door. We have worked with volunteer groups across northern England and Wales to gather hundreds of red squirrel bodyweights, using automatic weighing scales attached to feeders. These data suggest that, by setting a weight higher than the heaviest of red squirrels, we could deliver a bait containing contraceptives to over 90% of adult grey squirrels while making sure no red squirrels access it. When we recently tested a prototype feeder in wood in Cumbria, where both reds and greys were present, only greys were able to access the bait, despite the reds furiously trying!"
        },
        {
            "text": "We are enthused with what we have achieved so far, however, there is no time to sit and dwell on our successes. There is more to be done before our contraceptive is ready for registration, so that it can be used by practitioners at a landscape scale, to help manage greys across the UK and protect our reds. We are particularly excited to be part of a large collaborative bid, led by Northumberland Wildlife Trust for The National Lottery Heritage Fund, 5-year Red Squirrel Recovery Network project (RSRN). If successful, we will progress our contraceptive field research through larger trials, working with volunteer groups across northern England and south Scotland. Projects such as this are invaluable in raising awareness and combining efforts to secure the necessary support that vulnerable red squirrel populations in the UK urgently need."
        },
        {
            "text": "Before I sign off, to tackle another extensive squirrel dataset, I would just like to thank my colleagues and all volunteers, practitioners and landowners that have contributed to our contraceptive research so far. If you would like to help red squirrel conservation through volunteering, or by reporting sightings, visit this page on the Squirrel Accord website and for news of events that are happening throughout Red Squirrel Awareness week, use this link."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "You may be interested in reading some of our previously published red squirrel blogs:"
        }
    ]
}