{
    "url": "https://deframedia.blog.gov.uk/2023/05/17/coverage-on-ofwats-11-million-funding-announcement/",
    "title": "Coverage on Ofwat’s £11 million funding announcement",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-05-17T13:52:12+01:00",
    "content": [
        {
            "text": "There has been coverage in the Financial Times, City AM, Utility Week and Energy Live News following yesterday’s announcement (17 May) that Ofwat’s enforcement capacity would be bolstered with an additional £11 million funding increase from HM Treasury."
        },
        {
            "text": "The funding boost will see the water regulator's budget increase to enable it to drive change in water companies and hold them to account for falling short. It will also enable Ofwat to oversee the next price review (PR24) which will require greater investment by water companies to improve their environmental performance and the resilience of the sector."
        },
        {
            "text": "The new funding will be focused on building Ofwat’s capability to help drive transformation in company performance, enabling long term infrastructure delivery, making progress towards PR24, as well as delivering a significant boost to the regulator's enforcement capacity."
        },
        {
            "text": "Ofwat is currently conducting its largest ever investigation, with live enforcement cases underway into six companies looking at their management of sewage treatment works.  Following the Treasury approval, Ofwat will be able to gain the additional funding by increasing the licence fee charged to water companies."
        },
        {
            "text": "Water Minister Rebecca Pow said: "
        },
        {
            "text": "The announcement comes as Ofwat’s new power to take action against water companies that pay out dividends to their shareholders despite failing to meet the required performance standards came into effect today (17 May). This new power is part of a package of measures to improve the financial resilience of accompanies and were backed by the government in March."
        },
        {
            "text": "As such, the new modification will require companies to take account of environmental performance and customer delivery when deciding whether to pay dividends."
        },
        {
            "text": "If a company falls short, Ofwat will be able to take enforcement action."
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}