{
    "url": "https://educationhub.blog.gov.uk/2023/05/17/foster-care-fortnight-2023-5-reasons-why-you-should-consider-becoming-a-foster-carer/",
    "title": "Foster care fortnight 2023: 5 reasons why you should consider becoming a foster carer",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Foster Carer",
        "Fostering"
    ],
    "pub_date": "2023-05-17T10:37:09+01:00",
    "content": [
        {
            "text": "Foster carers support thousands of children around the country, providing them with a stable and loving home in times of need. While becoming a foster carer is a big decision which requires dedication and commitment, it can be a hugely rewarding path to take.   "
        },
        {
            "text": "To celebrate Foster Care Fortnight, which this year runs from 15 to 28 May, The Fostering Network has shared five reasons why you should consider being a foster carer: "
        },
        {
            "text": "1.   To transform a child's life"
        },
        {
            "text": "Children will have many different experiences and reasons for needing foster carers. The love, support and stability foster carers can provide to just one child has the power to transform many lives for the better. Whether you’re looking after a child for just a few days, or helping a family by providing longer-term care, foster carers make a real difference to those who need it. "
        },
        {
            "text": "2.    To transform your life"
        },
        {
            "text": "Fostering also transforms the lives of those who care for and live alongside children. You’ll explore new skills, experiences and opportunities together. Foster carers and the children they look after learn with and from each other to create a positive experience of family life.  "
        },
        {
            "text": "3.   To help children stay connected to the people and places that matter to them "
        },
        {
            "text": "Foster carers provide care for a child or young person within their own local community. This helps them to stay connected to the people and places which are important to them – family, friends, school and other familiar spaces and places. "
        },
        {
            "text": "4.   To keep children connected with their culture and ethnicity "
        },
        {
            "text": "Children and young people from many diverse backgrounds need foster carers who can reflect and celebrate their shared culture. You could also learn about and appreciate different cultures and customs yourself.  "
        },
        {
            "text": "5.   To be part of a wider community "
        },
        {
            "text": "Becoming a foster carer opens doors to new networks and opportunities, such as peer support groups, ongoing training and development programmes, and formal support from social work staff. Foster carers often become part of a supportive community of other carers, social workers, and professionals who are dedicated to improving the lives of children. "
        },
        {
            "text": "Hear from foster carers about the positive impact fostering has had on their life:"
        },
        {
            "text": "You and every adult that lives with you will need to pass an enhanced with barred lists Disclosure and Barring Service (DBS) check. "
        },
        {
            "text": "A social worker will assess you and your family to check that you’re able to care for a child."
        },
        {
            "text": "You can state any preferences about the children you’ll care for, like age or gender. You cannot choose a child out of a group of children and you do not get a trial period with a foster child."
        },
        {
            "text": "The fostering service will review your application. You’ll need to meet with their panel who will make a recommendation."
        },
        {
            "text": "The fostering service will make a decision on your application. "
        },
        {
            "heading": 3,
            "text": "Now is a great time to consider getting involved in foster care "
        },
        {
            "text": "The Department for Education’s recent Children’s Social Care Strategy committed to a £27 million investment in foster carer recruitment and retention over the next few years, which will increase the support available to both fostering carer applicants and existing foster carers. "
        },
        {
            "text": "We’re also helping foster carers with their finances through an above-inflation increase to the fostering minimum allowance. On top of this, we’re changing tax and benefit allowances for most foster carers, meaning an average tax cut of £450 per year. "
        },
        {
            "text": "To find out more about becoming a foster carer, you can contact Fosterline by phone or email. Fosterline offers independent, confidential and impartial advice on fostering, including the application process.  "
        },
        {
            "text": "Your local authority will also be able to answer any questions you have about fostering. You can also get further information here. "
        }
    ]
}