{
    "url": "https://lifeathmrc.blog.gov.uk/2023/05/17/mental-health-awareness-week-2023-karens-story/",
    "title": "Mental Health Awareness Week 2023: Karen's story",
    "authors": [
        "Karen"
    ],
    "categories": [
        "Accessibility",
        "Culture & Values",
        "Diversity",
        "Inclusion",
        "Mental Health"
    ],
    "pub_date": "2023-05-17T07:22:54+00:00",
    "content": [
        {
            "text": "Mental Health Awareness Week 2023: My anxiety story"
        },
        {
            "text": "In honour of Mental Health Awareness Week and this year’s theme being anxiety, we caught up with Karen, one of our Mental Health Advocates to find out more about her struggles with mental health, how she’s been supported at work, and how she continues to support others who are going through difficult times."
        },
        {
            "text": "My story:"
        },
        {
            "text": "I was first diagnosed with mental health issues in the form of depression and anxiety when I was 17. As I am now fast approaching my 62nd birthday, that’s a long time ago."
        },
        {
            "text": "Having both conditions can make it feel like my mind is doing battle with itself. One part is making me worry about things and exaggerate them, while the other part is telling me it’s not worth doing anything about it because it won’t make any difference. It’s like caring too much about things while simultaneously not caring at all about them. It can make it feel like there’s a tug-of-war going on in my head, with my emotions being the rope that’s being pulled in both directions. To say it can be exhausting is an understatement."
        },
        {
            "text": "The severity of my mental health issues does vary but generally, they have worsened over the years. Having the right support in place when I’ve needed has been crucial."
        },
        {
            "text": "Workplace support"
        },
        {
            "text": "I was advised to contact a Mental Health Advocate, who are HMRC employees that volunteer as mental health first aiders and can point you in the right direction of suitable support. They recommended that I get a Workplace Adjustment Passport, which would allow me to have certain adjustments made to my work schedule and environment, to support my mental health."
        },
        {
            "text": "I was reluctant at the time, because I was going through a good patch and didn’t feel I needed it. Nevertheless, I took the advice I was given and got one set up and I’m glad I did. My manager has been very supportive throughout this process."
        },
        {
            "text": "I’ve had counselling through HMRC’s external employee assistance provider a couple of times. It’s only been six sessions each time, but it’s amazing how much it helped. The first couple of sessions were emotionally draining because I was having to talk about things I really didn’t want to. But after that, things got better, and I saw the value. The counselling helped me to recognise that my issues were not my fault. They’re due to mental illnesses, which is every bit as real and can be just as debilitating as physical health problems. They also helped me to identify and set in place coping strategies for my dark days."
        },
        {
            "text": "How and why I try to support others"
        },
        {
            "text": "There are two main reasons why I try to support and help others."
        },
        {
            "text": "The first is summed up nicely in a quote from the late Robin Williams: “I think the saddest people always try their hardest to make people happy, because they know what it’s like to feel absolutely worthless and they don’t want anyone else to feel like that.” This applies not only to sad people, but to anyone who is experiencing mental health issues."
        },
        {
            "text": "The second is that I know how much difference the right support can make. Over the years I’ve done a range of things to support others, including:"
        },
        {
            "text": "The main thing I do now is to share my story, inspirational quotes and support through Yammer, our internal social network. I post on a regular basis and have found that a lot of people join in the conversations. I like to think that by doing this, I’m helping to raise awareness, get people talking about mental health and helping everyone to see that they’re not alone."
        },
        {
            "text": " "
        },
        {
            "text": "At HMRC, we care about our colleagues and their wellbeing, if you’re struggling with your mental health and would like support, talk to your manager or reach out to one of our Mental Health Advocates. To find out more about what it’s like to work at HMRC, including our culture and values, take a look at our careers website."
        },
        {
            "text": " "
        }
    ]
}