{
    "url": "https://teaching.blog.gov.uk/2023/05/17/my-journey-to-become-a-maths-master/",
    "title": "My journey to become a maths master",
    "authors": [
        "Helen Hackett"
    ],
    "categories": [
        "Maths Hubs",
        "Primary schools"
    ],
    "pub_date": "2023-05-17T13:54:36+01:00",
    "content": [
        {
            "text": "In this blog Helen Hackett, Mathematics Executive at Excelsior Multi Academy Trust in Birmingham, shares how she’s on a continuous journey to become a better maths teacher."
        },
        {
            "heading": 4,
            "text": "Maths sets"
        },
        {
            "text": "When I entered the teaching profession it was common practice to teach maths in primary schools to children sorted into sets by their prior attainment, working toward targets that were often below those set for others their age.  Children often remained in the same set throughout primary and moved to secondary with firmly established views of themselves as mathematicians, or not, as often the case. Never having labelled a child as ‘good’ or ‘naughty’, I felt uncomfortable using the label ‘less able’ despite it being the norm at that time."
        },
        {
            "text": "Learning from my work with the National Centre for Excellence in the Teaching of Mathematics (NCETM)/Maths Hubs, I have found having high expectations of all children and believing that all children can learn maths, avoids blaming a child's 'ability' and automatically giving them easier work.  Once that shift in teacher belief has taken place, focus is then on the teaching. I spend time carefully planning how to present concepts and model procedures. I use explanations with precise vocabulary, plan key questions in advance and I always consider what could be a potential barrier and how we can overcome them."
        },
        {
            "text": "Maths anxiety"
        },
        {
            "text": "First advice most teachers are given is to establish good relationships with students but establishing a good relationship with maths is vital to be an effective maths teacher.  I’ve found that initial teacher training for primary school teachers doesn’t always include a vast amount of maths subject knowledge, which can increase the maths anxiety in primary school teachers.  As a teacher, if you’re  feeling anxious about maths, or can’t see the power and beauty of the subject, it’ll be much more difficult to teach it well; caring about the maths as well as the students is key."
        },
        {
            "text": "Effective strategies for raising attainment in maths"
        },
        {
            "text": "Subject knowledge: this develops over time, and I’ve found that ongoing professional development, and taking the time to reflect on experience and learn with colleagues really helps. It’s just as important for a teacher with 20 years’ experience as it is a ECT to devote time to developing subject knowledge, and I’m lucky enough to work within a trust where leaders prioritise professional development."
        },
        {
            "text": "Curriculum: having a carefully sequenced and detailed curriculum, which prioritises key content is essential (I’ve used NCETM materials to support this)."
        },
        {
            "text": "Ethos and culture: success in maths should be embedded in the school vision and the whole organisation needs to reflect on this regularly to ensure everyone really embodies the desired culture."
        },
        {
            "text": "Lesson design: the NCETM have taught me how having one clear, learning focus for the class helps to ensure all the children can access and understand the key learning. In my lessons, I focus on ensuring all children can see the structure of maths and I think carefully about what children will notice in a lesson.  I also check in with the children during and after lessons to check their understanding and adapt my teaching appropriately. I start with the assumption that my children can learn this, so it’s up to me to teach it in a way they understand.  I no longer do three-part lesson where I show the children a procedure and expect them to remember and reproduce it.  I no longer automatically use three levels of different tasks. My lessons now involve constant checking, looking out for and addressing misconceptions, and deepening learning through carefully designed questions. I also use practice activities that engage the children with thinking deeply about mathematics and encourage them to not rush through things in the hope of being the first one to finish. I always say to the children I teach, ‘maths is never finished’ and we should never stop learning about it."
        },
        {
            "text": "Continuous learning"
        },
        {
            "text": "I’ve come on a long journey as a mathematics teacher, and I enjoy teaching so much more now than when I started, but my learning journey hasn’t ended."
        },
        {
            "text": "Maths is not just for some and not others, it is for everyone and the sooner all teachers, leaders, parents, students, those involved in education policy making, agree on that, the better the experiences of our children in school and the better their chances beyond school will be."
        },
        {
            "text": " "
        },
        {
            "text": "Visit NCETM to learn more about the Maths Hubs Programme, including where to find your nearest Hub"
        },
        {
            "text": " "
        }
    ]
}