{
    "url": "https://educationhub.blog.gov.uk/2023/05/national-numeracy-day-2023-what-were-doing-to-support-children-young-people-and-adults-with-maths/",
    "title": "National Numeracy Day 2023: What we’re doing to support children, young people and adults with maths",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "numeracy"
    ],
    "pub_date": "2023-05-17T15:49:24+01:00",
    "content": [
        {
            "text": "Studying maths provides people with the life skills they need to thrive, from managing personal finances to boosting their career prospects. Adults with good numeracy skills are also more likely to be employed and earn higher wages."
        },
        {
            "text": "Despite this, more than 8 million adults have numeracy skills below those expected of a nine-year-old."
        },
        {
            "text": "Ensuring children, young people and adults are equipped with the numeracy skills they need in everyday life remains a priority for the Government, which is why we’ve launched a number of programmes to support people in their learning."
        },
        {
            "text": "From Multiply to Maths to 18, here we take you through the support available to those who want to improve their numeracy skills and even gain qualifications in later life."
        },
        {
            "heading": 3,
            "text": "What is the Multiply programme?"
        },
        {
            "text": "Adults who want to brush up on their numeracy skills but don’t already have a GCSE grade C/4 or higher in maths or equivalent, can access free and flexible courses through Multiply."
        },
        {
            "text": "Multiply offers easy access to free local numeracy courses where you can gain a qualification and build your confidence in using numbers at work or in everyday life."
        },
        {
            "text": "There are courses and initiatives for beginners and those who want to build on the foundations of their maths knowledge."
        },
        {
            "text": "More advanced courses are also available such as GCSE Maths and Level 2 Functional Skills Qualification."
        },
        {
            "text": "You can find out more by heading to the Multiply website or test your skills by taking the Multiply numeracy quiz.  "
        },
        {
            "heading": 3,
            "text": "What is Maths to 18?"
        },
        {
            "text": "Maths is already a compulsory part of the curriculum for all pupils in England up to the age of 16 but we’re looking at ways we can expand this to the age of 18."
        },
        {
            "text": "This will give young people better maths knowledge to make sure they’re equipped with the skills they need for the future and to support them in their careers, including those in the creative industries."
        },
        {
            "text": "This doesn’t mean everyone will have to take maths A Level. Instead, it’s about making sure that all young people, whatever path they take after school, have access to high-quality maths education that is suited to their needs."
        },
        {
            "text": "For example, we’re collaborating with the Institute for Apprenticeships and Technical Education to work out how maths can be incorporated in a way that works for apprentices and employers."
        },
        {
            "text": "We’re currently looking into the options available, including a new qualification, and the best way to adapt existing qualifications and programmes to make sure young people get the maths skills they need."
        },
        {
            "text": "You can read more about Maths to 18 on the Education Hub.  "
        },
        {
            "heading": 3,
            "text": "What are we doing to improve maths in schools?"
        },
        {
            "text": "We have created a network of 40 Maths Hubs across the country to support schools to raise the standard of teaching. These are partnerships of schools, colleges and other organisations who work together to provide support for maths teaching in their region."
        },
        {
            "text": "This year we announced we are expanding the support available through the Hubs, so that more children can benefit from their expertise. By 2025, the proportion of schools supported by maths hubs will expand to 75% of primary schools and 65% of secondary schools."
        },
        {
            "text": "On top of this, we’re committed to increasing maths teaching capacity and quality. This includes developing a new maths National Professional Qualification (NPQ) to support the professional development of maths teachers in primary schools from February 2024."
        }
    ]
}