{
    "url": "https://apprenticeships.blog.gov.uk/2023/05/17/reflections-on-a-royal-coronation/",
    "title": "Reflections on a Royal Coronation",
    "authors": [
        "Jennifer Coupland"
    ],
    "categories": [
        "The Institute"
    ],
    "pub_date": "2023-05-17T11:55:20+01:00",
    "content": [
        {
            "text": "I was hugely honoured to be asked to represent IfATE at the King’s coronation. As IfATE is the employer voice for skills, it was so nice for apprenticeships and technical education to be celebrated in this way.  It’d been a busy week in the run up, with the launch of six green apprenticeships that reflect His Majesty’s longstanding commitment to ensuring natural assets endure for future generations, marked with the Coronation emblem."
        },
        {
            "text": "I had to be through security by 8.30am and in my seat by 9am, so I set off early to make sure I wasn’t late - although I still found myself running to get there on time with a dozen other people in frocks and hats, who’d all made the same route plan to Victoria Tower Gardens, only to find barriers rerouting us quite a way! I was determined not to miss anything so tried not to get distracted by various well-known people."
        },
        {
            "text": "Suffice to say, once through security the rest of the day was joyful."
        },
        {
            "text": "I initially sat near the Abbeys’ transept, between Ian Blackwood, the SNP leader in the House of Commons, and Edmund – who ran the King’s estate at Sandringham."
        },
        {
            "text": "It soon became clear that I was in the wrong section, and I was then rehomed between two amazing people who had been awarded British Empire medals for work during Covid. On each occasion, though, I was batting for IfATE, explaining what we did and why we’d been invited. It was a great opportunity to talk about the great work we do and how apprenticeships and technical education have grown and evolved."
        },
        {
            "text": "I had thought that a two-hour sit would really drag, but there was beautiful music playing, we were all chatting and spotting well-known faces. Emma Thompson was in my row, opposite were Ant and Dec, and at one point I had a great view of Lionel Ritchie!"
        },
        {
            "text": "I was about five rows back from the main aisle, so I got a great view of a selection of Royals’, various UK Prime Ministers, the foreign heads of state, and lots of beautiful ceremonial outfits."
        },
        {
            "text": "I was sitting behind the tallest man in the Abbey, so when the King and Queen came in and we all had to stand I didn’t get a good view. When the service itself began, screens in the nave gave us all a great close up of the ceremony itself. Being in the Abbey and hearing the service and the beautiful music first-hand really was an unforgettable, once-in-a-lifetime experience. Being able to represent IfATE and the work we do was a really proud moment."
        },
        {
            "text": "I was half way home on the train before I finally thought I’d better take my hat off!"
        },
        {
            "text": "Jennifer Coupland, chief executive of IfATE"
        }
    ]
}