{
    "url": "https://ukhsa.blog.gov.uk/2023/05/17/the-a-z-of-health-security-science/",
    "title": "The A-Z of health security science",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-05-17T12:08:04+01:00",
    "content": [
        {
            "text": "UKHSA has published its first Science Strategy discussing how science will protect health and contribute to the nation’s prosperity over the coming years."
        },
        {
            "text": "But what do you know about the science that goes on at UKHSA? There’s often much more than meets the eye."
        },
        {
            "text": "Our science saves lives; both through landmark discoveries and through scientists working quietly behind the scenes to keep people safe from infectious diseases and environmental hazards."
        },
        {
            "text": "And as well as keeping us safe, our science inspires people of all ages, offers exciting career opportunities and makes an important contribution to the UK’s economy."
        },
        {
            "text": "Read our A-Z to learn more about health security science and the diverse and multidisciplinary science taking place at UKHSA."
        },
        {
            "heading": 2,
            "text": "A"
        },
        {
            "text": "Academic networks\nUKHSA has a strong academic network across a number of higher education institutions.  We facilitate and support honorary contracts across the network, which formalise an arrangement that allows UKHSA to enter into relationships with new colleagues in academia to expand our shared knowledge and expertise across the public health system."
        },
        {
            "text": "Airborne infections\nEvery pathogen (such as a bacteria or virus) behaves differently and poses a different type of threat and requires a different type of response from UKHSA in order to protect people. Infections like TB, influenza, COVID-19, measles and Legionnaires disease spread through the air."
        },
        {
            "text": "Air pollution\nPoor air quality is the largest environmental risk to public health in the UK, as long-term exposure to air pollution can cause chronic conditions such as cardiovascular and respiratory diseases as well as lung cancer, leading to reduced life expectancy. A key role for UKHSA is to develop and share the evidence base on the impacts of air quality on health."
        },
        {
            "text": "All-hazards\nAlthough UKHSA is best known for responding to infections like COVID-19 we are an “all-hazards” agency which means we tackle all infectious diseases, chemical, radiological, biological threats as well as other environmental hazards."
        },
        {
            "text": "Antimicrobial resistance\nAntimicrobial resistance (AMR) occurs when bacteria, viruses, fungi or parasites change over time and no longer respond to medicines, making infections harder to treat. AMR is one of the biggest health threats we face. Learn more in this video."
        },
        {
            "heading": 2,
            "text": "B"
        },
        {
            "text": "Behavioural science\nBehavioural science describes the study of human behaviour. At UKHSA, behavioural and social science helps us address public health issues such as encouraging vaccine uptake, improving infection prevention and control or addressing the behavioural and psychological aspects of major incidents and emergencies."
        },
        {
            "text": "Biological threats\nUKHSA experts protect people from biological threats to health which could include exposure to substances and agents such as Anthrax."
        },
        {
            "text": "Biological/animal models\nIn some of our research – for instance evaluating the safety and effectiveness of life saving vaccines – we carry out research using animals. The vast majority of UKHSA’s scientific research does not involve animals but the biological similarities between humans and other species means that they can, on some occasions, be the only effective model for research into infectious and other diseases where the response to infection, vaccination or environmental hazards is too complex to be modelled in any other way. We are fully committed to openness and transparency with the public about when, how and why we use animals in our research, and we publish a report on this each year and maintain an active programme to replace, refine and reduce the use of animals in our research."
        },
        {
            "text": "Bioinformatics\nBioinformatics is a scientific field that involves using computer technology to collect, store and analyse biological data and information, such as genetic sequence and gene expression patterns."
        },
        {
            "text": "Biostatistics\nBiostatistics involves using statistical approaches and methods to collect and analyse biological data and data from epidemiological investigations."
        },
        {
            "text": "Biomedical science\nBiomedical scientists at UKHSA carry out a range of laboratory and scientific tests to support the diagnosis and treatment of disease."
        },
        {
            "text": "Biosafety and environment\nAt UKHSA we investigate of the role of the built environment in the transmission of infections. For an example of this work read our blog about our work to help hospitals prevent the spread of infections."
        },
        {
            "text": "Blood borne infections\nInfections like HIV, Hepatitis B and Hepatitis C are carried in the blood and can be transmitted through sexual contact, sharing needles or needle-stick injuries. UKHSA is playing a key role in the mission to eliminate these infections as a public health risk."
        },
        {
            "heading": 2,
            "text": "C"
        },
        {
            "text": "Campaigns\nUKHSA campaigns are informed by behavioural science to ensure the advice we provide is clear and actionable. Communicating with the public can save lives during an incident or emergency as well as instilling good habits that protect health such as regular hand washing."
        },
        {
            "text": "Careers in science\nUKHSA’s science strategy reinforces the importance of our people. We want to retain, attract and develop the scientific leaders and workforce of the future with access to the best facilities, resources, high quality data and technology."
        },
        {
            "text": "Centre for Climate and Health Security\nUKHSA’s new Centre for Climate and Health Security will provide a focus for our climate health partnerships and offer scientific advice and support to ensure that the impacts of climate change are considered and embedded in the design and delivery of climate change policies across local and national government and the NHS as well as with international partners."
        },
        {
            "text": "Centre for Pandemic Preparedness\nThe Centre for Pandemic Preparedness is building and coordinating a network of expertise across government, academia and the private sector to provide high quality scientific evidence and best practice on how to tackle future pandemics."
        },
        {
            "text": "Chemical threats\nAt UKHSA we work to tackle threats to health from chemicals including chemical agents such as carbon monoxide, nerve agents, asbestos, gas or lead."
        },
        {
            "text": "Chemistry\nChemists at UKHSA directly undertake research in a large number of different areas, in support of our aims."
        },
        {
            "text": "Chilton\nBased on the Harwell Science and Innovation Campus near Oxford, our Chilton site is UKHSA’s main scientific site for our work on radiation, chemical and environmental hazards"
        },
        {
            "text": "Climate and health\nThe changing climate is one of the most challenging health security threats we face and understanding its impact on our health (and providing evidence on how we can adapt to our changing climate to keep people safe) is a key priority for UKHSA. Find out more in this blog."
        },
        {
            "text": "Clinical trials\nClinical trials are research studies that test a medical intervention in people. These trials are the primary way that researchers determine if a new form of treatment or prevention is safe and effective in people. At UKHSA our science plays a key role in supporting clinical trials, in areas such as the development of new vaccines."
        },
        {
            "text": "Clinicians\nUKHSA‘s clinicians, including medical doctors, provide clinical expertise to health protection teams, research, diagnostic and laboratory services, specialist public health programmes such as immunisation, the management of high consequence infectious disease and infectious disease amongst vulnerable groups."
        },
        {
            "text": "Contact transmission\nEvery pathogen (such as a bacteria or virus) behaves differently. Infections like chicken pox and herpes simplex virus can be spread by contact such as skin-to-skin contact."
        },
        {
            "text": "Contact tracing\nContact tracing is a tried and trusted approach that has been used for many years to identify and break the spread of infection to contain and stop outbreaks. It involves working with a patient to identify who they had close contact with during the time they were considered to be infectious, then finding their contacts to offer them public health advice."
        },
        {
            "text": "Colindale\nOur Colindale science campus in north London is home to work such as infectious disease surveillance and control, reference microbiology, sequencing and high containment microbiology, plus food, water and environmental microbiology services and culture collections."
        },
        {
            "text": "COVID vaccine unit\nUKHSA continues the legacy of the Vaccine Taskforce by embedding COVID-19 vaccine supply, commercial, strategy and analytic responsibilities in the agency through the COVID Vaccine Unit."
        },
        {
            "text": "Culture collections\nUKHSA is the custodian of four unique collections that consist of expertly preserved, authenticated cell lines and microbial strains of known provenance for use in medical science and laboratory healthcare."
        },
        {
            "heading": 2,
            "text": "D"
        },
        {
            "text": "Data science\nUKHSA’s data scientists work with other experts (epidemiologists, economists and public health experts) to use data to help solve health problems. As we deliver our science strategy UKHSA will further maximise the value of our data, strengthening data science and taking advantage of new technologies such as artificial intelligence."
        },
        {
            "text": "Diagnostics\nUKHSA is home to expertise in the development, testing and assurance of diagnostic assays used to identify cases of infectious diseases, including researching how tests could be quickly developed and deployed if new infectious diseases emerge (such as a future pandemic)."
        },
        {
            "heading": 2,
            "text": "E"
        },
        {
            "text": "Electromagnetic fields (EMF)\nEMF are the elements of the electromagnetic spectrum used or generated by a wide range of technologies.  They include radio waves used in broadcasting, fields generated by electrical appliances and in electrical power distribution, mobile phone frequencies and fields used in medical magnetic resonance imaging (MRI)."
        },
        {
            "text": "Emergency Preparedness, Resilience and Response (EPRR)\nUKHSA’s EPRR experts work to minimise the impact of emergencies through planning and preparation (including exercises and simulations) as well as ensuring robust systems are in place to organise the response to emergencies. A wide variety of science is applied such as behavioural and social sciences."
        },
        {
            "text": "Environmental hazards\nEnvironmental hazards include radiation and chemical threats in the environment, natural disasters and other environmental hazards to health. Exposure to environmental hazards can be either natural, accidental or deliberate."
        },
        {
            "text": "Engineering\nUKHSA engineers with specialist training carry out surveys of installations emitting electromagnetic fields to check that the exposures of people comply with internationally agreed guidelines.  Our engineers are also essential to keep our scientific facilities operating to high standards of safety and security."
        },
        {
            "text": "Epidemiology\nEpidemiology is one of the foundations of public health and health security. It involves studying the distribution and determinants of diseases within groups of people, and the development of knowledge on how to prevent and control the diseases."
        },
        {
            "text": "Ethical review\nAll research involving people, their tissues and/or their data requires review by a research ethics committee. Ethical review involves understanding the purpose of the study, the question being asked, the design and conduct, risks of harms to study participants and researchers, and reviewing the methodology for participant recruitment, their rights to withdraw and confidentiality."
        },
        {
            "text": "Extreme weather\nExtreme weather events such as flooding, heatwaves or cold weather events can harm our physical and mental health. UKHSA carries out a range of work to study the impact of extreme and adverse weather on our health and provide guidance on actions the public and partners can take to reduce harm to health."
        },
        {
            "text": "Evaluation\nUKHSA carries out robust evaluation of health protection interventions to ensure we understand what does and doesn’t work. For example, an evaluation might aim to determine if an intervention reached its intended audience, was implemented as planned and had the desired impact."
        },
        {
            "heading": 2,
            "text": "F"
        },
        {
            "text": "Field epidemiology\nSometimes nicknamed “disease detectives” UKHSA’s field epidemiology experts contribute to the investigation in the community of anything from common food poisoning incidents to through to rare and imported infections."
        },
        {
            "text": "Food and waterborne infections\nUKHSA experts work to protect people from a range of infections such as salmonella, norovirus, E.  coli, listeria and cryptosporidium which can be transmitted through food and water."
        },
        {
            "heading": 2,
            "text": "G"
        },
        {
            "text": "Genomics\nUKHSA is a world leader in pathogen genomics, a powerful approach providing detailed information for use in the investigation and management of infectious diseases. Genomic sequencing can be used to build our understanding of many infectious diseases, advancing the way we assess risks, treat patients, helping us to investigate outbreaks and monitor for antimicrobial resistance."
        },
        {
            "text": "Geography\nUKHSA has a geospatial team which develops geographic information systems that help to determine disease spread, hotspots, and the relationship with specific communities."
        },
        {
            "text": "Global health security\nGlobal health security involves working with our partners across the world to ensure strong and resilient public health systems that can prevent, detect, and respond to infectious and non-infectious disease threats, wherever they occur."
        },
        {
            "text": "Guidance\nAn important aspect of UKHSA’s role is providing guidance for health professionals and the public which can help them reduce the risks posed by health hazards. Our guidance is informed by the latest science and evidence."
        },
        {
            "heading": 2,
            "text": "H"
        },
        {
            "text": "Health protection teams\nUKHSA’s health protection teams are a crucial part of our regional footprint, providing specialist public health advice and operational support to NHS, local authorities and other agencies. This includes leading UKHSA’s regional response to infectious diseases, chemical or radiation hazards and other emergencies and supporting local disease surveillance as well as investigating and managing health protection incidents and outbreaks, maintaining alert systems and implementing and monitoring national action plans for infectious diseases at local level."
        },
        {
            "text": "Health equity\nHealth equity means the absence of unfair and avoidable differences in health. The COVID-19 pandemic has reinforced that health threats do not affect everyone equally - people in underserved communities or who have other vulnerabilities have suffered the worst outcomes. A priority for UKHSA is to use our science to uncover and reduce health inequalities."
        },
        {
            "text": "Health economics\nHealth economics experts collect and summarise the evidence on the economic impact of a wide range of public health issues and interventions."
        },
        {
            "text": "Health Protection Research Units \nNational Institute for Health and Care Research (NIHR) Health Protection Research Units (HPRUs) are NIHR funded partnerships between UKHSA and academia that undertake high quality research that enhances the ability of UKHSA to use innovative techniques to protect the public’s health and minimise the health impact of emergencies."
        },
        {
            "text": "Health security\nTo UKHSA, our role as the nation’s health security agency reflects the fact that will operate as an integral part of the public health system and the national security infrastructure to protect people from threats to their health"
        },
        {
            "text": "High containment\nUKHSA has unique expertise in containment microbiology. Our “level 4” facilities can undertake work at the highest categorisation of human and animal pathogens – this means working with the organisms which cause the world’s most dangerous infections such as Lassa fever and Ebola."
        },
        {
            "heading": 2,
            "text": "I"
        },
        {
            "text": "Infectious diseases\nInfectious diseases are caused by organisms such as bacteria, viruses, fungi or parasites. Some infectious diseases can be passed from person to person whilst some are transmitted by insects or animals or through consuming contaminated food or water or being exposed to organisms in the environment. Some infectious diseases are constantly present (endemic) in the UK, some only occur elsewhere in the world and others have not yet crossed the species barrier to humans. Each pathogen behaves differently, represents a different type of threat and requires a different type of response."
        },
        {
            "text": "Incidents and outbreaks\nUKHSA deals with thousands of incidents and outbreaks each year, ranging from E. coli, Legionnaires disease and TB through to more unusual infections such as Mpox. Incidents can involve radiation, chemical and other environmental hazards. Our response to these is informed by the best available science."
        },
        {
            "text": "Immunology\nImmunology is the branch of science dealing with the components of the immune system and immunity from disease. At UKHSA an area where this science is applied includes the development and evaluation of vaccines."
        },
        {
            "text": "Impact\nAs UKHSA matures as an agency we will increasingly assess the impact of our science in protecting health and contributing to the prosperity of the UK. We will evaluate our strategy through indicators drawing on quantitative and qualitative evidence from various sources within and outside UKHSA."
        },
        {
            "text": "Ionising radiation\nUKHSA has responsibility for protecting the public from all forms of ionising radiation to ensure that the benefits of use outweigh the associated risks. Ionising radiation exposures come from a range of sources, for example, naturally occurring radon gas, uses in medical imaging and treatment (eg CT scans, radiotherapy) and industrial uses.  UKHSA provides a full range of services to protect people from ionising radiation risks"
        },
        {
            "heading": 2,
            "text": "J"
        },
        {
            "text": "Joint Committee on Vaccination and Immunisation (JCVI)\nThe Joint Committee on Vaccination and Immunisation (JCVI) is an independent expert advisory committee that advises United Kingdom health departments on immunisation, making recommendations concerning vaccination schedules and vaccine safety.\n\nJournals\nUKHSA is a research active organisation with our scientists undertaking or collaborating in studies that result in the publication of hundreds of peer reviewed articles in scientific journals every year."
        },
        {
            "heading": 2,
            "text": "K"
        },
        {
            "text": "Knowledge and Library Services\nKnowledge and Library Services provide access to the evidence base for public health through a range of mediated, embedded library, information and knowledge services, delivered at the point of need.  The service enables UKHSA staff to access resources (databases, e-journals, ebooks, physical collections) and delivers expert literature searching, information retrieval and enquiry services to facilitate evidence-informed policy and practice in UKHSA."
        },
        {
            "text": "Knowledge management (KM)\nKnowledge Management (KM) is a set of principles, tools and practices that enable people to create knowledge, and to share, translate and apply what they know to create value and improve effectiveness. Knowledge management is the management of environment, cultures, and ways of working to proactively stimulate knowledge creation, sharing and use."
        },
        {
            "text": "Knowledge mobilisation (KMb)\nKnowledge mobilisation/translation describes any activity or process that facilitates the transfer of high-quality evidence from research into effective changes in health policy, clinical practice, or products.  It aims to close the gap between what is known from research/evidence and the implementation of this knowledge into policy and practice."
        },
        {
            "heading": 2,
            "text": "L"
        },
        {
            "text": "Laboratories\nThe scientific capabilities and technologies at our public health laboratories are at the core of UK health security. Our labs cover diagnosis of diseases, food, water and environment laboratories through to radiation and chemical and research laboratories. Some of our capabilities are highly specialised and rare or unique in the country"
        },
        {
            "text": "Literature search\nA literature search is a detailed, comprehensive and systematic search of the literature (published and unpublished) from a variety of quality sources about specific topics or conditions, enabling evidence-informed policy and practice, and is a service provided for staff by UKHSA Knowledge and Library Services."
        },
        {
            "heading": 2,
            "text": "M"
        },
        {
            "text": "Medical entomology\nUKHSA’s medical entomologists work to prevent and control endemic and emerging vector-borne disease threats (such as diseases carried by mosquitoes and ticks)."
        },
        {
            "text": "Microbiology\nMicrobiology is the study of microscopic organisms such as viruses and bacteria."
        },
        {
            "text": "Modelling\nModelling is the use of mathematical models to simulate potential public health scenarios and the impact public health interventions could have."
        },
        {
            "heading": 2,
            "text": "N"
        },
        {
            "text": "National network of public health microbiology laboratories\nAlongside our major science campuses at Porton, Harwell and Colindale, UKHSA also has a number of regional public health laboratories co-located with large NHS hospitals, supporting the NHS and providing specialist front line public health microbiology services, and a food, water and environmental microbiology laboratory in York."
        },
        {
            "text": "NHS pressures\nAn important role for our science is supporting and reducing pressure on the NHS. We do this by preventing and mitigating outbreaks of disease in the community, through our work on vaccinations which stop people getting ill in the first place or through the contribution of our science and evidence to tackling issues like antimicrobial resistance or healthcare acquired infections."
        },
        {
            "text": "Non-ionising radiation\nRadiations such as radio waves, visible light and ultra-violet light are all part of the electromagnetic spectrum where the energy is too small to cause direct breakage of chemical bonds (unlike ionising radiations that do break chemical bonds). UKHSA carries out work to assess exposures to non-ionising radiations, promote their safe use in industry and society as well as carry out research to characterise health risks and benefits."
        },
        {
            "heading": 2,
            "text": "O"
        },
        {
            "text": "One Health\nA ‘One Health’ approach to health security recognises that the health of humans, animals and ecosystems are interconnected."
        },
        {
            "text": "One hundred Days Mission/100 Days Mission\nUKHSA is home to the UK secretariat of the 100 Days Mission initiative, a global mission which began in 2021 to ensure that the best weapons we have to tackle pandemics - diagnostics, therapeutics and vaccines – can be deployed within 100 days of recognising a new threat. Find out more in this blog."
        },
        {
            "text": "Operational response\nOne of UKHSA’s strengths is our ability to combine science and evidence with operational response, implementing measures on the ground to prevent the spread of disease or reduce harm from other health threats."
        },
        {
            "heading": 2,
            "text": "P"
        },
        {
            "text": "Pandemic preparedness\nUKHSA was established both to respond to COVID-19 and build on the legacy of the COVID-19 response to ensure the UK is in the strongest possible position to protect the public from future pandemics and other threats to health security. Science informs all aspects of this work, including surveillance to ensure we can spot threats early as well as work to ensure we develop vaccines, tests and treatments quickly to respond to future pathogens with pandemic potential."
        },
        {
            "text": "Partnerships\nProtecting the public’s health requires the expertise and input of many people and organisations, from local authorities and directors of public health working within local communities to global organisations like the World Health Organisation."
        },
        {
            "text": "UKHSA will only succeed in its mission by working in partnership with academia, industry and other Government and public sector organisations. Read our blog about the importance of science partnerships."
        },
        {
            "text": "Patient, public and community involvement, engagement and participation in research\nInvolvement and engagement of the public in some public health and health protection research helps ensure the research is more relevant to people’s needs and concerns, more reliable and more likely to be used. The term 'involvement' refers to an active partnership between patients and the public and researchers in the research process, rather than the use of people as 'subjects' of research. The term ‘engagement’ refers to the provision and dissemination of research information and knowledge to the public, for example through activities, public events, and the media."
        },
        {
            "text": "Peer review\nPeer review is the activity where independent experts asses the quality of proposed research studies or of publications to scientific journals."
        },
        {
            "text": "Pharmacists\nAt UKHSA we have a small number of pharmacists working on key organisational priorities such as tackling antimicrobial resistance."
        },
        {
            "text": "PhD\nDoctorates of Philosophy (PhDs) are higher research degrees where students undertake independent original research in a particular topic. UKHSA supports doctoral training programmes through its own funding scheme, joint PhDs with HPRUs and through its status as an Affiliated Research Centre of the Open University."
        },
        {
            "text": "Physics\nUKHSA employs physicists in a range of areas, particularly those relating to radiation and other environmental risks.  For example, physics is used to characterise radiation sources and exposures and to characterise airborne pollutants."
        },
        {
            "text": "Policy and strategy\nAt UKHSA we carry out science to drive action that protects health. Our science helps UKHSA play an important role in policymaking across local and national government, providing advice for ministers or local decision makers on how best to protect the population’s health."
        },
        {
            "text": "Porton Down\nOur Porton Down science campus in Wiltshire is home to expertise including rare and imported pathogens, high containment microbiology, development and testing of vaccines and diagnostics, microbiological research, culture collections, plus food, water and environmental services."
        },
        {
            "text": "Prosperity\nIt has always been known that health is necessary for a prosperous society, but we now have a greater understanding than ever that as well as saving lives, protecting people from health threats keeps society moving and reduces pressure on vital public services like the NHS. Science also creates partnerships between industry, government and academia that boost growth, drive innovation and also create exciting careers. All of this makes an important contribution to our nation’s prosperity."
        },
        {
            "text": "Public health\nPublic health refers to activity which prevent diseases, promotes health, and prolong life among the population as a whole. UKHSA’s role in the public health system is to protect people’s health from infectious diseases and other health hazards."
        },
        {
            "heading": 2,
            "text": "Q"
        },
        {
            "text": "Qualitative research/quantitative research\nQualitative research explores people's beliefs, experiences, attitudes, behaviour and interactions and generates non-numerical data. Quantitative research generates numerical data or data that can be converted into numbers."
        },
        {
            "heading": 2,
            "text": "R"
        },
        {
            "text": "Radiation protection\nUKHSA has a full range of capabilities that ensure that the public are protected from the risks of exposure to all forms of radiation while benefiting from its uses, for example, x-rays in medical practice."
        },
        {
            "text": "Radiological or nuclear threat\nUKHSA experts work to protect the public from threats which could include Ionising radiation (x-rays, industrial pipes), non-ionising radiation (radio waves, UV light) or fixed nuclear site releases (power-plants).\n\nRapid systematic review \nThe use of streamlined systematic review methods, with parts of the review process simplified to allow a product to be delivered in a shorter timescale e.g. a few weeks to a few months."
        },
        {
            "text": "Rare and Imported Pathogens Laboratory (RIPL)\nThe Rare and Imported Pathogens Laboratory, based at Porton Down, specialises in the diagnosis and management of unusual or hazardous infectious diseases present in the UK or imported into the country. It provides support to the NHS when a patient is suspected of being infected with a rare or imported pathogen and also accepts requests from internationally accredited health service providers."
        },
        {
            "text": "Research\nHealth protection research - and the translation of research findings into action (influencing policy or practice) - is a crucial way of protecting the public’s health. UKHSA is a research active organisation and research (our own and that of others) is also a critical enabler of the advice we provide across government and internationally. Find out more about research at UKHSA."
        },
        {
            "heading": 2,
            "text": "S"
        },
        {
            "text": "Science\nScience is both a body of knowledge and an approach to continue to improve our understanding. The Science Council defines Science as “the pursuit and application of knowledge and understanding of the natural and social world following a systematic methodology based on evidence”. Science is at the heart of everything UKHSA does."
        },
        {
            "text": "Scientists\nHealth protection science at UKHSA is carried out by a wide range of scientists in diverse disciplines. UKHSA employs specialists in fields like epidemiology, microbiology, virology, data science, toxicology, genomics, bioinformatics, biostatistics, modelling, public health, medicine, physics and radiation protection, chemistry, biomedical sciences, engineering, immunology and behavioural science and psychology."
        },
        {
            "text": "Sexually transmitted infections\nSexually transmitted infections (STIs) are a major public health concern, affecting individuals, as well as being costly to healthcare services. If left undiagnosed and untreated, common sexually transmitted infections may cause complications and long-term health problems. UKHSA provides expertise in the detection, prevention and control of sexually transmitted infections"
        },
        {
            "text": "Sponsorship of research\nAny research involving human participants, their tissue and/or their data must have an identified study sponsor. The sponsor organisation takes primary responsibility for ensuring that the study design meets appropriate standards and that adequate management, monitoring and reporting arrangements are in place."
        },
        {
            "text": "Surveillance\nA crucial aspect of health security is disease surveillance; making sure we have the right information available to us at the right time to inform decisions and actions across the public health system. Surveillance involves gathering a wide variety of data about a disease from a range of sources, to provide us with situational awareness."
        },
        {
            "text": "Systematic review\nA review that uses explicit, systematic methods to find, collate and synthesise findings of studies that address a narrowly defined question. Study data is summarised using narrative text and tables and the risk of bias is minimised by using critical appraisal methods.  Systematic reviews may take a year or more to complete."
        },
        {
            "heading": 2,
            "text": "T"
        },
        {
            "text": "Technology\nUKHSA utilises a wide range of cutting-edge technologies to deliver its science; some of it highly specialised and produced in-house."
        },
        {
            "text": "Toxicology\nOur work includes assessment of exposure and risk from chemical substances and analysis for chemicals and metals in clinical and environmental samples through to molecular toxicology and chemicals regulation support nationally and internationally"
        },
        {
            "text": "Travel health\nAn aspect of health security is protecting the health of British people travelling to other countries including advising on specific situations and circumstances that could affect people’s health when they are overseas. We also share information about infectious disease with partners such as the World Health Organisation, including understanding whether British nationals have been exposed to any risk whilst travelling abroad."
        },
        {
            "heading": 2,
            "text": "U"
        },
        {
            "text": "UK Health Security Agency (UKHSA)\nUKHSA is responsible for protecting every member of every community from the impact of infectious diseases, chemical, biological, radiological and nuclear incidents and other health threats. We provide intellectual, scientific and operational leadership at national and local level, as well as on the global stage. UKHSA is an executive agency of the Department of Health and Social Care."
        },
        {
            "text": "Ultra-violet light\nUltra-violet light exposure can be from the sun or artificial sources such as sun beds or those used in industry and healthcare settings. Exposure can lead to skin cancer but also has beneficial effects such as promoting the production of vitamin D.  UKHSA monitors solar UV across the country, and carries out research to ensure health advice correctly balances risks and benefits"
        },
        {
            "heading": 2,
            "text": "V"
        },
        {
            "text": "Vaccines\nAfter clean water, vaccination is the most effective public health intervention in the world for saving lives and promoting good health. UKHSA has a unique role to play in vaccination as we have true end to end capability from scanning the horizon to assess the nation’s vaccine needs, procurement and logistics, assisting with clinical trials to evaluate the safety and effectiveness of emerging vaccines through to a range of lab and real world science to monitor vaccines after they have been rolled out to the population. Through our science and expertise, we play a key role in UK’s world-class childhood and adult immunisation programmes."
        },
        {
            "text": "Vaccine development and evaluation\nWe are building on our expertise in this area by establishing a Centre for Vaccine Development and Evaluation at Porton Down, securing the legacy from the COVID-19 pandemic and bringing together UKHSA’s laboratory-based activity, expertise and leadership in vaccine discovery, development and evaluation."
        },
        {
            "text": "Vector\nA vector is a living organism (like a mosquito or tick) that transmits an infectious agent from an infected animal to a human or another animal. Examples of diseases carried by vectors are zika, malaria, dengue fever and Lyme disease"
        },
        {
            "text": "Virology\nVirology is the scientific study of viruses."
        },
        {
            "heading": 2,
            "text": "W"
        },
        {
            "text": "Wastewater surveillance\nWastewater surveillance is the monitoring of pathogens (e.g. viruses) which enter sewer systems through human waste. We collect sewage samples from these systems and treatment plants and send them to laboratories for testing. UKHSA's wastewater surveillance recently identified the presence of Poliovirus in London."
        },
        {
            "text": "Whole genome sequencing\nWhole-genome sequencing is a method for analysing entire genomes (see genomics)"
        },
        {
            "heading": 2,
            "text": "X"
        },
        {
            "text": "Disease X\nHealth security experts prepare on the basis of a “Disease X”, which is a hypothetical as yet unidentified pathogen that could cause a future pandemic."
        },
        {
            "heading": 2,
            "text": "Y"
        },
        {
            "text": "Yellow fever\nYellow fever, an acute flavivirus infection spread by the bite of an infected mosquito, is one of the many infections covered in UKHSA’s “Green Book”, one of our most viewed online resources which contains the latest information on vaccines and vaccination procedures."
        },
        {
            "heading": 2,
            "text": "Z"
        },
        {
            "text": "Zoonotic diseases\nZoonotic diseases transmit from animals to humans. Examples include Hantavirus or rabies."
        }
    ]
}