{
    "url": "https://dluhcdigital.blog.gov.uk/2023/05/17/were-hiring-join-our-growing-technology-team/",
    "title": "We’re hiring: Join our growing Technology team",
    "authors": [
        "Dave Baldwin"
    ],
    "categories": [
        "DDAT Careers",
        "Technology"
    ],
    "pub_date": "2023-05-17T10:01:02+01:00",
    "content": [
        {
            "text": "Hi, I’m Dave, Chief Technology Officer (CTO) at the Department for Levelling Up, Housing and Communities (DLUHC)."
        },
        {
            "text": "We have new opportunities to join our growing Technology team with more roles to be announced over the summer. We're currently recruiting:"
        },
        {
            "text": "Technical Architect"
        },
        {
            "text": "Infrastructure Engineer"
        },
        {
            "text": "Senior Infrastructure Engineer"
        },
        {
            "text": "Here at DLUHC we work on things that have far-reaching outcomes and our Technology team is central to the department delivering its mission, from spreading opportunity and prosperity across the UK; building safer, greener, more affordable homes; shielding the most vulnerable and reducing homelessness; enabling the local government system to deliver the services we all rely on; to providing emergency responses nationally such as Home for Ukraine or during the pandemic."
        },
        {
            "heading": 3,
            "text": "What we’re working on"
        },
        {
            "text": "Our team is responsible for technical design, architecture, IT infrastructure, networks, cyber security, digital tools, and projects. We provide the everyday core digital tools and infrastructure for the entire DLUHC, from cloud-hosting infrastructure for our applications developers through to wifi in our offices and collaboration tools for 3,500 staff in 20 sites across the UK. For example, we’re currently migrating several public-facing web services to our own cloud-hosted environment, developing a Virtual Desktop solution for specific use cases and just completed a cyber security improvements programme."
        },
        {
            "text": "There are 20 of us split into 4 teams - Digital Tools, Architecture and Networks, Cyber Security and Projects. As both DLUHC and technology evolve, the ask of myself and my team is also changing and the opportunity to grow the team to design and develop future services is brilliant."
        },
        {
            "heading": 3,
            "text": "Our tech stack"
        },
        {
            "text": "Since 2017 we’ve been cloud first, we don’t have on-premises services and legacy tech to worry about. That strategy works well - our staff can work anywhere and access any service on modern devices. We’re big users of Microsoft 365 as you’d expect, but also Zscaler for zero trust networks, AWS and Azure for cloud and we’re very keen on Github and Terraform. We manage most services internally but recognise the importance of external partners to help us build or manage environments where they can do it better, for instance using a supplier to run our service desk and internet connectivity. "
        },
        {
            "heading": 3,
            "text": "Our culture"
        },
        {
            "text": "Our current team is a great mix of people from all walks of life and I’m keen to see that continue. We support hybrid working and have staff working across regional sites as well as in London, so we’re really a virtual team. I value a high degree of trust and autonomy to deliver what’s needed. Our culture is about empowering everyone in the team to deliver great services for all whilst ensuring that we offer individuals a challenge and the opportunity to develop themselves and their skills in an environment which encourages innovation and knowledge-sharing. "
        },
        {
            "heading": 3,
            "text": "How you can learn and progress your career"
        },
        {
            "text": "We’re still maturing in many areas, which brings lots of scope to help shape future services and how we operate them. Given the wide range of responsibilities we encourage people to work alongside other disciplines and, in many cases, take on some aspects of other roles to help them grow and learn. "
        },
        {
            "text": "I’m very serious about developing my staff; we have 5 days learning per year as a minimum and a learning and development budget to ensure that everyone can benefit. Our training ranges from internal coaching and training sessions, funded training from the likes of AWS and Microsoft, through to individual courses for your role whatever your level. We even have someone on a senior leadership apprenticeship with the University of Exeter. This year we’re investing into growing our communities of practice, further tailoring development options and creating visible career pathways for all roles to make it easier for you to progress or move around."
        },
        {
            "text": "Since joining DLUHC a few years ago I myself had plenty of opportunities to learn and tackle very different challenges, and over time that led to my progression to the role of CTO this year."
        },
        {
            "text": "So if, like me, you love to use technology to solve problems that have a direct impact on people’s lives right across the country and want to be part of something big and meaningful, we'd love to hear from you."
        },
        {
            "text": "Find out more about all vacancies across DLUHC Digital."
        }
    ]
}