{
    "url": "https://securityprofession.blog.gov.uk/2023/05/17/workplace-adjustments-how-we-can-support-colleagues-with-health-conditions/",
    "title": "Workplace adjustments - how we can support colleagues with health conditions",
    "authors": [
        "Angela Fisher"
    ],
    "categories": [
        "Government Security",
        "Guest blog",
        "Security and Diversity",
        "Women and security"
    ],
    "pub_date": "2023-05-17T13:23:34+01:00",
    "content": [
        {
            "text": "Disabilities come in all forms, from visible to non-visible and from physical to mental. It's therefore important to keep in mind that disabilities exist in many ways, and although disability awareness month is a great time to remind ourselves about this, we should be mindful that disabilities exist all the time and impact people in many ways. We spoke with Therese, Head of the Government Security Centres Team in the Government Security Group,  about her experiences."
        },
        {
            "text": "Therese who suffers from myoclonic seizures, was diagnosed with an autoimmune disease in her late 20s. The condition has a very wide-ranging impact on her health."
        },
        {
            "text": "Over 20 years of working in security Therese has noticed a huge improvement in understanding of what kind of workplace adjustment she might need."
        },
        {
            "text": "The main improvement has been an ability to work from home."
        },
        {
            "text": "She has also negotiated a later start time."
        },
        {
            "heading": 4,
            "text": "Are there any particular characteristics or ways of behaving that managers have displayed which made them really good allies?"
        },
        {
            "text": "Therese really appreciates the fact that she has such a good and open relationship with her line-manager."
        },
        {
            "text": "She is however aware that this isn’t the case for everyone and not all line managers are so supportive."
        },
        {
            "heading": 4,
            "text": "How can we be inclusive from the very beginning stages of what we do to include you and others with similar conditions?"
        },
        {
            "text": "Therese has found the move to more hybrid working to be very beneficial."
        },
        {
            "heading": 4,
            "text": "Where can people go to learn more to educate themselves, to support their team members."
        },
        {
            "heading": 4,
            "text": "Occupational health assessments"
        },
        {
            "text": "Therese would advise anyone who's thinking they might need some adjustments to ask for an occupational health assessment. You’re entitled to have one if you meet the criteria."
        },
        {
            "heading": 4,
            "text": "Being thoughtful and mindful"
        }
    ]
}