{
    "url": "https://dcmslibraries.blog.gov.uk/2025/04/25/brent-libraries-impact-of-the-libraries-improvement-fund/",
    "title": "Brent Libraries - Impact of The Libraries Improvement Fund",
    "authors": [
        "Amit Bhagat, Head of Libraries, Culture and Heritage Services, Brent Council"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2025-04-25T15:54:38+01:00",
    "content": [
        {
            "text": "The Government has announced that public libraries will soon be able to apply for a share of a share of the £5.5 million Libraries Improvement Fund as part of the Government’s commitment to ensure libraries are able to upgrade their physical and digital infrastructure to adapt to changing user needs and can be enjoyed by future generations."
        },
        {
            "text": "The Libraries Improvement Fund (LIF) will open for expressions of interest on Tuesday 6 May 2025. Full guidance, including eligibility criteria and details of how to apply can be found on Arts Council England’s website. "
        },
        {
            "text": "We’re taking some time to shine a light on some of the earlier LIF rounds. Today, Brent Libraries are talking about how LIF supported them  to upgrade Harlesden Library."
        },
        {
            "text": "Harlesden Library Hub & Front Room case study "
        },
        {
            "text": "Harlesden Library had experienced declining use as the building’s appearance and layout had become tired, with antisocial behaviour also increasing. "
        },
        {
            "text": "What was the goal for this project? "
        },
        {
            "text": "There were five main elements to the Harlesden Library project, namely:  "
        },
        {
            "text": "Outcome of the project  "
        },
        {
            "text": "Harlesden Library reopened its doors to customers and residents on Monday, 23 April 2023. The grand community reopening was attended by nearly 800 customers and residents including the Mayor of Brent."
        },
        {
            "text": "Some of the changes to Harlesden Library include: "
        },
        {
            "text": "Within hours of reopening, we had already received positive feedback such as: "
        },
        {
            "text": "Long term benefits for customers and residents  "
        },
        {
            "text": "The project has future-proofed the facilities for an estimated further ten years and enabled more flexible use, building in capacity for the service to adapt to changing community needs. The library facilities are primarily community assets, developed to address social and cultural infrastructure challenges, build capacity in the local community and creative sector and develop new partnerships to enhance the service offer to residents."
        },
        {
            "text": "This includes through: "
        },
        {
            "text": "Three services are being offered under one roof – the library service, Brent Start and the Community  Hub. This makes life much easier for residents and customers when they would like to attend classes  at Brent Start and/or seek advice from the Hub and use the library at the same time to borrow/return books, use a PC, use study spaces etc.  "
        },
        {
            "text": "Since reopening Harlesden library, we have had regular events such as Booktrust Story and Rhyme Time for under 5s. In addition to the regular events, we had special and ad-hoc events including Tai Chi, The 75th Anniversaries of The NHS and arrival of the Windrush generation, and a Summer Fun Festival programme featuring workshops, wild live animals and prizes for busy readers!"
        },
        {
            "text": "The library team loves to welcome customers and colleagues to the refurbished Harlesden library. Please do pop in when you’re in the area!"
        }
    ]
}