{
    "url": "https://ukhsa.blog.gov.uk/2025/04/25/my-measles-journey-i-woke-to-find-a-rash-all-over-my-body/",
    "title": "My measles journey: ‘I woke to find a rash all over my body’",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2025-04-25T16:37:33+01:00",
    "content": [
        {
            "text": "Saijal Ladd, Prescribing Advisor - Medicines Planning and Operations, NHS North Central London Integrated Care Board (ICB), shares her experience of contracting measles at 42, and the serious impact this had on her health."
        },
        {
            "text": "We’re sharing her story as part of London’s 'Why We Get Vaccinated' campaign, highlighting the importance of getting vaccinated and serving as an important reminder that it’s never too late to catch up."
        },
        {
            "text": "On 19 May 2016, I was admitted to Barnet General Hospital with measles."
        },
        {
            "text": "I’d started to feel unwell a few days prior to this with a sore throat and temperature, but I didn’t think it was anything serious so I started a self-care routine of taking paracetamol and warm fluids with some rest."
        },
        {
            "text": "However, despite taking medication my condition worsened, and my temperature remained high. On the night of 18 May, I felt really unwell with diarrhoea, fever and generalised weakness and early the next morning I woke to find a rash all over my body."
        },
        {
            "text": "Being a pharmacist, I knew this wasn’t a common cold or even flu and soon realised with all the other accompanying symptoms that the rash looked like measles."
        },
        {
            "text": "I was feeling very unwell by now, so at around 7am I called 999. The ambulance crew arrived within an hour and after fully assessing my condition, transferred me to hospital. I was placed in isolation after being admitted, as by this point, I was vomiting as well."
        },
        {
            "text": "My family were informed, but when they arrived, I was unable to speak to them as my voice had been affected by the vomiting!"
        },
        {
            "text": "By late afternoon, I’d been allocated a bed, but I don’t have much recollection of what happened after that as I was delirious and extremely drowsy from all the medication I was given. I was also started on fluids via a drip."
        },
        {
            "text": "Later that night, some of my organs started to fail including liver, kidney and lungs. I woke up at some point to find an ICU consultant standing by my bedside assessing whether to admit me into intensive care."
        },
        {
            "text": "I don’t recall what happened after this, but when I woke the next morning, I was still on the ward. A family member later told me how they nearly lost me during the night and that the clinicians were unsure if I would make it through until morning."
        },
        {
            "text": "I was so grateful to have woken up and been told that I’d started to stabilise - it was now a waiting game to see if my body’s immune system would be able to fight against this virus. I also felt thankful for having led a fit and healthy life, as this allowed my body to fight the measles virus."
        },
        {
            "text": "After a week in hospital, I was finally discharged."
        },
        {
            "text": "My GP had to monitor me closely over the next few weeks, however, and it took me about 2 to 3 months to get back to a normal activity level as my muscles had started to waste away due to lack of activity. I was unable to walk even a few metres without getting breathless and would sometimes wake up in the middle of the night feeling extremely weak due a drop in sugar levels."
        },
        {
            "text": "This whole experience was extremely frightening, and I would urge all parents to consider vaccinating their children so that they don’t have to go through what I did in adulthood."
        },
        {
            "text": "Looking back, I’m so grateful to be alive and really feel like life has given me a second chance!"
        },
        {
            "text": "London’s Why We Get Vaccinated campaign has been developed by public health partners including London Councils, UKHSA London, ADPH London and NHS England (London). The campaign has been co-produced with London communities and focuses on opening and encouraging conversations about vaccination. Read further information about the campaign and access campaign materials here."
        }
    ]
}