{
    "url": "https://marinedevelopments.blog.gov.uk/2025/04/25/standardisation-of-post-consent-monitoring-for-offshore-wind-farms/",
    "title": "Standardisation of Post-Consent Monitoring for Offshore Wind Farms",
    "authors": [
        "Philippa Blyth, Offshore Wind Advisor"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-04-25T07:55:05+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation’s (MMO’s) Strategic Renewables Unit (SRU) have been working with other government departments, Statutory Nature Conservation Bodies (SNCB’s), The Crown Estate and Renewable UK to standardise the monitoring of offshore wind farms, aiming to make post-consent monitoring requirements clear and data more usable."
        },
        {
            "text": "In recent years there have been many publications that identify best practice in collecting and reporting offshore wind monitoring data. The project team reviewed these publications and further literature, on existing standardised approaches to environmental surveying and monitoring, to create a list of the most widely recognised standards. These best practice documents and monitoring standards were also used as evidence to determine which environmental receptors were considered, by stakeholders, to be best suited for standardised monitoring. These were marine mammals, seabirds, benthic habitats, underwater noise, fish and shellfish and geophysical surveys."
        },
        {
            "text": "Following the review of literature, the team also examined post-consent monitoring data to create a list of standardisation recommendations. This involved reviewing English offshore wind developments from the past 10 years and their associated post-consent monitoring documentation available through the MMO’s Marine Case Management System (MCMS). Documents were reviewed for explicit references to the monitoring standards identified in the initial research or methodologies that closely aligned. The results were then recorded to allow for a systematic analysis of the consistency or deviation in standards applied for each receptor and any trends that emerged in alternative monitoring approaches. This database was used to create an initial list of recommendations for agreed standards, which became the focus of the stakeholder workshop."
        },
        {
            "text": "The project team organised a workshop, hosted at The Crown Estate, where the recommendations were presented and discussed with stakeholders, such as other government departments and SNCB’s. The workshop saw attendees split into breakout groups, with each facilitator asking the group for opinions with a set of pre-determined questions regarding key issues that had been identified in the previous research stages. Opinions on the recommended standards and their appropriateness were shared by attendees and their responses were recorded, then analysed qualitatively and written up formally in a report."
        },
        {
            "text": "A key piece of feedback from the stakeholder workshop was the need to engage directly with developers and organisations that carry out monitoring to aid the projects team’s understanding of practical challenges associated with the proposed standards. To understand the industry perspective, the project team collaborated with RenewableUK to produce a summary of the recommendations, alongside a questionnaire, which was distributed to the RenewableUK Offshore Consents and Licensing Group, alongside other interested stakeholders, such as The Wildlife Trust and the Isle of Man Government. The results of the survey were then analysed qualitatively and written up formally in a report."
        },
        {
            "text": "All feedback was gathered and analysed to stimulate changes to the final recommendations, which are soon to be published and implemented for use throughout the MMO’s Marine Licensing Team who work on consenting Offshore Wind Farms in English waters. These standards will be used to make decisions on post-consent monitoring reports on whether applicants have completed sufficient monitoring that adheres to the recommended standards."
        },
        {
            "text": "The aim is for the standardised approach to allow data to be compared more easily between projects, which will bring multiple benefits, including making it easier to draw robust conclusions about cumulative impacts and allowing the conclusions from one monitoring programme to be used in assessing the impacts of another project. Over time, this will reduce the uncertainty in assessments by creating a stronger feedback loop between data, evidence, and decision-making. This approach will also enable data to be more easily discovered, shared, and re-used by stakeholders including industry, SNCBs, regulators, and academics, as data will be presented in an accessible and widely understood format."
        }
    ]
}