{
    "url": "https://deframedia.blog.gov.uk/2024/11/12/coverage-following-launch-of-consultation-on-bathing-waters-reform/",
    "title": "Coverage following launch of consultation on bathing waters reform",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-11-12T16:58:16+00:00",
    "content": [
        {
            "text": "There has been widespread positive media coverage today, including on Radio 4’s Today Programme, Good Morning Britain, The Times, iNews and The Guardian following our announcement that the government will review rules around bathing waters."
        },
        {
            "text": "In a consultation launched today (12 November), Defra and the Welsh Government are inviting the public, community groups, environmental groups, farmers, businesses and local authorities to share their views on modernising bathing water regulations to ensure a more flexible approach to designation and monitoring."
        },
        {
            "text": "Bathing waters are officially designated outdoor swimming sites. England and Wales have over 550 designated bathing waters, which are monitored by the Environment Agency and Natural Resources Wales. Annual ratings classify each site as ‘excellent’, ‘good’, ‘sufficient’ or ‘poor’ on the basis of water quality."
        },
        {
            "text": "The proposed changes, which will benefit cold water swimmers and other water sports enthusiasts, include the removal of fixed bathing water season dates (which currently runs from May to September) from the regulations to allow for a more flexible approach to monitoring, extending the dates of the bathing season to better reflect when people use bathing waters."
        },
        {
            "text": "Other proposals include further considering water quality and public safety when applications for new bathing waters are assessed, and ending the automatic removal of bathing water status after 5 consecutive years of a site being rated ‘poor’, to allow time for underperforming sites to be individually reviewed by regulators."
        },
        {
            "text": "Water Minister Emma Hardy said:"
        },
        {
            "text": "“Bathing water sites are the pride of local communities across the country."
        },
        {
            "text": "“But the current system is not working for all those who use and enjoy our bathing waters, and reform is long overdue. "
        },
        {
            "text": "“That is why this Government will give more people the opportunity to experience the benefits of our beautiful waters and connect with nature.”"
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}