{
    "url": "https://valuationoffice.blog.gov.uk/2024/11/12/evidence-to-support-your-council-tax-band-challenge/",
    "title": "Evidence to support your Council Tax band challenge",
    "authors": [
        "Valuation Office Agency"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2024-11-12T11:19:05+00:00",
    "content": [
        {
            "text": "The Valuation Office Agency (VOA) bands every home in England and Wales for Council Tax. Your property’s band determines how much Council Tax you pay."
        },
        {
            "text": "If you think your Council Tax band is wrong, you may be able to challenge it. In this blog, we look at the evidence you need to support a challenge."
        },
        {
            "heading": 2,
            "text": "Band challenges"
        },
        {
            "text": "There are two types of band challenges – proposals and band reviews. Which type of challenge you can submit depends on your circumstances."
        },
        {
            "text": "You can make a proposal if you’ve been paying Council Tax on your property for less than 6 months, or if we’ve changed your band in the last 6 months."
        },
        {
            "text": "When you make a proposal, by law we must review your band."
        },
        {
            "text": "If you think your band is wrong and you’ve been paying Council Tax on your property for more than 6 months, you can request an informal band review."
        },
        {
            "text": "The same legal rights do not apply, and we’ll only take your request forward if you provide strong evidence that your band is wrong."
        },
        {
            "text": "This is usually the addresses of up to five comparable properties or sales information."
        },
        {
            "heading": 2,
            "text": "Comparable properties"
        },
        {
            "text": "A comparable property is a property that is similar to yours. To decide whether properties can be compared, we consider four main details."
        },
        {
            "text": "Location"
        },
        {
            "text": "A comparable property should be in the same street or estate as yours, if you live in a town or city. In the countryside, they should be within 10 miles. This distance may be greater in rural areas, or if your property is unusual."
        },
        {
            "text": "Type"
        },
        {
            "text": "Comparable properties should be the same style as yours, with similar features. Houses should always be compared with houses, and flats with flats. If your property is semi-detached, your comparable properties should be too."
        },
        {
            "text": "Age"
        },
        {
            "text": "A property must have been built in the same time period as yours to be comparable. This means a property built before 1900 could not be compared to a new-build property."
        },
        {
            "text": "Size"
        },
        {
            "text": "Comparable properties can be smaller or larger than your own, usually within 10%. Focus more on the actual size of properties, rather than number of bedrooms. It’s important to remember that some properties may seem much larger than yours but in the same band. This may be because of improvements (which we cannot consider until the property is sold) or other characteristics affecting the value."
        },
        {
            "heading": 2,
            "text": "Sales information"
        },
        {
            "text": "You can also use sales information as evidence to support your challenge."
        },
        {
            "text": "The sale of your property or a similar property must have taken place between the following dates to be valid evidence:"
        },
        {
            "text": "Read more about using evidence from house prices."
        },
        {
            "text": "You should avoid using data from house price calculators as evidence in your challenge. This is because the data is broad and usually not specific to particular locations."
        },
        {
            "heading": 2,
            "text": "Why you need to submit evidence"
        },
        {
            "text": "The circumstances when the VOA has to review your band are set out in law. Not everyone has a right to challenge their Council Tax band, and we are not required to look at every request we receive."
        },
        {
            "text": "But we want customers to be in the right Council Tax band. That’s why we ask you to set out why you think your band is wrong. It helps us identify cases most likely to result in a change, so we can review any potential errors and deal with cases quicker."
        },
        {
            "text": "To learn more about Council Tax band challenges, read our guide to challenging your Council Tax band."
        }
    ]
}