{
    "url": "https://gds.blog.gov.uk/2024/11/12/gov-uk-one-login-celebrating-50-services/",
    "title": "GOV.UK One Login: celebrating 50 services ",
    "authors": [
        "Natalie Jones OBE - Director of Digital Identity, Government Digital Service"
    ],
    "categories": [
        "GOV.UK One Login"
    ],
    "pub_date": "2024-11-12T14:51:42+00:00",
    "content": [
        {
            "text": "As we come to the end of our initial three-year phase, GOV.UK One Login is now fully operational, and I’m delighted to be able to tell you that we’ve passed a golden milestone. "
        },
        {
            "text": "As of October 2024, 50 services are using GOV.UK One Login for authentication and identity-proving. This is testimony to the hard work of not just the GDS teams developing the product, but all those in service teams across government who have worked to help us understand what their users need and to onboard to our service. This shows that GOV.UK One Login is fulfilling its purpose, empowering more teams to streamline their processes, and delivering tangible benefits for departments and end-users. "
        },
        {
            "text": "The Department for Education ‘Confirm my Apprenticeship’ is officially our 50th service. With five Apprenticeship services now using GOV.UK One Login, employers, citizens, and apprentices are enjoying an improved user experience and are saving time as they access the services they need."
        },
        {
            "text": "Gary Tucker, Deputy Director, Digital Skills Portfolio from the Department for Education said: "
        },
        {
            "text": "It's exciting to see how GOV.UK One Login’s adoption continues to expand, boosting efficiency and collaboration while validating all the hard work that's gone into its development. A huge thanks to all our services who have onboarded and our colleagues who continue to work hard to achieve our shared objectives."
        },
        {
            "heading": 1,
            "text": "A modern digital government "
        },
        {
            "text": "With the recent change of government, GDS - including teams working on GOV.UK One Login - has moved to the Department for Science, Innovation and Technology (DSIT), alongside the Central Digital and Data Office (CDDO) and the Incubator for AI (i.AI)."
        },
        {
            "text": "This move will drive forward the digital changes needed to overhaul the British public’s experience of interacting with the government, so it becomes personalised, convenient, and timesaving – for example, by providing people with just one way to login and prove who they are so they can quickly access the government services they need. It will also help remove roadblocks to sharing data across the public sector."
        },
        {
            "text": "We have always worked closely with others in DSIT, and this move unites our efforts to create a modern digital government with a strong mandate for change. Our work in GOV.UK One Login will continue to drive forward a modern digital government that gives citizens a better experience, and their time back. "
        },
        {
            "heading": 1,
            "text": "A front door open to all users "
        },
        {
            "text": "GOV.UK One Login is providing a secure front door to all government services, and so accessibility is vital. Over the past year we’ve honed in on inclusion, broadening the range of documents and evidence that people can use to prove who they are. We are now at a place where we can verify someone's identity with a range of different documentation, including UK biometric residence permits and knowledge-based verification questions.  "
        },
        {
            "text": "Last October, we established our face-to-face route for identity verification meaning people can instead choose to visit their local Post Office to complete this part of the journey. Enabling a face-to-face route is a huge step in enabling access to One Login for people who may not have the confidence to complete things online, or those without a smartphone."
        },
        {
            "text": "At the same time we also opened a contact centre, so that users who were struggling to prove who they are could call us and get support at the time they need it. If you’d like to find out more about the contact centre’s offering, check out our latest blog post here. "
        },
        {
            "heading": 1,
            "text": "Making our service even better for citizens"
        },
        {
            "text": "But 50 is clearly not our end goal, with many more services on our roadmap in the future with HM Revenue and Customs, the Department for Work and Pensions, and the Driver and Vehicle Licensing Agency soon to come on board. This achievement not only shows the programme's success but also highlights its potential to continue transforming how we work, collaborate, and serve users."
        },
        {
            "text": "And throughout, our mission remains clear: save taxpayer money by cutting duplication, and make life easier for people with a simpler, faster login process. We’re opening doors for genuine users while keeping fraudsters at bay. Every step we take gets us closer to that goal and we won’t stop until we truly achieve One Login for all services. "
        },
        {
            "text": "Until next time, Natalie. "
        }
    ]
}