{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/12/reflections-on-biodiversity-net-gain-9-months-after-going-live/",
    "title": "Reflections on Biodiversity Net Gain: 9 months after going live",
    "authors": [
        "Rachel Fisher"
    ],
    "categories": [
        "Biodiversity net gain",
        "Land use",
        "Nature"
    ],
    "pub_date": "2024-11-12T08:57:10+00:00",
    "content": [
        {
            "text": "It’s exciting to think that biodiversity net gain (BNG) has been mandatory for major developments for nine months now, and smaller developments for seven."
        },
        {
            "text": "With its system of incentives to encourage reduced impact on habitats, its tool to calculate biodiversity value, and the emerging private market for biodiversity units, BNG is genuinely a world-leading policy."
        },
        {
            "text": "We are all eager to see improvements to biodiversity, but this is a marathon not a sprint."
        },
        {
            "text": "BNG applies as a ‘post permission requirement’ to ensure that site designs are finalised before the biodiversity units needed are calculated. That means we are only recently beginning to see increasing numbers of developments come through with the biodiversity gain condition applied."
        },
        {
            "text": "I wanted to share my reflections on the progress we’ve seen, as well as the areas we’re keeping an eye on as the policy is bedded in."
        },
        {
            "text": "Local authorities have been doing their part"
        },
        {
            "text": "Through the Planning Advisory Service, we have been working closely with local planning authorities. We’ve been impressed by their willingness to learn about and engage with BNG."
        },
        {
            "text": "Planning authorities are scrutinising planning applications to ensure the 10% BNG requirement is being correctly applied, and entering into legal agreements with off-site habitat bank operators in their area. Some are even using their own land to boost the local market for biodiversity units."
        },
        {
            "text": "To support local planning authorities with applications, the Planning Advisory Service have provided resources including FAQs, webinars and case studies."
        },
        {
            "text": "The off-site biodiversity market is growing"
        },
        {
            "text": "Natural England’s BNG register records places providing off-site biodiversity units, for when a developer cannot deliver biodiversity gains on the same site as the development."
        },
        {
            "text": "We have seen a slow but steady number of off-site habitats being added to the register. There are currently 19 gain sites on the register, totalling over 500 hectares of habitat. We anticipate this will increase as the off-site market develops."
        },
        {
            "text": "We are also making progress with the designation of responsible bodies, with 17 now designated at the time of writing, including 9 councils. "
        },
        {
            "text": "Responsible bodies are local authorities, charities or public groups who can enter into legal agreements with landowners and take responsibility for the integrity of off-site BNG units."
        },
        {
            "text": "These designations will help to increase the number of gain sites available for off-site BNG going forward."
        },
        {
            "text": "We’ve improved user tools and guidance"
        },
        {
            "text": "In July, we made improvements to the BNG metric tool and user guide, in response to user feedback."
        },
        {
            "text": "Our changes do not impact the calculation of biodiversity value, but they should improve the user experience."
        },
        {
            "text": "We have also recently updated our guidance on:"
        },
        {
            "text": "We will continue to refine our GOV.UK guidance as necessary."
        },
        {
            "text": "Exemptions to biodiversity net gain are working as expected"
        },
        {
            "text": "Some developments are exempt from BNG."
        },
        {
            "text": "We have heard some concerns about the number of applications receiving planning permission that are exempt from BNG. We are collecting more data on the details, but early indications are that the system is working as intended."
        },
        {
            "text": "Developments that have low or no biodiversity impact, such as those on tarmac or household extensions, do not need to deliver a gain. This exemption ensures that BNG is applied proportionately, and encourages developers to avoid impacting biodiversity in the first place."
        },
        {
            "text": "Because householder applications (exempt from BNG) make up the majority of planning applications, we would always expect a lower number of applications for developments that do deliver a net gain."
        },
        {
            "text": "These applications will be the ones that are impacting biodiversity and where, as a result of BNG, we will see actual biodiversity improvements."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "We will continue to work closely with stakeholders across the country to develop the policy. We’re also starting to see the emergence of exciting technology to support stakeholders with BNG compliance."
        },
        {
            "text": "It’s not often you get to be a part of the start of lasting change – so, thank you to all whom have been involved in this process, and for being a part of the journey!"
        }
    ]
}