{
    "url": "https://environmentagency.blog.gov.uk/2024/11/12/reporting-water-pollution-to-get-easier-with-new-online-service/",
    "title": "Reporting water pollution to get easier with new online service ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Rivers",
        "Sustainability",
        "Water"
    ],
    "pub_date": "2024-11-12T09:05:19+00:00",
    "content": [
        {
            "text": "We’re piloting a new digital service to provide more ways for the public to report environmental problems. "
        },
        {
            "text": "Public reporting of water pollution, odours, flooding or wildlife concerns is an important way that we are alerted to environmental incidents.  Our national incident hotline receives more than 100,000 calls each year from the public to alert us to potential incidents. All these reports are recorded and assessed so that we can direct our response efforts to where they will make the most difference.   "
        },
        {
            "text": "Until now, we’ve offered a national hotline to get this intelligence but next year we will be launching a new digital service for the public to report environmental problems online. It will be available alongside our call centre to provide more options for the public to alert us.  The move reflects the growing demand for more online government services and aligns with our commitment to provide easier ways to work with the Environment Agency.  "
        },
        {
            "text": "The new ‘Report an environmental problem’ service is currently undergoing testing with members of the public to report water pollution and will be released fully in 2025.  We’ll also shortly be introducing a way to report odours, with further incident types like flooding and wildlife concerns coming next year.  To test the water pollution reporting service, we’re contacting groups and individuals who spend time around rivers and water courses in certain locations to ask them to use the service over the coming months.  Testing with the public will help us to make improvements ahead of the full launch next year.    "
        },
        {
            "text": "Every report we receive, whether it’s reported by phone or online, will give us a clearer picture of the nature and scale of environmental problems occurring in our communities. This valuable intelligence helps us to plan and prioritise our work to protect the environment.  "
        },
        {
            "text": " \"This development is part of a series of digital improvements within the Environment Agency that will advance how we respond to incidents and modernise our services for the public. We're future proofing our capabilities to manage the growing demands on our services, particularly as the effects of climate change intensify,” said Pete Connolly, Deputy Director of Incident Management  Digital Services at the Environment Agency. "
        },
        {
            "text": "“For example, next year we will launch a new flood warning service following extensive work to replace the existing 20-year-old system.  We’re also making increased use of artificial intelligence to enhance our wider incident management service.” "
        },
        {
            "text": "We are committed to listening to the public and using the information we collect to work towards a cleaner, healthier environment. The new service will allow us to do that in an even more responsive and effective way. "
        },
        {
            "text": "The new ‘Report an environmental problem’ service will be launched next year once testing has been completed.  "
        },
        {
            "text": "Subscribe to get new blog updates from the Environment Agency delivered to your inbox, or follow us on X.   "
        }
    ]
}