{
    "url": "https://forestrycommission.blog.gov.uk/2024/11/12/the-benefits-of-mosses-liverworts-and-lichen/",
    "title": "The benefits of mosses, liverworts and lichen",
    "authors": [
        "Emily Robinson"
    ],
    "categories": [
        "Nature",
        "Woodland management"
    ],
    "pub_date": "2024-11-12T10:00:00+00:00",
    "content": [
        {
            "text": "They can be easily overlooked due to their small size, but mosses, liverworts and lichens are valuable parts of any forest or woodland.  "
        },
        {
            "text": "Autumn is a great time to observe them as temperatures cool down and rainfall increases. Now is the perfect time to appreciate their contribution to our woodland ecosystems. "
        },
        {
            "text": "Mosses and liverworts are part of a group of plants called bryophytes, whereas lichen is a mix of mutually benefitting organisms. There are over 1,000 species of bryophyte (mosses and liverwort) and 1,800 species of lichen in the UK. All three reproduce by releasing spores, don’t have ‘true’ roots and were around before the dinosaurs. "
        },
        {
            "text": "You might find them growing on trees, but they aren’t parasitic – they're just looking for somewhere to grow. "
        },
        {
            "heading": 2,
            "text": "Mosses"
        },
        {
            "text": "Mosses play a key role in woodlands as some of the first plants to grow on bare ground. They absorb water, reduce runoff and soil erosion, and improve soil for other plants. "
        },
        {
            "text": "There are hundreds of species of mosses in the UK, of countless shapes and textures. Species like sphagnum moss thrive in boggy areas including wet woodland. As they’re incorporated into the soil they can lock away carbon. "
        },
        {
            "text": "Grazing animals avoid mosses due to their low nutritional value. This makes them a safe habitat for small invertebrates like tiny tardigrades. Tardigrades - known colloquially as water bears - are some of the world’s smallest animals, measuring 1mm or less!  "
        },
        {
            "text": "Mosses also act as natural water filters, trapping pollutants and improving water quality in streams and ponds. This creates healthier aquatic habitats in riparian areas, benefiting fish and amphibians. "
        },
        {
            "text": "Many birds and bees also use moss to build their nests. "
        },
        {
            "heading": 2,
            "text": "Liverworts"
        },
        {
            "text": "Liverworts can look similar to mosses. Where mosses have distinct stems and leaves, liverworts have a combined structure of leaves, stems and flattened lobes. There are hundreds of varieties in the UK. "
        },
        {
            "text": "There are two types of liverworts:  "
        },
        {
            "text": "Liverworts thrive in damp conditions, especially in western parts of the UK. They can grow on rocks, mud, soil and trunks – so long as the conditions are right. "
        },
        {
            "text": "Liverworts stabilize soil and riverbanks, reducing water evaporation and helping new plants grow. "
        },
        {
            "heading": 2,
            "text": "Lichen"
        },
        {
            "text": "Lichens are made of two organisms: an alga and a fungus (and sometimes a third, cyanobacteria). This means lichens aren't plants!  "
        },
        {
            "text": "Each organism supports the other, allowing them to survive together. The fungus gives the lichen its shape and fulfils reproductive duties. In return, the algae photosynthesise to produce food, which the fungus can't do on its own. "
        },
        {
            "text": "Lichens grow on various surfaces like leaves, tree bark, mosses, soil, and rocks. They help in soil production by breaking down rocks into smaller particles. And birds like long-tailed tits use lichens to build their nests. "
        },
        {
            "text": "Since lichens get all their nutrients from the air, they serve as excellent indicators of air quality. Two major pollutants, nitrogen and sulphur dioxide, affect lichen growth. Lichens react quickly to these pollutants and studying them can reveal harmful substances in the air that may pose wider risks."
        },
        {
            "heading": 2,
            "text": "Protecting mosses, liverworts and lichen"
        },
        {
            "text": "Here are some top tips to help these species to thrive in your woodland: "
        }
    ]
}