{
    "url": "https://companieshouse.blog.gov.uk/2022/03/30/a-career-in-the-civil-service/",
    "title": "A career in the Civil Service",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Working at Companies House"
    ],
    "pub_date": "2022-03-30T15:21:22+01:00",
    "content": [
        {
            "text": "The Civil Service is one of the largest employers in the UK, with over 481,000 colleagues across the country. The work civil servants do touches all aspects of people’s lives on a daily basis, from education and the environment, to the economy and defence."
        },
        {
            "text": "The stereotypical image of the civil servant, strolling to work in central London, wearing a dark suit and bowler hat with an umbrella doubling as a walking stick, has hopefully been consigned to history. Today’s Civil Service offers career opportunities across the UK in a variety of roles. Whatever your passion or background, there are a broad range of interesting and rewarding jobs."
        },
        {
            "text": "If you think the Civil Service is based only in London, think again. 80% of civil servants are based outside of the capital. At Companies House we have offices in:"
        },
        {
            "text": "Although these offices serve as a central point for our work activities, we’re moving towards a flexible hybrid approach which combines both home and office-based working with some roles, where appropriate, being fully remote."
        },
        {
            "text": "The evolution from fixed working patterns to highly flexible work arrangements is a journey currently being undertaken by many employers. Although it’s still possible to work 9am to 5pm in a desk-based role, most of our teams work flexibly, having the advantage of being able to work between 6am and 8pm with no core hours."
        },
        {
            "heading": 2,
            "text": "Equality, diversity and inclusion"
        },
        {
            "text": "The Civil Service is a modern employer, committed to promoting equality and valuing diversity. With its commitment to Levelling Up, it needs to be able to attract, retain and invest in talent wherever it’ is found. It’s for this reason, the Civil Service wants to have a truly diverse workforce and culture of openness and inclusivity, as a way of delivering better outcomes for the citizens it serves."
        },
        {
            "text": "Companies House also strives to mirror these values and is an equal opportunities employer. Our ambition is to build an inclusive, positive culture where everyone can bring their whole selves to work, valuing diversity across our organisation."
        },
        {
            "text": "Having a workforce with a diverse range of experience, skills and backgrounds allows us to look at problems from different perspectives and improve our decision making, which reflects the nature of our customers. This culture also enables our brilliant people to flourish and drives high performance."
        },
        {
            "text": "We’ve already made significant progress, introducing a range of diversity networks to support and understand the needs of underrepresented groups. Building on this, we’re working on our attraction and recruitment rates for underrepresented groups."
        },
        {
            "heading": 2,
            "text": "Civil Service professions"
        },
        {
            "text": "The Civil Service prides itself on being a great place to work. It's built on a belief that everyone has the potential to make a difference, and a desire to make sure colleagues are equipped with the knowledge and skills to do so."
        },
        {
            "text": "Joining the Civil Service allows you to become part of a profession. Your profession offers networking opportunities, career routes, training and development programmes and a real sense of belonging.  There are currently 28 recognised professions, from communicators and engineers, to procurement managers and lawyers, each led by a head of profession."
        },
        {
            "text": "One of the most important things about being in a profession is that you are part of a wide cross-government community. You get the opportunity to talk to, and build relationships with, people just like you. People who are doing similar or possibly very different roles, but people that you can share your experience with and learn from."
        },
        {
            "text": "Having a wide network opens up a wealth of opportunities for you to shape your career and move across departments and professions. You can find out more about each profession on the Civil Service careers website, and use the career matcher tool to see areas that could be a good fit."
        },
        {
            "text": "At Companies House, our 5-year strategy sets out a vision for the future, a different organisation with different skills and requirements in our roles. Having professions in place will help prepare us all to be a part of the Companies House of the future, so we can adapt to new requirements, focus on our development, learn from others, and use our professional skills to help us transform and achieve this vision."
        },
        {
            "heading": 2,
            "text": "Career paths"
        },
        {
            "text": "Another common phrase that’s heard in association with civil servants is ‘pen pusher’ - implying that the work consists of routine office work involving mostly paperwork. As you’ll see if you visit the Civil Service careers website the roles and professions are diverse and varied and no matter what your specialism or passion, there’s a path for you."
        },
        {
            "text": "The modern Civil Service is a vibrant and varied working environment, offering opportunities for employees from all backgrounds. Joining the Civil Service will give you access to exceptional learning and development opportunities and a variety of career paths. Regardless of the type of career path, everyone can flourish in an organisation that puts a great deal of importance on its people."
        },
        {
            "text": "Applying for a role at Companies House will allow you to receive all the benefits of becoming a civil servant but also the opportunity to join the organisation at an exciting time. We’re currently undergoing a multi-year organisational transformation, adapting to changing legislation, customer and stakeholder expectations, and new technical capabilities. We've got interesting, meaningful and purposeful roles to offer in an organisation that has a positive and innovative attitude and a culture that allows everyone to thrive and prosper."
        }
    ]
}