{
    "url": "https://defencedigital.blog.gov.uk/2022/03/30/a-faster-way-forward-for-defence-innovation/",
    "title": "A FASTER way forward for Defence innovation",
    "authors": [
        "Rear Admiral Donald J.M. Doull"
    ],
    "categories": [
        "Defence Nuclear Orgainsation",
        "Navy Digital",
        "Submarine Delivery Agency"
    ],
    "pub_date": "2022-03-30T12:38:45+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What slows down Defence innovation?"
        },
        {
            "text": "In his July 2021 Defence Digital Blog, Brigadier Stefan Crossfield highlights the deep cultural, Intellectual Property, and Agile procurement challenges to the digital transformation of Defence. For decades, the scale and pace of pull through from Science & Technology into UK Defence capability has been hampered, not only by monolithic system designs that cannot be upgraded piecemeal but also by contracting arrangements that deprive the Ministry of Defence (MOD) of freedom of action over the deliverables it pays for. Architectures that claim to be open, and that promise flexibility, have proved in practice to be closed, and to provide only rigidity, since the UK government does not possess the details of internal designs and external interfaces, let alone the right to change them."
        },
        {
            "heading": 2,
            "text": "A FASTER way forward"
        },
        {
            "text": "The FASTER programme, sponsored by the Defence Nuclear Organisation and delivered to the Submarine Delivery Agency by Navy Digital, is demonstrating a different way forward. FASTER aims to build on the innovative spirit that traditionally characterises UK military operations, and that is needed more than ever today to counter new forms of competitive threat. FASTER not only showcases an advanced Platform-as-a-Service concept that enables the loose coupling of small components (microservices) by insisting that they bring their own support for assurance, but also pioneers an equally modern approach to contracting by developing a supplier community that is collaborative, diverse, inclusive, and enabling of all Defence Lines of Development."
        },
        {
            "text": " "
        },
        {
            "text": "Figure 1: FASTER Programme Operating Model"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The FASTER Community and Collaboration Charter"
        },
        {
            "text": "To engage with technology innovators across MOD, in academia, and from industry, FASTER has created a Community and Collaboration Charter. This Charter for the FASTER supplier community offers organisations of all types a new way to work with government and with each other. The result will be rapid insertion into military capability of technology that is not only sustainable and resilient but antifragile. In the 21st century, Defence like other parts of society must do more than face up to change. It must learn to thrive on it. Suppliers who join the FASTER community will gain the chance to join MOD on that journey."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Engage with FASTER"
        },
        {
            "text": "FASTER will start a series of engagement events in 2022. Technology innovators from MOD, academia, and industry are encouraged to join our mailing list and stay informed of opportunities to engage with the FASTER programme. To do so, please email the FASTER team."
        }
    ]
}