{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/03/30/business-current-accounts-how-weve-made-your-business-account-work-harder/",
    "title": "Business Current Accounts: how we’ve made your business account work harder",
    "authors": [
        "Peter Hill"
    ],
    "categories": [
        "Consumer protection",
        "Remedies"
    ],
    "pub_date": "2022-03-30T12:12:15+01:00",
    "content": [
        {
            "text": "Opening a Business Current Account (BCA) can be stressful if you don’t know where to start or what you’re signing up to."
        },
        {
            "text": "At the Competition and Markets Authority (CMA), we’ve made requirements for banks to make it easier for you to open the right BCA for your business. This means you can now save money by having the right BCA for your business’ needs with the bank of your choice."
        },
        {
            "heading": 2,
            "text": "Benefits of easy access to Business Current accounts"
        },
        {
            "text": "Business banking customers shouldn’t be forced into having a business account with a bank just because they have a loan or savings account with that bank. It’s not often obvious when you open a BCA account – some BCAs often have charges for usage. So, opening the wrong account can be costly for your business."
        },
        {
            "text": "It’s now easier for businesses to choose and open the account that best meets their needs; this means that banks have a reason to offer a wide range of services at different costs."
        },
        {
            "text": "This is not only beneficial to individual businesses; it can also benefit everyone else as banks need to work harder to keep their customers."
        },
        {
            "text": "What we’ve put in place to make it easier to open a business account of your choice"
        },
        {
            "text": "We’ve introduced requirements for banks to make choosing and opening a business account easier. We call these ‘remedies’ and these are designed to:"
        },
        {
            "heading": 2,
            "text": "What we’ve done to stop ‘bundling’ business accounts"
        },
        {
            "text": "The SME Banking Undertakings ban of the UK’s longer established banks from forcing or threatening to force, businesses to open or maintain a business account if they take out loans or open a savings account with that bank."
        },
        {
            "text": "The banks that are banned from bundling are: AIB Group (UK) plc; Bank of Ireland; Barclays Bank plc; Clydesdale Bank plc, HSBC Bank plc, Lloyds Banking Group, Danske Bank and NatWest Group plc (formerly the Royal Bank of Scotland Group which includes Ulster Bank Limited in Northern Ireland)."
        },
        {
            "text": "We’ve taken enforcement action against HSBC for bundling business accounts with loans."
        },
        {
            "heading": 2,
            "text": "Better guidance about costs of banking"
        },
        {
            "text": "Our Retail Banking Market Investigation Order 2017 requires banks to publish correct information about banking loan costs. The Market Investigation also introduced Open Banking, which became live in 2018, and benefits customers by having:"
        },
        {
            "text": "Open banking apps allow you to search for financial products offered by different banks and easily compare costs, for example, their transaction tariffs. This way you can identify which current account and which bank best fits your business’ financial patterns."
        },
        {
            "heading": 2,
            "text": "Transparency about banks’ quality of service"
        },
        {
            "text": "To help you make the decision on which bank to pick, we require banks to publish information on how good the service they provide is in comparison with other banks."
        },
        {
            "text": "This is called a Service Quality Indicator (SQI), which is a simple customer satisfaction report that banks publish. These are published separately for personal current accounts and business current accounts, and it should be easy to find SQIs on bank and building society websites and displayed in branches."
        },
        {
            "heading": 2,
            "text": "Making account opening policies clearer to understand"
        },
        {
            "text": "The Retail Banking Market Investigation Order 2017 introduced measures to make the process of opening a new business account clearer."
        },
        {
            "text": "The 2016 Retail Banking Market Investigation final report also made recommendations which culminated in guidance for SMEs, produced by UK Finance, on a new standardised process."
        },
        {
            "heading": 2,
            "text": "Easier switching between banks"
        },
        {
            "text": "We required improvements to be made to the Current Account Switch Service (CASS). This service is free to use. If you choose to move to a different business account, CASS redirects any payments from your old bank to your new account."
        },
        {
            "text": "This means you don’t have the hassle of having to sort that out yourself. CASS is also backed by the Current Account Switch Guarantee, which guarantees that any charges incurred on your old or new account as a result of a failure of the switching process, will be refunded."
        },
        {
            "text": "Further information on CASS can be found on Why switch."
        },
        {
            "text": "We’re continuing to monitor banks to make sure that they’re complying with these remedies so that you can easily open the right business account for your business with a bank of your choice."
        }
    ]
}