{
    "url": "https://civilservicelocal.blog.gov.uk/2022/03/30/civil-service-local-closure/",
    "title": "Civil Service Local closure",
    "authors": [
        "John Mark Haskey"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2022-03-30T14:32:39+00:00",
    "content": [
        {
            "text": "With effect from 1 April 2022, Civil Service Local is no longer in operation."
        },
        {
            "heading": 4,
            "text": "Thank you"
        },
        {
            "text": "We would like to thank you for working with us over the last 11 years, whether you’ve been with us throughout our time, or just recently become involved. It has been a pleasure working in partnership with so many different civil servants across the full range of departments and agencies, and across the whole country. We look forward to working with many of you again in the future in the new roles that we will be undertaking to help build the vision of a skilled, innovative and ambitious Civil Service equipped for the future."
        },
        {
            "heading": 4,
            "text": "Who we were"
        },
        {
            "text": "Civil Service Local (CS Local) was a cross-departmental team that was part of the Cabinet Office but based in locations around Scotland, England, Northern Ireland and Wales. Its purpose was to bring together departments and agencies within each locality to deliver actions and opportunities that brought the vision for a Modern Civil Service to life, and encouraged more of us to be part of it."
        },
        {
            "text": "Some of its former functions are now being taken forward by different parts of the Cabinet Office."
        },
        {
            "heading": 4,
            "text": "Learning and development"
        },
        {
            "text": "Civil Service Local activity that focused on learning and development for civil servants is now delivered through the Government Skills and Curriculum Unit (GSCU)."
        },
        {
            "heading": 4,
            "text": "Heads of Place"
        },
        {
            "text": "Reform and modernisation of the Civil Service to serve our citizens more effectively is the responsibility of the Modernisation and Reform Unit. Some aspects of regional/national reform will be taken forward through the Heads of Place programme, based in the Modernisation and Reform Unit."
        },
        {
            "heading": 4,
            "text": "Further information"
        },
        {
            "text": "You may wish to visit civilservice.blog.gov.uk which offers news, events and personal stories and insights on working in and across government."
        },
        {
            "text": "Please be aware that this blog will not be maintained or monitored, and information accessed through historical links will not be up to date."
        }
    ]
}