{
    "url": "https://naturalengland.blog.gov.uk/2022/03/30/counting-down-preparing-for-mandatory-biodiversity-net-gain/",
    "title": "Counting down – preparing for mandatory biodiversity net gain",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2022-03-30T15:24:39+01:00",
    "content": [
        {
            "text": "I recently wrote about the Defra Consultation on biodiversity net gain (BNG). The consultation seeks feedback on topics and issues relating to the development of the frameworks, legislation and guidance of mandatory biodiversity net gain (BNG)."
        },
        {
            "text": "If you haven’t already responded to the consultation, please do! Remember the last day for comments is 5 April 2022."
        },
        {
            "text": "To help stakeholders prepare for mandatory BNG, Natural England has produced a short, high-level brochure introducing BNG."
        },
        {
            "text": "The brochure summarises the forthcoming mandatory approach to BNG, the opportunities BNG presents and what it might mean for developers, landowners and Local Planning Authorities. It offers a great introductory resource, whether you’re new to net gain yourself or starting the conversation with others."
        },
        {
            "text": "The brochure introduces the concept of net gain, highlighting the benefits it can deliver for nature, people and the economy. It also draws attention to resources that can be accessed now, with further information, guidance and advice on the approach as it develops."
        },
        {
            "text": "So, are you and your organisation ready for biodiversity net gain?"
        },
        {
            "text": "What can you be doing to prepare?"
        },
        {
            "text": "Firstly, read the brochure and the consultation. Both set out information that can help you get ready for the implementation of mandatory BNG. Whilst some of the details of how BNG will work in practice are still unknown, there’s plenty that can be done now to help get ready for when it becomes mandatory in November 2023."
        },
        {
            "text": "The transition period over the next 20 months or so, is an opportunity to get ready for BNG as a requirement on most Town and Country Planning Act developments. The more all of us consider how to implement BNG from our differing perspectives, the better the detailed guidance and outcomes will be.\nEarly consideration of BNG in your plans and projects is just one way in which you can start thinking, but here’s a few other things you can start doing now:"
        },
        {
            "text": "There are also actions that we can all take, for example getting familiar with processes and tools like the Biodiversity Metric - The Biodiversity Metric 3 training for Planners hosted by the Planning Advisory Service is a good place to start."
        },
        {
            "text": "Finally, there are a number of ways to get involved with the work Defra and Natural England are undertaking to feed back and help develop the detail of how BNG will be implemented. For example, Natural England is eager to speak to users and future users, including developers, so that we are able to develop services which meet their BNG needs."
        },
        {
            "text": "Kick-start your thinking with Natural England’s brochure on biodiversity net gain"
        }
    ]
}