{
    "url": "https://defrafarming.blog.gov.uk/2022/03/30/fertiliser-updates-and-support/",
    "title": "Fertiliser: updates and support",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-03-30T10:47:31+01:00",
    "content": [
        {
            "text": "The price of fertiliser has risen dramatically over the past year, but especially in recent months. Multiple global issues, including the war in Ukraine, have reduced gas and ammonium nitrate supply, forcing prices up. "
        },
        {
            "text": "We know the impact of this affects the productivity and profit of farms in this country. We want to support our farmers through this growing season and beyond.  In this post, we will share some updates in this area, they include:"
        },
        {
            "text": "We’d also like to share the schemes we have in place to support farmers. "
        },
        {
            "heading": 2,
            "text": "New slurry guidance "
        },
        {
            "text": "New guidance has been developed to help farmers limit their use of slurry and other farmyard manure at certain times of year.  It can be found under ‘Farming Rules for Water’ on GOV.UK."
        },
        {
            "text": "It clarifies the Environment Agency's enforcement approach. The guidance was developed with farmers and farming organisations."
        },
        {
            "heading": 2,
            "text": "Changes to the use of urea fertiliser "
        },
        {
            "text": "You might remember that Defra ran a consultation to reduce ammonia emissions from urea fertilisers. It began last November and ended in January. "
        },
        {
            "text": "In response, an industry farm assurance scheme, originally planned to start this year will now be delayed by at least a year. This delay will help farmers to manage their costs and give them more time to adapt."
        },
        {
            "text": "An industry consortium proposed an alternative approach to be delivered through Red Tractor Farm Assurance schemes and Fertiliser Advisers Certification and Training Scheme (FACTS) advisers from 2023."
        },
        {
            "text": "The new Red Tractor standards will require scheme members to:"
        },
        {
            "text": "The effectiveness of the scheme will be monitored. Regulation will be introduced if the scheme does not achieve the ammonia reductions needed."
        },
        {
            "text": "When the industry scheme’s restrictions are introduced, they will be related to the use of ammonia inhibitors rather than a complete ban. Learn more about the consultation. "
        },
        {
            "heading": 2,
            "text": "A fertiliser roundtable"
        },
        {
            "text": "On Thursday 31 March, we will hold an industry roundtable chaired by Minister Victoria Prentis to look at the issues faced by fertiliser industry and impact on farmers."
        },
        {
            "text": "This roundtable will include representatives from:"
        },
        {
            "text": "We will write a post after the roundtable discussion to update you. "
        },
        {
            "heading": 2,
            "text": "Additional support for farmers "
        },
        {
            "heading": 3,
            "text": "Slurry grants "
        },
        {
            "text": "Later this year, farmers will be able to apply for slurry storage grants, helping them meet the Farming Rules for Water and reducing dependence on artificial fertilisers by storing organic nutrients until needed or for onward processing. "
        },
        {
            "text": "These grants will contribute towards the costs of covered slurry store construction projects, to enable farmers to get to 6 months storage capacity.  "
        },
        {
            "text": "The grant will be available for a range of store types depending on what is most appropriate for each farm. "
        },
        {
            "text": "The grant will be a new theme under the Farming Transformation Fund, part of the Farming Investment Fund. We intend to open for a first round of applications this coming autumn with more details on the scheme published in early summer to allow farmers to get started with their project planning. "
        },
        {
            "text": "You might be interested in reading about how we developed slurry grants. "
        },
        {
            "heading": 3,
            "text": "The Sustainable Farming Incentive"
        },
        {
            "text": "The Sustainable Farming Incentive will support farmers to build the health and fertility of soil and to reduce soil erosion. "
        },
        {
            "text": "We will pay to help with the costs of sowing nitrogen fixing plants and green manures in crops to substitute some fertiliser requirements for the coming season and reduce dependence on manufactured fertilisers linked to the price of gas. We've just published details of payment rates and standards. "
        },
        {
            "text": "We expect the scheme to launch in June, so do subscribe to the blog for an alert when that happens. "
        }
    ]
}