{
    "url": "https://defrafarming.blog.gov.uk/2022/03/30/fip-info/",
    "title": "Farming Innovation Programme: 2 new competitions launched",
    "authors": [
        "Niall Bradshaw"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2022-03-30T10:50:48+01:00",
    "content": [
        {
            "text": "Last month, we shared the funding opportunities available through the Farming Innovation Programme in 2022."
        },
        {
            "text": "Funding from across the Farming Innovation Programme will help England’s farmers and growers to use new, innovative methods and technologies to become more productive, environmentally sustainable, and more resilient to the global food security challenges of the future. "
        },
        {
            "text": "From today, Wednesday 30 March, you can apply for a share of £20.5 million funding in 2 new competitions in the Farming Innovation Programme in partnership with UK Research and Innovation (UKRI). "
        },
        {
            "text": "They are:"
        },
        {
            "text": "Here’s some more information about these competitions and our priority areas for innovation."
        },
        {
            "heading": 2,
            "text": "The Farming Futures Research and Development Fund"
        },
        {
            "text": "This competition focuses on further delivering food security through productive, sustainable ‘climate smart farming’. "
        },
        {
            "text": "We will fund large-scale, ambitious, and transformative projects that focus on mitigating greenhouse gas emissions or help the sector adapt to climate change."
        },
        {
            "text": "£12.5 million is available in this competition. Businesses or researchers can lead these projects, but projects must be collaborative and must benefit farmers and growers based in England. Projects will be valued between £3 million and £6 million and will last up to 4 years."
        },
        {
            "text": "To apply, you will first need to submit a short Expression of Interest, setting out your idea. You can do this from today, Wednesday 30 March. The applications window will close on 18 May. "
        },
        {
            "text": "Sign up to the Farming Futures R&D Fund applicant briefing and consortia-building event on 7 April to find out how you can apply and identify potential collaborators."
        },
        {
            "text": "The table below sets out the areas that would be in scope of this competition. You should consider this when submitting your Expression of Interest."
        },
        {
            "heading": 2,
            "text": "Large Research and Development Partnership projects"
        },
        {
            "text": "We are also opening the fourth competition in the Industry-led Research and Development Partnership Fund, which launched in October last year. "
        },
        {
            "text": "£8 million is available for ‘Large Research and Development Partnership projects’ that will drive forward large-scale research, development and demonstration of solutions to substantially improve the productivity and environmental sustainability of England's agricultural and horticultural sectors. "
        },
        {
            "text": "Projects must have a significant focus on demonstration and knowledge exchange to enable the commercialisation and adoption of new solutions."
        },
        {
            "text": "Businesses can lead these projects, but researchers can collaborate. Projects will last up to 4 years and be valued between £3 million - £5 million, with businesses expected to provide some match funding. "
        },
        {
            "text": "We are being less selective in the scope of this fund, but projects must deliver benefits to farmers and growers based in England. "
        },
        {
            "text": "The application window opens today and will close 29 June 2022. "
        },
        {
            "heading": 2,
            "text": "Dates for your diary"
        },
        {
            "text": "On Tuesday 5 April, UKRI will host an online briefing event for applicants. Sign up to attend the briefing."
        },
        {
            "text": "On Wednesday 20 April, UKRI will host a consortia-building event. This event is for businesses, research organisations, farmers, growers and foresters who are looking for partners to apply to the Large R&D Partnership competition. Sign up to attend the consortia-building event. "
        },
        {
            "text": "Finally, if you have any questions about these new competitions, comment below."
        }
    ]
}