{
    "url": "https://defrafarming.blog.gov.uk/2022/03/30/sustainable-farming-incentive-standards-payment-rates-and-how-to-prepare/",
    "title": "Sustainable Farming Incentive: standards, payment rates, and how to prepare",
    "authors": [
        "Tom Lewis"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Payments to improve soil health",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-03-30T10:49:27+01:00",
    "content": [
        {
            "text": "The Sustainable Farming Incentive is 1 of our 3 new environmental land management schemes. "
        },
        {
            "text": "Through the scheme, we want to support farmers to become more sustainable and to increase long-term food productivity. We also want to make sure that farmers have what they need to maintain the very highest levels of health and welfare for their animals and the environment."
        },
        {
            "text": "We plan to launch the Sustainable Farming Incentive in June. Today we can share:"
        },
        {
            "text": "In this post, I’ll provide an overview and share links to further information on GOV.UK. "
        },
        {
            "text": "I’ll also explain how farmers have directly shaped the scheme through the Sustainable Farming Incentive pilot, tests and trials, engagement sessions, co-design activity and discussions."
        },
        {
            "heading": 2,
            "text": "Improving the standards and our payment rates"
        },
        {
            "text": "The standards and payment rates that will be available this year are:"
        },
        {
            "text": "There is an additional payment of £6.15 per hectare for common land with its own agreement."
        },
        {
            "text": "The standards and payment rates guidance can be found on GOV.UK.  We've also included a roadmap so you can see when we’ll add in more standards and levels in the coming years."
        },
        {
            "text": "We are also providing funding for a vet visit, through the Annual Health and Welfare Review. You’ll be able to apply for this later in the year.  "
        },
        {
            "heading": 2,
            "text": "Improving the applications process"
        },
        {
            "text": "When the Sustainable Farming Incentive launches, we’ll update you here on the blog.  Subscribe to the blog for an alert when the scheme opens for applications."
        },
        {
            "text": "Applications will be made via the Rural Payments service, as was the case for the Sustainable Farming Incentive pilot. From the very start, we tested the service with users. Following feedback from farmers who took part in the pilot, we’ve made improvements."
        },
        {
            "text": "Farmers told us that they wanted to be able to apply when it made sense for them and their businesses. As a result, there is no deadline; the Rural Payments Agency (RPA) will process applications on a rolling basis."
        },
        {
            "text": "Farmers also told us that they wanted the application process to be straightforward enough for them to complete it without having to pay someone to make sense of long documents and complicated forms. We’ve worked with content designers to make our wording simpler. "
        },
        {
            "text": "We’ll provide more information in a blog post about what to expect, nearer the time. "
        },
        {
            "heading": 2,
            "text": "Eligibility "
        },
        {
            "text": "When the scheme launches, farmers who are eligible for the Basic Payment Scheme (BPS) will be eligible to apply for the Sustainable Farming Incentive. As we said in our previous post, we plan to expand eligibility in the coming years. "
        },
        {
            "text": "We’ve designed the Sustainable Farming Incentive so that tenants on a short-term rolling tenancy can enter that land into the scheme, provided they expect to have management control of it for the duration of the agreement."
        },
        {
            "text": "Land can be in both a Sustainable Farming Incentive agreement and Countryside Stewardship, but the actions must be compatible, and we can’t pay twice for a similar activity on the same area of land at the same time. When you apply for the Sustainable Farming Incentive, we’ll automatically remove any ineligible Countryside Stewardship agreement areas."
        },
        {
            "text": "Full details on eligibility can be found on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Get ready to apply"
        },
        {
            "text": "The scheme information is now available for you to read on GOV.UK."
        },
        {
            "text": "You can only enter land into the Sustainable Farming Incentive standards that’s eligible for the standard you choose. This means it needs to have an eligible land cover and be an eligible type for the standard. "
        },
        {
            "text": "You can choose which eligible land parcels to include, you don’t need to enter your full farm. "
        },
        {
            "text": "You should check your land details on your digital maps in the Rural Payments service in and request any updates before you apply – this will make it easier when you do your application. "
        }
    ]
}