{
    "url": "https://hmlandregistry.blog.gov.uk/2024/05/07/asking-for-guidance-part-2-the-case-of-the-vexing-restrictions/",
    "title": "Asking for guidance part 2: The case of the vexing restrictions",
    "authors": [
        "Mike Harrison, Senior Caseworker"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-05-07T14:45:22+01:00",
    "content": [
        {
            "text": "Approximately 65% of complex applications receive requisitions. This is because some points are hard to anticipate in advance and we are keen to work directly with customers to ensure everything is in place before we receive the application."
        },
        {
            "text": "Our Ask for Guidance service provides expert assistance with complex applications, help to navigate through the registry processes, and support in avoiding unnecessary errors before lodging an application."
        },
        {
            "text": "But customers often ask: what constitutes a ‘complex application’? In this series, we look at real examples of thorny issues that our experts have resolved. Previously, we explored a question about how to remove a historic, paid-up charge. In this case, we’ll explore unique restrictions."
        },
        {
            "heading": 2,
            "text": "The case of the vexing restrictions"
        },
        {
            "text": "A conveyancer came to us with two restrictions on the property title. She was acting in a purchase where the persons named as restrictioners in the body of the restriction were deceased. “If both restrictioners are deceased and we have a Grant of Probate, will that be sufficient to deal with the restrictions?” she asked."
        },
        {
            "text": "The restrictions were:"
        },
        {
            "text": "RESTRICTION: No transfer of the land in this title is to be registered without the consent of John Doe and Jane Doe or an order of the registrar."
        },
        {
            "text": "and"
        },
        {
            "text": "RESTRICTION: No disposition by the proprietor of the land under which capital money arises is to be registered unless the money is paid to John Doe and Jane Doe of Earle House, Colonial Way, Hull (the trustees of a settlement of whom there must be not less than two nor more than four unless a trust corporation is the sole trustee) or into Court."
        },
        {
            "text": "Except under an order of the registrar no disposition by the proprietor of the land is to be registered unless authorised by the Settled Land Act 1925."
        },
        {
            "text": " "
        },
        {
            "text": "The first restriction is difficult to deal with as it does not indicate what would happen on the deaths of the restrictioners. It doesn't close with \"or their personal representatives\". And the second indicates the title comprised Settled Land."
        },
        {
            "text": "A conundrum indeed and, it has to be said, a particularly complex matter."
        },
        {
            "heading": 2,
            "text": "First things first"
        },
        {
            "text": "When a restrictioner has died, the removal of the restriction can be problematic if the wording of the restriction does not indicate either:"
        },
        {
            "text": "It may be possible to produce evidence to satisfy us as to who has an interest in the restriction, so that it can be withdrawn under r98(2)(e) Land Registration Rules 2003 in form RX4 – ‘withdraw a restriction: registration’. To do this, we would need evidence of the interest that lay behind the restriction and how that interest had now devolved to the applicant. For example, the restriction protected an interest in proceeds of sale which has passed to the applicant withdrawing the restriction."
        },
        {
            "text": "In the absence of evidence, an applicant cannot withdraw it. Instead, they must apply for its cancellation, including evidence to satisfy the registrar that the restriction is no longer required (r97(2) Land Registration Rules 2003). For example, where a restriction protected a right of lifetime occupation of the property or other lifetime curb on the registered proprietors’ powers to deal with the property, which ended on death."
        },
        {
            "heading": 2,
            "text": "The Settled Land restriction"
        },
        {
            "text": "The second restriction is perhaps even more vexing."
        },
        {
            "text": "You may not be familiar with Settled Land, which is rarely encountered these days. The Settled Land Act 1925 still applies to existing strict settlements, but it has not been possible to create new ones since 1 January 1997. It does, however, apply here, although the wording of this particular restriction is now obsolete*"
        },
        {
            "text": "To give a bit of history:"
        },
        {
            "text": "Historically, the head of the family might tie up the family’s land so that the wealth it generated would benefit future generations. He or she could do this by leaving the land to members of the family in succession, each one enjoying the income for life, with the capital (that is, the land) remaining intact. This is the classic type of strict settlement."
        },
        {
            "text": "The Settled Land Act 1925 worked by placing the proprietorship in a 'tenant for life', but if the tenant decided to sell the land he owned, the capital monies had to be paid to separate trustees of the settlement. This stopped the proverbial ‘prodigal son’ selling land and benefiting directly. Any monies were managed by the trustees and that is why the restriction appears on the title."
        },
        {
            "text": "Of course, strict settlements didn't just apply to large wealthy landowners; any member of the public who wanted to protect their land for their ancestors could set up a similar arrangement. Let’s say, for example, that I left my property to my son for his life, and then my eldest grandchild for their life, and finally to my great grandchild in possession. My son and grandchild would be tenants for life during their lifetimes, but the settlement would end when my great grandchild inherited the land."
        },
        {
            "text": "Where a tenant for life dies, we typically see an assent to the next tenant for life, with either new trustees appointed or confirmation that the existing trustees would continue. It would equally be possible to obtain a special grant of probate allowing the personal representatives of a deceased tenant for life to sell the land, but the money would still need to be paid to the settlement trustees."
        },
        {
            "text": "The background aside, where the trustees of the settlement have died, new trustees must be appointed by a suitable Deed of Appointment of Settled Land Trustees. There would then be an application to alter the register, by substituting the new trustees in the second restriction. A purchaser would then proceed by taking a transfer from the tenant for life (the registered proprietor) but the trustees of the settlement would join in the transfer to receive the capital monies. Admittedly, this assumes the registered proprietor (the tenant for life) remains alive. Upon the purchaser’s registration, the restriction is automatically cancelled."
        },
        {
            "heading": 2,
            "text": "If in doubt…"
        },
        {
            "text": "These last two blogs are intended to show you how these kinds of applications can be handled, and also to detail the types of application which could be referred to our Ask for Guidance team. If you have a tricky question about a complex application that you’re about to submit, and you can’t find the answer in our Practice Guides, we would encourage you to use our Ask for Guidance service. If we are able to point you to existing guidance then we will, otherwise we will walk you through your particular issue and ensure your application is ready to submit."
        },
        {
            "text": "For more information about trusts of land, see also:"
        },
        {
            "text": "*Practice guide 19: notices, restrictions and the protection of third-party interests in the register. Restrictions in Forms G, H and I relate to the Settled Land Act 1925."
        },
        {
            "text": "Practice guide  4: private trusts of land "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}