{
    "url": "https://sustainableict.blog.gov.uk/2024/05/07/dont-let-perfection-be-the-enemy-of-good/",
    "title": "'Don't let perfection be the enemy of good'",
    "authors": [
        "Scope 3 Working Group"
    ],
    "categories": [
        "Climate action",
        "GDSA",
        "Scope 3",
        "Sustainable ICT"
    ],
    "pub_date": "2024-05-07T17:49:29+01:00",
    "content": [
        {
            "text": "In this latest Government Digital Sustainability Alliance (GDSA) update, members of the scope 3 emissions working group outline what scope 3 emissions are, they reflect on their panel discussion at the recent GDSA summit and look forward to next steps for the group."
        },
        {
            "text": "GDSA working group colleagues who are looking at the challenges around planetary impact and the circular economy have written about their reflections from the recent GDSA summit."
        },
        {
            "text": "Our scope 3 working group brings together expertise from GDSA members at BT, CGI IT UK, IBM, Eviden, Microsoft and ServiceNow. We have different experiences and insights, which is why it's so valuable to work together on this topic. Our aim is to share best practice and highlight opportunities to learn from reporting frameworks, and published guidance from recognised experts in this area."
        },
        {
            "heading": 2,
            "text": "Climate change and scope 3"
        },
        {
            "text": "As greenhouse gas emissions have, over time, increasingly impacted our planet, more of us - as individuals, businesses, and society - are trying to reduce our carbon footprint."
        },
        {
            "text": "To make it a little simpler to measure our carbon emissions, the Greenhouse Gas protocol, the most commonly used framework for greenhouse gas reporting, has split emissions into three 'scopes'. Measuring each scope helps us identify the size of our carbon footprint and ways to reduce it."
        },
        {
            "text": "These scopes are:"
        },
        {
            "text": "This infographic illustrates the different types of scope 3 emissions;"
        },
        {
            "text": "In the context of digital and data services, scope 3 emissions can include energy consumption by end-users, transportation of hardware, and even the production of materials used in the manufacturing process. As the digital landscape continues to evolve, the issue of accurately measuring and reporting scope 3 emissions has become a rising challenge for the technology industry and its customers."
        },
        {
            "heading": 2,
            "text": "Tackling scope 3 emissions in the digital and data sectors"
        },
        {
            "text": "Scope 3 emissions are more challenging to report on than scopes 1 & 2, which means some companies struggle to provide data. It’s vital, however, that we start to change this because Scope 3 emissions are usually the biggest source of carbon emissions within a business  - typically making up 70-90 per cent of an organisation’s carbon emissions."
        },
        {
            "text": "There is guidance available to help calculate organisational carbon emissions, such as the Scope 3 Calculation Guidance | GHG Protocol.  We want to help the tech industry measure their emissions so they can develop tailored carbon reduction plans and net zero strategies that will ultimately help tackle climate change."
        },
        {
            "text": "As a GDSA working group it’s important we explore ways to help technology businesses calculate their scope 3 emissions, particularly as emissions will vary from product to product and service to service. This means it’s important that emerging guidelines and advice is framed to allow flexibility and a focus on the practical measurement of the ‘material dimensions’ of scope 3, rather than insisting on the measurement of all 15 sub-categories."
        },
        {
            "text": "We hope that by accurately calculating scope 3 emissions, organisations can make evidence-based decisions, which could lead to improved operational effectiveness and efficiency, and decarbonisation."
        },
        {
            "heading": 2,
            "text": "Our working group; looking back and forwards"
        },
        {
            "text": "We have been looking at the challenge of how to improve the accuracy of the data in relation to scope 3 reporting and looking at standard approaches for the tech industry. What we've uncovered so far is that the challenge is huge."
        },
        {
            "text": "When we first started the group, we had an idea about what we were doing as different organisations, which was in some cases similar, and in others very different. Across the team we've brought together lots of expertise, and what we quickly found was that there was no one, single answer to how to approach scope 3 reporting."
        },
        {
            "text": "This session highlighted the ongoing importance of addressing scope 3 emissions and emphasised the need for sustained effort and action. It also underscored the significance of supporting the industry in overcoming barriers discussed by the panel, including issues related to data availability, data quality, and data interoperability."
        },
        {
            "text": "The panel also discussed other challenges to address, including a lack of standardisation, inconsistent reporting approaches, and varying scope 3 measuring and reporting maturity cross suppliers."
        },
        {
            "text": "Positive developments, such as the emergence of new guidance, increased emphasis on verification and certification, improved organisational processes, and the call for standardisation, suggest a promising shift towards addressing these obstacles."
        },
        {
            "text": "One key takeaway is that there is a lot of great work already underway, and an interesting consideration is how to get everybody to collaborate and work in a more consistent way to address some of the challenges."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Our working group is developing new objectives for this year so we can deliver meaningful outcomes, through a collaborative effort to improve reporting capabilities within scope 3 emissions."
        },
        {
            "text": "Having identified that everybody approaches scope 3 reporting in a slightly different way, our objectives are  likely to include guidance, awareness raising, and training."
        },
        {
            "text": "We’re excited to soon welcome new members to our GDSA working group too. We look forward to continued collaboration to drive deeper insights, further knowledge sharing, and increased action in tackling scope 3 emissions and raising awareness."
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "When it comes to climate action ‘don’t let perfection be the enemy of good’. A lot of people are struggling with ‘where should I start’, ‘what should I do’. By beginning to do something, and measuring one thing, you're taking that first step towards improving your climate activity."
        },
        {
            "text": "Our call to action is for everyone to think about how they can help reduce their own and their organisation's carbon footprint, through their project and programmes, supply chain, decision making, facilities, procurement, and infrastructure. We can all do our bit to protect the planet and reduce the extent of climate change."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}