{
    "url": "https://childrenssocialcare.blog.gov.uk/2024/05/07/i-encourage-you-to-change-your-mindset-from-i-cant-do-that-to-how-can-i-learn/",
    "title": "I encourage you to change your mindset from \"I can't do that\" to \"how can I learn?”",
    "authors": [
        "Charlie Sanderson"
    ],
    "categories": [
        "Care leavers"
    ],
    "pub_date": "2024-05-07T09:03:31+01:00",
    "content": [
        {
            "text": "The Civil Service Care Leavers Internship Scheme gives care leavers the chance to benefit from a 12-month paid internship in a central government department. Over 880 care leavers have been offered roles in over 26 government departments, with around 80% securing permanent roles.  "
        },
        {
            "text": "Having recently completed the internship scheme and since gained a promotion, Charlie Sanderson talks about her journey - from how she came to apply, to the advice she would give prospective applicants. "
        },
        {
            "text": "My partner’s mum told me about the Care Leavers Internship Scheme and I decided to apply because of the stability and opportunity to grow my skills. Looking back, I wish I had taken advantage of the support available after graduating, and had more confidence in myself. I wish I didn’t view myself through such a negative lens, but rather positively for the strength and resilience I had to overcome setbacks in my life."
        },
        {
            "text": "I started my journey in the civil service on the Care Leavers Internship Scheme in 2020, just two weeks before the pandemic hit. I was assigned to a service support team where I had the opportunity to work with developers, business analysts, and user researchers. I felt like a fish out of water at first, but my supportive colleagues were always there to guide and encourage me. I initially struggled with confidence, but my colleagues quickly helped me gain confidence to contribute to group conversations and realise the value of my ideas."
        },
        {
            "text": "During my time on the internship, I was responsible for handling issues, bugs, and change requests for a specific system on the Get into Teaching team. I also organised data and sent out emails for events. I enjoyed working with developers and business analysts the most as it allowed me to exercise my passion for finding and solving problems."
        },
        {
            "text": "I have since gained promotion and am now an experienced test manager, leading testing on the automation team at the Department for Education. I feel I have had the privilege of working with some amazing colleagues in the civil service."
        },
        {
            "text": "To any care leavers considering a career in the civil service, I would urge you not to let feelings of self-doubt or a lack of experience hold you back. The civil service is a highly inclusive and supportive environment that will help you grow and develop."
        },
        {
            "text": "If you're concerned about meeting the eligibility criteria, I encourage you to change your mindset from \"I can't do that\" to \"how can I learn?\""
        },
        {
            "text": "Further reading"
        },
        {
            "text": "Find out more about the civil service Care Leavers Internship Scheme"
        },
        {
            "text": "Find more support and opportunities for care leavers with the Care Leaver Covenant"
        },
        {
            "text": "If you have a story to share with the children’s social care community or want to see a blog on a particular area, please get in touch: blog.bulletin@education.gov.uk"
        }
    ]
}