{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/05/07/innovating-interchange-stem-futures-partner-event/",
    "title": "Innovating Interchange: STEM Futures Partner event",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-07T16:23:54+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "STEM Futures is a knowledge-exchange scheme which brings together cross-sector partners to develop science-skills capability. In March 2024, we hosted the first STEM Futures Innovating Interchange event, focusing on developing capability through cross-sector knowledge exchange. "
        },
        {
            "text": "It was fantastic to see people from across sectors come together for a day of networking and sharing. With over 50 attendees in person at the Royal Institution and online, there was a great energy to the day, and we’ve shared some highlights below.  "
        },
        {
            "text": "Opening remarks\n"
        },
        {
            "text": "The event was opened by Ted Hayden who is the Director of the Government Office for Science. Ted shared the vision for more cross-sector collaboration both in and outside the Civil Service. "
        },
        {
            "text": " "
        },
        {
            "text": "Collaboration"
        },
        {
            "text": "Delegates heard first-hand from Katherine Mathieson, the Director of the Royal Institution, as she offered her insight into cross-sector partnerships and the importance of collaboration. Katherine highlighted how interchange and knowledge-sharing between scientists and the public has been significant to many of the discoveries made at the Royal Institution, including the existence of electromagnetic induction and the isolation of 10 elements. "
        },
        {
            "text": "Careers "
        },
        {
            "text": "Delegates at the event also had the chance to hear from a diverse panel comprising speakers from the Defence Nuclear Enterprise, AtkinsRéalis, University of Cambridge, British Antarctic Survey, and the Cabinet Office. The panel discussed how interchange can support early -career individuals. Panellists highlighted how the STEM Futures agreement had been used to establish successful secondments and apprenticeship placements, and how to effectively support individuals who partake in these placements. "
        },
        {
            "text": "After an excellent event filled with dynamic discussions focused on growing knowledge -sharing opportunities, we’re looking forward to seeing everything that STEM Futures will deliver this year. We are excited to explore ways to engage with cross-cutting priorities, and to develop further mechanisms to support secondments across partner organisations. "
        },
        {
            "text": "Delegates at the Innovating Interchange Event listening to the presentations "
        },
        {
            "text": "Get in touch with us at STEMFutures@go-science.gov.uk if you’d like to hear more about how STEM Futures can help your organisation deliver innovative STEM knowledge-exchange opportunities. "
        }
    ]
}