{
    "url": "https://defraenvironment.blog.gov.uk/2024/05/07/national-plant-health-week-extreme-weather-and-plant-pests/",
    "title": "National Plant Health Week: extreme weather and plant pests",
    "authors": [
        "Dominic Eyre"
    ],
    "categories": [
        "Biosecurity",
        "Climate change",
        "Plants",
        "Research and data analysis"
    ],
    "pub_date": "2024-05-07T10:12:48+01:00",
    "content": [
        {
            "text": "It's National Plant Health Week. In this post, we look at how the changing climate brings new extremes in weather, and new impacts on plant health."
        },
        {
            "text": "In July 2022, 40°C was recorded in England for the first time.  Last month, the United Arab Emirates experienced 2.5 times their normal annual rainfall in a period of 24 hours. Parts of New Zealand, meanwhile, are experiencing severe drought – following record-breaking floods early last year."
        },
        {
            "text": "Weather and high temperatures that we previously considered extreme are now much more common, and average temperatures are shifting upwards."
        },
        {
            "text": "We can see signs of this in the plant life around us. Magnolias flowering in late winter and early spring were a conspicuous sign of the unusually warm winter we experienced in the UK this year."
        },
        {
            "text": "Extreme weather can make plants more susceptible to pests and disease"
        },
        {
            "text": "Periods of extreme weather often weaken crops, trees and other plants. This in turn can make them more susceptible to pests and diseases."
        },
        {
            "text": "One dramatic example of this followed an ice storm in Slovenia in early 2014."
        },
        {
            "text": "The weight of this ice led to widespread and severe damage to forests. The large number of damaged trees enabled the European spruce bark beetle population to grow exponentially.  Populations had already been on the increase due to warm and dry weather in the years preceding the ice storm."
        },
        {
            "text": "Bark beetles generally attack stressed or damaged trees, but when there are outbreaks they can start attacking healthy trees."
        },
        {
            "text": "The Forestry Commission is currently controlling outbreaks of that same European spruce bark beetle in south-east England. The beetle is able to migrate across the channel, and the outbreaks in south-east England are thought to be result of this."
        },
        {
            "text": "Recent storms damaged host trees in the south-east creating more opportunities for bark beetle attack. The Forestry Commission have released guidance that, among other measures, advises landowners and managers to remove and destroy fallen and snapped trees."
        },
        {
            "text": "Future pest attacks can be predicted using weather models"
        },
        {
            "text": "Warmer temperatures, particularly during winter, enable some pest species to survive and multiply. Studies using the records from Rothamsted Research’s suction traps has shown that extremely mild winters are linked to earlier flight by peach-potato aphids in the UK."
        },
        {
            "text": "In the spring and early summer, winged forms of this pest disperse into a range of important crops like potatoes, where they spread viruses. Early season flight can introduce aphid infestations into young developing crops, which are especially vulnerable to damage and disease."
        },
        {
            "text": "In a highly variable and changing climate, it can be difficult to assess the likelihood of a particular weather dependent event based purely on past experience."
        },
        {
            "text": "To address this problem, the UK Met Office use a large ensemble of weather models to estimate the likelihood of weather events occurring that have not been recorded before."
        },
        {
            "text": "Using this approach, it has been shown that there is now a 40% chance of the peach-potato aphid flight occurring earlier than ever seen before."
        },
        {
            "text": "In the future, it will be possible to make further use of the evolving developments in weather and climate science to advise farmers on the likely date of pest attack in particular seasons."
        },
        {
            "text": "Changes in agriculture and forestry to reduce the impacts of extreme weather"
        },
        {
            "text": "To avoid the worst impacts of extreme weather and climate change to plants and trees, changes will be required in agriculture and forestry."
        },
        {
            "text": "In a study of farmer attitudes towards the need to adapt to climate change, researchers found that most farmers had some concern about at least one type of extreme weather. Much of the concern was linked to impacts that farmers had experienced already."
        },
        {
            "text": "The researchers found that farmers were already undertaking activities to help them adapt to climate change. These include testing new crop rotations, cropping plans, improving biodiversity, using agroforestry and testing new crops such as soya."
        },
        {
            "text": "However, in terms of importance, farmers rated other issues such as the declining availability of plant protection products as being more significant."
        },
        {
            "text": "For farmers, extreme weather and climate change are just one of many factors to which they need to adapt. This illustrates the complexity of trying to determine appropriate measures to adapt agriculture to climate change."
        },
        {
            "text": "Trees and woodland present a different challenge, because of their longevity."
        },
        {
            "text": "In their lifetime, trees will experience numerous periods of extreme weather and a changing climate.  Forest Research have developed a tool to help landowners chose tree species that are likely to thrive in the relevant soil and current and predicted future climate."
        },
        {
            "text": "Mild winters create problems for some traditional varieties of apples, such as Cox’s Orange Pippin and Egremont Russet, which require a certain period of temperatures between 0°C and 6°C to produce fruit buds.   The Royal Botanic Gardens Kew have planted trees of a range of new and traditional apple varieties to study their potential for the future."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "Recent experience in the UK and around the world has shown the dramatic impacts that periods of extreme weather can have on plants."
        },
        {
            "text": "Increasingly sophisticated modelling of the likelihood and scale of these events in the near and far future gives us an opportunity to reduce the impacts on agriculture and the wider environment."
        },
        {
            "text": "For more information and news about Plant Health Week, follow the hashtags #PlantHealthWeek and #PlantHealthDay on X (formerly Twitter) and Instagram."
        },
        {
            "text": "To receive an email notification whenever we publish a new post, please subscribe to the blog."
        }
    ]
}