{
    "url": "https://buyingforschools.blog.gov.uk/2024/05/07/new-transforming-public-procurement-tpp-e-learning-for-procurement-practitioners-in-schools-and-multi-academy-trusts/",
    "title": "New Transforming Public Procurement (TPP) e-learning for procurement practitioners in schools and multi-academy trusts",
    "authors": [
        "Kevin Draisey, Head of Procurement Operations"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-05-07T09:43:13+01:00",
    "content": [
        {
            "text": "Kevin Draisey is Head of Procurement Operations for Get help buying for schools, the DfE’s free supported buying service for schools and trusts. In this blog post, Kevin updates up on the latest training available for people who buy for schools and trusts."
        },
        {
            "text": "As I’m sure you will know by now, the new Procurement Act 2023 is set to take effect 28 October 2024. This means changes in procurement regulation and practices aimed at bringing about a more flexible, strategic approach to public procurement."
        },
        {
            "text": "We know there may be some uncertainty out in the sector, but I want to reassure colleagues that there is a lot of work going on here at the DfE and with our public sector buying organisation (PSBO) partners, to ensure we are ready to support you with your procurements by the time the new regulations come in to force. You can be assured that if you come to Get help buying for schools or buy through one of the DfE approved frameworks, that there will be no additional burden on you, as we will have done the work to ensure your procurement is complaint with the new act."
        },
        {
            "text": "Training for schools and trusts"
        },
        {
            "text": "Back in December last year, Cabinet Office launched the first official training resources to support the introduction of the new Procurement Act. These are known as Knowledge Drops."
        },
        {
            "text": "The Knowledge Drops are designed to provide a high-level overview of the changes to the procurement regulations due to go live October 2024. In total they should take no longer than 1 hour to go through. I would advise anyone involved in buying for their school or trust to look at these."
        },
        {
            "text": "Supporting factsheets are also available to accompany the Knowledge Drops. They are designed to build awareness and understanding regarding exemptions and the general regime."
        },
        {
            "text": "Schools and trusts undertaking procurements are contracting authorities and are advised to review the training materials. Part 1 is useful for everyone involved in buying as it highlights the changes to, and the benefits of, the new procurement rules."
        },
        {
            "text": "Knowledge Drops for contracting authorities"
        },
        {
            "text": "Supporting Factsheets"
        },
        {
            "text": "New e-learning "
        },
        {
            "text": "The Cabinet Office have recently released some new e-training modules. These are aimed at all operational procurement staff - this includes staff whose main role is to run tenders or let contracts, or procurement/commercial professionals whose main role is to manage suppliers or contracts."
        },
        {
            "text": "It is recommended that staff in schools and trusts with responsibility for procurement and buying take the time to access and complete this free training over the coming months."
        },
        {
            "text": "The training is 10 x one hour modules and the e-learning covers all aspects of the new reforms, such as key regulation changes, transparency, and the competitive flexible procedure."
        },
        {
            "text": "Learners who complete the course and achieve certification will be awarded a certificate along with an e-badge for adding to email signatures, evidencing attainment at Practitioner level."
        },
        {
            "text": "The e-Learning modules are only available via registration with the Government Commercial College (GCC). Visit www.govcommercialcollege.co.uk to register."
        },
        {
            "text": "Once registered, you will find the e-learning product on the dedicated Transforming Public Procurement (TPP) area on the GCC website. There will be a direct link to the e-Learning course from the GCC homepage."
        },
        {
            "text": "Guidance and support available"
        },
        {
            "text": "Get help buying for schools will be available to provide any advice and guidance schools need free of charge. We will continue to update schools and trusts as more information becomes available. In the meantime, if you are a school or trust and need any free help and support with your procurement, contact the team at Get help buying for schools."
        }
    ]
}