{
    "url": "https://homeofficemedia.blog.gov.uk/2024/05/07/scottish-prevent-duty-guidance-factsheet/",
    "title": "Scottish Prevent duty guidance factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-05-07T11:54:51+01:00",
    "content": [
        {
            "text": "What is the Prevent duty? "
        },
        {
            "text": "The Prevent duty was established by the Counter-Terrorism and Security Act 2015 and places a duty on specified authorities such as education, health, local authorities, police and criminal justice agencies (prisons and probation) to have ‘due regard to the need to prevent people from becoming terrorists or supporting terrorism."
        },
        {
            "text": "What is the Prevent duty guidance? "
        },
        {
            "text": "The Prevent duty guidance assists specified authorities in Scotland such as local government, health and social care providers, education and childcare providers, prisons and the Scottish Police Authority to understand how to comply with the Prevent duty. "
        },
        {
            "text": "When will the new Prevent duty guidance come into force? "
        },
        {
            "text": "The updated guidance will come into force on 19 August 2024 following parliamentary approval. "
        },
        {
            "text": "What are the key changes in the new guidance?  "
        },
        {
            "text": "Key changes to the statutory guidance include: "
        },
        {
            "text": "What other support is available to Prevent duty sectors? "
        },
        {
            "text": "The Home Office offers free GOV.UK Prevent duty training to support those under the duty. We expect all frontline staff working for specified authorities to have reasonable and appropriate understanding of extremist and terrorist ideologies, and training is being provided on this. "
        },
        {
            "text": "Free GOV.UK Prevent duty training is available to local government, health and social care providers, education and childcare providers, prisons and the Scottish Police Authority online via the Home Office E-learning tool. "
        },
        {
            "text": "Where the police assess a radicalisation risk following a Prevent referral, a Prevent Multi-Agency panel (PMAP), the equivalent to Channel in England and Wales, will meet to discuss the referral, assess the risk and decide whether the person should be accepted into PMAP. "
        },
        {
            "text": "PMAP is a voluntary process, and people must give their consent before they receive support. Further guidance on the PMAP process can be found on Prevent Multi-Agency Panel Duty Guidance: Protecting people vulnerable to being drawn into terrorism."
        }
    ]
}