{
    "url": "https://cddo.blog.gov.uk/2024/05/07/single-service-owners-bridging-the-gaps-to-make-great-services/",
    "title": "Single Service Owners: bridging the gaps to make ‘Great’ services",
    "authors": [
        "Nicola Betz, Strategic Projects Lead, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-05-07T11:38:10+01:00",
    "content": [
        {
            "text": "Government services play a vital role in providing essential support to the public. In today's digital age, it's essential to ensure these services not only meet but exceed the public's needs and expectations, all while being run efficiently. This goal is at the core of our Transforming for a Digital Future strategy, aiming to elevate 50 of the Top 75 government services to a 'great' standard by 2025. If you want to learn more about our journey, you can check out our previous blog post on Making ‘Great’ services. "
        },
        {
            "text": "A key part of ensuring our services are the best they can be and delivered at the lowest cost is ownership of the end-to-end journey - and that’s why we are introducing the Single Service Owner role. "
        },
        {
            "heading": 3,
            "text": "Why are Single Service Owners needed?"
        },
        {
            "text": "Government services often depend on a mix of digital, policy, and operational delivery specialisms, making it challenging for teams to make end-to-end improvements in usability and efficiency across all channels. After a comprehensive review in January 2023, we recognised the complexity of these services and the limitations of our current setup. This recognition was reinforced by the Public Accounts Committee's report in September, emphasising the need for a single owner with clear visibility and accountability for end-to-end delivery."
        },
        {
            "text": "So here's where it gets exciting - we're on a mission to revamp ownership across the Top 75 services so that leaders aren’t bound by 'traditional' functional boundaries and are instead empowered to shape the end-to-end outcomes including all aspects of digital, policy, and operations. "
        },
        {
            "heading": 3,
            "text": "What is a Single Service Owner?"
        },
        {
            "text": "We have been collaborating with service teams to identify leaders who should be responsible for the end-to-end service. Recognising the need for consistency and clarity, we've developed a comprehensive role description for Single Service Owners. This will usually mean clarifying responsibilities and empowering individuals rather than introducing new roles. "
        },
        {
            "text": "Single Service Owners are responsible for ensuring the quality of the entire service. They manage multiple products across online and offline channels, ensuring services align with program and departmental objectives while meeting user needs. Single Service Owners manage budgets, staffing, procurement, and performance, oversee necessary business processes, and act as advocates for agile, outcome-based approaches. They take on a vital role in communicating the benefits and performance of their services and prioritise continuous improvement and seamless operation to minimise disruptions, ensuring their services never miss a beat."
        },
        {
            "text": "Currently, we're testing the Single Service Owner role outline with service teams within the Top 75 services. We recognise the diversity of services in terms of size and type ensuring that our approach provides the right level of ownership and empowerment across all policy, digital, and operational elements."
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "After refining and agreeing the Single Service Owner description, our next steps involve gaining a robust assessment of current accountability structures and existing or new Single Service Owners to garner a central, holistic sight of service ownership and determine the degree of change required. This means engaging with teams across departments and functions to understand the likely changes. This also includes developing a training and support offer to help the new Single Service Owners thrive."
        },
        {
            "heading": 3,
            "text": "Together towards better services - work with us!"
        },
        {
            "text": "We recognise the growing interest in Single Service Owners, and several departments across government are exploring these changes including Home Office, Department for Work and Pensions, Ministry of Defence, Ministry of Justice and Department for Environment, Food & Rural Affairs. We welcome your input and involvement in shaping this new era of government service delivery. Together, we aim to elevate government services to meet the needs and expectations of the digital age in a more efficient and user-centric way. Join us in this transformation toward a better future for government services."
        },
        {
            "text": " "
        }
    ]
}