{
    "url": "https://ssac.blog.gov.uk/2024/05/07/the-importance-of-listening-dr-suzy-walton-reflects-on-her-new-role-with-ssac/",
    "title": "The importance of listening: Dr Suzy Walton reflects on her new role with SSAC",
    "authors": [
        "Dr Suzy Walton"
    ],
    "categories": [
        "About the Committee",
        "Claimants",
        "Contributory benefits",
        "DWP",
        "Independent advice",
        "Public Sector",
        "Stakeholders"
    ],
    "pub_date": "2024-05-07T11:28:18+01:00",
    "content": [
        {
            "text": "“If at first you don’t succeed…” I first applied to join the Social Security Advisory Committee (SSAC) just after my 6th child was born. I was previously a Senior Civil Servant in the Prime Minister’s Strategy Unit and worked on aspects of public services, so I saw SSAC as an extremely important part of that landscape. The time wasn’t right however. Several years later, and not too long after number 7 was born, I applied again. This time I was successful and was very proud to take up my role in 2024."
        },
        {
            "text": "I have sat on many boards - some international, and many government committees. I honestly don’t think I could name a body where I have felt that we played as important a role in the lives of so many as SSAC."
        },
        {
            "text": "SSAC’s responsibilities range from scrutiny of secondary legislation on the welfare system, to giving informal advice to DWP and HMRC on policy issues and its own independent research. Ultimately, at a macro level the committee supports government’s agenda to drive economic growth by ensuring people enter and stay in work, and supporting people where they can’t. It also contributes to the important work on removing barriers for disabled people."
        },
        {
            "text": "For me personally there are many philosophical issues as yet unresolved – for example, to what extent should we have a welfare system that is increasingly means-tested vs. recognising that contributory benefits may also have their place?  And I also question how far we can – or indeed should go with digitising many of the interactions between people in receipt of support and government departments. These are questions with no quick answers and questions which require considerable research and consultation. On the issue of contributory benefits – which are pinned not to savings but to whether you’ve paid requisite National Insurance (NI) contributions, we are certainly ‘out of kilter’ with the OECD average. If we continue on the current trajectory, we can expect to see more conditionality attached to remaining contributory benefits and their value further eroded. There are arguments both for and against this trend. SSAC had a look at this in its independent report Jobs and Benefits: the covid-19 challenge. It’s worth noting that Beveridge – in his paper which launched the post-war welfare system, judged that back then people wanted a ‘something for something’ system – i.e. benefits in return for contributions. But social attitudes change. Perhaps it’s time for a national conversation on this contentious issue!"
        },
        {
            "text": "I’ve sat on the boards of - among other organisations - Birmingham Children’s Hospital, the Higher Education Funding Council for England, the Royal Society of Medicine, the Institute of Directors and the Royal Society of Arts. Some of the key things I have learnt about governance are - the need to have a clear strategy, a set of objectives to delivery that strategy, and performance measures (‘KPIs’) to be able to track progress or regress towards those objectives. It’s also important to have a stakeholder management plan and risk registers. You also need to know who you are accountable to. In terms of governance, I see SSAC as having an excellent modus operandi. That said, it’s my experience that there’s always more an organisation can do to improve and there is every indication that SSAC (and indeed the Department for Work and Pensions) are ‘listening’ organisations that will seek to better their practices."
        },
        {
            "text": "“Who do we serve?” is one of the first questions I had as a member of SSAC. As a Senior Civil Servant in the Ministry of Defence and Cabinet Office there were often complex answers to this question, for we served the interests of many different groups. With SSAC, it’s clear, we assist the Department and also the legislative process but we actually serve the public. We try - through our scrutiny, advice and research functions - to make sure that within certain fiscal constraints, the welfare system works for people."
        },
        {
            "text": "One of my early roles was as producer, presenter and editor of my own travel programme – Time Off, on LBC Radio. I travelled extensively, attempting to capture cultures and customs exclusively through the medium of sound. What I learnt then was an important early lesson – to listen. I could tell you what it was like to sit on the flight deck of Concorde and take a ‘sharp right turn’ at the chequerboard set into the hills as you approach the old Kai Tak airport in Hong Kong. But it made much more sense to record the pilots talking about their experience – their own view of the challenges of landing a supersonic aircraft without bumping into a hill! So too, with SSAC, I hope we will always remember to listen to people and truly hear what they tell us about navigating a complex system."
        }
    ]
}