{
    "url": "https://insidehmcts.blog.gov.uk/2024/05/07/understanding-the-jury-selection-process/",
    "title": "Understanding the jury selection process",
    "authors": [
        "Charlotte Singleton, Jurisdictional Support Officer"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "General"
    ],
    "pub_date": "2024-05-07T11:03:15+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Magna Carta"
        },
        {
            "text": "In 2023, 197,007 people took part in jury service. Jury trials are an integral part of the justice system and are founded on the principle of those accused of the most serious crimes being tried by their peers, which is essential to ensure all defendants have a fair trial.  The concept of being judged by one’s peers dates back hundreds of years – even being referenced in Magna Carta. You may have friends and family who have served as a juror, or even been one yourself. But why are jurors so important and how are they chosen?"
        },
        {
            "heading": 2,
            "text": "The role of the jury"
        },
        {
            "text": "A jury is made up of 12 people selected at random who are tasked with hearing the evidence presented by both the prosecution and defence in a trial and collectively making a decision on if the person accused of a crime is guilty or not guilty. Serving on a jury is one of the most important civic duties that anyone can be asked to undertake."
        },
        {
            "text": "Most jury trials take place in the Crown Court, where some of the most serious criminal trials, such as theft, burglary, drugs offences and even murder, are heard. Jurors are asked to decide, based solely on the evidence presented to them in court, whether the person charged with a crime is guilty or not guilty."
        },
        {
            "heading": 2,
            "text": "How jurors are selected"
        },
        {
            "text": "Everyone has their own unique experiences to bring to a jury and it’s important that juries are made up of people from all different backgrounds that represent their communities."
        },
        {
            "text": "Because of this, you can’t volunteer to be a juror. Instead, jurors are ‘summoned’ at random by the Jury Central Summoning Bureau (JCSB) using the electoral voting registers. The electoral registers are a list of everyone who has registered to vote and these lists are shared with HMCTS by local authorities in England and Wales on a yearly basis."
        },
        {
            "text": "This information is used to randomly select the number of jurors that each court needs. Each court has its own catchment area, from which jurors are summoned. The random selection is all done by a computer."
        },
        {
            "text": "Each year everyone on these electoral lists in England and Wales has an equal chance of being summoned. Due to the nature of random selection, some people will be summoned more than once, whilst others may never be called. This random selection ensures that jurors are impartial and that jury trials are fair."
        },
        {
            "text": "Those selected for jury service will receive their summons by post and must respond within 7 days. If you receive a summons and meet the eligibility criteria, you are expected to serve as a juror – it isn’t optional. However, in limited circumstances jurors can defer their jury service to another period within the following 12 months or in very rare circumstances can be excused."
        },
        {
            "text": "Once at court, and once a judge indicates that a trial is ready to start, those who have been summoned are once again randomly selected by a computer system to form a panel to go into court. From this panel usually 12 are then selected at random, in court, by the court clerk to form a jury on each trial. Those not selected will return to the waiting area to be available for selection for the next panel."
        },
        {
            "heading": 2,
            "text": "Deciding on the evidence"
        },
        {
            "text": "After all the evidence in a case has been presented the jurors will be asked to retire and consider the facts presented to them – they must agree on their decision to find the defendant guilty or not guilty. The verdict is delivered in the courtroom by the foreperson, who is essentially the informal spokesperson within a jury."
        },
        {
            "text": "For justice to be done fairly, jurors must remain impartial and should only consider the evidence presented to them in court by the prosecution and defence when deciding on the verdict. They must not look for information about the case or the people involved online or read news items about the case as this may bias their decision. Furthermore, while the trial is ongoing, jurors are not allowed to discuss the case with anyone else who is not on the jury, this includes friends and family and even after they have finished jury service, they can’t tell anyone about the discussions in deliberation."
        },
        {
            "text": "When a jury reaches a verdict, it is not only making a decision that affects the individual defendant but one that affects the community. Therefore, few decisions made by members of the public have as much of an impact upon society as a jury’s verdict."
        },
        {
            "heading": 2,
            "text": "A fairer society"
        },
        {
            "text": "The role of jury trials remains integral to the justice system and reflects a commitment to fairness and accountability that dates back centuries.  The core principle remains; a diverse group of individuals, randomly selected, coming together to consider evidence and reach a verdict. So, if you receive a summons through the post, you’re not merely fulfilling an obligation, it's an opportunity to contribute to the collective pursuit of justice and ensure a fair society for all."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Deall y broses o ddethol rheithgor"
        },
        {
            "text": "                                                                                                                            Magna Carta\n"
        },
        {
            "text": "Yn 2023, cymerodd 197,007 o bobl ran mewn gwasanaeth rheithgor. Mae treialon rheithgor yn rhan annatod o’r system gyfiawnder ac wedi’u seilio ar yr egwyddor bod y rhai a gyhuddir o’r troseddau mwyaf difrifol yn cael eu rhoi ar brawf gan eu cyfoedion, sy’n hanfodol i sicrhau bod pob diffynnydd yn cael treial teg.  Mae’r cysyniad o gael eich barnu gan eich cyfoedion yn dyddio’n ôl cannoedd o flynyddoedd ac hyd yn oed yn cael ei gyfeirio ato yn y Magna Carta. Efallai bod gennych ffrindiau a theulu sydd wedi gwasanaethu fel rheithiwr, neu hyd yn oed wedi bod yn un eich hun. Ond pam bod rheithwyr mor bwysig a sut maen nhw’n cael eu dewis?"
        },
        {
            "heading": 2,
            "text": "Rôl y rheithgor"
        },
        {
            "text": "Mae rheithgor yn cynnwys 12 o bobl a ddewisir ar hap sy’n gyfrifol am wrando ar y dystiolaeth a gyflwynir gan yr erlyniad a’r amddiffyniad mewn treial ac yn gwneud penderfyniad ar y cyd ynghylch p’un a yw'r sawl a gyhuddir o drosedd yn euog neu'n ddieuog. Mae gwasanaethu ar reithgor yn un o’r dyletswyddau dinesig pwysicaf y gofynnir i unrhyw un ei wneud."
        },
        {
            "text": "Mae’r rhan fwyaf o dreialon rheithgor yn digwydd yn Llys y Goron, lle mae rhai o’r treialon troseddol mwyaf difrifol, fel dwyn, byrgleriaeth, troseddau cyffuriau a hyd yn oed llofruddiaeth, yn cael eu gwrando. Gofynnir i reithwyr benderfynu, ar sail y dystiolaeth a gyflwynir iddynt yn y llys yn unig, p’un a yw’r sawl a gyhuddir o drosedd yn euog neu’n ddieuog."
        },
        {
            "heading": 2,
            "text": "Sut mae rheithwyr yn cael eu dewis"
        },
        {
            "text": "Mae gan bawb eu profiadau unigryw eu hunain i’w cynnig i reithgor ac mae’n bwysig bod rheithgorau’n cynnwys pobl o gefndiroedd gwahanol sy’n cynrychioli eu cymunedau."
        },
        {
            "text": "Oherwydd hyn, ni allwch wirfoddoli i fod yn rheithiwr. Yn lle hynny, caiff rheithwyr eu ‘gwysio’ ar hap gan y Swyddfa Ganolog Gwysio Rheithgor (JCSB) gan ddefnyddio’r cofrestrau pleidleisio etholiadol. Mae’r cofrestrau etholiadol yn rhestr o bawb sydd wedi cofrestru i bleidleisio a rhennir y rhestrau hyn gyda GLlTEF gan awdurdodau lleol yng Nghymru a Lloegr yn flynyddol."
        },
        {
            "text": "Defnyddir yr wybodaeth hon i ddewis nifer y rheithwyr sydd eu hangen ar bob llys ar hap. Mae gan bob llys ei ddalgylch ei hun, a bydd rheithwyr yn cael eu gwysio ohono. Mae’r dewis ar hap i gyd yn cael ei wneud gan gyfrifiadur."
        },
        {
            "text": "Bob blwyddyn mae gan bawb ar y rhestrau etholiadol hyn yng Nghymru a Lloegr gyfle cyfartal o gael eu galw. Oherwydd natur dewis ar hap, bydd rhai pobl yn cael eu galw fwy nag unwaith, ond efallai na fydd eraill byth yn cael eu galw. Mae’r dewis hwn ar hap yn sicrhau bod rheithwyr yn ddiduedd a bod treialon rheithgor yn deg."
        },
        {
            "text": "Bydd y rhai a ddewisir ar gyfer gwasanaeth rheithgor yn cael eu gwŷs drwy’r post a rhaid iddynt ymateb o fewn 7 diwrnod. Os byddwch yn cael gwŷs ac yn bodloni’r meini prawf cymhwysedd, disgwylir i chi wasanaethu fel rheithiwr – nid yw’n ddewisol. Fodd bynnag, mewn amgylchiadau cyfyngedig gall rheithwyr ohirio eu gwasanaeth rheithgor i gyfnod arall o fewn y 12 mis dilynol neu mewn amgylchiadau prin iawn gellir eu hesgusodi."
        },
        {
            "text": "Unwaith yn y llys, ac unwaith y bydd barnwr yn nodi bod treial yn barod i ddechrau, mae’r rhai sydd wedi’u gwysio yn cael eu dewis ar hap unwaith eto gan system gyfrifiadurol i ffurfio panel i fynd i’r llys. Mae panel yn cynnwys mwy o reithwyr nag sydd eu hangen, fel arfer tua 15. O’r panel hwn fel arfer caiff 12 eu dewis ar hap, yn y llys, gan glerc y llys i ffurfio rheithgor ar bob treial. Bydd y rhai sydd heb eu dewis yn dychwelyd i’r man aros i fod ar gael i’w dewis ar gyfer y panel nesaf."
        },
        {
            "heading": 2,
            "text": "Penderfynu ar y dystiolaeth"
        },
        {
            "text": "Wedi i’r holl dystiolaeth mewn achos gael ei chyflwyno gofynnir i’r rheithwyr ymneilltuo ac ystyried y ffeithiau a gyflwynwyd iddynt - rhaid iddynt gytuno ar eu penderfyniad i ganfod y diffynnydd yn euog neu’n ddieuog. Rhoddir y rheithfarn yn ystafell y llys gan y pen-reithiwr, sef y llefarydd anffurfiol o fewn rheithgor."
        },
        {
            "text": "Er mwyn i gyfiawnder gael ei gyflawni’n deg, rhaid i reithwyr aros yn ddiduedd a dim ond wrth benderfynu ar y rheithfarn y dylent ystyried y dystiolaeth a gyflwynir iddynt yn y llys gan yr erlyniad a’r amddiffyniad. Rhaid iddynt beidio â chwilio am wybodaeth am yr achos neu’r bobl dan sylw ar-lein na darllen eitemau newyddion am yr achos oherwydd gallai hyn wneud eu penderfyniad yn un ragfarnllyd. At hynny, tra bod y treial yn parhau, ni chaniateir i reithwyr drafod yr achos gydag unrhyw un arall nad ydynt ar y rheithgor, mae hyn yn cynnwys ffrindiau a theulu a hyd yn oed ar ôl iddynt orffen gwasanaeth rheithgor, ni allant ddweud wrth neb am y trafodaethau a geir wrth bwyso a mesur."
        },
        {
            "text": "Pan fydd rheithgor yn dod i reithfarn, maent nid yn unig yn gwneud penderfyniad sy’n effeithio ar y diffynnydd unigol ond un sy’n effeithio ar y gymuned. Felly, prin yw’r penderfyniadau a wneir gan aelodau’r cyhoedd sy’n cael cymaint o effaith ar gymdeithas â dyfarniad rheithgor."
        },
        {
            "heading": 2,
            "text": "Cymdeithas decach"
        },
        {
            "text": "Mae rôl treialon rheithgor yn parhau i fod yn rhan annatod o’r system gyfiawnder ac yn adlewyrchu ymrwymiad i degwch ac atebolrwydd sy’n dyddio’n ôl canrifoedd.  Erys yr egwyddor graidd; grŵp amrywiol o unigolion, wedi’u dewis ar hap, yn dod at ei gilydd i ystyried tystiolaeth a dod i ddyfarniad. Felly, os ydych chi’n cael gwŷs drwy’r post, nid yn unig rydych chi’n cyflawni rhwymedigaeth, mae’n gyfle i gyfrannu at gyd-fynd ar drywydd cyfiawnder a sicrhau cymdeithas deg i bawb."
        }
    ]
}