{
    "url": "https://aphascience.blog.gov.uk/2024/05/07/why-it-is-important-to-report-possible-colorado-beetle-sightings-to-apha/",
    "title": "Why it is important to report possible Colorado beetle sightings to APHA",
    "authors": [
        "Lucy Carson-Taylor",
        "Victoria Tubman"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2024-05-07T13:05:07+01:00",
    "content": [
        {
            "text": "Back in July 2023, Colorado beetle (Leptinotarsa decemlineata) were confirmed in a potato field in Kent following laboratory diagnosis of samples taken by the Plant Health and Seeds Inspectorate, part of the Animal and Plant Health Agency (APHA)."
        },
        {
            "text": "This was the first time the beetle had been confirmed in a potato crop in the United Kingdom (UK) since 1977, although they are endemic in large parts of Europe."
        },
        {
            "text": "The beetles are occasionally imported into the UK as ‘hitchhikers’ on non-host plant material, such as leafy vegetables, salad leaves, fresh herbs, and grain. In the past 70 years there have been two outbreaks of Colorado beetles in the UK, one in 1976 and one in 1977. Both outbreaks were eradicated shortly after detection."
        },
        {
            "text": "If not eradicated, Colorado beetle pose a major threat to potato crops and would have a significant economic impact on the potato industry. The adult beetles and larvae feed on the foliage of potato and several other plants in the nightshade family, and can completely strip them of their leaves if they are left uncontrolled. However, they do not pose a threat to human or animal health."
        },
        {
            "text": "Victoria Tubman, Import Manager from the Plant Health Inspectorate gives a unique overview of the operational activities APHA officials carried out last year:"
        },
        {
            "heading": 3,
            "text": "What action will APHA be taking in 2024 to make sure the beetle has been eradicated, or if they are seen again?"
        },
        {
            "text": "The beetle is not endemic to the UK and is currently regulated as a Great Britain quarantine pest, with import and movement restrictions in place for susceptible host material. APHA is obligated to act and to eradicate this pest to keep the UK free from Colorado beetle, given its severe threat to potato crops and in order to facilitate the exports of UK potatoes to several key destination countries. Statutory Notices will be issued to ensure the containment and eradication of this pest is undertaken in the future."
        },
        {
            "text": "With that in mind, it is important there is continued vigilance from industry and the public and that any possible sightings of Colorado Beetle are reported to APHA as quickly as possible, so they can be pro-actively investigated by PHSIs."
        },
        {
            "text": "APHA’s surveillance activity will continue in 2024 and will include the following:"
        },
        {
            "heading": 3,
            "text": "How you can help"
        },
        {
            "text": "Farmers and growers, gardeners and members of the public are being encouraged to remain vigilant for signs of the pest and to report any potential sightings to APHA by telephoning 0300 1000 313 or by emailing the planthealth.info@apha.gov.uk mailbox. The beetle is bright yellow or orange with black stripes and is usually between 8.5 to 11.5mm in length and 3mm in width. Its larvae are a reddish brown in colour, round and globular, and up to 15mm in length."
        },
        {
            "text": "Although distinctive in appearance, there are several beetles that are frequently mistaken for them. The Colorado potato beetle plant pest factsheet provides more information about the beetle’s life cycle and provides information on how to differentiate it from some of our native beetle species."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": "Further information can be found in the pest specific plant health response plan and in the previous GOV.UK news story. Any future findings of the beetle will be reported on GOV.UK as needed."
        }
    ]
}