{
    "url": "https://prisonjobs.blog.gov.uk/2024/05/07/why-community-payback-rapid-deployment-teams-are-expanding-nationwide/",
    "title": "Why Community Payback Rapid Deployment teams are expanding nationwide",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Community Payback",
        "Probation"
    ],
    "pub_date": "2024-05-07T11:46:13+01:00",
    "content": [
        {
            "text": "Rapid Deployment teams are Community Payback teams who are given a 48-hour window to complete a project referred to them by a local council and nominated by members of the public. Last year, Rapid Deployment teams were piloted across the country to swiftly clean up fly-tipping, vandalism and littering. The pilot was originally rolled out to Greater Manchester, Wales, the north-east and the east of England and are led by Community Payback supervisors. These pilots fulfil offenders’ Unpaid Work commitments and provide a visible, tangible benefit to local communities."
        },
        {
            "text": "We are pleased to share some of the successes of Community Payback Rapid Deployment teams over the past year from across the country.  "
        },
        {
            "heading": 4,
            "text": "Northants, East of England "
        },
        {
            "text": "A referral was received from North Northamptonshire Council to complete a litter pick and clear fly tipping that had occurred in a residential area of Wellingborough, on the Hemmingwell Estate. In total over two hundred and fifty bags of rubbish and large items that had been fly-tipped were collected by four offenders who spent the following day at the site with a Community Payback supervisor. The rubbish was then ready for the local authority to dispose of. Local residents thanked the group for their work."
        },
        {
            "heading": 4,
            "text": "Norwich, East of England "
        },
        {
            "text": "Norwich City Council requested the Rapid Deployment team remove litter and fly tipping in an alleyway in Norwich. A team of three offenders were mobilised with a Community Payback supervisor, and the task was completed within twenty-five hours. In total, forty-eight bags of litter were removed from the site and 168kg of rubbish. The local authority said they were extremely happy with the work, and they had received positive responses from residents. One local resident said she was delighted that the alleyway was being cleared, and another neighbour commented that he hadn't seen it this good in fifteen years."
        },
        {
            "heading": 4,
            "text": "Stockport, Greater Manchester"
        },
        {
            "text": "Stockport local authority made a referral to remove litter, fly tipping and to cut back bushes in Cheadle. A team of four offenders with a Community Payback supervisor were mobilised and the area was cleared within seven hours. The local authority were extremely pleased with the work and were amazed at the level of skill that the team had under the guidance of the Community Payback supervisor. A local councillor wrote a formal letter of thanks to the Community Payback supervisor and team involved, sharing that the group “did a wonderful job clearing the weeds and debris as well as trimming the lower part of our hedge”. In total, seventeen bags of rubbish were collected, and the path is twice as wide as a result of the work. "
        },
        {
            "heading": 4,
            "text": "Blaenau Gwent, Wales "
        },
        {
            "text": "Blaenau Gwent local authority requested the removal of graffiti in Gelli Crag children’s park in Abertillery. A team of three offenders and a Community Payback supervisor were mobilised, and it was removed within seven hours in time for use during the school holidays. "
        },
        {
            "heading": 4,
            "text": "Neath & Port Talbot, Wales "
        },
        {
            "text": "A referral from Neath Port Talbot local authority requested a Rapid Deployment team remove a fly tip in Glynneath. A team of four offenders were mobilised and the rubbish, totalling 280kg was removed within four hours from the green space. "
        },
        {
            "text": " "
        },
        {
            "text": "The scheme is now being expanded nationwide and will continue to directly benefit areas known to be among the worst affected by anti-social behaviour in the country. "
        },
        {
            "text": "Are you interested in a career in Community Payback? Discover more about our Community Payback roles and how they contribute to the positive transformation of local communities through projects like these: Community Payback- Prison and Probation Jobs"
        },
        {
            "text": " "
        }
    ]
}