{
    "url": "https://insidedio.blog.gov.uk/2022/10/13/dio-apprenticeships-nurturing-homegrown-talent/",
    "title": "DIO Apprenticeships: nurturing homegrown talent",
    "authors": [
        "John Abbot"
    ],
    "categories": [
        "Apprentices",
        "Working at DIO"
    ],
    "pub_date": "2022-10-13T15:38:23+00:00",
    "content": [
        {
            "text": "DIO apprentices at the Army Expo 22 [Crown Copyright / MOD 2022]Hi, I’m John Abbott, DIO Apprenticeship Lead. I've recently taken on the role and I'm really enjoying the challenge. I'd like to think I practice what I preach having undertaken a Human Resources (HR) apprenticeship when I first joined the MOD. It’s also in the blood as my dad joined the MOD as an electrical engineering apprentice at RAF Sealand way back in 1982!"
        },
        {
            "heading": 2,
            "text": "A unique apprenticeship experience"
        },
        {
            "text": "Over the past 12 months, we’ve organised several great days out to support our apprentices. In February, we hosted our Apprenticeship Awards at HMNB Portsmouth, and were lucky enough to receive not only a guided tour around the site, but also an onboard tour of HMS Prince of Wales, one of the Royal Navy’s latest Queen Elizabeth-class aircraft carriers. Our apprentices were shown around the ship’s bridge, flight island, hangar and flight deck in what was a real money-can’t-buy experience, as well as a welcome reminder of the personnel we support and the military capability DIO enables."
        },
        {
            "text": "Just last month, we arranged for a group of current apprentices to attend the latest Army Expo event on Salisbury Plain Training Area. This was an opportunity to understand the Army’s Future Soldier Programme, and how the work of civil servants contributes to supporting our military at the front line."
        },
        {
            "text": "Drone strikes, robotic dogs and the newest version of the Apache AH-64E helicopter in action were just some of the highlights from the event, which showcased the Army’s state-of-the-art air and land assets and gave an insight into military modernisation and transformation. It also highlighted the vital role of the Defence Training Estate in helping to prepare the UK military for operations worldwide."
        },
        {
            "heading": 2,
            "text": "Enhancing our apprenticeship offering "
        },
        {
            "text": "DIO Chief Executive Mike Green is a passionate supporter of apprenticeships. My challenge is to improve the quality and relevance of the apprenticeship offering in DIO to the business need and perhaps most importantly, to provide a great experience for all apprentices while completing their programme."
        },
        {
            "text": "Martin Robson (left) and Jake Hutchence, both completing the Level 6 Chartered Surveyor Commercial Real Estate apprenticeship, with the newest version of the Apache helicopter. [Crown Copyright / MOD 2022]Apprenticeships play a vital role in DIO, supporting the development of talented individuals into a variety of roles requiring specialist knowledge, skills and behaviours. Taking time to invest in growing our own capability is crucial, as is ensuring staff feel valued and part of a team while they are learning and training on the job. We have an exciting range of apprenticeships on offer, which reflect the breath of professions across DIO. To list just a few, these include property, leadership, project delivery, finance, policy, operational delivery, commercial, digital and HR."
        },
        {
            "heading": 2,
            "text": "Improving awareness about apprenticeships"
        },
        {
            "text": "While we have had many apprentices successfully come through the organisation to date, there are some common misunderstandings about apprenticeships and the benefits for both the business and the apprentice, so I'd like to highlight a few points:"
        },
        {
            "text": "Apprenticeships range from Level 2 to Level 7:"
        },
        {
            "text": "Upon completion, the apprentice will typically have both a formal qualification and a professional membership of the relevant organisation, such as the Chartered Institute of Procurement & Supply (CIPS), Royal Institution of Chartered Surveyors (RICS), Association for Project Management (APM) or Chartered Institute of Personnel and Development (CIPD)."
        },
        {
            "text": "You can undertake an apprenticeship at any stage of your career, and we have apprentices in the MOD at all ages and grades. The age profile of our apprentices greatly varies, and an apprenticeship will often appeal to an experienced person looking for a step into joining the MOD."
        },
        {
            "text": "Jack Croucher, Nick Smith and Ellie Nickols, all undertaking the Level 6 Quantity Surveyor Apprenticeship, pictured at the Army Expo 22. [Crown Copyright / MOD 2022]If anybody reading this would like to get in touch with any questions about our current offering, or the ways in which you can utilise an apprenticeship to kick-start a career in Defence, please leave a comment below."
        }
    ]
}