{
    "url": "https://dluhcdigital.blog.gov.uk/2022/10/13/round-6-of-the-local-digital-fund-is-open-for-applications/",
    "title": "Round 6 of the Local Digital Fund is open for applications",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Cyber",
        "Local Digital",
        "Local Digital Declaration",
        "Local Digital Fund"
    ],
    "pub_date": "2022-10-13T10:38:48+01:00",
    "content": [
        {
            "text": "We’re excited to announce that Round 6 of the Local Digital Fund is now open for applications from council-led digital projects."
        },
        {
            "text": "In this latest round, we’re inviting local authorities to submit proposals for Discovery, Alpha and Beta projects to make local government services safer, more resilient and cheaper to run. "
        },
        {
            "text": "Find out more about the latest round of funding below, as well as an exciting announcement on what’s next for Local Digital. "
        },
        {
            "heading": 2,
            "text": "About the Local Digital Fund"
        },
        {
            "text": "The Local Digital Fund supports projects that solve shared local service problems in a common way, in keeping with the principles of the Local Digital Declaration. "
        },
        {
            "text": "Since launching the fund in 2018, we’ve funded 44 unique projects through multiple phases of work. Cross-council collaboration has been at the core of these projects, which include a task management tool helping councils to tackle more than 160 common tasks, and LocalGov Drupal, which has grown to a community of 29 councils."
        },
        {
            "text": "“Never before has it been possible to collaborate so effectively, to deliver services across so many boundaries, to interrogate our data so insightfully, to realise such great efficiencies, and to reshape public services for the benefit of all while retaining local sovereignty.”"
        },
        {
            "text": "- Mike Connell, Rugby Borough Council"
        },
        {
            "heading": 2,
            "text": "About the Local Digital Fund Round 6"
        },
        {
            "text": "This is our most ambitious round of funding yet and we’re looking to award approximately £2.5million to council-led agile projects."
        },
        {
            "text": "Discovery projects can apply for funding up to £100,000, Alpha projects up to £180,000 and Beta projects can apply for a maximum of £350,000."
        },
        {
            "text": "Projects that apply for funding and are successful may be invited to apply for further funding via the Continuous Funding Model in the future."
        },
        {
            "text": "Round 6 was launched by the Local Digital team at LocalGovCamp on Thursday 29 September."
        },
        {
            "text": "“The response to announcing that Round 6 funding is here and being able to share an invitation to our upcoming webinar was brilliant. Everyone was really enthusiastic and no time was wasted with council officers coming up with ideas on the spot!”"
        },
        {
            "text": "- Tom Lowndes, Local Digital Collaboration Manager "
        },
        {
            "heading": 3,
            "text": "What we’re looking for"
        },
        {
            "text": "With this round, we are looking for applications for projects that break the dependence on inflexible and expensive technology that doesn’t join up effectively."
        },
        {
            "text": "We want to fund projects that help us create the next generation of local public services, where technology is an enabler rather than a barrier to service improvements, and services are user-centred. We know that one size doesn’t fit all, but by developing common building blocks, local authorities will be able to build services more quickly, flexibly and effectively."
        },
        {
            "heading": 3,
            "text": "Project criteria"
        },
        {
            "text": "To be eligible to apply to the fund, your application must meet the eligibility and assessment criteria outlined in the Local Digital Fund Prospectus. Project applications will be assessed against strategic fit, deliverability and value for money."
        },
        {
            "heading": 3,
            "text": "Who can apply"
        },
        {
            "text": "To apply, you must be:"
        },
        {
            "text": "All local authorities (including partner local authorities) must sign the Local Digital Declaration in order to apply for funding. If you have not yet signed up, you can read our guidance on signing and then sign the Declaration online."
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": "Applications are open for 6 weeks from Thursday 13 October. Visit the Local Digital website to apply."
        },
        {
            "text": "All applications must be submitted using the relevant online application form by 5.30pm on Thursday 24 November 2022. "
        },
        {
            "text": "We encourage you to read the Local Digital Fund Prospectus before beginning your application."
        },
        {
            "heading": 3,
            "text": "The support available through the fund"
        },
        {
            "text": "If successful in your application for Local Digital funding, you will join a community of councils who have developed products and services that deliver measurable savings. You will be able to tap into their expertise, gain insight from their experience and use this to amplify your success."
        },
        {
            "text": "Dedicated support will be provided by the Local Digital team. This includes being partnered with a Collaboration Manager who will provide oversight, support and guidance, as well as a link to the wider Department for Levelling Up, Housing and Communities."
        },
        {
            "text": "“Accessing the Local Digital Fund has accelerated our transformation activities both technically in the use of a new digital platform but also culturally through helping to embed digital design and ways of working which delivers benefits beyond the original project”. "
        },
        {
            "text": "- Jenny Nelson, Newcastle City Council"
        },
        {
            "heading": 3,
            "text": "How to find out more"
        },
        {
            "text": "Come along to our Round 6 webinar on Wednesday 19 October, 11am to 12:30pm, where we’ll answer your questions about the latest round of the Local Digital Fund. If you are not able to attend, please note that the recording will be published on the Local Digital website."
        },
        {
            "text": "We also encourage councils to use the #dluhc-local-digital-fund Slack channel in the LocalGovDigital workspace to share project ideas and ask fund related questions."
        },
        {
            "text": "If you have any further questions, please don’t hesitate to contact us by emailing fund@localdigital.gov.uk."
        },
        {
            "heading": 2,
            "text": "What’s next for Local Digital"
        },
        {
            "text": "Over the past few months, we’ve been working with colleagues at councils to think about how we can further help local government realise the ambitions of the Local Digital Declaration."
        },
        {
            "text": "We’re delighted to announce that for our next phase of work, we’ll be piloting a new opportunity called Future Councils. "
        },
        {
            "text": "Future Councils will be a partnership with a group of councils to deliver replicable pathways to digital and cyber security reform that other councils can follow. "
        },
        {
            "text": "Taking a whole-council approach, the Future Councils programme will bring together digital services and cyber security reform to multiple areas within a local authority and will address some of the systemic barriers that make it challenging for councils to sustain digital reform and to become modern, resilient organisations. "
        },
        {
            "text": "We will be piloting this approach with a small cohort of councils over the next six months to test and iterate our approach. Over the coming weeks, we will announce more information including what we’re looking for from potential council partners for this pilot phase and how to express your interest."
        },
        {
            "text": "You can also hear more about Future Councils at our Round 6 webinar on Wednesday 19 October, 11am to 12:30pm."
        },
        {
            "text": "We’ll continue to share more on Local Digital opportunities as they develop via our usual channels:"
        }
    ]
}