{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/10/13/scientific-services-director-animal-and-plant-agency-apha/",
    "title": "Scientific Services Director: Animal and Plant Agency (APHA)",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-10-13T20:10:49+01:00",
    "content": [
        {
            "text": "As a member of the APHA Leadership team, this role will be responsible for ensuring that the scientific perspective is at the heart of decision making in the Agency. The role will play a key part in developing the strategic thinking and direction of the Agency, working with other Executive Team members to ensure that efficiency and effectiveness of the business is improved to meet both financial and business targets and objectives. The role will also be responsible to the APHA Science and Transformation Director for the quality and integrity of the Agency’s science services and scientific staff and ensure that appropriate assurance procedures are in place around safety and quality."
        },
        {
            "text": "The role will deliver against the APHA science strategy to support the requirements of our stakeholder customers, forging strong, collaborative relationships with key policy customers, Defra’s Chief Scientist and with other Agency Chief Scientists across Defra and elsewhere in Government. The post- holder will work closely with other members of the Executive team to ensure that policy customers are provided with high quality, user tailored scientific advice, evidence and services to support policy development."
        },
        {
            "text": "The role will provide vision and strong personal leadership to scientific and technical staff ensuring effective team working across the Agency based on innovation and shared best practice to deliver customer requirements, taking the lead in managing people by setting clear standards and expectations in line with APHA policies and business objectives. The role will also monitor and actively manage performance to ensure that outcomes are delivered in line with contracts or service level agreements and within available resource and budget."
        },
        {
            "text": "Applications close on 7 November, you can find out more/apply here."
        }
    ]
}