{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/10/13/service-delivery-director/",
    "title": "Service Delivery Director",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-10-13T20:13:12+01:00",
    "content": [
        {
            "text": "As APHA Director of Operations and Service Delivery, you will be a member of the APHA Board."
        },
        {
            "text": "In this role you will;"
        },
        {
            "text": "Provide inspiring and motivational leadership to APHA’s circa 2,000 people in operational service delivery."
        },
        {
            "text": "Prevent new and exotic disease from entering the UK by operating world class border controls."
        },
        {
            "text": "Ensure any instances of exotic or notifiable diseases reported or identified in GB are effectively responded to."
        },
        {
            "text": "Enabling UK trade and exports in animal and plant products worth"
        },
        {
            "text": "£12bln per annum and growing through provision of export health certificates and trade services."
        },
        {
            "text": "As a key member of the APHA Board and executive leadership team play a key role in developing and delivering the APHA strategy working with colleagues in Defra, Scottish and Welsh Governments and stakeholders."
        },
        {
            "text": "Enable and provoke new thinking creating an engaging, inclusive culture that encourages innovation, agility and empowers our people to be their best and achieve their potential."
        },
        {
            "text": "Ensure that the organisation has the capability and readiness in systems process, people and resource to deal with outbreaks of exotic animal and plant disease."
        },
        {
            "text": "Lead delivery of simple user focused services that meet statutory and quality requirements efficiently and effectively for all three nations of Great Britain."
        },
        {
            "text": "Build and maintain proactive positive relationships with UK Ministers, Scottish Ministers, Welsh Ministers and officials of all three Nations of Great Britain."
        },
        {
            "text": "Proactively lead and embed a culture of using data / customer / user feedback to innovate existing processes / policies that improves the timeliness and quality of our services and statutory activities."
        },
        {
            "text": "Be responsible for the deployment strategy of staff during our routine business, and primary responsibility for co-ordinating critical national resources and activities during disease outbreaks"
        },
        {
            "text": " "
        },
        {
            "text": "The deadline for this role is 31 October, and you can find out more/apply here."
        }
    ]
}