{
    "url": "https://dcmslibraries.blog.gov.uk/2022/10/13/stamford-to-sutton-and-beyond-visiting-library-branches-across-england/",
    "title": "Stamford to Sutton (and beyond); visiting library branches across England.",
    "authors": [
        "Baroness Sanderson"
    ],
    "categories": [
        "Good practice",
        "How we work"
    ],
    "pub_date": "2022-10-13T12:02:13+01:00",
    "content": [
        {
            "text": "Editor's note:  Baroness Sanderson, is a member of the House of Lords, appointed by the Government to serve as the independent chair of an advisory panel to help develop a new strategy for public libraries."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Library visits"
        },
        {
            "text": "After a pause to honour the life and work of the late Queen Elizabeth, my work as chair of a new advisory panel on public libraries has begun in earnest... helped in no small part by the Libraries Team at DCMS.   "
        },
        {
            "text": "As someone from outside the sector, I have a lot to learn and a lot of people to meet but my first priority was to visit  frontline library staff and volunteers – to see for myself the work that they do and to understand the challenges they face. "
        },
        {
            "text": "My first visit was to Wimbledon's Victorian Free Public Library (opened 1887).  It was a local solicitor and temperance campaigner, James Van Sommer, who initially proposed the building of a public library in order to make books more readily available to working people.   The chairman of the equivalent of their local authority, the Local Board, opposed the idea as a potential drain on the public purse - a decision that was overturned, six years later, by the new chairman.  "
        },
        {
            "text": "One hundred and thirty-five years later, Wimbledon library is still standing and pressures on the public purse remain.  Yet, I don't think anyone could argue that it is a drain on resources given the tremendous breadth of services it offers - from Wimbletech, its innovative co-working hub for entrepreneurs, start-ups and small businesses, to event spaces and even a small independent recording studio for those who have been inspired by the jam sessions the library runs with Jah Wobble."
        },
        {
            "text": "This readiness to adapt, while working with the local community to address their specific needs, has been central to every library branch I've visited over the last fortnight, whatever their size, location or management structure."
        },
        {
            "text": "In Yeovil, during my visit to Somerset Libraries, Emily, an NHS nurse who runs a popular health check service, explained:"
        },
        {
            "text": "At Deepings Community Library in Lincolnshire, a lively village hub which hosts everything from Scrabble clubs to Star Wars days and which issued more than 5,000 books in August, manager, Louisa, said: \"I always say, I am like a pub landlady but books are my booze.\""
        },
        {
            "text": "In Taunton, which has a host of impressive tech facilities in its 'Glass Box' space, one man used the 3D printer over lockdown to print a prosthetic foot which he had designed for his physically impaired son.  The library has also started offering free data to those on low incomes."
        },
        {
            "text": "Meanwhile, in Woodford (London Borough of Redbridge), the library has been co-located with a gym.  It's an interesting idea which raised a few eyebrows at first but seems to work well.  At the front of the building, there is an inviting and tranquil library space with bookshop-style stock displays before a discreet Narnia-esque door opens into a gym and suddenly you are surrounded by music thumping and a lot of people lifting weights and pounding the running machines."
        },
        {
            "text": "This model has seen a rise in both library and gym usage, with gym-goers discovering or rediscovering the joy of a library and library users signing up to do a bit more exercise. "
        },
        {
            "text": "And all of this is on top of everything else that so many libraries offer nowadays... English for Speakers of Other Languages (ESOL) classes, digital training for young and old, loaning football to local children, free wifi, computers if you need them, employment training and debt and legal advice.  And this is by no means an exhaustive list."
        },
        {
            "text": "Little wonder that manager Lea, from Stamford in Lincolnshire, said:"
        },
        {
            "heading": 1,
            "text": "Libraries endure and adapt"
        },
        {
            "text": "It's true. Our libraries will always have their 'core services' at their heart; as they should. I am a firm believer in the power of books to enlighten, to soothe, to entertain. Even if you're not an avid reader, the very presence of books tends to reassure; there is perhaps a reason libraries have endured when other community initiatives and institutions have not."
        },
        {
            "text": "But neither are libraries set in aspic. They are constantly striving to adapt in line with changing times and local needs while retaining their integrity as a place of safety, for all walks of life, at the very heart of our communities."
        },
        {
            "text": "Ipsos Mori recently included librarians in their Veracity Index, the longest-running poll of professions in Britain. They should be proud that they came straight in at number two, just one percentage point behind nurses, with 93% of Britons saying they trust librarians to tell the truth."
        },
        {
            "text": "More than that, a public library is probably the only institution which will never ask anything of you. Not only will it not charge you to borrow a book or use a computer, it won't ask you why you are there or to justify yourself in any way. It will simply welcome you in."
        },
        {
            "text": "That is what makes public libraries unique. It is why they should be recognised as one of the most valuable community assets we have and why I feel privileged to work with the sector to help develop ideas as to how we may protect them into the future and widen the understanding of what they do - across government departments and more widely through society."
        },
        {
            "heading": 1,
            "text": "A new digital library is launched"
        },
        {
            "text": "In my conversations over the last couple of weeks, the importance of greater awareness has been raised time and again. To that end, it was fantastic to visit Sutton Library for the launch, last Friday, of TLC Discover, the new digital library from The Libraries Consortium."
        },
        {
            "text": "The Netflix style platform allows people to choose their books as they would their latest box set and to do so across the collections of the Consortium’s 23 members.  There is a one card system and access to approximately six million items as well as information about events across the participating libraries."
        },
        {
            "text": "It is a format that is at once familiar and yet ground-breaking; in terms of libraries and how we access them, this has the potential to bring in a significant new audience."
        },
        {
            "text": "As with so much within libraries, this initiative wouldn’t have happened without the passion and commitment of those across the sector. Thank you to all the inspirational heads of service and frontline staff who have been so generous with their time and knowledge and apologies to all the libraries and people I have not had the space to mention individually, as you've all been terrific.  "
        }
    ]
}