{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/10/13/strategy-planning-and-innovation-director/",
    "title": "Strategy Planning and Innovation Director",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-10-13T20:14:43+01:00",
    "content": [
        {
            "text": "As APHA Director of Strategy, Planning, and Innovation, you will be a member of the APHA Board. In this role you will;"
        },
        {
            "text": "Provide inspiring and motivational leadership to APHA’s Strategy, Planning, and Innovation Directorate and the wider Agency;"
        },
        {
            "text": "As the lead Board Member/Director for Strategy support the CEO by leading the development and operationalisation of the APHA strategy, working with colleagues in Defra, Scottish and Welsh Governments and stakeholders."
        },
        {
            "text": "Lead and drive the Agency’s business planning activity ensuring it drives maximum impact, encourages innovation and delivery of the organisation’s strategic outcomes."
        },
        {
            "text": "Developing the strategic thinking and direction of the Agency by enabling, provoking, and championing new thinking. Working with fellow leaders to create an engaging, inclusive culture that encourages innovation, agility and empowers our people to be their best and achieve their potential."
        },
        {
            "text": "As head of profession for change and project management develop the organisations planning, project, and change framework. Driving consistent best practice that maximises APHA/HMG/GB wide outcomes and benefits. Co-ordinate and lead at organisational level project and change initiatives/activity across APHA ensuring a joined- up approach that maximises delivery and value for money."
        },
        {
            "text": "Develop and implement a cross APHA analysis capability that joins up Directorate data/analysis and modelling capability to create a data analysis / modelling centre of excellence."
        },
        {
            "text": "Develop and build the Agency’s capability to horizon scan, proactively planning and mitigating risks to our/our policy customers/ HMG/Devolved Administrations outcomes whilst maximising opportunities to improve our effectiveness."
        },
        {
            "text": "Help determine the Agency’s strategic delivery, capability and development options through political and stakeholder engagement and reflect this in governance and direction."
        },
        {
            "text": "Develop and operationalise a simple, proportionate, fit for purpose and empowering governance framework within APHA (and in line with Defra framework)."
        },
        {
            "text": "Working with the Chief of Staff ensure effective co-ordination and timely delivery of high-quality briefing products/advice to Ministers, the CEO, Board and Welsh, Scottish Governments."
        },
        {
            "text": "Represent the Agency effectively and professionally at relevant Defra group Committees on behalf of the CEO."
        },
        {
            "text": " "
        },
        {
            "text": "The deadline for applications is 31 October, you can find out more/apply here."
        }
    ]
}