{
    "url": "https://companieshouse.blog.gov.uk/2022/10/13/turning-policy-into-legislation-the-passage-of-the-economic-crime-and-corporate-transparency-bill/",
    "title": "Turning policy into legislation: the passage of the Economic Crime and Corporate Transparency Bill",
    "authors": [
        "Stuart Morgan - Head of Policy Development at Companies House"
    ],
    "categories": [
        "Companies House transformation"
    ],
    "pub_date": "2022-10-13T16:27:09+01:00",
    "content": [
        {
            "text": "You’ll have seen recently that the Economic Crime and Corporate Transparency (ECCT) Bill was introduced to Parliament in September. This is a significant step forward in allowing us to make fundamental reforms to the legal framework within which Companies House operates, but the ECCT Bill is just at the start of its journey. "
        },
        {
            "text": "To become an Act, the Bill must be passed by the Commons and the Lords (in either order) and receive Royal Assent. It can be passed with or without amendment, but the Commons and Lords must both agree the text. The Bill can also only be changed by formal amendment.    "
        },
        {
            "text": "The Bill is likely to achieve Royal Assent in the spring of 2023, but the passage through Parliament is a winding path of debate and examination where proposals for amendments can be made at several stages.     "
        },
        {
            "heading": 2,
            "text": "How the Bill will become law"
        },
        {
            "text": "Bills may start in either the House of Lords or the House of Commons, but most start in the House of Commons. "
        },
        {
            "text": "The Bill is currently at the second reading stage in the House of Commons (as of 13 October 2022) so there are a few more stages to go before the final wording is agreed, and the Bill becomes an Act. In the meantime, we are working hard behind the scenes to prepare for the changes that the Bill will introduce.  "
        },
        {
            "heading": 2,
            "text": "How the Bill will affect Companies House"
        },
        {
            "text": "The Bill will reform the role of Companies House and improve the transparency of UK companies and other legal entities. The changes include:   "
        },
        {
            "text": "Our Companies House Chief Executive Louise Smyth recently said: "
        },
        {
            "text": "Change will not happen overnight, but we hope to deliver some of the measures as early as possible following Royal Assent with others being implemented over time. "
        }
    ]
}