{
    "url": "https://defraenvironment.blog.gov.uk/2024/01/18/bng-launch-date-confirmed/",
    "title": "BNG launch date confirmed",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Land Use"
    ],
    "pub_date": "2024-01-18T17:46:16+00:00",
    "content": [
        {
            "text": "We are pleased to confirm that biodiversity net gain will go live on 12 February 2024. From this date major development (unless otherwise exempt) will have to deliver net gains for biodiversity leading to positive outcomes for nature, better places for local communities and more consistent and transparent requirements for developers."
        },
        {
            "text": "Which types of development will BNG apply to?"
        },
        {
            "text": "From 12 February 2024, BNG will be mandatory for new planning applications for major development made under the Town and Country Planning Act (TCPA) 1990, subject to the confirmed exemptions. Major development includes residential developments with 10 or more dwellings, or where the site area is greater than 0.5 hectares."
        },
        {
            "text": "BNG for small sites will have an extended transition period and will apply from 2 April 2024. The definition of small sites is summarised below, with the full definition found in the regulations. Small site development includes:"
        },
        {
            "text": "What types of planning permission will BNG apply to?"
        },
        {
            "text": "We have prioritised the introduction of BNG for planning applications – which is the predominant route to securing planning permission. From 12 February, BNG will apply to new applications for planning permission, except for applications for retrospective permission, the exemptions and transitional arrangements set out below."
        },
        {
            "text": "Applications made under any other route, for example deemed permissions under section 90 TCPA 1990 or permission granted by a Local Development Order, will not be subject to mandatory BNG yet. Further regulations will be required to modify the procedure for these other routes to planning permission. We will release further information on this in due course."
        },
        {
            "text": "Developers may still deliver voluntary BNG on these developments under existing planning policy."
        },
        {
            "text": "Transitional Arrangements"
        },
        {
            "text": "BNG will only apply where the planning application was made on or after 12 February."
        },
        {
            "text": "We have put transitional arrangements in place in the main BNG commencement regulations, to ensure that BNG will not apply to a planning permission if the planning application was made before this date."
        },
        {
            "text": "These transitional arrangements also mean that if you received planning permission before 12 February (and that permission wasn’t subject to BNG), if you then apply via section 73 to vary a planning condition on that permission, the new permission granted (under section 73) would also be exempt from BNG."
        },
        {
            "text": "If a planning application for a small site development was made during the small sites extended transition period, between 12 February and 2 April 2024, and subsequently a section 73 variation was granted after 2 April, the same transitional arrangements will apply and BNG will not be required on any subsequent section 73 variations."
        },
        {
            "text": "Updates to legislation  "
        },
        {
            "text": "In November we published the package of secondary legislation in draft to help stakeholders prepare for mandatory BNG. Since then, we have made a small number of minor changes to the drafting of the legislation. We know there has been particular interest in the wording of the de-minimis exemption and the biodiversity gain hierarchy, and we have made clarifications and changes to reflect the discussions we have had with interested stakeholders. We will publish further blogs to set those changes out in in more detail."
        },
        {
            "text": "Links to the finalised regulations will be published in this blog once they are made available."
        },
        {
            "text": "This is a significant milestone in the delivery of our Environmental Improvement Plan, ensuring new development contributes to the recovery of nature and will be fundamental in helping the country meet our target to halt the decline in species abundance by 2030, while helping to create more beautiful communities and deliver new homes."
        },
        {
            "text": "Where can I find the regulations?"
        }
    ]
}