{
    "url": "https://digitalpeople.blog.gov.uk/2024/01/18/cddo-is-growing-government-digital-data-graduate-talent/",
    "title": "CDDO is growing Government Digital & Data graduate talent",
    "authors": [
        "Wednesday Moore, New Talent Delivery Manager, CDDO",
        "Marwa Ali, Talent Manager, CDDO"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Capabilities",
        "Community",
        "Emerging talent",
        "Government Digital and Data"
    ],
    "pub_date": "2024-01-18T00:05:47+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "text": "The Graduate Talent team sits within the Workforce and Capability directorate of the Central Digital and Data Office (CDDO). Throughout the summer, we have dedicated efforts to prepare for the upcoming cohorts joining our esteemed Government Digital and Data graduate programmes in the autumn."
        },
        {
            "text": "I’m Wednesday and I’ve been a member of the Talent team for almost four years. Working in graduate talent is a really rewarding space, I have hands-on interaction with scheme participants which allows the opportunity to support them in their career development."
        },
        {
            "text": "I’m Marwa, and my journey in the Talent team has been an enlightening one, spanning just under a year. My passion for nurturing talent ignited during my own apprenticeship where I witnessed firsthand the transformative power of talent programmes. It has been such a great learning experience and has allowed me to grow in the talent space."
        },
        {
            "text": "The schemes we run in the team are; the Software Developer Programme, Summer Internship Programme and the Fast stream formerly known as the Digital, Data and Technology Fast Stream, is now known as the Digital & Cyber Fast Stream due to re-branding across the profession."
        },
        {
            "heading": 2,
            "text": "Digital & Cyber Fast Stream"
        },
        {
            "text": "This year marks a significant milestone as we proudly announce the ninth year of the Government Digital & Data Fast Stream Programme. Throughout its evolution, the programme has undergone several transformations based on valuable learner feedback. Notable adjustments include shortening the scheme duration from four to three years and shifting postings to 12 months (so the scheme would offer three postings in total). The latest refinement involves a more targeted role offering, informed by evaluation feedback, strategic programme objectives, and the profession's evolving requirements, aligned with the core Fast Stream curriculum. The programme is currently focused on four of the most crucial and sought-after digital roles across government: business analyst, user researcher, product manager, and delivery manager."
        },
        {
            "text": "We were delighted to welcome 85 Digital & Cyber Fast Streamers onto the scheme, for our latest and largest cohort yet! Participating in the Fast Stream programme offers vital skills, unparalleled experiences, and serves as an excellent initiation or transformation in one's career, all while contributing to the enhancement of services provided by the Civil Service."
        },
        {
            "text": "“It’s a really innovative programme, and a great opportunity to become a professional, working with emerging technology.” Tayyib, Digital & Cyber Fast Streamer."
        },
        {
            "heading": 2,
            "text": "Summer Internship Programme"
        },
        {
            "text": "The Summer Internship Programme (SIP) brings diverse, talented students and recent graduates into the Civil Service for a six-week summer work experience. It's a chance for teams to tap into fresh perspectives and skills from these interns. This year, we introduced a digital, data, and technology bolt on component in collaboration with the Fast Stream Early Talent Team. This increased exposure to the Government Digital and Data profession and expanded the horizons of interns, encouraging some who had never considered it before to explore a potential career in this dynamic field."
        },
        {
            "text": "This year, there were over 550 summer interns cross-government who have made a significant impact with their hard work and dedication. We'd like to extend our thanks to our dedicated volunteers who not only led valuable digital and data sessions but also shared their expertise, leaving a lasting impression on our interns. Over 100+ interns eagerly participated in our data and digital 'Lunch and Learn' sessions."
        },
        {
            "heading": 2,
            "text": "Software Developer Programme"
        },
        {
            "text": "Our Software Developer Programme is a dynamic two-year experience specifically designed for science, technology, engineering, and mathematics (STEM) graduates. It provides a chance to acquire practical experience in junior software developer positions within a diverse range of government departments, supported by a comprehensive curriculum aimed at honing their technical expertise. As our cohort progresses into their second year, they have successfully achieved their year-one milestones, culminating in presentations that showcased both the challenges they encountered and the accomplishments they attained. This stands as evidence of their development and dedication, paving the way for an even more promising year ahead."
        },
        {
            "text": "In year two, they will be delving deeper into advanced technical realms, exploring subjects like test-driven development in Java and Python, and mastering continuous integration and deployment practices. As our cohort progresses into their second year, we remain committed to enriching their experience by incorporating additional technical sessions."
        },
        {
            "heading": 2,
            "text": "Future directions"
        },
        {
            "text": "We are consistently enhancing our methods for nurturing new talent and fostering collaboration across government programmes. Our goal is to attract top government digital and data talent to contribute to government initiatives."
        }
    ]
}