{
    "url": "https://dragonsden.blog.gov.uk/2024/01/18/dragons-den-ip-blog-series-21-episode-3/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 3",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "International",
        "IP",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2024-01-18T21:00:33+00:00",
    "content": [
        {
            "text": "Episode 3 got off to a kicking start with entrepreneur and ex-football player Gary Neville joining the Den, the first ever Guest Dragon. While some entrepreneurs were top of the leaderboard, others just failed to make the cut.  "
        },
        {
            "heading": 3,
            "text": "Seeds that heal"
        },
        {
            "text": "Entrepreneur and mum, Giselle Boxer, entered the Den ready to take the Dragons on. Giselle asked for £50k and help with scaling-up her business Acu Seeds, in exchange for a 10% share in the business. "
        },
        {
            "text": "Giselle told the Dragons about her inspirational story that led to starting her own business. She was diagnosed with ME (chronic fatigue syndrome) four years ago. "
        },
        {
            "text": "She told them how she believes that using a combination of diet, acupuncture, Chinese herbs and ear seeds aided her recovery within a year. Soon after this she fell pregnant, and it was whilst on maternity leave that she set up her business, Acu Seeds.  "
        },
        {
            "heading": 3,
            "text": "Licensing to expand "
        },
        {
            "text": "Giselle told Deborah Meaden that she wants to grow the business as “big as it can go.” "
        },
        {
            "text": "One way Giselle could do this is by licensing her project out to wholesalers, granting them permission to use her products without infringing on her rights. A licence is an agreement between you as the IP right owner and another party. IP can be ‘licensed-out’ or ‘licensed-in’. You can ‘license-out’ to another company in return for a fee. You can ‘license-in’ if you want to use another company’s IP to develop your own business and products. The person granting the licence is usually called the licensor, and the person receiving the licence is usually called the licensee. "
        },
        {
            "text": "After the profit margins in Giselle's pitch knocked Sara Davies’ socks off, the Dragons all made offers, making her the first entrepreneur in Den history to receive six offers. "
        },
        {
            "text": "Giselle chose to go with Dragon Steven Bartlett for 12.5% of her full asking amount after being told in the past that she would “meet a man called Steven and that he was going to be really important.”  "
        },
        {
            "heading": 3,
            "text": "Spiritual Awakening "
        },
        {
            "text": "The next entrepreneur to enter the Den had the Dragons in fits of laughter throughout the entirety of his pitch. Liam Browne, founder of Full Power Cacao, explained that he came up with the idea for his business after a long fight with his mental health sent him on a “journey to find happiness”. On this expedition he stumbled across a ‘Chocolate Shamen’ in Guatemala “and the trajectory of his life was changed forever.” "
        },
        {
            "text": "Liam asked the Den for a £50,000 investment in return for 5% equity in his enterprise. "
        },
        {
            "heading": 3,
            "text": "The Power of IP"
        },
        {
            "text": "Full Power Cacao sources its cacao from Venezuela where family farmers plant, grow, pick and process the seed. “They are all part of the ‘PLAN MÁS CACAO’. It is wise for Liam to think about protecting his IP such as his trade mark when trading abroad.  "
        },
        {
            "text": "Registering your trade mark, design or patent in the UK doesn’t automatically give you protection overseas. Fortunately, there is lots of help available. The IPO has an international network of attaches based in Southeast Asia, China, Latin America, North America, Gulf States and India who are there to help provide advice on local IP matters to businesses trading in those regions. We also have country guides to help you protect your IP abroad. "
        },
        {
            "text": "Back in the Den, the Dragons get involved in a little song and get a chance to try Liam’s cacao drink. They get ready to decide whether they have the ‘Full Power’ to invest in Liam’s journey. "
        },
        {
            "text": "Peter, Touker, Steven and Sara all make offers, but Gary has an important question to ask before he can make his decision...  "
        },
        {
            "text": "“What football team do you support?” Unfortunately for Gary, Liam supports Manchester City but is still keen to make him an offer. "
        },
        {
            "text": "Without even needing to ‘visit the wall’ Liam asks if Dragons Gary, Peter and Steven will consider going in together to invest in his business. "
        },
        {
            "text": "All three agree to the full £50,000 asked for with Gary taking a 5% cut of the business and the other two Dragons both taking 10%. "
        },
        {
            "text": "If you scored our Dragons' Den IP Blog highly, make sure to subscribe and look out for next week's edition! "
        }
    ]
}