{
    "url": "https://forestrycommission.blog.gov.uk/2024/01/18/how-a-new-digital-mapping-tool-is-helping-to-boost-woodland-creation/",
    "title": "How a new digital mapping tool is helping to boost woodland creation",
    "authors": [
        "Tristan O’Leary"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2024-01-18T17:35:10+00:00",
    "content": [
        {
            "text": "Supporting landowners and managers to access funding for sustainable practices is central to Land App’s mission, and our new England Woodland Creation Offer (EWCO) Checker Tool is no exception."
        },
        {
            "text": "This new digital mapping tool, created in partnership with the Forestry Commission, allows landowners and managers to easily plan where they might integrate trees on their land. It highlights where they could benefit from additional stackable payments from the Forestry Commission’s flagship grant, the England Woodland Creation Offer (EWCO), whilst also benefiting the wider environment."
        },
        {
            "text": "Accessed through a free digital map, the new EWCO Checker Tool visually shows landowners and managers, down to individual field parcel level, what EWCO additional contribution payments they might receive, if the area is eligible for tree planting. Additional contributions are extra payments of up to £8,000 per hectare for new woodlands that help mitigate climate change, deliver nature recovery benefits, or provide wider environmental and social benefits."
        },
        {
            "text": "The tool also includes 100-year estimates for how much carbon they could capture through a proposed woodland creation site, using figures and methods from the Woodland Carbon Code. The WCC is a government-backed scheme that enables carbon sequestered by new woodland creation projects to be sold in the voluntary carbon market, adding an extra income stream for landowners."
        },
        {
            "text": "One of the greatest challenges of agricultural transition is giving people on the ground the tools to easily understand their options for the future – in both an environmental and a business context. At Land App, we designed the EWCO Checker Tool with landowners, managers and agents in mind. We wanted to make the EWCO pre-application and planning process as intuitive and accessible as possible."
        },
        {
            "text": "We work closely with agents such as Nicholsons, a family business offering environmental and ecological consultancy, who have been trialling the new tool."
        },
        {
            "text": "They told us:"
        },
        {
            "text": "Once Land App users have generated a woodland creation report and assessed any woodland creation potential, they can accurately draw plans using their Land Registry ownership boundary lines to guide them. Using the Woodland Creation template, they can plot areas as certain habitat types, as well as include capital items available through EWCO, such as vehicle gates and fencing."
        },
        {
            "text": "The EWCO Checker tool is designed for everyone, whether you’re an individual farmer, a public body, or a larger business supporting clients through their woodland creation journey. It flags where you might have the most straightforward and economically beneficial route to a successful woodland creation application."
        },
        {
            "text": "The EWCO Checker Tool summary is of course subject to meeting the eligibility requirements as detailed in the EWCO Grant Manual and all EWCO applications will be reviewed by the Forestry Commission. However, the tool empowers people to navigate some of these requirements and helps visualise tree planting plans with greater ease, before seeking further advice or speaking to their local Forestry Commission Woodland Officer or following up with the Woodland Carbon Code."
        }
    ]
}