{
    "url": "https://teaching.blog.gov.uk/2024/01/18/our-schools-behaviour-strategy/",
    "title": "Our school’s behaviour strategy",
    "authors": [
        "Polly Ross"
    ],
    "categories": [
        "Behaviour Hubs"
    ],
    "pub_date": "2024-01-18T10:24:53+00:00",
    "content": [
        {
            "text": "Polly Ross, Headteacher at Shefford Lower school explains how the Behaviour Hubs programme helped improve behaviour at their school. "
        },
        {
            "text": "Our School"
        },
        {
            "text": "Shefford Lower school is at the heart of the local community of Shefford. We strive to instil core values to support pupils to be happy, positive and contribute to the community.  "
        },
        {
            "text": "Two years ago, we began our journey to further improve behaviour standards at our school. We were aiming for the best possible behaviour standards. That’s why we signed up to the Behaviour Hubs programme.  "
        },
        {
            "text": "The programme provided training and network opportunities to support us to develop a new approach to learner engagement and behaviour which greatly improved behaviour standards and wellbeing in our school.    "
        },
        {
            "text": "Creating a vision  "
        },
        {
            "text": "We started our journey by writing a behaviour vision statement, with input from our community. This vision was displayed, referenced, and reflected upon regularly throughout our journey to ensure commitment from everyone: pupils, parents and staff. It created a sense of ownership in moving towards shared goals and helped to align all staff with the school’s culture and ethos.    "
        },
        {
            "text": "Diagnosing issues "
        },
        {
            "text": "Then, we captured views of community members, staff, pupils, parents and governors to create a ‘warts and all’ picture of behaviour at our school. We asked for views on behavioural patterns and practices in our school, including:   "
        },
        {
            "text": "This formed the foundation of our discussions and next steps. We established patterns, identified our strengths and established tangible actions to raise behaviour standards in our school. We shared our findings with all members of the community and informed staff and governors of priority areas. "
        },
        {
            "text": "Engaging with the community   \nOne key to our success was consistently getting behaviour ‘onto the agenda’. Behaviour was discussed at all governor, senior leadership and staff meetings and continuously noted within newsletters and briefings. Behaviour was on everyone’s radar. "
        },
        {
            "text": "We also built strong networks through the programme across local borders. This enabled us to share practices with other schools and share insights.   "
        },
        {
            "text": "Training sessions "
        },
        {
            "text": "The leadership team took part in a number of training sessions offered by the programme. Sessions were led by behaviour advisers and included sessions on induction training onto the programme, virtual modules, action planning sessions, leadership training, improving relationships, and supporting pupils. The training aligned leaders’ thinking and supported us to shape next steps on building sustainable behaviour practices.   "
        },
        {
            "text": "Building a culture of positivity  \nEssential to our approach was building positive relationships between pupils and staff, and between pupils and pupils. This was a key area of staff Continuing Professional Development (CPD) and was included in future staff inductions. "
        },
        {
            "text": "Regular training was also given to staff in practice throughout the year and coaching partnerships offered development.   "
        },
        {
            "text": "Outcomes   \nFollowing the programme, we developed stronger behaviour standards. This was a result of consistently re-enforcing the behaviour we wanted to see. Expectations were high, communicated regularly and easy to understand. We ensured this was progressed in a positive and supportive environment.  "
        },
        {
            "text": "We also reviewed and improved several areas at our school to ensure everyone benefitted: "
        },
        {
            "text": "Although our journey with the Behaviour Hubs programme has finished, our work in this area hasn’t. We continue to put into practice what we learnt during the programme and reflect on our initial vision - striving for the best experience for our pupils.   \n "
        },
        {
            "text": "Find out more about the Behaviour Hubs programme and how it could benefit your school. "
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates "
        }
    ]
}