{
    "url": "https://buyingforschools.blog.gov.uk/2024/01/18/professional-development-for-school-business-professionals-how-can-we-help/",
    "title": "Professional Development for School Business Professionals: How can we help?",
    "authors": [
        "Lindsey Roberts, Stakeholder and Engagement Coordinator from the School Resource Management Team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-01-18T11:36:35+00:00",
    "content": [
        {
            "text": "In this blog post, Lindsey Roberts, Stakeholder and Engagement Coordinator from the School Resource Management (SRM) Team within DfE, explains the ways in which SRM can help support the training and development needs of School Business Professionals."
        },
        {
            "heading": 2,
            "text": "Why is building business and finance professional capability important?"
        },
        {
            "text": "As School and Academy Trust Business Professionals (SBPs*), you are a critical part of the school leadership team. Your role is key to helping schools and academy trusts achieve excellent school resource management."
        },
        {
            "text": "We know that your role is continuously evolving and that responsibilities can range from procuring goods and services to HR, finance or managing the school estate. It is a varied role that requires resilience and adaptability. It is, therefore, important for employers to support the training and development needs for SBPs and for SBPs to take the time to develop the necessary skills for the role."
        },
        {
            "heading": 2,
            "text": "How can we support SBP professional development?"
        },
        {
            "text": "We currently offer a range of support:"
        },
        {
            "heading": 3,
            "text": "School Resource Management (SRM) training webinars"
        },
        {
            "text": "We have launched a new series of topical free-to-attend School Resource Management (SRM) webinars which include:"
        },
        {
            "text": "Feedback from last year’s webinars was overwhelmingly positive with 91% of respondents saying that the training better equipped them at their role and 99% saying they would recommend the sessions to others."
        },
        {
            "text": "Sign up for the webinars here."
        },
        {
            "heading": 3,
            "text": "Peer-to-peer support and one-to-one mentoring"
        },
        {
            "text": "Our School Resource Management Advisers (SRMAs) can support SBPs through an SRMA visit where they provide free, independent, and tailored advice and support."
        },
        {
            "text": "We recently piloted a one-to-one mentoring scheme, which paired new Chief Financial Officers / Chief Operating Officers (CFO/COOs) with more experienced peers. Mentors will work with you over a period of four to six months to provide individual support in any areas that you’ve highlighted. They are there to share their experience, knowledge, and best practice to help you develop your confidence and ability. Following the pilot, 90% of mentees said they found the support helpful in identifying and monitoring development goals."
        },
        {
            "text": "We now have plans to open the mentoring scheme to school business professionals/ managers, school finance managers and chief financial or operating officers."
        },
        {
            "text": "To request an SRMA visit or mentoring, contact us now via Academy Questions."
        },
        {
            "heading": 3,
            "text": "Training bursaries"
        },
        {
            "text": "We provide support through targeted investment for up to 75% of the costs of the below qualifications, which are aimed at new and aspiring school business leaders and CFOs."
        },
        {
            "text": "Our bursary programmes have supported 75 new and aspiring CFOs and School Business Managers."
        },
        {
            "text": "100% said that the training and learning enabled them to make changes to or develop new processes for the benefit of their school or academy trust."
        },
        {
            "text": "To learn more about the Level 5 Diploma for School Business Leaders visit the ISBL website."
        },
        {
            "text": "To find out more about the Level 7 Diploma in School Financial and Operational Leadership visit the CIPFA website."
        },
        {
            "text": "For more information about future rounds of bursaries, please contact us at: school.resourcemanagement@education.gov.uk or sign up to the monthly SBP newsletter."
        },
        {
            "heading": 3,
            "text": "Free contract management training"
        },
        {
            "text": "We are continuing to offer access to foundation level contract management training developed by the Cabinet Office."
        },
        {
            "text": "We will also continue to support practitioners working on procurement, to network through learning communities following the training."
        },
        {
            "text": "The post-training survey results found that 96% of respondents felt that their knowledge and understanding of contract management had increased as a result of the training."
        },
        {
            "text": "If you would like to register your interest, please contact: ESCC.PROJECT@education.gov.uk."
        },
        {
            "text": "For the latest news and SRM announcements, sign up to our SBP newsletter"
        },
        {
            "text": "Sign up to our monthly newsletter to stay up to date about future training opportunities. You can sign up to the newsletter here."
        },
        {
            "text": "You can also visit our collection page to learn more about School Resource Management and access all our services. School resource management - GOV.UK (www.gov.uk)"
        },
        {
            "text": "*School Business Professional (SBP) is a term for a range of roles, across both schools and academy trusts, this includes responsibility for one, or more than one, school business function, across finance, operations, commercial, human resources, and estate management."
        }
    ]
}