{
    "url": "https://socialcare.blog.gov.uk/2024/01/18/southends-museums-of-curiosity-and-compassion/",
    "title": "Southend's museums of curiosity and compassion",
    "authors": [
        "Ciara Phipps"
    ],
    "categories": [
        "Care and support",
        "Communities"
    ],
    "pub_date": "2024-01-18T14:04:14+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Curating confidence in the community"
        },
        {
            "text": "After the success of community co-curation projects, and in response to the radical transformation in how we work with community partners, we embarked on the creation of a project designed to develop transferable skills and promote enrichment. This involved working with heritage professionals on a project to conserve significant waterlogged archaeology, excavated from the Thames Estuary."
        },
        {
            "text": "We believe passionately more women from underrepresented backgrounds should see heritage, arts and culture roles as viable career options. With this ambition in mind, we felt it would be meaningful to work with 10-15 local women, from a diverse range of backgrounds, including those with caring responsibilities, such as single parents and those who are new to the UK."
        },
        {
            "text": "Individuals from these groups are often forgotten and frequently experience barriers to employment. We contacted a Southend-based charity, Welcome to the UK, established in the city since 2014. We’ve been working in partnership with them for the past year."
        },
        {
            "text": "The charity started through the personal experiences of its founder and was set up to support families from overseas to positively engage in their community. They offer support and training, including English classes, school applications, health advice and community events, such as visits to our museums, where we invited them for tours of our art, archaeology, and local history displays."
        },
        {
            "heading": 2,
            "text": "Making history"
        },
        {
            "text": "Since 2014, Welcome to the UK  have helped more than 250 families from 16 different nationalities overcome the challenges newcomers face when they move to a new country. The charity has plans for expansion and to work with more partners in local schools and religious and cultural centres, which is where our project comes in."
        },
        {
            "text": "After securing funding for the conservation treatment of a group of objects excavated from the Thames Estuary, which are currently stored in water, we felt this was an ideal pilot project for ‘Collections Carers’. We felt confident there would be beneficial outcomes for participants, the charity and the museums service."
        },
        {
            "text": "We aimed to provide access to this maritime collection through a series of training and development workshops designed to provide useful experiences and skills for the group’s settlement and career prospects."
        },
        {
            "text": "Working with participants during six weekly sessions, we covered aspects of collections care, such as object handling, first aid for marine finds, packing and storage, as well as documentation, and of course health and safety when dealing with this type of material."
        },
        {
            "text": "Alongside the theoretical and practical learning, we were keen to develop the so called ‘soft skills’ such as communication, teamwork and decision-making, benefiting from an interpreter joining us at each of the sessions to support these outcomes."
        },
        {
            "text": "To support the group, most of whom have school-age children, the sessions took place during term time and on days linked with the usual programme of events at Welcome to the UK, as well as aligning with the museum service’s regular volunteer programme."
        },
        {
            "heading": 2,
            "text": "Museums care…"
        },
        {
            "text": "From these sessions, we hoped to not only provide transferable skills, but also encourage conversations and shared stories and experiences. Each of our participants received a certificate at the end of the project and hopefully gained some valuable new transferable skills."
        },
        {
            "text": "We also hope it encouraged the development of existing skills and knowledge but ultimately that they enjoyed their experience with us and left feeling more confident and comfortable in their new community."
        },
        {
            "text": "The project has been a resounding success, with the participants being happy and grateful for the chance to work with the collections and practice their English in a relaxed environment.  We view it as the springboard for a long-term partnership with Welcome to the UK and aim to expand to other areas of our collections, and to other community groups and participants."
        },
        {
            "text": "Not only has this project made a positive impact on our citizens but has positively impacted Southend Museums colleagues also. This transformation in practice is just the beginning, opening up many opportunities to deliver socially inclusive projects with the potential to create lasting legacies."
        },
        {
            "text": "Whilst we as museums will continue to preserve, engage with and care for our history, we are excited to work in new ways, collaborating with new people to tell the stories of the future."
        }
    ]
}