{
    "url": "https://publicpolicydesign.blog.gov.uk/2024/01/18/the-ecosystem-for-public-entrepreneurship/",
    "title": "The ecosystem for public entrepreneurship",
    "authors": [
        "Malcolm Beattie"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2024-01-18T12:00:13+00:00",
    "content": [
        {
            "text": "In early 2014 I happened to be in the right place at the right time when the then Minister for Finance in Northern Ireland, Simon Hamilton, commissioned the Public Sector Innovation Lab (iLab)."
        },
        {
            "text": "I have learned many lessons from this immersive experience - lessons covering the reality of starting, building and constantly reshaping the iLab – it has been a great journey with some dead-ends, but many highs. All driven by a team of passionate and skilled innovators of which I am proud to be a part."
        },
        {
            "text": "This is the first of four blog posts around the idea of an Enabling Ecosystem, illustrating what it takes to create the right conditions for success as an innovator in the public sector. I don’t cover innovative methods and techniques, rather the focus on the conditions for innovation to begin, be sustained and delivered."
        },
        {
            "text": "My views are personal and reflect my real experience, I believe they will resonate with other innovators as they travel the same journey as me."
        },
        {
            "heading": 2,
            "text": "Innovation in the public sector"
        },
        {
            "text": "In essence, successful innovation in the public sector requires more than just skills in innovative techniques. Innovators must have a lot of self-awareness, as well as situational and contextual alertness, and a clear view of the ecosystem in which they are operating. This will help them draw on the supportive people and forces in the system and counteract the inherent immune response designed for continuity and stewardship, that predictably opposes creativity, change and innovation."
        },
        {
            "text": "As public servants we are often busy improving the public services that we oversee: sometimes policy makers need to rejuvenate or replace a policy because it is not delivering the anticipated or required outcomes; sometimes it will be to develop a new policy to address an emerging public need or in response to political direction. At a service delivery level, engaged operational managers are always looking for ways to improve services, reduce costs, correct failings in current services or to meet spikes in demand."
        },
        {
            "text": "And I have a strong sense this is in the DNA of many of us and that throughout the public sector there are many dedicated public servants who are innovating in their own areas to improve the policies and services for which they have responsibility. Some of this will be within formal initiatives, but often it will be on their own initiative. In fact, I believe that every public servant has a duty to the citizens we serve to act in this way and should always be looking for ways to improve things."
        },
        {
            "text": "Rowan Conway (writing for the Royal Society for Art in the paper Move fast and fix things: How to be a Public Entrepreneur) fully encapsulates the essence of this, giving it language and legitimacy, calling for more of us to be Public Entrepreneurs, and for the systems in which we operate to recognise us as such!"
        },
        {
            "text": "In no other sector is there a greater need for innovation, and in no other sector is it as hard to do! Just think of how complex it is. Consider the myriad of stakeholders. Consider the fact that much of what we do is because of market failure (we provide services to address needs that the market simply does not respond to because it is either too hard or not economically viable). Also consider that we are often trying to get people to do things they don’t want to do, like paying taxes! Layer on top of that the unrelenting scrutiny and criticism of what we do. Public Service is not simple, it is challenging, it is difficult; and innovating within it is even more so! Framing innovation through the lens of the Enabling Ecosystem provides a solid basis upon which to innovate."
        },
        {
            "text": "Before I go any further it would be useful to look at what I think we mean by innovation in the public sector, and a helpful definition is:"
        },
        {
            "text": "I like this definition because it shows that innovation is not predominantly about the invention of revolutionary products or services that radically changes things, like the iPad or the Dyson; rather, and for the most part, it is grounded in what is attainable by individuals within the span of their control, while working within a larger system."
        },
        {
            "heading": 2,
            "text": "Where do you start? "
        },
        {
            "text": "In any problem solving context, the vital place to begin is to have a full understanding of the problem (‘problem definition’ is the term we use), and to be sure that you are not simply focused on what is a symptom of a bigger problem – consider how much time, effort and money is wasted on knee-jerk reactions to what are merely symptoms of a greater problem – all that effort, and the problem still exists!  And then we wonder why our solution isn’t working! In the iLab we always start with ‘problem definition’ to ensure effort is correctly targeted on the problem itself."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "The next step is to build an understanding of the system where the problem exists, from which you will need to derive the authority and the insights to innovate, and within which any innovation must flourish. This is what I mean by the Enabling Ecosystem. In short, it is the combination of the components of the setting in which you are innovating; and it will have variations depending on the organisation itself and your position and authority within it."
        },
        {
            "text": "You need to think of yourself as a significant component of that ecosystem and then review the rest of the Enabling Ecosystem from that vantage point. This will act as a reality check, akin to a project readiness/ gateway review, to help you see and then prepare for and manage the challenges ahead - challenges that will need to be overcome if you are to be a successful Public Entrepreneur in your ecosystem."
        },
        {
            "heading": 2,
            "text": "The Enabling Ecosystem"
        },
        {
            "text": "As I see it, it is made up of six interactive and interdependent components:"
        },
        {
            "text": "To borrow a definition from ecology, an ecosystem is a community of living organisms in conjunction with the nonliving components of their environment, interacting as a system. Just as these living organisms need all the other parts of the ecosystem to function as a system, for innovation to flourish the components of the Enabling Ecosystem must also function as a system."
        },
        {
            "text": "In my next post, I will discuss each segment and propose some key questions to be considered if you want to successfully innovate in your ecosystem and become a successful public entrepreneur."
        }
    ]
}