{
    "url": "https://educationhub.blog.gov.uk/2024/01/18/ucas-deadlines-2024-when-apply-university-medicine-dentistry/",
    "title": "UCAS deadlines 2024: When to apply to university courses including medicine and dentistry",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Further education",
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2024-01-18T16:00:01+00:00",
    "content": [
        {
            "text": "Students going to university from September 2024 should already have been thinking about what to study and where they want to apply."
        },
        {
            "text": "You’ll need to apply to an undergraduate course through UCAS."
        },
        {
            "text": "The deadline is quickly approaching, while some courses, such as medicine and dentistry, closed to applications on 16 October 2023."
        },
        {
            "text": "Here are the key UCAS deadline dates for your diary."
        },
        {
            "heading": 3,
            "text": "When is the UCAS application deadline? "
        },
        {
            "text": "You’ll need to apply to most undergraduate courses by 31 January 2024 at 6pm."
        },
        {
            "text": "The equal consideration deadline means course providers must consider all applications received by this time equally. Universities and colleges do not have to consider applications received after the deadline, although they can if they have spaces available once the on-time applications have been considered. Some courses had an earlier deadline – applications closed on 16 October 2023 for the following courses:"
        },
        {
            "text": "The University of Cambridge and the University of Oxford also have an application deadline of 16 October for their courses."
        },
        {
            "text": "If you are unsure of when the deadline for your course is, you can use UCAS’ search tool."
        },
        {
            "heading": 3,
            "text": "When is the UCAS deadline for apprenticeships? "
        },
        {
            "text": "Apprenticeships start throughout the year and application deadlines vary depending on the employer."
        },
        {
            "text": "Every applicant is now able to see the most relevant apprenticeship opportunities for them alongside degree courses in their UCAS student account."
        },
        {
            "text": "Students can search for an apprenticeship at any time throughout the year, as and when employers are hiring, with vacancies updated in real time."
        },
        {
            "text": "You can find vacancies and see individual application deadlines by heading to the Career Finder."
        },
        {
            "heading": 3,
            "text": "What if I miss the UCAS application deadline? "
        },
        {
            "text": "Late applications for courses with the earlier deadline of 16 October 2023 are very unlikely to be considered as these courses are particularly competitive."
        },
        {
            "text": "If you miss the 31 January 2024 deadline for most other courses, you may still be able to apply after the deadline has passed. Universities and colleges often consider applications received after the 31 January deadline if spaces are available, but you risk missing out on your top choice if it’s popular."
        },
        {
            "text": "Any applications not submitted by 30 June 2024 at 18:00 will automatically be entered into Clearing."
        },
        {
            "heading": 3,
            "text": "What’s included in a UCAS application? "
        },
        {
            "text": "When filling out your application, it’s important to read through each section carefully. "
        },
        {
            "text": "Courses have different entry requirements that you need to meet or that you should be working towards in school or college. You can check these in the UCAS course finder tool. "
        },
        {
            "text": "For your application you will need to provide: "
        },
        {
            "text": "If you are due to take exams or retakes in 2023, more information on the examination process this year can be found on the Education Hub."
        },
        {
            "text": "Further information on the university application process can be found on the UCAS website."
        },
        {
            "heading": 3,
            "text": "What happens if I change my mind about my course after I’ve applied, or if I don’t get any offers? "
        },
        {
            "text": "UCAS Extra provides another chance for you to gain a place at university or college.  "
        },
        {
            "text": "If you’ve changed your mind about your choices, you may be eligible to apply for a different course or university through UCAS Extra between 28 February 2024 and 4 July 2024. "
        },
        {
            "text": "UCAS Extra is available for prospective students who included five choices on their application, have received decisions from all five and weren’t accepted, or if they declined the offers they received. "
        },
        {
            "text": "More information on UCAS Extra is available on the website."
        },
        {
            "heading": 3,
            "text": "Where can I get more advice?  "
        },
        {
            "text": "Gaining a university degree is just one option and there are many different paths you could take, from apprenticeships to higher technical qualifications. The best choice for you will depend on your situation and the career or job you have in mind. "
        },
        {
            "text": "You can speak to a professional careers adviser for free and get judgment-free, confidential information and advice via the National Careers Service Exam Results helpline, via phone or by webchat. "
        },
        {
            "text": "If you want to find out more about all your education and training options, visit the National Careers Service page and Get the Jump to explore your study and work choices. "
        }
    ]
}