{
    "url": "https://kingsawards.blog.gov.uk/2020/06/23/scottish-business-snapdragon-win-queens-award-for-innovation/",
    "title": "Scottish business, SnapDragon win Queen's Award for Innovation",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Innovation",
        "Lord-Lieutenants",
        "online",
        "Recipients"
    ],
    "pub_date": "2020-06-23T14:16:28+01:00",
    "content": [
        {
            "text": "SnapDragon Monitoring fights fakes online. We identify and remove infringing products from online marketplaces, social media sites, and websites. We use intellectual property (IP) to remove the fakes and the fakers - which is cheap, quick and efficient. Gone are the long, drawn out legal conversations around links being removed. It can take less than four minutes to remove an infringing product from, as an example, Amazon using registered intellectual property [copyright, trademarks, design rights or patents] to prove the originality of the copied product."
        },
        {
            "text": "Perhaps astonishingly, small brands with fabulous products and serious potential are finding their much-loved products counterfeited and worming their way into the supply chain before the original brand even have a chance to consider this may happen."
        },
        {
            "text": "At best, fake products cause disappointment. Less brilliantly, serious harm. Take bicycle brakes or beauty products and you can be scarred for life. Meanwhile those profiting from the sale fund drugs rings, prostitution, drug trafficking and worse."
        },
        {
            "text": "Our Swoop software scans the world’s busiest sites identifying infringing products and sellers so they can be removed quickly and efficiently – keeping brands, revenues and customers safe. From the early beginnings of the kitchen table, we now work with brands around the world."
        },
        {
            "heading": 2,
            "text": "Why did your business decide to apply for a Queen’s Award for Enterprise?"
        },
        {
            "text": "Counterfeits pose a hidden threat – to businesses, to consumers and to women, in particular, whose lives are controlled by those profiteering. SnapDragon’s approach, and innovative software, means any business, large or small, anywhere in the world, can take control of their brand online – identifying infringements, and infringers, and taking them off line, preventing the visibility, purchase, export, import, distribution and sale of fake goods. Our solution is effective and affordable, making it truly unique in brand protection terms – and with the growth we have seen in the last four years, it seemed a good time to apply for the award."
        },
        {
            "heading": 2,
            "text": "What has winning the award meant for your business/staff?"
        },
        {
            "text": "Delight, incredulity and, perhaps, most importantly, given the timing, recognition in the face of adversity."
        },
        {
            "text": "The award was made public a few weeks into lockdown - an unknown environment for us all. This cause for celebration provided a must-needed boost of excitement and encouragement for the whole team. We work passionately and diligently for our clients and to have been recognised for this through the Award, has been a really wonderful. We had a lovely lockdown party on Zoom – with fizz delivered to every team member in advance with balloons … to enable a real celebration."
        },
        {
            "heading": 2,
            "text": "How has/will winning the award benefit your business?"
        },
        {
            "text": "We hope that by winning this award we will be able to raise awareness of the serious issue that is counterfeits, and push brands to start taking proactive action online. Fake products contribute over 3.3% to world trade each year (Source: OECD, 2019) and it’s a problem which isn’t going away. Child labour, unsafe materials and poor-quality goods are commonplace with counterfeits, and it’s every brand’s responsibility to prevent these products, which pretend to be genuine, from getting into the hands of customers."
        },
        {
            "text": "What brands may not realise is that sales made from counterfeits fund organised crime, such as trafficking. In identifying fakes online, and removing them from sale on the pertinent platforms, we can prevent visibility and the subsequent purchase, export, import and distribution."
        },
        {
            "text": "Watch their online celebration here: https://youtu.be/VRgSsERgBZQ"
        },
        {
            "text": "Or visit their website to find out more: https://snapdragon-ip.com/"
        },
        {
            "text": "Subscribe to updates from this blog, or follow us on Twitter and LinkedIn."
        }
    ]
}