{
    "url": "https://companieshouse.blog.gov.uk/2021/07/08/a-career-at-companies-house/",
    "title": "A career at Companies House",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Working at Companies House"
    ],
    "pub_date": "2021-07-08T13:49:02+01:00",
    "content": [
        {
            "text": "Applying for a new job can be stressful at the best of times and even more so under the current climate. Although the application process may differ between companies, the main procedures of completing a CV, filling in an application form and attending an interview are much the same everywhere."
        },
        {
            "text": "Knowing something about the company and their application processes will make it easier to complete the application. The more you know about the company’s products, mission and objectives, the better the chances of getting called to that all-important interview."
        },
        {
            "text": "At Companies House we have produced an online resource to make you more familiar with the recruitment process and help you make the best of the opportunities advertised. The resource will tell you about what we do and as you’ll see from our new mission statement, we are more than just a registry."
        },
        {
            "text": "Job roles at Companies House are varied, ranging from policy experts and HR specialists to software developers and operations managers."
        },
        {
            "text": "We encourage everyone to be adaptable, bold and curious, and we have a culture that supports and develops skills and careers. To find vacancies that we have you can sign up to the Civil Service Jobs website and search by:"
        },
        {
            "text": "You can also follow us on our social media channels, where we regularly advertise our opportunities."
        },
        {
            "text": "As a relative newcomer to Companies House (some people have been here for over 30 years), I can endorse the sentiment of everyone that it’s a great place to work."
        },
        {
            "text": "There are opportunities for career development, training and learning programmes as well as coaching and mentoring networks. It’s an organisation that rewards effort and celebrates success."
        },
        {
            "text": "Having sat on both sides of the recruitment process, I can give you my top tips."
        },
        {
            "heading": 2,
            "text": "Your CV"
        },
        {
            "text": "Briefly outline your previous work experience, tell us about the jobs you have done, the length of time you were in each role and a short description of your duties and responsibilities."
        },
        {
            "text": "We'd love to hear about any significant achievements or projects you have worked on that are relevant to the role for which you are applying. Make sure to add in details of any qualifications you have attained that could be beneficial to the role."
        },
        {
            "heading": 2,
            "text": "Your personal statement"
        },
        {
            "text": "A personal statement is your opportunity to outline why you are the best candidate for the role. It should be used alongside your CV and not be a rehashing of your experience but bring another dimension to your ‘story’."
        },
        {
            "text": "This is where you need to provide evidence against the key criteria and sought skills outlined in the job description and person specification."
        },
        {
            "heading": 2,
            "text": "Civil Service behaviours"
        },
        {
            "text": "Take a particularly close look at the behaviours guidance as this is used for all our vacancies. Candidates are shortlisted based on their responses to the behaviours we’ve identified as being important for a role (for example, making effective decisions, changing and improving) and they will be asked about these same behaviours at interview."
        },
        {
            "text": "Use examples rather than just making claims. Responses to behaviour questions can sometimes amount to a series of unsupported claims about how good or experienced the applicant is. Use the job description throughout and provide examples of how you feel you fit the key criteria and the behaviours that are part of the role."
        },
        {
            "text": "We're looking for a document that will describe specific experiences you have had in your education or career that you feel add to your case of why you are the perfect candidate for this role."
        },
        {
            "text": "Stick to one example per behaviour, there’s only really enough space to explain one example fully. If you end up giving more than one example, it’s a sign that you probably have not given enough detail on your best example."
        },
        {
            "text": "Do not be afraid to sell yourself. There are so many applicants out there that you need to make sure you stand out in the crowd."
        },
        {
            "text": "Use ‘I’ rather than ‘we’- a relatively common mistake is candidates using ‘we’ rather than ‘I’. This makes it difficult to know what you personally did to tackle the challenge you’re describing. It’s much safer to stick with ‘I’."
        },
        {
            "text": "Do not fall into the trap of using tired, old phrases. Ban the following lines from your CV: 'I'm a great team player', 'I have good communication skills', 'I use my initiative'."
        },
        {
            "text": "Also, do not be too disappointed if you are not successful. It does not mean that you are not good enough for the role, it’s just that someone was better on the day. Ask for feedback and see how you can improve for the next role. Good luck."
        }
    ]
}