{
    "url": "https://defradigital.blog.gov.uk/2021/07/08/building-a-new-modern-and-user-focused-digital-service-for-plant-exports/",
    "title": "Building a new, modern and user focused digital service for plant exports",
    "authors": [
        "Susanna Wright"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra Science and Innovation",
        "Defra services",
        "Digital transformation",
        "User centred design"
    ],
    "pub_date": "2021-07-08T14:17:35+01:00",
    "content": [
        {
            "text": "The Animal and Plant Health Agency (APHA) and Defra are introducing a new and improved IT system for the export of plants and plant products. The new Plant Health Export Service (PHES) will replace the existing export process on eDomero. PHES is designed to make the process of exporting plants and plant products simple and intuitive."
        },
        {
            "text": "You may ask why we’re introducing a new system at all? We have one that works…We do, but the current technology is old, in fact, decades old. It is built on outdated and soon to be unsupported technology. As the number of exporters is predicted to increase substantially over the coming years following EU exit, there was a risk to the stability and therefore the user experience of the service."
        },
        {
            "text": "In addition to these more technical challenges, we want to provide a better experience for our users both in the export trade and internally to our APHA colleagues. The new service brings us up to date and in line with Government Digital Service (GDS) standards, used to help government create and run good digital services that are reliable, simple to use and based on what users need and want."
        },
        {
            "text": "So, when funding became available to join in the development of other services like Export Health Certificates Online (EHCO), recently introduced for animal and animal product exports, the Plant Health Service got on board."
        },
        {
            "heading": 2,
            "text": "Building accessible and responsive services"
        },
        {
            "text": "With the user-centric ethos always in mind, we’ve undertaken several months of intensive requirements-gathering activities, user research, process mapping, defining (and redefining) the service needs of a changing industry, changing workforce, changing regulations, changing commodities and new and changing markets."
        },
        {
            "text": "We’re focused on building accessible and responsive services, that can grow and change as policy, industry and the markets demand; and as new and innovative technology becomes available. The inspectorate who carry out this work are known for innovative thought and whilst designing the new processes have brought in efficiency savings to the workforce and industry alike. These have had to be approved at ministerial level and are in place to cope with the uplift in trade when regulations alter."
        },
        {
            "text": "And it’s not just the external facing service that we’re updating. We’re also introducing a new internal application built on Microsoft Dynamics technology. This enables us to carry out more of our functions within one system. It also allows our workforce to better organise and more easily carry out their work, to manage inspections and charging, record time and more easily coordinate work tasks between teams. Making us a more modern, efficient, and effective public service."
        },
        {
            "heading": 2,
            "text": "Tapping into expertise helps us get it right"
        },
        {
            "text": "We’ve used the knowledge and experience of a vast number of Subject Matter Experts from across Government, industry, trade bodies and exporters themselves to design and develop PHES to be a service that is easy to use, intuitive, faster and more efficient while also having greater levels of accessibility security and legal compliance."
        },
        {
            "text": "Right now, we’re about mid-way through the rollout. We’ve released about half of the commodity journeys (used agricultural farm machinery, plants, plant products and plant produce) to trade through a ‘private beta’. This means we’re continuing to undertake user research, gathering feedback, and gaining insights as a result of the service being used ‘in real-life’. We continue to make changes and improvements while we build, giving us the flexibility to react to rising priorities and urgent or changing needs, and ultimately deliver a fit for purpose product."
        },
        {
            "text": "We’ve had really positive feedback from exporters so far, with many commenting on how much easier the service is to use, like these used agricultural farm machinery exporters:"
        },
        {
            "text": "“The system is far easier to use than the previous one. Everything is so self-explanatory.” "
        },
        {
            "text": "“I did not need any additional support I was able to follow the online process and easily register my application.”"
        },
        {
            "text": "We are continuing to work at pace. Over the coming months we will roll out other commodity journeys including potatoes, seeds, grain and bulbs. We will continue to expand the functions and capability within PHES, always in consultation with our users, to deliver the best experience possible to plant-based exporters."
        }
    ]
}