{
    "url": "https://dragonsden.blog.gov.uk/2021/07/08/dragons-den-episode-14-series-18/",
    "title": "Dragons' Den, Episode 14, Series 18",
    "authors": [
        "Oliver Downey"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-07-08T22:00:44+01:00",
    "content": [
        {
            "text": "As this season of Dragons’ Den winds down, other aspects of our daily lives are simultaneously opening-up and I’m not sure about you, but the prospect of ‘reopening anxiety’ is becoming frightfully real. That’s why I was pleased when Siobhan Miller stepped into the Den, promising serenity, albeit for pre- and post-natal parents. Siobhan was seeking £136,000 in return for a 1% equity stake in her business, The Positive Birth Company. Despite not being a birthing partner myself, or planning to be any time soon, I’ll currently take positivity wherever I can get it…"
        },
        {
            "heading": 2,
            "text": " Positive affirmations…"
        },
        {
            "text": "The Positive Birth Company offers ante-natal and post-natal education for parents, 1-1 and group classes, digital hypno-birthing programmes, and the world’s first hypnobirthing-friendly contraction timer through its mobile app, Freya. Apple revealed that from July 2008 to June 2016, 130 billion apps were downloaded from their App store. It is therefore vital that developers protect their intellectual property (IP)."
        },
        {
            "heading": 2,
            "text": "How do you protect an app?"
        },
        {
            "text": "Computer programs and mobile apps are usually protected by copyright. This right is automatic, meaning that you don’t need to register the work in the UK, and you don’t need to pay any fees. Some programs and mobile apps may also be protected by a granted patent, providing that it satisfies specific patentability criteria. Find out more about patenting your invention here and be sure to check out our blog on IP for mobile apps."
        },
        {
            "text": "At £13,600,000, Peter Jones was unimpressed with Siobhan’s large valuation and declared himself out, but Sara Davies was blown away by the success of the infant business and offered Siobhan all of the money for a 7% stake in return. Tej and Touker threw a spanner in the works by both offering all of the money but for a 10% stake. After much deliberation, the positive-birthing guru was able to avoid a tantrum in the Den by negotiating both Tej’s and Touker’s offers down to 7%, with a drop down to 3% each within 18 months when a full return had been made."
        },
        {
            "heading": 2,
            "text": "(Gum)ption…"
        },
        {
            "text": " Next up in the Den was Bristol-born Keir Carnie with his environmentally conscious company Nuud Gum, which makes plant-based, plastic-free, and bio-degradable chewing gum. Hoping to disrupt the historically monopolized chewing gum market, Keir sought £50,000 in return for 10% of his business. Honestly, it was staggering to learn that every piece of regular chewing gum contains the same amount of plastic as a plastic straw! To make me feel even more remorseful about my past chewing gum habits, Keir pointed out that the plastic base used in chewing gum is the same material used for shampoo bottles, plastic bags and even car tyres, costing the UK tens of millions of pounds a year to clean up."
        },
        {
            "heading": 2,
            "text": "Shhh! Keep it a secret"
        },
        {
            "text": "Green queen Deborah Meaden was quick to pin the entrepreneur on the exclusivity of the product. As mentioned in previous blogs, a recipe can potentially be protected by a trade secret. Find out more about the importance of keeping your trade secrets, secret."
        },
        {
            "text": "Despite a David and Goliath strategy of taking on the big players in the industry, the Dragons weren’t convinced that the business was investable in its current form and so Keir was forced to chew his way out of the Den without an investment."
        },
        {
            "heading": 2,
            "text": "Big ideas to big bucks…"
        },
        {
            "text": " The Covid-19 pandemic has impacted many areas of innovation across industries, but the next pair into the Den hoped to capitalize on the recent explosion in home working. Gary Giles and Allan Watts claim that their company, OGEL, is ‘potentially revolutionary for the building industry’ which takes waste and turns it into building blocks for small at-home offices. The duo sought £50,000 for a 5% stake in their eco company, which promises to convert big ideas to big bucks."
        },
        {
            "text": "Peter was impressed with the planet-saving potential of the business but quickly moved to question the duo on their efforts to protect their invention. I was very pleased that the duo’s invention was indeed patented, with three small objections with the European Patent Office. It is advisable to seek guidance from a patent attorney when applying for a patent. Visit our website for more information on defending your invention. After viewing the pair’s patent application document, Sara Davies felt reassured that the invention and its IP was in a solid state and seeing the patent gave her the confidence that the pair have the foundation for a successful business."
        },
        {
            "text": "Sara offered the pair all the money, in return for a 10% stake – double the equity that was originally offered. Tej subsequently added bricks to the mortar by offering all the money on the same terms as Sara, admitting that himself and Sara have skill-sets in different areas but both have the same consumer focus. The offer clearly impressed the entrepreneurs and they walked away with a deal from both Tej and Sara. It just goes to show that protecting your IP can have an instrumental effect on the success of a business."
        },
        {
            "heading": 2,
            "text": " A glittering finale…"
        },
        {
            "text": " Last into the Den were London-based jewellers Kirstie Maclaren and Katie Pell, showcasing their design-it-yourself ring carving company, The Workbench. The pair was seeking £50,000 for a 10% stake in the company. After a very nervous start, the Dragons began to press the duo on their finances. Cracks quickly began to show in the pair’s finances as they couldn’t recall their gross profit figures, leading all but one Dragon to declare themselves out, with the future of the pitch resting firmly on Sara Davies’ finger. Sara was under no illusion as to the amount of work required to help the business back on to its feet, but decided to make an offer nonetheless. Sara offered the full £50,000 but sought a 45% equity stake, dwarfing original offer of 10%, stating “I am going to have to run this business for you.” 45% would give Sara a majority share but time was running out for the pair. After a quick chat at the famous brick wall, the pair accepted Sara’s offer. It’ll be interesting to see if Sara manages to help turn this company a business gem."
        },
        {
            "heading": 2,
            "text": "End of season"
        },
        {
            "text": "What a series this has been! Thank you to everyone who has been keeping up to date with our Dragons’ Den Intellectual Property Blog. We hope you have enjoyed catching up with us as we’ve delved into the intellectual property behind the ideas in the Den. If you would like to hear more from our writers, expert researchers, economists and examiners then check out our other IPO blogs. We’ll see you at the end of the year!"
        }
    ]
}