{
    "url": "https://food.blog.gov.uk/2021/07/08/emily-miles-stakeholder-update-welcoming-prof-susan-jebb-the-cat-food-recall-and-my-speech-to-cieh/",
    "title": "Emily Miles' stakeholder update - welcoming Prof. Susan Jebb, the cat food recall, and my speech to CIEH",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2021-07-08T15:14:19+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "FSA Chief Executive Emily Miles discusses an unusual food incident, her recent speech to the Chartered Institute for Environmental Health (CIEH) and welcomes the FSA’s new Chair. Sign up to receive regular updates."
        },
        {
            "text": "On 1 July the FSA was delighted to welcome Professor Susan Jebb as the new FSA Chair. Susan joins us from the University of Oxford, where she will continue with a part-time appointment alongside her role at the FSA. Susan has said her aim is to champion science and transparent, evidence-based decision making, while ensuring the consumer perspective is central to everything we do."
        },
        {
            "text": "The FSA deals with more than 2,500 food and feed incidents every year, working closely with other agencies and businesses to take action to protect health. Over the last month we’ve been dealing with one of the more unusual investigations. Since April, there have been more than 400 cases of feline pancytopenia, which is a potentially fatal illness in cats. Along with partners including the Animal Plant and Health Agency and the Royal Veterinary College, we’re investigating a possible link to certain cat food products. This has led to a recall, and the businesses affected are taking precautionary action. You might not be aware that the FSA’s remit also includes pet food as part of our responsibilities on animal feed."
        },
        {
            "text": "I was pleased to speak to the CIEH last week and take part in a fascinating panel discussion for their latest food safety conference. I thanked environmental health practitioners, who have been under enormous pressure over the last year. I also called for a strategic workforce plan for the environmental health profession and reflected on how things had gone on food safety and regulation since Brexit. You can read my speech to the CIEH here."
        },
        {
            "text": "I hope you’ve found this latest message useful. If you’d like to get future editions direct to your inbox, sign up for the updates. You can also sign up to be notified of all FSA posts, not just this message."
        },
        {
            "heading": 1,
            "text": "\nDiweddariad Emily Miles i randdeiliaid – croesawu’r Athro Susan Jebb, galw cynhyrchion bwyd cathod yn ôl a fy araith i CIEH"
        },
        {
            "text": "Mae Prif Weithredwr yr Asiantaeth Safonau Bwyd (ASB) Emily Miles yn trafod digwyddiad bwyd anarferol, ei haraith ddiweddar i Sefydliad Siartredig Iechyd yr Amgylchedd (CIEH) ac yn croesawu Cadeirydd newydd yr ASB. Cofrestrwch i gael diweddariadau rheolaidd."
        },
        {
            "text": "Ar 1 Gorffennaf, roedd yr ASB yn falch iawn o groesawu'r Athro Susan Jebb fel Cadeirydd newydd yr ASB. Mae Susan yn ymuno â ni o Brifysgol Rhydychen, lle bydd yn parhau gyda phenodiad rhan-amser ochr yn ochr â’i rôl yn yr ASB. Mae Susan wedi dweud mai ei nod yw hyrwyddo gwyddoniaeth a gwneud penderfyniadau tryloyw, yn seiliedig ar dystiolaeth, wrth sicrhau bod persbectif y defnyddiwr wrth wraidd popeth a wnawn."
        },
        {
            "text": "Mae'r ASB yn delio â mwy na 2,500 o ddigwyddiadau bwyd a bwyd anifeiliaid bob blwyddyn, gan weithio'n agos gydag asiantaethau a busnesau eraill i weithredu er mwyn diogelu iechyd. Dros y mis diwethaf rydym ni wedi bod yn delio ag ymchwiliad digon anarferol. Ers mis Ebrill, bu mwy na 400 o achosion o pancytopenia cathod, a allai fod yn salwch angheuol mewn cathod. Ynghyd â phartneriaid, gan gynnwys yr Asiantaeth Planhigion ac Iechyd Anifeiliaid a'r Coleg Milfeddygol Brenhinol, rydym ni’n ymchwilio i gysylltiad posibl â rhai cynhyrchion bwyd cathod. Mae hyn wedi arwain at rybudd galw cynnyrch yn ôl, ac mae'r busnesau yr effeithir arnynt yn cymryd camau rhagofalus. Efallai nad ydych yn ymwybodol bod cylch gwaith yr ASB hefyd yn cynnwys bwyd anifeiliaid anwes fel rhan o'n cyfrifoldebau dros fwyd anifeiliaid."
        },
        {
            "text": "Roeddwn yn falch o siarad â Sefydliad Siartredig Iechyd yr Amgylchedd (CIEH) yr wythnos diwethaf a chymryd rhan mewn trafodaeth banel hynod ddiddorol yn eu cynhadledd ddiweddaraf ar ddiogelwch bwyd. Fe wnes i ddiolch i ymarferwyr iechyd yr amgylchedd, sydd wedi bod dan bwysau aruthrol dros y flwyddyn ddiwethaf. Galwais hefyd am gynllun gweithlu strategol ar gyfer proffesiwn iechyd yr amgylchedd a myfyrio ar waith o ran diogelwch a rheoleiddio bwyd ers Brexit. Gallwch chi ddarllen fy araith i'r CIEH yma."
        },
        {
            "text": "Rwy’n gobeithio i chi gael y neges ddiweddaraf hon yn ddefnyddiol. Os hoffech gael rhifynnau’r dyfodol yn uniongyrchol i’ch mewnflwch, cofrestrwch am y diweddariadau. Gallwch chi hefyd gofrestru i gael eich hysbysu am bob blog gan yr ASB, ac nid y neges hon yn unig."
        }
    ]
}