{
    "url": "https://educationhub.blog.gov.uk/2021/07/school-funding-what-you-need-to-know-about-how-were-making-it-fairer-for-all/",
    "title": "School funding: What you need to know about how we’re making it fairer for all",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Funding",
        "School spending",
        "Schools"
    ],
    "pub_date": "2021-07-08T13:50:59+01:00",
    "content": [
        {
            "text": "This year schools across England will get a total of £39 billion in core funding to spend on children’s education – this is known as revenue funding. This includes what they spend on paying teachers, leaders and staff, teaching resources and more. It’s in addition to the money they get to spend on buildings and maintenance – known as capital funding."
        },
        {
            "text": "Making sure that revenue funding is distributed fairly is a complicated issue. Every child, school and area is different and it means the funding system has to reflect that. For example, some pupils will be eligible for free school meals, or will have other additional needs that can cost schools more to meet"
        },
        {
            "text": "That’s why we have a national funding formula to make sure schools are funded fairly."
        },
        {
            "heading": 3,
            "text": "So, what is the schools national funding formula (NFF)?"
        },
        {
            "text": "Put simply, the schools NFF is the way the government decides how funding is allocated to mainstream schools in England."
        },
        {
            "heading": 3,
            "text": "And how does it currently work?"
        },
        {
            "text": "The NFF works by using the number of pupils in a school, their needs (such as whether or not they are eligible for free schools meals) and other information about the school’s situation to determine how much they attract. The NFF funding for each school is then added up to create a total allocation, or 'amount’, for each local authority to hand out."
        },
        {
            "text": "Local authorities then set their own formulae to hand out their total allocation between all the schools in their area."
        },
        {
            "text": "This means that while the Government’s NFF determines how much money each local authority receives, it is the local authorities’ own formulae that determine how much each school finally receives."
        },
        {
            "text": "This can result in some amounts that schools actually receive being lower or higher than what they “attract” through the NFF. There can be cases where schools would receive significantly different funding levels, if they happened to be located in a different area."
        },
        {
            "heading": 3,
            "text": "OK, so how will the changes to the NFF work and will there be more?"
        },
        {
            "text": "The proposed changes to the NFF aims to simplify the process by making sure all schools are funded on a single, fair and consistent basis, levelling up education across the country."
        },
        {
            "text": "The key change is that local authorities would no longer use their own formulae to hand out final allocations."
        },
        {
            "text": "This means that funding will be better matched to the needs of schools, regardless of where they are located."
        },
        {
            "text": "This is a major reform to the way schools are funded, and that’s why we are seeking views from the sector to make sure the change is gradual and smooth."
        },
        {
            "text": "The 12-week consultation, launched today, will seek views on how to simplify the current national funding formula to ensure all schools are funded on a single, fair and consistent basis."
        },
        {
            "text": "A second stage consultation will be published at a later date with more detailed proposals, following feedback to this first consultation."
        },
        {
            "text": "More information on the latest funding consultation is available at: Fair school funding for all: completing our reforms to the National Funding Formula - GOV.UK (www.gov.uk)."
        }
    ]
}