{
    "url": "https://nationalscreening.blog.gov.uk/2021/07/08/whole-genome-sequencing-and-newborn-screening/",
    "title": "Whole genome sequencing and newborn screening",
    "authors": [
        "Prof Anne Slowther"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-07-08T12:16:22+01:00",
    "content": [
        {
            "text": "Whole genome sequencing (WGS) has huge potential for the future of screening in the UK and recent rapid advances in the speed and cost of this technology have meant that it has now become a realistic possibility. In 2020 the UK government published its genomics healthcare strategy in which it committed to explore how WGS could or should be implemented for newborn screening."
        },
        {
            "text": "However, before the UK National Screening Committee (UK NSC) recommends such a screening programme research will be needed to carefully consider the benefits and harms, as well as the practical and ethical challenges of implementing such a programme. It will also be crucial to understand the views and values of the public in relation to WGS, and to newborn screening, so that these are taken into account when any programme is developed."
        },
        {
            "text": "For this reason, the UK NSC partnered with Genomics England and UK Research and Innovation’s Sciencewise programme to commission a public dialogue on the implications for the NHS and for society of using WGS for newborn screening."
        },
        {
            "text": "An oversight group was convened to provide guidance to the project team. The group provided a wide range of perspectives and expertise including patient support and advocacy groups, health care professionals, geneticists, academics, and policy makers."
        },
        {
            "heading": 2,
            "text": "The WGS public dialogue"
        },
        {
            "text": "A total of 133 people took part in the dialogue. Eighty-four people, selected to reflect the general population were drawn from across the UK. A further 49 people were recruited from groups that may have a particular perspective on this issue: new and expectant parents, people living with a genetic condition, people with Black, Asian or minority ethnic heritage, and young adults."
        },
        {
            "text": "The process involved a series of 4 intensive workshops and a seminar, with ‘homework’ in between. In the workshops the participants heard from experts in genome sequencing and newborn screening as well as from people with experience of living with genetic conditions. Over the course of the project they considered a wide range of questions about WGS and newborn screening. These included the potential of WGS to replace or be used in addition to current newborn screening programmes, perhaps to screen for more conditions, and its potential to be used for purposes other than traditional screening such as developing personalised medicines or identifying conditions presenting later in life."
        },
        {
            "text": "As chair of the oversight group I observed several of the workshops and was extremely impressed by the enthusiasm and thoughtfulness of all the participants, and the thoroughness of the process of engagement with these challenging ethical issues."
        },
        {
            "heading": 2,
            "text": "Views of participants"
        },
        {
            "text": "While there were a range of views and priorities there were some important messages that were common across all groups. Participants were excited by the possibilities opened up by WGS for disease prevention and treatment and for future research. They were supportive of its potential use in newborn screening but only if proper consideration was given to its design and planning."
        },
        {
            "text": "In particular, participants stressed the importance of parents giving their informed consent to screening and that care should be taken in providing high quality information to parents at a time when they were best placed to consider it. They recognised some of the difficulties, for instance that the results of the tests might be uncertain or give information that was not relevant to the baby until they were fully grown. Having the resources to meet these challenges would be an important pre-requisite to implementing any programme."
        },
        {
            "text": "While participants supported the potential use of WGS to expand the current newborn screening programme, they felt it should be used to do this only when there are suitable interventions available that can prevent or treat the conditions."
        },
        {
            "text": "The groups supported WGS for future uses such as research and development of new treatments. However, they were clear that this should be with appropriate consent and that there would need to be proper safeguards to protect and control the data, with legislation that was ‘future proofed’. They were also concerned that the benefits of WGS should be distributed fairly across the UK and safeguards should be in place to avoid inequalities in either data collection or access to treatment."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "The thoughtful and insightful contributions of all participants in this dialogue have provided a rich source of information which will be of great value to the UKNSC when it is considering future recommendations on the role of WGS in newborn screening."
        },
        {
            "text": "The project has also highlighted the huge contribution that dialogue and engagement with the public can make to how we develop and use ethically challenging but potentially life changing technologies."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}