{
    "url": "https://defrafarming.blog.gov.uk/2023/11/30/coming-soon-grants-to-attract-private-investment-in-nature/",
    "title": "Coming soon: grants to attract private investment in nature",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to support private investment"
    ],
    "pub_date": "2023-11-30T12:55:19+00:00",
    "content": [
        {
            "text": "The Natural Environment Investment Readiness Fund (NEIRF) will soon offer grants designed to help farmers attract private investment in nature. "
        },
        {
            "text": "We've published guidance for the grant on GOV.UK to help you prepare. "
        },
        {
            "text": "You’ll be able to apply on 11 December 2023. The deadline is 16 February 2024. "
        },
        {
            "text": "Individual grants of up to £100,000 are available to each project to develop to the point that they are ready to attract private sector investment. In total, £5 million is available. "
        },
        {
            "text": "This is the third time grants have been made available through the fund, but this is the first time grants will be specifically targeted to support the farming sector. "
        },
        {
            "text": "Grants will fund the preparation of projects that help farmers to access nature markets. "
        },
        {
            "text": "It will enable farmers to come together on a landscape scale and present a combined offer to investors, allowing more farmers and — more types of farmers — to access and benefit from nature markets. "
        },
        {
            "text": "We want private sector investment to support carbon capture, biodiversity uplift, water quality, natural flood management and other ecosystem services, through activities such as woodland creation or peatland restoration. "
        },
        {
            "text": "The guidance sets out the full details, but projects must demonstrate how they will support farmers to access nature markets, or have significant farmer representation through a partnership. "
        },
        {
            "text": "Farmers and farmer-led groups are encouraged to apply. We also welcome applications for non-farming not-for-profit organisations, charities, non-governmental organisations (NGOs), public bodies and businesses as long as they can demonstrate how their project will support farmers to access nature markets. "
        },
        {
            "text": "This grant complements the wider farming offer in England. It works alongside the Sustainable Farming Incentive (SFI) in that it allows for the same area of land to be entered into an agreement and a private sector arrangement, such as carbon trading or payments for natural flood management.  "
        },
        {
            "text": "Landscape Recovery and Facilitation Fund projects can also blend public and private investment. Recipients are eligible to apply for this funding.  "
        },
        {
            "text": "Government has set a target to stimulate at least £500 million of private sector investment into nature recovery in England, each year, by 2027 – rising to at least £1 billion each year by 2030. "
        },
        {
            "text": "This grant is part of our efforts to help halt and reverse the decline of nature in our country. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "The Green Finance Institute (GFI) has used insight from NEIRF-funded projects to develop a toolkit to support farmers accessing nature market opportunities. "
        },
        {
            "text": "The Environment Agency administers the scheme on behalf of  Defra. If you have any questions about this grant after reading the guidance, email NEIRF@environment-agency.gov.uk. "
        }
    ]
}