{
    "url": "https://food.blog.gov.uk/2023/11/30/debunking-the-myths-of-food-hygiene-rating-inspections/",
    "title": "Debunking the myths of food hygiene rating inspections",
    "authors": [
        "FHRS10"
    ],
    "categories": [
        "Food Hygiene Ratings",
        "People"
    ],
    "pub_date": "2023-11-30T09:00:15+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Jason Austin, Food and Health Protection Manager from Torfaen County Borough Council. This case study is part of our celebration campaign marking 10 years of the mandatory display of Food Hygiene Ratings in Wales. "
        },
        {
            "text": "“No two days are the same when working as an Environmental Health Officer”, said Jason Austin from Torfaen County Borough Council."
        },
        {
            "text": "Since the introduction of the mandatory display of food hygiene ratings in 2013, local authorities have received more requests for re-rating inspections. These requests typically stem from businesses that receive lower ratings and have made the necessary improvements to receive a higher rating; a re-rating inspection will incur a standard fee. Consumers are much more interested in knowing what rating their local food businesses have achieved. “A high rating is often viewed by people working in the food industry as a personal achievement that they can be proud to display. It has definitely helped to drive up standards of compliance. It also promotes good business and creates healthy competition. It shows that the business takes food hygiene seriously and encourages customers to buy food there”."
        },
        {
            "heading": 2,
            "text": "“Having a 5 rating is regarded by many as receiving a recognised award.”"
        },
        {
            "text": "Jason has spent his entire working career in Environmental Health, with a brief change in a role managing Torfaen Council’s Test, Trace and Protect team during the COVID-19 pandemic. He now manages a team of eight, including an intern who is working towards a qualification in food control. “We inspect a huge range of premises from factories, schools, hospitals, cafes to home catering businesses. It’s a busy and varied job. The team also investigate reports of food poisoning cases, carry out health and safety inspections at local authority enforced workplaces and monitor private water supplies. In some instances, the team have to take enforcement action to deal with non-compliances, such as when a business is refusing to display their food hygiene rating sticker.”"
        },
        {
            "text": "Jason is keen to dispel a few myths around food hygiene inspections. Some people think that officers assess the standard of service and even the taste and quality of foods, or that a poor rating is due to a lack of paperwork. “It’s not about how the food looks or how it tastes.” Officers look at hygiene practices, such as preventing food from risks of contamination, storing it at the right temperature and ensuring it is cooked properly, so that it is safe to eat. Inspections also focus on the structure and carry out checks to confirm there is running hot water and enough sinks and wash hand basins etc. There is also a legal requirement to demonstrate food safety is being proactively managed through documented procedures."
        },
        {
            "heading": 2,
            "text": "“We’re here to help. We are passionate about working with businesses and we want to help them succeed.”"
        },
        {
            "text": "Starting up a new business and knowing you’ll be getting an inspection can seem daunting, even businesses who have been running for years can be nervous about a visit from the local authority officer."
        },
        {
            "text": "When asked what advice he would give to businesses who are apprehensive about their inspections, Jason said “We’re here to help. We are passionate about working with businesses and we want to help them succeed. We are striving to achieve a common goal, we all want to prevent people from getting ill and we will work with businesses to help achieve this. Please use the resources that are available to new and existing food businesses online. Get in touch with your local Environmental Health Officer, who will be more than happy to support and advise”."
        },
        {
            "text": "Find out more about how the food hygiene rating scheme affects your business and get in touch with your local authority who  may provide or recommend food hygiene courses. Check the rating of your favourite eatery on food.gov.uk."
        },
        {
            "heading": 1,
            "text": "Chwalu’r chwedlau am arolygiadau’r Cynllun Sgorio Hylendid Bwyd"
        },
        {
            "text": "Mae’r astudiaeth achos hon yn rhan o’n hymgyrch i ddathlu 10 mlynedd ers iddi ddod yn ofyniad cyfreithiol i arddangos Sgoriau Hylendid Bwyd yng Nghymru. Cawsom sgwrs â Jason Austin, Rheolwr Diogelwch Bwyd ac Iechyd o Gyngor Bwrdeistref Sirol Torfaen.  "
        },
        {
            "text": "“Nid oes unrhyw ddau ddiwrnod yr un fath wrth weithio fel Swyddog Iechyd yr Amgylchedd”, meddai Jason Austin o Gyngor Bwrdeistref Sirol Torfaen."
        },
        {
            "text": "Ers iddi ddod yn ofyniad cyfreithiol i arddangos sgoriau hylendid bwyd yn 2013, mae awdurdodau lleol wedi cael mwy o geisiadau am arolygiadau ailsgorio. Mae’r ceisiadau hyn fel arfer yn dod oddi wrth y busnesau hynny sydd wedi ennill sgoriau is ond sydd wedi gwneud y gwelliannau angenrheidiol i gael sgôr uwch. Codir ffi safonol am arolygiad ailsgorio. Erbyn hyn, mae gan ddefnyddwyr lawer mwy o ddiddordeb mewn gwybod pa sgôr sydd gan y busnesau bwyd yn eu hardal leol. “I bobl sy’n gweithio yn y diwydiant bwyd, mae sgôr uchel yn cael ei hystyried yn gyflawniad personol y gallant fod yn falch o’i dangos. Mae’n sicr wedi helpu i godi safonau cydymffurfio. Mae hefyd yn hyrwyddo arferion busnes da ac yn creu cystadleuaeth iach. Ym marn llawer, mae ennill sgôr o 5 yn debyg i dderbyn gwobr gydnabyddedig. Mae’n dangos bod y busnes yn cymryd hylendid bwyd o ddifrif ac yn annog cwsmeriaid i brynu bwyd yno”."
        },
        {
            "heading": 2,
            "text": "“Ym marn llawer, mae ennill sgôr o 5 yn debyg i dderbyn gwobr gydnabyddedig.”"
        },
        {
            "text": "Mae Jason wedi treulio’i holl yrfa’n gweithio ym maes Iechyd yr Amgylchedd, heblaw am gyfnod byr pan oedd yn rheoli tîm Profi, Olrhain a Diogelu Cyngor Torfaen yn ystod y pandemig COVID-19. Erbyn hyn, mae e’n rheoli tîm o wyth, gan gynnwys intern sy’n gweithio tuag at gymhwyster mewn rheoli bwyd. “Rydym yn arolygu ystod anferth o safleoedd fel ffatrïoedd, ysgolion, ysbytai, caffis a busnesau arlwyo cartrefi. Mae’n swydd brysur ac amrywiol. Mae’r tîm hefyd yn ymchwilio i adroddiadau am achosion o wenwyn bwyd, yn cynnal arolygiadau iechyd a diogelwch mewn gweithleoedd dan orfodaeth awdurdodau lleol, ac yn monitro cyflenwadau dŵr preifat. Mewn rhai achosion, mae’n rhaid i’r tîm gymryd camau gorfodi i ymdrin ag achosion o ddiffyg cydymffurfio, gan gynnwys pan fydd busnes yn gwrthod arddangos ei sgôr hylendid bwyd.”"
        },
        {
            "text": "Mae Jason yn awyddus i chwalu rhai chwedlau am arolygiadau hylendid bwyd. Mae rhai pobl yn meddwl bod swyddogion yn asesu safon y gwasanaeth, a hyd yn oed blas ac ansawdd bwydydd, neu fod sgôr wael o ganlyniad i ddiffyg gwaith papur. “Nid yw’n ymwneud â sut mae’r bwyd yn edrych na sut mae’n blasu.” Mae swyddogion yn edrych ar arferion hylendid, fel atal bwyd rhag risgiau o halogiad, storio bwyd ar y tymheredd cywir, a sicrhau ei fod wedi’i goginio’n gywir, gan sicrhau ei fod yn ddiogel i’w fwyta. Mae arolygiadau hefyd yn canolbwyntio ar yr adeilad, a chynhelir gwiriadau i gadarnhau bod dŵr tap poeth, a bod digon o sinciau a basnau golchi dwylo ac ati. Mae gofyniad cyfreithiol hefyd i ddangos bod y busnes yn cymryd camau rhagweithiol i reoli diogelwch bwyd, a hynny drwy weithdrefnau dogfenedig."
        },
        {
            "heading": 2,
            "text": "“Rydym yma i helpu. Rydym yn angerddol dros weithio gyda busnesau ac rydym am eu helpu i lwyddo.”"
        },
        {
            "text": "Mae dechrau busnes newydd a gwybod y byddwch yn destun arolygiad yn gallu bod yn frawychus. Gall hyd yn oed fusnesau sydd wedi bod yn weithredol ers blynyddoedd deimlo’n nerfus am ymweliad gan swyddog yr awdurdod lleol."
        },
        {
            "text": "Pan ofynnwyd iddo am air o gyngor i fusnesau sy’n teimlo’n bryderus am eu harolygiadau, dywedodd Jason “rydym yma i helpu. Rydym yn angerddol dros weithio gyda busnesau ac rydym am eu helpu i lwyddo. Rydym yn ymdrechu i gyrraedd nod cyffredin. Mae pob un ohonom eisiau atal pobl rhag mynd yn sâl, a byddwn yn gweithio gyda busnesau i helpu i gyflawni hyn. Defnyddiwch yr adnoddau sydd ar gael ar-lein i fusnesau bwyd hen a newydd fel ei gilydd. Cysylltwch â’ch Swyddog Iechyd yr Amgylchedd lleol a fydd yn fwy na pharod i’ch cefnogi a’ch cynghori”."
        },
        {
            "text": "Dysgwch fwy am sut mae’r cynllun sgorio hylendid bwyd yn effeithio ar eich busnes a chysylltwch â’ch awdurdod lleol a all ddarparu neu argymell cyrsiau hylendid bwyd. Gwiriwch sgôr eich hoff fwyty ar food.gov.uk."
        }
    ]
}