{
    "url": "https://forestrycommission.blog.gov.uk/2023/11/30/is-coppicing-right-for-my-woodland/",
    "title": "Is coppicing right for my woodland?",
    "authors": [
        "Tom Pattinson"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2023-11-30T08:13:30+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is coppicing?"
        },
        {
            "text": "Coppicing is the process of cutting a tree close to the ground in the autumn and winter to encourage the production of shoots from the base of the tree, this forms what is known as a stool. These shoots grow rapidly and produce a crop consisting of many stems which are typically ready for harvesting after 7-20 years, depending on the desired product. This can be done with most British hardwoods, with hazel, willow, sweet chestnut and oak being good species."
        },
        {
            "text": "Stools coppiced in the same year in the same area can be grouped together to form a coupe. Several coupes can then be combined within a woodland to form a coppice. For example, a hazel coppice on an eight-year rotation could be separated into eight equally sized coups to provide a steady production of hedging stakes."
        },
        {
            "heading": 2,
            "text": "Why Coppice?"
        },
        {
            "text": "Coppicing can provide a variety of ecological and economic benefits."
        },
        {
            "heading": 3,
            "text": "Ecological benefits"
        },
        {
            "text": "Coppicing emulates the natural formation of semi-open glades and creates a permanent early successional habitat, which includes a mix of light demanding annuals, grasses and shrubs. It also provides several micro habitats (open, semi-open and closed canopy) which benefit a wide range of species in a small geographical area. This is particularly useful for light demanding ground plants."
        },
        {
            "text": "As the site is coppiced repeatedly there is a permanence of the open and semi-open wooded habitats, this allows for low mobility species such as high brown fritillary butterflies to colonise and flourish on the site."
        },
        {
            "heading": 3,
            "text": "Economic benefits"
        },
        {
            "text": "Coppicing provides a regular crop of products on a relatively short rotation when compared to conventional timber, for example 10 years vs 60 years. The coppice regrowth provides a continuous crop for harvesting without the need to replant."
        },
        {
            "text": "Coppicing also provides products to a range of traditional crafts including hedge layers, thatchers and basket makers."
        },
        {
            "heading": 2,
            "text": "The coppicing checklist"
        },
        {
            "heading": 3,
            "text": "Confirm if your woodland is suitable for coppicing"
        },
        {
            "heading": 3,
            "text": "Make sure there is enough light"
        },
        {
            "text": "Coppice stools require a high amount of light to allow for sufficient regrowth."
        },
        {
            "heading": 3,
            "text": "Protect your woodland from deer"
        },
        {
            "heading": 3,
            "text": " Seek expert advice"
        },
        {
            "heading": 3,
            "text": "Manage your expectations"
        },
        {
            "text": "Coppicing is a way to manage your woodland and it can pay for itself, but you need to be aware that:"
        },
        {
            "heading": 2,
            "text": "How can the Forestry Commission help?"
        },
        {
            "text": "We can help you develop a woodland management plan to better inform management decisions in your woodland."
        },
        {
            "text": "With a woodland management plan, you could be eligible for the Countryside Stewardship Higher Tier funding, where there is a grant for coppice restoration, and capital grants for deer fencing and deer control."
        },
        {
            "text": "You can also apply for felling licences which will likely be needed for coppice restoration."
        },
        {
            "text": "I’d like to thank members of the National Coppice Federation and others for sharing their photos with us."
        }
    ]
}