{
    "url": "https://kingsawards.blog.gov.uk/2023/11/30/kings-awards-recipient-garadry-welcomes-hrh-the-duke-of-gloucester-kg-gcvo/",
    "title": "King's Awards recipient GaraDry® welcomes HRH The Duke of Gloucester KG GCVO",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-11-30T15:11:22+00:00",
    "content": [
        {
            "text": "HRH The Duke of Gloucester KG GCVO paid a special visit to GaraDry® in Ormskirk on Friday (24th November 2023) for a special tour of the company and to present staff with an award from His Majesty the King."
        },
        {
            "text": "The King’s Award for Enterprise celebrates outstanding achievements by UK businesses and is internationally recognised. Lancashire-based GaraDry® has won the King’s Award for Enterprise in the International Trade category."
        },
        {
            "text": "Ashley Smith, 43, who founded the company in 2009, attended Buckingham Palace during the summer to celebrate his company’s achievement."
        },
        {
            "text": "The actual award was presented by HRH The Duke of Gloucester on Friday."
        },
        {
            "text": "Based in Ormskirk, Lancashire, GaraDry® designs, manufactures, and sells the world’s largest range of threshold seals for residential garage doors and commercial doors."
        },
        {
            "text": "The innovative garage door seals and flood barrier kits are designed to form a watertight seal between a garage door and the floor. The threshold seal also prevents leaves, dust and debris from being blown under to ensure a clean and dry garage all year round. The garage door threshold seals also act as a defence against rodents, insects and reptiles."
        },
        {
            "text": "The company has grown its domestic and international sales dramatically in the last three years and is a proud exporter of British designed and manufactured products."
        },
        {
            "text": "GaraDry® opened a subsidiary in the USA in 2017 (GaraDry LLC), to handle strong interest from Americans in the products and launched a fulfilment centre in Tennessee to ship transatlantic orders quickly."
        },
        {
            "text": "A warehouse was also set up in Germany in 2022 to fulfil all EU orders and smooth the challenges of Brexit."
        },
        {
            "text": " "
        },
        {
            "text": "Ashley Smith, managing director of GaraDry®, added:"
        },
        {
            "text": "“We were thrilled to receive the visit from HRH The Duke of Gloucester who  presented our team with this award which will now take pride of place in our reception. We are all delighted and humbled for our company, which started off life in a garden shed, to receive this accolade."
        },
        {
            "text": " “It encourages us even further to continue designing innovative products for people all over the world. This has been a great  year for GaraDry® and this is the perfect springboard for us as we work on our growth plans for 2024.”"
        },
        {
            "text": " "
        },
        {
            "text": "Ashley Dalton MP for West Lancashire said:"
        },
        {
            "text": "“It is great that innovative companies like GaraDry® are recognised in this way and I’m sure this will inspire them to grow even further and continue to do great things on the international stage.” "
        },
        {
            "text": " "
        },
        {
            "text": "Councillor Maureen Nixon, Mayor of West Lancashire said: "
        },
        {
            "text": "“I am proud and honoured to help celebrate the success of GaraDry® with the staff and His Royal Highness. It’s an incredible achievement for this local company which continues to grow, develop new products and is a fantastic success story.” "
        },
        {
            "text": " "
        },
        {
            "text": "Jacqui Sinnott-Lacey, Chief Operating Officer, West Lancashire Borough Council "
        },
        {
            "text": "“It is an honour to be here today to meet the team behind such an inspirational organisation. GaraDry® is a fantastic example of a business based in our region that is expanding and reaching new territories all over the world.”"
        },
        {
            "text": "See uk.garadry.com"
        },
        {
            "text": " "
        }
    ]
}