{
    "url": "https://userresearch.blog.gov.uk/2023/11/30/lessons-from-the-field-an-ethnographic-approach-to-understand-peoples-lived-experience/",
    "title": "Lessons from the field: an ethnographic approach to understand people’s lived experience",
    "authors": [
        "Dan Barwick",
        "Becky Miller"
    ],
    "categories": [
        "Case studies",
        "User research",
        "User research methods"
    ],
    "pub_date": "2023-11-30T15:50:42+00:00",
    "content": [
        {
            "text": "In May this year we were tasked with understanding how government farming advisers could encourage farmers and land managers to aim for more ambitious environmental outcomes when applying for funding from the Countryside Stewardship scheme. With our backgrounds in social research (Dan) and policy design (Becky), we decided to include an ethnographic element in our research. This method would allow us to learn things about our participants which might not be strictly within our scope (in this case Countryside Stewardship), but from experience we knew these kinds of insights could prove fundamental in understanding our research question and the policy area more deeply. And from a user-centred perspective, these kinds of insights are critical to make sure we are designing the right thing for people. "
        },
        {
            "heading": 2,
            "text": "What is ethnography? "
        },
        {
            "text": "Ethnography is a qualitative research method which involves observing people’s behaviours in their natural environments. It aims to capture a detailed and rich account of a social setting from the participant’s perspective. "
        },
        {
            "text": "Our research involved shadowing government farming advisers on their farm visit days. This allowed us to observe in real time how they went about advising farmers and land managers, hearing about issues that came up, and observing their interactions more generally. We followed our shadowing visits with online interviews and journey mapping, so that we could also ask specific questions regarding their role and experience advising on Defra’s Countryside Stewardship scheme."
        },
        {
            "text": "Ethnographers can take on both an active role, participating in the research setting, or a passive role, observing from a short distance. Our shadowing approach allowed us to both observe advisers’ interactions with farmers and also be part of the farm visit itself. This included the possibility of asking some questions and experiencing other aspects of the adviser’s day, including travelling between rural sites and their lunch break time.  "
        },
        {
            "text": "Ethnographic research can be recorded in a range of ways, including writing up field notes, keeping ethnographic diaries, capturing photographs and videos, as well as collecting any artefacts that provide insight into participants’ lived experience. These activities tend to be led by the researcher, but can also be led by the participant. For example, asking participants to keep a video diary using their mobile phone. In this instance, we asked permission to take photos during our visits. We were keen to include this visual element in our research to give a richer, more compelling level of context that can inspire more empathy when sharing findings with people who weren’t part of the research."
        },
        {
            "text": "We’ll share our top 3 benefits for bringing an ethnographic, lived experience approach into your user research and service design practice\n"
        },
        {
            "heading": 2,
            "text": "Benefits of researching lived experience"
        },
        {
            "heading": 2,
            "text": "Inspired to try ethnography yourself?  "
        },
        {
            "text": "The GDS Service Manual has guidance to help you plan and carry out contextual research and observation. If you’re new to lived experience research, social researchers can also be a great support advising on how to bring an ethnographic approach to your research. You can contact the Government Social Research (GSR) Profession to find social researchers in your department. You’re also welcome to contact Dan (daniel.barwick2@defra.gov.uk) directly if you’re keen to draw on his expertise and experience with ethnography.  "
        },
        {
            "text": "Policy Lab (where Becky worked previously) has been pioneering the use of ethnography in policy making across government for several years now. You can read about how they used film ethnography for their lived experience research on the Independent review of Children’s Social Care, and watch the ethnographic videos they produced for the National Landscapes Review and the Windrush Lessons Learnt Review."
        },
        {
            "text": "Becky Miller (senior service designer) and Dan Barwick (user researcher) work on Defra’s Farming and Countryside Programme."
        }
    ]
}