{
    "url": "https://naturalengland.blog.gov.uk/2023/11/30/looking-ahead-to-cop28/",
    "title": "Looking ahead to COP28",
    "authors": [
        "Mike Morecroft"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2023-11-30T14:33:29+00:00",
    "content": [
        {
            "text": "By Mike Morecroft, Deputy Director, Climate Change Science"
        },
        {
            "text": "As we look ahead to the UN Climate Change Conference (COP28) starting this week in Dubai, it’s worth reflecting on how climate and nature are inextricably linked. Much of our work at Natural England is done at the local or national level, but we work within a wider global context."
        },
        {
            "text": "We see the impacts of climate change affecting where different species can survive and thrive, how habitats are changing and rising sea levels re-shaping our coastline.  We are using science to understand these changes and then adapting our work to get the best outcomes for nature and people. We are also working to restore high carbon ecosystems such as peatlands, woodlands and saltmarsh, to help stop greenhouse gases getting into the atmosphere and re-start the uptake of carbon. We have established adaptation plans for our National Nature Reserves and are considering how we ensure SSSIs can best support thriving nature under climate change."
        },
        {
            "text": "Another key part of our scientific work is to measure changes in carbon and understand how we can deliver better results for climate, nature and people. We’re leading the Nature Returns programme (Nature Returns - Natural England (blog.gov.uk), working with partners as a major contribution to this."
        },
        {
            "text": "As a Natural England scientist, a big part of my work is to help us to learn from international science and ensure the lessons we have learnt in this country feed into global efforts to understand and effectively tackle climate change. Having been to the last two climate change COPs, as part of my work with the Inter-governmental Panel on Climate Change, (COP27 – a personal perspective - Natural England (blog.gov.uk) I’ll be following developments from a distance this year."
        },
        {
            "text": "All UN Conventions have regular meetings known as ‘Conferences of the Parties’ or COPs, where countries who have signed the convention come to together to review and progress action. However, the COPs of the UN Framework Convention on Climate Change have achieved a degree of profile that no others have, with many world leaders attending as well as national negotiators – the core participants. There are also thousands of representatives of businesses and civil society who attend as ‘observers’ although in practice a whole series of parallel events takes place alongside, but separate from, the actual negotiations."
        },
        {
            "text": "So what can we expect this time? The key element of this year’s COP is the completion of the ‘Global Stocktake’. This is a requirement of the Paris Agreement and requires a thorough assessment of progress towards meeting the objectives of the Agreement, including keeping global temperature rise to ‘well below 2°C and pursuing efforts to limit it to 1.5°C’."
        },
        {
            "text": "The blunt truth is that the nations of the world are not on track to hold global warming to 1.5°C or close to it. There are debates about whether this is even possible now; it will certainly require a considerable acceleration of progress with reducing emissions and carbon dioxide removal from the atmosphere in some form (including through natural solutions such as forest restoration)."
        },
        {
            "text": "From an ecological perspective it really matters that global temperature rise is kept as low as possible. We are already seeing the impacts of climate change, including extinctions of species and it is also critical to ensuring that natural ecosystems go on taking carbon dioxide out of the atmosphere.  Every fraction of a degree matters."
        },
        {
            "text": "Fossil fuel burning remains the largest source of greenhouse gas emissions to the atmosphere. Making progress in rapidly reducing this is a key issue at COP which will be contentious.  On the other hand, there is more conspicuous support for increasing the deployment of renewables with China and USA agreeing to support a trebling of global capacity by 2030."
        },
        {
            "text": "The role of nature is being recognised with the UAE presidency designating the theme for 9 December as Nature, Land Use, and Oceans. Our own, Tony Juniper, chair of the Natural England board will be going this year to take part. The critical role of forests in the global carbon cycling has long been recognised but last year’s COP formally recognised the role of ‘Nature-based Solutions’ in its cover decision for the first time. This broader context is a positive development for linking the climate change and nature agendas."
        },
        {
            "text": "One key development since last year has been COP15 of the Convention on Biological Diversity, at which there was international agreement to protect 30% of global surface area by 2030 – the 30x30 target. This is a key element in both reducing emissions and building the resilience of the world’s ecosystems. The challenge is to turn that policy into practice."
        },
        {
            "text": "Which brings us back where we started. International policy making can’t take place in a vacuum: the lessons of practical experience really matter. And at the same time the work we do locally must take account of the role we play in that bigger, global context."
        }
    ]
}