{
    "url": "https://naturalengland.blog.gov.uk/2023/11/30/natural-england-to-publish-updated-nutrient-budget-calculators-and-tees-round-4-rescheduled/",
    "title": "Natural England to publish updated nutrient budget calculators, and Tees Round 4 rescheduled",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Natural England",
        "Nature Recovery Network",
        "Nutrient Neutrality"
    ],
    "pub_date": "2023-11-30T10:00:22+00:00",
    "content": [
        {
            "text": "Image: Natural England"
        },
        {
            "text": "The government passed the Levelling-Up and Regeneration Bill into law on 26th October 2023, making it the Levelling-Up and Regeneration Act. This creates a legal requirement for certain wastewater treatment works designated by the Defra Secretary of State to be upgraded by 2030. This is great news for our rivers and wildlife, as these wastewater treatment plants will be more efficient at removing nutrient pollution before it reaches our waterways, enabling nature recovery."
        },
        {
            "text": "Once it is known where and when reductions in nutrients will happen, this can be factored into nutrient neutrality calculations and assessments. Defra Secretary of State will publish a list of all wastewater treatment works to be upgraded as soon as practical after the 26th January 2024. We will use this information to update our nutrient budget calculators, which we hope to publish online for the first time. This will make finding the calculators simpler and ensure the most up to date versions are always available."
        },
        {
            "text": "The updated calculators may result in a change to the mitigation requirements for developments. These can be broadly categorised into the following:"
        },
        {
            "text": "These changes acknowledge the reduced pressures of nutrient pollution on some of our protected sites following the wastewater treatment works upgrades. The reduced nutrient pollution is reflected in a corresponding reduced mitigation requirement, ensuring no additional harm to protected sites."
        },
        {
            "text": "We want to make sure the updated calculators are used in advance by developers applying to Natural England for credits. This is to reduce the potential need for re-calculation of credit budgets later on, and the inherent uncertainty and administration that would create. For this reason, Round 4 of credit sales in the Tees catchment will now open on 19 February 2024."
        },
        {
            "text": "For news of credit rounds and guidance on how to apply please check our GOV.UK page."
        }
    ]
}