{
    "url": "https://space.blog.gov.uk/2023/11/30/satellites-the-power-behind-our-modern-world/",
    "title": "Satellites – the power behind our modern world",
    "authors": [
        "ClearSpace"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "Space sustainability"
    ],
    "pub_date": "2023-11-30T15:51:17+00:00",
    "content": [
        {
            "text": "An artistic impression of the CLEAR mission. Image credit: ClearSpace"
        },
        {
            "heading": 2,
            "text": "The hidden heroes of technology"
        },
        {
            "text": "The environment of near-Earth space is the heartbeat of everyday life on Earth in our modern digital and information-hungry world."
        },
        {
            "text": "Almost every industry and business worldwide relies on the day-to-day operation of satellites and the complex infrastructure created in Earth's orbit. So much so that we all now take for granted even the most basic daily activities, such as communication via our smartphones that connect us worldwide."
        },
        {
            "text": "Did you ever wonder, for example, how money is transferred from your bank account when you pay for shopping on your bank card or grab a takeaway coffee? Probably not, but each time a transaction is made, it travels via satellite between your bank and the business."
        },
        {
            "text": "You might be surprised by how much our everyday lives rely on satellite signals. They permeate almost every sector, making people safer and our lives more efficient, revolutionising how national infrastructures work and interact."
        },
        {
            "text": "Here are a few examples:"
        },
        {
            "text": "The complex satellite data transmission systems we rely on are increasingly susceptible to space debris damage. As more and more objects are launched into space, the risk of collisions and damage to active spacecraft increases. As each day passes, reducing this threat as much as possible becomes ever more critical."
        },
        {
            "heading": 2,
            "text": "How does space debris affect our lives?"
        },
        {
            "text": "The once-pristine region of near-Earth space is now estimated to contain more than 130 million pieces of space junk, from tiny flecks of spacecraft paint to old satellites, spent rocket bodies, and even tools dropped by astronauts."
        },
        {
            "text": "As a result, space debris and the growing orbital congestion created by ongoing launches for mega constellations of small satellites are two of the biggest challenges facing the global space sector today and, by extension, our modern lives."
        },
        {
            "text": "Read more about the proliferation of space in the first blog of our series."
        },
        {
            "text": "Infrastructure in low-Earth orbit (LEO) has to be protected from high-speed impacts with toughened shielding. The International Space Station (ISS) is also at direct risk, with increasing numbers of emergency manoeuvres required to avoid potential collisions and keep onboard astronauts safe."
        },
        {
            "text": "Reducing the creation of orbital debris will help make the precious near-space environment more sustainable, which is crucial to maintaining functioning societies and future development benefits."
        },
        {
            "text": "You can read more about these in the next blog of our series soon."
        },
        {
            "text": "Artistic view from space. Image credit: ClearSpace"
        },
        {
            "heading": 2,
            "text": "Cleaning up our cosmic environment: a call for global action"
        },
        {
            "text": "It goes without saying that impacts on satellites can have significant knock-on implications for life back on Earth, and this is why the quest to minimise space debris is so important."
        },
        {
            "text": "Any reduction in the quality of communications and navigation satellite service could be devastating, and if signals are lost altogether because of an impact or collision, services could be disrupted indefinitely."
        },
        {
            "text": "Making Earth's orbit sustainable for the long term requires immediate and coordinated international action. Whilst various initiatives to monitor and limit the proliferation of space debris are in place, much more needs to be done."
        },
        {
            "text": "The UK Space Agency is one of those leading the way in addressing the space debris problem and has allocated an initial £4 million to fund two innovative space missions."
        },
        {
            "text": "One of them, the CLEAR mission (Clearing of the LEO Environment with Active Removal), led by ClearSpace in collaboration with eight other UK-based companies, aims to collect and bring defunct satellites back to Earth while also facilitating the development of advanced space technologies like complex robotics and AI-based algorithms."
        },
        {
            "text": "This is but one of many steps in the UK’s journey and commitment towards preserving space for future generations, with more announcements to come."
        }
    ]
}