{
    "url": "https://defradigital.blog.gov.uk/2023/11/30/seven-tips-to-protect-your-data-this-festive-season/",
    "title": "Seven tips to protect your data this festive season",
    "authors": [
        "Laurie Doyle"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-11-30T07:29:15+00:00",
    "content": [
        {
            "text": "On Computer Security Day, Laurie Doyle from Defra group Security explains the steps we can all take to protect our data. This is particularly important during the upcoming festive season, when many of us are likely to be shopping for gifts online."
        },
        {
            "text": "The security of our personal information is important 365 days a year, but Computer Security Day is a good reminder to all of us to take the right steps in securing our devices. With the National Cyber Security Centre (NCSC) reporting an estimated 64% increase in cyber attacks during 2023, knowing how to protect yourself and your data is essential."
        },
        {
            "text": "Online shopping has enjoyed exponential growth in recent years, with the United Kingdom boasting the most advanced e-commerce market in Europe. In 2023, we are expected to have nearly 60 million e-commerce users meaning the majority of people now choose to buy online."
        },
        {
            "text": "A consequence of this growth is that online shopping has become the norm for UK shoppers and it’s vital that we take steps to protect ourselves and our data from the risks that come from participating in the e-commerce world."
        },
        {
            "heading": 2,
            "text": "Things to think about"
        },
        {
            "text": "There are lots of ways to enhance the security of our devices, many of which we do without thinking. Why not try making a list of all the ones you remember? You might be surprised at how many you already know."
        },
        {
            "text": "Below, I’ve included some ideas on how to protect your devices, some of which you may not have considered before."
        },
        {
            "text": "These are just some of the steps you can take to keep your devices secure. This Computer Security Day is a great chance to review the ways we all currently protect our data, and to consider whether the ideas listed here might be useful when shopping this festive season."
        }
    ]
}