{
    "url": "https://educationhub.blog.gov.uk/2023/11/30/the-national-education-nature-park-how-to-get-involved/",
    "title": "The National Education Nature Park: how to get involved",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "climate change",
        "Schools"
    ],
    "pub_date": "2023-11-30T15:05:35+00:00",
    "content": [
        {
            "text": "Launched in October with the Natural History Museum and the Royal Horticultural Society, the National Education Nature Park offers children and young people the opportunity to take hands-on action to improve biodiversity and tackle climate change."
        },
        {
            "text": "Schools, colleges and nurseries that sign up will have access to a range of resources including digital tools, classroom activities, and an interactive map displaying the growing Nature Park across the school estate."
        },
        {
            "text": "Here’s everything you need to know about the National Education Nature Park, from how it works, to where to sign up."
        },
        {
            "heading": 3,
            "text": "What is the National Education Nature Park?"
        },
        {
            "text": "The National Education Nature Park is helping children around the country connect to the natural world, especially in urban and nature-deprived areas, by tracking their local environment through a virtual map across England."
        },
        {
            "text": "Whether it’s through building rain gardens, growing pollinator-friendly plants, or creating habitats, the Nature Park is inspiring young people to take action to engage with nature in their local area."
        },
        {
            "text": "They are then encouraged to follow this activity on an online, interactive map which will track the collective difference being made for nature across the education estate."
        },
        {
            "text": "We’ve also announced £15 million of funding to help disadvantaged schools in nature-deprived areas to get involved. A list of the eligible settings and the eligibility criteria can be found here."
        },
        {
            "heading": 3,
            "text": "How can my school sign up to the National Education Nature Park?"
        },
        {
            "text": "Teaching and non-teaching staff from nurseries, schools and colleges can register their education setting for free by submitting the form here."
        },
        {
            "text": "Nearly 1200 schools, colleges and nurseries have already signed up."
        },
        {
            "heading": 3,
            "text": "How does the National Education Nature Park link to the curriculum?"
        },
        {
            "text": "Every school that registers on the website to join the Nature Park can now access free learning resources and guidance, linked with the National Curriculum, to help them work with children and young people to take positive action for the environment."
        },
        {
            "text": "Actions pupils could take include:"
        },
        {
            "text": "The library of resources will grow over time, with new digital tools and community science guidance becoming available over the next academic year."
        },
        {
            "text": "These resources have been designed with teachers and nature experts to support teaching and learning about the natural environment and climate change."
        },
        {
            "text": "Sam Hartley, Senior Programme and Partnerships Manager at the Royal Horticultural Society, said:"
        },
        {
            "heading": 3,
            "text": "What tools are available?"
        },
        {
            "text": "The partnership has worked with GIS mapping software company Esri UK to devise digital tools for use by children and young people, which can be accessed through mobile apps and online."
        },
        {
            "text": "These tools will help participants to map the biodiversity of their school grounds and how it changes over time, boosting skills in mapping, numeracy and spatial awareness."
        },
        {
            "text": "By uploading details of their sites to a nationwide database, participants will also be contributing to globally important research on national biodiversity."
        },
        {
            "text": "Katie Hall, Schools Manager at Esri UK, said: "
        },
        {
            "text": "Dr Jessica Tipton, Head of the National Education Nature Park at the Natural History Museum, said: "
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "To find out more and keep up to date, please visit the National Education Nature Park website here."
        },
        {
            "text": "The Nature Park is part of the government’s flagship Sustainability and Climate Change Strategy for Education."
        }
    ]
}