{
    "url": "https://marinescience.blog.gov.uk/2023/11/30/too-hot-to-handle-marine-climate-change-risks-and-opportunities-for-adaptation-in-the-gulf/",
    "title": "Too hot to handle? Marine climate change risks and opportunities for adaptation in the Gulf",
    "authors": [
        "Will Le Quesne"
    ],
    "categories": [
        "adaptation",
        "Climate Change",
        "marine protected areas",
        "Policy",
        "Science"
    ],
    "pub_date": "2023-11-30T09:56:07+00:00",
    "content": [
        {
            "text": "As world leaders meet at the United Nations Framework Convention on Climate Change (UNFCCC) 28th Conference of the Parties (COP28) in Dubai this week, Cefas Middle East Programme Director Will Le Quesne, discusses the challenge of climate change facing the world’s hottest region and how new evidence produced by the Regional Organization for the Protection of the Marine Environment (ROPME), in collaboration with Cefas, will help support adaption efforts."
        },
        {
            "text": "When people think about the impacts of global warming, they often imagine melting glaciers or freak weather patterns, such as heatwaves. But what about the impact on countries that already experience some of the hottest temperatures on earth?"
        },
        {
            "text": "The Arabian / Persian Gulf is the world’s hottest sea, and it is becoming hotter due to climate change. Its waters are experiencing increasing temperatures and salinity, rising sea level and decreasing oxygen levels. In Kuwait in 2020, sea temperatures reached a record breaking 37.6 °C. Home to a wide range of biodiversity including corals, turtles, dugong (sea cows), dolphins and sharks, this warming threatens the region’s biodiversity and coastal communities. Marine biodiversity in the Gulf is particularly vulnerable to climate change as unlike in other parts of the world, there are no species pre-adapted to warmer conditions that can move in from warmer waters as it becomes too hot for the species that traditionally live there."
        },
        {
            "text": "Negotiations at COP28 will yet again address the importance of reducing greenhouse gas emissions to limit the impacts of climate change. This year will include the first ever ‘Global Stocktake’, where countries assess their combined commitments and progress towards meeting the goals set out in the 2015 Paris Climate Change Agreement to limit global temperatures well below 2oC and ideally below 1.5oC. This includes identifying where there are still gaps or shortfalls against these goals, and agreeing additional, collective action to address these. This year’s conference will also focus on delivering more finance from wealthier countries to help those most vulnerable to adapt to the impacts of climate change."
        },
        {
            "text": "Climate adaptation is important in the Gulf region because even if the world stopped all greenhouse gas emissions today, the sea temperature and sea level will continue to rise. This will cause multiple impacts including further losses of coral reefs, declines in fish stocks, and will threaten coastal industries like desalination plants, due to damage caused by sea level rises and increased storms and cyclones."
        },
        {
            "text": "Despite these risks the impact of climate change on the Gulf and the opportunities for adaptation in the region are relatively under studied."
        },
        {
            "text": "Filling the evidence gap"
        },
        {
            "text": "To address this challenge, Cefas’ International Marine Climate Change Centre is working with the ROPME to deliver a multi-year marine climate change Regional Action Plan. ROPME is the regional sea convention made up of Bahrain, Iran, Iraq, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates that covers the Gulf and northern Indian Ocean waters of the Member States."
        },
        {
            "text": "The Regional Action Plan aims to provide the evidence base to support ROPME Member States in protecting their marine environment from climate change. This includes evaluating climate impacts and adaptation actions, and evaluating the potential for blue carbon habitats, such as mangroves and saltmarshes, to reduce the extent of climate change."
        },
        {
            "text": "The outputs from these studies have been published as a series of Policy Briefs and Technical Report on the ROPME website. A recent evidence review (a policy brief is now also available in English,  Arabic and Farsi) and regional risk assessment (also available in Arabic and  Farsi) identified a number of climate impacts and risks to biodiversity and society in the ROPME Sea Area including:"
        },
        {
            "text": "Adaptation actions in the Gulf"
        },
        {
            "text": "Following these studies, Cefas scientists, the ROPME Secretariat and scientists from across the Member States collaborated to publish three new reports which provide practical advice on adaptation measures to build climate resilience across three priority areas:"
        },
        {
            "text": " "
        },
        {
            "text": "The reports were prepared following a series of multi-sectoral stakeholder workshops with government, industry and academic representatives from across the region to share expertise and develop options for practical solutions to the challenges of climate change."
        },
        {
            "text": "Participants from the climate impacts Technical Support Group during the risk assessment workshop in Muscat Oman."
        },
        {
            "text": "“A key concept in building climate resilience, including for corals, is to identify and reduce human pressures” said Prof Michelle Devlin, Cefas’ Principal Coral Scientist, and author of the coral adaptation report."
        },
        {
            "text": "“During the adaptation workshops we worked with regional experts and identified that excess nutrient inputs, coastal development and fishing are key factors that are negatively impacting coral reefs. Controlling these is the first step in building climate resilience before engaging in more active interventions to build healthy ecosystems, such as coral gardening, that can further increase resilience.”"
        },
        {
            "text": "To support action on blue carbon the Action Plan published the first regional inventory of blue carbon habitats for the region. A series of webinars was held to bringing experts together from across the region to share practical experiences in protection and restoration of mangroves, seagrass and salt marsh."
        },
        {
            "text": "Dr John Pinnegar, Director of the International Marine Climate Change Centre said, “through active collaboration with experts from all eight ROPME Member States we have built a robust regional evidence base that can guide marine climate action in the region. This year’s COP28 has highlighted the urgency of the task ahead and it’s vital that we work together to address the critical challenge of climate change”."
        },
        {
            "text": "[**To note this blog has been adapted from a previous blog, here]"
        }
    ]
}