{
    "url": "https://defradigital.blog.gov.uk/2022/08/01/hooked-line-and-sinker-how-feedback-has-helped-improve-the-rod-licensing-process/",
    "title": "Hooked, line and sinker: how feedback has helped improve the rod licensing process",
    "authors": [
        "Jenny Yates"
    ],
    "categories": [
        "Defra digital",
        "User centred design",
        "User research"
    ],
    "pub_date": "2022-08-01T13:53:56+01:00",
    "content": [
        {
            "text": "As National Fishing Month gets underway, Jenny Yates, Service Owner for Defra’s ‘I Want to Fish’ service, explains how feedback has helped the service to make further improvements to benefit anglers."
        },
        {
            "text": "Our ‘I Want to Fish’ (IWTF) team's Get a Fishing Licence (GAFL) product is responsible for nearly all of the £24million of fisheries income which the Environment Agency then channels directly back into fisheries and angling improvements. Having been live for five years, as a development team we’ve made leaps and strides to meet our user and business needs."
        },
        {
            "text": "In 2020 we wrote about how obtaining or renewing your rod licence was now easier than ever thanks to our new ‘Automated Expiry Notifications’ process for renewing a fishing licence, which had launched a few weeks earlier."
        },
        {
            "text": "Fast forward a year to last summer and we were celebrating achieving Government Digital Service (GDS) ‘LIVE’ accreditation for the GAFL service. We knew how important that was because each service that progresses through a GDS assessment needs to evidence how the service and the team meets the standards, and GAFL was one of the first services within the Environment Agency / Defra to do so."
        },
        {
            "heading": 2,
            "text": "Not resting on our fishing baskets….."
        },
        {
            "text": "Recent, further changes, such as the introduction of apps and digital licences, are really making a big impact and yielding significant benefit."
        },
        {
            "text": "However, sometimes it’s the small things that make life that little bit easier and can make all the difference for anglers, allowing them to concentrate on enjoying their sport."
        },
        {
            "text": "A balance of big hitting improvements, while ensuring our users are happy with our service, is key for user satisfaction and maximising the potential to increase rod licence sales for the Environment Agency."
        },
        {
            "heading": 2,
            "text": "Feedback is only valuable if you act on it"
        },
        {
            "text": "We pay close attention to our live service feedback, and we noticed users coming back to our product were frustrated when required to enter identical personal and licence details year on year. One user put it particularly clearly:"
        },
        {
            "text": "'I really cannot understand why you do not provide your customers with a simple link to take them straight to a payment details page - you already hold all my details from last year's licence. You could easily ensure the information you hold is up to date by simply asking on the payment details page.'"
        },
        {
            "text": "So, we acted. We’ve now developed and tested a personal link, which can be displayed in an email when reminding anglers their licence is about to expire."
        },
        {
            "text": "The link takes anglers to a new page, where they verify who they are, and can proceed directly to a page where they confirm personal and licence details, pay and then they’re done! A new and secure licence purchase, in just a few clicks."
        },
        {
            "heading": 2,
            "text": "What the users say"
        },
        {
            "text": "We’ve had some brilliant feedback from our users during our pilot phase:"
        },
        {
            "text": "‘Could not suggest any ways to improve, very easy and quick service’.\n‘Very good now - individual personalised links save time. Great customer experience - very slick’."
        },
        {
            "text": "This has been such a satisfying change for our team, and a great example of listening to users’ needs and finding real solutions to support them on their journey."
        },
        {
            "text": "This change has been another step to ensure we make the most of the time anglers are on our live service, enabling us to secure rod licence income for our fisheries and the future of angling. The full roll-out of this feature will be coming later this month, and we'll be monitoring our user feedback in coming months to understand if we can improve on our first iteration. Click. Click. Click. Legal and ready to fish!"
        }
    ]
}