{
    "url": "https://socialcare.blog.gov.uk/2022/08/01/make-sure-youre-prepared-for-autumn-boosters/",
    "title": "Make sure you're prepared for autumn boosters",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Guidance",
        "Workforce"
    ],
    "pub_date": "2022-08-01T17:01:08+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Always looking ahead"
        },
        {
            "text": "We may be in the midst of summer, record breaking heatwaves and all but, like most care and health professionals, my thoughts inevitably turn to autumn and winter. This is when seasonal viruses make their annual pilgrimage to care homes and clinical settings, now joined by another uninvited guest: coronavirus."
        },
        {
            "text": "Even with the amazingly swift formulation and deployment of effective vaccines, the ever present threat of new, more infectious, variants demands there be no complacency. We must continue rigorous testing, maintain the fully vaccinated status of colleagues and those we care for, and continue to demonstrate the highest standards of infection prevention and control (IPC)."
        },
        {
            "text": "Only such high levels of preparedness can help us maximise the impact of the vaccine programme. Critical to this is the issue of consent forms. It’s so important staff in all care settings make the case for covid vaccine boosters and flu jabs now, making consent from colleagues, residents and others in receipt of care a formality."
        },
        {
            "text": "Our NHS colleagues are putting vaccination teams together and will again prioritise those in receipt of social care services. Where possible and practical, flu vaccines will be offered alongside COVID-19 boosters."
        },
        {
            "heading": 2,
            "text": "Clearing the path to consent"
        },
        {
            "text": "You can find useful guidance here, including consent forms for staff and residents. Meanwhile, Jenny Firth, Deputy Director of Adult Social Care Operational Resilience at the Department of Health and Social Care, has written to the care sector about the preparations and processes needed for this autumn’s vaccination programme to progress smoothly and at pace."
        },
        {
            "text": "In some ways, it feels still strange, two years later, to still be talking about the pandemic. However, its persistence only spurs our collaborative efforts, and continues to concentrate our minds on the issues of IPC, testing and vaccines."
        },
        {
            "text": "On a related point, our colleagues in NHS England have recently issued their plan for improving long COVID services, a reminder the effects of coronavirus can continue long after initial infections are dealt with."
        },
        {
            "text": "Developed with expert insights from those with lived experience of long COVID, clinicians and partners across the health and care system, it builds on the progress made over the past two years and sets out the action needed to make sure support is there for everyone who needs it."
        },
        {
            "text": "So, whether it’s about protecting against infections in the here and now, or minimising the chances of succumbing to long-covid, gaining consent from those who stand to benefit the most has never been more important. I know you will all do what you can."
        },
        {
            "text": "The hard work of our 1.5 million strong care workforce – and our equally dedicated NHS colleagues - never fails to amaze me. Vaccination, the highest standards of IPC and your commitment to protect and support others will continue to see us through good times and bad – and long may it be so."
        }
    ]
}