{
    "url": "https://dluhcdigital.blog.gov.uk/2022/08/01/new-user-centred-services-for-planning-applications-are-now-live-on-council-websites/",
    "title": "New user-centred services for planning applications are now live on council websites",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2022-08-01T11:30:12+01:00",
    "content": [
        {
            "text": "Three new DLUHC funded digital planning services, co-designed by a pioneering group of local councils, are now live on the websites of Buckinghamshire, Lambeth and Southwark Councils. "
        },
        {
            "heading": 2,
            "text": "Levelling Up, Regeneration and Digital Planning"
        },
        {
            "text": "DLUHC’s work to modernise the planning system in England focuses on three key elements of change: digital citizen engagement, modern planning software, and planning data that is easy to find, use and trust."
        },
        {
            "text": "The legislation that supports this work, the Levelling Up and Regeneration Bill was introduced to Parliament in May 2022 and is currently being debated through the committee stage, however digital reforms to planning that this legislation supports are already taking shape in the real world. "
        },
        {
            "text": "The release of these three new user-centred digital planning services will look to modernise the software used by Local Planning Authorities for the submission and processing of planning applications, also known as development management."
        },
        {
            "heading": 2,
            "text": "Overview of the new services"
        },
        {
            "text": "Three new services are available to people in Buckinghamshire, Lambeth and Southwark via their councils’ website. "
        },
        {
            "text": "The services are:"
        },
        {
            "text": "‘Find out if you need planning permission’ and ‘Apply for a Lawful Development Certificate (LDC)’ are applicant-facing services. They help residents and professionals to understand which permitted development rights exist on a property, and to submit proposals where planning permission is unlikely to be needed. A Lawful Development Certificate is the proof that a project is lawful for planning purposes, such as works allowed under permitted development. The services have been developed as part of the RIPA (Reducing Invalid Planning Applications) project."
        },
        {
            "text": "Lawful Development Certificate applications received by local councils can then be validated and processed in the Back Office Planning System (BOPS) service. BOPS is primarily a council officer-facing service, but it also enables direct communications between planning officers and applicants, for example, when amendments to a proposal are needed. The service has been developed as part of the Back Office Planning System (BOPS) project."
        },
        {
            "heading": 2,
            "text": "Why this is significant"
        },
        {
            "text": "The applicant-facing services are unique in that they only ask a user questions that are relevant to their project, and can signpost applicants towards relevant legislation that could impact their proposal, meaning no prior planning expertise is required. "
        },
        {
            "text": "Key information is captured as data, rather than being stored in documents, so that it can be used more flexibly for other purposes such as efficient application processing by planning officers. "
        },
        {
            "text": "A good example of this is a feature that allows applicants to draw a red line boundary when submitting an application. On receipt by the local planning authority, this is presented to planning officers using BOPS as a polygon of data points on a map. This also means that if there are issues with the boundary, both the applicant and the planning officer can redraw the red line boundary digitally without the applicant having to provide additional documents or drawings."
        },
        {
            "text": "The services are intuitive to use, having been designed with comprehensive feedback from users such as residents, planning agents and council officers, and the expectation is that they will increase the number of applications that are considered ‘valid’, with all correct information submitted first-time."
        },
        {
            "text": "Simple but common errors such as missing a scale bar from a location plan, or an incorrectly completed field in an application form mean that on average up to 50% of applications are ‘invalid’ and cannot be processed when received. It is less likely that these mistakes will be made using the new services because the opportunity to make errors has been removed where possible."
        },
        {
            "text": "Both user testers and key stakeholders within the councils who have gone live with these services have been very positive about the new services. "
        },
        {
            "text": "Christine Urry, Head of Planning and Development at Buckinghamshire Council commented that they “have been really impressed with the new Find Out If You Need Planning Permission Service” and that “it is clear that it is going to become an important tool within the planning service going forward.” "
        },
        {
            "text": "In addition, a research participant working as a freelance architect who tested the apply for a Lawful Development Certificate service told the team that the service was “a very easy and simple process, easy to follow in terms of questions and how it has been laid out” and that they “would be happy to use the new service in the future”."
        },
        {
            "heading": 2,
            "text": "Then and now: next steps for the project"
        },
        {
            "text": "The Reducing Invalid Planning Applications (RIPA) and Back Office Planning System (BOPS) projects were awarded funding from DLUHC’s Local Digital Fund in 2019. Led by Lambeth, Southwark and Buckinghamshire councils, and supported by personnel from DLUHC and a small group of digital agencies, they have moved through discovery, alpha and beta phases of product development."
        },
        {
            "text": "Focusing on Lawful Development Certificates has allowed the team to collaborate on a common application type that is based on national legislation, and to develop technical infrastructure that can also be used for more complex application types. Working together, the combined project team is now designing services for full householder planning applications."
        },
        {
            "text": "We are aware that ‘RIPA’ and ‘BOPS’ are not the most accessible names for projects or new digital services. In the months ahead you will see the work aligned under the banner of ‘Open Digital Planning’. A comprehensive project website will be launched later this year, with more information about how other councils can adopt the products."
        },
        {
            "text": "We’re already excited that following on from this first wave of councils launching the products, more will follow in the months ahead. Residents of Camden, Dacorum, Doncaster, Gloucester, Medway, and Newcastle should keep their eyes peeled!"
        },
        {
            "heading": 2,
            "text": "Connect with the project team"
        },
        {
            "text": "We plan to launch more opportunities later in the year for local planning authorities to contribute to the development, testing and use of the Open Digital Planning services being co-created by local planning authorities. "
        },
        {
            "text": "To stay up to date on the progress of these services, and to find out about future funding opportunities, register to join the project mailing list or to attend the team’s monthly Show and Tells or follow the Digital Planning team on Twitter."
        }
    ]
}