{
    "url": "https://knowledgeasset.blog.gov.uk/2022/08/01/the-knowledge-assets-grant-fund-is-open-for-a-second-round/",
    "title": "The Knowledge Assets Grant Fund is open for a second round!",
    "authors": [
        "Michael Rignall"
    ],
    "categories": [
        "Knowledge Assets Grant Fund"
    ],
    "pub_date": "2022-08-01T14:51:35+01:00",
    "content": [
        {
            "text": "We are pleased to confirm that a new round of the Knowledge Assets Grant Fund is now open! All the information you will need to apply is on our GOV.UK page."
        },
        {
            "text": "As with the previous round, we have three different types of grants available: Explore, Expand and Extend. Please visit the links below for more information on each:"
        },
        {
            "text": "All applications will be reviewed by the expert panel, who will provide useful feedback on your project. Expand and Extend projects applicants will also be required to attend a panel to discuss their project (deadlines and panel dates below)."
        },
        {
            "text": "The submission deadlines for each of the three panel sessions are shown below:"
        },
        {
            "text": "If you have some great Knowledge Assets and ideas, we would love for you to consider applying! If you are just getting started, read on for some case studies to give you an idea of what we are looking for, and some advice from our previously successful awardees."
        },
        {
            "text": "The team is always happy to discuss ideas and answer questions on the grant fund; get in touch at GrantFund.GOTT@beis.gov.uk."
        },
        {
            "text": "Improving our services"
        },
        {
            "text": "Working with our new partners in Innovate UK, we want applicants to enjoy a more streamlined process, with clear updates on the status of their application. To that end, we have made a number of improvements to the scheme for this round:"
        },
        {
            "heading": 2,
            "text": "Case Studies"
        },
        {
            "text": "We were able to lend financial backing to many innovative new projects in the first round of funding. A number of these are beginning to show clear signs of progress as a result of our support."
        },
        {
            "text": "This includes the GIAA’s Insights Engine, which was the recipient of an Explore Grant."
        },
        {
            "text": "The Insight Engine contains an ‘advanced search’ tool which uses a form of artificial intelligence (AI) to highlight common phrases, conduct sentiment analysis (i.e. whether a statement is positive or negative), and efficiently extract key points from documents. The Insights Engine can read up to 500 documents at once and enables users to quickly extract trends and insights, generating significant time savings and enabling forms of analysis that were previously too labour-intensive to be worthwhile."
        },
        {
            "text": "GIAA have used their grant funding to develop the Insights Engine further to include network analysis which gives high level insights into the content of the document collection. GIAA’s next steps include deploying the Insights Engine for wider usage and getting more government departments to work with GIAA to pilot it."
        },
        {
            "text": "Dr Iain McGregor, Director of Innovation and Development at GIAA, has the following advice to share with potential applicants to our funding scheme:"
        },
        {
            "text": "“Be clear about your objectives. Don’t have too many of them. Focus on the outcome that will provide the most opportunity to evaluate and enhance your knowledge asset.”"
        },
        {
            "text": "STFC’s Novel VUV light source for water treatment is also seeing the benefits of its Expand Grant fund award. "
        },
        {
            "text": "This technology aims to produce a cheaper, higher intensity VUV light source that could be used to purify water, air, and surfaces of pollutants and pathogens."
        },
        {
            "text": "With the funding received, the team at STFC set to work on enhancing prototype maturity to demonstrate higher throughput of light and improved stability to enable deployment for water treatment."
        },
        {
            "text": "This successful prototyping, combined with market research and commercial review, confirmed that water treatment was the key market to pursue in the first instance, crystallising the team’s approach to spinning out the technology. The team was also able to bring extra expert resource on board, to help to identify broader market opportunities."
        },
        {
            "text": "Dr Liam Brennan, Head of Technology Transfer at STFC, has the  advice below :"
        },
        {
            "text": "“This project was an example where a sector expert has helped deepen the team’s knowledge of the applications areas and opened new impactful avenues to target. Applicants should aim to build in external validation milestones (i.e., industry advisors, potential customers) for any commercialisation development. This is to ensure you are focusing commercialisation relevant outputs over scientific discovery.”"
        },
        {
            "text": "The NHS Christie Foundation Trust is making good use of its Explore Grant funding, applying it to work on health datasets to assist with rectal cancer diagnosis."
        },
        {
            "text": "The Christie Hospital has a multifaceted and longitudinal dataset on cancer patients, which they identified could be linked up with additional datasets to learn more about the disease."
        },
        {
            "text": "The funding has been used to demonstrate a proof-of-concept: collecting and analysing tumour samples from consenting patients on whom they held longitudinal data, to perform analysis to then match across further sample collections and datasets."
        },
        {
            "text": "This work has proved that tissue samples could be collected and analysed to enrich their already valuable broader genomic dataset."
        },
        {
            "text": "Dr Paul Sutton, who leads on this work at the Christie Hospital, had the following advice to share:"
        },
        {
            "text": "“Consider broadly how elements of existing assets could be combined, as well as expanded, to add to greater understanding and improved validity. A successful grant application is likely to show a project achievable within the timeframe and a clear vision as to how the development is likely to benefit the organisation, other partners and the UK.”"
        },
        {
            "text": " "
        }
    ]
}