{
    "url": "https://nationalscreening.blog.gov.uk/2025/09/30/behind-the-scenes-with-the-uk-nscs-research-and-methodology-group/",
    "title": "Behind the scenes with the UK NSC’s Research and Methodology Group",
    "authors": [
        "Professor Sian Taylor-Phillips"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-09-30T10:44:10+01:00",
    "content": [
        {
            "text": "In an era of rapid advances in screening technologies and a growing focus on personalised prevention, the UK National Screening Committee (UK NSC) relies on rigorous, policy-relevant research to shape its recommendations."
        },
        {
            "text": "Central to that mission is the UK NSC’s Research and Methodology Group (RMG). The RMG operates as a formal expert advisory group to the UK NSC. It does not make recommendations, but plays a vital role in making sure research proposals are aligned with the committee’s high evidential standards and criteria."
        },
        {
            "heading": 2,
            "text": "RMG’s role and membership"
        },
        {
            "text": "The UK NSC set up the RMG in response to its expanded remit, which includes risk stratified and targeted screening as well as population-based screening."
        },
        {
            "text": "Its members bring together expertise in:"
        },
        {
            "text": "Screening programmes are offered to very large numbers of well people with the aim of improving health outcomes."
        },
        {
            "text": "However, sometimes we only have evidence of the impact on health outcomes a decade or more after individuals are first invited. Screening programmes also consume large amounts of public resources."
        },
        {
            "text": "These facts can make research into new screening programmes, or modifications to existing programmes, a daunting prospect for academics and funders."
        },
        {
            "text": "However, well-designed screening research can have a huge positive impact on population health. Recognising this, a key RMG role is to support researchers in designing efficient proposals that are likely to affect screening policy."
        },
        {
            "heading": 2,
            "text": "Submission process"
        },
        {
            "text": "We have developed a process for researchers to submit requests for advice on screening research proposals to the RMG."
        },
        {
            "text": "The RMG meets quarterly. See upcoming meeting  dates and deadlines."
        },
        {
            "heading": 2,
            "text": "Topics discussed"
        },
        {
            "text": "Since its launch, the RMG has advised on a wide range of screening research projects covering topics such as:"
        },
        {
            "text": "There has been a significant emphasis on emerging technologies, including:"
        },
        {
            "heading": 2,
            "text": "Useful advice"
        },
        {
            "text": "The RMG aims to provide feedback that is supportive, informative, and tailored to specific research needs."
        },
        {
            "text": "It helps identify evidence gaps, refine research priorities and steer study design to give researchers the best chance of influencing UK screening policy. "
        },
        {
            "text": "RMG advice cannot guarantee that the UK NSC will later make a positive recommendation, should the proposal reach that stage. However, its input does improve the chance of the research answering the kinds of questions the committee is likely to ask to inform recommendations."
        },
        {
            "text": "Health Technology Assessment (HTA) Programme research into asymptomatic bacteriuria in pregnancy is one example of a research proposal that was discussed at the RMG and has resulted in a funded call for research."
        },
        {
            "heading": 2,
            "text": "Feedback to drive improvement"
        },
        {
            "text": "The RMG encourages researchers who engage with the group to complete a short survey about their experience. Feedback from the survey, designed to take a few minutes to complete, supports continuous improvement."
        },
        {
            "text": "The survey asks for insights from applicants on:"
        },
        {
            "text": "Researchers who have responded to the survey have generally been very positive about their experience."
        },
        {
            "text": "Participants have consistently rated the process highly across multiple dimensions. One researcher said the RMG feedback was 'very important' in changing their approach. Several others said they had received grant funding for research after engaging with the RMG."
        },
        {
            "text": "Survey feedback has also highlighted areas for potential improvement. It will help us refine how the RMG works and ensure it continues to meet the needs of the research community."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email  uknsc@dhsc.gov.uk."
        }
    ]
}