{
    "url": "https://naturalengland.blog.gov.uk/2025/09/30/celebrating-five-years-of-the-people-and-nature-surveys-what-weve-learned-about-englands-love-for-the-outdoors/",
    "title": "Celebrating five years of the People and Nature Surveys: What we’ve learned about England’s love for the outdoors ",
    "authors": [
        "Sheldon Allen"
    ],
    "categories": [
        "Connecting People with Nature",
        "Countryside Code",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2025-09-30T08:30:00+01:00",
    "content": [
        {
            "text": "By Sheldon Allen, Project Manager, Natural England’s People and Nature Survey Team "
        },
        {
            "heading": 4,
            "text": "Nature and happiness – what's the connection? "
        },
        {
            "text": "What makes you feel happy? For most people in England, it’s time spent outdoors. Our People and Nature Survey for England (PaNS) is now in its fifth year, and the message is clear: 85% of adults say nature boosts their happiness. "
        },
        {
            "text": "Nature helps us feel less stressed, more energised, and more connected. Whether it’s a walk in the park, listening to birdsong, or volunteering for a local conservation project, there’s no single way to enjoy the outdoors. "
        },
        {
            "text": "Even small moments - like pausing to notice the changing seasons - can lift our mood. Scientists have found that being in nature can reduce stress in our brains, and even the chemicals in soil and leaves may play a part in making us feel happier. "
        },
        {
            "heading": 4,
            "text": "Health and Nature "
        },
        {
            "text": "It’s not just about happiness - nature is vital for our health. Our latest annual report out this month shows that 91% of people agree being in nature benefits their physical health, and 90% say it helps their mental wellbeing. "
        },
        {
            "text": "Green Social Prescribing (GSP) is helping make this a reality across the country. GSP connects people with nature-based activities, such as gardening or walking groups, to support mental health. Natural England is a key partner in the first national GSP programme, working with NHS England, Defra, and others to scale up referrals and test new approaches. "
        },
        {
            "text": "We’re also supporting GPs to integrate nature into patient care, and working with the Centre for Sustainable Healthcare to green NHS estates, turning hospital grounds into places that support both people and wildlife. "
        },
        {
            "heading": 4,
            "text": "Barriers to Nature "
        },
        {
            "text": "Despite the positive connection between nature and wellbeing, barriers remain. 65% of non-visitors told us they would have liked to spend more time outside, but factors like bad weather, anti-social behaviour, and lack of facilities get in the way. "
        },
        {
            "text": "Our data also shows that younger adults and people identifying as Black or Black British are more likely to say they don’t have local green spaces within easy walking distance. These insights highlight the need for targeted action to ensure everyone can access nature. "
        },
        {
            "text": "We’re tackling these barriers head-on by working with a wide range of partners and communities. Through inclusive campaigns like the Agency for Nature, led by Purpose Disruptors, and the Outdoor Citizen Project with YHA and All the Elements, we’re empowering young people and supporting grassroots initiatives that make the outdoors more welcoming for everyone. These collaborations help amplify diverse voices and encourage new audiences to discover the benefits of nature. "
        },
        {
            "text": "Practical accessibility is another key focus. We’ve expanded the Centre for Outdoor Accessibility Training (COAT), which offers hands-on training and resources to help make green spaces more accessible for people of all ages and abilities. From inclusive design principles to all-terrain mobility support, COAT is helping to remove real-world barriers and ensure that everyone can enjoy the benefits of nature. "
        },
        {
            "text": "Of course, there’s still much more work to be done. But the People and Nature Survey continues to be a vital tool for identifying where we need to focus next, and for evaluating our efforts to tackle barriers to access. "
        },
        {
            "heading": 4,
            "text": "Water Quality "
        },
        {
            "text": "For the first time, water pollution has overtaken climate change as the top environmental concern among our survey respondents. Clean rivers, lakes, and seas are vital for wildlife and for our own enjoyment of the outdoors. This shift reflects growing public awareness of water quality issues, which have been widely reported in the media. "
        },
        {
            "text": "The recent Independent Water Commission report by Sir Jon Cunliffe outlines key recommendations for reforming the sector to better serve the public. As these changes unfold, we’ll be watching closely to see how public sentiment evolves. "
        },
        {
            "heading": 4,
            "text": "What’s Next for PaNS? "
        },
        {
            "text": "Since April 2020, the People and Nature Survey has gathered insights from over 124,000 adults across England, alongside a separate survey for children to better understand their unique perspectives on nature. The survey collects vital evidence on how people engage with nature, tracking access, barriers, understanding, enjoyment, and how it contributes to wellbeing. "
        },
        {
            "text": "As we move into our sixth year, we’re committed to deepening our understanding and supporting everyone - policy makers, community groups, and individuals - to use the data to make positive change and connect more people with nature. "
        },
        {
            "heading": 4,
            "text": "Curious for More?"
        },
        {
            "text": "The People and Nature Survey data is available for everyone to explore and use. You can dive into the full annual report for detailed stats and trends. To make it even easier to work with the data, we’ve created the People and Nature Surveys Data Explorer, a user-friendly tool that enables anyone to carry out their own analysis of the survey data. If you prefer a quick overview, check out our infographic, which highlights key insights from the latest report. "
        },
        {
            "text": "If you have any questions about the survey or need guidance on how to use the data, please email our team at people_and_nature@naturalengland.org.uk we are always happy to help. "
        },
        {
            "text": "How do you connect with nature? What would help you get outdoors more often? We’d love to hear your thoughts - share your experiences in the comments below! "
        },
        {
            "text": " "
        }
    ]
}