{
    "url": "https://digitaltrade.blog.gov.uk/2025/09/30/data-strategy-in-practice-introduction-and-strategic-ambitions/",
    "title": "Data Strategy in practice - Introduction and strategic ambitions",
    "authors": [
        "Sian Thomas, Chief Data Officer",
        "Graham Bird, Lead Product Manager, Data and AI Services",
        "Jayne Spencer, Service Owner, Data Services Portfolio"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2025-09-30T11:23:53+01:00",
    "content": [
        {
            "text": "This blog series reflects on findings from a research project run by DBT in May 2025. It involved 15 organisations across the civil service, private sector, and charity sector. The project set out to explore the ambitions and challenges of developing a data strategy in a large organisations. It used a mix of workshops, surveys and desk research."
        },
        {
            "text": "Each blog will explore a specific theme that emerged from the project. The first topic is 'Strategic ambitions' - what organisations hope to achieve through their data strategies, and how these ambitions shape their approach. "
        },
        {
            "heading": 2,
            "text": "Introduction from Sian Thomas, DBT Chief Data Officer"
        },
        {
            "text": "Understanding data platforms is quite challenging. DBT created our original platform and catalogue to manage the UK's exit from the EU. This means that, in the context of such things, it is old. However, it is familiar and used by 2,000 DBT staff every month."
        },
        {
            "text": "I am not sure there is ever a ‘right time’ to start a project like this. However, hopefully you will agree as we take you through the findings, it was certainly worthwhile. The insights we gained are invaluable and we are excited to share what we learned with you over the coming months."
        },
        {
            "text": "I would like to extend my heartfelt thanks to all the organisations who shared their knowledge and experiences with us, and to all the individuals who engaged with us throughout this journey. Their contributions have been instrumental in making this project a success."
        },
        {
            "heading": 2,
            "text": "Strategic ambitions"
        },
        {
            "text": "One of our goals was to understand how DBT's ambition compares both to our peers and recognised leaders and innovators in data and AI. We wanted to explore their long-term vision and the importance of data to their digital transformation to help us reflect on our own aspirations."
        },
        {
            "text": "We discovered that, as a Data and AI Services Portfolio in a UK government Department, we are not alone in our ambition to:"
        },
        {
            "text": "We saw common goals among the organisations we spoke to, both in government and the private sector including:"
        },
        {
            "text": "QUOTE: “Can we use what we already know – income, self-assessment – to auto populate and support customers?\"  HMRC participant "
        },
        {
            "text": "It was reassuring to note how familiar these challenges are for us at DBT. It also taught us:"
        },
        {
            "text": "Overall, it was clear that the commitment to becoming more data-driven, digitally mature organisations is a common goal regardless of sector. It strikes the balance between getting the basics right and embracing innovation. DBT’s ambitions are firmly in sync with that. This shared strategic direction laid the foundation for the deeper themes explored throughout the project. "
        },
        {
            "text": "Keep an eye out for upcoming blogs in this series where we will delve into further themes that emerged, including data infrastructure, governance and processing."
        }
    ]
}