{
    "url": "https://marinedevelopments.blog.gov.uk/2025/09/30/fisheries-activity-mapping-reports-and-data-published/",
    "title": "Fisheries activity mapping: Reports and data published",
    "authors": [
        "Carl Jönsson, Senior Marine Planner (Project Manager)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-09-30T15:10:24+01:00",
    "content": [
        {
            "text": "In summer 2023 we engaged with the fishing industry on fisheries mapping carried out by the MMO Marine Planning Team. "
        },
        {
            "text": "We’ve now incorporated stakeholder feedback through an update to the fisheries mapping work."
        },
        {
            "text": "Amongst some of the key points you raised, we’ve addressed the following:"
        },
        {
            "text": "You Said"
        },
        {
            "text": "We did"
        },
        {
            "text": "In addition to actioning these valuable pieces of feedback, this new phase of fisheries mapping:"
        },
        {
            "text": "Figure 1. Spatial distribution of fishing activity for the UK over 12-metre fleet 2016-2023, visualised using the cumulative proportion of landing value across 2 target pelagic fish species: herring (left) and mackerel (right)."
        },
        {
            "text": "Figure 2. Map showing the number of ports operating around the UK based on fishing activity for the UK over 12-metre fleet 2016-2023."
        },
        {
            "text": "Note that the UK under 12-metre fleet has not been analysed further in this phase, as currently available data is not at a resolution that would provide additional information beyond what was analysed in 2022."
        },
        {
            "text": "The technical report, alongside a non-technical summary can be accessed via the Marine Management Organisation’s evidence register."
        },
        {
            "text": "All the layers produced during this phase of work will be made available on our online marine planning service, Explore Marine Plans."
        },
        {
            "text": "We are now seeking your feedback on the work carried out in this phase.We have an open call for views through our online form, or you can contact us on the details below to discuss further.The form can be accessed via: https://forms.office.com/e/TRA0nkjXL5"
        },
        {
            "text": "We thank you for any time taken to attend the sessions or fill out our survey.We’d be happy to continue discussions with any interested stakeholders. Please get in touch via planning@marinemanagement.org.uk."
        }
    ]
}