{
    "url": "https://defradigital.blog.gov.uk/2025/09/30/how-defra-is-leading-the-way-in-sustainable-technology/",
    "title": "How Defra is leading the way in sustainable technology",
    "authors": [
        "Edd Parry"
    ],
    "categories": [
        "End user services",
        "Service experience"
    ],
    "pub_date": "2025-09-30T09:40:51+01:00",
    "content": [
        {
            "text": "Edd Parry, Director of Group Infrastructure and Operations in Defra Digital Data Technology and Security, reflects on our journey to reimagine how we procure IT services, focusing on sustainability and improving the end user experience."
        },
        {
            "text": "In March this year, we announced that our IT Service Desk, and the rest of our end user IT services would be moving to a single supplier, Atos. These include elements of support, such as Tech Bars in our offices, and our Virtual Tech Bars, as well as the provision of laptops, phones and Assistive Technology."
        },
        {
            "text": "What’s so interesting about that, you might be thinking? It’s just a routine procurement exercise; we do these things all the time, right? Those are fair challenges, I admit!"
        },
        {
            "text": "Over the summer we moved to the new contract. Our 4 primary objectives to elevate those services are to:"
        },
        {
            "heading": 2,
            "text": "Why we are doing this"
        },
        {
            "text": "Defra’s existing contracts for these services were coming to an end this year. We managed these through separate contracts; however, our ambition was to combine those into one contract with a single supplier, creating a smoother service and improving the digital and service experience for our users."
        },
        {
            "text": "We are applying commercial strategies to set new standards in sustainable contracting. This includes supporting circular economy benefits and extending the life of hardware devices through refurbishment while remaining focused on performance and a great user experience."
        },
        {
            "text": "We’ve placed huge emphasis on not just understanding the practical experience of using end user IT services, but the ability to proactively drive improvements. Users will see fewer hand-offs between teams when they need support, a greater focus on their perception of the experience, and we’re introducing commercially incentivised experience level agreements to drive continual improvement."
        },
        {
            "heading": 2,
            "text": "Putting sustainability at the centre of everything we do"
        },
        {
            "text": "Arguably, the biggest and most exciting change we are introducing is how we manage devices in a more sustainable way. We are transitioning to a model where device refreshes are based solely on performance degradation."
        },
        {
            "text": "Refreshing a device based on its performance will ensure that the laptop is always up to speed and high performing. It will also help us achieve our sustainability targets and demonstrate that across government, we take our responsibilities for reducing carbon emissions and e-waste seriously."
        },
        {
            "text": "Something that we are very proud of is Atos’s partnership with Circular Computing, who will be refurbishing laptops when they are at end of life, instead of throwing them away. This allows us to establish a ‘refurbished by default’ approach to device refresh."
        },
        {
            "text": "Devices will look, and most importantly perform, as good as new. We want our people to be proud of the device they use every day. Proud because it performs well, because it’s well looked-after, and looks good, and because by using it, they are doing their bit for the planet."
        },
        {
            "text": "Our laptop refurbishment programme with Circular Computing has made us the first UK government department to implement these practices, setting the standard for others. To put this into perspective - across the EU, 160,000 laptops are thrown away every day. While 80% could be recycled, only 20% are. Each refurbished laptop we use saves approximately 316 kg of carbon reduction, compared to manufacturing a new one. We're proud to be leading positive change in this area."
        },
        {
            "heading": 2,
            "text": "And there’s more..."
        },
        {
            "text": "Another feature of our new contract will be the integration of our Service Desk into Microsoft Teams to make it easier to speak to agents and resolve issues.  There will be increased use and capability of Smart Lockers, reducing our carbon footprint, and we will introduce even more Tech Bars."
        },
        {
            "text": "Over time, we also plan to introduce more flexibility in the devices and services we provide. We want to ensure colleagues have the right tool for their job role and reduce the need to carry multiple devices. This will reduce costs, reduce security risks and provide them with the technology they need."
        },
        {
            "heading": 2,
            "text": "Going beyond end user IT services"
        },
        {
            "text": "Our ambition doesn’t stop there. This imaginative approach to procurement of IT services goes beyond what I’ve already mentioned."
        },
        {
            "text": "In recent months we’ve successfully migrated all colleagues with a mobile device to digital SIM cards (eSIMs). This is an innovative approach which has already reduced plastic waste, while delivering a better service with improved connections."
        },
        {
            "text": "Our Application Maintenance and Support contract with Accenture, which also began this year, will enable Defra to migrate and enhance over 300 legacy applications, further reducing costs and increasing efficiency. "
        },
        {
            "text": "We’re also in the process of replacing our current managed print service. We want to reduce the amount of printing done in Defra through our digital service transformation initiative, but where printing is unavoidable, we are adopting a cross government standard called GovPrint. This will enable Defra group staff to print from any government department building that has transitioned to the GovPrint solution."
        },
        {
            "text": "And we’re improving our network provision too, with the re-procurement of our network connectivity contract, transitioning from the current, inflexible fixed network to a more efficient optimised network environment which supports the government strategy of ‘Cloud First’ and ‘Wi-Fi by default’."
        },
        {
            "text": "So, there is a lot to be proud about and excited for as we work to achieve our ambition to reimagine the way we think about and deliver IT services to our Defra colleagues as sustainably and cost-effectively as we can."
        }
    ]
}