{
    "url": "https://space.blog.gov.uk/2025/09/30/hydrognss-mission-lands-in-california/",
    "title": "HydroGNSS mission lands in California",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Earth observation"
    ],
    "pub_date": "2025-09-30T10:39:22+01:00",
    "content": [
        {
            "text": "The UK-built HydroGNSS mission, which will investigate the Earth’s water cycle, has landed in California and is ready to start preparations for launch.  "
        },
        {
            "text": "Built by Surrey Satellite Technology Ltd (SSTL), in Guildford, HydroGNSS-1 and HydroGNSS-2 are part of the European Space Agency’s Scout programme – delivering rapid, low-cost Earth observation missions.  "
        },
        {
            "text": "Once in orbit, the pair will track climate variables like soil moisture and flooding, using signals from existing GNSS satellites in innovative new ways.  "
        },
        {
            "text": "The UK Space Agency provided €30 million of funding for the mission, through ESA's FutureEO programme. "
        },
        {
            "text": "Beth Greenaway, Joint Head of Earth Observation and Climate at the UK Space Agency, said:"
        },
        {
            "text": "Changes in the global water cycle pose a threat to our environment and to communities around the world. ESA’s HydroGNSS delivers observations on four essential hydrological climate variables:"
        },
        {
            "text": "1. soil moisture,  "
        },
        {
            "text": "2. inundation or wetlands,  "
        },
        {
            "text": "3. freeze/thaw state, and  "
        },
        {
            "text": "4. above-ground biomass."
        },
        {
            "text": "Essential climate variables are identified by the global climate observing system (GCOS) and are used in many applications and areas of science: from weather forecasting and flood prediction, to understanding wetlands, as well as data on permafrost and forest carbon stocks. HydroGNSS will also measure wind speed over the ocean and sea-ice extent as secondary products. "
        },
        {
            "text": "Pete Garner, Senior Project Manager, SSTL, said:"
        },
        {
            "text": "By providing valuable data on the Earth’s water cycle, HydroGNSS will ensure there are no data gaps when missions such as ESA’s SMOS and NASA’s SMAP come to an end. "
        },
        {
            "text": "The mission will provide measurements on these water-related indicators using a technique called Global Navigation Satellite System (GNSS) reflectometry.  "
        },
        {
            "text": "This technique involves the signals from systems such as Galileo and GPS, which are part of the GNSS. These navigation satellites work by continually transmitting low-power L-band microwave navigation signals towards Earth. Their primary purpose is to provide global positioning, navigation, and timing services, such as the navigation systems in cars and mobile devices. "
        },
        {
            "text": "However, when the GNSS signal reflects off Earth’s surface, it is altered by the soil’s physical properties. The HydroGNSS mission obtains scientific data on the Earth’s water cycle by comparing this altered signal with the direct signals from the GNSS satellites. "
        },
        {
            "text": "The mission consists of two microsatellites, both of which carry a GNSS reflectometry instrument in an orbit of 500-600 km, 180 degrees apart. "
        },
        {
            "text": "HydroGNSS is the first of three Scout missions, which pave the way to innovative science in a quick and adaptable way, complementing ESA’s Earth Explorer research missions. "
        },
        {
            "text": "Launch is expected later this year on a Falcon 9 rocket. "
        }
    ]
}