{
    "url": "https://nda.blog.gov.uk/the-nda-group-graduate-programme-more-than-a-job/",
    "title": "The NDA Group Graduate Programme: more than a job",
    "authors": [
        "Nuala Ledward"
    ],
    "categories": [
        "Early careers"
    ],
    "pub_date": "2025-09-30T13:53:10+01:00",
    "content": [
        {
            "text": "The NDA group graduate scheme offers far more than just a stepping stone into the nuclear industry; it’s a chance to grow professionally, explore new places, and become part of a supportive community. "
        },
        {
            "text": "Nuala Ledward, Assurance and Performance Graduate, shares how her secondment to Dounreay brought these benefits to life."
        },
        {
            "text": "As an NDA group graduate I completed a three-week secondment at Dounreay, a former nuclear site in Caithness, over the summer; an opportunity that exemplifies what makes the NDA graduate experience so unique. My time at Dounreay was both professionally enriching and personally memorable."
        },
        {
            "text": "I have been based in the Assurance and Performance directorate of the Nuclear Decommissioning Authority (NDA) for a year, providing independent oversight of operational performance across the NDA group, which comprises of Sellafield, Nuclear Restoration Services (NRS), Nuclear Waste Services (NWS) and Nuclear Transport Solutions (NTS). I help to monitor and assess performance across areas such as health and safety, project delivery, and asset management and continuous improvement."
        },
        {
            "text": "One of the greatest strengths of the NDA group graduate programme is the chance to work at different sites, gaining hands-on experience and a real understanding of the breadth of work happening across the organisation. At Dounreay, which was the UK’s centre of pioneering fast reactor research, I was able to see first-hand the innovative projects underway and contribute meaningfully to the team’s objectives. For example, I supported the development of a centralised digital platform for data management which is helping to reduce duplication, improve data accessibility, and enable more informed decision-making across departments."
        },
        {
            "text": "What stood out most during my secondment was the supportive and inclusive culture that defines the NDA group. From the moment I arrived, I felt welcomed and valued. The graduate network is a real asset, providing a built-in community of peers and mentors who are always willing to offer advice, answer questions, and share their own experiences. This sense of camaraderie was very much evident at Dounreay and it made a real difference to my confidence and development."
        },
        {
            "text": "The NDA group graduate scheme also encourages us to make the most of our time outside of work, recognising that a healthy work-life balance is key to personal and professional growth. During my placement, I took the opportunity to explore the Caithness region, discovering its stunning landscapes and vibrant local community. Whether it was walking the Holburnhead Circular route, visiting Dunnet Forest, or enjoying local food spots like Annie’s Bakery and the Captain's Galley, these experiences helped me feel connected not just to my workplace, but to the wider community that supports it."
        },
        {
            "text": "Being on site most days gave me a strong foundation for learning. While flexible working is a valuable part of modern life, there’s something uniquely beneficial about face-to-face collaboration, especially for graduates at the start of their careers. Working alongside colleagues allowed me to build genuine relationships, learn through observation, and take part in spontaneous conversations that simply don’t happen online. These moments of informal learning and connection are a key part of what makes the NDA group graduate scheme so special."
        },
        {
            "text": "Importantly, the scheme is structured to help graduates develop both professionally and personally. The support from colleagues, the variety of placements, and the encouragement to get involved in local life all contribute to a well-rounded experience. I found that immersing myself in both the workplace and the community made my secondment more memorable and fulfilling."
        },
        {
            "text": "For anyone considering the NDA group graduate scheme, or for colleagues welcoming new graduates to their teams, I’d emphasise the value of this supportive environment. The scheme is more than just a job; it’s a chance to build a network, develop new skills, and become part of a community that is committed to making a difference. For my next placement, I will be moving further into NRS where I will be joining the Project Controls Engineers team within the Programme Management Office. I cannot wait to continue my scheme within NRS and my experience with them at Dounreay really showed me how the NDA group invests in its graduates, helping us to grow, succeed, and feel at home wherever we are placed."
        },
        {
            "text": "Applications are currently being welcomed for the 2026 NDA group graduate programme. Find out more at ndagroup.careers/early-careers."
        }
    ]
}