{
    "url": "https://moderncivilservice.blog.gov.uk/2025/09/30/welcome-to-the-operational-delivery-profession-delivering-excellence-every-day/",
    "title": "Welcome to the Operational Delivery Profession: Delivering excellence every day",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2025-09-30T13:49:48+01:00",
    "content": [
        {
            "text": "A guest blog from Sir Peter Schofield, Head of the Government Operational Delivery Profession."
        },
        {
            "text": "When you think of the Civil Service, you might picture people in Whitehall working directly with ministers. But the reality is more than half of us, 300,000 civil servants, work on the front line in operational and delivery roles."
        },
        {
            "text": "These roles vary hugely, from processing passport applications and helping people find work as a jobcentre coach, to working as tax officers, court officials, and in consular roles. But what we all have in common is that we are the point where citizens interact with the government. People’s day to day experience of the Civil Service comes from their interaction with operational delivery teams."
        },
        {
            "text": "Our roles cover the whole of government. Some of us work in dedicated operational delivery teams, while others bring our operational expertise to policy, digital, commercial, and strategy functions. This variety creates great opportunities for career development."
        },
        {
            "text": "For all of us in these roles, there is a profession to help you succeed in the important work you do, and to support you in reaching your full potential. I have the privilege of leading the Operational Delivery Profession (ODP), alongside Angela MacDonald at HM Revenue & Customs and other leaders from operational delivery teams across every government department."
        },
        {
            "heading": 2,
            "text": "What does ODP offer?"
        },
        {
            "text": "The Professional Skills Framework (PSF) gives you a clear path for your career development. Our LISTR  platform helps you connect with mentors, coaches, and networking opportunities across government. These connections can broaden your understanding of career possibilities and help you identify opportunities beyond your current department."
        },
        {
            "text": "For those seeking formal recognition of their expertise, we offer a range of learning and development programmes. Our annual ODP Fest brings together professionals from across government to share good practice and celebrate achievements in operational delivery."
        },
        {
            "text": "Senior leaders can also join our Senior Community of Practice, where we tackle the complex challenges of designing and delivering large-scale government services. This community recognises that effective leadership in operational delivery needs both strategic thinking and practical expertise."
        },
        {
            "heading": 3,
            "text": "The impact of your work"
        },
        {
            "text": "What distinguishes our profession is the direct impact we have on citizens' lives. When someone receives their pension payment, gets a new passport, or accesses support services, they are benefitting from your professional expertise and commitment to meeting their needs."
        },
        {
            "text": "These interactions are more than just processes—they are often significant moments in people's lives. Your knowledge, attention to detail, and commitment to getting things right directly contribute to public trust in government services and help improve outcomes for individuals."
        },
        {
            "heading": 3,
            "text": "Engaging with your profession"
        },
        {
            "text": "As an ODP member, you have access to a professional community that understands the realities of operational delivery in government. Whether operational delivery is your primary focus or part of a broader role, connecting with this community offers opportunities to enhance your skills, expand your knowledge, and contribute to improving government services."
        },
        {
            "text": "Your experience and insights contribute to our collective understanding of how to deliver better outcomes for citizens. By engaging with the profession, you can share your expertise, learn from colleagues, and help shape the future of operational delivery across government."
        },
        {
            "text": "Welcome to ODP – where your expertise plays a vital role in delivering the government services that matter most to people across the UK."
        }
    ]
}