{
    "url": "https://ipo.blog.gov.uk/2025/09/30/whats-changing-applying-for-patents/",
    "title": "What’s changing - applying for patents",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Digital",
        "IPO",
        "Patents",
        "Transformation"
    ],
    "pub_date": "2025-09-30T14:15:00+01:00",
    "content": [
        {
            "text": "The Intellectual Property Office (IPO) is transforming how you apply for patents with the launch of our new One IPO digital services, expected in early 2026. This digital transformation will improve how you apply for, manage and monitor patents, modernising UK intellectual property services. "
        },
        {
            "text": "We're publishing a series of blogs to guide you through the changes and ensure you have everything you need for a smooth transition to our new service.  "
        },
        {
            "text": "Without a doubt, the part of the service we’ve received most interest in is applying for patents. It’s the most crucial part of the process, and getting it right is the difference between having meaningful legal protection or none at all. "
        },
        {
            "text": "There are big changes coming to the patent application process, which are detailed below. "
        },
        {
            "heading": 3,
            "text": "The improvements "
        },
        {
            "text": "There are several improvements to the existing service for patent applications. These improvements include being able to:"
        },
        {
            "heading": 3,
            "text": "What you can apply for "
        },
        {
            "text": "To apply for a patent, you’ll have to be logged in to your IPO account. In the service you can apply for: "
        },
        {
            "text": "You cannot make a Patent Cooperation Treaty (PCT) patent via the One IPO service. In future, you will do this via the World Intellectual Property Office’s ePCT service. "
        },
        {
            "heading": 3,
            "text": "Application structure "
        },
        {
            "text": "Our existing patent application service is linear – you start at question 1 and answer the questions in a set order. In the new service, the questions are broken into sections that you can complete in any order you wish. "
        },
        {
            "text": "Some information will be required to be completed before you can review your application, pay and submit, whereas other information can be submitted later or is optional. The application screen will have clear sections showing what is and isn’t required. "
        },
        {
            "heading": 3,
            "text": "Document formats "
        },
        {
            "text": "One of the biggest changes is the formats that you submit in the new service. Previously, patent specifications (that's the details of your patents) were typically submitted in a PDF format. In the new service, the different parts of the applications will need to be submitted separately and in the following formats: "
        },
        {
            "text": "The reason for this is to speed up the processing of your application. Having your documents in machine-readable formats allows us to automate processes that were previously manual, so we can offer you a better service. "
        },
        {
            "heading": 3,
            "text": "Draft applications "
        },
        {
            "text": "The single most requested feature has been draft applications. There is a dedicated ‘drafts’ section in your account where you can view draft applications, created by either yourself or a colleague. There is also an option to copy a link to your application as you’re working on it and share this with a colleague. "
        },
        {
            "text": "There is no ‘workflow’ built into the service. This means that you don’t hand control of the application back and forth between different people. Everyone has access to create, edit and submit an application. We are looking at ways to make it as clear as possible when an application will be submitted so it can’t be done in error. "
        },
        {
            "heading": 3,
            "text": "Filing receipts "
        },
        {
            "text": "A key part of the application process is receiving your filing receipt, which provides information about your application. Typically, you received this straight after filing in the legacy service, but it works a bit differently in the new service."
        },
        {
            "text": "In the new service, when you first apply you’ll immediately get an email confirming the most vital information – your filing date, application number and reference (if provided). You will then receive a further email with your full filing receipt once your application has completed a national security check. This will typically take no more than two working days. "
        }
    ]
}