{
    "url": "https://naturalengland.blog.gov.uk/2022/10/03/beavers-are-now-legally-protected-in-england-the-licensing-regime-explained/",
    "title": "Beavers are now legally protected in England – the licensing regime explained",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Biodiversity",
        "Licensing",
        "Natural England",
        "Protected sites and species",
        "Species re-introductions"
    ],
    "pub_date": "2022-10-03T08:21:55+01:00",
    "content": [
        {
            "text": "By Stephanie Bird-Halton - Director of National Delivery"
        },
        {
            "text": "Protection of beavers and why it’s important"
        },
        {
            "text": "On 1 October 2022 the legislation changed to protect wild-living beavers in England. Beavers are now listed in Schedule 2 of the Conservation of Habitats and Species Regulations 2017, making it an offence to deliberately capture, injure, kill or disturb beavers, or damage and destroy their breeding sites or resting places without a wildlife management licence from Natural England. This follows Scotland’s decision to make beavers a protected species in 2019."
        },
        {
            "text": "The populations of wild-living beavers in England are currently small and fragmented, occurring in six discrete areas of southern England. Legal protection will safeguard beaver populations from persecution and ensure management action does not threaten the recovery of this native species. "
        },
        {
            "text": "Managing beavers without a licence"
        },
        {
            "text": "Beavers are one of nature’s great engineers, helping to transform our landscapes and improve our degraded waterways. However, while beavers can be hugely beneficial, their activities can cause conflicts in certain locations."
        },
        {
            "text": "Most negative impacts from beavers occur within 20 metres of the water’s edge and techniques can be employed to help prevent or reduce these impacts. Such measures include making space for beavers through the creation of naturally vegetated buffer zones and the use of low-impact management actions that do not require a licence."
        },
        {
            "text": "One such non-licensable action is the removal of dams less than 2 weeks old. Beavers build dams to retain water and create an aquatic refuge, including raising water levels to submerge burrow and lodge entrances providing them with a secure place to rest and breed. Newly built dams are not treated as protected under the legislation as their removal is unlikely to impact on beaver burrows or lodges."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Beaver management – when a licence is required"
        },
        {
            "text": "Certain management activities can only be undertaken under a licence from Natural England. In preparation for beavers receiving legal protection, Natural England has engaged with stakeholders in developing three ‘class licences’ that can be used for beaver management."
        },
        {
            "text": "A class licence requires a one-off registration and allows a group or class of users to undertake common management activities in a standardised way. The class licences aim to make it easier for people to learn to live with beavers by allowing them to respond to problems swiftly."
        },
        {
            "text": "The lowest-impact class licence allows users to modify or remove a beaver dam (that is more than two weeks old) outside of the breeding season as soon as a problem occurs. It is mainly intended to be used by farmers, fisheries interests and other land and water managers to prevent serious damage for example to crops, growing timber and other property. In emergency situations the Natural England enquiry line can be contacted and a temporary licence issued over the phone if justified."
        },
        {
            "text": "For moderate- and higher-impact activities, such as removing a dam during the breeding season, or the removal of a beaver burrow or lodge, additional training and checks are required."
        },
        {
            "text": "Individuals wanting to use a class licence must demonstrate they have either been trained or have experience in undertaking the relevant management activities. Natural England has been running training courses throughout September to provide land, water and infrastructure managers with the knowledge and skills required to manage beaver activity and to support people already living with beavers."
        },
        {
            "text": "Individuals can decide to register in person for a class licence or secure the advice and services of a registered person. More training courses will be organised to ensure there is sufficient capacity of registered users across the country."
        },
        {
            "text": "Beaver management - a step-wise approach"
        },
        {
            "text": "Natural England believes people will learn to live alongside beavers and, in time, accept them as a normal and valued part of English wildlife. More often than not, no management will be required. However, if it is, it should proceed step-wise, starting with education and awareness raising and  making space for beavers and, if issues cannot be resolved, progressing to less impactful management actions, such as protecting trees, managing dams or, in some exceptional circumstances relocating beavers."
        },
        {
            "text": "Lethal control – a last resort"
        },
        {
            "text": "Lethal control is not permitted under the beaver management class licences.  An ‘individual licence’ for lethal control would only be issued by Natural England as a last resort in the most extreme cases of damage, where all other management actions have failed or proven to be impractical. Due to safety and animal welfare risks, lethal control licences will be subject to strict conditions, and only issued to specifically trained and competent individuals."
        },
        {
            "text": "In the short to medium term, while the English beaver population is small and vulnerable and other management options are available, it is not anticipated that lethal control will be necessary or appropriate to manage conflicts. It is also important to recognise that removal of a territorial animal, such as a beaver, is only a temporary solution as recolonisation by another beaver is very likely to occur."
        },
        {
            "text": " "
        },
        {
            "text": "Next steps:"
        },
        {
            "text": "Earlier in the year, Natural England shared its proposed management approach and licensing regime with a range of partners, including from the farming, fisheries, infrastructure and conservation sectors. Now that guidance has been published, engagement will continue to ensure that, as beaver populations continue to spread, there are opportunities to discuss and review beaver management in England."
        },
        {
            "text": "Natural England will also monitor the implementation of the beaver management approach and licensing regime and will adapt it where experience and evidence shows this to be necessary."
        },
        {
            "text": " "
        },
        {
            "text": "Further guidance:"
        },
        {
            "text": "For more information regarding beaver management, and the associated licensing regime, see the following policy paper and guidance which have been published:"
        },
        {
            "text": " "
        },
        {
            "text": "If you have any questions, then please get in touch with Natural England at beavers@naturalengland.org.uk"
        }
    ]
}