{
    "url": "https://ipa.blog.gov.uk/2022/10/03/being-east-south-east-asian-in-government-project-delivery-its-important-for-project-teams-to-be-as-diverse-as-possible/",
    "title": "Being East & South East Asian in government project delivery: “It's important for project teams to be as diverse as possible”",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Project Delivery Profession"
    ],
    "pub_date": "2022-10-03T11:26:24+01:00",
    "content": [
        {
            "text": "This blog is part of the Infrastructure and Project Authority’s Role Models Campaign, which aims to increase diversity at all grades in the Project Delivery Profession."
        },
        {
            "text": "Eileen Wong is a Senior Business Change Manager at HMRC and has spent over 19 years in the Civil Service, the majority of which has been in tax compliance roles but decided a change of career and profession was needed. She is also a co-chair of the Civil Service Race Forum’s East & South East Asian Working Group (CSRF ESEA WG). This group was set up in 2021 due to the rise of anti-Asian hate following Covid and aims to create safe spaces for colleagues to talk about these issues as well as forge a community of ESEA civil servants and allies in government."
        },
        {
            "text": "Asian influence on my civil service career"
        },
        {
            "text": "I joined the Civil Service as an Administrative Assistant to start paying off my student debts. Staying long-term in the Civil Service was never part of my plan at the time. My parents wanted me to be a doctor, a lawyer or an accountant. They saw these as the only professions worth considering, maybe because these are often well-paid careers which meant that in one generation, I could lift us out of the low socio-economic bracket we lived within or that it brought them “face”, which is a big concept in Asian culture. "
        },
        {
            "text": "I always gave 100% to everything I did and steadily gained promotions in HMRC as a result. It wasn’t a career my parents were particularly proud of me having and going against their expectations was a pressure I dealt with mentally as filial piety had been rooted in my upbringing. My argument was that I was still doing something in finance albeit tax investigations!"
        },
        {
            "text": "I spent 17 years in tax compliance in a range of roles but always loved a project I could see through from beginning to end. Maybe it was turning 40 or that I had some time to be reflective during the first Covid lockdown, but I reflected. I wanted a career I enjoyed and was proud of so I seized the opportunity for a new challenge and to apply for a role that was out of my comfort zone but married my love of project delivery and Equality Diversity & Inclusion. "
        },
        {
            "text": "I’ve had great opportunities working short-term on some HR projects and am now part of the project delivery profession, proudly as a Change Manager for HMRC’s Race Delivery Programme to ensure inclusive policies, practices and processes are implemented. This is such an important role to make sure all colleagues are given the opportunity to reach their full potential in HMRC. "
        },
        {
            "text": "Diverse Representation in the Project Delivery Profession"
        },
        {
            "text": "Projects will impact internal and external customers from different ethnic minorities so it's important for project teams to be as diverse as possible to avoid groupthink. I enjoy challenging the status quo but also enjoy learning from others to challenge my own thought processes. My team is diverse, and we all pull in the right direction to ensure we are making the right decisions for the project. "
        },
        {
            "text": "I’m hoping that this article will encourage people from the ESEA community to consider a career in the project delivery profession and bring their authentic selves to work."
        },
        {
            "text": "Celebrating ESEA Heritage Month in the Civil Service"
        },
        {
            "text": "Being co-chair and member of CSRF ESEA WG has enabled me to find a place where I belong amongst like-minded colleagues who all share a passion for creating a Modern Civil Service."
        },
        {
            "text": "September was ESEA Heritage Month, and it is now in its second year in the UK. It comes after years of seeing an increase in anti-Asian violence, hate and racism around the world. It has been more important to build solidarity and recognise the significant and positive impact the ESEA community has and continues to have in the Civil Service and the UK more broadly.  "
        },
        {
            "text": "This year is the first time we celebrated ESEA Heritage Month across the civil service with a number of events and blogs like this to explore the theme of identity with the aim to educate the Civil Service on ESEA identities and challenges, empower ESEA civil servants to bring their whole selves to work and to inspire the next generation of ESEA civil servants. "
        },
        {
            "text": "I’m grateful to have had mentors and coaches to guide and support me throughout my Civil Service career and I would like to ask you to consider how you will educate, empower and inspire others to be skilled, innovative and ambitious civil servants."
        }
    ]
}