{
    "url": "https://ace.blog.gov.uk/2022/10/03/helping-tackle-violence-against-women-and-girls/",
    "title": "Helping tackle violence against women and girls",
    "authors": [
        "Emma Firth"
    ],
    "categories": [
        "Data",
        "Law enforcement"
    ],
    "pub_date": "2022-10-03T10:16:46+01:00",
    "content": [
        {
            "text": "Tackling violence against women and girls and addressing the urgent need to improve criminal justice outcomes in cases of Rape and Serious Sexual Offences (RASSO) are two Home Office and law enforcement priorities. The Accelerated Capability Environment (ACE) has been working to support both on multiple fronts. "
        },
        {
            "text": "Following the publication of the Government’s End-to-End Rape Review, commitments made to improve the criminal justice system include: "
        },
        {
            "text": "Our work to help the Government meet these pledges has focused on how industry, academia and the third sector can contribute through applying advanced digital and data technologies as well as through policymaking. "
        },
        {
            "text": "Towards a safer world for women "
        },
        {
            "text": "This work began in earnest in August 2021, when we convened a roundtable event that brought industry and academic experts from our Vivace community together with senior government stakeholders, policymakers, and representatives from charities and the third sector. "
        },
        {
            "text": "There was a session introducing participants to the End-to-End Rape Review, which focused on the need for collaboration between industry and the criminal justice system. "
        },
        {
            "text": "Then in December 2021, we supported the Home Office in delivering a presentation designed to explore the technical challenges of investigating cases of rape and serious sexual offences.  "
        },
        {
            "text": "Bringing RASSO to Impact Lab "
        },
        {
            "text": "To maintain and build on the momentum created through these two events, we decided to bring RASSO challenges to our Impact Lab series. This is an event-driven platform for rapidly engaging industry and academia around complex law enforcement challenges. "
        },
        {
            "text": "RASSO formed the third Impact Lab – and the largest to date – bringing together 49 businesses and 76 senior stakeholders from government and law enforcement for the initial briefing in March 2022.  "
        },
        {
            "text": "Avon and Somerset Police and North Wales Police presented two very different rape cases and shared investigative insights and challenges along with some of the operational data for Impact Lab participants to use in developing potential solutions. "
        },
        {
            "text": "Key challenge areas included improving the experience of victims through the investigative process; identifying and extracting evidential information from mobile devices more effectively, enabling more efficient data analysis and improving how data is presented. "
        },
        {
            "text": "The best solutions then went forward for selection at a showcase event with both ACE and Police Digital Service aiming to progress the most promising into paid commission work. "
        },
        {
            "text": " "
        }
    ]
}