{
    "url": "https://ruralpayments.blog.gov.uk/2022/10/03/introducing-you-to-12/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2022-10-03T16:36:53+01:00",
    "content": [
        {
            "text": "Hi, I’m Alice and I’m on a nine week internship with RPA as part of the Fast Stream Summer Diversity Internship Programme (SDIP). The SDIP is targeted at getting university students and graduates from diverse backgrounds into a career in the Civil Service, by providing a ‘foot in the door’ opportunity.  I’m currently just over halfway through, after starting in August."
        },
        {
            "text": "I’ve been working with the Business Excellence Engagement Team in Newcastle. During my time here, I’ve had the chance to complete projects both individually and as part of the team. Most recently an individual project I worked on was the production of a micro-learning video that aims to teach new starters at RPA how to use and complete Civil Service learning. Working alongside the wider team, I’ve supported the planning for focus groups that will gauge our staff’s perspective on delivering Business Excellence performance. In addition, I’ve also been working with the team to support the streamlining of their communications, planning and work organisation and distribution channels."
        },
        {
            "text": "I’ve really enjoyed the opportunity to explore and understand how RPA works. Before I started my internship, I didn’t really understand the work RPA did or how the wider Defra department worked. Through participating and observing in meetings both internal and external with our team, I’ve been able to develop my understanding of RPA and the work that it does. Being given the opportunity to work alongside the Business Excellence Engagement Team has developed my understanding of how the agency works, as I’ve been able to see first-hand the tools that have been developed to support staff in delivering better outcomes for themselves and customers. It’s this wider understanding that I have really enjoyed developing, as it’s provided a sense of understanding to all the work I’ve produced and been involved in."
        },
        {
            "text": "I’ve also enjoyed the variation in the work, as it has meant that no two days are the same. This is because I’m trusted to plan my days in the most appropriate and effective way for my own personal circumstances, as long as I get all my tasks completed."
        },
        {
            "text": "I would say that the aspect of the work I’ve done that I enjoyed most has been the creative aspect. The creativity has come through in several different ways, such as planning how I want to complete a project and designing its final outcome. When I started my internship, I really didn’t expect creativity to be such an integral factor. The team I’ve been working with have also been a factor in why creativity has been so present in the work I’ve completed, as the team really stress the idea of thinking outside the box."
        },
        {
            "text": "I’m particularly proud of the work I did recently producing the micro session on Civil Service learning. This is because I handled the project from the initial planning and research to the production of a final video. This opportunity to work on a project from start to finish resulted in me becoming invested in producing a more positive outcome."
        },
        {
            "text": "I recently graduated from the University of Leeds with a 2:1 in History. After I complete my internship, I will continue to work in the Civil Service when I move to another department in the new year. The internship has also helped provide me with a clear idea of what I want my future career to look like, as I’m sure I want to be based in the public sector."
        },
        {
            "text": "Outside work I really enjoy swimming. I’ve been competing from a young age and I was on the swimming team while at university."
        }
    ]
}