{
    "url": "https://insidedio.blog.gov.uk/2022/10/03/keeping-communities-and-soldiers-safe-in-kenya/",
    "title": "Keeping communities and soldiers safe in Kenya",
    "authors": [
        "Lt Col Paul Longwell"
    ],
    "categories": [
        "British Army",
        "Defence Training Estate (DTE)",
        "Explosive Ordnance Clearance",
        "Kenya",
        "Public safety",
        "Wildlife"
    ],
    "pub_date": "2022-10-03T11:05:23+00:00",
    "content": [
        {
            "text": "Soldiers from 4 RIFLES fire a 105mm artillery gun during an exercise in Kenya [Crown Copyright/MOD 2011]Out in Kenya DIO staff are responsible for the physical safety of the training areas, keeping both the public and the military safe. The team work on a variety of tasks together with the British Army, the Kenyan Defence Forces (KDF) and several local groups to make this happen. "
        },
        {
            "heading": 2,
            "text": "What is Exercise Range Sweep? "
        },
        {
            "text": "Exercise Range Sweep is the British Army Training Unit Kenya’s (BATUK) annual clearance of the training areas in Laikipia county and Archer’s Post Training Area in Samburu. "
        },
        {
            "text": "Sappers from 17 Field Squadron Royal Engineers, part of 35 Engineer Regiment, deployed from Wimbish in Cambridgeshire to conduct the sweep this year. They found and dealt with more than fifty items of Unexploded Ordnance (UXO). "
        },
        {
            "text": "This is really encouraging news for us because we have seen a steady decrease in the number of finds year on year, and what are being cleared now are often legacy munitions, going back decades or more.  "
        },
        {
            "heading": 2,
            "text": "Supporting local communities in Kenya "
        },
        {
            "text": "Archer’s Post has been in use by the British Army – and more recently the KDF – for nearly 80 years, but throughout that time it has also been home to a number of traditional Samburu pastoralist families as well as some of Kenya’s more exotic wildlife, including lions, elephants, giraffes, zebra and many others.  "
        },
        {
            "text": "One of the most important tasks that is carried out during Exercise Range Sweep is outreach to the local communities. By visiting schools and villages and spreading the word about the dangers of UXO the team can reiterate the importance of what to look out for and how to stay safe on the training areas.  "
        },
        {
            "heading": 2,
            "text": "Working together to keep soldiers and local people safe "
        },
        {
            "text": "Range staff carefully record any blind or unexploded rounds during live-firing and normal practice is to clear them as soon as firing stops, but on rare occasions they can’t be found and this is when the search expertise of the Sappers, together with their partners from the KDF, comes to the fore.  "
        },
        {
            "text": "We are all about applying a safe system of training and we need to keep our training areas safe, not just for our soldiers but for other users and the people and animals that live there.  "
        },
        {
            "text": "Exercise Range Sweep is just one of the ways that we do this, and we are grateful for the support we get from the Army and the KDF to help us achieve this.  "
        }
    ]
}