{
    "url": "https://defradigital.blog.gov.uk/2022/10/03/the-value-of-feedback-part-one-why-you-need-to-give-and-get-it/",
    "title": "The value of feedback: Part One - why you need to give and get it",
    "authors": [
        "Leyla Kee-McParlin"
    ],
    "categories": [
        "Defra content design",
        "Defra digital"
    ],
    "pub_date": "2022-10-03T07:30:27+01:00",
    "content": [
        {
            "text": "In the first instalment of a two-part blog Lead Content Designer Leyla Kee-McParlin explains how feedback is essential to self-development, and explores how you can give and receive feedback in the most productive and sensitive ways."
        },
        {
            "text": "Hi, I’m Leyla. I’m a Lead Content Designer at Defra. I lead, direct, and help our amazing community of content designers in anything they need, from resolving problems and developing future projects, to simply listening to things and offering an attentive ear."
        },
        {
            "heading": 2,
            "text": "What is feedback?"
        },
        {
            "text": "I’m obsessed with feedback. I love giving it. I love getting it. I think that’s because it helps you continuously reflect on and challenge things in pursuit of positive outcomes, whether that’s higher quality work or developing yourself."
        },
        {
            "text": "‘Feedback’ in a work environment is basically information given to someone that is used as a basis for their improvement. It’s the foundation of their self-awareness. It can range from the general to the specific, but it should always relate to the person. You should only ever offer feedback to benefit someone, or help them learn something beneficial. It must be factual, constructive, and objective."
        },
        {
            "text": "Eric Ries, the author of ‘The Lean Startup’, calls feedback “the engine of growth” – the core of your personal iteration cycle. Every new piece of feedback is a chance to improve. He tells us to think of feedback like “fine-tuning an engine... a recalibration”, and just like what happens with your car, what you put in it can accelerate things."
        },
        {
            "text": "In this case, feedback speeds up your development. It can help you:"
        },
        {
            "text": "Feedback can be scheduled, such as during one-to-ones, monthly team sessions aligned to goals, or performance reviews. It can also be unscheduled, like during a coffee break. Whether it’s scheduled or unscheduled, one thing is sure: timing is everything."
        },
        {
            "text": "A well-timed piece of feedback can affect huge personal and professional change. On the other hand, a badly timed piece of feedback could seriously derail a person’s development at work and leave a lasting negative effect that stays with them for the rest of their career."
        },
        {
            "heading": 2,
            "text": "Praise and criticism: why you need to give and get both"
        },
        {
            "text": "Feedback is most often associated with criticism due to how and when people use it. In the workplace, people think praise can be rare and forget that this is an important type of feedback. I want to tell you that praise and criticism are like shampoo and conditioner. You need both."
        },
        {
            "text": "Praise reinforces good things, raises self-awareness, and encourages progress. It’s a chance to give someone a piece of honest and sincere appreciation, as well as model some important values. You can make that person feel important."
        },
        {
            "text": "Criticism helps us see what can get better. You’ll learn more from your critics than you will from your fans. Adam Grant, the author of ‘Think Again’, says “strong people engage critics and make themselves stronger. Weak people silence their critics and make themselves weaker.”"
        },
        {
            "heading": 2,
            "text": "Whatever you do, don’t dodge the issue"
        },
        {
            "text": "When people get tough feedback, their default response can be to avoid those critics and drop them from their circles or networks. I want to tell you now – do not do this. There’s lots of evidence that performance suffers when this happens, as well as openness and inclusiveness."
        },
        {
            "text": "If you shy away from giving someone feedback, they may think that you’re withholding your views from them or worse, that you think something really negative about them. You end up putting pressure on yourself to hold it in and resolve the matter in other ways. A workplace environment without feedback discourages positive risk or even worse, creates a community who fears feedback."
        },
        {
            "text": "Organisations handle feedback in many ways. The Pentagon and the White House apparently have so-called ‘murder boards. These are feedback panels designed to stir up conflict and enlist tough committees to challenge plans and people. Google have the ‘X Team’, who rapidly evaluate everything, carry out assessments and rethink proposals."
        },
        {
            "text": "I’m not recommending that you put together your own ‘murder boards’ or ‘X Team’. In fact, gradual progress can be better than bold experimentation. If you want to see some real change, do small things in your team or function, rather than overwhelm yourself with overzealous organisational ambition."
        }
    ]
}