{
    "url": "https://homeofficemedia.blog.gov.uk/2022/10/03/windrush-compensation-scheme-factsheet-september-2022/",
    "title": "Windrush Compensation Scheme factsheet – September 2022",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-10-03T18:30:29+01:00",
    "content": [
        {
            "text": "Windrush Compensation Scheme factsheet – September 2022"
        },
        {
            "text": "We are determined to put right the terrible injustices faced by some people from the Windrush generation and the wider Commonwealth, which happened under successive governments."
        },
        {
            "text": "To help right those wrongs, the Home Office has announced that the Windrush Documentation Scheme will remain open indefinitely."
        },
        {
            "text": "The Scheme allows people who were affected by Windrush to get the documentation they need to prove their right to be in the UK, free of charge."
        },
        {
            "text": "Last year it was announced that the Compensation Scheme would also remain open as long as it’s needed."
        },
        {
            "text": "Windrush Compensation Scheme"
        },
        {
            "text": "The Windrush Compensation Scheme was launched on 3 April 2019."
        },
        {
            "text": "You may be able to claim compensation if you suffered losses because you could not show that you had a right to live in the UK."
        },
        {
            "text": "On 29 September 2022 the Home Office published the latest set of data on the Scheme, which covers the period to the end of August 2022."
        },
        {
            "text": "The total amount paid or offered to claimants through the scheme has increased to over £56.73 million."
        },
        {
            "text": "£ 48.64m has been paid across 1,213 claims and a further £8.08 m has been offered, awaiting acceptance or pending review"
        },
        {
            "text": "The statistics also show that 56% of claims have had a final decision."
        },
        {
            "text": "During the month of August, the Home Office paid out over £1.88 million in compensation."
        },
        {
            "text": "Example cases of people who have received compensation:"
        },
        {
            "text": " "
        },
        {
            "text": "Windrush Scheme for Documentation"
        },
        {
            "text": "On 16 April 2018, the Home Office established the Windrush Taskforce, now known as the Help Team, to ensure members of the Windrush generation could get the documentation they need to prove their right to be in the UK. Over 15,100 people have been issued with documentation confirming their status or British citizenship."
        },
        {
            "text": "To help people apply for documentation, the Taskforce has attended over 80 surgeries in person at places of worship, care homes and community centres, across the UK since 2018.  Since covid restrictions, over 40 more surgeries have been conducted on a digital platform."
        },
        {
            "text": "Everyone who secures documentation through the Help Team is also made aware of the Compensation Scheme when they receive their documentation. In addition, we have recently written to 6,200 people who applied for documentation to raise awareness of the Compensation Scheme."
        },
        {
            "text": "While many people are entitled to documentation under the Windrush Scheme, not all of those individuals will have experienced difficulties demonstrating their status. For this reason, many individuals that have rightfully secured documentation under the Windrush Scheme have not applied to the Compensation Scheme and would not be eligible for a compensation award."
        },
        {
            "text": "Individuals from a wide range of nationalities have been granted documentation after applying to the Windrush Scheme from within the UK, including a wide range of Commonwealth countries."
        },
        {
            "text": " "
        },
        {
            "text": "Support for those claiming on behalf of relatives who have passed away "
        },
        {
            "text": "The Home Office has launched a package of support to make it easier for those making claims on behalf of a relative who has passed away to obtain the legal documentation required to process their claims."
        },
        {
            "text": "This includes reimbursing up to £1,500 towards legal advice that has been sought to apply for probate, which is the legal right to deal with someone’s estate when they die. We Are Digital, who provide independent advice for those claiming compensation, will also be able to provide free help and support to those applying for probate, including how to complete the different application forms."
        },
        {
            "text": "The Home Office has written to all those who have already made claims on behalf of a relative who has passed away without evidence of probate, and has published information about the support available on gov.uk. "
        },
        {
            "text": " "
        },
        {
            "text": "Urgent and exceptional cases"
        },
        {
            "text": "In December 2018, the Home Office established an Urgent and Exceptional Payments process for those members of the Windrush generation who had an urgent and exceptional need in advance of the Windrush Compensation Scheme."
        },
        {
            "text": "The process remains open for those who need it. The total value of the payments approved, to the end of August, is £195,199.82"
        },
        {
            "text": "But this is just one way we help those in urgent need. There is also a dedicated Vulnerable Persons Team (VPT) to provide help and advice for more vulnerable people. This service also helps people:"
        },
        {
            "text": "To the end of August, the VPT has provided support to 2,041 individuals."
        },
        {
            "text": " "
        },
        {
            "text": "Improvements to the Scheme"
        },
        {
            "text": "In August, the Home Office made changes to make the Scheme more generous, these include changes for close family members."
        },
        {
            "text": "Every close family member who suffered an impact can now receive a minimum of £10,000. They can now also claim compensation for costs incurred whilst supporting someone who lost their employment or benefits because they were unable to prove their immigration status."
        },
        {
            "text": "Changes have also been made to the Homelessness category, including the removal of the cap, to make sure people are compensated for the full period they were homeless."
        },
        {
            "text": "In December 2020, the Home Office announced an overhaul of the Scheme to ensure that people receive significantly more money, much more quickly."
        },
        {
            "text": "We increased the minimum award under the Impact on Life category to £10,000. This is forty times the previous minimum award under this category and will be paid as a new early preliminary payment as soon as someone applying on their own behalf or on behalf of a deceased relative can show any impact on their life under the terms of the Scheme. They do not need to wait for their whole application to be assessed."
        },
        {
            "text": "We also increased the value of awards for Impact on Life at every level so everyone will be paid more in this category, with the maximum award increasing from £10,000 to £100,000 (with options for even higher awards in exceptional circumstances)."
        },
        {
            "text": "Within six weeks of the changes being announced, the Home Office had offered more in compensation than in the first 19 months of the Scheme, rising from £6.17 million to more than £12 million at the end of January 2021."
        },
        {
            "text": "Further improvements to simplify the application process have also recently been made, including changes to the primary claim form, designed in consultation with stakeholders, to make it easier to complete and easier for caseworkers to process."
        },
        {
            "text": "For those who do need support, the Home Office has funded an organisation to provide  free, independent claimant assistance to individuals for the duration of the Scheme. We Are Digital started providing this service from the first quarter of 2021."
        },
        {
            "text": "Compensation payments are made as quickly as possible, but each person’s claim is deeply personal and deserves to be processed with the utmost care and sensitivity so that the maximum payment can be made to them."
        },
        {
            "text": "Individuals must accept their offer of compensation before it can be paid, or, if they are dissatisfied, they can ask for a review. This is first through an internal review and, if someone remains dissatisfied, through an independent review by the Adjudicator’s Office."
        },
        {
            "text": " "
        },
        {
            "text": "Windrush Cross-Government Working Group"
        },
        {
            "text": "On 22 June 2020, the Home Secretary launched the Windrush Cross-Government Working Group."
        },
        {
            "text": "The Working Group, co-chaired by the Home Secretary and Bishop Derek Webley MBE DL, brings together community organisations with government representatives to support the delivery of practical solutions to address challenges affecting the Windrush generation and their families."
        },
        {
            "text": " "
        },
        {
            "text": "Engagement"
        },
        {
            "text": "Grassroots, face-to-face engagement has been key to delivering our messages to the people we know we need to reach."
        },
        {
            "text": "Since 2018, we have held approximately 200 engagement and outreach events across the country. These events include approximately 120 one-to-one surgeries to help people apply for documentation to the Windrush Scheme and around 80 public community engagement events to raise awareness of the Windrush Schemes."
        },
        {
            "text": "These events were moved online during the coronavirus pandemic in May 2020 so that people can continue to access support and advice on the Windrush Schemes. We will look to restart face-to-face community-based events once it is safe to do so."
        },
        {
            "text": " "
        },
        {
            "text": "Promotion of the Schemes and supporting communities"
        },
        {
            "text": "The Windrush Community Fund opened for applications in December 2020 until June 2021. The Community Fund supports community and grassroots organisations to run outreach and promotional activity to raise awareness of the Windrush Scheme (Documentation) and Windrush Compensation Scheme."
        },
        {
            "text": "In Phase one, following a competitive bidding round, 14 grassroot and community organisations across the UK were awarded grants between £2,500 to £25,000 to ensure affected Windrush communities are aware of the support and compensation available. In Phase two, a further 13 organisations have been allocated funding between £2,500 to £25,000"
        },
        {
            "text": "To reach priority audiences throughout the UK, the Home Office ran a £750,000 advertising campaign late last year. The campaign used a range of channels including print, local radio, web and social media to make more people aware of the support available to them and how to apply."
        },
        {
            "text": "Grassroots activity has included partnerships with specialist media outlets and the recruitment of campaign ambassadors. The ambassadors have worked in communities throughout the UK to encourage and support applications amongst their networks, via activities such as media interviews, hosting information events, distributing materials through food banks, faith organisations and coordinating social media work."
        },
        {
            "text": "The Government continues to work closely with stakeholders to ensure as many people as possible apply."
        },
        {
            "text": "We are now looking to engage HMG staff overseas in the Caribbean and in priority countries on the Windrush Schemes with a view to raising awareness of the schemes with those who may be impacted abroad."
        },
        {
            "text": " "
        },
        {
            "text": "Independent Person"
        },
        {
            "text": "On 21 April the Home Office announced Professor Martin Levermore MBE DL as the new Independent Person to advise on the Windrush Compensation Scheme, following a competitive recruitment round."
        },
        {
            "text": "Professor Levermore is providing crucial independent oversight and reassurance on the Windrush Compensation Scheme’s operation, policy and effectiveness."
        },
        {
            "text": "On 24 March, Professor Levermore published his first independent report on the Compensation Scheme. He found that knowledge of the Scheme is improving amongst affected groups and commended the Government on it’s commitment to continual improvement of the Scheme."
        },
        {
            "text": " "
        },
        {
            "text": "Learning lessons and moving forward - the Windrush Lessons Learned Review"
        },
        {
            "text": "In 2018, the previous Home Secretary commissioned a lessons learned review into the events leading up to Windrush. Independent oversight was provided by Wendy Williams."
        },
        {
            "text": "After receiving the final report, the Home Secretary published the report the next day on 19 March 2020.  "
        },
        {
            "text": "On behalf of successive governments, the Home Secretary apologised to the Windrush generation for the way they were treated."
        },
        {
            "text": "On 21 July 2020, the Home Secretary set out the action the Home Office is taking in response to the Wendy Williams Windrush Lessons Learned Review."
        },
        {
            "text": "This includes comprehensive training for everyone working in the Home Office to ensure they understand and appreciate the history of migration and race in this country. Every existing and new member of staff working for the Home Office will be required to undertake this training."
        },
        {
            "text": "Greater emphasis will be placed on taking a more compassionate approach to individual applications and decision makers will be empowered to use their own discretion and pragmatism."
        },
        {
            "text": "The Home Secretary published a comprehensive improvement plan in response to the Windrush Lessons Learned Review on 30 September 2020, which shows how the Home Office is delivering on the recommendations and working to be more diverse and worthy of the trust of the whole communities it serves."
        },
        {
            "text": "Amounts offered and paid month by month"
        },
        {
            "text": "Notes:"
        },
        {
            "text": " "
        },
        {
            "text": "Breakdown of full and final offers and payments"
        },
        {
            "text": " "
        }
    ]
}