{
    "url": "https://extremismcommission.blog.gov.uk/2025/04/17/building-international-partnerships-reflections-from-paris/",
    "title": "Building International Partnerships: Reflections from Paris ",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog",
        "Commissioner opinion"
    ],
    "pub_date": "2025-04-17T11:35:51+01:00",
    "content": [
        {
            "text": "By Robin Simcox, Commissioner for Countering Extremism"
        },
        {
            "text": "Last week I visited Paris in a bid to learn more about France’s approach to countering extremism. The trip served as an opportunity to strengthen the bilateral relationship with a key partner and discussing best practice around a shared problem set.  "
        },
        {
            "text": "Engagement with security and intelligence officials, diplomats, and academics over three days demonstrated that the challenges the UK and France faces are, while not identical, extremely similar. "
        },
        {
            "text": "Both countries, for example, have suffered significant numbers of Islamist terrorist attacks and have been forced to confront the ideological drivers behind those attacks.  "
        },
        {
            "text": "One of my conversations was with the General Secretary of the Interministerial Committee for the Prevention of Delinquency and Radicalisation. "
        },
        {
            "text": "Topics covered included integration, segregation, and the challenge posed by extremist groups that operate below the terrorism threshold. "
        },
        {
            "text": "Of particular concern were the activities of the Muslim Brotherhood and how they have helped foster a sense of ‘separatism’ - previously described by President Macron as “districts where the promises of the Republic (i.e. liberty, fraternity, equality) are no longer kept.” "
        },
        {
            "text": "Discussions inevitably turned to potential solutions to these challenges, where there is some divergence. "
        },
        {
            "text": "There are a variety of complex historical, cultural, legal and political reasons behind this, but one practical manifestation is that France has focused more on punitive measures and put less emphasis on early intervention initiatives like Prevent. "
        },
        {
            "text": "I was grateful for the support of the British Embassy in Paris in providing briefings and helping facilitate conversations, and was pleased to be able to deliver an all-staff session on the current extremism landscape in the UK, where my remarks focused on the fallout from events in Gaza and Southport, as well as the role of Prevent in countering terrorism and extremism. "
        },
        {
            "text": "My thoughts on the importance of all three in shaping the overall counter extremism landscape are a matter of public record. "
        },
        {
            "text": "The visit reinforced my conviction that countering extremism requires both local understanding and global cooperation. "
        },
        {
            "text": "However, it also provided an example of a Western democracy taking an assertive approach to both identifying extremist threats and defending core values in the face of them. "
        }
    ]
}