{
    "url": "https://mhclgdigital.blog.gov.uk/2025/04/17/digital-planning-get-involved-validating-the-baseline-planning-application-data-specifications/",
    "title": "Digital Planning: Get involved validating the baseline planning application data specifications",
    "authors": [
        "Mike Rose, Data, Licensing and Intellectual Property SME",
        "Colm Britton, Service Designer and Team Lead",
        "Liz Whiting, Senior Delivery Manager"
    ],
    "categories": [
        "Data",
        "Digital Planning"
    ],
    "pub_date": "2025-04-17T10:14:13+01:00",
    "content": [
        {
            "text": "At the end of last year we started work on data standards for planning applications. We have been looking to create a set of planning application data specifications to make the whole process for local planning authorities and software companies work more efficiently. "
        },
        {
            "text": "In our last blog post we set out how we were working in the open to achieve this. "
        },
        {
            "text": "We have now drafted these specifications with the help of over 40 organisations and we want your feedback to make sure they work well.  "
        },
        {
            "heading": 2,
            "text": "Why this work matters "
        },
        {
            "text": "This work is at the heart of the Digital Planning programme’s mission to modernise England’s planning system and make it fit for the 21st century. "
        },
        {
            "text": "Standardising how planning application data is structured and exchanged, reduces duplication, confusion, effort and inconsistency across local authority systems.  "
        },
        {
            "text": "These standards will enable interoperability and help create better services, smarter tools, and joined-up decision-making, unlocking the potential for innovation across the whole planning system. "
        },
        {
            "heading": 2,
            "text": "Where we started "
        },
        {
            "text": "We began by looking at the current national planning application forms. We identified what information they collect and the rules behind them. Rather than redesigning the forms, we focused on turning them into structured data:  "
        },
        {
            "text": "We developed ‘information models’—descriptions of each part of an application form, such as applicant details, proposal descriptions, or site information. "
        },
        {
            "text": "Earlier this year, we shared those models and started creating draft specifications based on them. A specification, in this case, is a structured guide about how the data should be organised and submitted—what information is required, what format it takes, and how it relates to other information. "
        },
        {
            "heading": 2,
            "text": "What we’ve done "
        },
        {
            "text": "Since January, we’ve been developing these specifications in the open by: "
        },
        {
            "text": "All of this work has been shaped by feedback from the community and tracked in the planning application specification GitHub repository. "
        },
        {
            "heading": 2,
            "text": "What’s included in the baseline "
        },
        {
            "text": "So far, the draft baseline includes: "
        },
        {
            "text": "To avoid disrupting current processes, we’ve tried to keep the specifications as close as possible to existing forms. We plan to make improvements—like rationalising components—in future iterations. "
        },
        {
            "heading": 2,
            "text": "How feedback has helped to shape the work  "
        },
        {
            "text": "Our progress has been driven by feedback from the community. We’ve logged 74 issues, of which: "
        },
        {
            "text": "Every part of the specification is open for feedback. Each component and codelist has a corresponding discussion thread in GitHub. This is helping us track where things need clarification, change, or further thought. "
        },
        {
            "heading": 2,
            "text": "What the specifications look like "
        },
        {
            "text": "Each compiled specification begins with a description of the application type and a list of required components and codelists. "
        },
        {
            "text": "It includes: "
        },
        {
            "text": "We’ve also set out a clear format to make the specifications readable: "
        },
        {
            "text": "All the specifications are available to view on our planning application data specification discussion page on GitHub. You can navigate by application type or explore individual components. "
        },
        {
            "heading": 2,
            "text": "How you can help now "
        },
        {
            "text": "We’re inviting anyone involved in planning—whether you work in a local authority, build planning systems, or regularly submit applications—to review the baseline specifications. "
        },
        {
            "text": "We want to use the collective knowledge of the planning community to create specifications that work for everyone. We want your feedback on: "
        },
        {
            "text": "If something doesn’t make sense or seems broken, please tell us!  "
        },
        {
            "text": "Suggestions for improvements and rationalisation are also welcome, and we’ll log those for future iterations. "
        },
        {
            "text": "To get involved please join the conversation by visiting our GitHub validation discussion page to share your thoughts. You'll need to set up a free GitHub account to comment, which also ensures you receive all future updates about this project."
        },
        {
            "text": "Your feedback will help us move from a basic standard to something better—by testing, using, and evolving the specifications in the open. "
        },
        {
            "text": "This work is fundamental to creating data in the right format, so that it works well for everyone."
        },
        {
            "heading": 2,
            "text": "Keeping up to date"
        },
        {
            "text": "You can find information, updates and relevant links about this work on the planning data design advisory group project homepage."
        },
        {
            "text": "Meanwhile you can keep up to date on our Digital Planning programme, by following us on LinkedIn and subscribe to our newsletter."
        },
        {
            "text": "For an overview of the Digital Planning programme you can also look at this previous MHCLG Digital blog post. The programme is one of the case studies bringing to life MHCLG Digital’s objectives and guiding principles. "
        }
    ]
}