{
    "url": "https://cddo.blog.gov.uk/2025/04/17/inside-the-2025-cross-government-software-engineering-conference/",
    "title": "Inside the 2025 Cross Government Software Engineering Conference",
    "authors": [
        "Katherine Bhambra, Senior Content Designer, GDS"
    ],
    "categories": [
        "Cross-government strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-04-17T10:39:46+01:00",
    "content": [
        {
            "text": "Collaboration, knowledge sharing and innovation were the focus of 2025’s Cross Government Software Engineering Conference, which was held in-person for the first time since the pandemic."
        },
        {
            "text": "The conference took place on 29 January 2025 at the Whitechapel building in London, and was organised by the Cross Government Software Engineering Community. The aim of our group is to create a strong and representative network for everyone who works in government software engineering, so this event marked a major milestone for all those involved.  "
        },
        {
            "text": "With 14 speakers and over 80 participants from across the public sector and its partnered organisations, attendees were able to take part in talks, discuss their work and to celebrate past successes. However, this conference also fulfilled a greater aim by meeting the new initiative for digital government."
        },
        {
            "heading": 3,
            "text": "The power of community"
        },
        {
            "text": "Earlier this year, the Blueprint for modern digital government was published to lay out the vision for the future state of digital services. Several parts of its core six-point plan depend on building and maintaining strong communities of digital practitioners across government departments.From lessons learned within our own groups, this will introduce a range of clear benefits, including:"
        },
        {
            "heading": 3,
            "text": "Designing an event for the community"
        },
        {
            "text": "An important part of any community are the bonds between its individuals. That’s why events like the Cross Government Software Engineering Conference are so vital - they provide a space for people to meet and create those bonds. While our conferences were previously held virtually or with smaller teams, we organised this event to allow the wider software engineering network to engage at a much larger scale.The event would also tackle big challenges, such as how to build software that lasts, how to improve services over time, and how to boost public trust. That’s why we wanted to use this event to bring together developers from across government to share best practices and highlight what works and what still needs to be improved. Important to this was making sure we could drive home the message to senior leaders - that supporting digital delivery should be a top priority, and that this can be accelerated by supporting industry best practice and ways of working for software engineering.The day was only made possible by our generous sponsors: GovCamp and Government Digital Service (GDS). In the spirit of sustainability and accessibility, we made sure that the conference was a low-budget event with topics crowd-sourced from community coordinators.As a result of everyone’s efforts, the conference was met with such incredible enthusiasm that tickets sold out.We structured the day of the event itself to allow time for detailed subject talks and case study presentations. We also made sure that there would be vital networking time, because informal connections are often just as important as the more formal sessions."
        },
        {
            "heading": 3,
            "text": "Key subjects for software engineers"
        },
        {
            "text": "The conference featured a rich range of in-depth sessions by subject matter experts on critical government initiatives. These included: "
        },
        {
            "text": "Specialist talks from community members tackled important issues, such as:"
        },
        {
            "text": "The highlight of the conference were our two keynote speakers. Asim Hussain, Executor Director of the Green Software Foundation, presented ‘Tipping the Scales’. This was a detailed introduction to the Green Software Foundation and its goal, which is to help create a future where software processes and AI have zero harmful environmental impacts.Terence Eden, Principal Privacy Architect of Our Future Health UK, presented ‘Lessons Learned Open Sourcing the UK’s Covid Tracing App’. This presentation covered the history of the famous contact-tracing app and the impact of the decision to make it open source."
        },
        {
            "heading": 3,
            "text": "What we learned and why it matters"
        },
        {
            "text": "The momentum of this conference far outstripped expectations, so we will definitely be ensuring that future events can accommodate everyone who wants to take part. With attendees from 36 different departments and agencies, we saw an exciting range of discussions and connections made between people who might otherwise not meet. It was clear that being able to share best practices, challenges and opportunities in person is vital.The success of this conference has illustrated the need for similar future events, which we will be planning for soon. It has also allowed us to show senior leaders the importance and impact of providing these spaces for the community."
        },
        {
            "heading": 3,
            "text": "Join the community"
        },
        {
            "text": "The Cross Government Software Engineering Community is always keen to welcome new members. If you work in government software engineering and would like to get involved, join the Cross Government Software Engineering Community."
        }
    ]
}