{
    "url": "https://mhclgmedia.blog.gov.uk/2025/04/17/update-on-birmingham-waste-dispute/",
    "title": "Update on Birmingham Waste Dispute",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Communities",
        "Local government"
    ],
    "pub_date": "2025-04-17T16:54:38+01:00",
    "content": [
        {
            "text": "Local Government Minister Jim McMahon visited Birmingham today (Thursday, 17 April) – where the latest data shows that all of the large accumulations of street waste in badly affected areas and more than 85% of street waste across the whole city has now been cleared."
        },
        {
            "text": "The Minister met with council leaders to hear about the huge progress made in clearing the city’s streets of waste – with the council on track to return to normal levels this weekend – deploying over 100 crews on Friday and Monday over the Bank Holiday weekend. "
        },
        {
            "text": " Clean up efforts have continued to intensify across the city over recent days – with crews clearing around 1,500 tonnes of waste a day, with around 100 and 120 refuse collection vehicles out every day.  The council has also repurposed between 40-60 housing and street cleansing vehicles and deployed large ‘grab trucks’ to clear large rubbish piles each day.   "
        },
        {
            "text": "The situation in Birmingham remains a priority for the government, which has been working intensively with the council, deploying operational and logistical expertise to take decisive action and help clear the streets for the residents of Birmingham. The government has also supported the provision of mutual aid to help the ongoing clean up effort.    "
        },
        {
            "text": "Staff have been working extended shifts, housing and street cleaning vehicles have been repurposed for waste collection and a laser focus has been applied to areas with the greatest need. "
        },
        {
            "text": "Now that the majority of the rubbish has been cleared, efforts are turning to deep cleaning of streets affected by the backlog of rubbish and tackling fly tipping sites – with residents urged to report fly tipping to the council so it can be cleared. "
        },
        {
            "text": "Minister of State for Local Government and English Devolution, Jim McMahon OBE MP said:    "
        },
        {
            "text": "“The residents of Birmingham need to see this dispute reach a resolution. We are calling on Unite to suspend the strike action immediately, and take the deal on offer that is both fair for workers and residents.  “We have worked intensively with the council to clean up the city’s streets – meaning that the vast majority of the waste backlog is now cleared and on track to being rightly back to normal for the Easter Bank Holiday weekend.” "
        },
        {
            "text": "The Minister visited the city centre where businesses are preparing for the bank holiday weekend. The visit comes a week after the Deputy Prime Minister met with staff involved in clearing the backlog and community volunteers helping the clean up in their area. "
        }
    ]
}