{
    "url": "https://insideDIO.blog.gov.uk/2025/01/09/celebrating-50-years-of-mod-conservation-groups/",
    "title": "Celebrating 50 years of MOD conservation groups",
    "authors": [
        "DIO Environmental Engagement Team"
    ],
    "categories": [
        "Conservation",
        "Environment and Ecology",
        "Sanctuary Awards",
        "Uncategorized"
    ],
    "pub_date": "2025-01-09T16:50:43+00:00",
    "content": [
        {
            "text": "The importance of the MOD estate for supporting wildlife and heritage has long been recognised. In 1971-73, the Nugent Committee examined the necessity and management of Defence land holdings. It noted the importance of the estate, and highlighted the need to actively manage its abundant wildlife and heritage features, alongside the increasing demands for public access."
        },
        {
            "text": "In response to the Nugent report’s recommendations, numerous MOD Conservation Groups were quickly formed to liaise with external organisations, develop land management plans, and implement practical conservation measures. The first of these was created at Longmoor, Hampshire in 1974 by the MOD’s first ever Conservation Officer, Lt Col (Ret’d) Christopher Norman Clayden."
        },
        {
            "heading": 2,
            "text": "About Longmoor Conservation Group"
        },
        {
            "text": "Longmoor Conservation Group helps to manage Woolmer Forest, one of the largest and most diverse areas of lowland heathland in Hampshire, as well as other military estates peripheral to the forest."
        },
        {
            "text": "In 1974, the future of Woolmer Forest as a site of biological interest looked less than rosy. The effects of acid rain had seriously reduced the pH of Woolmer pond, and the cessation of turf cutting and grazing livestock in the early 20th century led to the encroachment of pine, birch, willow, bracken and scrub."
        },
        {
            "text": "In its first few decades, Longmoor Conservation Group set the scene for the site’s recovery, drawing on the expertise of group members in fields ranging from herpetology, ornithology, and entomology to botany and even archaeology."
        },
        {
            "text": "Successes included the number of breeding natterjack toad females increasing from just 10 in the 1970s to between 40 and 50 by 2004, thanks to habitat improvement for the rare toads, centred on pond creation and restoration."
        },
        {
            "text": "The Conservation Group also oversaw the initiation of one of the earliest successful sand lizard re-introductions, as well as the development of a species recovery programme for the spangled water beetle, a species unique to Woolmer Forest."
        },
        {
            "heading": 2,
            "text": "Longmoor in Sanctuary magazine"
        },
        {
            "text": "Over the years, the ‘Around the Regions’ section of the annual MOD Sanctuary magazine has been keeping readers up to date with the work of the Conservation Groups – of which there are now over 60 across the Defence estate."
        },
        {
            "text": "As the MOD’s longest running Conservation Group, it’s no surprise that the pages of ‘Around the Regions’ have often featured updates from Longmoor and neighbouring sites. As well as charting conservation achievements, these articles also offer fascinating insights into the history of the area."
        },
        {
            "text": "In 1993, for example, Lt. Col. (Ret’d) W J Briggs informed readers that “the clearance of conifers from Queen's Bank on Woolmer Forest (where Queen Anne was said to have 'reviewed' her Red Deer hinds in the early 1700s) will allow the regeneration of dry heathland.”"
        },
        {
            "text": "A special feature in the 2003 edition of Sanctuary magazine, authored by Dr Jonty Denton of the MOD Longmoor Conservation Committee, explored the ecological impacts of the Longmoor Military Railway. Dr Denton’s article explains how, despite the railway itself being long gone, its legacy for wildlife remains of great importance for some of the UK’s rarest reptile, amphibian, and bird species."
        },
        {
            "heading": 2,
            "text": "Longmoor in the 21st Century"
        },
        {
            "text": "In 2017, the Longmoor Conservation Group Natterjack Toad Project was a runner up in the annual MOD Sanctuary Awards. The project involved collaboration between the Conservation Group and the Amphibian and Reptile Conservation (ARC) charity – a partnership which continues to this day – and was recognised for its work building on habitat management for natterjack toads at Woolmer Forest."
        },
        {
            "text": "More recently, 2021 saw the completion of a major project to extend the grazing area and numbers of native-bred longhorn cattle at Woolmer. The project was overseen by the DIO Ecology team, working with stakeholders including ARC, Hampshire and Isle of Wight Wildlife Trust and Natural England. The cattle play an important role in providing conservation grazing, helping to maintain quality habitat for natterjack toads as well as aiding mire restoration."
        },
        {
            "text": "The work of Conservation Group members in surveying and monitoring species – be it herptiles, invertebrates, birds, or numerous species of flora – is invaluable to DIO’s ecologists, at Longmoor and indeed throughout the Defence estate. The data is actively used to inform site management plans in order to meet ecological requirements, all in careful balance with supporting military training.  "
        },
        {
            "text": "If you’d like to know more about MOD Conservation Groups, are thinking about getting involved or even setting one up, feel free to contact the DIO Environmental Engagement Team at: DIO-ConservationGroups@mod.gov.uk"
        }
    ]
}