{
    "url": "https://dragonsden.blog.gov.uk/2025/01/09/dragons-den-ip-blog-series-22-episode-1/",
    "title": "Dragons’ Den IP Blog- Series 22 Episode 1",
    "authors": [
        "Clare Saunders"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-01-09T21:00:00+00:00",
    "content": [
        {
            "text": "Happy new year everyone! Can you believe we are onto series 22 of Dragons’ Den! As a new band of entrepreneurs face the Dragons we are here, as always, ready and waiting to spot and discuss the different types of intellectual property in the pitches."
        },
        {
            "heading": 3,
            "text": "New year, new Dragon"
        },
        {
            "text": "Inevitably a new year brings people’s minds to resolutions; getting healthy, self-improvement and well-being. Episode one certainly capitalised on this and started off strong with the introduction of a new guest Dragon. Who better to step in for this first episode than fitness influencer Joe Wicks. I have followed Joe since lockdown - when PE with Joe was the way we started every morning - trying to homeschool my children and make sure they moved their bodies every day while we had to stay at home.  "
        },
        {
            "heading": 3,
            "text": "Two Joe’s are better than one"
        },
        {
            "text": "While Joe Wicks joined the Dragons, it was Joseph Keegan who was the first new entrepreneur of 2025 to face them. His interest in health and fitness is definitely not a new year’s fad. Such is his passion in fitness, he has turned it into a business idea, looking for £70k for a 10% stake in his business BodyXCore. I knew the synergy with the two Joe’s in the Den wasn’t just going to be down to the shared name. Joseph’s story of passion and his struggles to get his business idea up and running immediately resonated with Joe Wicks and all the Dragons.  But was his pitch also going to fulfil my requirements? I was hoping he would have thought about his intellectual property as well as his fitness and well-being and I was certainly not disappointed."
        },
        {
            "text": "When he described his product as the patented gym in a bag, I was delighted to hear that he had protected his invention. It was Sara Davies who wanted to know more about exactly what part of the product was protected by the patent, or as she described it \"the patentable step.\""
        },
        {
            "text": "Regular readers of this blog will know that in order to be granted a patent your invention must be:"
        },
        {
            "text": "Joseph talked to the Dragons about the money he had spent on his business, including the expense of securing his patent. Like Joseph, we would always recommend securing the help of an IP attorney when applying for a patent as the process can be complex. Engaging the help of a professional will lead to much more success with your application. The Chartered Institute of Patent Attorneys (CIPA) is a great place to start to find a patent attorney near you."
        },
        {
            "heading": 3,
            "text": "Looks can be important too"
        },
        {
            "text": "While Joseph described the patented function of his product, I was also interested to hear about the fact that he has secured design rights to protect the look of the product. A quick search of the designs database allowed me to view the different designs that Joseph has protected."
        },
        {
            "text": "Designs are a great way to add further layers to the protection of your product and to deter people further from trying to copy you. They protect the look, decoration, pattern or shape of a product. They are a relatively affordable form of IP protection with one design costing from £50."
        },
        {
            "heading": 3,
            "text": "Three Dragons are better than one"
        },
        {
            "text": "With such an innovative fitness product and Joseph’s personal story, it had to be Joe Wicks who was first to offer Joseph an investment. What Joseph hadn’t quite bargained on was the level of interest from the other Dragons, with Sara, Touker and Peter all interested in securing investment too."
        },
        {
            "text": "The appeal of Joe Wicks as an investor is of course the brand and profile that he already has in the fitness world. Joe Wicks has a number of registered trade marks to protect his Body Coach fitness brand. It is the reputation and loyalty which this brand has built which will help Joseph and the BodyXcore."
        },
        {
            "text": "A well-recognised brand can influence the customer to choose their product or service over a similar, less established one. The association with and endorsement from Joe Wicks, is bound to help build the BodyXcore brand and the protection of a trade mark which Joseph has already secured, will set him in good stead."
        },
        {
            "text": "In the end, Joseph left the Den with a larger investment than he first pitched for, although it did mean sharing more of his business. Joe Wicks, Touker Suleyman and Peter Jones each invested £35k in return for a 12.5% stake."
        },
        {
            "text": "Joseph’s healthy intellectual property protection set his business up for a really successful 2025. If you want to give your business the best start, check out our IP for business: guidance, tools and case studies - GOV.UK to help your business grow.  "
        },
        {
            "text": "Disclaimer: "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}