{
    "url": "https://sustainableict.blog.gov.uk/2025/01/09/green-shoots-but-plenty-more-still-to-do/",
    "title": "Green shoots but plenty more still to do",
    "authors": [
        "Chris Howes - Chief Digital and Information Officer"
    ],
    "categories": [
        "Sustainable ICT"
    ],
    "pub_date": "2025-01-09T09:45:00+00:00",
    "content": [
        {
            "text": "Chris Howes shares his thoughts on the latest Government ICT sustainability report, acknowledging the progress made and the work still to be done."
        },
        {
            "text": "Today we’re publishing our latest ‘Greening Government Commitments ICT (Information Communications and Technology) Report’, covering the period 2023/24. The report sets out the progress of UK government departments, agencies and public bodies in making their digital services and technologies more sustainable and meeting IT-related Greening Government Commitments"
        },
        {
            "text": "This report is the result of months of hard work from digital teams across Government and our supply chain, and I want to thank everyone who has contributed to it."
        },
        {
            "text": "Being transparent about our performance is a key part of our approach to digital sustainability and I’m really pleased to see that we have more Departments than ever represented in this year’s report – demonstrating the increasing realisation that improving the sustainability of our own technology is one of the key ways that Government can tackle the climate crisis."
        },
        {
            "heading": 2,
            "text": "Steady progress but big challenges lie ahead"
        },
        {
            "text": "This time around I feel the picture is one of steady, though not dramatic, improvement in the data reported. Of course, there are still acknowledged limitations in this data – in particular, because, like almost every organisation, in every sector, calculating supply chain “Scope 3” emissions (generated from across our supply chain), as discussed here,  is extremely challenging to do, accurately."
        },
        {
            "text": "But the data reported does show reductions in CO2 emissions and volumes of e-waste generated by Government IT. We should acknowledge the hard work done by digital teams across the country to help deliver these improvements and be encouraged by them as we face important challenges ahead."
        },
        {
            "text": "These challenges continue to grow, as the increasing digitisation of Government continues to create upward pressure on emissions and waste targets, as well as risking wider planetary impacts such as those on water use and biodiversity."
        },
        {
            "text": "We have seen recent examples of how increasing demand for AI and other energy-heavy computing has led to rapid rises in CO2 emissions from the data centres needed to power this exciting new technology."
        },
        {
            "text": "These are important issues for us to address, and the only way we will succeed is by building on the step change in collaboration between Departments and with suppliers and other experts (more on that in a moment)."
        },
        {
            "heading": 2,
            "text": "New Defra priorities, a renewed focus"
        },
        {
            "text": "In Defra we launched our Digital and Data Transformation Strategy nearly 12 months ago, and lots has happened since then.  Most notably, it won’t have escaped your notice that we have a new Government. This has given us a very clear steer and mandate on what Defra’s focus will be over the next five years."
        },
        {
            "text": "ICT has a vital role in helping Defra to achieve our five new priorities, set out by Secretary of State Steve Reed in July. It’s been great to hear Mr Reed talking about the importance of co-designing services with users and unlocking efficiencies to deliver high quality outcomes at lower cost - both are core parts of what we are trying to do with digital transformation in Defra. This includes transforming our own organisation too; becoming a truly digital organisation will fundamentally change how Defra operates and delivers value to citizens and customers.  "
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "I mentioned earlier that we will only succeed through collaboration. One of the ways we are doing this is through the Government Digital Sustainability Alliance (GDSA). Established in 2022, the GDSA brings together specialists from across industry and academia to help shape Government’s approach to improving the sustainability of our IT."
        },
        {
            "text": "We’ve  recently welcomed a host of new members, and I’m delighted at the momentum which continues to build. The GDSA is proving an invaluable source of insight and advice for us, and its members are currently helping us with issues such as sustainability and AI, reducing the e-waste we generate, addressing wider planetary impacts and improving reporting. "
        },
        {
            "text": "We’re also bringing Government together to work with the GDSA and collaborate between departments. Our cross-Government Digital Sustainability Steering Group makes sure that we share knowledge and speak with one voice across Government."
        },
        {
            "text": "Both these groups will be at the heart of our plans for a new cross-Government strategy later this year, setting out our refreshed ambition and approach to digital sustainability in Government."
        },
        {
            "text": "In summary, we should be encouraged by the progress made this year, and we can take confidence from the enthusiasm and efforts being made across Government, and by our industry partners, to tackle this digital sustainability challenge. The closer we can work together though, the more likely we are to strengthen our approach and begin to make a real and meaningful difference."
        },
        {
            "text": "Chris Howes is Defra’s Chief Digital and Information Officer and the Cross Government lead for ICT Sustainability."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}