{
    "url": "https://moderncivilservice.blog.gov.uk/2025/01/09/sir-jim-harra-why-small-changes-matter-at-hmrc/",
    "title": "Sir Jim Harra: Why small changes matter at HMRC",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Innovation",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-01-09T13:43:22+00:00",
    "content": [
        {
            "text": "Guest blog by Jim Harra, the Permanent Secretary at HM Revenue and Customs."
        },
        {
            "text": "This year’s One Big Thing initiative “…starts with One Small Change.’’  A few years ago, I saw how a small change, or a series of small changes, can be the catalyst for radical improvement, when I spent a couple of days with the HMRC VAT Registration Service (VRS)."
        },
        {
            "heading": 2,
            "text": "Empowering people to solve problems"
        },
        {
            "text": "On my first day, I joined an operational team for their daily stand-up meeting where an AO colleague shared a simple, but brilliant idea. She had noticed that the team was receiving lots of queries from child minders in particular, and suggested that we could reduce this contact if we updated the guidance to make it clearer for this group. "
        },
        {
            "text": "At the stand-up meeting the next day, the team leader confirmed that the process owner (the person who is responsible for the end-to-end process) agreed and the guidance changes were already underway."
        },
        {
            "text": "In just two days, I could see that operational delivery colleagues in the VRS team were being actively encouraged to contribute to continuous improvement and that they were empowered to solve problems. This was only possible because:"
        },
        {
            "heading": 2,
            "text": "Innovation is not a light bulb moment – it’s a team mindset"
        },
        {
            "text": "The key learning I took from this experience is that innovation is not necessarily an individual light bulb moment but it is much more often about a team mindset and culture of continuous improvement. "
        },
        {
            "text": "In a different team, with a different culture, this colleague may not have even considered raising the issue or sharing her ideas. Or the team leader might have felt defeated by the need to secure someone else’s agreement to the change. "
        },
        {
            "text": "Where everyone understands their part in continuous improvement, the structure exists (in this case via a daily stand-up) for ideas to be shared and good relationships and connections within the organisation are encouraged, this creates a culture where the root cause of issues are identified and solutions are found. "
        },
        {
            "text": "That is why I am delighted that our Service Excellence Programme is focusing on developing the leadership skills and capability needed to build the culture, mindset and structures for innovating and improving every day. If you’d like more details on the programme, please contact newsdesk@hmrc.gov.uk."
        },
        {
            "text": "As well as harnessing this sort of local innovation, we also need to challenge the current models of delivery and look outside of government, to the wider digital economy, for new partnerships and innovative solutions. "
        },
        {
            "text": "Read more about Jim Harra's career journey in his Meet the Modern Civil Service interview."
        },
        {
            "heading": 2,
            "text": "Imagining the future of the tax system"
        },
        {
            "text": "Earlier this month I spoke at HMRC’s Innovation Festival. It got HMRC’s senior leaders talking about possible visions of the future and exploring some of the ways that the world will change as new technologies develop, and the risks and opportunities this presents."
        },
        {
            "text": "Innovation will be crucial for HMRC in delivering the Exchequer Secretary to the Treasury’s priorities for the tax system: closing the tax gap, improving our day-to-day services and modernisation and reform."
        },
        {
            "text": "To meet this challenge and deliver better public services, we need to think big about radical innovation and also to make sure that people working day-to-day on the services that we deliver to citizens feel empowered to try out new ideas without fear of failure, as I saw in action in the VRS. "
        }
    ]
}