{
    "url": "https://userresearch.blog.gov.uk/2025/01/09/updating-the-user-researcher-role-in-the-capability-framework/",
    "title": "Updating the User Researcher role in the Capability Framework",
    "authors": [
        "Jonathan Nicholls, Head of User Research, Ministry of Justice"
    ],
    "categories": [
        "Training and development",
        "User research"
    ],
    "pub_date": "2025-01-09T17:35:07+00:00",
    "content": [
        {
            "text": "Those of you with eagle eyes will have noticed the ’user researcher’ role in the Government Digital and Data Profession Capability Framework, published by the Central Digital and Data Office (CDDO), has recently been updated. This blog post shares some of the background and thinking behind the changes, and highlights some of the things it means for user researchers working in government."
        },
        {
            "heading": 2,
            "text": "A bit of history"
        },
        {
            "text": "It’s been a long and collaborative journey to update the framework, and has involved a myriad of people in the cross-government user research (UR) community since 2019. "
        },
        {
            "text": "The Government Digital and Data Profession Capability Framework was first published in 2017 to provide a common understanding of the different digital, data and technology roles in government. ‘User researcher’ is part of the ‘user-centred design’ group of roles in the framework. "
        },
        {
            "text": "An initial review of the role in 2019 suggested it would benefit from some iteration. Starting with a review of the old framework, a working group identified strengths and gaps, drawing on insights from across departments. Later, an experimental version was piloted at the Department for Business and Trade (DBT), refined with input from community consultations and CDDO. "
        },
        {
            "text": "The updated role now live on the framework reflects the collective efforts of many, showcasing a true cross-government collaboration, with notable thanks to:"
        },
        {
            "heading": 2,
            "text": "What problems were we trying to solve"
        },
        {
            "text": "As we started to develop a new iteration of the role, based on the discovery work we’d done, three key issues emerged. "
        },
        {
            "heading": 3,
            "text": "1. More focus on advocating for users"
        },
        {
            "text": "In the old version of the role, there was a skill called ’user-centred and agile practices’. But while it’s important we conduct research in a user centred way, there’s not much point to that if our research doesn’t make a difference. So it’s not just about conducting the research, a key part of our role is using it to advocate on behalf of the user - but this was missing. "
        },
        {
            "heading": 3,
            "text": "2. More focus on agile"
        },
        {
            "text": "Similarly, combining user-centred and agile practices into a single skill meant it didn’t do enough to describe the skills we need for effective agile working. "
        },
        {
            "text": "The way we conduct research is quite different to, say, academic researchers. For our work to have impact, we need to deliver insights at a depth and cadence that will support agile delivery teams. Including this as a separate skill in the new role should mean we spend more time developing these skills in the researchers we manage."
        },
        {
            "heading": 3,
            "text": "3. More focus on stakeholder management and research leadership"
        },
        {
            "text": "We had identified a common scenario for senior user researchers looking for promotion. They would have all the UR ‘craft’ skills, but their manager felt they weren’t ready to step up to lead user researcher."
        },
        {
            "text": "Often the issue was, while their research skills were strong, they hadn’t developed the stakeholder and leadership skills that leads and heads of user research depend on. The problem here was that these skills weren’t reflected in the capability framework - and so we weren’t doing enough to help people develop these skills early in their career. "
        },
        {
            "heading": 2,
            "text": "What’s new?"
        },
        {
            "text": "With this analysis in mind, the new user researcher role:"
        },
        {
            "text": "Here is the new list of skills for the role:: "
        },
        {
            "text": "This new iteration of the framework doesn’t contain much that’s radically new - good user researchers are doing all this already. But the point is these are key skills for all of us. So hopefully the update of the capability framework will encourage us all to look at these as we reflect on our practice and develop our user research careers."
        },
        {
            "heading": 2,
            "text": "What next"
        },
        {
            "text": "Departments will be rolling out the new role at their own pace, but please take the time to look at the skills,especially those that appear in the role for the first time.  "
        },
        {
            "text": "And look at the Capability Framework for a fuller definition of what’s expected at each seniority level."
        },
        {
            "text": "And lastly, this has been through a big collaborative and consultative process - but it can always be improved.  If you have any comments and reflections, please leave them below."
        }
    ]
}