{
    "url": "https://mhclgdigital.blog.gov.uk/2020/10/08/mhclg-looking-for-ddat-professionals-for-a-new-birmingham-hq/",
    "title": "MHCLG looking for DDaT professionals for a new Birmingham HQ",
    "authors": [
        "Paul Maltby"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2020-10-08T09:59:50+01:00",
    "content": [
        {
            "text": "The Digital Directorate in MHCLG is still less than three years old but things are going from strength to strength. As Chief Digital Officer, I am particularly proud of what we’ve achieved in this time:"
        },
        {
            "text": "What’s more, important strategic policy in the department such as planning reforms are being designed on solid data and digital foundations."
        },
        {
            "text": "Now a new chapter in the department’s digital function is opening up and we are excited to announce we are recruiting for roles in MHCLG’s new Birmingham HQ. "
        },
        {
            "text": "Right now many of us are continuing to work from home where we can, but a new hybrid working environment beckons, and like many others in government we are keen to attract digital and technology talent from a wider pool across the UK. "
        },
        {
            "text": "Our local government digital work means we get out and about perhaps more than most across the country during ‘normal’ times, and a fair number of us have home locations well outside the capital. We are no strangers to Birmingham and the West Midlands in particular, but this is the first time we have actively recruited outside London for core digital roles, and we are excited about building a new set of teams here."
        },
        {
            "heading": 2,
            "text": "Join the new Birmingham HQ"
        },
        {
            "text": "We are recruiting for the following roles:"
        },
        {
            "text": "We will also be recruiting for a number of other digital and technology roles in the coming weeks in both our London and Birmingham locations. These are likely to include:"
        },
        {
            "text": "The strength of our team is down to its people and culture, so please do apply if you’re interested in joining what we think is the best digital team in government."
        },
        {
            "text": "Paul Maltby is Chief Digital Officer at MHCLG."
        }
    ]
}