{
    "url": "https://deframedia.blog.gov.uk/2024/01/05/coverage-of-uk-farming-schemes-upgrades-and-plans-to-consult-on-food-labelling/",
    "title": "Coverage of UK farming schemes upgrades and plans to consult on food labelling",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-01-05T14:14:33+00:00",
    "content": [
        {
            "text": "There has been widespread national, regional and trade coverage of our announcement on the biggest upgrades to UK farming schemes introduced by the Government since Britain left the EU."
        },
        {
            "text": "At the Oxford Farming Conference, the Secretary of State announced a number of changes to the schemes to facilitate even greater environmental ambition, help more farmers to get involved, and support domestic food production. The changes include a 10% increase in the average value of agreements in the Sustainable Farming Incentive and Countryside Stewardship, around 50 new actions that farmers can be paid for such as those to improve soil health or providing nesting and foraging habitats for farmland wildlife, and a single streamlined application process for the Sustainable Farming Incentive and Countryside Stewardship Mid Tier."
        },
        {
            "text": "A further commitment in the speech focussed on improving transparency in food labelling to support British farmers and empower consumers, including plans to rapidly consult on making food labelling clearer to help consumers make informed choices and ensure British farmers following high welfare standards are fairly rewarded."
        },
        {
            "text": "Both elements of the announcement were covered in multiple national outlets, including The Independent, Financial Times and The Daily Mail who focused on the uplift to farming subsides. Meanwhile, The Guardian, The Sun and The Telegraph reported on the proposed changes to food labelling. The Telegraph also published an opinion piece from the Environment Secretary which set out his commitment to support British farmers and help consumers make more informed choices through clearer labelling."
        },
        {
            "text": "There was also widespread trade coverage online of both the food labelling announcement and the upgrades to the environmental land management schemes in Farmers Guardian, Farmers Weekly and Horticulture Week."
        },
        {
            "text": "The Minister also appeared on BBC News at 6, emphasising the work of government to protect farmland from flooding, with more than £5 billion of investment into flood defences."
        },
        {
            "text": "Environment Secretary Steve Barclay said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}