{
    "url": "https://defradigital.blog.gov.uk/2024/01/05/defra-group-digital-and-data-transformation-strategy-how-were-planning-to-digitally-transform-our-services/",
    "title": "Defra group digital and data transformation strategy: how we’re planning to digitally transform our services",
    "authors": [
        "Sarah Hoy"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Digital transformation"
    ],
    "pub_date": "2024-01-05T13:44:12+00:00",
    "content": [
        {
            "text": "I’m Sarah Hoy, Deputy Director for Digital Transformation in Digital Data and Technology Services (DDTS). In November, we published the Defra group Digital and Data Transformation Strategy. The strategy aims to transform our digital services in line with the central government digital, data and technology roadmap."
        },
        {
            "text": "Our strategy outlines six missions that cover how we design services, how we leverage technology, how we use data, how we attract and grow digital skills, and how we are changing the way we work to make it easier to deliver our outcomes."
        },
        {
            "text": "A large part of my role is being the owner for Mission 1, which is all about achieving Defra group’s ambitious outcomes by redesigning our public-facing services to improve user experience, value for money, and effectiveness."
        },
        {
            "text": "We provide in the region of 700 services to citizens and businesses, for example:"
        },
        {
            "text": "Some of the services we provide are already achieving outcomes whilst meeting user needs and providing value for money. There’s still a huge opportunity to improve services through working in a more service and product centric way - putting user needs at the heart of service design and taking advantage of opportunities to work more collaboratively across organisation boundaries."
        },
        {
            "text": "This is an exciting time for service transformation in Defra group (made up of 32 arms-length bodies), with nine areas of work which will help deliver the 2025 milestones and 2030 ambitions outlined in the strategy – more information on some of these is below."
        },
        {
            "heading": 2,
            "text": "Top nine services"
        },
        {
            "text": "The Central Digital and Data Office (CDDO) have a target to get the top 75 digital services in government to a ‘great’ standard by 2025. Nine of those services are owned in Defra group. One out of nine (Sign up for Flood Warnings) has already achieved the ‘great’ standard. Work is underway with the remaining eight services through a series of improvement plans to get those to ‘great’ too."
        },
        {
            "heading": 2,
            "text": "Defra priority services"
        },
        {
            "text": "Beyond the ‘top nine services’, each Defra group organisation will have services that are a priority in terms of strategic importance for delivery of their outcomes."
        },
        {
            "text": "To better understand these priority services, we’re working together with Defra group senior leaders, our Business Relationship Managers, colleagues in the arms-length bodies and policy teams, to identify the priority services in each organisation with the ambition of ensuring we can get those to a ‘great’ standard too."
        },
        {
            "heading": 2,
            "text": "Service ownership"
        },
        {
            "text": "Service Ownership is essential to have the appropriate leadership in place to ensure public facing services meet evolving user, policy, operational and other needs. A service owner is a key role to enable service success and is someone that’s empowered to make decisions about a service to ensure it achieves its intended outcomes."
        },
        {
            "text": "Successful Service Ownership requires an inter-disciplinary way of working to develop a well-rounded approach to service design, delivery, and operations."
        },
        {
            "text": "We have started identifying service owners and are looking at how we can develop the Defra group service owner community to provide appropriate training and development for service owners to be successful in their role."
        },
        {
            "heading": 2,
            "text": "Defra Forms"
        },
        {
            "text": "Defra group has 700+ public-facing services on GOV.UK and 580 (83%) of these services are paper-based. We estimate that Defra handles around 14 million transactions per year that involve paper forms."
        },
        {
            "text": "Defra Forms will not just deliver a form builder as a technological solution, but a new approach for how Defra group can create, manage, and benefit from a consistent approaching to digital forms."
        },
        {
            "text": "Alongside the digitisation of forms, we will also look for opportunities to improve the user journey through user research and service design. We will also explore how the automation of back-end processes could reduce the manual burden on staff to validate and process data."
        },
        {
            "text": "My colleague Jenny blogged very recently about our Defra Forms project, which outlines how we are making our forms accessible and easy to use."
        },
        {
            "heading": 2,
            "text": "Website rationalisation"
        },
        {
            "text": "Across Defra group, we have over 300 stand-alone websites which are not hosted on GOV.UK. We’ll soon be starting work to audit these websites and, where possible, work with website owners and the Government Digital Service to transfer content and services to GOV.UK."
        },
        {
            "text": "This will help make it easier for users to find and access the services they need, as well as make the content and services Defra group provides more accessible for all."
        },
        {
            "heading": 2,
            "text": "Keeping you updated"
        },
        {
            "text": "I’m due to take nine months maternity leave from late February but my team will continue to keep you updated about the work to transform our services in Mission 1 of the strategy over the coming months."
        }
    ]
}