{
    "url": "https://publicguardian.blog.gov.uk/2024/01/05/power-of-attorney-stories-zoe/",
    "title": "Power of Attorney stories: Zoe ",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2024-01-05T15:05:32+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (LPA) allows you to nominate someone you trust, known as an attorney, to step in if you lack the mental capacity to make certain decisions yourself. They are legal documents that cover decisions about health and welfare, or property and finance."
        },
        {
            "text": "Zoe, 52 from Macclesfield, has worked as an audiologist in the NHS for 34 years. Whilst researching LPAs for her mother, Zoe learned that LPAs can be set up at any time and that people aged 18 and over can make one."
        },
        {
            "text": "Zoe's husband died 6 years ago, unexpectedly. She is mum to teenage twins, and a 21-year-old son who is autistic. Zoe has epilepsy and feels that this made it even more important to get an LPA in place to support her three children should anything happen to her."
        },
        {
            "text": "Zoe talked to us about how she began her LPA journey and why she has appointed her sister, Nina, as her attorney... "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How did you bring up the subject of an LPA and have the conversation with your loved ones? "
        },
        {
            "text": "I needed to know that someone would be there to sort my finances and make decisions on my behalf, should I ever be in a position where I can’t do this myself. Nina is already named in my will as the legal guardian of my children should anything happen to me, so this was an easy conversation to have."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How did you decide who your attorneys would be?"
        },
        {
            "text": "Nina seemed the most natural choice to be my attorney. We are twin sisters and have always been close since birth. We shared a bed when we were little and shared a room until we were 15 years old. Nina moved away when she got married at 21, but we visit each other regularly and talk on the phone several times a week. From standing up to other children at school when we were younger, to protesting together outside a kitchen showroom as adults after their appalling service, whatever life has thrown at me over the years, she has always been there to support me."
        },
        {
            "text": "When I sadly lost my husband, she dropped everything to come and be with me. Even though she lives 200 miles away, I know she is there if I need her."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why would you recommend others think about getting an LPA?"
        },
        {
            "text": "From personal experience, I have learnt that you never know what is round the corner. Luckily, I haven’t had the need to use my LPA so far, but I feel incredibly reassured that it is in place should the need arise."
        },
        {
            "text": "Having an LPA provides reassurance that, if someone needs to step in for me, then important decisions will be made by someone I trust implicitly and will have my best interests at heart. Although there is a financial cost to set it up initially, it works out a lot cheaper and faster than having to go through lengthy and expensive court processes. We always think that the worst won’t happen, but after experiencing the worst with the death of my husband, it has made me so much more aware that there are things I can do to safeguard mine and my children’s future."
        },
        {
            "text": "Zoe and Nina are one of the many families across England and Wales that have made an LPA. "
        },
        {
            "text": "It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today."
        },
        {
            "text": "Find out more at https://powerofattorney.campaign.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": " Mae atwrneiaeth arhosol (LPA) yn caniatáu i chi enwebu rhywun rydych chi’n ymddiried ynddo, a elwir yn atwrnai, i gamu i mewn os nad oes gennych alluedd meddyliol i wneud rhai penderfyniadau eich hun. Dogfennau cyfreithiol ydyn nhw sy’n ymdrin â phenderfyniadau ynghylch iechyd a lles, neu eiddo a chyllid.   "
        },
        {
            "text": "Bu Zoe, 52, o Macclesfield, yn gweithio fel awdiolegydd yn y GIG am 34 o flynyddoedd. Wrth ymchwilio i atwrneiaethau arhosol ar gyfer ei mam, dysgodd Zoe y gellir gwneud atwrneiaethau arhosol unrhyw bryd a bod pobl 18 oed a hŷn yn gallu gwneud un.  "
        },
        {
            "text": "Bu farw gŵr Zoe 6 blynedd yn ôl, yn annisgwyl. Mae hi’n fam i efeilliaid yn eu harddegau, ac i fab 21 oed sy’n awtistig. Mae gan Zoe epilepsi ac mae’n teimlo bod hyn yn golygu ei bod hyd yn oed yn bwysicach cael atwrneiaeth arhosol ar waith i gefnogi ei thri phlentyn os bydd unrhyw beth yn digwydd iddi. "
        },
        {
            "text": "Siaradodd Zoe â ni am sut y dechreuodd ar ei thaith atwrneiaeth arhosol a pham ei bod wedi penodi ei chwaer, Nina, yn atwrnai iddi...  "
        },
        {
            "heading": 3,
            "text": "Sut wnaethoch chi ddechrau'r sgwrs â’ch anwyliaid am atwrneiaeth arhosol? "
        },
        {
            "text": "Roedd angen i mi wybod y byddai rhywun yno i roi trefn ar fy arian a gwneud penderfyniadau ar fy rhan, pe bawn i byth mewn sefyllfa lle na allwn i wneud hyn fy hun. Mae Nina eisoes wedi’i henwi yn fy ewyllys fel gwarcheidwad cyfreithiol fy mhlant pe bai unrhyw beth yn digwydd i mi, felly roedd hon yn sgwrs hawdd i’w chael. "
        },
        {
            "text": "  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut wnaethoch chi benderfynu pwy fyddai eich atwrneiod?   "
        },
        {
            "text": "Nina oedd y dewis mwyaf naturiol i fod yn atwrnai i mi. Rydyn ni’n efeilliaid ac wedi bod yn agos ers i ni gael ein geni. Fe wnaethom rannu gwely pan oeddem yn fychan a rhannu ystafell nes i ni fod yn 15 oed. Symudodd Nina i ffwrdd pan briododd yn 21 oed, ond rydyn ni’n ymweld â’n gilydd yn rheolaidd ac yn siarad dros y ffôn sawl gwaith yr wythnos. O sefyll i fyny i blant eraill yn yr ysgol pan oeddem yn iau, i brotestio gyda’n gilydd y tu allan i ystafell arddangos ceginau fel oedolion ar ôl eu gwasanaeth dychrynllyd, beth bynnag y mae bywyd wedi’i daflu ataf dros y blynyddoedd, mae hi wastad wedi bod yno i’m cefnogi. "
        },
        {
            "text": " Pan gollais fy ngŵr yn anffodus, gollyngodd bopeth i fod gyda mi. Er ei bod yn byw 200 milltir i ffwrdd, rwy’n gwybod ei bod hi yno os oes ei hangen arnaf. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam fyddech chi’n argymell bod pobl eraill yn meddwl am gael atwrneiaeth arhosol?   "
        },
        {
            "text": "O brofiad personol, rydw i wedi dysgu nad ydych chi byth yn gwybod beth sydd ar y gorwel. Yn ffodus, dydw i ddim wedi cael yr angen i ddefnyddio fy Atwrneiaeth Arhosol hyd yma, ond rydw i’n teimlo’n dawel fy meddwl ei bod yno os bydd angen.  "
        },
        {
            "text": "Mae cael atwrneiaeth arhosol yn rhoi sicrwydd, os bydd angen i rywun weithredu ar fy rhan, y bydd penderfyniadau pwysig yn cael eu gwneud gan rywun rydw i’n ymddiried ynddo ac y bydd yn gofalu am fy lles gorau. Er bod cost ariannol i’w sefydlu i ddechrau, mae’n llawer rhatach ac yn gyflymach na gorfod mynd drwy brosesau llys hirfaith a drud. Rydyn ni bob amser yn meddwl na fydd y gwaethaf yn digwydd, ond ar ôl profi’r gwaethaf gyda marwolaeth fy ngŵr, mae wedi fy ngwneud i’n llawer mwy ymwybodol bod yna bethau y gallaf eu gwneud i ddiogelu fy nyfodol i a dyfodol fy mhlant. "
        },
        {
            "text": "Mae Zoe a Nina yn un o’r llu o deuluoedd ledled Cymru a Lloegr sydd wedi gwneud LPA. "
        },
        {
            "text": "Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. Dechreuwch sgwrs heddiw. "
        },
        {
            "text": "Cewch ragor o wybodaeth yn https://powerofattorney.campaign.gov.uk"
        }
    ]
}