{
    "url": "https://space.blog.gov.uk/2024/01/05/space-for-our-future-uk-space-conference-focuses-on-closing-the-uk-space-sectors-skills-gap/",
    "title": "Space for our future: UK Space Conference focuses on closing the UK space sector’s skills gap",
    "authors": [
        "Bray Leino"
    ],
    "categories": [
        "Careers",
        "Championing Space",
        "Education"
    ],
    "pub_date": "2024-01-05T11:21:17+00:00",
    "content": [
        {
            "text": "This year, the UK Space Agency reported more than half of UK space sector businesses are suffering a skills shortfall that they say is impacting performance and growth. The global space sector is brimming with opportunity and the UK is set to benefit as an international hub of technological engineering and innovation, but we must take action to reduce the skills deficit."
        },
        {
            "text": "The UK Space Conference is the premier, biennial event for the UK space sector. This year it took place from 21 to 23 November in Belfast, and unpicking the skills challenge in the UK space sector was a key focus."
        },
        {
            "text": "The event showcased a raft of initiatives linking the space industry to the next generation of talent, providing practical knowledge and experience, and offering routes into the sector for the UK’s best and brightest."
        },
        {
            "heading": 2,
            "text": "Space Placements in Industry (SPIN)"
        },
        {
            "text": "The SPIN programme offers young people the opportunity to get vital experience in the industry as part of a funded placement with a UK business. The UK Space Conference hosted 67 ‘SPINterns’ from the class of 2023 to share their experiences of the scheme and meet prospective employers."
        },
        {
            "text": "Queens University Belfast student Alex Dunne has just completed his placement with Technical Metals Group (TMG), a Belfast business who manufacture high-precision components, some of which are currently in use on Mars Curiosity Rover and on their way to Jupiter on the ESA’s Jupiter Icy Moons Explorer (Juice). Alex says the experience has filled him with confidence."
        },
        {
            "text": "Alex Dunne said: “My 8 weeks with TMG have instantly become the centrepiece of my resume when applying for any job in the space industry. Interest in space is at an all-time high and that is definitely being felt among my peers. At Queens University Belfast I am involved in the running of the Aerospace Society, working to connect that interest with the opportunities that are available.”"
        },
        {
            "text": "Daire O'Dubhthaigh, Research and Development Manager at Spring Co, part of TMG, says their SPIN experience has been excellent and Alex has brought a genuine passion for the space sector."
        },
        {
            "text": "Daire O'Dubhthaigh said: “We had around 30 applications for 1 place, mainly from the 2 universities in Northern Ireland. I think we were the only business in the region involved this year, so I think that’s a call to more Northern Ireland companies to look at SPIN next year.”"
        },
        {
            "text": "The UK Space Agency has recently announced over £650,000 in grant funding to the Satellite Applications Catapult to host a record number of SPINtern placements. With Satellite Applications Catapult managing the SPIN Programme from end-to-end, this will fund 120 UK Space Agency SPINtern placements, alongside a new student recruitment system to reduce bias, improve quality of hire, and increase diversity across the cohort. The funding opportunity for placement hosts is now open. You can now apply via the Satellite Applications Catapult website, where you will also find guidance for prospective host organisations."
        },
        {
            "text": "Find out more about SPIN."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "UK Space Conference Bursary programme"
        },
        {
            "text": "The take up for this year’s bursary programme was phenomenal, and gave 10 students the full UK Space Conference experience. Thanks to bursary sponsor DSTL for making it possible. This fully funded package is a golden ticket for young people keen to meet prospective employers and hear our sector’s leaders laying out the roadmap for the future."
        },
        {
            "heading": 3,
            "text": "Outreach Programme"
        },
        {
            "text": "UK Space Conference welcomed 450 pupils, aged 9-11, from the local Belfast area to experience a morning of interactive, educational, and hands on activities to help them understand the career possibilities in STEM. The children had the opportunity to get stuck in, building rockets, landing spacecraft, and even had a chance to be part of their favourite sci-fi film."
        },
        {
            "text": "UK ESA astronaut John McFall took part in the Outreach Programme. He spoke about his experience as an astronaut with a disability, and helped them build rockets."
        },
        {
            "text": "Find out more about the Outreach Programme."
        },
        {
            "heading": 3,
            "text": "UK Race to Space"
        },
        {
            "text": "A UK-wide initiative to increase the number of skilled graduates entering the UK space sector, UK Race to Space incorporates a raft of extra-curricular rocketry projects, enabling students to get hands on with the technical capabilities needed for a successful career in the sector. Dr Alistair John, the initiative’s academic supervisor, joined the UK Space Conference to explain more about UK Race to Space and build vital bridges between industry and education."
        },
        {
            "text": "Find out more about the UK Race to Space."
        },
        {
            "heading": 3,
            "text": "Project Sunride"
        },
        {
            "text": "The UK Space Conference welcomed members of the team behind the University of Sheffield’s Project Sunride, a group that represents undergraduates and masters students from over 20 countries. They maintain multiple rocketry programmes and aim to be the first student-led team to launch a rocket beyond the Kármán line (100km above sea level)."
        },
        {
            "text": "Find out more about Project Sunride."
        },
        {
            "text": "The UK Space Conference gathered business leaders, military, lawmakers, and academics from across the UK’s rapidly growing space sector. One of the big discussion points at this year’s event was how we safeguard the future of our industry and ensure a healthy pipeline of skills to build on the UK’s reputation as a centre for technology and innovation."
        },
        {
            "text": "View the UK Space Conference programme."
        },
        {
            "text": "The next decade will take humanity to amazing places. The UK needs to invest in the future to make sure we are part of the journey."
        }
    ]
}