{
    "url": "https://defradigital.blog.gov.uk/2022/04/02/ramadan-what-it-means-to-me/",
    "title": "Ramadan: what it means to me",
    "authors": [
        "Afshan Khan"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra Science and Innovation"
    ],
    "pub_date": "2022-04-02T08:00:59+01:00",
    "content": [
        {
            "text": "Hi, I'm Afshan, and I joined Defra in December 2020 during lockdown, after working at the Houses of Parliament, the Royal Courts of Justice and then the Department for Transport (DfT) for nine years. At the Department for Transport, I was Co-Chair of the DfT Muslim Network, and an Executive Member of the Civil Service Muslim Network."
        },
        {
            "text": "I think it’s important to learn about each other and equally to feel like we can bring our whole selves to work. Although having joined Defra during lockdown, I was quickly welcomed to the team and noticed how important inclusivity is in Defra. I hope sharing my experiences will be educational to others and encourage discussion around what’s important to each of us."
        },
        {
            "heading": 2,
            "text": "Ramadan – more than just fasting, don’t you know"
        },
        {
            "text": "Today marks the start of Ramadan, the ninth month in the Islamic calendar and one of the holiest months of the year for Muslims. Ramadan officially begins when the month of Shaban, the eighth month of the Islamic (Hijri) calendar, ends. As the Islamic calendar is based around the lunar cycle, Ramadan rotates by approximately ten days each year.\nRamadan is a time of spiritual reflection, of self-improvement, and worship, as well as the most known action – fasting from sunrise to sunset."
        },
        {
            "text": "I often get asked about Ramadan – why do Muslims stop eating during Ramadan? No water either? How do you do it? Why do you do it?"
        },
        {
            "text": "The reality is that there’s more to Ramadan than refraining from eating and drinking – I find that’s actually the easiest part! There’s a bigger goal to refine and refresh ourselves, both physically and mentally – a way of recharging our spiritual batteries once a year."
        },
        {
            "heading": 2,
            "text": "A time for reflection"
        },
        {
            "text": "For me, Ramadan is about reflecting on how I live my life, what I’ve done since last year’s Ramadan and what I can improve on after this one passes. If there’s something I’ve changed for the better during Ramadan, then why was I doing it at all?"
        },
        {
            "text": "It teaches me to be grateful for the opportunities and resources that are available to me – and gives me a taste of what life would be like without them."
        },
        {
            "text": "During Ramadan, I take more time out to read the Qur’an, give more money to charity, spend more time praying at the Mosque and prepare meals for those in need. There are many lessons to be learned from this, and as a result I try to contemplate, change my behaviour, and increase my good deeds. For example, I need to be extra conscious of my actions: no lying, swearing (remember, just examples…)."
        },
        {
            "heading": 2,
            "text": "Coming back down to earth"
        },
        {
            "text": "Fasting, from sunrise to sunset, gives me a snapshot of what it’s like to go hungry, without the ease of walking to the fridge to see what takes my fancy. I can’t just turn the tap for a drink of water when I’m thirsty, and that reminds me of all those around the world who walk miles for access to their supply of water."
        },
        {
            "text": "Inevitably, I develop sympathy for the less fortunate, and learn to appreciate things I normally take for granted."
        },
        {
            "text": "As well as teaching me self-control, fasting gives me a break from any bad habits and my body gets a detox from the effects of any unhealthy eating or overindulgence. This is because during a fast, the body uses up its store of glucose (our usual source of energy), and once this runs out, it dissolves any extra fats."
        },
        {
            "text": "Kidneys are very efficient at maintaining the body’s water and salts, and because we are still eating two times a day (hopefully healthily), it’s very unlikely that our bodies will suffer – in fact, it’s a great way of reducing cholesterol and blood pressure levels. Woohoo!"
        },
        {
            "heading": 2,
            "text": "Adapting to the change in my usual routine is key"
        },
        {
            "text": "One thing that I do find difficult though, is the lack of sleep. Eating, sleeping, and praying later than usual, and waking up earlier than usual to eat, makes for a very tired Afshan. However - I have a Ramadan strategy! I’ve agreed a flexible working pattern for Ramadan with my Line Manager, which allows me to catch up on myself."
        },
        {
            "text": "What I’m really looking forward to though, is the end of each day when the fast is broken with prayer and a meal called the Iftar. Not just because we get to eat, but because I get to spend quality time with my family. We don’t usually get to spend dinner times together due to our different schedules and work patterns – be assured that we get a full table every single night during Ramadan!"
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "The Civil Service Muslim Network (CSMN) is the sole, cross-government, departmental umbrella network representing and supporting departmental Muslim networks and civil servants. CSMN’s vision is to help create a truly inclusive workplace where civil servants of all backgrounds fulfil their potential and thrive, where every voice is heard, to deliver world-class policy and public services. A Civil Service that mirrors the rich diversity of the public it serves."
        },
        {
            "text": "Find out how you can support your colleagues and friends during Ramadan by checking out their Blog."
        }
    ]
}