{
    "url": "https://giaa.blog.gov.uk/2022/04/26/benefiting-from-shared-parental-leave/",
    "title": "Benefiting from shared parental leave",
    "authors": [
        "Steve Wright"
    ],
    "categories": [
        "Internal Audit",
        "People"
    ],
    "pub_date": "2022-04-26T11:28:46+01:00",
    "content": [
        {
            "text": "In 2021, I became a dad, and I soon realised the benefits that shared parental leave can offer civil servants like me."
        },
        {
            "text": "My journey to fatherhood took nearly 15 years. My life changed positively forever in July 2021 with the arrival of baby Iris. I am glad that having access to Shared Parental Leave (SPL) enabled me to spend 6 months concentrating on nurturing a very special small person, before returning to work and focusing on my career at the Government Internal Audit Agency (GIAA)."
        },
        {
            "text": " "
        },
        {
            "text": "Although SPL is still often seen as a relatively new idea, it is a concept that’s been engrained in some cultures for decades. For example, in Sweden, leave is paid out for 480 days (approximately 16 months) for each child and parents are encouraged to share that leave to help support and promote gender equality."
        },
        {
            "text": "In the UK, Shared Parental Leave was introduced back in 2015. Arrangements are incorporated into HR policies across the Civil Service. In the GIAA, eligible employees can opt to share parental leave for up to 39 weeks, including 26 weeks at full pay and 13 weeks of statutory pay."
        },
        {
            "text": "In deciding whether to take SPL, couples need to consider several factors, including their respective income levels, career progression opportunities and other caring arrangements."
        },
        {
            "text": "In my case, we worked out that we would be no worse off if I took 6 months off as SPL because my partner is self-employed, so she doesn’t get paid when she doesn’t work. By combining my shared parental leave with two weeks of statutory paternity leave and some annual leave, I could be at home to support our family for nearly 24 weeks."
        },
        {
            "text": "Applying for the leave was easy. I just followed the internal GIAA process and made a declaration to the Department for Work and Pensions that we intended to invoke our entitlement to take up SPL. I then agreed a start date with my line manager so that my work could be shared between my team colleagues. I was glad that I started my leave a few weeks before our due date because it provided a more effective buffer between the end of work and the start of parenthood. This gave me time to buy and fit child seats, build a pram, and consider what to include in a hospital bag (top tip: “dad snacks”). I am glad that I didn’t work right up to the wire, with the risk that things would be left in the air if baby had come early."
        },
        {
            "text": "I joined the GIAA in late 2019 just a few months before we all moved into temporary home working because of the pandemic. Like many, I enjoyed getting to know my geographically dispersed colleagues through online meetings. After starting my leave, it remained very easy for me to keep in touch and join in our virtual ‘watercooler moment’ team calls in the run-up to, and in the months after Iris was born. My team was like a close-knit village when it came to raising the baby with helpful advice about how I could deal with her first cold."
        },
        {
            "text": "After working hard in 2020/21, I was worried that being ‘away’ for six months would make me relatively invisible, and less eligible for progression. A new deputy director was joining the Agency and I wouldn’t meet them as I would be away. I spoke to several senior managers about my fears in this area. They reflected that I had taken the decision to prioritise my new family and that work would patiently wait for me on my return, and that the time away would be shorter than I thought."
        },
        {
            "text": "They were right of course. I felt supported by my managers and my colleagues whilst away. I was able to maintain and develop professional relationships through periodic engagements at times scheduled to suit me. I didn’t feel pressured to be doing anything work-related whilst I was away, and I scaled down some of my ambitions for what I’d do in my ‘time off’. I did however manage to learn all the verses of ‘Hickory Dickory Dock’."
        },
        {
            "text": "When my partner and I returned to work, we tried juggling our responsibilities by being clearer about who was doing what and when. It didn’t always work out and some of my work meetings enjoyed having Iris as a ‘special guest’. The fact that no-one had a problem with that reflects how well our hybrid working environment accommodates caring responsibilities."
        },
        {
            "text": "Now that I’ve been back at work for a few months, I’m aware of time and am more disciplined when immersing myself in work and knowing when to close the laptop screen and get involved with bath and bedtime routines. Working at home allows me to have a quick cuddle with Iris between meetings. Equally, when I’m at the office, I can enjoy some baby-free time and have slightly more mature conversations with my work pals."
        },
        {
            "text": "About a month after I returned, a promotion opportunity arose which would play to my strength areas, and I was successful at securing the role. I’m so happy now because it enables me to stay close to my existing team whilst also helping to develop our longer-term capabilities for specialist audit."
        },
        {
            "text": "All my dad friends have said they wish they’d been able to spend more time with their children at a very early stage. I very strongly recommend that prospective parents should consider shared parental leave as an option for enabling what could be a once-in-a-lifetime opportunity to be there when a new family unit is formed."
        }
    ]
}