{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/26/could-you-be-a-future-leader/",
    "title": "Could you be a Future Leader?",
    "authors": [
        "Emily Prema"
    ],
    "categories": [
        "GSE Opportunities",
        "Guest Blog",
        "Talent & Leadership"
    ],
    "pub_date": "2022-04-26T14:10:40+01:00",
    "content": [
        {
            "text": "What is the Future Leaders Scheme (FLS)?"
        },
        {
            "text": "The FLS is a cross-Government development scheme for high-potential grade 6 and 7 civil servants. It provides a leadership development curriculum, which supports civil servants in accelerating their development, as well as learning more about their personal leadership effectiveness."
        },
        {
            "text": "The programme includes a combination of taught learning and self-led development. Activities include webinars, workshops, action learning sets, along with group executive coaching and senior sponsorship."
        },
        {
            "text": "Learn more about the experiences of some colleagues taking part in the FLS from the Animal and Plant Health Agency (APHA)."
        },
        {
            "text": " "
        },
        {
            "text": "Francesca Martelli, Workgroup Leader for Field Epidemiology and Surveillance (Bacteriology Department)"
        },
        {
            "text": "Please give us a brief description of your career in government so far."
        },
        {
            "text": "I started my career in government 11 years ago as a junior scientist at APHA. As a veterinarian with a PhD, I have developed my career within the agency and now I lead a team of 35 people which produces applied research, outbreak investigation, and policy advice in the field of food safety and antimicrobial resistance."
        },
        {
            "text": "What attracted you to the scheme in the first place and how do you hope it will shape your career?"
        },
        {
            "text": "I think the Future Leader’s Scheme is great to understand your strengths as a manager (as well as exploring your weaknesses!), and to get exposure to the wider Civil Service. It allowed me to meet many people from other departments and get an insight into their work. This exposure is important in order to see the business from a different perspective, and I think it will make me more rounded in my current role and beyond."
        },
        {
            "text": "Please tell us about one major thing you have learnt from your time so far in the scheme."
        },
        {
            "text": "I have learnt that the doubts and insecurities I have about my role as a leader are common to most participants on the scheme. Many of us feel like “impostors”, and the programme is helping us to realise that this is normal and how to cope with it."
        },
        {
            "text": "What advice would you give to others if they are considering applying to the scheme?"
        },
        {
            "text": "Go for it! It will broaden your views and help you understand your strengths and weaknesses. Professionals are welcome on the scheme, and this training (which is a significant investment by your department) can only add to your knowledge and expertise and help you to become a more rounded vet working in government."
        },
        {
            "text": "You might be interested in reading Francesca’s earlier blog, at the time she started the scheme, on the Government Vets blog site."
        },
        {
            "text": " "
        },
        {
            "text": "Sharon Brookes, Lead Scientist for the Animal and Zoonotic Virial Diseases Portfolio "
        },
        {
            "text": "Please give us a brief description of your career in government so far."
        },
        {
            "text": "I am a research virologist with over 30 years’ experience, I joined APHA in 2001 as a post doc (Higher Scientific Officer) and progressed to my current role in 2019 as the Lead Scientist (Grade 6) for the Animal and Zoonotic Virial Diseases Portfolio, trading front line activities for a more strategic role in the Government Science Profession."
        },
        {
            "text": "What attracted you to the scheme in the first place and how do you hope it will shape your career?"
        },
        {
            "text": "I was interested in working more closely with Defra and across other Government Departments, thinking about senior civil service roles for the future and improving my leadership skills especially in relation to working with diverse networks, influencing evidence and policy, and providing insight and support for colleagues at APHA through learning and development via coaching, mentoring and continuing professional development (CPD)."
        },
        {
            "text": "Please tell us about one major thing you have learnt from your time so far in the scheme."
        },
        {
            "text": "I was in the 2019/2020 cohort and have made some great contacts across government. This network helps me to improve my functionality in the current role both at APHA and as a representative of our organisation. It allowed me to develop a group of mentors and coaches for myself, from APHA to Defra Forestry, the Chief Veterinary Officer and BEIS Science and Innovation. The benefits of which I have passed onto others at APHA. But the major benefit has been the DELTA group – Disability Empowers Leadership Talent, where members of the FLS can sign-up for additional support for those with disabilities and/or long-term health conditions, including interaction with the most senior civil servants as role models."
        },
        {
            "text": "There is also a META group, Minority Ethnic Talent Association providing additional support and access to specific role models."
        },
        {
            "text": "What advice would you give to others if they are considering applying to the scheme?"
        },
        {
            "text": "If you have an interest in career progression, leadership and appreciation of diverse contributions to careers in the Civil Service including the Government Science and Engineering profession then get to know the scheme, find a sponsor who has some insight into the processes of competitive entry onto the scheme (440 accepted out of 2500 applicants).  Commit to the training over two years with a whole future of benefit for you and the investment in you. It has helped me transition from a Work Group Leader to a Lead Scientist who engages with a broad range of key stakeholders (including Defra, BEIS, FSA, Go-Science and more) while maintaining my sciences base."
        },
        {
            "text": " "
        },
        {
            "text": "Fin Twomey, Head of Surveillance Intelligence Unit"
        },
        {
            "text": "What attracted you to the scheme in the first place and how do you hope it will shape your career?"
        },
        {
            "text": "I became aware of FLS around the time that I was moving from roles that required expertise in veterinary science to leadership positions and I saw the programme as an opportunity to develop my leadership skills. However, it has exceeded my expectations. Not only has it provided leadership training, it has also widened my Civil Service network, enhanced my awareness of the work of other Civil Service departments, and allowed me to become involved in other Civil Service initiatives."
        },
        {
            "text": "Please tell us about one major thing you have learnt from your time so far in the scheme."
        },
        {
            "text": "It’s difficult to focus on just one thing as FLS offers so much over the 2-year programme. One of the benefits of FLS is that it is a cross-Civil Service development scheme, so it was great to have the opportunity to meet people from across the wider Civil Service who were very supportive as a group. In particular, I learnt that many departments face similar challenges, albeit within a different context, and that people are willing to share their experiences of how they approached those challenges."
        },
        {
            "text": "What advice would you give to others if they are considering applying to the scheme?"
        },
        {
            "text": "I would encourage anyone who is interested in developing their leadership skills to find out more about FLS either through the resources available online or by speaking to someone who has been on the scheme. Learn about the offer and ensure it meets your needs. Be aware of the time commitment and ensure you are willing to put in the time to get the most from this generous training offer. And finally, if you do join the scheme, enjoy this unique opportunity to learn with others."
        },
        {
            "text": " "
        },
        {
            "text": "Get involved!"
        },
        {
            "text": "Hopefully this blog has given you a good insight into what you can gain personally and professionally from applying to the FLS. You can apply for the FLS and associated schemes through the Civil Service-Learning website: https://learn.civilservice.gov.uk/"
        },
        {
            "text": "The Accelerated Development Schemes (ADS), sit within the Government Skills and Curriculum Unit in the Cabinet Office. The unit has provided talent development schemes to the Civil Service since 2003 with the aim of building a strong, diverse and robust pipeline for the most senior roles in the Civil Service."
        },
        {
            "text": "Two main schemes are on offer:"
        },
        {
            "text": "·        Future Leaders Scheme (FLS) for grade 7 & 6;"
        },
        {
            "text": "·        Senior Leaders Scheme (SLS) for SCS1."
        },
        {
            "text": " "
        },
        {
            "text": "Apply Now!"
        },
        {
            "text": "The FLS and the SLS sit alongside the High Potential Development Scheme (Directors - SCS2) to form the accelerated development schemes. Online applications for year 2022 intake are open now and close on 29th April. "
        },
        {
            "text": "To apply, please visit Civil Service Learning for FLS and SLS."
        },
        {
            "text": " "
        },
        {
            "text": "Stage one of the selection process is an online application which requires you to complete a diversity questionnaire, situational judgement test, leadership potential questionnaire, learning and adapting questionnaire and a candidate statement. All the assessments during stage one are untimed. You will also be asked to nominate a sponsor to validate your eligibility and application, which should be your line manager."
        },
        {
            "text": "If you are successful at stage one, you will be invited to interview which will assess against the Model of Potential: Purpose, Values and Performance."
        },
        {
            "text": "Interviews will be conducted between 27th June – 5th August.   "
        },
        {
            "text": " "
        },
        {
            "text": "If you have any questions and/or need further help during the application process, please feel free to contact us at gse@go-science.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": "Blog written by Emily Prema"
        },
        {
            "text": "A Defra Summer Diversity Internship Programme (SDIP) member, 2021."
        },
        {
            "text": "https://www.faststream.gov.uk/summer-diversity-internship-programme/index.html"
        }
    ]
}