{
    "url": "https://socialcareinspection.blog.gov.uk/2022/04/26/enduring-positive-relationships-must-be-at-the-heart-of-the-care-system/",
    "title": "Enduring, positive relationships must be at the heart of the care system",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care leavers",
        "Care Review",
        "social care professionals"
    ],
    "pub_date": "2022-04-26T15:00:17+01:00",
    "content": [
        {
            "text": "Yvette Stanley, Ofsted’s National Director for Regulation and Social Care, considers the recent All-Party Parliamentary Group Spotlight Inquiry and reflects on how independent visitors can be an important source of lasting friendship and support for children in care."
        },
        {
            "text": "We have known for some time that this is likely to be a watershed year for children’s social care, as we await the outcome of the Care Review. The review has generated some fevered debate and, at times, some controversy. There has been no shortage of differing views about why there are shortfalls in the system and the solutions that will lead to improvement for children and families."
        },
        {
            "text": "But there has been one issue that has broad agreement. Josh MacAlister, Chair of the Care Review, has been absolutely right to highlight that the care system too often fails to protect, develop and sustain the important relationships in the lives of looked after children and care leavers."
        },
        {
            "text": "Our ‘Matching in foster care’ research in 2020 found that more could be done to keep children in touch with previous foster carers who were important to them. More recently, our ‘Ready or not’ report highlighted how many care leavers felt alone or isolated when they left care. A third of care leavers told us that they did not know where to get help or support. These issues have profound and serious implications for children and young people."
        },
        {
            "text": "A member of the Care Review’s ‘Experts by Experience’ board, Mags Mulowski, explored those implications recently in a thoughtful blog on the importance of relationships. As Mags succinctly put it, ‘We need to place relationships front and centre of children’s social care’."
        },
        {
            "text": "The Spotlight Inquiry – a timely and important report"
        },
        {
            "text": "February’s Spotlight Inquiry, like the Care Review, focuses sharply on relationships and the importance of helping children and young people to make close connections in their communities."
        },
        {
            "text": "It is a timely report and makes the important point that positive relationships and a sense of belonging cannot happen in isolation. The care system needs to provide stability and continuity for children and young people where they live, and where they learn or work. Unless there are exceptional circumstances, children need to stay close to the people who are important to them. They need access to effective support for their physical and emotional health when they need it. Children need help to understand their life stories."
        },
        {
            "text": "But, as I and many others have said before, unless wider systemic issues are resolved, too many children and young people will continue to live far from family and friends. Too many social workers will struggle to find time to work directly with children. Children and young people will continue to wait too long for help for their emotional health."
        },
        {
            "text": "The inquiry makes several recommendations for Ofsted. These include details on how inspections should address the quality of life-story work and the impact of lead members of children’s services on corporate parenting. We do look at these areas during our inspections. But, we will look carefully at the recommendations, along with any that may be made in the upcoming Care Review, when considering how to improve our inspections ‘in the round’."
        },
        {
            "text": "Independent visitors"
        },
        {
            "text": "Independent visitors are trained volunteers who can become friends to children and young people in care and take a long-term interest in their lives. The inquiry found a general lack of awareness and uptake of independent visitors across different regions."
        },
        {
            "text": "This finding chimes with our own evidence that the independent visitor role benefits far too few children and young people. We have made this clear in our contributions to the Care Review. The level of attention given to independent visiting services can provide a strong indicator of the importance that local authorities place on children’s relationships."
        },
        {
            "text": "Over several years, we’ve seen that the priority given to the service varies significantly between local authorities, despite the legal duty to appoint an independent visitor when it’s felt to be in a child’s best interests. This is a real shame – an independent visitor can bring something different and hugely valuable to children. They lie outside the network of professionals that often surrounds children in care and care leavers."
        },
        {
            "text": "Another recommendation for Ofsted from the Spotlight Inquiry proposes that inspectors should assess a local authority’s independent visiting services against the standards developed by the National Independent Visitor Network. While not legally enforceable, we agree that they are a useful benchmark for local authorities to consider when developing and monitoring their independent visitor services."
        },
        {
            "text": "We were very pleased to work recently with the National Independent Visitor Network by contributing to a short video about the value an independent visitor can bring to children’s lives. In particular, it describes why our inspectors are keen to see, and report on, that positive impact. It’s an important part of our local authority inspections."
        },
        {
            "text": "As the video shows, independent visitors are a wonderful source of enduring friendship and support for children. They help to build children’s confidence and trust – while doing things together that they both enjoy!"
        },
        {
            "text": "Relationships enrich lives"
        },
        {
            "text": "Social capital, interdependence, connectivity – whatever terminology we use, positive relationships matter. They enrich lives. They should be at the heart of a nurturing care system. It’s quite right that, in turn, they should be central to our inspections and what we look for in good corporate parents."
        }
    ]
}