{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/26/hse-construction-engineering-specialist-inspector-seo/",
    "title": "HSE: Construction Engineering Specialist Inspector- SEO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-04-26T19:43:02+01:00",
    "content": [
        {
            "text": "At HSE, we work with one goal in mind – to help keep Britain’s workforce safe and healthy. Our work touches virtually every sector of Great Britain’s industry. Combining specialists from numerous fields, we strive to keep people and their working environments safe."
        },
        {
            "text": "We don’t just inspect workplaces and implement the law, we campaign for better H&S practice, we craft and review guidance and regulations, we provide specialist products and services both here and overseas, and we produce crucial research and statistics – all towards our goal of helping Great Britain work well."
        },
        {
            "text": "Our Civil and Structural Engineers help to ensure employers across Great Britain in a range of essential industries work safely. In this role, you can utilise your technical knowledge and practical experience to influence not only individual employers but whole industry sectors."
        },
        {
            "text": "A career with HSE gives you a rare opportunity to visit and interact with different and diverse employers and work activities, one day you could be inspecting at a large construction project and the next investigating an incident at a small extension."
        },
        {
            "text": "You’ll work alongside other technical specialists to ensure the work activities of those we regulate are operating within the legislative framework by inspecting, investigating, and assessing companies."
        },
        {
            "text": "Your work with HSE will make the most of your experience – whether that’s evaluating the guidance being given to the emergency services in a rescue situation after an incident, identifying the cause of a structural collapse or providing technical assistance to colleagues undertaking complex investigations into serious incidents involving plant and equipment. This role will broaden your knowledge and challenge your engineering skills."
        },
        {
            "text": "For more information including detailed job description and how to apply, please click here"
        },
        {
            "text": "Deadline: Sunday 22nd May 2022 11:55pm"
        }
    ]
}