{
    "url": "https://civilservice.blog.gov.uk/2022/04/26/inside-policy-helping-school-leaders-and-teachers-thrive/",
    "title": "Inside Policy: Helping school leaders and teachers thrive ",
    "authors": [
        "Katie Tyson",
        "Amy Collins"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-04-26T08:45:35+00:00",
    "content": [
        {
            "heading": 3,
            "text": "With a heavy workload comes an impact on wellbeing. In recent years, teachers have consistently cited their volume of workload as the main reason for leaving their job, Katie Tyson and Amy Collins are spearheading work to tackle this issue."
        },
        {
            "text": "Workload has been a knotty problem in the teaching profession for years,  leading to teacher burnout and even being given as the number one reason for leaving the profession. It’s also intrinsically linked to wellbeing. "
        },
        {
            "text": "Research on the wellbeing of education staff had found that workload reduction was seen as one of the top solutions to improve both mental health and staff wellbeing."
        },
        {
            "text": "Here, at the Department for Education’s Teacher Wellbeing, Workload and Impact on Schools Team, we work to reduce pressures on schools, delivering support to help drive down the numbers of teachers leaving the profession, by removing unnecessary workload, such as helping to cut the amount of time spent on tasks outside the classroom, like marking and planning ."
        },
        {
            "text": "Underpinned by robust evidence from international and national surveys, anecdotal evidence and continued engagement with the schools sector, our team focuses on supporting teachers and leaders to stay and thrive in education. That way, they can concentrate on what really matters: improving pupil outcomes and their own professional development."
        },
        {
            "heading": 4,
            "text": "Positive impact"
        },
        {
            "text": "Before COVID-19, joint action from schools, the DfE and other stakeholders had started to make a positive impact."
        },
        {
            "text": "In 2018, we published three independent reports on marking, data and planning which offered tips and shared best practice in these areas to reduce workload. Tips included planning collaboratively with other teachers to share and gain expertise. They helped to dispel myths that often lead to increased workload, such as those around Ofsted’s expectations."
        },
        {
            "heading": 4,
            "text": "Reduce workloads"
        },
        {
            "text": "We also launched our workload reduction toolkit for schools and accompanying national events to display its content.  Working with school leaders, we provided a host of resources and examples of best practice, such as model communication policies, for schools to adapt and use to reduce workloads."
        },
        {
            "text": "Our research also showed schools worked incredibly hard to take action to reduce workload. This included reviewing their own policies, consulting with staff and introducing wellbeing programmes."
        },
        {
            "text": "As well as this, in 2019, a recognition of wellbeing challenges led us to convene an Expert Advisory Group on Staff Wellbeing to study how to improve and promote wellbeing for teachers and leaders."
        },
        {
            "heading": 4,
            "text": "Wellbeing issues"
        },
        {
            "text": "However, whilst teachers and leaders continued to do an outstanding job, there’s no doubt that the pandemic intensified workload and wellbeing issues for teachers. "
        },
        {
            "text": "In June 2020, the co-creation of the charter with the education sector and mental health experts moved online. Headteachers and representatives from charities and unions were invited to log on to share their valuable expertise."
        },
        {
            "text": "By signing up to the charter, schools and colleges can demonstrate they are dedicated to improving and protecting staff wellbeing and hold themselves accountable to meeting their commitments in the charter. This sends a message to everyone working in schools and colleges that their mental health and wellbeing matters."
        },
        {
            "heading": 4,
            "text": "COVID-19 "
        },
        {
            "text": "Early in the pandemic, we recognised the need to increase and adapt our wellbeing support to schools. Hearing first-hand from leaders, we knew their mental health and wellbeing had been impacted by COVID-19. "
        },
        {
            "text": "In June 2020, we launched a pilot from the charity Education Support to provide peer-support and one-to-one supervision from experts to more than 250 school leaders. "
        },
        {
            "text": "As the pandemic progressed, teachers and leaders continued to provide vital support for children and learners throughout the upheaval. We provided additional funding to extend the programme until 31 August 2021, enabling an extra 160 school leaders to benefit from this important support."
        },
        {
            "text": "We’re now building on this with a longer-term programme of professional supervision, counselling and peer support for around 2000 school leaders from autumn 2021, reaching  those who need support most."
        },
        {
            "heading": 4,
            "text": "Delivering support"
        },
        {
            "text": "Just like before the pandemic, our school-led resources are integral to our work. This includes updating our Workload Reduction Toolkit, developed alongside school leaders, to reflect developments in their practice. "
        },
        {
            "text": "With travel severely restricted during the pandemic, we moved our successful workload reduction events online. Sessions delivered previously in conference rooms in London and Manchester, soared in popularity and anyone in the country could sign up. This allowed even more teachers and leaders across the country to learn from each other about strategies to reduce workload and improve wellbeing when they needed it most."
        },
        {
            "text": "We’re also running a series of school-based research projects. These involve schools undertaking projects to explore how to stop certain activities that they’ve identified create unnecessary workload, or carrying out tasks differently to reduce workloads. Topics range from marking and feedback to data recording to communications policies!"
        },
        {
            "heading": 4,
            "text": "Working with stakeholders "
        },
        {
            "text": "Throughout our work, a key element involves collaborating with stakeholders from the schools sector.  We work across teams in the department to embed workload and wellbeing at the heart of everything we do to support implementation of ministerial priorities. "
        },
        {
            "text": "We also take great pride working directly with teachers and leaders, many of whom have supported our work over many years. We’re proud of our reach, impact and engagement – especially when a teacher or leader gets in touch out of the blue, to say how useful our products are and what a difference it made to their own or their school’s workload and wellbeing. It helps us ensure we’re giving support in the right way."
        },
        {
            "heading": 4,
            "text": "Next steps"
        },
        {
            "text": "We will stay focused on understanding the drivers of workload and wellbeing, evaluating the success of our work through research and surveys and engagement with the sector."
        },
        {
            "text": "We’ve seen the positive impact of our work before and want to build upon this. Although self-reported working hours remained high, concerted efforts, with the focus on marking, data and planning, saw a marked drop in self-reported working hours by teachers, middle leaders and senior leaders by approximately five hours per week between 2016 and 2019. "
        },
        {
            "text": "Undeniably, workload and wellbeing challenges facing our leaders and teachers were exacerbated by the pandemic. "
        },
        {
            "text": "Now more than 1,600 schools and colleges have signed up to the charter since its launch in November 2021, showing a clear commitment to improving staff wellbeing and reducing workload. We will continue to draw upon the expertise of our stakeholders, internal and external and of course, teachers and leaders to embed wellbeing at the heart of teaching. ◼︎"
        }
    ]
}