{
    "url": "https://ipo.blog.gov.uk/2022/04/26/ip-and-youth-innovating-for-a-better-future/",
    "title": "IP and Youth – innovating for a better future",
    "authors": [
        "Guy Robinson"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Innovation",
        "IPO",
        "Patents",
        "Schools",
        "Trade marks",
        "Universities"
    ],
    "pub_date": "2022-04-26T10:43:02+01:00",
    "content": [
        {
            "text": "Every year, on the 26 April, World IP Day is celebrated across the globe. Hosted by the World Intellectual Property Organization, it has a new focus each year. The theme for 2022 is ‘Innovation and Youth’."
        },
        {
            "heading": 3,
            "text": "Innovation without limits"
        },
        {
            "text": "The world is an exciting place for young innovators. Our constantly evolving, increasingly eye-opening environment offers a diversity of opportunity for all ages to create and have their content seen on a worldwide scale.  "
        },
        {
            "text": "Young people interact with the world from an early age. Intellectual property - IP - is an integral part of that environment. It threads through the music they listen to, through the influencers they see on TV and online, as well as all around them in school, college, university and family life. They’re surrounded by (and socially steered by) household names, branding and gadgets that make lives easier, more entertaining and more fun. "
        },
        {
            "text": "Many are creating their own, original, intellectual property in physical and digital form. There’s no age limit on innovation.  "
        },
        {
            "text": "Many will leave school or university to take up careers in industries that depend upon innovation and creativity. It has never been more important for them to gain an understanding of IP: how it can work to help them grow their future; how it can support growth in economies; why it’s important to have respect for others' IP rights.  "
        },
        {
            "text": "That is why we want to provide young people with the skills to understand and recognise the intellectual property in what they create and use.  "
        },
        {
            "heading": 3,
            "text": "So, how do we help young people to understand IP? "
        },
        {
            "text": "As guardians of intellectual property in the UK, the IPO provides free and accessible resources for teachers and educators to introduce IP concepts to young people. We engage with primary and secondary schools, and support those in further education, universities and research.  "
        },
        {
            "heading": 3,
            "text": "Framework for an IP-led future "
        },
        {
            "text": "Our flagship IP Education Framework, launched in March, sets out the IP knowledge needed by young people from primary to higher education levels. It’s a great asset for teachers and educators to add to their toolkit. Age-appropriate competency statements and supporting resources help them introduce IP concepts into lessons.  "
        },
        {
            "text": "Working with partners, the IPO has developed a suite of curriculum-linked education resources, competitions, lesson plans, games and outreach.  From downloading music to quoting academic essays, the toolkit is user-friendly.  "
        },
        {
            "heading": 3,
            "text": " Our 4 to 11 year-old audience and their Cracking Ideas "
        },
        {
            "text": "Tim Moss, speaking about our Cracking Ideas Competition winners in 2020, said:  "
        },
        {
            "text": "Cracking Ideas – a title gleaned from our partnership with Wallace and Gromit creators, Aardman Animations - is the IPO’s educational resource for primary education. With themes that run true to the “Gromit, that’s it!” school of inventing, we engage with our young innovators to encourage understanding of the IP in the world around us.   "
        },
        {
            "text": "Take a look at a short film of the winning invention on our YouTube channel."
        },
        {
            "text": "The competition has continued in spite of the pandemic, last year attracting 1,600 entries (7% up on the previous year). 58% of those identified IP in their invention and interestingly, we saw an all-female shortlist for the first time. Cracking! "
        },
        {
            "heading": 3,
            "text": "When singing in the shower gets educational "
        },
        {
            "text": "One of the ways our innovative education engagement team sets out to compete for the attention of our school age audiences is at school STEM events (pandemic permitting). The team takes with them bold, colourful, immersive experiences, which are supported by age-appropriate IP narratives. "
        },
        {
            "text": "When I say ‘immersive’... no-one who has witnessed it could forget the snaking queues eager to take their turn in our UK-touring ‘Karaoke Shower’. Imagine a shower cubicle, complete with shower-head microphone, into which the youth of Britain sing many a favourite song while learning about the importance of copyright to the creative industry.  "
        },
        {
            "heading": 3,
            "text": "Big Bang, accidental inventions and a Back-up Bivie"
        },
        {
            "text": "We have a long-standing commitment to STEM education through Engineering UK and the Big Bang fair at Birmingham’s NEC. It’s the largest celebration of STEM for young people in the UK.  This year we will showcase innovation and accidental inventions that have changed everyday life.   "
        },
        {
            "text": "Our commitment to STEM education was furthered in 2021 with the inaugural Intellectual Property Office Outstanding Innovator Award, part of the Big Bang Awards.  We wanted to give entrants an opportunity to explore IP beyond their current knowledge and gain an understanding of the role it plays in protecting and harnessing innovation.   "
        },
        {
            "text": "Find out more about Amy’s win on the Government Science and Engineering blog."
        },
        {
            "heading": 3,
            "text": "IP support beyond school years "
        },
        {
            "text": "Our support for furthering IP knowledge extends into further and higher education and research. A suite of resources and toolkits, such as IP Tutor and IP for Research develops the IP skills in students and researchers to support their future careers.  It includes the Lambert Toolkit - practical help for universities and companies who want to undertake collaborative research projects. "
        },
        {
            "heading": 3,
            "text": "Intuitive IP – a key life skill  "
        },
        {
            "text": "And so, our engagement with IP in education continues. Ultimately, we will consider our job well done if we can help to embed IP knowledge as second nature. We want to help young people to recognise IP not just as a ‘good to know’ topic, but as a core asset to equip them for life, and for theirs and their childrens’ futures. "
        }
    ]
}