{
    "url": "https://teaching.blog.gov.uk/2022/04/26/our-schools-journey-supporting-refugees/",
    "title": "Our school’s journey supporting refugees",
    "authors": [
        "Tarun Kapur"
    ],
    "categories": [
        "Community support",
        "Secondary schools"
    ],
    "pub_date": "2022-04-26T11:48:33+01:00",
    "content": [
        {
            "text": "Thanks to the dedication of teaching staff across the country, refugees are regularly supported to continue their education in England. Chief Executive of The Dean Trust, Tarun Kapur, shares how Broadoak School in Manchester recently supported 60 young refugees and their families from Afghanistan. As children and young people from Ukraine begin to arrive in the country, Tarun shares his advice for schools looking to support refugees. "
        },
        {
            "text": "After I was approached by Manchester City Council to support Afghan refugee families, my response was ‘how many children would you like us to take?’ We wanted to help, and I knew we had the capacity, so I suggested that the trust take all the secondary aged refugee children without a school place, 60 in total."
        },
        {
            "heading": 3,
            "text": "Preparing for the transition"
        },
        {
            "text": "There were many factors to consider when offering to support these refugee families, most of which were new to us as a trust. They included cultural sensitivities, financial implications and emotional support, utilising the skills and compassion of a range of people in the organisation."
        },
        {
            "text": "We started by identifying staff from across our trust with the skills that were most needed, for example Pashto and Dari speakers who could act as interpreters. We also got in touch with our uniform suppliers and key partners who generously provided financial help and support in kind, for example coats for each child from the Manchester United Foundation. In the school canteen, we ensured there were always Halal options."
        },
        {
            "text": "In order to give our staff the tools they needed, we held training about the Afghan education system and how to create a supportive environment for refugees experiencing PTSD. The training was an opportunity to share relevant knowledge and skills as well as instil empathy and a greater understanding of the young people’s challenging backgrounds. Staff learned to complement mental health services accessed outside of school by ensuring that, in the moment, Broadoak was a safe place where these young people could learn and regain hope for the future."
        },
        {
            "heading": 3,
            "text": "Meeting for the first time"
        },
        {
            "text": "When they arrived, we arranged for a team of around 15 staff from the trust, as well as partners and volunteers, to meet our Afghan families. We wanted the students to feel welcome and excited about their new school, but we knew we also had to do all we could to address any concerns the students and parents had and to reassure them."
        },
        {
            "text": "We introduced ourselves, told them about our school and what to expect. We also discussed cultural differences – for example we are a mixed sex school, which is not the norm in Afghanistan. Being able to converse with parents in their native language made a huge difference."
        },
        {
            "text": "Each child was then fitted for clothes, given a Chromebook with multi-lingual school resources and supplies such as pencil cases and school bags. We also organised safe transport to and from school."
        },
        {
            "text": "We employed four Afghan teachers who had worked with the British Council. We wanted to give our new students a sense of stability and community, whilst providing the school with much-needed support. These teachers were, like students, given appropriate professional clothing, IT equipment and comprehensive support for dealing with contracts and salary."
        },
        {
            "heading": 3,
            "text": "Helping students to feel settled"
        },
        {
            "text": "We wanted all the new students to be supported to integrate into school life, so we provided a two-week focused induction to help them settle in. During this time, we assessed the students’ subject levels in Pashto or Dari and in English. We introduced them to various multi-lingual resources to support their learning of English, drawing on support from one of our schools with a high level of students with English as an additional language. Getting students quickly involved in mainstream classes such as PE and drama helped them to integrate because they could easily participate despite initial language barriers."
        },
        {
            "text": "We also planned a series of extra-curricular activities to give the students the opportunity to take part in activities that British students enjoy, like visiting the cinema, an ice rink or a country park. It was amazing to see their reaction; the joy was clearly visible and the experiences helped the students relate to their new peers. We also planned cultural activities where other refugee students from our trust visited and took part in traditional dances and cricket."
        },
        {
            "heading": 3,
            "text": "Seeing the impact of what we have done"
        },
        {
            "text": "Five months in, the four staff and the majority of our 60 students are now fully integrated into the school and its community. We are incredibly proud to have been able to support these refugee families with their transition into this country. The entire school community is learning more about the refugee experience and the importance of empathy, listening to stories and allowing space for conversation, grief and hope."
        },
        {
            "text": "We hope what we have learnt and shared with you will help other schools plan for and welcome refugees from Ukraine over the coming months."
        },
        {
            "heading": 4,
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates"
        }
    ]
}