{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/26/pioneering-research-is-key-to-englands-rare-diseases-action-plan/",
    "title": "Pioneering research is key to England’s Rare Diseases Action Plan",
    "authors": [
        "Lauren Watson"
    ],
    "categories": [
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2022-04-26T13:49:09+01:00",
    "content": [
        {
            "text": "Rare diseases are those which affect fewer than 1 in 2,000 people. There are over 7,000 such conditions, ranging from those you may have heard of, like Huntington’s Disease or the muscular dystrophies, to syndromes so rare they have yet to be given a name. While individually uncommon, it’s estimated that 1 in 17 people will be affected by a rare disease at some point in their lives – that’s over 3.5 million people in the UK alone."
        },
        {
            "text": "Scientific advances have underpinned many breakthroughs in the field of rare diseases, from new approaches to diagnostics, to the development of innovative treatments.  As a global science leader with a world-class research infrastructure and health system, the UK is uniquely positioned to use these resources to benefit those affected by rare conditions. In 2021, the government and devolved administrations published the UK Rare Diseases Framework, setting out a shared vision for addressing health inequalities and improving the lives of people living with rare diseases across the UK. Each of the four UK nations is working to produce action plans setting out how the priorities outlined in the Framework will be made a reality."
        },
        {
            "text": "At the Department of Health and Social Care (DHSC), we were proud to launch England’s first Rare Diseases Action Plan on 28 February 2022, containing 16 new actions developed together with publicly-funded partners across the health and care system, and in close consultation with the rare disease community. The plan capitalises on the UK’s strengths in genomics – particularly important for the 80% of rare diseases with an identified genetic origin – and includes an ethically-approved pilot study led by Genomics England, using whole genome sequencing to screen up to 100,000 healthy newborn babies. The pilot will help us better understand the clinical benefits and potential risks of newborn genomic screening, focusing on diseases which present in early childhood, where an outcome-changing action would be available if they were detected earlier."
        },
        {
            "text": "Beyond genomics, the plan also recognises the importance of scientific research in raising awareness of rare conditions (both genetic and non-genetic), and improving our understanding of their progression, treatment and care. To support pioneering research and translate outcomes into frontline clinical care, DHSC has committed to working with the major funders of rare disease research, including the Medical Research Council, National Institute for Health and Care Research (NIHR), and research charities over the next year, to map the rare disease research landscape to identify gaps and priorities for future funding. The plan also includes an announcement of £40 million of new funding to the NIHR BioResource, to further their work in characterising and understanding rare diseases."
        },
        {
            "text": "Ongoing scientific breakthroughs have led to an increase in the number of rare diseases where interventions are available to reduce or avoid harm, or improve long term outcomes, if the condition is detected early. Over the coming year, DHSC will continue to collaborate with delivery partners and the rare disease community to explore opportunities to harness these advances in future annual Action Plans, in order to achieve meaningful change for those whose lives are impacted by these conditions."
        }
    ]
}