{
    "url": "https://educationhub.blog.gov.uk/2022/04/the-covid-19-vaccine-is-still-available-to-anyone-aged-12-15/",
    "title": "The COVID-19 vaccine is still available to anyone aged 12-15",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2022-04-26T12:14:50+01:00",
    "content": [
        {
            "text": "From 1st April the in-school COVID-19 vaccination programme will come to an end. However, 12 to 15 year olds will still be able to access the vaccine outside of schools at a vaccination centre, pharmacy or walk-in centre.  "
        },
        {
            "heading": 3,
            "text": "The vaccine is already making a big difference to help protect us all."
        },
        {
            "text": "For decades, vaccinations have protected our children and young people from potentially serious diseases, including measles, flu, meningitis and mumps. Routine vaccinations are offered for free on the NHS to all babies and children in the UK. The COVID-19 vaccine is one more vaccine that young people can have to protect them from illness."
        },
        {
            "text": "By getting vaccinated, children and young people can reduce the risk of passing on the infection to others in their family and those they come into contact with. Getting the COVID-19 vaccine can also make it easier for children and young people to avoid putting their lives and their education on hold because of further disruption to schools, hobbies and social events due to the virus."
        },
        {
            "text": "The majority of children and young people experience only mild symptoms following COVID-19 infection or are asymptomatic. However, there is evidence that some will experience Long COVID following COVID-19 infection."
        },
        {
            "text": "A February 2022 UKHSA review found that vaccinated people in the general population were less likely to develop symptoms of Long Covid following infection compared with unvaccinated people."
        },
        {
            "heading": 3,
            "text": "Booking a vaccine is easy."
        },
        {
            "text": "Parents can book a Covid-19 vaccination appointment online or calling 119. Alternatively, they can find a walk-in Covid-19 vaccination site."
        },
        {
            "text": "We encourage parents, carers or those with parental responsibilities to attend Covid-19 vaccination appointments with their child outside of school. Unlike vaccinations in schools, consent will be collected on the day. For looked after children, please refer to the care plan where permissions and restrictions of consent will be outlined."
        },
        {
            "text": "You can access COVID-19 vaccination resources and information here: COVID-19 vaccination: resources for schools and parents - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "COVID-19 vaccinations for 5-11 year olds – booking now open "
        },
        {
            "text": "The parents and carers of almost five million 5 to 11 year olds are now able to book a COVID-19 vaccination."
        },
        {
            "text": "The NHS has already been vaccinating children under 12 who have medical conditions that put them at increased risk from COVID-19 or who live with someone with a weakened immune system. Now the NHS is making the vaccine available for all 5 to 11s following updated JCVI guidance, which recommends a non-urgent offer to help protect against potential future waves of COVID-19 and reduce the risk of children falling seriously ill with the virus."
        },
        {
            "text": "The majority of appointments for 5 to 11 year olds will be available at a local vaccination centre or community pharmacy outside of school hours and are available to book via the National Booking Service or by calling 119. In some areas, some GPs will also be inviting parents of 5-11 year olds to book an appointment."
        },
        {
            "text": "There are also convenient vaccine walk-ins across the country which families can find via www.nhs.uk/grab-a-jab. The online finder shows which walk-in sites can vaccinate which age groups."
        },
        {
            "text": "The NHS will also be sending invites to parents and guardians of eligible children throughout the next few weeks to let them know they can now book in for a vaccine."
        }
    ]
}