{
    "url": "https://civilservice.blog.gov.uk/2022/06/15/civil-service-awards-2022-nominations-are-now-open/",
    "title": "Civil Service Awards 2022: Nominations are now open!",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-06-15T08:16:28+00:00",
    "content": [
        {
            "heading": 3,
            "text": "We’re looking for the best of the best of civil servants, the crème de la crème and the people’s pick - which means we want your nominations!"
        },
        {
            "text": "The clock is ticking! On 8 June, the Civil Service launched its annual search to find, honour and celebrate the finest civil servants, individuals and teams, but we can’t do it alone - we need your help."
        },
        {
            "text": "This year, there are 13 categories including Rising Star, Cabinet Secretary’s Outstanding Leader and Science and Innovation. The star-studded lineup of Category Champions  includes Ministry of Justice Permanent Secretary Antonia Romeo, Chief Scientific Adviser Sir Patrick Vallance, and Civil Service Chief Operating Officer Alex Chisholm, among many other big hitters."
        },
        {
            "heading": 4,
            "text": "Record nominations"
        },
        {
            "text": "Last year, the CS Awards attracted a record haul of nominations. Now, organisers are hoping to surpass this success and give the judges a tough task when drawing up their shortlists of runners and riders. The awards ceremony will take place at Lancaster House in December."
        },
        {
            "text": "Cabinet Office Permanent Secretary Alex Chisholm [left], a staunch supporter of the awards, said: “It’s so important every year to take the chance to really celebrate the best that happens across the Civil Service. Every day people come to work and give their best. At this time of year, we have a chance to put people in front of the cameras and say, ‘You are our heroes!’”"
        },
        {
            "text": "But don’t just take our word for it. We asked some of last year’s winners if they had a message for any civil servant considering a nomination. Here’s what they said."
        },
        {
            "text": "Duncan Hamer, Welsh Government, Economic Resilience Fund, team winner of the Project Delivery Award"
        },
        {
            "text": "“It’s been a really rewarding experience. We’ve been able to use this to motivate people and to [enable] them to be recognised by their peers for their work and what they’ve been able to achieve. My message for civil servants is to apply wherever you work in the Civil Service - it’s definitely worth it!”"
        },
        {
            "text": "John Peart, Civil Service LGBT+ Network, team winner of Developing and Supporting People Award"
        },
        {
            "text": "“Our award recognised hundreds and hundreds of small acts of kindness and selflessness across the Civil Service. The LGBT+ Network Mentoring Programme is constructed of 850 people who gave up a small amount of time to help somebody else and that’s the most important thing it recognised. We never expected to get shortlisted, let alone win, so to be recognised this way is great. I’d encourage people to reflect on whether there’s something amazing you’ve done recently. There are enough people that tell the Civil Service it’s bad for all sorts of reasons. But this is an amazing opportunity to show off the things we do get right and do really well.”"
        },
        {
            "text": "Rajoe Hoque, Diversity and Inclusion Team, Department for Work and Pensions, team winner of Diversity & Inclusion Award"
        },
        {
            "text": "“Jump in and get involved. There’s so much going on. The Civil Service is a very big organisation. It’s just wonderful witnessing it first-hand, so reach out and really do get stuck in because there are great things to be involved in.” "
        },
        {
            "text": "Rizwan Ahmad, Department for Work and Pensions, winner of Prime Minister’s Award for Exceptional Public Service"
        },
        {
            "text": "“A couple of years ago, I was on a judging panel assessing Civil Service entries and thought: ‘This is amazing, I’ll never be able to win one.’ Fast forward 12 months, I’ve just won the Prime Minister’s Award for work within my community, supporting young unemployed East Londoners at the height of the pandemic - with record numbers out of work. I used the Kickstart programme to support more than 5,500 young people into work by opening six new Jobcentres and recruiting and training more than 1,000 Work Coaches. My only advice is get your nominations in! Don’t worry whether you think it’s strong enough, just put your evidence in and you’ll have a good chance.”"
        },
        {
            "text": "Awards Champion Shona Dunn added: “What makes the Civil Service Awards so special is the opportunity they offer for each of us to show the deep admiration, respect and pride we feel when we see our colleagues, teams and departments succeed, often in the most challenging of circumstances. We’re surrounded by people who daily go above and beyond, often in the most unassuming way. So seize the opportunity and nominate a colleague. It will make their day, and they might just go on to win!”"
        },
        {
            "text": "Nominate now!"
        },
        {
            "text": "Visit the Civil Service Awards website to begin your nomination. Remember to send us your entries no later than 22 July!"
        }
    ]
}