{
    "url": "https://teaching.blog.gov.uk/2022/06/15/from-multi-academy-trust-sceptic-to-advocate/",
    "title": "From Multi Academy Trust sceptic to advocate",
    "authors": [
        "Liz Whetham"
    ],
    "categories": [
        "Primary schools"
    ],
    "pub_date": "2022-06-15T12:10:25+01:00",
    "content": [
        {
            "text": "Liz Whetham is the Executive Principal at Westminster Church of England Primary Academy in Bradford. She shares her journey from being wary of MATs to embracing the benefits for her leadership, school staff and student outcomes. "
        },
        {
            "heading": 3,
            "text": "What would I say to anyone hesitant about joining a Multi Academy Trust (MAT)?"
        },
        {
            "text": "Find the right one - one that shares your vision and values for education; one that has a proven community, family approach to the team; one that listens as well as advises. I can honestly say joining the trust has been one of the best things I’ve done as a headteacher."
        },
        {
            "text": "Since September, I have been executive head at Westminster Primary School, a three-form entry school in the Bradford Diocesan Academy Trust. For 10 years prior to that, I was headteacher at an academy in Halifax and led the school through academisation in my first year of headship. I was fortunate in those early days that my local area had a number of other stand-alone academies and we found support from one another to help me navigate those new days of headship."
        },
        {
            "heading": 3,
            "text": "Initial concerns"
        },
        {
            "text": "Throughout my career I have always been a huge fan of collaboration and embraced the benefits of working with like-minded professionals. So, it might come as a surprise that I had always been a bit wary of MATs. I initially had a perception of a ‘top-down’ leadership approach."
        },
        {
            "text": "The fear of losing autonomy as a leader was unattractive to me, particularly when our school was doing well. I felt that as head, I was best placed to know my school and community and that my team and I were the best people to address the challenges we faced. How could a MAT replicate that? What if their collective decision wasn’t the best for my school? These were the concerns that drove some of my MAT scepticism."
        },
        {
            "text": "And then it happened! Two significant events in my leadership life that completely changed my mind about MATs."
        },
        {
            "heading": 3,
            "text": "From sceptic to advocate"
        },
        {
            "text": "I was asked by a MAT CEO I admired hugely, to undertake some consultant headship for one of their schools. At that time schools were navigating their way through the pandemic, a perfect storm which meant a whole new set of systems and procedures were needed. As heads, we are used to crisis management, but this was crisis management on an unprecedented scale."
        },
        {
            "text": "Being the head in a stand-alone academy is a lonely place to be.  As head, every single decision was mine. I remember one day physically banging my head on my desk saying, ‘I just can’t make any more decisions!’ It made it much more difficult to concentrate my time where it should be, supporting teachers and providing high quality remote education to pupils."
        },
        {
            "text": "The value of being in an MAT became abundantly clear to me during the second lockdown. The level of support available to me as a consultant head at a MAT was such a relief. Decisions weren’t taken alone, risk assessments were completed jointly, concerns and issues dealt with swiftly and with compassion. HR documentation was prepared by a central team with expertise, this freed up me and my team to focus on the things we excel at. Meetings with other headteachers allowed us to share our challenges and best practice, with the trust providing continued practical and emotional support."
        },
        {
            "text": "Later that year, I accepted an exec head role within the MAT, which two years ago I would never have considered. However, the support I received and its impact on me and my leadership had been so positive, I was happy to make that leap."
        },
        {
            "heading": 3,
            "text": "Looking to the future"
        },
        {
            "text": "Six months on, I can honestly say it was the best thing I ever did! The breadth of support on offer from the trust is fantastic, there is a strong sense of community and the shared values of both the trust and school run through everything that the trust does."
        },
        {
            "text": "The benefits really are plentiful, not just for me, but for my team and most importantly for the pupils. Tailored professional development for staff, opportunities for talent management, trust-led initiatives, support for external reviews, tailored training for leaders, such as PR & media training. Sharing best teaching and learning practice with schools who all share the same values and high expectations puts us in a great position to improve outcomes for pupils and make teachers’ lives easier!"
        },
        {
            "text": "I’ve well and truly eaten my humble pie and am grateful to BDAT for being the trust that convinced me to do so!"
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}