{
    "url": "https://buyingforschools.blog.gov.uk/2022/06/15/school-resource-management-building-a-stronger-system/",
    "title": "School Resource Management: building a stronger system",
    "authors": [
        "Cherise Heavey, Communications and User-Engagement Lead from the Schools Resource Management Team"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-06-15T13:13:13+01:00",
    "content": [
        {
            "text": "On 10 June 2022, the Department for Education (DfE) published the strategy ‘School Resource Management: building a stronger system’, setting out the department’s approach to supporting schools and academy trusts to get the best value from all their resources."
        },
        {
            "text": "Building on the 2018 publication, ‘Supporting Excellent School Resource Management’, the new strategy highlights how the offer of support to schools has grown and evolved in response to the challenges and opportunities of the last few years."
        },
        {
            "text": "We wanted to find out more about the new strategy and what it means for schools, so we asked Rachael Davies and Shazia Fletcher, joint heads of the School Resource Management strategy team, to tell us about it."
        },
        {
            "text": "What is School Resource Management?"
        },
        {
            "text": "School Resource Management, or as you’ll often hear us call it, ‘SRM’, is all about helping schools and academy trusts focus their resources to make the biggest positive difference to their pupils. It’s not just about helping schools to make savings – though of course that is an important part of the story, especially when it comes to helping them access the best deals on their regular purchases and reduce their non-staff costs. It’s also about strong financial leadership and confident resource decision-making, enabling schools and academy trusts to target their funding, people and assets in ways that deliver the best outcomes for their pupils."
        },
        {
            "text": "Why have you published a new SRM strategy now?"
        },
        {
            "text": "A lot has happened since the previous SRM strategy was published in 2018 and a programme of support for schools was introduced. We have seen the schools system rise to the challenges of a global pandemic. We’ve expanded our offer of support to include new areas such as digital and capital efficiency, helping schools address the growing threat from cybercrime and the challenges of managing and maintaining the school estate. And we’ve undertaken user research with school business professionals and system leaders to help us understand what effective SRM means to them."
        },
        {
            "text": "Taking on board their feedback - and building on the successes and the learning from the last four years - our new strategy sets out our vision for government and schools to work together in partnership to get best value from every pound spent on our children’s education. It recognises the excellent practice that already exists in many parts of the sector and sets out our plans to continue embedding this across the whole system."
        },
        {
            "text": "What are the main points of the new strategy?"
        },
        {
            "text": "The new SRM strategy sets out how we will support and invest in training for the school business profession and for boards and executive leaders, so that schools and academy trusts can continue to grow their school business capability as well as sharing excellent practice."
        },
        {
            "text": "It also sets out how we will enable schools to get the most from their teaching workforce, through support for workload reduction, reducing planning time through digital services, embracing flexible working and promoting staff wellbeing."
        },
        {
            "text": "It highlights the growing suite of tools and services designed to help schools in these areas, and to support them in achieving best value and impact from their non-staff resources."
        },
        {
            "text": "Can you give us some examples of how these tools and services can help schools?"
        },
        {
            "text": "The SRM offer includes a wide variety of free tools and guidance. Here are some examples, including a few that have been featured previously on this blog:"
        },
        {
            "text": "Get help buying for schools provides a free procurement support service to help schools get best value when buying goods and services."
        },
        {
            "text": "Teaching Vacancies is a free national search and listing service to advertise teaching, leadership, and education support roles at your school."
        },
        {
            "text": "The Schools Financial Benchmarking Service enables schools to compare their income and expenditure to similar schools and academy trusts, visualise the information using benchmarking charts and use the data to build relationships with other schools and academy trusts."
        },
        {
            "text": "View My Financial Insights allows academy trusts and local authorities to see all their schools in one place, providing users with an automated assessment of their data based on similar schools to help identify and investigate areas with the greatest variance."
        },
        {
            "text": "Guidance and support around integrated curriculum and financial planning (ICFP) is available to encourage schools to use ICFP to create the best curriculum for pupils with available funding."
        },
        {
            "text": "School Resource Management Advisers experienced school business leaders who can provide free, expert hands-on advice and support tailored to your school or academy trust."
        },
        {
            "text": "Digital Standards support schools to understand their digital environment and know what technology they should have in place."
        },
        {
            "text": "Good Estate Management for Schools (GEMS) is a one-stop shop for guidance, tools and checklists to help you manage school buildings effectively and efficiently. It includes an interactive self-assessment tool, top 10 estates checks for governing boards and energy and water management tips."
        },
        {
            "text": "These are just a few examples of the tools and services on offer. You can access the full suite of support here."
        },
        {
            "text": "Who is the SRM offer aimed at?"
        },
        {
            "text": "This offer, and the suite of SRM tools, is freely available to all state-funded schools in England."
        },
        {
            "text": "They are designed for senior leaders, school business professionals, governors, teaching and support staff and anyone with an interest in how schools and academy trusts manage and prioritise their resources so that they can provide the best possible support for their pupils."
        },
        {
            "text": "Do schools have to use the SRM offer?"
        },
        {
            "text": "The SRM offer is just that – an ‘offer’ of support to schools and academy trusts. It does not place new requirements on them, though of course we hope the tools and services will be widely used and that schools will find them valuable. We will monitor take-up and engagement and continue to gather feedback and user perspectives so that we can keep improving the offer, in partnership with the sector."
        },
        {
            "text": " Is the SRM offer aimed at a particular type of school?"
        },
        {
            "text": "We know that each school and academy trust is different, and the support on offer through SRM recognises this by providing a range of different tools and services that can be used flexibly and adapted to your specific context. They are not just for large MATs, or newly converted academies, or schools that may be struggling financially (though all of those may find them helpful in different ways). SRM is a universal offer including to Local authority Maintained Schools that can benefit all types of schools and academy trusts; including the many that we know are already leading the way with excellent practice in this area."
        },
        {
            "text": "For real-life examples of how SRM tools and services have helped different types of schools and academy trusts, please have a look at our published case studies."
        },
        {
            "text": " "
        }
    ]
}