{
    "url": "https://aphascience.blog.gov.uk/2022/06/15/securing-animal-health-scientific-capability/",
    "title": "Securing the UK’s animal health scientific capability",
    "authors": [
        "Jenny Stewart"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2022-06-15T09:04:46+01:00",
    "content": [
        {
            "text": "In this blog, we hear from Dr Jenny Stewart, Director of Science and Transformation, as she looks at how some of the key areas of APHA’s animal health science continue to have an immediate impact for UK farming and trade, whilst developments take place on the Weybridge site, and how a ‘One health’ approach places the Weybridge campus as a vital part of the overall system that protects public health."
        },
        {
            "text": "In my last blog we explored the plans to redevelop APHA’s Weybridge site to enhance its capability as a world-class centre for science."
        },
        {
            "text": "This long-term programme to future-proof the UK’s science capability in animal health (via the Science Capability in Animal Health Programme) is fundamental to the transformation of APHA’s main animal health science campus and securing our vital scientific capability."
        },
        {
            "text": "We are really pleased to confirm that the first phase of the programme is complete.  This phase included some major demolitions on site to clear space for the future state-of-the-art science hub, alongside refining our plans which will help us deliver faster and with lower risk."
        },
        {
            "text": "The investment in the science campus will allow us to continue to respond rapidly to and protect us against animal diseases​.  APHA have the capability to understand animal health risks  to the UK which allows us to identify, characterise, prepare for and respond to single cases or outbreaks.  Our work minimises the impact of these diseases on economy and trade, and protects us against the risk some of these diseases can pose to human health."
        },
        {
            "heading": 3,
            "text": "Avian Influenza"
        },
        {
            "text": "The UK poultry industry produces commodities worth £2.8 billion per year. When the current  avian influenza (AI) outbreak (the largest the UK has ever experienced) began and developed, it was critical that APHA scientists were able to diagnose the disease and identify the strain of the virus quickly and accurately."
        },
        {
            "text": "The underpinning research and expertise in AI through extensive science programmes conducted at APHA, meant that the Government was able to make appropriate policy decisions and ensure that outbreaks were brought under control as rapidly as possible."
        },
        {
            "text": "During the current outbreak, frontline APHA scientists conducted over 22,000 diagnostic tests on samples from over 120 infected poultry premises as well as testing over 2,000 wild bird samples of which over 1,000 were positive. We were able to reduce the test period for identifying the key strain from 24 to six hours, saving critical time in controlling the disease on farms."
        },
        {
            "heading": 3,
            "text": "Bovine Tuberculosis"
        },
        {
            "text": "Bovine Tuberculosis (bTB) is another key area of scientific priority.  Each year over 50,000 cattle are slaughtered in the UK as part of efforts to eradicate the disease, which amounts to costs of around £150 million to UK taxpayers with devastating consequences to the cattle industry. APHA and its partners have demonstrated that a new role for bacillus Calmette-Guérin (BCG) – a vaccine originally developed for human tuberculosis, has been shown to protect cattle against bovine tuberculosis."
        },
        {
            "text": "In ground-breaking research, APHA scientists have developed a DIVA Skin Test, a diagnostic test capable of Detecting Infected among Vaccinated Animals (DIVA). We envisage that once such a test is validated, use of CattleBCG combined with a DIVA test could be approved. You may be interested in reading one of our previous blogs on this topic. Field trials in England and Wales started in 2021 and will significantly contribute to the Government’s aim to secure official bovine tuberculosis free status for England by 2038."
        },
        {
            "heading": 3,
            "text": "Antimicrobial resistance (AMR)"
        },
        {
            "text": "Our scientists work in partnership with UK agencies as part of a ‘One health’ approach to keeping us safe."
        },
        {
            "text": "There is extensive collaboration with UKHSA and others, to link APHA surveillance and research to rapidly respond to antimicrobial resistance (AMR) threats arising in animals. These investigations explore the link between human cases and animal sources. Recently, several potential AMR threats were identified showing resistance to specific antibiotics in bacteria from animals in the UK – these AMR bacteria could cause disease in animals which is more difficult to treat, an issue that is prevalent in human medicine as well."
        },
        {
            "text": "APHA is routinely performing analyses which determine the location of critically important AMR genes in bacteria found during surveillance. Science is progressing to allow us to implement whole genome sequence-based typing of Salmonella for example. This is a great step forward for public health and is facilitating real-time detection of outbreaks, and in the future, it could replace most existing AMR testing with a single process."
        },
        {
            "text": "It is often APHA experts leading investigatory visits with industry and the development and implementation of controls. Our scientific investigation and advice have helped to manage risks and protect public health. Future developments at APHA’s Weybridge site will enhance our capability and capacity to understand AMR, with advances in facilities helping to further reduce the risks of AMR to animal and public health."
        },
        {
            "heading": 3,
            "text": "Future-proofing our science"
        },
        {
            "text": "So, with the first phase of the SCAH Programme complete, we enter our next phase. This phase will see us progress the detailed design for the Science Hub, ready our people and our site for transformation and get ready for the main building phase post 2024."
        },
        {
            "text": "Whilst funding led by the SCAH programme has begun to transform the site, this is a long-term programme over the next 10-15 years and the essential science outlined above will continue to operate in parallel."
        },
        {
            "text": "The development of APHA’s animal health science and laboratory facilities will support our world-leading research, surveillance and testing capability and, in turn, help to protect animal and human health. It will secure the UK’s world-leading animal health expertise and safeguard animal health for the benefit of people, the environment and the economy into the future."
        },
        {
            "text": "This is a really exciting programme and I am delighted we are making progress."
        }
    ]
}