{
    "url": "https://space.blog.gov.uk/2022/06/15/the-importance-of-space-science-and-technology/",
    "title": "The importance of space science and technology",
    "authors": [
        "Conor Hagan"
    ],
    "categories": [
        "Funding",
        "International Space Station",
        "Space science"
    ],
    "pub_date": "2022-06-15T14:50:32+01:00",
    "content": [
        {
            "text": "With London Tech Week underway, we are reminded of the importance that technology plays in all our lives. From simple tasks like setting our alarm clocks for the morning to the ability of performing precision surgery thousands of miles away using a 5G connection – technology helps to keep our modern lives ticking on.    "
        },
        {
            "text": "The same can be said for technologies deriving from space exploration. The wider list of technological advances from space encompasses improved solar panels, implantable heart monitors, light‐based anti‐cancer therapy, cordless tools, lightweight high‐temperature alloys, compact water purification systems, global search‐and‐rescue systems, and biomedical technologies.  "
        },
        {
            "text": "In addition, the scientific experiments that are enabled and achieved by space exploration programmes bring new and important understanding to many different fields of research. The knowledge gathered leads to a host of new developments that benefit us all on Earth, such as advanced new materials, deeper understanding of how humans age, as well as providing the understanding needed to help humans live and work in deep space.  "
        },
        {
            "text": "As space exploration continues, we expect to see further technological advances such as the miniaturisation of components, increased lifespan of devices, new novel materials and many more innovations that will have numerous benefits to life on Earth. The possibilities really are endless when we invest in, and put our minds to, working through the challenges of outer space.   "
        },
        {
            "text": "The UK Space Agency is opening two funding calls: to support future space exploration and to support research on the International Space Station.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Enabling Space Exploration "
        },
        {
            "text": "The Enabling Space Exploration Call  is seeking projects to develop the capability of the UK in space exploration and position the UK to participate in, and benefit from, future space exploration missions. This call will run from the end of 2022 to December 2024. There is up to £1 million available, and the UK Space Agency expects to fund around 3-5 projects of up to £200,000 each.  "
        },
        {
            "text": "Technological development is crucial if humanity is to be capable of exploring the Moon and beyond.  "
        },
        {
            "text": " In this call we have chosen three areas for focus, they are:  "
        },
        {
            "text": "  These technologies will be the bedrock of exploration and human activity off-Earth. ISRU technologies can provide vital consumables for human activity such as drinking water, oxygen, and even propulsion fuels while nuclear power will free us from a dependency on solar power, providing the energy for continual activity. Space Instrumentation covers an array of devices that provide key services to spacecraft to enable exploration missions to the Moon and beyond.  "
        },
        {
            "heading": 2,
            "text": "Microgravity Experiments "
        },
        {
            "text": "The UK Space Agency is also launching the UK Microgravity Experiments Call , an opportunity of a two-stage competition for ideas for experiments for development and flight on the International Space Station. Up to £3 million is available from this call and the Agency expects to fund 1-3 experiments.   "
        },
        {
            "text": " We have requested proposals for ideas for experiments that could be developed and flown to the International Space Station by 2025/26. Any experiments selected for development by the UK Space Agency at the end of the application process will be nominated to the European Space Agency for flight as a UK national contribution to the Exploration programme.  Experiments will have to be designed, developed, built, and qualified by the experiment team.   "
        },
        {
            "text": " The European Space Agency will help with integration to the ISS programme and the payload would be operated by a USOC (User Support and Operations Centre), nominated by ESA, supported by the experiment team.  "
        },
        {
            "text": " The UK Space Agency will hold a virtual workshop on 12 July 2022 for the UK Microgravity Experiments Call to support potential applicants. Find out more here."
        }
    ]
}