{
    "url": "https://nda.blog.gov.uk/abbie-evans-nuclear-waste-services-discusses-why-workplace-inclusion-is-important-for-lgbt-employees/",
    "title": "Abbie Evans, Nuclear Waste Services, discusses why workplace inclusion is important for LGBT+ employees",
    "authors": [
        "NDA group"
    ],
    "categories": [
        "diversity"
    ],
    "pub_date": "2022-06-22T08:03:59+01:00",
    "content": [
        {
            "text": "I started with Nuclear Waste Services in January 2022 as a Waste Strategy Specialist. Amongst all the virtual and in-person introductions to my new colleagues both within the Strategic Waste Programme and beyond, as well as induction events, I made a point of contacting the LGBT+ network within my first few weeks. Why did I do this? Because I believe representation matters - it mattered to me when I actively sought it out and even (or perhaps especially) in the times I swore it didn’t matter it all."
        },
        {
            "text": "I am sure everyone who identifies as LGBT+ at some point will share their “coming out” story so here’s mine."
        },
        {
            "heading": 2,
            "text": "Discovering my sexuality"
        },
        {
            "text": "Like many LGBT+ individuals, I can’t recall the moment I knew I was a lesbian. I remember some furtive Googling happening around the ages 13-14 and noticing the search engine wouldn’t autocomplete a search term containing the word “lesbian” (a feature designed to minimise adult content appearing in search results – since updated) - so I started using the word “gay” reflexively, as I subconsciously learned of this negative association with the term ‘lesbian’. It doesn’t take much to signal and instigate shame – especially when you’re questioning yourself and not publicly out."
        },
        {
            "text": "I came out to family and friends around 2010. I remember agonising about the best way to go about it and eventually settled on waiting for it to come up - because it turns out that when you’re 15, you get asked a lot if you have a boyfriend by nosey people! I didn’t want it to be a big deal – I was, after all, still just me. Same sex marriage was being debated in Parliament and there were LGBT+ characters popping up in TV and films – so what was I afraid of? Luckily, I received mostly positive reactions, or at least the panicked look of someone well-meaning who doesn’t know the appropriate thing to say. So far, so good then?"
        },
        {
            "text": "Sometimes people would say something along the lines of “you wouldn’t need to come out if you were straight, so why do you need to come out as gay?  It doesn’t matter”. It’s hard to describe the effect this had on me, as I felt that however well-intended the statement was, it diminished what I was doing. Coming out – to yourself and others – can be an incredibly liberating feeling. If you could bottle this feeling and sell it, you’d be a millionaire. Being a lesbian might be one of the least interesting things about me but being able to talk openly about my partner is a small but crucial sign that I can be myself around someone, something I realised much later."
        },
        {
            "heading": 2,
            "text": "Being LGBT+ in the workplace"
        },
        {
            "text": "In the subsequent years, I went on to university and then work. Engaging with LGBT+ networks was something I flirted with but I struggled to commit meaningful time to at university – mainly due to the conflict of jobs, study time and socialising. But when I headed into the workplace, I was struck by how often I encountered situations where I felt that my presence and willingness to discuss LGBT+ issues contributed positively to the work environment."
        },
        {
            "text": "I also encountered situations where I overheard offensive comments made about myself or others, and my girlfriend would share her own tales about homophobic encounters she or her colleagues had experienced in work too. This is another sadly common discussion topic in LGBT+ spaces, with many of these incidences only communicated amongst known allies. When incidences like this are allowed to slip by unnoticed or ignored by witnesses, it can compound the negative impact on the victim and contribute to an unwelcoming work environment."
        },
        {
            "text": "I always feel pangs of frustration when I encountered or heard about these events – it looked like coming out did matter, and that you couldn’t always be yourself after all. I’ve challenged this behaviour in the past, but there have been times where I’ve felt unable to do so due to the prevailing culture of where I worked. It is not just the role of LGBT+ individuals to speak out against this type of behaviour – this is where LGBT+ allies can play a huge role. I think the right to work in a supportive and inclusive workplace culture has become a greater priority for everyone, so I encourage you to speak out when you encounter unacceptable behaviour."
        },
        {
            "text": "I realise that having grown up in a more progressive time and surrounded by largely supportive people, I (and others) may sometimes take for granted that diversity is hardwired into modern society and will remain so indefinitely, without effort from me or others. LGBT+ representation in the workplace is more than just a rainbow flag or a “nice to have” feature. Without it, ignorance and bigotry can fester and that can pull people down - and not just LGBT+ individuals either; everyone deserves the right to come into work and feel respected and included. I now feel comfortable to be myself at work, and I value that I can share the mundane (and occasionally funny, I like to think) details of my life outside of work with my girlfriend and our lively dog. I hope that those around me do too and will be inspired to do the same."
        }
    ]
}