{
    "url": "https://socialcare.blog.gov.uk/2022/06/22/learning-disability-week-reminding-us-to-reconnect/",
    "title": "Learning Disability Week: reminding us to reconnect",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Autism strategy",
        "Care and support",
        "Carers",
        "learning disabilities"
    ],
    "pub_date": "2022-06-22T16:27:31+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Celebrating and supporting diversity"
        },
        {
            "text": "In an ideal world, there would be no need for awareness days, weeks and months. There would be no marginalisation, misrepresentation or ignorance, just open societies, fully supportive of the diversity of the human condition."
        },
        {
            "text": "Of course, we don’t live in this utopian state of grace, which is why it is so important health and care issues continue to have their moments in the sun."
        },
        {
            "text": "Learning Disability Week is no different. Like many awareness raising events this year, there is a focus on post-pandemic reconnection. People with learning disabilities and those who support them continue to process the difficulties of the last two years and reacquaint themselves with society."
        },
        {
            "text": "As care workers, we saw first-hand how day to day challenges became further complicated by the restrictions of lockdown. Often, I suspect, we felt a little helpless as we saw those who needed human connection the most, forced to isolate to protect themselves and others. It was necessary of course to save lives, but we couldn’t help but empathise with their distress – we felt that same worry, anxiety and loss in our own lives."
        },
        {
            "heading": 2,
            "text": "The pandemic's lingering effects"
        },
        {
            "text": "I feel it’s so important we keep these shared experiences in our minds as we continue to support people with learning disabilities. The pandemic may have dropped down the news agenda, but it continues to affect all our lives, sometimes in subtle ways we may not always be conscious of."
        },
        {
            "text": "Day to day, while our support will always be emotionally and physically enabling, we still need to focus on areas of critical care, such as infection prevention and control (IPC). This is not just important in clinical or managed care settings, but in domiciliary care and other environments where we strive to maintain an individual’s autonomy and safety. In this respect, we must be educators as much as carers, helping people navigate sometimes complex processes in order to stay safe and connected."
        },
        {
            "text": "We would be failing in our duties as professional carers if we didn’t do what we can to help people with learning disabilities live full, happy and satisfying lives. Learning Disability Week is an opportunity to remind us all of their incredible potential to thrive and our responsibility to help them do just that."
        }
    ]
}