{
    "url": "https://rtau.blog.gov.uk/2022/06/22/part-one-examining-public-attitudes-towards-smart-data-schemes/",
    "title": "Part one: Examining public attitudes towards Smart Data schemes",
    "authors": [
        "Benjamin Moore, CDEI",
        "Wiktoria Kulik, CDEI",
        "Hannah Spiro, CDEI",
        "Holly Clarke, CDEI",
        "Vincenzo Rampulla, BEIS"
    ],
    "categories": [
        "Data",
        "Public engagement",
        "Trustworthy innovation"
    ],
    "pub_date": "2022-06-22T09:10:29+01:00",
    "content": [
        {
            "text": "We have been working with the Department for Business, Energy, and Industrial Strategy (BEIS) to identify the features of ethical and trustworthy Smart Data schemes. Smart Data schemes have the potential to unlock significant benefits for consumers and the UK economy as a whole."
        },
        {
            "text": "However, consumer perceptions of data sharing, if not taken into account, may prevent wider adoption of future Smart Data schemes. To develop our understanding of consumers’ hopes, fears and priorities in the design, development and delivery of these schemes, we conducted polling and focus groups. This is the first of two blogs setting out the findings of our public attitudes research. "
        },
        {
            "heading": 2,
            "text": "Key takeaways"
        },
        {
            "heading": 2,
            "text": "What is Smart Data?"
        },
        {
            "text": "Smart Data refers to the “secure sharing of customer data with authorised third party providers (TPPs), upon the customer’s request”. These providers then use this data to provide innovative services for the consumer or business user, such as automatic switching or better account management. The UK led the world through the introduction of Open Banking, the most advanced and only live Smart Data scheme to date. Open Banking enables customers to share their transaction data with authorised TPPs for services such as improved financial planning, and rounding up spending to put incremental amounts of money into savings. In Consumer Priorities for Open Banking, Faith Reynolds et al. estimated that total coverage of Open Banking could bring a total of £12 billion for consumers and £6 billion for small-and medium-sized (SMEs) each year."
        },
        {
            "text": "Beyond Open Banking, there are a number of proposed Smart Data schemes at different stages of development in the UK, focused on pensions, energy, telecommunications, wider financial services, and there is potential to extend Smart Data to other sectors in future. "
        },
        {
            "heading": 2,
            "text": "Our approach to engaging with the public"
        },
        {
            "text": "Open Banking went live in 2018, and has seen accelerated growth in the last two years, with just under six million users at the time of writing. There is room for additional adoption, with early estimates suggesting that by August 2021 one in 13 digitally-engaged consumers were active users of at least one Open Banking service, which represents an increase from 1 in 40 in January 2020. "
        },
        {
            "text": "We wanted to explore the underlying drivers that influence whether the public would participate in these schemes, and how this varies by sector, to inform future thinking on Smart Data schemes in the UK."
        },
        {
            "text": "In April 2021, we polled a nationally representative sample of 2,000 members of the population, to understand public perceptions of two potential Smart Data schemes:"
        },
        {
            "text": "As well as engaging with a large sample of the public in polling, we conducted deliberative focus groups, which will be covered in more detail in the next blog in this series. "
        },
        {
            "heading": 2,
            "text": "Consumers are not actively searching for better deals in finance or communications"
        },
        {
            "text": "Our polling suggests that consumers are not actively searching for the best deals in either the financial or communications sector. In finance, most respondents rarely or never open new accounts or switch providers to get the best deals. In the communications sector, only 29% said they changed their broadband or mobile phone provider in the past two years. When making decisions about financial and communications products and services, consumers are not necessarily using their consumer data. While 55% said they use their financial data to make these decisions, only 24% use their communications data.  "
        },
        {
            "text": "We explored both push and pull factors that might explain these findings. We found that there is a high level of satisfaction with current providers, and that the public perceive switching to be difficult and time consuming. The majority of respondents also said they did not trust lesser-known service providers. "
        },
        {
            "text": "Table 1: Percentage that agree with statements for finance and communications services "
        },
        {
            "heading": 2,
            "text": "Consumers have mixed feelings about how they could benefit from data sharing"
        },
        {
            "text": "The benefits of sharing financial and communications data were recognised by a significant proportion of respondents. Many said they would be willing to share their financial data if it enabled benefits such as automatic switching to a savings account with a better interest rate (30%); recommendations for the deal best suited to them (29%); access more accurate comparison tools to compare deals (28%); and access to personalised debt advice or money management tools (22%). For communications data, similar proportions said they would be willing to share their data if it enabled them to better compare communications packages (31%); get more accurate, personalised recommendations (31%); or to switch providers automatically (27%)."
        },
        {
            "text": "Contrastingly, nearly a third of respondents thought that there would be no benefit to sharing their data with other organisations (32% and 33% in financial services and communications respectively). Only 10% of respondents said they had ‘no concerns’ about sharing their data in the financial sector, and 14% in the communications sector. "
        },
        {
            "heading": 2,
            "text": "Consumers have mixed feelings about the potential benefits to them of Smart Data schemes"
        },
        {
            "text": "Overall, support for potential Smart Data schemes was mixed, with 25% and 28% of respondents saying they thought the benefits of Open Finance and Open Communications respectively outweigh the perceived potential risks. Approximately a quarter of respondents in each case were unsure about this trade off. These  attitudes strongly vary by age, with under 54s being significantly more supportive, and older respondents more negative.  Perhaps unsurprisingly, individuals who said they trusted banks and financial institutions or telecommunication providers were more likely to support Open Finance and Open Communications. Consumers who had previous experience of switching services more frequently reported believing the benefits of Smart Data outweigh the risks."
        },
        {
            "text": "The general picture presented here is one of low consumer engagement with options around changing finance and telecommunications providers and hesitancy around 'data' in general. These are issues Smart Data schemes will need to consider as they develop."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Polling provided valuable insights about the key drivers influencing participation in Smart Data schemes in finance and communications, and the barriers to data sharing in these sectors. We have published the raw data from this polling, and would welcome discussions on any further analysis conducted on this dataset. "
        },
        {
            "text": "To go beyond the findings from the polling, we engaged a diverse group of the public in focus groups, during which we built their understanding about Smart Data schemes in additional sectors. This allowed us to explore the priorities and concerns of different groups (including microbusiness owners), and test our assumptions about how to establish ethical and trustworthy Smart Data schemes. The findings of these focus groups is the subject of our next blog."
        }
    ]
}