{
    "url": "https://lifeathmrc.blog.gov.uk/2022/06/22/pride-at-hmrc-chriss-story/",
    "title": "Pride at HMRC – Chris’s story.",
    "authors": [
        "Chris Mahood"
    ],
    "categories": [
        "Culture & Values",
        "Diversity",
        "General",
        "Inclusion"
    ],
    "pub_date": "2022-06-22T07:54:56+00:00",
    "content": [
        {
            "text": "June is Pride Month, and here at HMRC we are celebrating our LGBT+ colleagues and community. We asked Chris Mahood what it means to him."
        },
        {
            "heading": 2,
            "text": "The importance of Pride"
        },
        {
            "text": "I’m a litigation lawyer and manager based in Bristol. I’m also a gay man in my 30s, with a husband and two little kids.\nI’m passionate about my LGBT+ community and really pleased that I get to support it at work."
        },
        {
            "text": "In my day job I juggle complex litigation against groups of companies with line managerial responsibilities for several colleagues and working to build up our communities and infrastructure for the Bristol Regional Centre."
        },
        {
            "text": "I’m also a part-time worker with two very sweet (and demanding) kids at home."
        },
        {
            "text": "With the restrictions associated with the pandemic lifted, I’m so excited to enjoy Pride in Bristol this year with my friends and family. A big part of Pride is celebration and joy. And there’s no doubt that we could all use some in-person joy after a long period of cancelled and postponed parties."
        },
        {
            "text": "Pride is about putting queerness centre stage and to showcase queer excellence. Like the drag queen Priyanka, who released the absolute anthem “Come Through” last year, and is this year headlining Bristol Pride!"
        },
        {
            "text": "Whilst Pride is a celebration, it’s very much more than that. It also creates safe spaces where, as LGBT+ people, we can bring our whole selves without fear. That’s especially important for our trans friends and family who suffer the most violence and harassment because, often, they can’t hide their queerness as easily as others can."
        },
        {
            "text": "Pride is also about raising awareness of LGBT+ diversity and inclusion. Schools and education have a key role to play in this. Our kids’ primary school is signed up to the excellent No Outsiders initiative. As part of this, some of the year 6 children interviewed my husband (and a few other parents) about their experiences as LGBT+ families. I was at school during section 28. I can’t express how meaningful it is to me that we’ve come so far as a country."
        },
        {
            "heading": 2,
            "text": "How does HMRC support LGBT+?"
        },
        {
            "text": "I’m so pleased that HMRC champions and supports LGBT+ issues. Our senior leaders underline the importance of diversity and inclusion – it’s a key part of HMRC’s values and strategy. And our LGBT+ Champion Alan Evans vocally and passionately supports the LGBT+ community. In HMRC, whatever your day job, contributions you make to these issues will be highly valued and recognised. But we can always do more – I’m keen to help us build on past successes and make sure all of our LGBT+ community (especially our trans colleagues) feel able to be their authentic selves at work."
        },
        {
            "text": " "
        },
        {
            "text": "If you haven’t already, you can catch up with Harry’s story from Pride 2021."
        }
    ]
}