{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/06/22/promote-the-vote/",
    "title": "Promote the vote",
    "authors": [
        "Rob Mitchell",
        "Rumbidzai Mashavave",
        "Elaine James",
        "Jazzmin, Expert by Experience",
        "Lyn Romeo"
    ],
    "categories": [
        "Autism",
        "Events",
        "Learning disabilities",
        "Our profession"
    ],
    "pub_date": "2022-06-22T14:02:13+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A unique role for adult social workers"
        },
        {
            "text": "Since the UK Parliamentary Election in 2017, our social workers have been working across the Bradford district to promote participation in elections through voter registration and reasonable adjustments to make voting accessible."
        },
        {
            "text": "We call this initiative Promote the Vote. Social workers have so far visited over 200 supported-living houses and have helped over 600 people with learning disabilities to exercise their UNCRPD Article 29 Right to Participate in Political and Democratic Life."
        },
        {
            "text": "Evidence collected to measure the impact of Promote The Vote shows that where social workers speak to people about their right to participate, they are significantly more likely to register and go on to vote.  We strongly believe that the right to vote, is fundamental to active citizenship, and as such, it is central to upholding people’s UNCRPD Article 12 Right to Equal Treatment Before the Law.  This is a unique role that adult social workers undertake and one worth signposting during Learning Disability Week."
        },
        {
            "heading": 2,
            "text": "Rumbidzai Mashavave, newly qualified social worker"
        },
        {
            "text": "Many years ago, I was involved in producing a song as part of a youth project. The main message was this: \"Be the voice you want to hear, be the tomorrow you want to see. It begins with you\".  And that made me realise the importance of voting. Adding that one vote could tilt the scales and deliver the changes I want to see."
        },
        {
            "text": "As a social worker, I understand it’s not just my vote, but also those of the people often forgotten by society or labelled as lacking mental capacity simply because they have a learning disability. It is our responsibility as social workers to educate, inform and enable people to go and vote – as is their right."
        },
        {
            "text": "And that is what Promote the Vote is all about. Walking into a home to talk about voting and leaving support staff and residents feeling excited about the opportunity was like moving the scales."
        },
        {
            "heading": 2,
            "text": "The value of experience"
        },
        {
            "text": "Westminster was a nice experience, meeting different people with different experiences. It was interesting to hear different voices and listen to what’s going to happen next with people who have difficulty voting."
        },
        {
            "text": "I liked the London trip because it was so fun and I made everyone proud of what I am doing. I took loads of photos and didn’t get lost in London. I got to the coach on time and said thank you to everyone, as well."
        },
        {
            "text": "Promote the Vote got everyone together and we worked as a team. It was inclusive and information was broken down so that we could understand. Taking photos and working together also helped us to understand. I like Promote the Vote because I got the opportunity to help everyone out and I participated in setting up a mock polling station."
        },
        {
            "text": "I don’t really understand the voting process, but I liked getting involved by working as a team, as a family even. It is about listening to other opinions and it’s all about equality: how you feel and another person feels. Everyone understands differently, no one knows everything, but we share experiences."
        },
        {
            "text": "Don’t judge a book by its cover."
        }
    ]
}