{
    "url": "https://environmentagency.blog.gov.uk/2022/06/22/telling-the-difference-between-an-algal-bloom-and-sewage/",
    "title": "Telling the difference between an algal bloom and sewage",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-06-22T14:48:02+00:00",
    "content": [
        {
            "text": "Every year we receive many reports of suspected sewage pollution, at coastal waters in particular, that are in fact the breakdown of algal blooms."
        },
        {
            "text": "It’s easy to mistake algae for sewage, particularly as both have an unpleasant smell, but if you notice foam on the water’s surface or on the beach it’s more likely to be the result of an algal bloom breaking down."
        },
        {
            "text": "Throughout the summer months, large blooms of Phaeocystis: a common, non-toxic algae, form in British coastal waters when the temperatures are warmer and there’s more sunlight. Algal blooms are a natural part of water ecology and when they accumulate, more so in early summer, they produce clouds of frog-spawn like colonies which look a little like oil drops in the water. However, it’s when they start to breakdown, that their appearance, and smell, may be mistaken for sewage. Creamy-brown foam can appear on the water’s surface and if near cliffs or headlands, the foam may look like thin layers or lines due to the waves. In exceptional cases the blooms can form thick blankets alongside the shoreline."
        },
        {
            "text": "When you get a large bloom breaking down, it can give off the smell of rotten eggs or vegetables. A smell also given off by decomposing seaweed."
        },
        {
            "text": "Another common, non-toxic type of marine algae is Noctiluca. Often forming red, orange or brown discolouration of the water known as ‘red tide’, it can also produce a scum. And, due to its bioluminescence whereby a chemical reaction causes it to produce light, it is also known as ‘sea sparkle’."
        },
        {
            "text": "A literature review we carried out, and recent guidance from the World Health Organisation suggest the risks to human health from contact, ingestion or inhalation with marine algae that currently occur in UK coastal waters are considered to be low. When blooms are reported to us we take samples of the water to confirm if the algae are toxic or not. In the event that a toxic bloom is identified, the relevant local authority or landowner will post warning signs. If it is a designated bathing water – we will post advice against bathing on our Swimfo website."
        },
        {
            "text": "Toxic freshwater algae"
        },
        {
            "text": "In freshwaters, particularly lakes, blue green algae (cyanobacteria) have the potential to be harmful by forming blooms and scums which can be highly toxic to humans and animals. Blooms can discolour the water varying between blue-green, green or greenish brown, they can also look like flakes of green sawdust, or brownish pinheads. During calm weather cyanobacterial blooms can form scums which are often blown to the shoreline of lakes, these can look like paint, jelly or flock. When blooms and scums decay they can sometimes leave a lasting blue-green colour."
        },
        {
            "text": "Contact with blue-green algal blooms or scums should be avoided as they can be toxic and can lead to a variety of symptoms including vomiting and diarrhoea. For dogs and livestock, ingestion of scums can be fatal, so pet owners and farmers need to keep animals away. Again, warning signs advising against bathing will be displayed if a toxic bloom is confirmed."
        },
        {
            "text": "How to tell the difference between algae and sewage when at the coast"
        },
        {
            "text": "Confusing algae for sewage is an easy mistake, but there are a few tips to help you tell the difference:"
        },
        {
            "text": "You can’t tell if an algal bloom in the sea, lake or river is toxic just by looking at it, so it’s safest to assume it is and avoid contact with the water or algae."
        },
        {
            "text": "If you are concerned that what you see is not algae and is some other kind of pollution, please phone the Environment Agency hotline on 0800 807060 and avoid the water."
        },
        {
            "text": "For information on which designated bathing waters are affected by algae visit the Environment Agency’s Swimfo website Bathing water quality (data.gov.uk)"
        },
        {
            "text": "Know before you go – check Swimfo for details of over 400 bathing waters in England. Avoid algal blooms in marine or freshwaters. If you suspect pollution, phone the Environment Agency’s hotline on 0800 807060 and avoid the water."
        }
    ]
}