{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/06/22/the-metaverse-and-immersive-technologies-a-regulatory-perspective/",
    "title": "The Metaverse and immersive technologies – A regulatory perspective",
    "authors": [
        "Jane Howe"
    ],
    "categories": [
        "DRCF"
    ],
    "pub_date": "2022-06-22T13:02:47+01:00",
    "content": [
        {
            "text": "The metaverse. Is it hype? Or will it be the ‘successor state’ of the internet? Current consensus is there is no consensus on what the metaverse is or – perhaps more pertinently – could be."
        },
        {
            "text": "Nor would it be expected."
        },
        {
            "text": "A nascent ‘new “medium”’ comprised of various technologies – some established, some emerging, some yet to be created – the “stack” over which something we may call “the metaverse” could be delivered is currently unclear. Yet within those fuzzy boundaries, various technologies and activities are clearly with us today: virtual reality (VR), augmented reality (AR) and distributed ledger technologies (DLTs) alongside devices both familiar (your mobile) and less familiar (your VR headset)."
        },
        {
            "heading": 2,
            "text": "The Metaverse Symposium"
        },
        {
            "text": "On 17 May 2022, the Digital Regulation Cooperation Forum (DRCF) brought together industry, analysts, academics, government and regulators at its ‘Metaverse Symposium’, held in partnership with Digital Catapult, to exchange ideas and perspectives on the potential implications of the metaverse and associated immersive technologies for people, businesses and the wider economy."
        },
        {
            "text": "The Metaverse Symposium was the first held as part of the DRCF’s new technology horizon scanning programme, a series of initiatives organised to further engage with those who are creating the technologies, products and services that will shape the future of UK digital services."
        },
        {
            "text": "Alongside those in the DRCF, the event was attended by senior decision-makers across government (including the Department for Digital, Culture, Media and Sport (DCMS) and the Department for Business, Energy and Industrial Strategy (BEIS)) and within industry (with corporates such as NVIDIA alongside start-ups and scale-ups including Parity Technologies and Edify). Venture capitalist investors and consultants joined legal and technology academics together with consumer and civil society representatives for a day that involved:"
        },
        {
            "heading": 2,
            "text": "Opportunities"
        },
        {
            "text": "Current and potential use cases abounded. Gaming and entertainment. Education. Retail. Industry and manufacture. Work and socialising."
        },
        {
            "text": "Could VR training allow surgeons to hone their craft without risking patient safety? Is AR ‘try before you buy’ technology already revolutionising the online retail experience and reducing wasteful returns? Would the metaverse support a decentralised ‘creator economy’ comprised of new jobs within new sectors hosting new business models?"
        },
        {
            "heading": 2,
            "text": "And common themes"
        },
        {
            "text": "Key themes also emerged:"
        },
        {
            "text": "But how important is it? And at what level in the metaverse stack would it be most effective? Could – should – a consumer be able to take a digital asset into any part of the metaverse? Would shared tools and standards provide the foundation for open competition or hold back innovation?"
        },
        {
            "text": "But what are the envisaged revenue streams? And who would be best placed to tap into them? Do creators ‘just need to be good’ to challenge incumbents? Could smart contracts allow owners to track the economic activity of their assets and take a share in revenue?"
        },
        {
            "heading": 2,
            "text": "Implications for regulators"
        },
        {
            "text": "Safety and privacy were first amongst the societal and consumer issues raised – from the impact of online harms and moderating real-time content in a three-dimensional virtual environment to appropriate safeguards for haptics* and headsets gathering significant quantities of sensitive data."
        },
        {
            "text": "Proprietary rights, payments and consumer protection were also raised, particularly in the context of digital assets."
        },
        {
            "text": "The likelihood of a decentralised economy bypassing today’s digital platforms divided opinion, opening questions on where competition might be most important within the metaverse stack and how a widely decentralised metaverse might be regulated."
        },
        {
            "text": "While such issues are not themselves novel, they highlight both:"
        },
        {
            "text": "Timing is important as is geography. Our challenge is to ensure that any UK interventions support rather than stifle innovation and move swiftly enough to prevent any problems becoming entrenched – bringing the benefits of technology to UK society while mitigating any harms."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The ‘Metaverse Symposium’ highlighted the importance of continued communication between industry, analysts, academics, government and regulators."
        },
        {
            "text": "Given the metaverse’s potential implications for finance, content, competition and data, it is essential that we as regulators are joined up in engagement with and learning about these technologies. As products and services with their associated opportunities and risks become increasingly interconnected, so must we within the DRCF to ensure that consumers’ and citizens’ interests are at the heart of digital innovation."
        },
        {
            "text": " "
        },
        {
            "text": "The DRCF’s next event in its new technology horizon scanning programme will consider the implications of Web 3.0."
        },
        {
            "text": "Should you have any further suggestions of technologies or topics relevant to the DRCF’s new technology horizon scanning programme, please do get in touch via our mailbox JoiningUpOnFutureTech@ofcom.org.uk."
        },
        {
            "text": " "
        },
        {
            "text": "Read Digital Catapult's blog on the Metaverse Symposium."
        },
        {
            "text": " "
        },
        {
            "text": "*Haptics - the use of technology that stimulates the senses of touch and motion, particularly for the simulated reproduction of sensations that would be felt by someone interacting directly with physical objects."
        }
    ]
}