{
    "url": "https://civilservice.blog.gov.uk/2022/06/22/the-civil-servant-keeping-military-service-in-the-family/",
    "title": "The civil servant keeping military service in the family ",
    "authors": [
        "Lesley Woods"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-06-22T08:35:40+00:00",
    "content": [
        {
            "heading": 3,
            "text": "On National Reserves Day (22 June), Ministry of Defence civil servant and RAF Reservist Lesley Woods is proud to be the third generation in her family to serve. From eating a sheep’s head in Jordan to rescuing stranded baby turtles on Ascension Island, or evacuating a TV crew from a burning tent, Lesley’s grabbed every opportunity and is now bringing forward the next generation."
        },
        {
            "text": "I wanted to join the RAF from the age of eight; I grew up on epic stories of crazy adventures, my bedroom shelves filled with postcards and presents from exotic locations."
        },
        {
            "text": "Carole Woods, nee Carole Murphy [centre]My mum kept a photo album of her time as a dental nurse in the Women’s Royal Air Force in the sixties and seventies, mostly photos of parties! She was a poster girl for the 1972 recruitment pamphlet, chosen for her glamorous good looks, following her own mother’s example of service behind the wheel of an ambulance in the Auxiliary Territorial Service of the 1940s.   "
        },
        {
            "text": "Mission impossible"
        },
        {
            "text": "At age 21, the RAF turned me down at Officer Selection. I had joined the Air Cadets, done my research, prepared for all the interviews, but I was too keen. "
        },
        {
            "text": "“Go get some life experience,” they advised. I pursued my second love, public relations and media, and my ambition of joining faded into memory. It was only after a chance encounter with a Reservist who said there was such a thing as a ‘Media Squadron’ that I tried again aged 33. I also joined the Civil Service that year."
        },
        {
            "text": "I’ve often used the skills learned in the Reserves to help me in my Civil Service career, but I always felt that the two roles demanded different qualities. I had feedback that my day job colleagues thought I was very militaristic in my line management, too forthright in my approach, yet that same unflappable confidence helped me progress to a Grade 7 role. "
        },
        {
            "text": "Mould breaker"
        },
        {
            "text": "In my initial officer training, one of my RAF instructors asked that I “refrain from using media language” when I briefed others. As a mature woman, expected to lead men in their late teens and early twenties, he thought my approach undermined strong leadership. They seemed concerned I didn’t fit the mould – I’m very glad I didn’t! "
        },
        {
            "text": "As I progressed through courses at the Defence Academy in Shrivenham, I gained an appreciation of how I could add value by remaining my authentic self. I started to bring everything I was to both jobs, rather than compartmentalise myself as fitting into either one perfectly. This is the real value of what Reservists bring – we have a different perspective on life, with a foot in both camps. For me, the lesson of seeking to lead (and know) yourself before leading others is key. "
        },
        {
            "heading": 4,
            "text": "A woman's place "
        },
        {
            "text": "Being a female leader in Defence can be tough. I never took maternity leave, I chose not to start a family, but I’m now in that other M word that’s currently a hot topic – menopause. Reflecting on how times have moved on for women in the Armed Forces, I’m conscious of how much still needs to change."
        },
        {
            "text": "I’ve been very lucky in my own adventures, with opportunities that my grandmother and mum could only have dreamt of. From eating sheep’s head in Jordan, to rescuing stranded baby green turtles on Ascension Island, or evacuating a documentary crew from a burning toilet tent in Afghanistan, I’ve experienced many memorable moments from being a Reservist. But those are stories for another day! "
        },
        {
            "heading": 4,
            "text": "Be a Babel Fish* "
        },
        {
            "text": "In March 2020 I was tasked to lead a combined media team at Army Headquarters, but lead it as a civilian. The advantage is that I was able to combine the best of both my worlds, effectively listening and translating for each side of the team. If I had been in uniform, I may not have had the ear of more senior military staff, which was essential to our success. Conversely, if I lacked my Reserve experience, I may not have had the confidence of my team; still some cultural issues to iron out!  "
        },
        {
            "heading": 4,
            "text": "Back to the future "
        },
        {
            "text": "My Dad joined the RAF as a 15-year-old apprentice in 1963, going on to serve almost 40 years. He passed away two years ago, leaving me a box crammed with military souvenirs and the advice to always look after others ahead of myself. In my part-time role as a Squadron Leader for RAF Media Reserves, it’s now about what I can give back to the next generation joining after me. I wouldn’t hesitate to recommend this as a second career alongside the ‘day job’. We could use more babel fish! "
        },
        {
            "text": "If you come across a Reservist in your office, ask them what their best adventure has been… you never know what stories you might uncover. "
        },
        {
            "text": "* Douglas Adams 1979 novel ‘The Hitchhiker’s Guide to the Galaxy’ – a babel fish is a universal translator in the form of a small fish that you place in your ear. "
        }
    ]
}