{
    "url": "https://defradigital.blog.gov.uk/2022/06/22/why-reserves-day-is-important-to-me/",
    "title": "Why Reserves Day is important to me",
    "authors": [
        "Steve Reynolds"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital"
    ],
    "pub_date": "2022-06-22T07:00:38+01:00",
    "content": [
        {
            "text": "On Reserves Day, Deputy Director Defra Group Head of Architecture & Standards (and Army Reservist) Steve Reynolds explains what being a Reservist means to him, and how he’s managed to balance his military commitment with a full-time and demanding Civil Service career."
        },
        {
            "text": "I’m privileged, as the Defra Group Reserve Forces Champion and (still, just about) an Army Reservist, to have been asked to write a short blog post for Armed Forces Day about my experience of having been a Forces Reservist in the Civil Service, though it does feel slightly incongruous that as I write this the Army Personnel Centre is currently processing my discharge papers in what is my 30th year of service, particularly given current world events."
        },
        {
            "text": "The contribution of our Armed Forces in general and our Reservists to our safety and security, both in times of conflict, but also during civil emergencies like floods & disease outbreaks (including the Covid pandemic), is what Reserves Day celebrates."
        },
        {
            "text": "Reservists give up their spare time to serve in the Reserve Forces, balancing their civilian life with a military career to ensure that should their country require them, they would be ready to serve as part of the military."
        },
        {
            "text": "The Reserve Forces make up approximately one sixth of our Armed Forces personnel and as such are integral to protecting the nation’s security at home and overseas, particularly providing capability in specialist areas such as medical and cyber."
        },
        {
            "text": "We have a number of colleagues across Defra who are active Reservists, across all three services, and an even greater number of Armed Forces veterans who have chosen to work in Defra organisations after finishing their military careers."
        },
        {
            "heading": 2,
            "text": "Joining up in 1992"
        },
        {
            "text": "I joined what was then called the Territorial Army or ‘TA’ in 1992, in my local Royal Artillery unit.  At the time I was working in retail. A few years later I chose to leave that job and return to full-time education to do a degree in ecology and conservation management."
        },
        {
            "text": "That ultimately led me to a job with the Farming and Rural Conservation Agency, an Arm’s Length Body of what was then the Ministry of Agriculture Fisheries and Food (MAFF), as a Countryside Stewardship Adviser."
        },
        {
            "text": "Some of the military training in logistical planning and operations that I received as a Reservist almost immediately came to bear in my Civil Service role as Foot and Mouth Disease took hold and I found myself involved in setting up and running one of the regional livestock movement licensing units."
        },
        {
            "heading": 2,
            "text": "Suddenly, I was a real soldier"
        },
        {
            "text": "Quid pro quo came about in early 2004 when sitting at my desk in the Bury St Edmunds office one morning my phone rang. It was my Commanding Officer informing me that we were mobilising a Troop from the Regiment for Operation TELIC in Iraq, and did I want to lead it? He gave me a few days to “think about it” but after a very quick conversation with my line manager to give them the good news I rang the CO back within the hour."
        },
        {
            "text": "A few months later I was second in command of a Battery providing Force Protection for the main British logistics base just outside of Basra. As you can imagine it was an “interesting” six months, managing patrols around a 14km base perimeter and the surrounding area and protecting logistical convoys around the UK area of operations across the south of the country."
        },
        {
            "text": "We had our fair share of hair-raising moments, plenty of amusing ones. Such as when the Royal Marines unit on the base decided to start their “Shaibah Olympics” off with a bang. Literally. Using 1.5lbs of plastic explosive, putting the entire base onto high alert because we thought we were being mortared. I found the base Commandant in body-armour and helmet under his bed. He wasn’t amused!"
        },
        {
            "text": "Also some heart-warming moments, such as when we were providing protection for civil engineering contractors carrying out repairs on electrical substations as part of the reconstruction effort. We were able to blag some heavy-duty cable from them that enabled one of the local villages to be reconnected to the power in time for the wife of one of the local civilians that we employed on the base to give birth to their child under electric light. Despite all the politics around the justification for the Iraq war, those of us who were deployed did so in the hope that at a local level we could help make the Iraqi people’s lives a bit better."
        },
        {
            "heading": 2,
            "text": "Working at Defra has enabled me to be a soldier at the weekend and a civilian in the week"
        },
        {
            "text": "The flexibility of the Civil Service as a reservist-friendly employer continued to be advantageous after I returned from Iraq and took command of my local unit. I moved to a four-day working week to accommodate the additional demands of my Reservist career. I led the unit through a major transition and change of cap-badge from artillery to Army Air Corps."
        },
        {
            "text": "Again, the skills and experience gleaned from my military career has continued to serve me well throughout my civil service career since, not least because it has given me the confidence to step out of my comfort zone and have a go at anything, which has undoubtedly led to me following the career path that I have, from ecology into technology. The night shifts in the Ops Room were good practice for cutover weekends!"
        },
        {
            "text": "Balancing the competing demands of family life, a busy job and a reservist career can seem daunting, but, though the skills and experience that I was able to bring from one role to the other were complimentary, I also found my reservist career was the perfect counterpoint to my civilian one."
        },
        {
            "text": "There’s nothing like spending the weekend yomping 30km across the Brecon Beacons, or “under the disc” refuelling an Apache helicopter with the rotors turning to take your mind completely away from the day job! It developed my leadership skills, resilience, self-confidence & teamwork. I’ve made lifelong friendships, the sort where you can see someone again after years and at once fall back into the stride of shared experiences."
        },
        {
            "text": "I’m proud to have been an Armed Forces Reservist and it’s something that I wholeheartedly commend to anyone who is considering it. You should feel assured that Defra is a fully supportive employer. I’m very happy to offer advice and support if you’d like to get in touch."
        }
    ]
}