{
    "url": "https://opss.blog.gov.uk/2025/07/14/ais-evolving-role-in-product-safety/",
    "title": "AI’s Evolving Role in Product Safety",
    "authors": [
        "Research Strategy and Delivery Unit and the Technology Team"
    ],
    "categories": [
        "Careers at OPSS"
    ],
    "pub_date": "2025-07-14T15:59:03+01:00",
    "content": [
        {
            "text": "“Artificial Intelligence is the defining opportunity of our generation”This quotation from the Prime Minister in the January 2025 Plan for Change captures the importance of harnessing the power of pioneering AI to advance government policy and practice. The Office for Product Safety and Standards (OPSS) recognises the impact of AI on consumer product safety and standards, particularly as the market demand for AI-driven consumer products has rapidly accelerated in recent years. AI has become increasingly sophisticated, and more and more products are marketed as having AI functionality. To capture the rapidly evolving trends in AI and to monitor the benefits and risks of the role of AI in product safety, OPSS recently delivered an update to its 2021 report on AI in consumer products.  "
        },
        {
            "text": "What did the research find? "
        },
        {
            "text": "The research highlights a range of changes in the use of AI since 2021. Notably, the use of Generative AI to produce content including images, videos and audio has become commonplace. Regarding consumer trends, smart connected home devices, often featuring AI, have grown by a third since 2017-2018. The research also notes the rising use of smart wearables with integrated generative AI. For example, smart glasses’ innovative functions include image recognition with real time descriptions, translation of foreign languages and use by drivers to monitor fatigue and provide hazard alerts. Robotics have evolved to include AI-driven assistance with domestic chores, allowing user interaction, as well as their development for use in industrial settings, such as to guard and patrol warehouses. "
        },
        {
            "text": "Enhanced convenience, customisation, safety and security are all portrayed as benefits of AI for the consumer. For example, AI enables timely repair and replacement of product parts through continuous smart performance monitoring. This has the potential to reduce safety incidents caused by malfunctioning products. Some consumer products, such as smart wearable devices, can ‘memorise’ the user's data to provide personalised recommendations. In addition, AI security features, such as facial recognition on mobile phones, have the potential to safeguard privacy through enhanced control over data.  "
        },
        {
            "text": "Despite these advantages and the potential of AI to streamline daily tasks and change entire industries, the report also critically discusses the potential for AI-related harm. These range from physical risks, such as injury caused by robot malfunctioning, to non-physical harms, such as privacy violations. While there is a growing body of evidence documenting incidents of non-physical harms resulting from the integration of AI into consumer products, evidence of physical harm is limited. Nevertheless, the research suggests that physical harms are possible in theory, which highlights the importance of monitoring and reporting AI-related hazards. "
        },
        {
            "text": "Highlighting the recognition of the potential risks of using AI, since 2021 there have been a range of developments in regulation and policy. Many countries have established bodies to consider the risks of AI, such as the UK’s AI security institute. Some countries, including the UK, US, Singapore and Japan have opted to regulate AI using non-statutory methods; this differs from the law-based approach of the EU, South Korea and China. Governments are required to negotiate the challenge of maintaining an effective balance between enabling AI innovation with ensuring regulation mitigates AI-related risks. "
        },
        {
            "text": "The research recommends continued collaboration between countries and international organisations to monitor AI developments, apply regulatory and policy measures and engage with key stakeholders, including consumers, businesses and academics to guarantee AI is safe, responsible and trustworthy.  "
        },
        {
            "text": "How will OPSS use these findings in policy and practice?"
        },
        {
            "text": "OPSS is very aware of the use of AI in products, and the regulatory challenges for product safety associated with that, thanks to its work on the subject including the research referenced here. Its Product Regulation and Metrology Bill, which has recently passed through all its parliamentary stages, includes powers to ensure the UK’s regulatory framework can keep pace with emerging technologies such as AI. "
        },
        {
            "text": "Read the full report: Update on OPSS artificial intelligence (AI) research - GOV.UK"
        },
        {
            "text": "Opportunities to work at the forefront of AI development and regulation with OPSS  "
        },
        {
            "text": "At OPSS, we are developing effective government policy and practice regarding the use and regulation of AI to keep people and places safe from product related harm.  "
        },
        {
            "text": "To find out more about opportunities to help ‘shape the AI revolution’ within OPSS, keep an eye out for the latest vacancies: Home - OPSS.  "
        }
    ]
}