{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/07/14/join-our-first-global-public-design-conference/",
    "title": "Join our first global public design conference",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign"
    ],
    "pub_date": "2025-07-14T15:00:00+01:00",
    "content": [
        {
            "text": "This September, we’re bringing government designers together from around the world for a first-of-its-kind conference. We’re inviting designers like you – working in local, regional, national and international governments – to join us for a practical conversation about the future of design in government."
        },
        {
            "text": "The global Public Design Conference, on 11 September 2025, is part of the World Design Congress Design Safari. It will connect public sector designers working across disciplines, countries and levels of government. You’ll be able to attend in person at the Royal College of Art in London, or online from wherever you are."
        },
        {
            "text": "We’ve been working with more than 100 designers in 48 government teams over the summer to build a network of global collaboration. This conference is your chance to meet them, learn from their experiences, and share your own."
        },
        {
            "heading": 2,
            "text": "Why we’re focusing on public design patterns"
        },
        {
            "text": "The theme of this year’s conference is global public design patterns."
        },
        {
            "text": "Design patterns are solutions to recurring problems in services and policies. They are evidence-based, tested approaches that help designers and teams avoid reinventing the wheel. Patterns give us a shared language for solving design problems efficiently and consistently across governments. They are practical building blocks for improving how governments deliver outcomes."
        },
        {
            "text": "At the conference, we’ll explore how these patterns are emerging across different governments, and how we can collaborate internationally to improve and share them."
        },
        {
            "heading": 2,
            "text": "Who you’ll hear from"
        },
        {
            "text": "We’re bringing together design leaders from government and academia who’ve been advancing public design in their countries and organisations."
        },
        {
            "text": "Our keynote speakers include:"
        },
        {
            "text": "Christian Bason, Co-founder of Transition Collective and Adjunct Professor at the University of Technology Sydney"
        },
        {
            "text": "Sabine Junginger, Professor at Northumbria School of Design"
        },
        {
            "text": "Nikola Goger, Head of Design at the UK’s Ministry of Justice"
        },
        {
            "text": "And our hosts will be:"
        },
        {
            "text": "Andrew Knight, Head of Policy Design for the UK Civil Service"
        },
        {
            "text": "Nicolás Rebolledo, Senior Tutor in Service Design at the Royal College of Art"
        },
        {
            "text": "You’ll also hear from the 48 international teams who have been taking part in our series of summer mini-conferences – sharing their patterns, their learning and their practical challenges."
        },
        {
            "text": "And, perhaps most importantly, you’ll meet other designers working in government and have the chance to build new collaborations."
        },
        {
            "heading": 2,
            "text": "Why now"
        },
        {
            "text": "Public policy and service design will be showcased at the World Design Congress, which has been highlighting the value of design for 34 years."
        },
        {
            "text": "The Congress is hosted by the UK’s Design Council in London and will be followed by a ‘Design Safari’ of events and activations that dive deeper into this year’s crucial Design for Planet theme."
        },
        {
            "text": "Our Public Design Conference on the 11th of September features in the Design Safari and will bring together designers from around the world to explore how public design in government can help solve some of the most complex public challenges we face today."
        },
        {
            "heading": 2,
            "text": "How to take part"
        },
        {
            "text": "The conference will take place on 11 September 2025, hosted by the Royal College of Art in London, the world’s top-ranked design university and a member of the World Design Organization."
        },
        {
            "text": "We know not everyone can travel to London, so the event will be fully hybrid. You’ll be able to take part online and contribute to the discussions and workshops from wherever you are."
        },
        {
            "text": "Tickets for the Global Public Design Conference are free, but are limited to designers working in government. You’ll also get free online access to the World Design Congress, with the option to purchase a discounted in-person Congress ticket if you wish."
        },
        {
            "heading": 2,
            "text": "Help us shape the future of public design"
        },
        {
            "text": "Designers in government are solving some of the world’s most important problems – but we don’t have to do it alone. By sharing patterns and learning from one another, we can make our work better, faster and more sustainable."
        },
        {
            "text": "Join us in September to help build the next chapter of global public design."
        }
    ]
}