{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/07/14/shark-awareness-day-2025/",
    "title": "Shark Awareness Day 2025",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Deep Specialist",
        "Guest Blog",
        "Our People & Deep Dives",
        "Science"
    ],
    "pub_date": "2025-07-14T09:45:55+01:00",
    "content": [
        {
            "text": "By Sophy Phillips and Jim Ellis, Centre for Environment, Fisheries and Aquaculture Science (Cefas)"
        },
        {
            "text": "Monday 14 July is Shark Awareness Day and whilst many people associate sharks with the clear, blue seas of the tropics, many species of shark and ray occur around the British Isles. These can range in size from some of our small-bodied skates, such as the starry ray, which grows to a length of just over 60 cm in British waters, to the basking shark, which may grow to 10m or more, and is the second largest fish species on our planet."
        },
        {
            "text": "Sharks in British waters"
        },
        {
            "text": "The more common species of shark in our waters include the lesser-spotted dogfish (which is actually a type of catshark), starry smooth-hound, and spurdog. Some of the rarer species include white skate and angel shark which are both protected species, as is the basking shark."
        },
        {
            "text": "Some shark and ray species, including lesser-spotted dogfish and skates, lay eggs on the sea floor, with the young emerging from the egg case after four months or more. Other species give birth to live young, and in the case of spurdog, the mother may be pregnant for nearly two years."
        },
        {
            "text": "Sharks and rays often have specialised feeding habits. Basking sharks are filter-feeders that sieve the water for plankton whilst the blue shark favours small pelagic fish and squid."
        },
        {
            "text": "The lesser-spotted dogfish eat a wide range of invertebrates including crabs, hermit crabs, whelks and, worms."
        },
        {
            "text": "Centre for Environment, Fisheries and Aquaculture Science (Cefas)"
        },
        {
            "text": "Scientists at the Centre for Environment, Fisheries and Aquaculture Science (Cefas) have been involved in the study of sharks and rays for several decades, providing scientific advice to Defra, and contributing to the work of a range of intergovernmental organisations."
        },
        {
            "text": "Given the dual commercial and conservation interests surrounding sharks and rays, we actively engage with both scientific assessment and conservation bodies. We hold positions on and support the work of assessment groups, such as the International Council for the Exploration of the Sea Working Group on Elasmobranch Fishes (ICES WGEF), as well as conservation-focused organisations including The International Union for Conservation of Nature (IUCN) Shark Specialist Group and The Memorandum of Understanding on the Conservation of Migratory Sharks (Sharks MOU)"
        },
        {
            "text": "In our roles as fisheries scientists, we are lucky enough to see the end-to-end process from collecting data on sharks and rays. This includes their biology, movements, distribution and, catch rates. We use such data to inform assessments of stock health, and ultimately to support advice to fisheries managers (e.g. informing fishing quotas and other measures) and nature conservation measures."
        },
        {
            "text": "Get involved this Shark Awareness Day"
        },
        {
            "text": "On this Shark Awareness Day, we are encouraging everyone to learn more about the vital role sharks play in our oceans and how we can help protect them. You can get involved by finding out more about our work or joining citizen science projects like those listed on the Shark Trust website, which allow people of all ages to contribute to shark conservation efforts."
        },
        {
            "text": "Making informed consumer choices also plays a big part, you can:"
        },
        {
            "text": "Every action, no matter how small, contributes to the protection of these incredible creatures and the ecosystems they support."
        }
    ]
}