{
    "url": "https://civilservice.blog.gov.uk/2025/07/14/why-talking-about-menopause-matters-our-conversation-with-mariella-frostrup/",
    "title": "Why talking about Menopause matters - our conversation with Mariella Frostrup",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "Health & Wellbeing"
    ],
    "pub_date": "2025-07-14T14:02:20+00:00",
    "content": [
        {
            "text": "Talking about menopause at work should never be awkward. Angela MacDonald and Fiona Ryland explain why it’s time we changed the culture - for good."
        },
        {
            "text": "Conversations about menopause at work have come a long way - but they're still not always easy."
        },
        {
            "text": "Recently, we met Mariella Frostrup, the Government Menopause Employment Ambassador, to speak frankly about where we are, where we are going, and why this matters to us both - personally and professionally."
        },
        {
            "text": "The renowned broadcaster, journalist and campaigner for women’s equality, Mariella was appointed to this role in October 2024. "
        },
        {
            "text": "As an Ambassador, Mariella works directly with employers to raise awareness of menopause as a workplace issue and to promote better support for women at work."
        },
        {
            "text": "Our meeting with her focused mainly on:"
        },
        {
            "text": "Here we share our reflections on that conversation:"
        },
        {
            "text": "Angela MacDonald"
        },
        {
            "text": "Deputy Chief Executive and Second Permanent Secretary, HMRC"
        },
        {
            "text": "Senior Sponsor, Cross-Government Menopause Network"
        },
        {
            "text": "It’s brilliant to have a high-profile figure like Mariella shining a light on menopause at work. People like her help push topics  often seen as difficult or uncomfortable into the mainstream. That visibility matters, it helps open up space for conversations that haven’t always been easy."
        },
        {
            "text": "This meeting really gave me pause for thought. I’ve been through my own menopause journey, and I’m in a position now where I feel comfortable speaking about it publicly. I don’t fear any negative consequences in my job for doing that. But this meeting reminded me that not everyone has that same sense of safety or confidence."
        },
        {
            "text": "Fear is still very present for many people. When symptoms are affecting your day-to-day life, your focus, your energy, your wellbeing - it can be really hard to find the resilience to speak up. If you’re not sure how your manager or team will respond, it’s understandable that many choose to say nothing. That’s why we need to keep talking about this. It’s about creating the kind of working culture where people know they’ll be listened to, supported, and not judged."
        },
        {
            "text": "I left the meeting feeling encouraged by how far the conversation has come in recent years, but also more determined than ever to make sure we keep pushing forward, across every department and at every level."
        },
        {
            "text": "Fiona Ryland"
        },
        {
            "text": "Government Chief People Officer, Cabinet Office"
        },
        {
            "text": "This meeting was a valuable opportunity to reflect on the work already happening across the Civil Service and to make time for a conversation that affects so many of us. As of 2024, 54.5% of our workforce are women. That’s a clear signal of how widespread the impact of menopause can be, not just individually, but across teams and organisations."
        },
        {
            "text": "For me, one of the most important takeaways was the need to make sure we’re creating environments where women feel able to talk about how they’re feeling, describe their symptoms, and ask for help when they need it. If we don’t do that, we risk people feeling isolated or unsupported and that affects their ability to engage and perform at their best."
        },
        {
            "text": "This isn’t just a women’s issue. It affects all of us, either directly or through the people we live and work with. The more we understand about what menopause can involve, and the more open we are in talking about it, the better chance we have of building a truly supportive and inclusive Civil Service culture."
        },
        {
            "text": "That includes making sure line managers feel confident too. They’re often the first point of contact for someone struggling, and they need to know how to respond and where people can find more help and support. Supporting line managers to do that well is a big part of getting this right."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "We all have a part to play in making the Civil Service a supportive place for colleagues experiencing menopause. Whether it’s sharing your own experience, supporting someone, or starting a conversation in your team - small actions can make a big difference. "
        },
        {
            "text": "The Inclusive Practice Team based in the Cabinet Office is currently exploring  ways to embed consistent support across departments aimed at building sustainable change over time. "
        },
        {
            "text": "Support is available"
        },
        {
            "text": "For more information or to connect with the network, contact Audrey Whelan, Chair of the Cross-Government Menopause Network at Audrey.WHELAN@education.gov.uk"
        }
    ]
}