{
    "url": "https://dluhcdigital.blog.gov.uk/2021/11/16/9-projects-awarded-funding-through-local-digital-fund-round-5/",
    "title": "We’re awarding funding to 9 projects through Round 5 of the Local Digital Fund",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Fund"
    ],
    "pub_date": "2021-11-16T09:30:58+00:00",
    "content": [
        {
            "text": "Today we’re pleased to announce the 9 council-led digital projects that will be awarded funding through Round 5 of the Local Digital Fund."
        },
        {
            "text": "The aim of the Local Digital Fund is to help councils transform their digital services in line with the Local Digital Declaration. This latest funding round opened on 6 September 2021 and received 49 applications from 40 councils in just three weeks."
        },
        {
            "text": "In this blog post, we’re going to introduce the successful projects from Round 5 and let you know how to follow their progress."
        },
        {
            "heading": 2,
            "text": "What we set out to fund through Round 5"
        },
        {
            "text": "In keeping with our mission to fund projects that address shared local service challenges in common, reusable ways, we asked applicants to submit bids under one of two themes: development platforms and software. We also asked that projects under both themes be in either alpha or beta phase."
        },
        {
            "heading": 3,
            "text": "Theme 1: Development platforms"
        },
        {
            "text": "The projects that applied under this theme will explore how modern development platforms can enable councils to design and build different types of front-facing services by themselves. This will be with the purpose of meeting local needs, rather than having to rely on a supplier."
        },
        {
            "text": "No partners are required, which means we can focus on individual councils. However we are looking for solutions that are modular and shareable."
        },
        {
            "heading": 3,
            "text": "Theme 2: Software"
        },
        {
            "text": "The projects that applied under this theme will explore the development of new software solutions or services to address inflexible and legacy software, and/or to help reduce their cyber vulnerability."
        },
        {
            "text": "A lead council and council partners are required under this theme so that solutions can cater for different local needs, and are designed to be reusable by other councils."
        },
        {
            "text": "You can read more about how we developed this funding round in an earlier blog post."
        },
        {
            "heading": 2,
            "text": "How we chose the successful projects"
        },
        {
            "text": "Once the fund had closed and applications had been sifted, we invited 9 shortlisted projects to attend a virtual panel interview with members of the Local Digital Collaboration Unit and the wider department."
        },
        {
            "text": "After deliberation, the successful projects were chosen based on their ability to:"
        },
        {
            "text": "The winning projects join the 35 collaborative projects we have already funded since the Local Digital Fund launched in 2018. This includes the collaborative project LocalGovDrupal, which has developed a shared pool of code, resources, research and expertise that can reduce the cost of building a new council website by up to 80%, while ‘delivering great digital experiences to citizens’. The project recently concluded their beta phase and can now count 19 councils and 7 suppliers among their community."
        },
        {
            "heading": 2,
            "text": "The successful projects"
        },
        {
            "text": "A total of £2,329,968 of funding will be awarded to the following projects."
        },
        {
            "text": "Please note, some of the project names may change once work begins."
        },
        {
            "heading": 3,
            "text": "Round 5 alpha projects"
        },
        {
            "text": "Project: Low-code patterns for housing management\nLed by: London Borough of Redbridge\nFunding awarded: £150,000"
        },
        {
            "text": "This project will explore the development of a housing management platform that enables local authorities to move away from inflexible incumbent housing management solutions."
        },
        {
            "text": "Project: A community grants service\nLed by: Newcastle City Council\nFunding awarded: £123,320\nThis project seeks to integrate the process of users submitting grant applications with back office systems to ensure a seamless, timely and efficient process."
        },
        {
            "text": "Project: A digitised brokerage marketplace for child placement in the West Midlands\nLed by: Birmingham City Council\nFunding awarded: £148,135"
        },
        {
            "text": "This project seeks to improve how children’s placement data is captured and analysed. By doing this, important data such as demand supply and cost can be used to enable a more strategic and cost efficient approach to child placement across the region."
        },
        {
            "heading": 3,
            "text": "Round 5 beta projects"
        },
        {
            "text": "Project: A task management tool for neighbourhood services staff working in the field\nLed by: Colchester Borough Council\nFunding awarded: £286,000"
        },
        {
            "text": "This project will develop a platform to enable tasks and requests logged online by customers to route directly to officers in the field."
        },
        {
            "text": "Project: A collaborative platform for care workers and volunteers to support vulnerable individuals\nLed by: Royal Borough of Windsor and Maidenhead\nFunding awarded: £260,113"
        },
        {
            "text": "This project seeks to build a solution to bridge the gap between public sector services and the wider community. This will allow multiple professionals to refer individuals that are in-need, and will alert volunteers that are able to help via a smartphone notification."
        },
        {
            "text": "Project: Offline data input tool for field working council staff\nLed by: Birmingham City Council\nFunding awarded: £350,000"
        },
        {
            "text": "This project will develop a platform to enable field workers to capture data to present casework in a consistent format, and to provide the ability to assign 'risk markers’ to people or places."
        },
        {
            "text": "Project: A reusable directory of community services\nLed by: Royal Borough of Greenwich\nFunding awarded: £350,000"
        },
        {
            "text": "This project seeks to develop a reusable directory of community services so that residents can find community services. In addition, it will enable Voluntary and Community Sector (VCS) organisations to easily update and manage information on those services."
        },
        {
            "text": "Project: Special Education Needs top-up funding service\nLed by: Bristol City Council\nFunding awarded: £312,400"
        },
        {
            "text": "This project will develop a Special Educational Needs top-up funding service to address an inconsistent and inefficient manual assessment and funding application process."
        },
        {
            "text": "Project: A new digital waste service\nLed by: Rugby Borough Council\nFunding awarded: £350,000"
        },
        {
            "text": "This project will develop a new and flexible digital waste service that integrates front end resident user requests with back office delivery functions."
        },
        {
            "heading": 2,
            "text": "How to follow the projects"
        },
        {
            "text": "The funded projects will start this month, with alpha projects expected to produce outputs after 12 weeks and beta projects after 6 months."
        },
        {
            "text": "We will share regular progress updates on the projects during this time, so make sure to follow all our usual channels:"
        },
        {
            "text": "We’ll also be adding more content to the individual project pages on our website soon, so keep an eye on those!"
        }
    ]
}