{
    "url": "https://despatch.blog.gov.uk/2021/11/16/car-driving-examiners-whats-the-role-like/",
    "title": "Car driving examiners – what’s the role like?",
    "authors": [
        "Kelly Swift"
    ],
    "categories": [
        "Driving test",
        "Learning to drive"
    ],
    "pub_date": "2021-11-16T14:36:43+00:00",
    "content": [
        {
            "text": "We are launching our third phase of our campaign to recruit more car driving examiners with the aim of reducing waiting times created by the pandemic."
        },
        {
            "text": "We have reached our next phase to recruit more driving examiners across Great Britain to meet our overall aim of recruiting more than 300 additional examiners."
        },
        {
            "text": "This will allow us to increase testing further to help reduce the backlog."
        },
        {
            "text": "You can find out more about these roles  and apply at our dedicated driving examiner recruitment website."
        },
        {
            "text": "But what is it like to be a driving examiner?"
        },
        {
            "text": "Kelly Swift, 51, started as a driving examiner at Weston-super-Mare Driving Test Centre in June this year."
        },
        {
            "text": "She tells us her experience of the recruitment and training process, and how she’s finding her new role."
        },
        {
            "heading": 2,
            "text": "What did you do prior to this role?"
        },
        {
            "text": "I was running my own small business, a cafe in Somerset with my partner, so lots of customer service and quality control!"
        },
        {
            "text": "Prior to that I worked in a 6th form college where I gave learning and career advice to young adults. Both experiences have been really helpful in my new role as a driving examiner!"
        },
        {
            "heading": 2,
            "text": "What drew you to the role? "
        },
        {
            "text": "I didn’t know anything about driving tests, except my own experience of taking the test many years ago and my daughter’s test more recently."
        },
        {
            "text": "When delving a little deeper, I discovered a focus on customer service and sound decision-making was needed to be an examiner – 2 things which I felt I could bring to the table!"
        },
        {
            "text": "I also found the road safety aspects and the opportunity to learn a challenging new set of skills very appealing."
        },
        {
            "heading": 2,
            "text": "How was the recruitment process?"
        },
        {
            "text": "My experience of the recruitment process was a good one, everything seemed to go smoothly and the online interview worked well."
        },
        {
            "text": "I applied in February 2021 and took up my post at the end of June 2021 having done an online application, a competency-based assessment, a virtual interview and an assessment drive."
        },
        {
            "text": "The assessment drive was by far the most nerve-wracking thing for me as a driver who has had no tuition for over 30 years!"
        },
        {
            "heading": 2,
            "text": "What about the training?"
        },
        {
            "text": "Training consisted of 2 weeks virtual training and 4 weeks face-to-face training at Slough Driving Test Centre."
        },
        {
            "text": "I must confess I was worried about what the virtual training would be like, but it exceeded all my expectations and set the scene for what was to come."
        },
        {
            "text": "I was lucky enough to be part of a great group who really came together to support each other through the ups and downs! We had a mixture of backgrounds and skills, which was an advantage as we brought different strengths and weaknesses."
        },
        {
            "text": "The face-to-face training is certainly challenging and intense. I learnt an awful lot in a relatively short space of time, which is testament to the skills and knowledge of the great trainers and the support of my new colleagues."
        },
        {
            "heading": 2,
            "text": "Any memorable moments during the training?"
        },
        {
            "text": "One memorable moment was when one of our team, who shall remain nameless, asked their ‘candidate’ to ‘abort mission’ when unable to carry out an emergency stop. It was like we were working for NASA! Brings a smile to my face every time I brief an emergency stop."
        },
        {
            "heading": 2,
            "text": "How are you finding the role?"
        },
        {
            "text": "It’s going really well!"
        },
        {
            "text": "I’m enjoying learning the routes, which I found daunting at first, not knowing the area very well. But it’s now falling into place!"
        },
        {
            "text": "I’m also enjoying meeting a wide variety of people and trying to put them at ease as much as possible in high pressure situations."
        },
        {
            "text": "It’s also rewarding to know we are here to play an important part in reducing wait times for driving tests."
        },
        {
            "heading": 2,
            "text": "What’s the team like you work with?"
        },
        {
            "text": "The team has been lovely, supportive and welcoming. Our team is quite small, but it is a great mix of people with half of us being women. Many people assume that most examiners are men but this isn’t the case! Half the people I trained with were also women."
        },
        {
            "heading": 2,
            "text": "Any challenges?"
        },
        {
            "text": "A couple of hairy moments in the car with candidates have reminded me how important the role is for road safety."
        },
        {
            "text": "If I had a pound for every time a friend said: ‘Oh, I couldn’t do that, I’d be too scared!’ However, the training has really helped with mitigating the risks and learning to anticipate and manage effectively."
        }
    ]
}