{
    "url": "https://deframedia.blog.gov.uk/2021/11/16/government-sets-out-commitment-to-protecting-seabed-with-joint-statement-on-clearing-unexploded-ordnance/",
    "title": "Government sets out commitment to protecting seabed with joint statement on clearing unexploded ordnance",
    "authors": [
        "louiscollis"
    ],
    "categories": [
        "marine",
        "Weekly stories"
    ],
    "pub_date": "2021-11-16T17:13:09+00:00",
    "content": [
        {
            "text": "Today (16 November 2021), the UK Government has published a joint position statement which sets out preference for low noise alternatives to clear unexploded ordnance and re-affirms its commitment to considering new ways to achieve this in order to protect marine life and prevent damage to the seabed."
        },
        {
            "text": "Clearance of unexploded ordnance is undertaken by high order detonation leading to loud blasts which has the potential to disturb and injure marine mammals. It is estimated that there are between 300,000 and 500,000 pieces of unexploded ordnance left over from World War I and II in UK waters."
        },
        {
            "text": "It is essential that these munitions are removed in a controlled way to allow for safe working conditions for marine industries, such as offshore wind development."
        },
        {
            "text": "The joint position statement formally recognises the importance of exploring alternative low noise technologies and outlines government preference for the inclusion of these methods in applications from marine developers."
        },
        {
            "text": "To provide clarity for industry, the statement lists current recommendations for applications until more robust data is available and pilots can take place to test possible alternatives."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "With an improved evidence base, and with continuing support and advice from the Statutory Nature Conservation Bodies, the Marine Management Organisation (as the regulatory authority) will be able to make better informed licensing decisions around the use of such techniques in English waters."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}