{
    "url": "https://marinedevelopments.blog.gov.uk/2021/11/16/integrated-marine-management-working-with-people-for-nature/",
    "title": "Integrated Marine Management – Working with People for Nature",
    "authors": [
        "Karen Leech, Blue Belt Programme"
    ],
    "categories": [
        "Blue Belt"
    ],
    "pub_date": "2021-11-16T12:15:22+00:00",
    "content": [
        {
            "text": "Marianne Teoh, Senior Integrated Marine Manager, Blue Belt Programme"
        },
        {
            "text": "One of the newest recruits to the Blue Belt Team is Marianne Teoh. Marianne is an interdisciplinary scientist and marine manager, who joined us from Fauna & Flora International in Cambodia, where she managed and developed marine conservation projects and Marine Protected Areas (MPAs) with fishing communities, NGOs and the government agencies.  She led the development of a programme of work supporting a network of MPAs, with integrated projects to protect vulnerable habitats, tackle marine litter, reduce endangered species by-catch and trade, address financing gaps, and support the development of sustainable coastal enterprises."
        },
        {
            "text": "Marianne joined the Integrated Marine Management Team earlier this year, to support UK Overseas Territories who have joined the Blue Belt Programme, and partner countries under the new Ocean Country Partnership Programme in reaching their MPA objectives. We asked Marianne how she came to work in this sector and what ‘integrated marine management’ means to her. Here is her story:"
        },
        {
            "text": "“During and after my academic studies, I worked with environmental and research groups in London, Indonesia and Malta, learning a breadth of approaches from marine algae genetics to coral reef surveys. Becoming motivated by how science and local knowledge is used in practice to solve coastal challenges, I began engaging with community-based conservation and small-scale fisheries initiatives.  I supported Blue Ventures’ work in Madagascar, looking at how the carbon value of mangroves could benefit coastal livelihoods and conservation initiatives, before moving to an island in Cambodia to work with a local community-based non-profit organisation.  There, I supported the management and monitoring of what became the country’s first multiple-use MPA, designed to support sustainable fishing livelihoods and protect biodiversity. This led to my work with the non-profit Fauna & Flora International, leading a coastal-wide marine programme with a collective of partners."
        },
        {
            "text": "Throughout my career so far, my focus has been on people and nature – which I believe are the cornerstone of an integrated approach to marine management under both the Blue Belt Programme and the new Ocean Country Partnership Programme."
        },
        {
            "text": "To me, integrated marine management means bringing people together to amplify impact for our oceans and those dependent upon its resources. It’s an inclusive approach to planning and management that balances marine conservation and sustainable resource use, considering social, cultural and economic impacts, as well as ecological. Each MPA and community I’ve worked with is totally unique, which makes the job diverse, fun and challenging!"
        },
        {
            "text": "I’d recommend this job to anyone. Some examples of activities and work that I’ve most enjoyed include:"
        },
        {
            "text": "Oceans play a crucial role in human welfare, providing social, economic, and environmental benefits to the world’s growing population. The challenges and pressures are multiple and rising, and ocean-related industries like fisheries, aquaculture and tourism are growing.  Marine managers need an inclusive and collaborative approaches to science, policy, and management, and need to be able to work with multiple sectors and industries to develop and support solutions that work."
        },
        {
            "text": "People often think that my job is working with nature. In fact, it’s about working with people, for nature. Protecting the environment is a social process – you have to love working with people to do this job."
        },
        {
            "text": "It is this human dimension of environmental conservation that really drives me, whether working with fishers, meeting with governments and partners to solve problems and design work, supporting students and scientists on surveys, or developing new programmes with new partners."
        },
        {
            "text": "Marine management is an ever-evolving discipline, and you never stop learning. A new adventure starts this November, when I set sail on the RRS Discovery for a two-month journey with the Blue Belt team, UK Overseas Territory partners and other ocean experts to explore and monitor the waters of Ascension and St Helena, assessing threats and collecting evidence to address ocean conservation issues."
        },
        {
            "text": "It is a privilege to work with and learn from our partners in the UK Overseas Territories, and I am excited to work with partner countries under the new Ocean Country Partnership Programme. I hope that by continuing to support collaborative approaches, with local needs at their core, we can continue to bring real and sustainable benefits to the territories, countries, and their people.”"
        },
        {
            "text": "Follow the RRS Discovery team (#DY143), Marianne (@marianne_teoh) and the Blue Belt Programme (@ukgovbluebelt) on their ocean expedition from November 2021 to January 2022."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " Credit: Paul Colley / Fauna & Flora International"
        },
        {
            "text": " "
        },
        {
            "text": "Credit: Marianne Teoh"
        },
        {
            "text": "Credit: Fauna & Flora international"
        }
    ]
}