{
    "url": "https://educationhub.blog.gov.uk/2021/11/16/new-funding-to-combat-bullying-in-education-everything-you-need-to-know/",
    "title": "New funding to combat bullying in education - Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "LGBT+",
        "Relationships and Sex Education",
        "Schools",
        "SEND"
    ],
    "pub_date": "2021-11-16T06:30:21+00:00",
    "content": [
        {
            "text": "Bullying in any form is unacceptable and can have a devastating effect on children, young people and their families."
        },
        {
            "text": "That’s why, as anti-bullying week continues, we have confirmed funding for five leading organisations, worth over £1m in total, to support schools and colleges as part of their responsibility to tackle all forms bullying."
        },
        {
            "text": "We have also launched a new mental health support scheme for school leaders, which will help promote teachers’ wellbeing."
        },
        {
            "text": "Here’s everything you need to know about the new measures announced today."
        },
        {
            "heading": 3,
            "text": "1. So, what have we announced today?"
        },
        {
            "text": "Thousands of schools in England are set to benefit from further support, resources, and training to help them combat bullying, promote diversity in children and young people, and improve wellbeing for staff."
        },
        {
            "text": "Building on the £3.5m the Department has already delivered to charities and organisations to prevent bullying since 2016, the latest funding boost will go towards projects and programmes that tackle bullying focused on protected characteristics including LGBT+, special educational needs and disabilities (SEND), and victims of hate-related bullying."
        },
        {
            "text": "As part of the department’s wider measures to promote good wellbeing across pupils, teachers and school and college staff, a new support scheme for school leaders is also being launched today, backed by £760,000 of Government funding."
        },
        {
            "heading": 3,
            "text": "2. Which organisations will receive this new funding for anti-bullying support? "
        },
        {
            "text": "Organisations that will receive grants from the Department are:"
        },
        {
            "heading": 3,
            "text": "3. Can I hear more about the support scheme for teachers? "
        },
        {
            "text": "The new mental health support scheme for school leaders will be delivered by the charity Education Support and will run from this autumn until March 2023."
        },
        {
            "text": "The scheme will provide one-to-one counselling and peer support to around 2,000 school leaders, helping those at deputy head level and above with their mental wellbeing."
        },
        {
            "text": "It builds on a pilot involving over 350 school leaders, which was launched in response to the challenges brought about by the pandemic. Eligible school leaders can access the programme from today through the Education Support website and helpline."
        },
        {
            "text": "An updated Education Staff Wellbeing Charter will also be published this week, which sets out commitments from the government, Ofsted, education unions and charities, to promote and protect the mental health of the education workforce."
        },
        {
            "text": "Through the charter, the department pledges to work with the sector to drive down unnecessary workload, improve access to wellbeing resources, and champion flexible working, among a range of actions to support staff wellbeing. The department is now encouraging all state funded schools and colleges to sign up to the charter to create a united approach to supporting staff wellbeing."
        },
        {
            "heading": 3,
            "text": "4. What else is the government doing to help tackle bullying in education? "
        },
        {
            "text": "There are a range of measures in place to combat bullying in the education system. A few of these are outlined below."
        }
    ]
}