{
    "url": "https://defrafarming.blog.gov.uk/2021/11/16/the-farming-investment-fund-launches-today/",
    "title": "The Farming Investment Fund launches today ",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2021-11-16T14:12:59+00:00",
    "content": [
        {
            "text": "I’m pleased to say that the Farming Investment Fund launches today. "
        },
        {
            "text": "This £27 million fund provides grants to farmers, growers, and foresters (including related contractors) so that they can invest in the things they need to improve productivity and enhance the natural environment. "
        },
        {
            "text": "This includes new equipment, technology, and infrastructure. "
        },
        {
            "text": "The Farming Investment Fund is made up of 2 parts: "
        },
        {
            "text": "In this post, I'll share details of how to apply and how we've adapted following feedback from farmers."
        },
        {
            "heading": 2,
            "text": "The Farming Equipment and Technology Fund "
        },
        {
            "text": "The Farming Equipment and Technology Fund is the new way for us to provide small productivity grants to farmers. "
        },
        {
            "text": "We’ve based the scheme on the old small productivity grants scheme, but we’ve made some important changes based on feedback from farmers. "
        },
        {
            "heading": 4,
            "text": "Increasing the number of items on the list from 85 to 120 "
        },
        {
            "text": "We’ve made this change to better reflect the needs of all agricultural sectors including horticulture and forestry. We will keep this list under review and will continue to add and remove items as the fund evolves between rounds. "
        },
        {
            "heading": 4,
            "text": "Reducing the minimum to £2,000 "
        },
        {
            "text": "Small farmers found the minimum grant at £3,000 in the Countryside Productivity Small Grant (CPSG) was too high, so we’ve reduced the minimum to £2,000.  "
        },
        {
            "heading": 4,
            "text": "Increasing the maximum grant to £25,000 "
        },
        {
            "text": "Increasing this figure allows us to add higher value items, but also larger variants of existing items, for example a wider range of direct drill sizes. "
        },
        {
            "heading": 4,
            "text": "Adding contractors "
        },
        {
            "text": "We added contractors to the list of eligible applicants on the Farming Equipment and Technology Fund (including those serving livestock, dairy, arable and horticultural sectors). "
        },
        {
            "text": "This reflects the many different methods employed in modern farming businesses and we hope this will allow equipment purchased through the fund to benefit more farmers. "
        },
        {
            "heading": 4,
            "text": "Changing the ‘all or nothing’ rule "
        },
        {
            "text": "We changed the rules to allow applicants to remove items in certain cases. This could be where items can be bought as a package rather than separately, or where they have selected the wrong item or where manufacturers are unable to deliver all the items within the claim deadline. "
        },
        {
            "text": "In these situations, we will look at requests to remove items on a case-by-case basis, subject to the grant requested still being above the minimum grant (£2,000).  "
        },
        {
            "heading": 4,
            "text": "Animal Health and Welfare "
        },
        {
            "text": "As part of the Animal Health and Welfare Pathway, we will be launching a new expanded grant offer late next year to co-fund investment in equipment, technology and infrastructure that will improve animal health and welfare. "
        },
        {
            "text": "We will soon launch an online suggestions box to give farmers, vets, academics and other industry stakeholders the opportunity to suggest which capital items are included. While we finalise the full offer, we will continue to fund items from Countryside Productivity Small Grant that improve animal health and welfare through Farming Equipment and Technology Fund. "
        },
        {
            "heading": 4,
            "text": "Slurry management "
        },
        {
            "text": "We have also provided farmers with an important initial offer to upgrade their slurry management systems through an expanded slurry equipment offer. "
        },
        {
            "text": "Offering strong environmental benefits, we will build on this through the offer of grants for additional infrastructure and equipment as part of future rounds of the fund. "
        },
        {
            "text": "We believe these changes maintain the integrity of the scheme while addressing the key concerns raised by farmers and stakeholders. "
        },
        {
            "text": "We are still keen to hear from farmers as we continue to develop and evolve the fund through future rounds. "
        },
        {
            "heading": 2,
            "text": "The Farming Transformation Fund"
        },
        {
            "text": "Today we are opening the Water Management theme. This theme is dedicated to arable and horticultural businesses growing, or intending to grow, irrigated food crops, ornamentals or forestry nurseries. "
        },
        {
            "text": "This offers grants towards capital items to improve farm productivity through more efficient use of water for irrigation, and to secure water supplies for crop irrigation by constructing on-farm reservoirs and adopting irrigation application equipment. "
        },
        {
            "text": "We have reduced the maximum grant available to £500,000 (the minimum remains at £35,000) to enable us to ensure funding is available to support the widest number of farmers, whilst still being committed to supporting higher value projects which align to the fund’s objectives. Applicants may undertake larger projects, but the grant ceiling will be £500,000. "
        },
        {
            "text": "This theme will be followed by further themes and grants in the coming months. "
        },
        {
            "heading": 4,
            "text": "Online checker"
        },
        {
            "text": "We've created an online checker for the Farming Transformation Fund to determine eligibility and the likelihood of success before submitting an application. "
        },
        {
            "text": "Check if you can apply for a Farming Transformation Fund Water Management grant"
        },
        {
            "heading": 2,
            "text": "Find out more, get involved, apply"
        },
        {
            "heading": 4,
            "text": "Webinar"
        },
        {
            "text": "I’ll be presenting information about the Farming Investment Fund and taking questions with my colleagues during a webinar on Mon 22 November 2021. "
        },
        {
            "text": "Sign up for the webinar"
        },
        {
            "heading": 4,
            "text": "Q&A"
        },
        {
            "text": "Defra's Future Farming and Countryside Programme Director, Janet Hughes, answered questions about the Farming Investment Fund on the Farming Forum."
        },
        {
            "text": "Read the questions from farmers and Janet's responses"
        },
        {
            "heading": 4,
            "text": "Co-design"
        },
        {
            "text": "To ensure that both funds remain relevant to the industry, we’ll continue to engage with farmers and growers. "
        },
        {
            "text": "To get involved, email ffcpcodesign@defra.gov.uk "
        },
        {
            "heading": 4,
            "text": "Make an application"
        },
        {
            "text": "Apply for funding on GOV.UK"
        }
    ]
}