{
    "url": "https://rpc.blog.gov.uk/2021/11/16/the-importance-of-international-engagement-for-the-rpc/",
    "title": "The importance of international engagement for the RPC",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny",
        "International"
    ],
    "pub_date": "2021-11-16T09:06:46+00:00",
    "content": [
        {
            "text": "The RPC has worked extensively with international partners since its creation in 2009:"
        },
        {
            "text": "The last year has seen unprecedented disruption due to Covid-19, which has particularly affected our international engagement work. Nevertheless, we have continued to interact with similar organisations across the globe to enhance our knowledge and capability, especially in methodologies and approaches to regulation and scrutiny."
        },
        {
            "heading": 2,
            "text": "Our international work during Covid travel restrictions"
        },
        {
            "text": "Our work with international organisations has continued:"
        },
        {
            "text": "In the bilateral space, in recent years we have hosted workshops and discussed regulation and business burden analysis with experts from places as diverse as China, Japan, India, Chile, France and Australia. In Seoul we considered live topics including use of “regulatory sandboxes” and in Reykjavik the potential inclusion of gender impacts in impact assessments."
        },
        {
            "heading": 2,
            "text": "How successful has virtual engagement been? "
        },
        {
            "text": "Whilst RWE and OECD work has transferred seamlessly online, some of the ad hoc engagement that often arises spontaneously from encounters in person has been more difficult to sustain virtually. Existing conferences and arrangements have been suspended, and in many countries regulatory scrutiny practices have been temporarily suspended or streamlined in response to the pandemic. During this period, we have maintained our networks and considered the regulatory approaches taken by different countries."
        },
        {
            "text": "We have also been working with the Forum of Indian Regulators (FOIR), with RPC members discussing the UK Better Regulation system with the Indian audience, and the FOIR presenting on their own regulatory approach in the UK. We will continue to develop our relationship with this crucial trading partner and we plan to undertake a programme of regulatory support, with colleagues from across the Department for Business, Energy and Industrial Strategy."
        },
        {
            "text": "Last month we were delighted to join our German counterparts, when they presented Chancellor Angela Merkel with their annual report and reflected on the past five years of their regulatory scrutiny. The Chancellor remarked that “To live together, we need a certain amount of rules. On the other hand, the acceptance of [these rules] should not suffer. Therefore, you have to weigh carefully.”"
        },
        {
            "text": "Over the next year, as travel becomes more feasible, we aim to rebuild our international engagement and continue to drive both multilateral and bilateral relationships to share insights and benchmark approaches."
        }
    ]
}