{
    "url": "https://prisonjobs.blog.gov.uk/2021/11/16/working-part-time-as-a-prison-officer/",
    "title": "Working part-time as a prison officer",
    "authors": [
        "Jason"
    ],
    "categories": [
        "Guest post",
        "Personal stories",
        "Ways of working"
    ],
    "pub_date": "2021-11-16T09:29:30+00:00",
    "content": [
        {
            "text": "As prisons operate 24 hours a day, 7 days a week, prison officers work shifts. Most work full-time, but some prisons offer part-time working. We caught up with Jason who told us what he likes about working part-time."
        },
        {
            "text": "“I’ve been working part-time as a prison officer at HMP Wayland for about two and a half years now. It’s great, because it means I get to spend more time with my family, including sharing the school runs with my wife. And, because I work a maximum of four days back-to-back, I’ve got plenty of time to rest on my days off – and more energy to entertain the kids when they’re not at school!”"
        },
        {
            "text": "Sharing shift patterns with another part-time officer\n“I work alongside another part-time prison officer and we cover alternative shifts. So, if one of us is working a day shift, the other will cover the night shift. And we’ll swap for our next shift pattern. Also, rather than doing seven nights ‘on’ – like we would if we were full-time – one of us will work four nights, and the other three.”"
        },
        {
            "text": "“I work a variety of day shifts: some days I’ll start at 7.30am and finish at 6pm, and other days I’ll start at 1.30pm and go home at 9pm. Plus I work one weekend a month, and I tend to do a bit of over-time once or twice a month, working around my wife’s work, to make a bit of extra money.”"
        },
        {
            "text": "“Depending on what day of the week my part-time hours fall, I sometimes have to work on public holidays. But so do full-time officers. I’ve got Christmas Day and Boxing Day off this year and am really looking forward to spending the time with my family.”"
        },
        {
            "text": "Planning around family appointments\n“The great thing is that I always know my shift pattern – or ‘detail’ as we call it in prisons – for the next three or four months. This really helps my wife and I plan ahead so we know which of us is available to take our children to dentist or doctors’ appointments, and the like."
        },
        {
            "text": "Even though my annual leave entitlement is pro rata – roughly half that of a full-time prison officer– I still get a good number of days off. And I get the same employee benefits as full-time officers.”"
        },
        {
            "text": "Time to recharge\n“I enjoy working as a prison officer. It’s something I always wanted to do, and my part-time hours work out really well for me and my family. After my rest days, I’m fully recharged and ready to walk the landings again.”"
        }
    ]
}