{
    "url": "https://civilservice.blog.gov.uk/2021/11/16/world-prematurity-day-the-day-everything-changed/",
    "title": "World Prematurity Day: The day everything changed ",
    "authors": [
        "Carla Giudice, Deputy Director (Test, Trace, Protect), Welsh Government"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-11-16T09:53:44+00:00",
    "content": [
        {
            "heading": 3,
            "text": "With 1 in 13 babies in the UK born early (before 37 weeks), Carla Giudice shares five ways the Civil Service can best support colleagues with premature babies. "
        },
        {
            "text": "My journey into parenthood started unconventionally. My pregnancy in 2016 was unexpected, and I relocated from London to Cardiff, commuting to our Westminster office for part of my week. At 29 weeks, I had a restless night’s sleep after the long train journey home – not unusual during pregnancy but something didn’t feel right. I couldn’t feel any kicks. "
        },
        {
            "text": "The next morning I spent hours waiting at the hospital, scrolling through my BlackBerry (a sign of the times)  and apologising to my boss for my absence. As I entered the room for my scan, I looked over the radiographer’s shoulder, towards the clock, calculating whether I’d make my next meeting. "
        },
        {
            "text": "The midwife had confirmed a heartbeat and seemed relaxed.  But then I spotted her requesting a second opinion. An army of healthcare staff suddenly filled the tiny room. "
        },
        {
            "text": "“Sorry - you will need to stay in hospital until this baby is born.”"
        },
        {
            "text": "The consultant had barely finished his words as I felt the room closing in. How could I stay in hospital for more than 10 weeks? What was wrong with my baby? She slowly explained my baby had restricted growth and stopped receiving nutrients from my placenta. I needed to rest, receive treatment to prepare for an early delivery and be continuously monitored. "
        },
        {
            "heading": 4,
            "text": "Early arrival "
        },
        {
            "text": "I spent a week on the antenatal assessment unit, having reluctantly informed my boss I wouldn’t be returning to work before my baby’s arrival. Suddenly my world turned upside down again. "
        },
        {
            "text": "This time, the doctors weren’t happy with my baby’s heart rate and transferred me to the delivery suite. A decision was made the next morning to deliver my baby by emergency c-section. Baby Luca arrived 10 weeks early, weighing 2lbs 10oz and was whisked straight to the neonatal unit. "
        },
        {
            "heading": 4,
            "text": "Supporting parents "
        },
        {
            "text": "Within a week, I’d gone from my desk at the heart of Westminster to feeling alone and isolated in hospital without my baby at my side. I gave birth before I had even read my baby books, hosted my baby shower or attended any birthing classes. "
        },
        {
            "text": "Nothing prepared me for the next six weeks when Luca remained in hospital and I had to leave him every day to go home. I never expected to find myself in this situation – so it isn’t surprising my colleagues weren’t entirely sure how to react either. "
        },
        {
            "text": "To mark World Prematurity Day, I want to share my reflections on how colleagues can support new parents of premature babies, ensuring that we look after everyone who forms part of our Skilled Civil Service. "
        },
        {
            "heading": 4,
            "text": "Congratulate the new arrival"
        },
        {
            "text": "Parents of premature babies are still parents. If the parent reached out and shared their news, recognise the arrival of their child. Celebrate the birth like you usually would (sending cards and balloons) – but flowers should be avoided, as parents will spend most of their time at the hospital. My director reached out directly and asked if he could visit me in hospital with his daughter. It meant a lot that he made the effort to check on my welfare – and the toy his daughter gave my baby is still one of our treasured possessions.  "
        },
        {
            "heading": 4,
            "text": "Don’t expect a reply"
        },
        {
            "text": "Many preemie parents are inundated with kind messages in the early days – but parents can feel overwhelmed if they’re unable to reply to everyone. Send a supportive message letting them know you’re thinking of them, adding a disclaimer that you don’t expect a response. "
        },
        {
            "heading": 4,
            "text": "Prematurity doesn’t end at discharge"
        },
        {
            "text": "Taking your baby home is an eagerly anticipated milestone for parents, but often doesn’t mark the end of ongoing check-ups for premature babies. Parents may need adjustments and a little extra support on their return to work to balance their responsibilities, such as flexible working patterns or a phased return. I used my leave to return to work through a phased approach, alongside compressed hours. This helped me transition Luca to childcare slowly and manage ongoing health issues.  "
        },
        {
            "heading": 4,
            "text": "Remind parents of HR support and entitlements "
        },
        {
            "text": "We are fortunate as civil servants to have access to a wealth of wellbeing support, including the Employee Assistance Programme. Line managers should provide details for EAP and support directly to the new parents whilst on leave, which they can access if they wish. "
        },
        {
            "text": "I also accessed my full ‘keep in touch day’ entitlement (allowing every new mum to work up to 10 days without bringing maternity leave to an end), which really helped me process the abrupt start to my leave. This was also helpful financially as Luca’s early arrival impacted my maternity budgeting. "
        },
        {
            "text": "My son is now a happy, healthy five-year-old but he’s spent time in hospital every year since his arrival. Thankfully, this has been no more than several days to provide breathing support.  "
        },
        {
            "heading": 4,
            "text": "Supportive managers"
        },
        {
            "text": "Since my return to work, I’ve had consistently supportive managers who’ve helped me balance my career alongside caring responsibilities. Through their support and adjustments, I’ve achieved two promotions since my maternity leave. "
        },
        {
            "text": "I feel proud that as part of A Modern Civil Service, my department looks after staff and empowers them to thrive through stressful personal events to be able to work effectively. I hope other civil servants will provide the same consideration to fellow preemie parents."
        }
    ]
}