{
    "url": "https://environmentagency.blog.gov.uk/2016/11/11/make-your-home-more-flood-resilient/",
    "title": "Make your home more flood resilient",
    "authors": [
        "Mary Dhonau"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2016-11-11T09:24:40+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Updated guide to flood resilience "
        },
        {
            "text": "Having been flooded myself, I know only too well how appalling it can be – being flooded is a life changing experience. I have since supported many people going through the same misery, and everyone has a heart-wrenching story to tell. On top of all the other ‘stuff’ going on in our lives, being flooded can often break people."
        },
        {
            "text": "In recent years I have therefore been on a mission to raise awareness of flood risk. An increasing proportion of flood insurance claims are now from surface water flooding – so, in my view everyone is at risk of being flooded and we should all be aware!"
        },
        {
            "text": "Last winter’s floods confirmed something I’ve said many times: a flood alleviation scheme can only reduce the risk and doesn’t take it away completely. Because of that fact, I’ve become a passionate advocate for promoting Flood Resilience – because being flooded is not the worst part; it is the months of recovery that take their toll. Being aware, having a plan and taking precautions to reduce our own risk is half the battle."
        },
        {
            "heading": 2,
            "text": "How to protect your home"
        },
        {
            "text": "Being told to ‘protect our own homes from being flooded’ is all very well, however, just how do we do this? Working together with Carly Rose, the Know Your Flood Risk campaign’s experienced PhD researcher (who has also experienced flooding) we have produced an updated guide for homeowners, which provides practical advice on making a home flood resilient."
        },
        {
            "text": "We reviewed all the currently available measures that can be adopted to reduce the flood impact a home/property level.  These are clearly listed, with a description of what they are for, as well as the kind of flooding to which they are best suited."
        },
        {
            "text": "In addition, I interviewed many people who have been flooded and have since chosen to adapt their homes to significantly reduce the awful recovery period. One couple I talked to in York told me that after the flood water has gone, they can now be back to normality within only one hour - he hoses the house, she cleans and disinfects, then they get the dehumidifiers out and put everything back in place. Now that’s what I call flood resilient!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Unravelling who does what about flooding"
        },
        {
            "text": "Another thing I have often found puzzling is ‘who does what’ in the world of flood risk management. We have therefore added a new section to the guide that lists the risk management bodies, together with related organisations across the whole UK, and explains in simple terms what each of them does."
        },
        {
            "text": "We have also included an updated section on Flood Re – the new way flood insurance is provided for those at high risk, many of whom will have struggled to obtain cover in the past."
        },
        {
            "text": "Whilst it may not be always possible to stop flood water getting into a home, my hope is that by reading this guide, people at risk of being flooded can understand  what they can do to reduce the awful aftermath and recover from being flooded far more quickly than in the past!"
        },
        {
            "text": "Download a copy of the Homeowners' Guide to Flood Resilience (21MB)."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}