{
    "url": "https://ukefdigital.blog.gov.uk/2025/10/01/from-insight-to-interface-my-summer-in-digital-design-at-ukef/",
    "title": "From Insight to Interface: My summer in Digital Design at UKEF",
    "authors": [
        "Isobel Murray"
    ],
    "categories": [
        "DDAT",
        "User Centred Design",
        "user research"
    ],
    "pub_date": "2025-10-01T14:58:33+01:00",
    "content": [
        {
            "text": "This summer I had the opportunity to spend 9 weeks as an intern in the Digital, Data and Technology (DDaT) directorate at UK Export Finance (UKEF).  "
        },
        {
            "text": "From the outset of my internship, I was welcomed into an incredibly friendly team, and, over the course of the internship, I contributed to projects which aimed to make UKEF’s services more accessible and intuitive, while gaining hands-on experience in agile ways of working. "
        },
        {
            "text": "This blog is a reflection on what I learned, what I contributed, and how the experience has shaped my perspective on digital work in the public sector. "
        },
        {
            "text": "My background "
        },
        {
            "text": "I have completed my second year as an English language and literature student at the University of Oxford and, as I’m on the cusp of my final year, life after university looms large and, prior to this internship, blurry and uncertain. UKEF wasn’t really on my radar when I applied to the Summer Internship Project, and when I first saw the word ‘finance,’ as an English student I thought I would be wildly out of my depth. Not only this, but this would be my first time living in London for the duration of my internship.  "
        },
        {
            "text": "The ‘Change Front Door’ Project "
        },
        {
            "text": "I was tasked with leading a mini project and working with a small team to undertake research as part of a discovery on UKEF’s existing Change Lab site and design a new Change Front Door site to capture change ideas within UKEF, based on user needs and government standards. Through the duration of the project I:  "
        },
        {
            "text": "It was particularly rewarding to conduct my own usability testing, similar to that which I had previously shadowed, where I ran through my own clickable prototype. "
        },
        {
            "text": "The culmination of this discovery, alpha and implementation was my presentation to roughly 70 people in the department summarising what I’d achieved over the 9 weeks. "
        },
        {
            "text": "Additional projects I have worked on "
        },
        {
            "text": "Parallel to this, I have: "
        },
        {
            "text": "My reflections "
        },
        {
            "text": "My interactions with user research, service design and content design were limited to say the least before joining UKEF, but my work and learning in these areas have helped me to understand, not only how services are built, but how they are shaped by listening, empathy and iteration. "
        },
        {
            "text": "I am so grateful for the opportunities I’ve been given by my team and specifically my wonderful line manager, Clara Galvin, to get involved in so many different projects, both working and shadowing. This experience has given me a deeper appreciation of thoughtful, inclusive design and an interest in pursuing this avenue as a future career path. Following this internship, life after university feels substantially less blurry and uncertain and I am now excited about the possibility of pursuing a role in the civil service. "
        },
        {
            "text": "I can’t even begin to express my gratitude to all the people who have been hugely generous with their time and support, allowing me to fully engage in work in which I was completely clueless 9 weeks ago! "
        },
        {
            "text": "This summer of living and working in London for the first time in my life has been such a privilege and a brilliant experience for which I will always be immensely thankful.  "
        }
    ]
}