{
    "url": "https://planninginspectorate.blog.gov.uk/2025/10/01/more-than-half-of-all-english-local-authorities-are-now-using-the-new-appeal-a-planning-decision-service/",
    "title": "More than half of all English local authorities are now using the new Appeal a Planning Decision Service ",
    "authors": [
        "Tom Sedgman"
    ],
    "categories": [
        "Appeals",
        "Digital",
        "Enforcement",
        "Service improvement"
    ],
    "pub_date": "2025-10-01T11:50:58+01:00",
    "content": [
        {
            "text": "The Planning Inspectorate has long provided appellants with the right to appeal decisions made by local planning authorities (LPAs). For a number of years, this process has been managed through the Appeals Casework Portal (ACP). "
        },
        {
            "text": "From 1 December this year, the ACP will close to all new planning appeals."
        },
        {
            "heading": 2,
            "text": "The journey so far "
        },
        {
            "text": "With the rise of digital services, the ACP became the central hub for managing appeals. It provided a structured, accessible way for appellants, LPAs, and interested parties to interact with the appeals process. However, as technology and user expectations evolved, so too did the need for a more modern, efficient, and user-friendly system. "
        },
        {
            "text": "Recognising the limitations of the ACP and the opportunities presented by digital transformation, the Planning Inspectorate embarked on a journey to develop a new, streamlined service based on the GOV.UK design system: the Appeal A Planning Decision Service."
        },
        {
            "text": "This aimed to: "
        },
        {
            "text": "Following a successful pilot with 5 London boroughs, the new service has demonstrated significant improvements in efficiency and user experience. See our previous news item."
        },
        {
            "text": "The phased rollout began with a handpicked selection of smaller LPAs in the Southwest, and as of the 1 October 2025 more than half of all LPAs in England have been brought into the service. The remaining LPAs, including the largest in the country, will be joining the service over the next two months. "
        },
        {
            "heading": 2,
            "text": "The closure of the ACP "
        },
        {
            "text": "As part of this digital transformation, the Planning Inspectorate is announcing that the ACP will close to all new planning appeals from 1 December 2025 and all new enforcement appeals by the end of March 2026. "
        },
        {
            "text": "From this date, all new planning appeals must be submitted through the new Appeal A Planning Decision Service. Appeals that have been started but are yet to be submitted can still be completed and submitted through the ACP. "
        },
        {
            "text": "This marks a significant milestone in the modernisation of the planning appeals process, ensuring that it remains fit for purpose in a digital age, and allows the organisation to support the government’s goal of speeding up and streamlining planning decisions. "
        },
        {
            "heading": 2,
            "text": "What does this mean for appellants and LPAs?"
        },
        {
            "text": "For appellants: the new service offers a more intuitive and efficient way to submit and track appeals, with a more user-friendly interface that offers more information and support throughout the process. "
        },
        {
            "text": "For LPAs: the platform provides enhanced tools for managing cases, monitoring progress, and communicating with all parties involved, as well as reducing the effort required to manage cases. "
        },
        {
            "text": "For the Planning Inspectorate: the move supports ongoing efforts to deliver a faster, more efficient, and user-focused appeals process. "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "The closure of the ACP and the full rollout of the Appeal A Planning Decision Service represent a step change in how planning appeals are managed in England. Our aim is to ensure that the appeals process is accessible, efficient, and responsive to the needs of all users.  "
        },
        {
            "text": "In coming years, the service will begin to use the Open Digital Planning project from the Ministry of Housing, Communities, and Local Government to automatically gather information from the original planning application to reduce the amount of work required by appellants and LPAs when submitting, and managing appeals. "
        },
        {
            "text": "The service will also be expanded to include other appeal types such as environmental appeals, and the service will continue to be developed based on the feedback received from users.  "
        }
    ]
}