{
    "url": "https://naturalengland.blog.gov.uk/2025/10/01/numbers-of-nesting-hen-harriers-in-england-have-risen-slightly-in-2025/",
    "title": "Numbers of nesting hen harriers in England have risen slightly in 2025",
    "authors": [
        "Matthew Heard"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Species recovery"
    ],
    "pub_date": "2025-10-01T09:01:53+01:00",
    "content": [
        {
            "text": "By Matthew Heard, National Delivery Director"
        },
        {
            "text": "Numbers of nesting hen harriers in England have risen slightly this year, according to data collected by Natural England and partners."
        },
        {
            "text": "Breeding figures and regional breakdown"
        },
        {
            "text": "In 2025, Natural England and partners recorded a total of 39 breeding attempts in England (up on 34 in 2024) of which 33 were successful (25 in 2024), fledging 106 chicks (80 in 2023). This gives an average of 3.2 chicks per successful nest (3.2 in 2024). "
        },
        {
            "text": "We did not record any second breeding attempts in 2025. Therefore, it is estimated that there was a minimum of 39 breeding females in England (34 in 2024)."
        },
        {
            "text": "Trends in hen harrier numbers"
        },
        {
            "text": "Hen harriers are rare primarily because they are killed and prevented from nesting successfully. Natural England proactively supports efforts to directly tackle this illegal killing and disturbance, including through the work of our dedicated Enforcement Team, and our role as a leading partner in the National Wildlife Crime Unit’s Hen Harrier Task Force."
        },
        {
            "text": "Natural England also investigates ways to ease the human-wildlife conflict that drives wildlife crime. One initiative was the Brood Management Trial, which between 2018 and 2024 trialled temporary relocation of some hen harrier nestlings away from moorland managed for grouse shooting, offering a legal method of managing hen harrier impacts."
        },
        {
            "text": "Numbers of nesting hen harriers in England rose during the period that brood management was trialled, up to a high of 54 nests in 2023, with notable increases in the North Pennines and the Yorkshire Dales, areas with many privately-owned grouse shooting estates. Natural England concluded that it was likely that the killing and disturbance of nesting hen harriers had reduced in some areas during the trial period."
        },
        {
            "text": "However, in the final year of the trial, 2024, numbers of hen harrier nests in these areas dropped, while remaining steady in Bowland and in Northumberland. This year, 2025, the pattern is similar, with steady populations on the United Utilities Bowland Estate and in Northumberland. As last year, very few nests were recorded in the North Pennines or Yorkshire Dales and Nidderdale areas, with the only nests in the North Pennines at an RSPB reserve at Geltsdale."
        },
        {
            "text": "The overall increase in numbers and steady populations in Bowland and Northumberland is encouraging, and a positive change when compared to the period before 2018, when numbers of nests in England rarely rose above 20 in any year. However, this population recovery remains fragile, and efforts to reduce illegal killing and disturbance of hen harriers remain necessary across much of the English uplands."
        },
        {
            "text": "Acknowledgements We are grateful for the efforts of all of our partners to monitor, protect and manage hen harrier nests and breeding habitats. We work closely with RSPB staff who record the nesting attempts on RSPB reserves, and on the United Utilities Estate in Bowland. We are also grateful for the contributions of volunteer Raptor Study Groups and Natural England volunteers to nest monitoring, and to landowners and agencies including Forestry England, National Parks, National Landscapes, the National Trust, NatureScot and Natural Resources Wales.  Natural England field staff lead on liaison with privately-owned grouse shooting estates, and we extent our gratitude to those land managers that are encouraging hen harriers to nest successfully alongside their wider estate management for grouse and other wildlife."
        }
    ]
}