{
    "url": "https://cddo.blog.gov.uk/2025/10/01/ready-to-grow-your-digital-skills-get-tech-certified-this-autumn/",
    "title": "Ready to grow your digital skills? Get Tech Certified this Autumn",
    "authors": [
        "Martin Turner, Senior Change Delivery Manager"
    ],
    "categories": [
        "Digital learning and development",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-10-01T10:30:00+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is Get Tech Certified?"
        },
        {
            "text": "Get Tech Certified is an opportunity for anyone in the public sector to advance their digital skills. Launched by the Government Digital Service, it follows the success of last year’s Get Cloud Certified training campaign."
        },
        {
            "text": "From 1 October 2025 to 31 December 2025, all civil and public servants can access over 200 free learning and certification pathways across digital and technology areas including:"
        },
        {
            "text": "These range from introductory courses to advanced qualifications, and short to full courses."
        },
        {
            "text": "The offer is made possible through partnerships with 16 leading technology training providers, and is completely free to access."
        },
        {
            "heading": 2,
            "text": "Who is it for?"
        },
        {
            "text": "This programme is open to:"
        },
        {
            "text": "Whether you’re looking to build confidence, deepen your expertise, or explore a new direction in digital and data, Get Tech Certified is designed to support your development."
        },
        {
            "heading": 2,
            "text": "Real stories, real impact"
        },
        {
            "heading": 2,
            "text": "Explore courses and register today"
        },
        {
            "text": "Courses cover a wide range of topics including cloud computing, cybersecurity, data analysis, agile delivery and more."
        },
        {
            "text": "This offer is available until 31 December 2025."
        },
        {
            "text": "View the full list of courses, vendors and register to start your learning journey."
        }
    ]
}