{
    "url": "https://environmentagency.blog.gov.uk/2025/10/01/register-as-a-waste-carrier-broker-or-dealer-at-gov-uk/",
    "title": "Register as a waste carrier, broker or dealer directly online at GOV.UK",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2025-10-01T08:30:00+00:00",
    "content": [
        {
            "text": "Anyone who moves waste as part of their business operations must register with the relevant regulator."
        },
        {
            "text": "This includes you if:"
        },
        {
            "text": "In England you can register directly with the Environment Agency online as a waste carrier, broker or dealer: Register or renew as a waste carrier, broker or dealer - GOV.UK"
        },
        {
            "text": "Registration is free if you only transport waste you produce yourself (unless it is construction and demolition waste)."
        },
        {
            "text": "Otherwise, registration costs £184 initially and £125 on renewal."
        },
        {
            "text": "Please be aware that any websites that advertise to complete this on your behalf are not affiliated with us and may charge an additional fee for their service."
        },
        {
            "heading": 2,
            "text": "We are happy to help"
        },
        {
            "text": "Registering is quick and easy. If you need any assistance when registering, we are happy to help. You can contact nccc-carrierbroker@environment-agency.gov.uk or 03708 506 506 (Monday to Friday, 8am to 6pm)."
        },
        {
            "text": "When registering, you must provide us with the correct and complete information. Providing incorrect information, whether by mistake or on purpose, means we can remove you from the register."
        },
        {
            "text": "If alternative or incomplete contact information is provided (e.g., if third parties provide their contact information rather than yours), you may not receive important updates and information relating to your registration, including correspondence from us if we decide to remove you from the register."
        },
        {
            "text": "Not only could you then miss the opportunity to provide us with the correct information and have your registration restored, but you could become an unregistered carrier, broker or dealer and not be aware."
        },
        {
            "text": "It is an offence to transport controlled waste or act as a broker of or dealer in controlled waste without being registered, and such an offence could result in us taking enforcement action."
        },
        {
            "text": "You can ensure that all your details are provided correctly by completing the registration yourself at: Register or renew as a waste carrier, broker or dealer - GOV.UK"
        },
        {
            "text": "If you hold a current registration and need to inform us of any change affecting information relating to your registration, you must inform us within 28 days of that change."
        },
        {
            "text": "You can do so by contacting nccc-carrierbroker@environment-agency.gov.uk  or 03708 506 506 (Monday to Friday, 8am to 6pm)."
        },
        {
            "heading": 2,
            "text": "Help us protect the waste industry from waste crime"
        },
        {
            "text": "If you think you know about or suspect illegal waste activities, you can report it to our 24-hour incident hotline: 0800 80 70 60 or 100% anonymously to Crimestoppers: 0800 555 111 or online."
        }
    ]
}