{
    "url": "https://food.blog.gov.uk/2025/10/01/safety-of-nitrates-and-nitrites-as-food-additives/",
    "title": "Safety of Nitrates and Nitrites as Food Additives",
    "authors": [
        "Dr James Cooper, Deputy Director of Food Policy"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2025-10-01T14:30:00+01:00",
    "content": [
        {
            "text": "Our role at the FSA is to put people first. That means being transparent about the risks in our food, and providing you with clear, science-based information to help you make informed choices about foods you eat. A good example of this is a report we’ve just published into the potential risks of nitrates and nitrites in food."
        },
        {
            "text": "Which foods contain nitrates?"
        },
        {
            "text": "Nitrates and nitrites are part of our daily diet. The vast majority, up to 95%, comes naturally from vegetables, like spinach, lettuce, celery, and beetroot. About 5% comes from their use as food additives, predominantly in processed meats. In products like bacon and ham, nitrates and nitrites are used to prevent the growth of dangerous bacteria like Clostridium botulinum, which causes botulism—a potentially fatal illness. They also preserve the colour and add to the distinct flavour of these products."
        },
        {
            "text": "Are nitrates safe in food?"
        },
        {
            "text": "There’s no evidence to suggest that processed meat made without the use of nitrates is a safer alternative. The report we’ve published today shows that while nitrates and nitrites can form compounds called nitrosamines, many of which are carcinogenic, the link to serious health problems like cancer in humans remains inconclusive."
        },
        {
            "text": "How is nitrate use monitored?"
        },
        {
            "text": "It’s worth remembering that all food additives used in the UK, including nitrates and nitrites, undergo rigorous safety assessments before approval, these approvals include what foods an additive can be used in and also maximum limits. The current evidence suggests that permitted maximum levels of nitrites and nitrates in the UK are set at a level to keep people protected."
        },
        {
            "text": "Should I avoid nitrates in my diet?"
        },
        {
            "text": "It is possible to avoid foods containing these additives, as they must be labelled with both what they do, for example a ‘preservative’, along with the full name or E number. But you don’t need to avoid these foods completely, there are simple steps you can take to minimise any potential risks while maintaining a healthy, varied diet."
        },
        {
            "text": "It’s recommended that you do not eat too much processed meat. The NHS advises that  eating processed meats carries an increased risk of bowel cancer and high blood pressure, so people eating more than 90g of red or processed meat a day to cut down to no more than 70g."
        },
        {
            "heading": 1,
            "text": "Diogelwch Nitradau a Nitreidiau fel Ychwanegion Bwyd "
        },
        {
            "text": "Ein rôl ni yn yr Asiantaeth Safonau Bwyd yw rhoi pobl yn gyntaf. Mae hynny’n golygu bod yn dryloyw ynglŷn â’r risgiau yn ein bwyd, a rhoi gwybodaeth glir i chi, sy’n seiliedig ar wyddoniaeth, i’ch helpu i wneud dewisiadau gwybodus am y bwydydd rydych chi’n eu bwyta. Enghraifft dda o hyn yw adroddiad rydyn ni newydd ei gyhoeddi ar risgiau posib nitradau a nitreidiau mewn bwyd."
        },
        {
            "text": "Pa fwydydd sy’n cynnwys nitradau? "
        },
        {
            "text": "Mae nitradau a nitreidiau yn rhan o’n deiet dyddiol. Mae’r mwyafrif helaeth, hyd at 95%, yn dod yn naturiol o lysiau, fel sbigoglys, letys, seleri a betys. Daw tua 5% o’u defnydd fel ychwanegion bwyd, yn bennaf mewn cigoedd wedi’u prosesu. Mewn cynhyrchion fel bacwn a ham, defnyddir nitradau a nitreidiau i atal twf bacteria peryglus fel Clostridium botulinum, sy’n achosi botwliaeth—salwch a allai arwain at farwolaeth. Maen nhw hefyd yn cadw’r lliw ac yn ychwanegu at flas unigryw’r cynhyrchion hyn."
        },
        {
            "text": "Ydy nitradau’n ddiogel mewn bwyd? "
        },
        {
            "text": "Er bod nitradau a nitreidiau’n gallu ffurfio cyfansoddion o’r enw nitrosaminau, y mae llawer ohonyn nhw’n garsinogenaidd, mae’r adroddiad rydyn ni wedi’i gyhoeddi heddiw yn dangos bod y cysylltiad â phroblemau iechyd difrifol, fel canser mewn pobl, yn parhau i fod yn amhendant. Does dim tystiolaeth i awgrymu bod cig sydd wedi’i brosesu a’i wneud heb ddefnyddio nitradau yn ddewis mwy diogel."
        },
        {
            "text": "Sut mae defnydd o nitradau’n cael ei fonitro? "
        },
        {
            "text": "Mae’n werth cofio bod yr holl ychwanegion bwyd a ddefnyddir yn y DU, gan gynnwys nitradau a nitreidiau, yn destun asesiadau diogelwch trylwyr cyn iddyn nhw gael eu cymeradwyo. Mae’r broses gymeradwyo yn ystyried pa fwydydd y gellir defnyddio ychwanegion ynddyn nhw a hefyd y terfynau uchaf. Mae’r dystiolaeth gyfredol yn awgrymu bod y lefelau uchaf a ganiateir o nitradau a nitreidiau yn y DU wedi’u gosod ar lefel i gadw pobl yn ddiogel."
        },
        {
            "text": "Ddylwn i osgoi nitradau yn fy neiet? "
        },
        {
            "text": "Mae’n bosib osgoi bwydydd sy’n cynnwys yr ychwanegion hyn, gan fod yn rhaid nodi ar y label beth maen nhw’n ei wneud, er enghraifft ‘cyffeithydd’ (‘preservative’), ynghyd â’r enw llawn neu’r E-rif. Ond does dim angen i chi osgoi’r bwydydd hyn yn gyfan gwbl. Mae yna gamau syml y gallwch chi eu cymryd i leihau unrhyw risgiau posib, a hynny wrth gynnal deiet iach ac amrywiol."
        },
        {
            "text": "Argymhellir peidio â bwyta gormod o gig wedi’i brosesu. Mae’r GIG yn rhybuddio bod bwyta cig wedi’i brosesu yn cynyddu’r risg o ganser y coluddyn a phwysedd gwaed uchel. Felly, y cyngor i bobl sy’n bwyta mwy na 90g o gig coch neu gig wedi’i brosesu y dydd, yw y dylid lleihau hyn i ddim mwy na 70g."
        }
    ]
}