{
    "url": "https://space.blog.gov.uk/2025/10/01/uk-australia-space-bridge-strengthens-ties-at-international-astronautical-congress/",
    "title": "UK–Australia Space Bridge strengthens ties at International Astronautical Congress",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "International",
        "International Partnership Programme"
    ],
    "pub_date": "2025-10-01T10:02:51+01:00",
    "content": [
        {
            "text": "The UK Space Agency and the Australian Space Agency have renewed their Space Bridge partnership today at the International Astronautical Congress (IAC) in Sydney."
        },
        {
            "text": "The Framework Arrangement, signed by UK Space Agency CEO Dr Paul Bate, and Australian Space Agency Head Enrico Palermo, builds on the initial Space Bridge established in 2021: a framework designed to strengthen collaboration, exchange expertise, and create new opportunities across both nations’ space sectors."
        },
        {
            "text": "The Space Bridge has already delivered real impact - from advancing water quality monitoring to driving forward artificial intelligence for space safety. Its renewal builds on past successes, strengthening the partnership to continue delivering benefits for both nations and addressing shared global challenges."
        },
        {
            "text": "Under the latest round of the UK Space Agency’s International Bilateral Fund (IBF), three additional projects involving Australian partners were announced yesterday. This includes Long Baseline Multistatic Radar, which will test a global radar network to track distant objects in geostationary orbit; SLOSH-Cat, which will study how spacecraft fuel moves in microgravity to make satellites more stable and precise; and ARGUS, which will develop autonomous rendezvous technology, paving the way for satellites to safely inspect and service each other in orbit. In addition, AquaWatch-AUK, led by Surrey Satellite Technology Ltd (SSTL), will continue to receive support to advance its integrated water quality monitoring and forecasting system."
        },
        {
            "text": "Dr Paul Bate, Chief Executive of the UK Space Agency, said:"
        },
        {
            "text": "The renewal reflects the shared ambition of both nations to deepen cooperation across government, industry, and academia, ensuring the UK–Australia partnership remains at the forefront of using space to drive innovation and address global challenges."
        }
    ]
}