{
    "url": "https://dfedigital.blog.gov.uk/2025/10/01/working-together-on-user-research/",
    "title": "Working together on user research",
    "authors": [
        "Orla O'Neill"
    ],
    "categories": [
        "Collaboration",
        "technology",
        "user research",
        "User-centred design"
    ],
    "pub_date": "2025-10-01T10:00:00+01:00",
    "content": [
        {
            "text": "As a Fast Streamer, I spent six months at the Department for Education (DfE) working as a user researcher on our internal digital platform for reporting IT issues. The research, commissioned by leadership, aimed to understand how users experience the platform, covering everything from email problems to security incidents."
        },
        {
            "text": "The team was mainly made up of Business Analysts and Developers. Because the last research on the tool had taken place a few years ago, user research was unfamiliar to them."
        },
        {
            "heading": 2,
            "text": "Deciding how to do my research "
        },
        {
            "text": "I had a choice: to do the research alone and share my findings at the end or bring my team along with me for the journey. "
        },
        {
            "text": "I chose collaboration. I knew that working together would make the findings more meaningful and demonstrate the value of user research. But, I also knew it would be more challenging as time was limited, and the team had competing priorities. I needed to make it easy for them to get involved."
        },
        {
            "heading": 2,
            "text": "What I did "
        },
        {
            "text": "First, I spoke to my leadership team about my intentions and got their support."
        },
        {
            "text": "I introduced user research to the wider team through a short talk, explaining what it is and what a user researcher typically does."
        },
        {
            "text": "We held a workshop to define what we wanted to learn. This helped shape research questions that reflected the team’s priorities, not just mine."
        },
        {
            "text": "Next, I ran a session on observing research, including interactive activities on unconscious bias."
        },
        {
            "text": "I wrote discussion guides based on our research questions and recruited participants. I shared a sign-up sheet so team members could join sessions when they were available."
        },
        {
            "text": "Nine out of ten colleagues attended a session. I then invited the whole team to an analysis workshop, where we reviewed the findings together and linked them back to our original questions. I synthesised the common themes and shared the final insights with the team."
        },
        {
            "heading": 2,
            "text": "How it went "
        },
        {
            "text": "I’m proud of what I achieved, but like anything in life, it wasn’t perfect.  "
        },
        {
            "text": "Some things that went well: "
        },
        {
            "text": "Some things that could have gone better: "
        },
        {
            "text": "Throughout, I tried to keep things light and engaging. A bit of humour helped us stay connected and made the process more enjoyable.  "
        },
        {
            "heading": 2,
            "text": "The result "
        },
        {
            "text": "In the end, technical staff gained a deeper understanding of the user’s perspective, something that felt refreshingly different from their usual work."
        },
        {
            "text": "Most importantly, we identified valuable opportunities to improve the platform, making access to IT support quicker and easier for users. This helps them stay focused on delivering the government’s priorities."
        }
    ]
}