{
    "url": "https://ruralpayments.blog.gov.uk/2021/09/16/countryside-stewardship-an-update/",
    "title": "Countryside Stewardship – An update",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship"
    ],
    "pub_date": "2021-09-16T15:16:51+01:00",
    "content": [
        {
            "text": "Countryside Stewardship (CS) provides financial incentives for farmers, woodland owners, foresters and land managers to look after and improve the environment."
        },
        {
            "text": "It’s one of the schemes that we administer in the RPA. There’s been quite a bit of activity recently on this area of work, so we thought we’d provide an update on where we are."
        },
        {
            "text": "As confirmed in our previous ‘What’s Next?’ blog, 11 June saw the final date for Countryside Stewardship revenue claims. We received around 20,170 valid CS claims, which is an increase of more than 25% compared to last year. Our teams are busy working hard to prepare to make payments to customers from 1 December and we’ve already completed all of the necessary checks on over 3,700 CS Revenue claims."
        },
        {
            "text": "In light of the announcements around the Sustainable Farming Incentive (SFI), we extended the deadline for requesting an Online Application Pack for 2022 Countryside Stewardship Mid-Tier, to give people a chance to consider their options as further information on SFI 2022 had been made available. The final deadline for receipt of applications was 30 July 2021 and by this point, we received nearly 10,400 Mid-Tier and Higher-Tier applications, an increase of over 2,000 compared to last year.  These are now being processed and we will start to send out agreements in the near future."
        },
        {
            "text": " "
        },
        {
            "text": "CS is very much a valued and important scheme and we’re continuing to commit to delivering it alongside planning for the new environmental land schemes as part of the Agricultural Transition Plan. We know that farmers play such an important role, and these applications will help to look after and improve the environment in many ways. This includes conserving and restoring wildlife habitats, preserving historical features in the landscape, flood risk management and encouraging educational access. We are grateful we are able to work together with our customers to deliver the CS scheme. 2023 will be the last year for applying for agreements (to start in 2024), and by then we will have the new environmental land management schemes in place as an alternative."
        },
        {
            "text": "Our two top tips to help us keep our processes as smooth as possible."
        },
        {
            "text": "As always you can contact us if you need help or advice."
        },
        {
            "text": "Email: ruralpayments@defra.gov.uk"
        },
        {
            "text": "Helpline: 03000 200 301"
        },
        {
            "text": "If you have any questions about our work, please comment below. To receive further updates you can subscribe to the blog."
        }
    ]
}