{
    "url": "https://lifeathmrc.blog.gov.uk/2021/09/16/digital-forensics-at-hmrc/",
    "title": "Digital Forensics at HMRC",
    "authors": [
        "Mems Bangura",
        "Debbie Clerkin"
    ],
    "categories": [
        "General",
        "Guest blog"
    ],
    "pub_date": "2021-09-16T11:06:42+00:00",
    "content": [
        {
            "text": "When you hear of HMRC you may immediately think about the ‘taxman’, Self Assessment and other Government Gateway services provided to the public, but we have over 20 different professions across the department."
        },
        {
            "text": "Deborah has been working as a Forensic Practitioner within our organisation for just over two years. Our Cyber & Digital Forensics division assists our Fraud Investigation Service teams in securing crucial incriminating data, to be used as evidence in a court hearing. Deborah explains the exciting ways in which HMRC assists in fighting organised crime and criminal activity of fraud and tax evasion."
        },
        {
            "heading": 2,
            "text": "Life as a Forensic Practitioner "
        },
        {
            "text": "So, what exactly is Digital Forensics? While typical TV crime shows are not too wide of the mark, it is not always as easy as they make out and certainly not as quick. First and foremost, it is a form of science. So, initially data is extracted from digital devices and then rendered into a useable form. This data is then processed and interpreted to be used as intelligence for investigations and as evidence in criminal proceedings."
        },
        {
            "text": "There are many tools at our disposal to extract and interpret this data and as a Forensic Practitioner, it is important to understand what the data is showing us, as well as where the evidence comes from. With technology always evolving, we are constantly adapting our processes to understand the data better. It may sound a little intimidating, but the work is both exhilarating and rewarding as we encounter new challenges each day."
        },
        {
            "heading": 2,
            "text": "It’s more than just examinations "
        },
        {
            "text": "So, what is a typical day like? Well, as cliché as it sounds, no two days will ever be same. The core responsibilities of course start with forensic examinations of digital devices that range from laptops, desktop PCs, USBs and even CCTV units. We then capture a forensically sound image using software only available to law enforcement for further analysis. While many of these devices are commonplace, you can never let your guard down. You may encounter unexpected obstacles, such as high-level encryption, which are becoming increasingly common to even the simplest of consumer devices and require more unique methods of extraction."
        },
        {
            "text": "Mobile phones are another specialist area of forensics and make up most of our workload since mobile devices require more specialist tools for extraction and come with their own unique set of complications."
        },
        {
            "text": "As well as processing acquired data, there is also a great opportunity to take part in Research & Development projects with our wider team.  Whether that’s experimenting with new forms of data acquisition, developing new tools and software to assist our forensic duties or exploring how new devices and tech work. There is certainly a wide variety of things to get stuck into and many opportunities to develop and specialise in skills and areas that interest you."
        },
        {
            "heading": 2,
            "text": "You don’t always need a technical qualification "
        },
        {
            "text": "Having previously come from a retail and creative background, moving into Digital Forensics was a big career shift for me. While technical qualifications will help in your role, all you really need is a passion for technology."
        },
        {
            "text": "When I first joined the team, I was a bit nervous; but there are many ways to develop your skills, whether that’s through the variety of courses available, or with supportive colleagues and mentors. I have made some fantastic friends; the teams here are some of the most welcoming and friendly people I have had the pleasure of working with."
        },
        {
            "text": "In the 2 years I’ve been at HMRC, I have had many accomplishments that I am proud of and I’m constantly learning. There are many avenues for career progression, whether that’s within Digital Forensics, or transiting into other areas of HMRC. With two offices covering both Nottingham and London, flexible working approaches and a host of exciting opportunities, there has never been a better time to start a career in Digital Forensics at HMRC."
        },
        {
            "text": "To find out more about our Digital Forensics team, check out our latest video."
        },
        {
            "text": " "
        }
    ]
}