{
    "url": "https://digitaltrade.blog.gov.uk/2021/09/16/leading-the-design-community%e2%80%af/",
    "title": "Leading the design community ",
    "authors": [
        "Andrei Pirogov, Interaction Designer"
    ],
    "categories": [
        "Careers",
        "Culture",
        "Flexible working",
        "People and Skills"
    ],
    "pub_date": "2021-09-16T15:14:15+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Promotional posters for design community sessions"
        },
        {
            "text": "The design community of practice allows us to collaborate, share knowledge and expertise so we can thrive as individual designers. "
        },
        {
            "text": "We are a group of 15 individuals working in DDaT under the design profession which includes service designers, interaction designers, and graphic designers. We have a 50/50 split when it comes to civil servants and contractors which is a good mix considering the various levels of experience. "
        },
        {
            "text": "One of the main aims of the community is to transfer knowledge from more senior members to those with less experience. This is to make sure that we tap into the valuable expertise of more experienced colleagues and grow the skills of the team. "
        },
        {
            "text": "We do this by hosting webinar style talks about a project we have recently worked on. One of the designers walks us through their designs, their thinking, the challenges, and how they arrived at a solution. We then have a Q&A session which leads to discussions on the work that was presented.  "
        },
        {
            "text": "Another important aim is to build relationships between designers, so that we make the working environment more productive, open, and transparent. This is vital when we work together or review each other’s work. No designer works in isolation. Having good relationships means that you can rely on good advice, which will make the difficult design problems a lot less daunting. "
        },
        {
            "heading": 3,
            "text": "The challenge "
        },
        {
            "text": "When lockdown started, we switched to working remotely. As we could not see each other in person, this caused disruption to our usual working model. So, as design community manager, I looked at ways of creating something fresh to accommodate the new ways of working. "
        },
        {
            "text": "The biggest challenge was to make it interesting enough for people to attend and useful enough so that they would make time for it in their busy schedules. One way of doing this was to transition the community meeting from just talking about work to focusing more on people and what they do. "
        },
        {
            "heading": 3,
            "text": "Applying the structure "
        },
        {
            "text": "In a few months, more members joined, and I started implementing a new strategy based on individual discussions I had with them all. "
        },
        {
            "text": "We introduced themes around hobbies and learning, running the meeting every 2 weeks for an hour. They proved popular with the group and our meeting numbers increased.  "
        },
        {
            "text": "We have also introduced time to share learning and development tips. It is great learn from others and listen to their experiences. We have a simple rotation method where each designer gives a talk depending on their availability. These are usually scheduled a month or so in advance.  "
        },
        {
            "heading": 3,
            "text": "The outcome "
        },
        {
            "text": "We have created a fun design community where everyone eagerly engages and looks forward to the next meeting. We have found out that some of us are surfers, musicians, artists, painters, board game creators and quiz masters. "
        },
        {
            "text": "We had a great talk on service design, where the designer took us throughout each step of the process, showing how they arrived at their solutions. We had another interesting talk on career paths and moving from the US, and one which talked about their band and recording in a studio in Nashville. "
        },
        {
            "text": "This in turn strengthened our relationships as colleagues and it paid dividends for future collaboration which promoted productivity. "
        },
        {
            "text": "Since establishing this, attendance has risen from 20% to 75%, with almost all members having given a talk within the 6 months. As community manager there is no better feeling than having the members of the community express their gratitude for a time well spent. "
        },
        {
            "heading": 3,
            "text": "Working as designer in DDaT "
        },
        {
            "text": "The community offers a pool of knowledge and provides colleagues which the space to develop. It’s great to be part of something bigger than yourself and contribute to a service that other people use. "
        },
        {
            "text": "Managing the community of practice also gave me a chance to stretch my leadership skills, and seeing the community develop the way it has gives me a great feeling of belonging. "
        },
        {
            "text": "A few things I learned as community manager: "
        },
        {
            "heading": 3,
            "text": "Lessons learnt  "
        },
        {
            "text": "When managing a community of practice, communication on goals, vision and next steps is key. You want your community to be kept up to date and informed on what is happening so that they know what to expect. What I like about leading the design community is that I get to talk to designers, and organise community meetings which are fun, interesting, and informative.  "
        },
        {
            "text": "For a designer, DDaT is a great place to work because you get to solve problems, stretch your skills, and collaborate on projects whilst receiving excellent support from colleagues. "
        }
    ]
}