{
    "url": "https://civilservicelocal.blog.gov.uk/2021/09/16/learn-about-neurodiversity-in-the-workplace/",
    "title": "Learn about Neurodiversity in the workplace",
    "authors": [
        "Heather Flanagan"
    ],
    "categories": [
        "A National Spotlight",
        "Northern Ireland",
        "Scotland"
    ],
    "pub_date": "2021-09-16T09:00:57+00:00",
    "content": [
        {
            "text": "Did you know it is estimated that 1 in 7 people are neurodivergent. This means it is highly likely that you, or someone you work with, is contributing to the natural and often hidden neurodiversity within our workforce."
        },
        {
            "text": "Dyslexia, Dyspraxia, Autism, Tourettes and Attention Deficit Hyperactivity Disorder (ADHD) are just some of the terms you may have come across – but what does this mean for you as an individual, colleague, line manager and as a civil servant?"
        },
        {
            "text": "We all have different experiences and view life from different points of view. We also know that seeing it from someone else’s perspective helps us build understanding, confidence, resilience and appreciation of others and therefore build inclusion."
        },
        {
            "text": "The session will offer practical knowledge and skills to apply in assisting colleagues. It will cover the challenges faced by neurodiverse colleagues in the workplace and will also celebrate the many benefits a different perspective can bring."
        },
        {
            "text": "Anyone with an interest in neurodiversity or creating an inclusive workplace should attend this short session courtesy of HM Passport Office in Northern Ireland."
        },
        {
            "text": "We hope there will be plenty to educate and stimulate."
        },
        {
            "text": "If you would like any further information on this event or if you would like to share work that your department is doing with the wider Civil Service please email the team  - CSLocalScotlandandNorthernIreland@cabinetoffice.gov.uk"
        }
    ]
}