{
    "url": "https://civilservice.blog.gov.uk/2021/09/16/living-with-loss-a-little-message-goes-a-long-way/",
    "title": "Living with loss: A little message goes a long way",
    "authors": [
        "Keela Shackell-Smith, Inclusion Manager at the Food Standards Agency"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-09-16T11:09:24+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When Keela Shackell-Smith was rocked by her mum’s death, she founded The Grief Cafe to bring bereaved staff together, and her subsequent blog struck a chord with you. Now she’s back, determined to help staff who lost loved ones during the pandemic."
        },
        {
            "text": "I was overwhelmed with the response to my  blog ‘Connecting over Grief’. Since then, the mailing list for the Grief Cafes has soared to more than 350 civil servants, a new baby loss support group has  launched and many organisations have approached me about bereavement networks and holding in-house Grief Cafés. The Cross Government Grief cafes will continue, but I’m really pleased that more cafes are being set up. "
        },
        {
            "text": "Grief Cafe"
        },
        {
            "text": "This summer, I hosted a Grief Café for those who’ve experienced a covid-related bereavement. We talked about how everything has changed, some people couldn’t comfort  their loved ones in their final moments, some had to watch funerals online, some wanted to be consoled by family, but could only do so online. "
        },
        {
            "text": "We spoke about moving into the next phase of the roadmap, and for many staff bereaved during the pandemic, this has presented  a double-edged sword. "
        },
        {
            "text": "Many are anxious. Many are concerned that what happened to their loved one will happen to more family/friends. Many feel alone because whilst their friends are celebrating, planning  holidays and enjoying nights out  at the pub, they just want their loved one back. For them 19 July isn’t a celebration but a painful reminder of their loss. "
        },
        {
            "text": "No two people have had the same experience through the pandemic. Many people in the Civil Service will have lost loved ones. "
        },
        {
            "text": "What I ask is that you acknowledge their loss. A simple message goes a long way. When you meet again, send a message to a colleague if they were bereaved during the pandemic. Ask a simple question ‘how are you’, acknowledge that they may have mixed feelings, or offer a 15 minute coffee chat if they’d like to chat about their loved one. "
        },
        {
            "text": "Considering colleagues"
        },
        {
            "text": "If you’re a Line Manager, consider how your colleagues might be feeling on this day. It might have been over a year since they experienced their loss or it might have been in the last few weeks. The important thing is to acknowledge their loss. "
        },
        {
            "text": "It’s the simple things: "
        },
        {
            "text": "▶︎ Be a good listener – Be guided by the individual. Listen to memories. Listen to stories. "
        },
        {
            "text": "▶︎ Let them feel sad – It’s natural. Grief Cafes are triggers for everyone who joins them. There is no judgement in Grief Café. Don’t try and ‘fix’ things, the only ‘fix’ is to bring back my loved one and that’s not possible. "
        },
        {
            "text": "▶︎ Say their name – Often people are afraid to say the loved ones name for fear of upsetting a friend/ colleague. Don’t be afraid, I’m thinking of them constantly. "
        }
    ]
}