{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/09/16/making-multidisciplinary-teams-work-better/",
    "title": "Making multidisciplinary teams work better",
    "authors": [
        "Kate Bruckshaw",
        "Chris Beardsell"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2021-09-16T12:12:28+01:00",
    "content": [
        {
            "text": "As Niamh described a few weeks ago, the idea of using multidisciplinary teams to support policymaking is nothing new. It’s a term that’s been around for a decade or so and an idea that was driven by the push to make things more open, the need for greater collaboration and the emphasis on understanding the often complex lived experience of people impacted by public policy."
        },
        {
            "text": "All that now matters more than ever before. Policymakers increasingly work in environments that are messy, ambiguous and uncertain; designing, developing and testing policy at speed and at scale. It can be genuinely difficult to comprehend some of this if you’re outside of government. And it’s hard."
        },
        {
            "text": "Making a success of multidisciplinary team working is also hard. Sure, there are examples of doing it well – both of us have spent time in highly effective teams that can readily claim to have been multidisciplinary – but it’s never been easy."
        },
        {
            "text": "That’s because expertise and skills are constantly evolving – in a good way: think about the recent and rapid growth of data science and behavioural economics for example – funding arrangements might need to change so you can sustain digital delivery and governance might just need to be done very differently."
        },
        {
            "text": "All of this is invasive to existing norms, pushing at the boundaries of how teams and organisations work but none of it can be made to work without having the right people, the right conditions and a right way for the team to communicate."
        },
        {
            "text": "That’s the challenge – the idea of building a different, better, environment for multidisciplinary teams to work in – that we’ve been looking at here in DWP."
        },
        {
            "heading": 2,
            "text": "People, policy and services"
        },
        {
            "text": "For the last couple of months, we’ve been testing how we might bring together DWP’s Innovation Lab (part of our Digital Group) with the Policy Exploration team (which sits in our Policy Group) to develop a multidisciplinary team model."
        },
        {
            "text": "We’ve started by taking a critical look at the people we could and should be involving. That might seem obvious but it’s easy to get stuck in doing the same things. And if we’re honest about it, a lot of talk about being multidisciplinary actually revolves around digital teams, so we see and hear about roles involving products, engineering, security and so on. They’re really important – essential if you’re developing digital services – but they’re not normally enough, which is why we’re very deliberately looking to involve more policy people."
        },
        {
            "text": "Whether it’s helping someone get back into work, start a new business or access healthcare advice, policy outcomes are largely delivered through services. Policy and services are then pretty inseparable: for most of the public, the policy is the service and, in turn, this is their experience of how government works."
        },
        {
            "text": "Policy people almost invariably have the best understanding of complex problem spaces, the reality of the policy intent and, crucially, any political complexion."
        },
        {
            "text": "They make a huge difference to the ability to experiment, test ideas and learn about what might work before making big investments. We just need to make it easier to get people from divergent backgrounds to work together – Andrew calls this the ‘conductor’ role – and do more to create a common language."
        },
        {
            "heading": 2,
            "text": "Taking a mission approach "
        },
        {
            "text": "Our first priority has been to get this right – or at least to make it consistently better: it’s not about perfect practice at this stage – by adopting an approach inspired by the mission style used in the latest GDS strategy."
        },
        {
            "text": "We’ve set out three main missions around skills and experience (learning what works for a range of multidisciplinary set-ups); working together (‘conducting’ and ‘translating’); and using data and technology in more innovative ways (which reflects the vision of a modern, innovative Civil Service)."
        },
        {
            "text": "For each of these, we’ve made explicit commitments on what we will trial, test and re-test as the essential ways of working for a flexible, innovative, multidisciplinary team model that brings together policy, digital and delivery skills."
        },
        {
            "text": "Some of this is basic stuff. To pick an example, we’ve got a big commitment to making kit work well for everyone so that software tools, data and prototype ideas can be shared and collaborated on, regardless of where you sit in an organisation or what kind of device you’re using. That’s fundamental to how we work but it’s not always been a walk in the park and we could and should be better."
        },
        {
            "text": "Then there’s the challenge of using a Design Sprint framework (maybe more in a ‘relay’ form), familiar to most people with a digital background but probably needing some adaption for policy colleagues. And some translation."
        },
        {
            "text": "We’ve almost wrapped up our first coupling-up of the Lab and Policy Exploration and we’ll be back with a follow-up blog to share some of what we’ve learned, what we think has worked – and not worked – and what we’re doing next."
        }
    ]
}