{
    "url": "https://phescreening.blog.gov.uk/2021/09/16/nhs-diabetic-eye-screening-services-and-the-national-diabetes-audit-join-forces-to-evaluate-diabetes-care/",
    "title": "NHS diabetic eye screening services and the National Diabetes Audit join forces to evaluate diabetes care",
    "authors": [
        "Phil Gardner",
        "Patrick Rankin"
    ],
    "categories": [
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2021-09-16T10:45:18+01:00",
    "content": [
        {
            "text": "The National Diabetes Audit (NDA) is one of the largest clinical audits in the world. It collects data each year from a range of primary and secondary care services with the aim of improving diabetes care nationally."
        },
        {
            "text": "The NDA helps to improve the quality of diabetes care by enabling participating NHS services and organisations to:"
        },
        {
            "text": "NICE recommends 9 care processes for people with diabetes, but until last year only 8 of these were included in the NDA."
        },
        {
            "text": "The ninth is NHS diabetic eye screening (DES), and the reason for its omission prior to 2020 is because DES data is held in local DES provider management systems rather than GP or hospital systems, which made it difficult for the NDA to collect."
        },
        {
            "heading": 2,
            "text": "NHS screening services now required to submit data to NDA annually"
        },
        {
            "text": "A great deal of work took place during 2019 and 2020 in an effort to get DES data included in the NDA. And following collaboration between PHE Screening, NHS Digital and the DES software suppliers, a method was established by which DES data could be submitted. With the cooperation and support of local NHS DES services, this resulted in DES data being included in last year’s NDA for the very first time."
        },
        {
            "text": "Following this landmark achievement, a requirement was added to the NHS 7a Service Specification for Diabetic Eye Screening. Local services are now expected to provide data to the NDA on an annual basis, thereby helping to ensure the ongoing inclusion of DES data in this important national audit."
        },
        {
            "text": "Although 2020 exceeded our expectations and data was received from the vast majority of local screening providers, it was not possible to obtain data from all 57 of them. So the aim for 2021 was to improve the process for data collection and achieve 100% submission from NHS DES providers."
        },
        {
            "text": "The DES software suppliers, InHealth Intelligence and NEC Software Solutions, supported this aim by ensuring that a report could be run to obtain the relevant data, and NHS Digital worked to provide a mechanism for this data to be submitted to the NDA."
        },
        {
            "text": "The process this year has not always been smooth and has taken longer than anticipated, but the outcome is that all 57 DES providers successfully submitted data, and this year’s NDA will include a complete picture of the diabetic eye screening care process nationally."
        },
        {
            "text": "This is important because it allows the NDA to audit what percentage of people registered with diabetes received all 9 of the key care processes recommended by NICE."
        },
        {
            "heading": 2,
            "text": "Thank you to all providers for your patience and persistence"
        },
        {
            "text": "We would like to thank all those involved in achieving this goal, including local services for their patience and persistence in running the reports and submitting their data."
        },
        {
            "text": "Over the coming months we will be refining the process further in order to make sure the issues encountered this year are resolved, and the process for 2022 is improved. Communications will be sent out early next year to inform DES providers of the requirements."
        },
        {
            "text": "For more information regarding the NDA please visit the NHS Digital website."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}