{
    "url": "https://defradigital.blog.gov.uk/2021/09/16/online-recruitment-working-remotely-and-yet-to-meet-our-team-mates/",
    "title": "Online recruitment, working remotely and yet to meet our team-mates",
    "authors": [
        "Josh George",
        "Junayed Islam"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2021-09-16T14:01:00+01:00",
    "content": [
        {
            "text": "Since March 2020, many Defra staff have worked from home. We support and encourage flexible and home working. As an organisation, we were well placed to react when the pandemic struck, and online tools and platforms have enabled us to collaborate and work effectively during this period. These have also allowed us to continue growing our team and we’ve worked hard to help new starters to integrate – be that by delivering office equipment to their doors, or simply cultivating an open and friendly digital workspace."
        },
        {
            "text": "Despite this, we recognise that those who have joined us during this period will not have experienced anything approaching what we might have previously considered a ‘normal’ induction to life at Defra. So, what exactly has it been like to join Defra during a pandemic?"
        },
        {
            "heading": 2,
            "text": "Josh George, Data Analyst          "
        },
        {
            "text": "Starting a new career can be an overwhelming experience and nerve wracking, but starting a new career during a global pandemic, well that is a totally different experience."
        },
        {
            "text": "I come from a Computer Science background with a strong passion for, and experience in, data analysis. Having completed my master’s degree earlier in the pandemic, I was ready to dive into what I knew would be a competitive job market."
        },
        {
            "text": "At first, I was anxious about how starting a new job would work out. However, with most staff working remotely, that made the recruitment process a little easier for me. Everything was completed online. Normally, attending an interview in person requires travel and other arrangements, which I personally think adds to the pressure. I found being interviewed remotely more like a switch on, switch off task. From the interview, and through the whole HR procedure, everything was completed online."
        },
        {
            "text": "I had my first day at work within a month of my interview. The whole process was very easy and straightforward. The civil service has one of the most simple, efficient, and straightforward recruitment processes compared to many other organisations. With the ‘name-blind’ recruitment approach every individual is judged on merit, which I believe is very inclusive."
        },
        {
            "text": "Having now been at Defra for four months I am yet to meet any of my colleagues in person! Sounds crazy, I know. I’m currently involved with data reporting in the Animal Plant Health Agency (APHA). In my team we format and transform data into a digestible format. I am also involved with various projects related to data estates."
        },
        {
            "text": "My job role was advertised as flexible, but I wasn’t quite prepared for how much flexibility there would be. I now realise it’s one of the benefits of being a civil servant, especially here in Defra. It’s surprising just how much of my work can be done online, sitting anywhere in the country, especially working in a technology role such as mine. That flexibility offers big work / life balance benefits."
        },
        {
            "text": "I’ve always liked the idea of working in the public sector hence why I started focusing my job search on civil service roles. However, finding the right job, one that suits my skills and interests and with a future career pathway, was equally important. That’s when I came across this Data Analyst role in Defra. Coming from a family with a background in farming and living most of my life in a rural area, I always considered myself a supporter of the environment. Alongside my passion for technology, my relevant degree, and my keen interest to work within a government sector, I couldn’t have found a role or an organisation that were better suited for me."
        },
        {
            "text": "As our Defra offices gradually gear up for more staff to return, I am very much looking forward to meeting, for the first time in person, the colleagues I’ve been ‘working with’ for the last few months."
        },
        {
            "heading": 2,
            "text": "Junayed Islam, Data exploitation and capability              "
        },
        {
            "text": "I joined the civil service because of my love for data and analytics. Defra is a department where I feel I can use my knowledge and experience to make a difference."
        },
        {
            "text": "Life at Defra started quite differently for me than any other previous job. The somewhat unusual start has however been made easier by the leadership and support I’ve had from my line manager. From the start of the initial recruitment, which was all virtual and online, through to the actual onboarding process, everything went very smoothly."
        },
        {
            "text": "Prior to joining Defra, I worked as a researcher in an EU-funded project for criminal intelligence analysis, and in IT roles in large multi-national . I also authored several research articles and contributed to books about data analytics. My interests include big data analysis, visualisations, and machine learning."
        },
        {
            "text": "I’m thankful that I have been able to my work from home during this pandemic period which has made me, and my family, feel safe. We have used the online platforms available to us for carrying out our day-to-day reporting tasks. Regular meetings, structured job objectives and development plans have made my daily work more focused and easier. It has also removed any feelings of isolation due to working from home and helped me to keep myself well motivated."
        },
        {
            "text": "Home working is a bit different to my previous office-based roles because I used to be able to socialise and network with others. That said, in my current role at Defra, I now have more flexibility, independence, and freedom."
        },
        {
            "text": "Overall, what I have taken from this experience so far is that individuals and teams such as ours can perform just as well when they are geographically dispersed. Defra is a great place to work, with diverse teams who are all working together to achieve better environmental outcomes."
        },
        {
            "text": "Want to join the team?\nWe’re recruiting for Data Analysts now. Check out our latest vacancies."
        },
        {
            "text": " "
        }
    ]
}