{
    "url": "https://publicguardian.blog.gov.uk/2021/09/16/we-want-to-hear-from-you-on-modernising-lpas/",
    "title": "We want to hear from you on modernising LPAs",
    "authors": [
        "Laura Crouch"
    ],
    "categories": [
        "Attorneys",
        "Digital",
        "Future planning",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2021-09-16T11:13:30+01:00",
    "content": [
        {
            "text": "There is still time to share your views on proposals to modernise lasting powers of attorney (LPAs)."
        },
        {
            "text": "The Ministry of Justice (MoJ) started a 12-week consultation in July and it’s easy to respond online or in writing.  More than 140 responses have already been received, with many coming from members of the public."
        },
        {
            "text": "The consultation was launched to gather evidence on the best way to reform how LPAs are created, and it focuses on areas that are likely to need legislative change to make that happen."
        },
        {
            "text": "We want to make LPAs safer, simpler and fit for the future."
        },
        {
            "text": "Safer – we want to create a process which improves safeguards against fraud, abuse and undue pressure."
        },
        {
            "text": "Simpler – the process of creating and registering an LPA should be quick, accessible and user-friendly for all, with the option of a paper-based route if required."
        },
        {
            "text": "Fit for the future – providing a service that is financially sustainable while keeping LPAs affordable is essential, as we rely on more digital services that are fit for a modern world.\n\nThis does not mean we are removing paper from the process. As part of this work, we are considering exactly how we can ensure that a paper channel with equivalent safeguards can be provided for those who need it."
        },
        {
            "text": "Alongside the consultation, a series of workshops have taken place, giving the opportunity for in depth discussions on these areas. We’ve had a fantastic response with more than 100 people attending these events, including representatives from the legal, finance, digital and charity sectors."
        },
        {
            "text": "This level of engagement is really encouraging. Thank you to everyone who has participated and taken time to submit a response. Each response provides us with valuable insight on the issues that matter the most to the public and stakeholders."
        },
        {
            "text": "At the start of the consultation, a livestream question and answer session took place, featuring our Public Guardian Nick Goodwin, and representatives from MoJ Policy and Digital. The event outlined why the consultation is taking place and you can watch it again on our YouTube channel."
        },
        {
            "text": "We are still keen to hear feedback from as many different sectors and communities as possible, and from individuals who are thinking about making an LPA or who have already made and registered one."
        },
        {
            "text": "The consultation is open until 13 October 2021. If you would like to share your views, please respond online, on email mlpaconsultation@justice.gov.uk, or in writing to:"
        },
        {
            "text": "MLPA - Vulnerability Policy Unit\nFamily and Criminal Justice Policy Directorate\nMinistry of Justice\nPost point 7.25\n7th Floor\n102 Petty France\nLondon\nSW1H 9AJ"
        }
    ]
}