{
    "url": "https://ukhsa.blog.gov.uk/2021/09/16/what-londoners-can-expect-this-winter/",
    "title": "What Londoners can expect this winter",
    "authors": [
        "Kevin Fenton"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-09-16T14:41:58+01:00",
    "content": [
        {
            "text": "After the recent warmer weather and summer of more freedoms, it could be easy to think the pandemic is behind us. London currently has the lowest COVID-19 case rate of any region in England but people are coming back together for autumn with the return of schools, universities and workplaces."
        },
        {
            "text": "While levels of transmission of the coronavirus remain high overall, it’s time for us to be vigilant and ensure we are fully prepared for potentially challenging months ahead. Coronavirus restrictions in place last year meant that many of the usual winter viruses such as flu, norovirus and RSV were suppressed, so we’re preparing for an unpredictable winter with many more respiratory and seasonal infections circulating."
        },
        {
            "text": "COVID-19 vaccines save lives"
        },
        {
            "text": "Vaccines remain the most powerful and effective tool against severe disease and death from COVID-19, and have proven to be effective against many of the new variants of the virus that have emerged over the past year. A key part of preparing for the upcoming winter season is ensuring we continue to increase population coverage and uptake of vaccines, and the recent announcements about the booster programme and vaccine offer to 12-15 year olds are welcome."
        },
        {
            "text": "Although we have made great progress with rolling out the vaccine programme in London, we have further to go to ensure we have high levels of uptake in all age cohorts, communities and areas of the city. London, like other large metropolitan areas with younger, more diverse, disadvantaged and mobile populations, generally has lower uptake of childhood and adult vaccines compared to other regions, and it’s been no different for the COVID-19 vaccines. Across the UK over 80% of people aged 16 and over are fully vaccinated compared to just 60% in London."
        },
        {
            "text": "Because of the somewhat mixed picture of vaccine uptake across the city, protection against the severe disease and death caused by the virus this winter is likely to be uneven. The data on vaccination is clear; only 1.2% of deaths involving COVID-19 between January and July this year occurred in people who received both doses of the vaccine.  Although case rates in London have been stable in recent weeks, the average number of daily infections is ten times higher than this time last year. We are therefore coming into winter from a higher baseline and strengthening our vaccine coverage throughout the city is essential as it will be our strongest line of defence."
        },
        {
            "text": "Addressing vaccine hesitancy"
        },
        {
            "text": "We know that the difference in mortality risk between ethnic groups can largely be explained by demographic, geographical and socioeconomic factors, often exacerbated by limited trust and engagement with public health services, poor access to healthcare and lower confidence in the safety and effectiveness of the vaccine due to commonly held myths and misinformation. This is why we continue our commitment to working with London’s communities to provide reliable and accessible information about health and vaccines throughout this period, ensuring that every Londoner can make an informed choice and readily access the vaccine, protecting all our communities and leaving none behind."
        },
        {
            "text": "We now have the research, experience and tools to ensure the vaccine is delivered safely to all who need it. From early in the pandemic, we have listened to our communities to understand how and where they like to access information. Taking a united approach with our partners in London to share information consistently has been vital. Over the summer, we worked collectively with young Londoners, the NHS and the Mayor of London's team at the Greater London Authority to understand the barriers to 20-25 year olds in the capital getting their COVID-19 vaccine and how to overcome them."
        },
        {
            "text": "Young adults shared that they wanted to have open and honest conversations to help shape their decision, but away from vaccine centres, and in creative spaces with likeminded people. Together we co-designed the “London, You Good?” project and supported over 30 local community organisations in more than 20 boroughs to host events through music, sport, film, dance and other activities. This brought together young Londoners from across the city so they could have their questions on the vaccine answered and an environment to discuss the significant impact of the pandemic on their lives and the effect on their mental health."
        },
        {
            "text": "Keep on getting vaccinated, London"
        },
        {
            "text": "Every day, uptake of the COVID vaccine continues to increase as thousands of Londoners get their jabs at GP practices, vaccination centres, local community pharmacies and vaccine outreach hubs. However, we still have a long way to go if we are to achieve high vaccine coverage in all corners of the city and all eligible age groups. It has been an immense effort so far by all involved but the rate of uptake has slowed, and rates are especially low among young men from economically disadvantaged communities, and Black Caribbean and Black African young men from all backgrounds. We need Londoners to continue with the effort – getting vaccinated, taking up the booster jab if eligible, and encouraging young people to get vaccinated too."
        },
        {
            "text": "Stay safe this winter"
        },
        {
            "text": "It is important to remember that the direction of the pandemic could change quickly with emerging winter pressures and that is why new guidance such as the government’s Winter Plan and the Chief Medical Officers’ recommendation to extend vaccination to all 12-15 year olds, aim to keep pace, so we can keep on top of the pandemic.  Rising rates could require a return to more stringent measures including compulsory mask wearing, working from home and vaccine certification. The journey to recovery is going to be a marathon, not a sprint, and unfortunately this is not an issue that will disappear overnight."
        },
        {
            "text": "So, as we proceed through autumn and into winter, we’re still advising people to stay cautious and to keep up to date with the latest news and information. Continue wearing face coverings in crowded areas and on public transport, ventilate indoor areas, test yourself twice a week with lateral flow devices, and get a PCR test and stay at home if you have symptoms."
        },
        {
            "text": "If you haven’t yet had your vaccine or second dose, please come forward as soon as possible so London has the best protection and chance of keeping life going safely this winter. Give yourself and those you love the best protection against the most devastating impacts of this disease. The vaccine offer remains open for everyone eligible and there’s no such thing as a missed chance, so if you’ve left it a while it’s not too late! Book your vaccine appointment today or find a walk-in vaccination site."
        }
    ]
}