{
    "url": "https://educationhub.blog.gov.uk/2021/09/16/with-your-help-we-are-going-to-transform-the-lives-of-the-most-vulnerable-and-disadvantaged-an-open-letter-to-education-and-care-professionals-from-new-education-secretary-nadhim-zahawi/",
    "title": "\"With your help, we are going to transform the lives of the most vulnerable and disadvantaged\": an open letter to education and care professionals from new Education Secretary Nadhim Zahawi",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Apprenticeships",
        "Further education",
        "Higher Education",
        "Looked after children",
        "Primary Schools",
        "Secondary schools",
        "Universities"
    ],
    "pub_date": "2021-09-16T19:13:21+01:00",
    "content": [
        {
            "text": "Nadhim Zahawi, the new Secretary of State for Education, has written to all those working in education and care to introduce himself and thank them for all their work "
        },
        {
            "text": "To all those working in education and care,"
        },
        {
            "text": "I am writing to introduce myself, to thank you for the outstanding job you have done during these challenging times, and to pledge to work with you to spread the opportunity of excellent education."
        },
        {
            "text": "You have supported children and learners through the disruption of the pandemic – helping them through difficulties, celebrating and supporting the heroism and resilience they have shown, and giving them the tools for future success. Your work has been outstanding, and I thank you for it."
        },
        {
            "text": "A great education unlocks potential. It helps spread opportunity evenly to everyone in society – whatever their background – and it lies at the heart of the pledges the government has made about levelling up."
        },
        {
            "text": "That’s why it is such an honour to have been appointed Education Secretary, and such a great privilege to work with you – the carers, early years practitioners, teachers, support staff, lecturers and social workers working in, and with, our nurseries, schools, colleges and universities."
        },
        {
            "text": "I know, profoundly and at first hand, how important your work is. When I first came to the UK from Iraq as a child, my English was poor, and I hid in the back of classrooms to escape the gaze of teachers."
        },
        {
            "text": "I might have become a forgotten child, with opportunities closed off."
        },
        {
            "text": "But my teachers never gave up on me. They challenged me to do better, and supported me along the way, so that I was able to make the best of the opportunities in front of me. I owe them a debt of gratitude; and I owe other children my unfailing effort to provide the same chances that I had to grow, and to flourish."
        },
        {
            "text": "My commitment is to pursue and support excellence for every child and every learner. That means academic excellence and skills that lead to brilliant jobs; but also the surrounding support and care that allow every child to take advantage of those opportunities and make the most of them."
        },
        {
            "text": "I will listen to you and work with you to make sure we do right by children and learners. And, with you, I will also listen to children, families, young people and adult learners so that we can spread opportunity far and wide."
        },
        {
            "text": "With your help, we are going to invest in and keep strengthening our nurseries and schools, the foundation stone of everyone’s opportunities in life."
        },
        {
            "text": "With your help, and with employers, we are going to make changes to post-16 education and training, and maintain our world-class higher education system, which will transform individual life-chances, but also power our economy and make us ever more prosperous."
        },
        {
            "text": "With your help, we are going to transform the lives of the most vulnerable and disadvantaged, including those with special educational needs and disabilities and in care, and ensure that those who have lost the most from the pandemic can recover and flourish, and that prosperity benefits all."
        },
        {
            "text": "It is a mission I am proud to set out on; and one I know will not succeed unless we can work together. Together, we will beat covid, while building back better and fairer."
        },
        {
            "text": "I will be meeting as many of you as possible in the coming months, so that I can hear from you about your work, your plans for the future, and how we can unlock the potential of the nation together."
        }
    ]
}