{
    "url": "https://defrafarming.blog.gov.uk/2022/06/06/how-were-making-sure-all-farm-businesses-can-fairly-access-money-released-from-basic-payments/",
    "title": "How we’re making sure all farm businesses can fairly access money released from Basic Payments",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "Transition support"
    ],
    "pub_date": "2022-06-06T17:22:27+01:00",
    "content": [
        {
            "text": "The government has committed to maintain the farming budget for England at £2.4 billion per year throughout this parliament. This was confirmed again in the recent Spending Review."
        },
        {
            "text": "Currently, most of the farming budget is spent on Basic Payments – subsidies paid to farmers according to how much land they farm. We will be gradually reducing spending on Basic Payments each year over the next 6 years."
        },
        {
            "text": "Instead, we will make the money available to farmers through one-off grants for capital investment in equipment and technology, and ongoing payments for environmental actions and related advice and support. Farmers will be able to get paid for a combination of actions that they choose, to suit their farm business, food production and the environment."
        },
        {
            "text": "We’ll achieve this by:"
        },
        {
            "heading": 2,
            "text": "Allocating the budget"
        },
        {
            "text": "We set out in the update on the Agricultural Transition Plan last June our high-level plans to spend the money freed up from Direct Payments."
        },
        {
            "text": "We will not have fixed allocations (or ‘pillars’, as they were known whilst we were in the EU) of money ring fenced to different schemes. Instead, we will learn as we go and find the best ways to manage the overall budget to respond to demand in a way that helps us achieve our intended outcomes. This means we will keep the allocation of funding between different schemes under review over time."
        },
        {
            "text": "We are already seeing plenty of farmer enthusiasm and action to protect and improve the environment as part of profitable, commercial food producing businesses. We have adjusted our plans to follow increased demand for particular schemes and actions. For example, we have increased our budget for Countryside Stewardship to reflect the recent price increase for most options and the 40% increase in applications we saw last year, so that everyone who applied could join the scheme. We also increased our budget for the new Farming Equipment and Technology Fund to meet demand 3 times higher than our initial budget allocation, so that more than 4,000 farmers could invest in new equipment and technology for their farm business. We will maintain this flexible approach."
        },
        {
            "text": "There is no gap between taking the money out of Direct Payments and it going back into the sector. Right now, farmers not already in Countryside Stewardship can apply for an agreement to start in January. We have already had our first rounds of the Farming Investment Fund and we’ve just closed the first round of applications for Landscape Recovery projects. The Farming in Protected Landscapes scheme is funding a range of activities on farms in national parks and Areas of Outstanding Natural Beauty (AONBs). We will shortly launch the first iteration of the Sustainable Farming Incentive."
        },
        {
            "text": "Over the next 3 years (the period covered by the recent government Spending Review), as we reduce Basic Payments we will incrementally roll out the new range of grants and ongoing payments."
        },
        {
            "text": "We plan to spend the farming budget over the next 3 years as follows:"
        },
        {
            "heading": 2,
            "text": "Making schemes work for all farm types, sizes, locations and tenancies"
        },
        {
            "text": "We are working with farmers and other experts to design all our new schemes to be accessible to and workable for all farm types, tenancies, sizes and locations."
        },
        {
            "text": "For example, in the Sustainable Farming Incentive, we’ve:"
        },
        {
            "text": "We will be looking to apply similar flexibility, fairness and reliability to the design of all our schemes."
        },
        {
            "text": "We know that farmers need to know how all the schemes will work for them and what funding they will be able to access. We will be publishing more information over the course of this year about this so that farmers can plan ahead."
        },
        {
            "text": "The Sustainable Farming Incentive offer this year is just the opening offer – we will be expanding the scheme to cover a wider range of actions and levels of ambition over the next 3 years and we’ll publish further details about this later this year."
        },
        {
            "text": "We’ll be sharing more details this year on how Local Nature Recovery will work for farmers and what sorts of actions it will pay for, and how those in existing agreements will be able to transition smoothly onto the new schemes when they’re ready."
        },
        {
            "text": "Meanwhile we’d encourage any farmer not already in Countryside Stewardship to take a look at the scheme before this year’s application deadline, along with other schemes currently on offer, including Farming in Protected Landscapes, the England Woodland Creation Offer (where you can be funded for planting and maintaining woodland over as little as 1 hectare of land) and our productivity and innovation, research and development grants."
        }
    ]
}