{
    "url": "https://insidegovuk.blog.gov.uk/2022/06/06/iterating-the-gov-uk-proposition-the-first-of-our-improvements-for-2022/",
    "title": "Iterating the GOV.UK proposition: the first of our improvements for 2022",
    "authors": [
        "Robert Rockstroh, GOV.UK Policy & Strategy Manager, Government Digital Service (GDS)"
    ],
    "categories": [
        "Product changes"
    ],
    "pub_date": "2022-06-06T13:20:53+01:00",
    "content": [
        {
            "text": "GOV.UK is for everyone and is designed to help people access information and services quickly and easily, without needing to understand the structures of government. The GOV.UK proposition supports publishers in government to decide where information and services should be published by setting out what should and shouldn't be on GOV.UK. This helps to maintain GOV.UK’s value proposition as the single, trusted home of government information."
        },
        {
            "heading": 2,
            "text": "Reviewing the proposition regularly"
        },
        {
            "text": "We review and iterate the proposition regularly. We do this because GOV.UK keeps changing to meet both changing user needs and departmental needs."
        },
        {
            "text": "The GOV.UK roadmap aims to consolidate GOV.UK as the “single and trusted online destination for government information and services”. As GOV.UK expands to improve people’s experiences with government, the proposition needs to evolve in order to support this ambition and to provide clarity to publishers as GOV.UK changes."
        },
        {
            "heading": 2,
            "text": "We’ve made some changes to the proposition"
        },
        {
            "text": "We will make a number of iterations to the proposition throughout this year, rather than just one change."
        },
        {
            "text": "From today we will be making the following changes:"
        },
        {
            "heading": 2,
            "text": "We’re also updating the campaigns offer"
        },
        {
            "text": "In parallel with our updates to the proposition we are updating the GOV.UK campaigns offer to departments. The GOV.UK campaign templates form part of the wider GOV.UK offer - providing departments with fully accessible and customisable templates for official government campaigns. Working with the Government Communications Service and in response to departmental feedback, we are developing a new multi-page offer for government campaigns. The new template will:"
        },
        {
            "text": "This is already being tested with a number of campaigns such as Help to Grow. We’ll talk more about this work in a separate blog post."
        },
        {
            "heading": 2,
            "text": "Updating the proposition"
        },
        {
            "text": "We’ll gather feedback on how the updated proposition works for users to inform future iterations. We’ll also update the proposition to reflect the new campaign offer once it goes live in the summer. Email govuk-enquiries@digital.cabinet-office.gov.uk if you have any suggestions or would like to get involved in the development of the proposition."
        }
    ]
}