{
    "url": "https://civilservice.blog.gov.uk/2022/06/06/making-caring-visible-valued-and-supported/",
    "title": "Making caring visible, valued and supported",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary",
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-06-06T09:22:54+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Two years after launching the Civil Service Carers’ Strategy, Alex Chisholm and Rebecca Sudworth, Civil Service Carers Champion and Deputy Carers Champion, provide an update on progress.     "
        },
        {
            "text": "Welcome to this year’s Carers’ Week – 6 to 12 June. Across the Civil Service, more than 66,000 of you have identified yourselves as carers. We want to make sure that you feel engaged in your work, have a voice and feel supported. "
        },
        {
            "text": "Many of you will have taken on new caring roles during the pandemic or experienced changes in your existing role. We are extremely proud of how well you’ve coped over the last two years, continuing to give your best both at home and at work. "
        },
        {
            "text": "As we return to the workplace, we want you to continue to feel supported. We appreciate that, for carers, life can be challenging and changes need careful planning. That's why, this year, we will be focusing on ensuring that carers and managers in all parts of the Civil Service have access to the tools and support you need to thrive. "
        },
        {
            "heading": 4,
            "text": "Carers"
        },
        {
            "text": "Anyone can find themselves a carer at any point in their working lives. Recognising this is important so that you can access the support you need when you need it."
        },
        {
            "text": "As circumstances change, please make sure you fill in a carer’s passport. This can help you talk to your manager about the adjustments you need and also provide some continuity if you move jobs."
        },
        {
            "heading": 4,
            "text": "Managers"
        },
        {
            "text": "If you manage someone who is a carer, please listen empathetically to the challenges they face and the workplace adjustments which will help them to cope. Complete a carer’s passport to record what you agree. Supporting carers not only helps them but raises team morale by showing other team members that they too will be helped when they need it. "
        },
        {
            "text": "To enable you to understand the challenges carers face, we have produced a line manager toolkit. Look for it on your departmental intranet."
        },
        {
            "heading": 4,
            "text": "Carers’ Strategy progress      "
        },
        {
            "text": "We have seen great progress in developing our support for our carers."
        },
        {
            "text": "We’ve introduced the Carers’ Charter, the Civil Service carer’s passport, the line manager toolkit, new guidance on the use of special leave and a video to help managers and carers."
        },
        {
            "text": "Fifteen departments have now achieved Carer Confident accreditation which recognises the carer support they provide. Special congratulations go to the Department for Work and Pensions which was the first department to achieve the highest level of accreditation, and the Government Legal Department which recently gained accreditation in time for Carers’ Week."
        },
        {
            "text": "We are also pleased our young carers are getting together to support each other and share experiences. If you’re a young carer and would like to join them, please email COCarers@cabinetoffice.gov.uk."
        },
        {
            "heading": 4,
            "text": "Next steps      "
        },
        {
            "text": "Today, we are launching our annual update on the strategy, Championing the Carer Agenda. This sets out the work we’ve been doing over the last 12 months and our plans going forward."
        },
        {
            "text": "We have spent the last two years producing a range of products to support carers and their managers. Now, it’s time to ensure everyone in the Civil Service knows about them and that they are easily accessible. Whether you work in the largest department or the smallest agency, we want to ensure all carers and managers can access the same level of support."
        },
        {
            "heading": 4,
            "text": "Carers’ Week"
        },
        {
            "text": "Please look out for the Carers’ Week activities taking place in your department. Thank you to all the carer networks and HR teams for putting these on and for their work in supporting carers throughout the year. "
        }
    ]
}