{
    "url": "https://deframedia.blog.gov.uk/2022/06/06/minister-prentis-provides-update-on-investigation-into-crab-and-lobster-deaths/",
    "title": "Minister Prentis provides update on investigation into crab and lobster deaths",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries",
        "marine"
    ],
    "pub_date": "2022-06-06T16:16:33+01:00",
    "content": [
        {
            "text": "On Thursday 2 June, Fisheries Minister Victoria Prentis provided an update regarding the investigation into huge numbers of crabs and lobsters washed up along the coast of the North East last year."
        },
        {
            "text": "Writing in the Hartlepool Mail, Minister Prentis explained Defra led a thorough multi-agency investigation to get to the bottom of what happened, drawing on the expertise of the Environment Agency, Centre for Environment, Fisheries and Aquaculture Science (Cefas), North East Inshore Fisheries and Conservation Authority (NEIFCA), Marine Management Organisation (MMO), Food Standards Agency (FSA) and the UK Health Security Agency (UKHSA)."
        },
        {
            "text": "Extensive and rigorous tests were carried out to investigate various potential causes, including dredging activity, chemical contamination, activities related to offshore windfarms, the presence of algal blooms and aquatic animal disease. A naturally occurring harmful algal bloom was found to be the most likely cause of the incident, with satellite imagery and consistent detection of algal toxins in shellfish supporting this theory."
        },
        {
            "text": "The Environment Agency tested samples from along the coast and Tees estuary, including using new techniques to look for a wide range of chemicals within the tissue of the affected crabs. None of the results from these tests showed levels of any contaminants that could have caused an event of this spatial scale or duration."
        },
        {
            "text": "In particular, Minister Prentis stressed that while elevated indicative levels of pyridine were detected in crab tissue samples, this could not be linked to any significant source of pyridine in the local environment. Pyridine was also detected in otherwise healthy crabs outside the area. For pyridine or any contaminant to have caused this incident, it would need to have been present in huge quantities to counteract the powerful dilution effect of the sea - and this was not the case."
        },
        {
            "text": "Samples of dredge material must meet the highest international standards protecting marine life before it can be disposed of at sea. A review of dredging activity as part of the investigation found no evidence of a link between the disposal of dredged sediment and the deaths. The sampling of sediment that was licensed by the MMO for disposal at designated sites off the Tees confirmed no chemical determinants exceeded concentrations that would be harmful to marine life, and dredging was therefore ruled out as a likely cause."
        },
        {
            "text": "While this investigation has now concluded, Minister Prentis wrote she is listening to concerns about recent small-scale wash-ups along the North East coast and reassured fishermen and residents that Defra are working closely with our partner agencies to assess and monitor the situation."
        },
        {
            "text": "Samples of the crabs and lobsters from these wash-ups are currently being examined by scientists at Cefas, and Defra will share the outcome of this testing once it becomes available. All reports of dead or dying marine life in the area are monitored through the North Eastern Inshore Fisheries and Conservation Authority (NEIFCA)."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}