{
    "url": "https://cddo.blog.gov.uk/2025/04/29/building-a-digital-future-gds-and-stemettes-partner-to-inspire-girls-in-science-and-technology/",
    "title": "Building a Digital Future: GDS and Stemettes Partner to Inspire Girls in Science and Technology",
    "authors": [
        "Dr Anne Marie Imafidon, CEO of Stemettes",
        "Ajoa Akuamoah, Programme Delivery Lead, GDS",
        "Sarah Crandall, Engagement Lead, GDS"
    ],
    "categories": [
        "DDaT community",
        "DDaT events",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-04-29T12:54:52+01:00",
    "content": [
        {
            "text": "The Blueprint for modern digital government highlights the importance of creating public services that work for all citizens. As the next generation of both service users and potential digital and data leaders, these students offered invaluable perspectives. "
        },
        {
            "text": "Opening doors for women and girls in digital"
        },
        {
            "text": "Women remain underrepresented in digital and technology roles across both public and private sectors. This representation gap begins early, with assumptions about who \"belongs\" in STEM fields often forming during school years. "
        },
        {
            "text": "Minister Clark, Parliamentary Under-Secretary of State for AI and Digital Government, who studied Bioinformatics at the University of Exeter has committed to tackling this issue within the Department for Science, Innovation and Technology (DSIT). "
        },
        {
            "text": "To address this challenge, Government Digital Service (GDS), the digital centre for government within DSIT, is taking proactive steps to ensure women and girls know there is a space for them in government digital roles. "
        },
        {
            "text": "One significant initiative is our partnership with Stemettes, an award-winning social enterprise working to inspire and support young women into science, technology, engineering and mathematics careers."
        },
        {
            "heading": 3,
            "text": "International Day of Women and Girls in Science"
        },
        {
            "text": "On 11 February, GDS and Stemettes co-hosted an engagement day celebrating the International Day of Women and Girls in Science with 20 students from Greig City Academy in London."
        },
        {
            "text": "Dr. Anne-Marie Imafidon MBE, CEO and co-founder of Stemettes, shared the day reflected: "
        },
        {
            "text": "Emily Middleton, Director General of Digital Centre Design in GDS, shared with students the value and importance of young perspectives in shaping the future of digital government. She emphasised how their creativity and fresh thinking could help transform how people interact with public services."
        },
        {
            "text": "Claire Wraith, Head of Workforce Strategy and Transformation, led an interactive session on the various roles and opportunities across government digital and data functions. "
        },
        {
            "text": "In a memorable demonstration, students discovered how Squishmallow stickers, dinosaur figures and onions could represent different aspects of the Government Digital and Data Capability Framework – making complex career paths tangible and accessible to them. "
        },
        {
            "text": "One student thanked the organisers at the end for having such an interactive session, even though she was the one who ended up with an onion. "
        },
        {
            "text": "Dr Imafidon reflected that:"
        },
        {
            "heading": 3,
            "text": "Shaping the future of government services"
        },
        {
            "text": "Sarah Crandall, Engagement Lead for GDS, organised small group planning sessions focused on potential improvements to the new GOV.UK Chat tool. "
        },
        {
            "text": "Students broke into discussion groups, each supported by a GDS mentor, to brainstorm ideas and collaborate on themes for development, including: “booking appointments”, “asking questions about real life things”, “learning real life things simplified (like taxes)”, “next steps in education”, and “reading age (making language in the service accessible for all reading ages)”. "
        },
        {
            "text": "The student-led prioritisation revealed their most pressing concerns, with Dr Imafidon concluding: "
        },
        {
            "heading": 3,
            "text": "Looking forward"
        },
        {
            "text": "This collaboration between GDS and Stemettes represents just the beginning of our commitment to fostering a diverse digital workforce. By engaging young women early and demonstrating the real-world impact of government digital roles, we're working to ensure that the future of public services reflects the diversity of the public they serve."
        },
        {
            "text": "Would you like to learn more about career opportunities in government digital and data roles? Visit https://ddat-capability-framework.service.gov.uk/ to explore the Government Digital and Data Capability Framework and discover how your skills could help build a more inclusive digital future."
        }
    ]
}