{
    "url": "https://insidehmcts.blog.gov.uk/2025/04/29/building-tomorrows-legal-talent/",
    "title": "Building tomorrow's legal talent",
    "authors": [
        "Rachel Newman, Senior Legal Manager"
    ],
    "categories": [
        "General",
        "Training and support",
        "User experience and research"
    ],
    "pub_date": "2025-04-29T11:45:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "The journey from law student to legal professional is an important transition that requires practical experience alongside academic learning. We’re working with the University of Reading to help bridge this gap, providing students with invaluable hands-on experience in the courtroom. "
        },
        {
            "text": "Earlier this year, we hosted a speed mooting (a mock proceeding where advocates practice presenting legal arguments) competition for 12 law students. Each had 5 minutes to present their legal argument to a panel including the District Judge (Magistrates’ Courts) Sam Goozee, the High Sheriff of Berkshire and myself. This builds on our previous outreach work, which we explored in our recent Inside HMCTS podcast episode.  "
        },
        {
            "heading": 2,
            "text": "Bringing the courtroom experience to life "
        },
        {
            "text": "The outreach programme between HMCTS and University of Reading began when Judge Goozee and I met with lecturers there as we wanted to provide support to the law students to encourage them to take part in advocacy. I’ve worked in the courts service for 36 years now, having entered following a law degree and subsequently qualifying as a solicitor and barrister. I was really keen to promote these opportunities because I didn't get the opportunity to do advocacy work and see the courts live in action when I did my law degree all those years ago. "
        },
        {
            "text": "The competition, now in its second year, has evolved from its university-based beginnings to being hosted in the Magistrates' Court. As Judge Goozee notes, \"This year we've actually brought it to the Magistrates' Court and it's become more of a competition where we're going to be offering certificates and a trophy to the winning student.\" "
        },
        {
            "text": "Amanda Millmore, Professor of Law at the University of Reading, highlights the practical value for students: \"It can be very dry reading law books and looking at cases and not really appreciating how this plays out in the big wide world. So having the opportunity to come to the court, gives them that perspective that they wouldn't otherwise have.\"  "
        },
        {
            "text": "One student described the experience: \"It was a fantastic opportunity to stand in a real courtroom in front of a real judge and in a very realistic situation. It's definitely solidified my desires to join the criminal bar.”  "
        },
        {
            "text": "Another highlighted the adrenaline rush and learning value: \"My favourite part today was definitely the feedback that we got from the judge. He gave so much insight into his own experience and perspective. It was a very big learning experience for me understanding how advocacy works and how barristers think.” "
        },
        {
            "text": "Professor Millmore points out the career benefits to the students: \"To be able to say that they've had a certificate from the Magistrates' Court helps the students stand out when they're applying for jobs. It's really good for them to build their employability skills and CVs.\" "
        },
        {
            "heading": 2,
            "text": "Creating career pathways  "
        },
        {
            "text": "Events like these are part of our wider outreach showcasing career pathways within HMCTS, from our trainee legal adviser programme to operational positions with progression to senior management.  "
        },
        {
            "text": "I love being able to go out to the students and tell them about the role that we do and the opportunities available within HMCTS. It's a job that I still love doing three decades down the road. "
        },
        {
            "text": "Ros Birch, Acting Head of Legal Operations in the South East, explains how this work supports HMCTS’ objectives: \"We found that a lot of schools, universities, colleges don't have a lot of information about the court service. People can join either as qualified solicitors or barristers and as legal advisors in training. We also do an apprenticeship, so for those who join us who haven't fully qualified, they can qualify in service. With the outreach work, our applications have really increased.”  "
        },
        {
            "text": "Beyond career opportunities, the outreach programme develops essential skills for students, whatever their eventual career. \"If they can do speed mooting, then they'll be able to do other types of public speaking, and it gives them a chance to see what's out there\", says Ros. "
        },
        {
            "heading": 2,
            "text": "Looking to the future  "
        },
        {
            "text": "The success of this initiative has sparked interest in expansion, and Ros wants to replicate the work: \"There are other areas that already do some similar outreach activities, but it would be great if we could do them to the extent they've done in Reading.\"  "
        },
        {
            "text": "For Judge Goozee, the programme helps judges engage with the community: \"As a judge, it's important that we involve ourselves in outreach work so that students understand and the public understand what our job is. It's a really valuable opportunity to engage with these young students.\"   "
        },
        {
            "text": "This collaboration demonstrates our commitment to developing the next generation of legal professionals. By providing practical experience, career guidance, and networking opportunities, we're helping to build a stronger, more diverse legal sector. "
        },
        {
            "text": "If you’re a university lecturer or law student interested in future work shadowing opportunities, please contact Legalrecruitment@justice.gov.uk. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Meithrin talent gyfreithiol y dyfodol "
        },
        {
            "text": "Mae'r daith o fyfyriwr y gyfraith i weithiwr proffesiynol cyfreithiol yn gam pwysig sy'n gofyn am brofiad ymarferol ochr yn ochr â dysgu academaidd. Rydym yn gweithio gyda Phrifysgol Reading i helpu i bontio'r bwlch hwn, gan roi profiad ymarferol amhrisiadwy i fyfyrwyr yn yr ystafell llys. "
        },
        {
            "text": "Y mis diwethaf, gwnaethom gynnal cystadleuaeth ffug lys barn cyflym (achos ffug lle mae eiriolwyr yn ymarfer cyflwyno dadleuon cyfreithiol) ar gyfer 12 o fyfyrwyr y gyfraith. Roedd gan bob un 5 munud i gyflwyno eu dadl gyfreithiol i banel gan gynnwys y Barnwr Rhanbarth (Llysoedd Ynadon) Sam Goozée, Uchel Siryf Berkshire a minnau. Mae hyn yn adeiladu ar ein gwaith allgymorth blaenorol, a archwiliom yn ein podlediad Inside HMCTS diweddar.  "
        },
        {
            "heading": 2,
            "text": "Dod â phrofiad yr ystafell llys yn fyw "
        },
        {
            "text": "Dechreuodd y rhaglen allgymorth rhwng GLlTEF a Phrifysgol Reading pan gyfarfu'r Barnwr Goozee a minnau â darlithwyr yno gan ein bod am ddarparu cefnogaeth i fyfyrwyr y gyfraith i'w hannog i gymryd rhan mewn eiriolaeth. Rwyf wedi gweithio yn y gwasanaeth llysoedd ers 36 mlynedd bellach, ar ôl dilyn gradd yn y gyfraith ac yna cymhwyso fel cyfreithiwr a bargyfreithiwr. Roeddwn i'n awyddus iawn i hyrwyddo'r cyfleoedd hyn oherwydd ni chefais y cyfle i wneud gwaith eirioli a gweld y llysoedd ar waith pan wnes i fy ngradd yn y gyfraith yr holl flynyddoedd hynny yn ôl. "
        },
        {
            "text": "Mae'r gystadleuaeth, sydd bellach yn ei hail flwyddyn, wedi esblygu o'i dechreuadau yn y brifysgol i gael ei chynnal yn y Llys Ynadon. Fel y dywed y Barnwr Goozee, \"Eleni rydym wedi dod ag ef i'r Llys Ynadon ac mae wedi dod yn fwy o gystadleuaeth lle rydyn ni'n mynd i fod yn cynnig tystysgrifau a thlws i'r myfyriwr buddugol.\" "
        },
        {
            "text": "Mae Amanda Millmore, Athro yn y Gyfraith ym Mhrifysgol Reading, yn tynnu sylw at ei werth ymarferol i fyfyrwyr: \"Gall fod yn ddiflas iawn darllen llyfrau cyfreithiol ac edrych ar achosion a ddim wir yn gwerthfawrogi sut mae hyn yn digwydd yn y byd go iawn. Felly mae cael y cyfle i ddod i'r llys, yn rhoi'r persbectif yna iddyn nhw na fydden nhw fel arall yn ei gael.\"  "
        },
        {
            "text": "Disgrifiodd un myfyriwr y profiad: \"Roedd yn gyfle gwych i sefyll mewn llys go iawn o flaen barnwr go iawn ac mewn sefyllfa realistig. Mae'n bendant wedi cadarnhau fy nyheadau i ymuno â'r bar troseddol. \"  "
        },
        {
            "text": "Amlygodd un arall yr adrenalin a'r gwerth dysgu: \"Fy hoff ran heddiw yn bendant oedd yr adborth a gawsom gan y barnwr. Rhoddodd gymaint o fewnwelediad i'w brofiad a'i safbwynt ei hun. Roedd yn brofiad dysgu mawr iawn i mi ddeall sut mae eiriolaeth yn gweithio a sut mae bargyfreithwyr yn meddwl.\" "
        },
        {
            "text": "Mae'r Athro Millmore yn tynnu sylw at fanteision gyrfa y myfyrwyr: \"Mae gallu dweud eu bod wedi cael tystysgrif gan Lys yr Ynadon yn helpu'r myfyrwyr i sefyll allan pan fyddan nhw'n ymgeisio am swyddi. Mae'n beth da iawn iddynt feithrin eu sgiliau cyflogadwyedd a'u CVs.\" "
        },
        {
            "heading": 2,
            "text": "Creu llwybrau gyrfa  "
        },
        {
            "text": "Mae digwyddiadau fel y rhain yn rhan o'n rhaglen allgymorth ehangach sy'n arddangos llwybrau gyrfa o fewn GLlTEF, o'n rhaglen cynghorwyr cyfreithiol dan hyfforddiant i swyddi gweithredol gyda’r gallu i ddod yn uwch reolwyr.  "
        },
        {
            "text": "Rwyf wrth fy modd yn gallu mynd at y myfyrwyr a dweud wrthynt am y rôl a wnawn a'r cyfleoedd sydd ar gael o fewn GLlTEF. Mae'n swydd rwyf dal wrth fy modd yn ei gwneud 3 degawd i lawr y ffordd. "
        },
        {
            "text": "Mae Ros Birch, Pennaeth Gweithrediadau Cyfreithiol Dros Dro yn Ne-ddwyrain Lloegr, yn esbonio sut mae'r gwaith hwn yn cefnogi amcanion GLlTEF: \"Deuthum i ddeall nad oes gan lawer o ysgolion, prifysgolion a cholegau lawer o wybodaeth am y gwasanaeth llysoedd. Gall pobl ymuno naill ai fel cyfreithwyr neu fargyfreithwyr cymwys ac fel cynghorwyr cyfreithiol dan hyfforddiant. Rydym hefyd yn cynnig prentisiaethau, felly i'r rhai sy'n ymuno â ni nad ydynt wedi cymhwyso'n llawn, gallant gymhwyso tra’n gweithio yn y gwasanaeth. Gyda'r gwaith allgymorth, mae ein ceisiadau wedi cynyddu'n fawr.\"  "
        },
        {
            "text": "Y tu hwnt i gyfleoedd gyrfa, mae'r rhaglen allgymorth yn datblygu sgiliau hanfodol i fyfyrwyr, beth bynnag fo'u gyrfa yn y pen draw. \"Os ydyn nhw'n gallu cymryd rhan mewn ffug lys barn cyflym, yna byddan nhw'n gallu gwneud mathau eraill o siarad cyhoeddus, ac mae'n rhoi cyfle iddyn nhw weld be' sydd allan yna\", meddai Ros. "
        },
        {
            "heading": 2,
            "text": "Edrych i'r dyfodol  "
        },
        {
            "text": "Mae llwyddiant y fenter hon wedi sbarduno diddordeb mewn ehangu, ac mae Ros eisiau ailadrodd y gwaith: \"Mae yna feysydd eraill sydd eisoes yn gwneud rhai gweithgareddau allgymorth tebyg, ond byddai'n wych pe gallem eu gwneud i'r graddau maen nhw wedi'i wneud yn Reading.\"  "
        },
        {
            "text": "Dywedodd y Barnwr Goozee bod y rhaglen yn helpu barnwyr i ymgysylltu â'r gymuned: \"Fel barnwr, mae'n bwysig ein bod yn cynnwys ein hunain mewn gwaith allgymorth fel bod y myfyrwyr a’r cyhoedd yn deall beth yw ein gwaith ni. Mae'n gyfle gwirioneddol werthfawr i ymgysylltu â'r myfyrwyr ifanc hyn.\"   "
        },
        {
            "text": "Mae'r cydweithrediad hwn yn dangos ein hymrwymiad i ddatblygu'r genhedlaeth nesaf o weithwyr proffesiynol cyfreithiol. Trwy ddarparu profiad ymarferol, arweiniad gyrfaol a chyfleoedd rhwydweithio, rydym yn helpu i adeiladu sector cyfreithiol cryfach, mwy amrywiol. "
        },
        {
            "text": "Os ydych chi'n ddarlithydd mewn prifysgol neu'n fyfyriwr y gyfraith sydd â diddordeb mewn cyfleoedd cysgodi gwaith yn y dyfodol, cysylltwch â Legalrecruitment@justice.gov.uk. "
        }
    ]
}