{
    "url": "https://mhclgmedia.blog.gov.uk/2025/04/29/coverage-of-council-tax-premiums/",
    "title": "Coverage of Council Tax Premiums",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing",
        "Council finance",
        "Local government"
    ],
    "pub_date": "2025-04-29T10:53:30+01:00",
    "content": [
        {
            "text": "There has been prominent coverage in the past few weeks of council tax premiums on long-term empty homes and second homes, including in The Daily Telegraph which is campaigning against the measure."
        },
        {
            "text": "The government is determined to fix the housing crisis it inherited. We recognise local leaders are best placed to understand the impacts empty properties and second homes can have on their areas."
        },
        {
            "text": "Excessive concentrations of second homes in some areas of the country can impact the availability and affordability of homes to buy and rent. This can translate into problems for families, public services, and the local economy. We do not think it is right for houses to lie empty while families struggle to find a home."
        },
        {
            "text": "That is why local councils are now able to add up to 100% extra on the council tax bills of empty or second homes, and it is for those councils to decide whether to implement this and at what level."
        },
        {
            "text": "However, we recognise there are instances where it would not be appropriate for the premium to apply and have introduced exceptions in limited circumstances. This includes 12-month exceptions for dwellings actively marketed for sale or let or those undergoing major repairs."
        },
        {
            "text": "We have published guidance on the application and administration of the council tax premiums and the exceptions which can be found here: Guidance on the implementation of the council tax premiums on long-term empty homes and second homes - GOV.UK"
        },
        {
            "text": "With housing in high demand, it is also important that councils ensure properties they own are inhabited. We expect councils to make use of their available social housing."
        },
        {
            "text": "We’re taking urgent action to fix the broken housing system we inherited through our Plan for Change, delivering 1.5m homes and injecting £2 billion to help deliver the biggest boost in social and affordable housebuilding in a generation."
        }
    ]
}