{
    "url": "https://mhclgdigital.blog.gov.uk/2025/04/29/funding-service-behind-the-scenes-as-a-grant-relationship-manager/",
    "title": "Funding Service: behind the scenes as a grant relationship manager ",
    "authors": [
        "Craig Bevington, Grant Relationship Manager"
    ],
    "categories": [
        "Funding Service"
    ],
    "pub_date": "2025-04-29T09:46:09+01:00",
    "content": [
        {
            "text": "Just 2 years ago, the MHCLG Funding Service was celebrating onboarding our second grant ever. Fast forward to today and the service has recently launched 5 grants in a single week! This comes on the back of a stream of grants over the last year, often managed concurrently, all while making grant delivery more cost-effective, consistent and user-focused.  "
        },
        {
            "text": "Our recent work spans from relatively simple performance monitoring for First Homes Local Authority Resourcing to the recently announced Combatting Hate Against Muslims Fund, for which we provided support with the prospectus and delivered a digital application and assessment solution. We’ve also successfully migrated the UK Shared Prosperity Fund data collection from Microsoft Power Apps to the Delta platform. This proved a complex task but resulted in significant cost savings. "
        },
        {
            "text": "Taking stock ahead of the conclusion of Spending Review Phase 2, the Funding Service team is taking time to reflect on the achievements to date and valuable lessons learned for the future. This will help us to iterate and improve the service, adapting to meet the needs of government teams and supporting the design of future funding. "
        },
        {
            "text": "In this blog post, grant relationship manager Craig Bevington talks about how the service has evolved and what lies ahead. "
        },
        {
            "heading": 2,
            "text": "The role of a grant relationship manager "
        },
        {
            "text": "I am one of 4 grant relationship managers in the team. My role is a combination of stakeholder engagement and delivery management. In simpler terms, I’m the link between grant teams and the rest of Funding Service, ensuring that the right people are doing the right things at the right time to support teams to design and deliver their grant effectively. I offer advice, demonstrate the benefits of our service, help them comply with standards, and act as a consistent point of contact during the delivery of their grant. "
        },
        {
            "heading": 3,
            "text": "Early engagement is key "
        },
        {
            "text": "A key part of what we do is reviewing business cases. As one of the department’s subject matter experts, the service provides assurance for business cases relating to grants, offering support with digital solutions and expert advice. Early engagement is key to give us sight of what’s upcoming and help us to give the best guidance and support to ensure efficient, effective and consistent delivery. We really want grant teams to see the benefit we can bring if we are involved right from the early drafting stages. "
        },
        {
            "heading": 2,
            "text": "How the Funding Service supports those working with grants "
        },
        {
            "text": "In December 2024, we published a case study outlining how the service enables the department to deliver funding quickly, more efficiently and at lower cost. In practice, this means helping teams with a range of activities which they may not be too familiar with but where we have expertise, such as prospectus design and publishing, and collecting monitoring data. The Funding Service brings specific digital and design skills, creating a valuable partnership with grant teams.  "
        },
        {
            "heading": 3,
            "text": "Making things more efficient and consistent "
        },
        {
            "text": "Throughout all stages of grant design and delivery, we focus on adding benefit for both grant teams and recipients. We prioritise reusing existing tools and processes where appropriate. Our content designers use standardised questions and wording wherever possible and follow content design best practice. By using digital solutions, we ensure that diverse and complex grant requirements can be delivered consistently and cost-effectively, while reducing the administrative burden on recipients. This also gives both our internal and external users the familiarity and seamless user journey they need when using government services. "
        },
        {
            "heading": 3,
            "text": "Improving the user experience  "
        },
        {
            "text": "Our users are at the heart of what we do, and we strive to make our service quicker and easier to use. This means carrying out regular user research and testing to understand the needs of the policy teams and grant recipients, such as local authorities or community organisations. We gather both qualitative and quantitative feedback to measure success and identify areas for improvement to help shape the service. As well as seeing significant efficiencies with proven results and projected savings, we’ve received some really positive feedback from both grant teams and grant recipients who have commented on not only how the user experience is improved, but also how they have benefitted from the service’s approach. "
        },
        {
            "heading": 2,
            "text": "Overcoming challenges  "
        },
        {
            "text": "The team has been through quite a bit of change over the last year, and the prospect of onboarding so many grants concurrently before the end of the financial year was daunting. It was a big challenge, and I feel proud of how the team navigated this to ensure delivery. It forced us to learn quickly and we’re now implementing more robust processes for when the next wave of demand comes.  "
        },
        {
            "text": "We get a variety of different pieces of work coming from teams which are at different stages in the grants lifecycle. They may only require one or two of our services or may need the whole set. Irrespective of the size or complexity of the piece of work, timing is key and can sometimes be quite challenging. We try to mitigate this by allowing flexibility in our plans for the inevitable last-minute requests – being adaptable is a key part of being a civil servant!  "
        },
        {
            "text": "The government’s ambition to simplify funding and consolidate grants, as well as MHCLG’s work with teams both internally and across other departments, has and will continue to be really helpful in reducing the number of late notice requests and helping us (as well as importantly grant recipients) to anticipate what’s coming down the line.  "
        },
        {
            "heading": 2,
            "text": "What’s next for the Funding Service "
        },
        {
            "text": "We know that some of our digital solutions could integrate better to deliver a more seamless service, and work is currently ongoing to address that. Our long-term strategy is to build a full end-to-end service, using technology that can grow with us and meet future demands. "
        },
        {
            "text": "As awareness (and the ambition) of our service grows, we aim to become the trusted partner and critical friend of all grant teams across MHCLG and those across other government departments – the ‘go to service’ for grant design and delivery to local government. "
        },
        {
            "text": "We are focusing on how our service supports funding simplification, making data submission less of a burden for grant recipients, while ensuring that grant standards are maintained, and government has more readily extractable and comparable data as required to support effective decision-making, achieve successful outcomes and demonstrate impact.  "
        },
        {
            "heading": 3,
            "text": "Find out more and get in touch"
        }
    ]
}