{
    "url": "https://movingon.blog.gov.uk/2025/04/29/introducing-the-maintenance-provision-rating-scheme-mprs/",
    "title": "Introducing the Maintenance Provision Rating Scheme (MPRS)  ",
    "authors": [
        "Neil Barlow"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2025-04-29T09:59:04+01:00",
    "content": [
        {
            "text": "Finding a reliable workshop where you have confidence in what you’re buying, just got easier with the launch of the industry’s Maintenance Provision Rating Scheme (MPRS). "
        },
        {
            "text": "After successful trials in 2024, the scheme is now live. It’s here to help raise the bar for commercial vehicle maintenance, by rating workshops on staff skills and facilities. This way, operators can easily find skilled maintenance providers to keep their vehicles safe to drive – and hopefully make more informed choices on finding a provider that suits their needs.  "
        },
        {
            "heading": 2,
            "text": "How it came about "
        },
        {
            "text": "The Institute of Road Transport Engineers (IRTE) are managing the scheme with support from us and the wider industry - this is a scheme for the industry, designed by the industry, to meet a need across the industry!  "
        },
        {
            "text": "We’re fully behind the initiative as it aligns with our mission to improve industry standards and reduce the number of unsafe vehicles on the road. By supporting the scheme, we hope to enhance road safety and promote best practice. "
        },
        {
            "heading": 2,
            "text": "How it will work  "
        },
        {
            "text": "MPRS will rate workshops based on staff skills, processes and the quality of their facilities. The ratings range from ‘qualified’ for workshops with basic tools and staff skills, to ‘platinum’ for those with advanced facilities, top-tier staff and readiness for future vehicle trends.  "
        },
        {
            "text": "This system isn’t an accreditation or regulation - it’s about setting standards and expectations for the people and the facility. Whether it’s a small independent workshop or a much larger dealership, workshops will be assessed and rated to help operators make an informed decision.  "
        },
        {
            "heading": 2,
            "text": "The benefits  "
        },
        {
            "text": "We know that a lot of operators rely on external maintenance providers for all, or some, of their maintenance and vehicle inspections. Whilst there are accreditation schemes within the sector, there are some parts of the country where there aren’t many of those to choose from. Hopefully MPRS will become popular across the sector – giving operators much richer information.  "
        },
        {
            "heading": 2,
            "text": "Operators  "
        },
        {
            "text": "MPRS is a valuable tool to help you pick the right provider for you. Choosing a workshop with an MPRS rating means your vehicles are more likely to be properly maintained and less likely to get prohibitions.  "
        },
        {
            "text": "When outsourcing any maintenance work, it’s your responsibility to make sure the facility is adequately equipped and that work is completed to a satisfactory standard. This scheme helps by giving you confidence in the quality of work being carried out on your vehicles.  "
        },
        {
            "text": "While picking the right maintenance provider is important, it’s just one piece of the puzzle. As set out in the Guide to maintaining roadworthiness: commercial goods and passenger carrying vehicles - GOV.UK, to keep vehicles safe, you need an effective overall system to plan maintenance, handle in-service defects, train drivers and other employees, load vehicles properly and related areas.   "
        },
        {
            "text": "If you are outsourcing some or all of your maintenance and inspection, MPRS can guide you in making an informed choice, and understand a provider’s capabilities. This means you can find one that suits your needs – needs that will vary from operator to operator – for example, the types and usage of vehicles used or your in-house capabilities (for having oversight of work being done by your provider)."
        },
        {
            "heading": 2,
            "text": "Maintenance providers "
        },
        {
            "text": "We would encourage maintenance providers, including independent workshops and dealership service centres, to consider signing up to MPRS.  "
        },
        {
            "text": "Joining the scheme means you can: "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "You can find out more about the scheme on the MPRS portal, including details on the ratings, how it will work and how to apply: https://mprs.org.uk/"
        }
    ]
}