{
    "url": "https://publicguardian.blog.gov.uk/2025/04/29/two-million-lasting-powers-of-attorney-added-to-online-use-an-lpa-service/",
    "title": "Two million lasting powers of attorney added to online Use an LPA service",
    "authors": [
        "matthewyeadon"
    ],
    "categories": [
        "lasting power of attorney",
        "LPA",
        "Use an LPA"
    ],
    "pub_date": "2025-04-29T14:47:16+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Once a lasting power of attorney (LPA) has been registered, donors and attorneys can create an account to give organisations access to view the details of that LPA online. This allows banks, healthcare providers and other selected organisations to see the details of the LPA, including information like the donor and attorney information, how decisions are made, and any instructions and preferences."
        },
        {
            "text": "The Use a lasting power of attorney (Use an LPA) service launched in July 2020 and so far, two million LPAs have been added into the service. We have continued to develop the service in response to feedback, enabling more LPAs to be registered and more details to be visible."
        },
        {
            "text": "Andy Tovey, Head of Modernising Lasting Powers of Attorney Business Readiness, said: "
        },
        {
            "heading": 2,
            "text": "How it works "
        },
        {
            "text": "Once an LPA is registered, attorneys and donors are sent an activation key and an LPA reference number. If required, new activation keys can be requested through the Use an LPA service. These are explained in this video, codes and reference numbers for your LPA: "
        },
        {
            "text": "To access the service, donors or attorneys need a GOV.UK One Login account – this is a new way of signing into government services, including Use an LPA. If you don't yet have an account, there is a step-by-step guide on how to set one up on the GOV.UK Use an LPA page."
        },
        {
            "text": "After a donor or attorney has created an account online, LPAs can be added to the account. A donor or attorney can then make a secure access code which they give to organisations to view an online summary of an LPA and keep track of which organisations have had access. "
        },
        {
            "heading": 2,
            "text": "Quicker, easier and more secure than sharing your paper LPA"
        },
        {
            "text": "There are many benefits to using the online service:"
        },
        {
            "text": "Kamlesh Samji, a donor with experience of the Use an LPA service, talks about how it has benefitted him. He said: "
        },
        {
            "heading": 2,
            "text": "Eligible LPAs "
        },
        {
            "text": "Donors and attorneys with LPAs registered on or after 1 January 2016 can use the online service.  "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "You can learn more about use an LPA and view an LPA in our blog series."
        },
        {
            "text": "To get started straight away, visit: "
        },
        {
            "text": " [English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Ychwanegwyd dwy filiwn o atwrneiaethau arhosol at y Gwasanaeth Defnyddio Atwrneiaeth Arhosol ar-lein"
        },
        {
            "text": "Ar ôl cofrestru atwrneiaeth arhosol (LPA), gall rhoddwyr ac atwrneiod greu cyfrif fel bod sefydliadau yn gallu gweld manylion yr atwrneiaeth arhosol honno ar-lein. Mae hyn yn galluogi banciau, darparwyr gofal iechyd a sefydliadau dethol eraill i weld manylion yr atwrneiaeth arhosol, gan gynnwys gwybodaeth am y rhoddwr a’r atwrnai, sut mae penderfyniadau’n cael eu gwneud, ac unrhyw gyfarwyddiadau a dewisiadau. "
        },
        {
            "text": "Lansiwyd y gwasanaeth Defnyddio Atwrneiaeth Arhosol (LPA) ym mis Gorffennaf 2020, a hyd yma mae dwy filiwn o atwrneiaethau arhosol wedi cael eu hychwanegu at y gwasanaeth. Rydym wedi parhau i ddatblygu’r gwasanaeth mewn ymateb i adborth, sy'n golygu bod modd i fwy o atwrneiaethau arhosol gael eu cofrestru a bod mwy o fanylion ar gael."
        },
        {
            "text": "Dywedodd Andy Tovey, Pennaeth Moderneiddio Parodrwydd Busnes Atwrneiaethau Arhosol:   "
        },
        {
            "heading": 2,
            "text": "Sut mae’n gweithio   "
        },
        {
            "text": "Pan fydd atwrneiaeth arhosol yn cael ei chofrestru, bydd atwrneiod a rhoddwyr yn cael allwedd actifadu a rhif cyfeirnod yr atwrneiaeth arhosol. Os oes angen, gellir gwneud cais am allweddi actifadu newydd drwy’r gwasanaeth Defnyddio Atwrneiaeth Arhosol. "
        },
        {
            "text": "I gael mynediad at y gwasanaeth, mae rhoddwyr neu atwrneiod angen cyfrif GOV.UK One Login – dyma ffordd newydd o fewngofnodi i wasanaethau’r llywodraeth, gan gynnwys Defnyddio Atwrneiaeth Arhosol. Os nad oes gennych gyfrif eto, mae canllaw cam wrth gam ar sut i greu un ar dudalen Defnyddio Atwrneiaeth Arhosol GOV.UK."
        },
        {
            "text": "Ar ôl i roddwr neu atwrnai greu cyfrif ar-lein, gellir ychwanegu atwrneiaethau arhosol at y cyfrif. Yna gall rhoddwr neu atwrnai lunio cod mynediad diogel y byddant yn ei roi i sefydliadau i weld crynodeb ar-lein o atwrneiaeth arhosol ac olrhain pa sefydliadau sydd wedi cael mynediad.  "
        },
        {
            "heading": 2,
            "text": "Mae’n gyflymach, yn haws ac yn fwy diogel na rhannu eich atwrneiaeth arhosol ar bapur"
        },
        {
            "text": "Mae llawer o fanteision yn gysylltiedig â defnyddio’r gwasanaeth ar-lein:  "
        },
        {
            "text": "Mae Kamlesh Samji, rhoddwr sydd â phrofiad o’r gwasanaeth Defnyddio Atwrneiaeth Arhosol, yn sôn am sut mae wedi bod o fudd iddo. Dywedodd: "
        },
        {
            "heading": 2,
            "text": "Atwrneiaethau Arhosol Cymwys "
        },
        {
            "text": "Gall rhoddwyr ac atwrneiod gydag atwrneiaethau arhosol sydd wedi’u cofrestru ar 1 Ionawr 2016, neu ar ôl hynny, ddefnyddio’r gwasanaeth ar-lein.   "
        },
        {
            "heading": 2,
            "text": "Rhagor o wybodaeth"
        },
        {
            "text": "Gallwch ddysgu mwy am ddefnyddio atwrneiaeth arhosol a gweld atwrneiaeth arhosol yn ein cyfres o flogiau."
        },
        {
            "text": "I ddechrau arni ar unwaith, ewch i: "
        }
    ]
}