{
    "url": "https://deframedia.blog.gov.uk/2023/03/03/defra-announces-highly-protected-marine-areas-to-be-designated-in-english-waters/",
    "title": "Defra announces Highly Protected Marine Areas to be designated in English waters",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-03T09:57:16+00:00",
    "content": [
        {
            "text": "There has been widespread national, regional and trade coverage of Defra’s announcement this week that marine habitats and wildlife are set to receive the highest levels of protection as the government announces the first three Highly Protected Marine Areas (HPMAs) will be designated this year."
        },
        {
            "text": "From safeguarding ‘blue carbon’ habitats to help tackle climate change; protecting the feeding and nursery grounds of commercially important fish species such as cod and herring; through to reversing the impacts of human activity on degraded marine ecosystems, the first three HPMAs were chosen due to the ecological importance of nature recovery in the sites."
        },
        {
            "text": "The three sites will be designated before 6 July 2023 and are Allonby Bay (Irish Sea), Dolphin Head (Eastern Channel) and North East of Farnes Deep (Northern North Sea)."
        },
        {
            "text": "BBC Radio Cumbria and BBC Look North were amongst those who covered the announcement, with a particular focus on the designation of Allonby Bay in Cumbria and the many positives that the HPMA will bring to the local marine environment."
        },
        {
            "text": "Nationally, outlets including BBC Online, the Guardian, Daily Mail and ITV highlighted how wildlife and ecosystems will benefit from the extra protection but also included comments from conservationists and environmental groups who have expressed disappointment that only three of the five pilot HPMAs will be designated."
        },
        {
            "text": "After listening to the responses of a consultation held last year, and with further consideration of socio-economic impacts, Defra announced two sites – Lindisfarne and Inner Silver Pit South – would not be taken forward to designation. Additional sites will now be explored and any future options will also be subject to consultation."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "“Our comprehensive Environment Improvement Plan sets us on a path to deliver an improved marine environment and halt the decline in biodiversity which benefits us all."
        },
        {
            "text": "“Highly Protected Marine Areas are a vital step forward in enabling our ecosystems to thrive, increasing climate resilience and ensuring we have a healthy and productive marine environment for generations to come.”"
        },
        {
            "text": "Marine Minister Lord Benyon said: "
        },
        {
            "text": "“This is a crucial next step to aid marine ecosystem recovery in our waters and I'm delighted to see my recommendations become a reality today."
        },
        {
            "text": "“Not only will the first of these Highly Protected Marine Areas protect important species and habitats, but they will propel the UK forward in our mission to protect at least 30% of the global ocean by 2030.”"
        },
        {
            "text": "Natural England Chair Tony Juniper said:"
        },
        {
            "text": "“The long term sustainability of our ocean and its ability to provide the essential ecosystem services that will help us meet the challenge of climate change, protect food security and sustain the coastal and marine economy is in part dependent on having the right protections in place."
        },
        {
            "text": "“The designation of the first three Highly Protected Marine Areas moves us towards this goal. I welcome this as a first step towards greater protection of our marine wildlife. I also look forward to working with government to identify additional areas where important marine habitats and species can benefit from the highest levels of protection.”"
        }
    ]
}