{
    "url": "https://rpc.blog.gov.uk/2023/03/03/government-impact-assessments-increasingly-poor-quality-and-too-late/",
    "title": "Government impact assessments increasingly poor quality and too late",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2023-03-03T14:23:09+00:00",
    "content": [
        {
            "text": "The RPC’s latest IVB report confirms that there has been an alarming increase in the number of impact assessments (IAs) that have been red-rated as “not fit for purpose”. Since 2021, we have published red-rated opinions on IAs for eight measures, compared to none between 2016 and 2020."
        },
        {
            "text": "The Impact Assessments we red-rated over the past 12 months (the most recent two since the period covered by the IVB report) were:"
        },
        {
            "text": "In addition, 63% of IAs were rated either ‘weak’ or ‘very weak’ for at least one of the four areas of scrutiny not reflected in red/green ratings (rationale and objectives, cost-benefit analysis, wider impacts, or monitoring and evaluation). A ‘weak’ rating means that: “the analysis is not sufficiently robust to address the issue. Improvements are required in one or a number of areas. It provides inadequate support for decision-making on these aspects of the assessment.”"
        },
        {
            "text": "Impact assessments submitted late for scrutiny"
        },
        {
            "text": "There was also a significant increase in the number of IAs submitted late to the RPC – in some cases when the legislation was already before Parliament. This undermines the purpose of the Better Regulation Framework in allowing us to inform Parliamentarians of the robustness of the evidence supporting regulatory proposals."
        },
        {
            "text": "In agreement with the House of Lords Secondary Legislation Scrutiny Committee report Losing Impact: Why the Government’s impact assessment system is failing Parliament and the public, we now make a clear statement when legislation reaches Parliament if the IA has not been published – as we have recently done for the Strikes (Minimum Service Levels) Bill, which was submitted late by BEIS."
        },
        {
            "text": "---"
        },
        {
            "text": "[1] This was an EANDCB assessment rather than a full IA."
        }
    ]
}