{
    "url": "https://educationhub.blog.gov.uk/2023/03/03/how-boosting-support-language-lessons-schools/",
    "title": "How we are boosting our support for language lessons in schools",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Funding",
        "Languages"
    ],
    "pub_date": "2023-03-03T11:58:21+00:00",
    "content": [
        {
            "text": "Learning modern foreign languages like French, German and Spanish is not only useful for when visiting abroad but can also boost your job prospects, as language skills are often highly valued by employers."
        },
        {
            "text": "That’s why thousands of pupils will benefit from a new languages programme, designed to boost the quality of language lessons in primary and secondary schools."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "Why is learning languages at school so important?"
        },
        {
            "text": "Languages are a key part of a broad and balanced curriculum, and evidence suggests learning a language has strong economic benefits too, including improving international trade."
        },
        {
            "text": "The British Council also identified that Spanish, Mandarin, French, Arabic, and German are the top five priority languages to improve the UK’s skills, security and influence in the world."
        },
        {
            "heading": 3,
            "text": "How are you making learning languages more accessible? "
        },
        {
            "text": "University College London’s (UCL) Institute of Education (IOE) will be running its Language Hubs programme in primary and secondary schools over the next three years, as part of a  contract worth up to £14.9 million  ."
        },
        {
            "text": "The programme aims to increase the number of pupils taking languages at GCSE level and beyond, by engaging young people in the subjects at an earlier age."
        },
        {
            "text": "The Language Hubs programme will be rolled out in line with the teaching methods set out in The Teaching Schools Council’s 2016 Modern Foreign Languages Pedagogy Review and will deliver on the Department’s Schools White Paper pledge to create a network of Language Hubs."
        },
        {
            "heading": 3,
            "text": "How will the programme work? "
        },
        {
            "text": "UCL IOE will recruit up to 25 lead schools who specialise in languages to support up to 105 partner schools in its first year. This will rise to 25 lead schools supporting 175 partner schools in 2024."
        },
        {
            "text": "The lead schools will work with partner secondary schools and aim to improve the move of language learning from Key Stage 2 to Key Stage 3, as well as encouraging pupils aged 14-18 from all backgrounds to study languages through to Key Stage 5."
        },
        {
            "text": "Schools will be supported in teaching a range of different languages, but there will also be a focus on the German Promotion Programme, as part of the new contract."
        },
        {
            "text": "UCL IOE will partner with Goethe-Institut, a German cultural centre, to carry out a phased plan to promote German language learning and culture, as well as working with trained German specialist teachers."
        },
        {
            "text": "It’s hoped that this will encourage more students to learn German in both primary and secondary schools."
        },
        {
            "heading": 3,
            "text": "Are you doing similar things for other subjects on the curriculum too?"
        },
        {
            "text": "Yes. We have already successfully launched Hubs Programmes for other subjects in the curriculum including English and mathematics, linking schools across the country to subject specialist schools – also known as Lead Hubs – to support them to increase the quality of teaching."
        }
    ]
}