{
    "url": "https://ipa.blog.gov.uk/2023/03/03/international-womens-day-no-one-can-make-me-feel-small-without-my-permission/",
    "title": "International Women’s Day: “No one can make me feel small without my permission”",
    "authors": [
        "Lolade Onabolu"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Project Delivery"
    ],
    "pub_date": "2023-03-03T14:49:21+00:00",
    "content": [
        {
            "text": "As part of International Women’s Day, Lolade Onabolu, Senior Programme Director at the Home Office gives her views on the importance of representation in leadership roles and on encouraging underrepresented practitioners at all levels to reach for more senior roles within project delivery. "
        },
        {
            "text": "My story"
        },
        {
            "text": "I grew up in Lagos, Nigeria. As a young girl of around 7/8 years old, I read a story at school about a man who drove so fast into a village that people did not see the car and only saw the dust it generated in its wake. I remember dreaming and promising myself that I would design a mechanical contraption that would go even faster. I have always loved problem-solving and the process of designing and implementing something new which sparked an interest and love for mechanical engineering which I went on to study before moving into management consulting and project delivery (which require many of the same skills)."
        },
        {
            "text": "Over my career, I have been fortunate to have led several major and complex transformation programmes across all sectors including at the Ministry of Justice, the Department for Health and Social Care, and NHS England. I joined my current role at the Home Office in 2020 (at the height of lockdown) as a director, leading the programme to transform our Borders to be data-driven, digital and person-centric. As someone who believes in “management by walking about”, it was a challenge establishing myself and the programme virtually. Looking back, it is a testament to the resilience of everyone in the team that we got the programme established and delivered during that time."
        },
        {
            "text": "Overcoming Imposter Syndrome – Reflections on being a woman from an ethnic minority background in leadership"
        },
        {
            "text": "I would normally consider myself a very confident, outspoken woman, but on joining the Civil Service, I was one of only a handful of women from an ethnic minority background at senior levels, and I found myself feeling rather self-conscious. I think this is where we have to consciously remind ourselves of our capabilities and refuse to let anyone or any circumstances (real or perceived) make us feel small. I remind myself that “no one can make me feel small without my permission” and on that basis, I stir myself up and trust my judgement."
        },
        {
            "text": "Inclusion and access"
        },
        {
            "text": "I think it is very important to provide an environment that makes all practitioners feel like they belong regardless of race or gender. Being one of the very few Black senior civil servants has prompted me to explore how to encourage more junior colleagues from all backgrounds to strive to access higher grades. If I, as confident as I thought I was, felt a bit like an intruder when I joined Senior levels, I can only imagine the impact on junior colleagues."
        },
        {
            "text": "I serve as the champion for a departmental access programme, a bespoke accelerated development programme for those with the desire and potential to progress their civil service careers. I serve as a champion for this programme and I hope that having a Black Female champion inspires others who may otherwise have felt disempowered to reach for more senior roles. The most rewarding part of my job is making myself available to junior colleagues to provide advice and encouragement to progress in their careers."
        },
        {
            "text": "“It is a bad plan that admits of no modification”"
        },
        {
            "text": "There have been a lot of lessons over the years but one thing I remind myself and others of is the need for an unwavering focus on the goal and desired outcome of a project. There will always be unexpected turns and curves in project delivery and it can become easy to get diverted into activities that don’t always add to the outcome the project is supposed to deliver. A favourite saying of mine is that “it is a bad plan that admits of no modification”. The best-laid plans will need to change as issues arise to ensure that the outcome is achieved. The plan (the road to the end) may change, but the focus on the end game should not."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}