{
    "url": "https://food.blog.gov.uk/2023/03/03/jose-gomez-luengo-is-the-fsas-vet-of-the-year-2023/",
    "title": "Jose Gomez-Luengo is the FSA's Vet of the Year 2023",
    "authors": [
        "Jose Gomez-Luengo, Veterinary Advisor"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-03-03T11:07:53+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Here at the Food Standards Agency, we're delighted to share that our Vet of the Year for 2023 is Jose Gomez-Luengo. We sat down with Jose and asked him about his career and what the award means to him."
        },
        {
            "text": "I was truly surprised when Jane Clark, Veterinary Director at the FSA, called to inform me that I have been selected as the Vet of the Year. I knew I was up against stiff competition as many of my FSA veterinary colleagues do outstanding things and being nominated is just the first step - then comes the scrutiny about the merits of those nominated. And I know it is tough to win: I am proud to say I have been nominated in the four years the award has been running but it has taken all that time to finally win it!"
        },
        {
            "text": "I was not a vocational veterinarian. I have always liked animals, but I had planned to become an architect, like my father and grandfather. It was in my last year before starting university that I decided to become a vet."
        },
        {
            "text": "I graduated from vet school in my hometown of Cordoba, Spain in 1993, but needed to do National Service before I could start work. After being discharged from the Army, I helped a small animal veterinary surgeon in my hometown whilst I looked for a job."
        },
        {
            "text": "The first offer came from the UK. At that time, as now, the UK needed vets wanting to work in meat hygiene. Most vets here were attracted by clinical work and considered those working in food safety or in a slaughterhouse almost second rate. (Yet, I trained as a clinician and didn’t want to be a vet to look after sausages rather than animals!) Thankfully the outdated view that those who choose to work supporting public health are “not proper vets” is changing."
        },
        {
            "heading": 2,
            "text": "From the Meat Hygiene Service to Veterinary Advisory Services Team"
        },
        {
            "text": "I worked for private practices for a few years and when a vacancy arose in the Meat Hygiene Service I applied and was offered the job, joining the Civil Service in August 2001. This year will mark my 22nd anniversary, just as the FSA turns 23 years old."
        },
        {
            "text": "Initially, I worked in the Operations Division. This took me out and about visiting mainly meat establishments conducting official controls, doing approval assessments, or more recently leading a team of auditors. I did enjoy that work and it gave me a thorough grounding and, I believe it is fair to say, extensive knowledge of the meat industry and its regulatory framework."
        },
        {
            "text": "I am now part of the Veterinary Advisory Services Team under the Veterinary Services Director, which has grown to five Vet Advisers led by the Head of Veterinary Services. Last year we moved from the Policy Division to the (still newish) UK & International Affairs Division."
        },
        {
            "text": "Our small team is made up of vets with various backgrounds. Whilst we share our work in a way that allows for resilience, we have what might be called specialisms that play on our strengths. Years of practice have made me happy to provide opinions about things I know about. I tend to be vocal in discussions, despite being shy by nature (which some may find surprising)."
        },
        {
            "text": "I assist in the formulation of meat hygiene and operational policies such as the supply of partially chilled Qurbani meat. There are always situations you never came across before. We have positioned ourselves as advisors and liaise with other government bodies, joining groups with people who work in other areas – it’s challenging and interesting!"
        },
        {
            "text": "I am honoured to follow in the steps of those that have won the Vet of the Year Award, as they all deserved it. I intend to honour the recognition and keep the flag up until I pass it on to next year’s winner."
        },
        {
            "heading": 1,
            "text": "Jose Gomez-Luengo yw Milfeddyg y Flwyddyn yr Asiantaeth Safonau Bwyd ar gyfer 2023"
        },
        {
            "text": "Yn yr Asiantaeth Safonau Bwyd, rydym yn falch iawn o rannu mai Jose Gomez-Luengo yw ein Milfeddyg y Flwyddyn ar gyfer 2023. Gwnaethom sgwrsio â Jose am ei yrfa a’r hyn mae’r wobr yn ei olygu iddo."
        },
        {
            "text": "Roedd yn sioc enfawr pan ffoniodd Jane Clark, Cyfarwyddwr Milfeddygol yr Asiantaeth Safonau Bwyd (ASB), i roi gwybod taw fi oedd Milfeddyg y Flwyddyn. Rwy’n gwybod ei bod hi’n gystadleuaeth frwd gan fod llawer o’m cydweithwyr milfeddygol yn yr ASB yn gwneud pethau rhagorol a dim ond y cam cyntaf oedd cael fy enwebu – wedyn daeth y gwaith craffu ar rinweddau’r sawl a enwebwyd. Ac rwy’n gwybod ei bod yn anodd ennill y teitl: rwy’n falch o ddweud fy mod wedi cael fy enwebu ym mhob un o’r pedair blynedd y mae’r wobr wedi’i chynnal, ond mae wedi cymryd yr holl amser hwnnw i’w hennill o’r diwedd!"
        },
        {
            "text": "Nid oeddwn yn filfeddyg galwedigaethol. Rwyf bob amser wedi hoffi anifeiliaid, ond roeddwn wedi bwriadu dod yn bensaer, fel fy nhad a fy nhad-cu. Penderfynais fod yn filfeddyg yn ystod fy mlwyddyn olaf cyn dechrau yn y brifysgol."
        },
        {
            "text": "Graddiais o ysgol filfeddygol yn fy nhref enedigol, Cordoba, yn Sbaen ym 1993, ond roedd angen i mi wneud Gwasanaeth Milwrol cyn i mi allu dechrau gweithio. Ar ôl cael fy rhyddhau o’r Fyddin, gwnes i helpu milfeddyg anifeiliaid bach yn fy nhref enedigol tra roeddwn i’n chwilio am swydd."
        },
        {
            "text": "Daeth y cynnig cyntaf o’r DU. Bryd hynny, fel sydd hefyd yn wir nawr, roedd angen milfeddygon ar y DU a oedd am weithio ym maes hylendid cig. Roedd y rhan fwyaf o filfeddygon yn y DU yn cael eu denu gan waith clinigol ac yn meddwl bod y rheiny sy’n gweithio ym maes diogelwch bwyd neu mewn lladd-dai yn filfeddygon eilradd bron. (Serch hynny, gwnes i hyfforddi fel clinigwr a doeddwn i ddim eisiau bod yn filfeddyg i ofalu am selsig yn hytrach nag anifeiliaid!). Diolch byth, mae’r farn hen ffasiwn nad yw’r rhai sy’n dewis gweithio i gefnogi iechyd y cyhoedd yn “filfeddygon go iawn” yn newid."
        },
        {
            "text": "O’r Gwasanaeth Hylendid Cig i’r Tîm Gwasanaethau Cynghori Milfeddygol"
        },
        {
            "text": "Gweithiais i bractisau preifat am rai blynyddoedd a phan ddaeth swydd wag yn y Gwasanaeth Hylendid Cig, gwnes i gais a chynigiwyd y swydd i mi. O ganlyniad, ymunais â’r Gwasanaeth Sifil ym mis Awst 2001. Erbyn hyn, rwyf wedi gweithio fel milfeddyg yn y Gwasanaeth Sifil ers 22 mlynedd, a hynny wrth i’r ASB droi’n 23 oed."
        },
        {
            "text": "I ddechrau, roeddwn i’n gweithio yn yr Is-adran Gweithrediadau. Fel rhan o’r gwaith hwn, roeddwn yn ymweld â sefydliadau cig yn bennaf i gynnal rheolaethau swyddogol, gwneud asesiadau cymeradwyo, ac arwain tîm o archwilwyr yn fwy diweddar. Gwnes i fwynhau’r gwaith hwnnw. Rhoddodd sylfaen gadarn i mi ac, rwy’n credu ei bod yn deg dweud, wybodaeth helaeth am y diwydiant cig a’i fframwaith rheoleiddio."
        },
        {
            "text": "Rwyf bellach yn rhan o’r Tîm Gwasanaethau Cynghori Milfeddygol o dan y Cyfarwyddwr Gwasanaethau Milfeddygol, sydd bellach yn cynnwys pum Cynghorydd Milfeddygol dan arweiniad Pennaeth y Gwasanaethau Milfeddygol. Y llynedd, symudon ni o’r Is-adran Polisi i Is-adran Materion Rhyngwladol a’r DU (sy’n dal yn eithaf newydd)."
        },
        {
            "text": "Mae ein tîm bach yn cynnwys milfeddygon o gefndiroedd amrywiol. Er ein bod yn rhannu ein gwaith mewn ffordd sy’n sicrhau gwytnwch, mae gennym arbenigeddau sy’n manteisio ar ein cryfderau. Mae’r blynyddoedd o brofiad wedi fy mharatoi ar gyfer rhoi fy marn am bethau rwy’n gwybod amdanynt. Rwy’n dueddol o godi fy llais mewn trafodaethau, er fy mod i’n berson swil (a allai beri syndod i rai)."
        },
        {
            "text": "Rwy’n helpu i lunio polisïau hylendid cig a gweithredu fel cyflenwi cig Qurbani sydd wedi’i oeri’n rhannol. Mae bob amser sefyllfaoedd nad ydych wedi dod ar eu traws o’r blaen. Cynghorwyr ydym wrth i ni gysylltu â chyrff eraill y llywodraeth, a grwpiau o bobl sy’n gweithio mewn meysydd eraill – mae’n heriol ac yn ddiddorol!"
        },
        {
            "text": "Mae’n fraint fawr dilyn yn ôl-traed y rhai sydd wedi ennill y wobr Milfeddyg y Flwyddyn dros y blynyddoedd diwethaf, gan fod pob un ohonynt yn enillwyr haeddiannol. Rwy’n bwriadu anrhydeddu’r gydnabyddiaeth a hyrwyddo’r gwaith nes i mi drosglwyddo’r teitl i enillydd y flwyddyn nesaf."
        }
    ]
}