{
    "url": "https://apprenticeships.blog.gov.uk/2023/03/03/national-careers-week-legal-pathway-apprentices/",
    "title": "National Careers Week: legal pathway apprentices",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "National Careers Week"
    ],
    "pub_date": "2023-03-03T15:56:36+00:00",
    "content": [
        {
            "text": "6th-11th March is National Careers Week. The week is a celebration of careers guidance and free resources in education across the UK."
        },
        {
            "text": "Apprenticeships are one way to kickstart a career, including in the legal, finance and accounting route. There are options for whatever stage you are at of a career, from paralegal to licensed conveyancer."
        },
        {
            "text": "Hear from three solicitor apprentices at Bryan Cave Leighton Paisner LLP on why they chose an apprenticeship, and what it's taught them so far."
        },
        {
            "heading": 2,
            "text": "Hadiyah, solicitor apprentice at Bryan Cave Leighton Paisner LLP"
        },
        {
            "heading": 3,
            "text": "Why did you choose an apprenticeship? "
        },
        {
            "text": "There were many reasons: I liked the idea of having a break between studying. The work/university split the apprenticeship offered allowed me time to understand what I was learning and digest the information before the next lecture."
        },
        {
            "heading": 3,
            "text": "What skills do you think you have developed since becoming an apprentice? "
        },
        {
            "text": "I have learnt to deal with stress better and have attention to detail and I am more open to criticism as this ultimately helps you develop!"
        },
        {
            "heading": 2,
            "text": "Brad, solicitor apprentice at Bryan Cave Leighton Paisner LLP"
        },
        {
            "heading": 3,
            "text": "Why did you choose an apprenticeship? "
        },
        {
            "text": "I viewed it as a brilliant route to get into the profession. I saw the opportunity to learn whilst I earn, gain a lot of valuable experience in a law firm, and not get into debt. University wouldn’t have suited me as I find practical application a better way to cement my knowledge."
        },
        {
            "heading": 3,
            "text": "What skills do you think you have developed since becoming an apprentice? "
        },
        {
            "text": "I have become more resilient and learnt so much, so I know that when I face challenging times in my career, I have the self-belief to get the job done."
        },
        {
            "heading": 2,
            "text": "Jake, solicitor apprentice at Bryan Cave Leighton Paisner LLP"
        },
        {
            "heading": 3,
            "text": "Why did you choose an apprenticeship?"
        },
        {
            "text": "An apprenticeship gave me a route into the industry that I hoped to work in and I can combine work with study which helps me really understand the learning. I’m gaining valuable experience that will help the future of my career."
        },
        {
            "heading": 3,
            "text": "What skills do you think you have developed since becoming an apprentice?"
        },
        {
            "text": "I have developed my organisation skills and ability to manage deadlines - this has been key in managing my workload and ensuring that I am completing tasks to a high standard."
        }
    ]
}