{
    "url": "https://environmentagency.blog.gov.uk/2023/03/03/police-and-environment-agency-work-together-to-stop-waste-criminals/",
    "title": "Police and Environment Agency work together to stop waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-03-03T11:19:51+00:00",
    "content": [
        {
            "text": "Cheshire Police’s Rural Crime Team was created in 2019 with one of its key areas of work to target those involved in waste crime. As with any area of policing, it would be near impossible to do it without the help and support of our partner agencies."
        },
        {
            "text": "The Environment Agency from the outset have been there to help guide us, educate us and work alongside us on the front line as we look to disrupt waste criminals and make the county as hostile as possible for those who look to profit from this type of crime."
        },
        {
            "text": "Over the winter period we have been holding regular operations under the banner of Operation Permits, to target illegal waste carriers on our road networks and to visit sites used for the illegal dumping of waste."
        },
        {
            "text": "It's through criminals seeing the teams working together, with the support of the local authorities, and through sharing intelligence, that we can really start to turn the tide on this type of crime. As a team we see the real benefit in sharing our work online with images of the agencies working together, so that the public can see for themselves that the Environment Agency and the police are out there dealing with these offenders."
        },
        {
            "text": "During the last six months working together, we have seized vehicles carrying waste, with two being crushed, issued over £2000 in fines, and we even had one of our suspects arrested on a plane at Manchester Airport. That person was found guilty at court of waste offences and criminal damage and received over £5000 in fines."
        },
        {
            "text": "We have found that a mix of joint Environment Agency and police roadside checks, roaming patrols and targeted operations continue to have the best results, with legitimate waste carriers happy to see the work we are doing together. Their confidence is growing along with their support too, as essentially, we are supporting their businesses and their income."
        },
        {
            "text": "In some areas we are seeing up to a 90% reduction in waste crime offences which is fantastic, but we recognise that much more must be done to improve the situation in other areas of the county."
        },
        {
            "text": "All this is only possible by having a strong working relationship with the Environment Agency and there being consistency between the teams. We are very proud of the relationship we have, and we look forward to working together as we continue to enhance the service we deliver. It’s by being able to pick up the phone and talk to colleagues who have a shared interest and passion to tackle this issue, that we are filled with confidence to face this problem head on."
        },
        {
            "text": "If you have information about waste criminals, you can report them anonymously to Crimestoppers: 0800 555 111."
        },
        {
            "text": "Sgt Rob Simpson - Rural Crime Team Supervisor"
        },
        {
            "text": "Cheshire Constabulary"
        }
    ]
}