{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/03/03/positive-pathways-through-the-criminal-justice-system/",
    "title": "Positive pathways through the criminal justice system",
    "authors": [
        "Elizabeth Taylor-Diparno",
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Knowledge and skills",
        "Our profession",
        "Safeguarding"
    ],
    "pub_date": "2023-03-03T13:09:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Positive change in tough situations"
        },
        {
            "text": "I came to social work with a passion to promote social justice, support positive change and empower others. I always thought my place within social work would be supporting children and young people, but later interactions with individuals moving through the criminal justice system set me on a different path."
        },
        {
            "text": "I started working within a therapeutic fostering agency who supported young people to achieve their potential. It was in this role that I first had contact with criminal justice agencies."
        },
        {
            "text": "As professionals, I quickly recognised we had differing value bases, aims and expectations for those we seek to support. This sparked an interest within me, which soon developed into a passion."
        },
        {
            "text": "I felt the adoption of a holistic perspective, drawing on individuals’ strengths, could empower them to achieve what matters to them. Such an approach could really support and prompt positive change in individuals who had found themselves in contact with the justice system."
        },
        {
            "text": "I saw the barriers and missed opportunities experienced by vulnerable people. I recognised change was necessary to make sure they could access the support they needed and deserved."
        },
        {
            "text": "My passion led to a role in the NHS Liaison & Diversion service, where I was able to see the positive impact a psycho-social approach could make to people in contact with the justice system. In this role, I interacted with numerous individuals who experienced inequalities in accessing health and social care, and who were caught in a cycle of criminality."
        },
        {
            "heading": 2,
            "text": "Defining moment"
        },
        {
            "text": "One day in particular stands out for me. While on my lunch break, I saw someone I had previously met in custody. He stopped to thank me for listening and helping him get the support he needed."
        },
        {
            "text": "He had been arrested for having a knife – a knife he had intended to use on himself. He revealed our interaction had been the starting point on his journey of recovery. I was privileged to hear his life story and work collaboratively with him to develop a plan of support."
        },
        {
            "text": "In this role, I could make every contact count, using social work skills to empower and support individuals to make positive life choices. I recognised the benefits of timely diversion from the criminal justice system and helping people to access support during their first contact with it."
        },
        {
            "text": "However, when I started to see the same individuals again and again, I recognised that to safeguard any health and social care gains they might make in prison, we needed to do more."
        },
        {
            "heading": 2,
            "text": "Introducing RECONNECT"
        },
        {
            "text": "Then NHS England developed RECONNECT, a non-clinical 'care after custody' service that seeks to improve the continuity of care for adults with identified health needs leaving prison or an immigration removal centre (IRC). It is about eradicating health inequalities, empowering individuals within the justice system, and facilitating ‘wrap around support’, when leaving prison or an IRC."
        },
        {
            "text": "I applied for the role of National Implementation Manager at RECONNECT and I am now working to make sure services are rolled out nationally, delivering care and support in a holistic and collaborative way."
        },
        {
            "text": "Hearing the journeys of those who have worked with the service, reminds me every contact really counts. The holistic perspective is essential, as is recognising how different environments and experiences impact an individual’s life."
        },
        {
            "text": "So far, it has been a privilege to work in collaboration with individuals in the justice system and I am committed to use my social work skills to do more."
        },
        {
            "text": "For further information visit NHS commissioning » Health and justice (england.nhs.uk)"
        }
    ]
}