{
    "url": "https://veteranstoday.blog.gov.uk/2023/03/03/review-targets-more-effective-welfare-services-for-veterans/",
    "title": "Review targets more effective welfare services for veterans",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Armed Forces Charities",
        "Armed Forces Covenant",
        "Veterans",
        "Veterans Advice",
        "Veterans Support",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2023-03-03T10:47:38+00:00",
    "content": [
        {
            "text": "A major review has been announced into the effectiveness and efficiency of welfare services for veterans."
        },
        {
            "text": "The review, announced by the Office for Veterans’ Affairs and the Ministry of Defence, will also identify any duplication or gaps in support."
        },
        {
            "text": "Support being looked at includes services such as the Veterans Welfare Service, which comes under the banner of Veterans UK. It provides one-to-one support to veterans and their families through a network of welfare managers across the UK."
        },
        {
            "text": "The Defence Transition Service, which supports military personnel as they move into civilian life, is also part of the review."
        },
        {
            "text": "Minister for Veterans’ Affairs Johnny Mercer said: 'We recognise that supporting veterans to access appropriate support is critical to this government’s success in making the UK the best country in the world to be a veteran."
        },
        {
            "text": "'This review will enable us to better align the workings of a range of support services, with the needs of the veterans community, and enhance the quality of the services veterans are offered.'"
        },
        {
            "text": "Dr Andrew Murrsion, Minister for Defence People, Veterans and Service Families, said: 'We are eternally grateful for the service of all our veterans and it’s only right that we provide them with the support they deserve."
        },
        {
            "text": "'This is why I and the Minister for Veterans’ Affairs have called for a review into the welfare provisions for veterans."
        },
        {
            "text": "'This is in no way a reflection of the efforts of every one of our fantastic teams, who are working so hard to provide enduring support, but part of our ongoing commitment to improving our offer for our serving personnel, veterans and their families.'"
        },
        {
            "text": "Other services that are part of the review include:"
        },
        {
            "text": "The work will complement the Quinquennial Review of the Armed Forces Compensation Scheme, which is already under way."
        },
        {
            "text": "The joint OVA and MOD review will be conducted by an independent civil servant, who will be supported by a joint secretariat from the MOD and Cabinet Office. The review will focus on examining each organisation’s performance and practices, identifying areas for improvement and enhancing efficiency."
        }
    ]
}