{
    "url": "https://space.blog.gov.uk/2023/03/03/the-night-sky-in-march-3/",
    "title": "The night sky in March",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-03-03T17:23:13+00:00",
    "content": [
        {
            "text": "This month sees the transition from winter to spring and is a great time to see the bright stars and constellations that both seasons have to offer, plus some striking conjunctions."
        },
        {
            "text": "More than 80% of stars in our night sky are believed to be ‘binary’ systems having one, or in some cases several, stars orbiting it."
        },
        {
            "text": "Auriga, home to sixth brightest star Capella, is high overhead this month. Capella is a system of four stars around 40 light-years away. Its two brighter stars are 12 and 9 times the size of our Sun, and orbit each other at around the same distance Venus orbits the Sun."
        },
        {
            "text": "Lower in the southern sky is bright star Sirius in the constellation of Canis Major, which is twice the size of the Sun and lies around 8 light-years away. Sirius also has a companion star, a smaller white dwarf in an elliptical orbit that brings it as close to Sirius as Jupiter is to our Sun, and as far away as Neptune."
        },
        {
            "text": "Looking east, the spring constellation of Leo (the lion) is now above the horizon, with the heart of the lion depicted by bright star Regulus, a four-star system around 80 light-years away."
        },
        {
            "text": "Castor, the head of the twin on the right of constellation Gemini, is a star-system consisting of six stars around 50 light-years away. The brightest of these is around twice the size of our Sun while the smallest is around half the size of the Sun and only 10% as bright."
        },
        {
            "heading": 2,
            "text": "The Moon and Planets"
        },
        {
            "text": "Following its close conjunction with Venus at the start of the month, Jupiter now moves lower to the horizon, fading into the light of the setting Sun."
        },
        {
            "text": "Venus continues to blaze in the western evening sky and reaches a slightly less obvious planetary conjunction in the last few days of the month. As it moves steadily towards the constellation of Taurus, those with binoculars or a telescope will see Venus glide past Uranus, the third largest planet in our Solar System."
        },
        {
            "text": "Mars will drift away from the constellation of Taurus and towards the constellation of Gemini (the twins) as it continues to fade in brightness."
        },
        {
            "text": "Regular readers will have spotted the Moon’s regular conjunctions with the planets of our Solar System. This is because the orbit of the Moon around Earth is on roughly the same inclination or ‘orbital plane’ as Earth and the other planets travelling around the Sun, a plane known as the ‘ecliptic’."
        },
        {
            "text": "Because our Moon orbits Earth roughly once a month, it will regularly appear near to the same astronomical objects in our sky."
        },
        {
            "text": "This month’s visual treats are a 10% illuminated crescent moon very close to bright Venus on the evening of 24 March, and a 50% illuminated moon near to Mars on 28 March."
        },
        {
            "heading": 2,
            "text": "The Spring Equinox"
        },
        {
            "text": "Our planet has a tilt of 23.5 degrees relative to its orbit around the Sun. This means that for half of the year, our northern hemisphere is tipped away from the Sun."
        },
        {
            "text": "On 20 March we pass through one of the midway points, the spring or ‘vernal’ equinox. This marks the point where both hemispheres are equally distant from the Sun, and where the day and night are equal in length."
        },
        {
            "heading": 2,
            "text": "Space Exploration"
        },
        {
            "text": "Juno, the NASA mission that arrived at Jupiter in 2016, has just completed its 49th orbit of our Solar System’s largest planet.  You can see some of the remarkable images the spacecraft has captured of Jupiter and its larger moons here."
        },
        {
            "text": "The Juno mission was originally scheduled to conduct around 35 orbits, but NASA were able to extend the mission, which will now continue until 2025."
        },
        {
            "text": "Predicting launch dates for new launch vehicles is tricky as they’re often delayed, but SpaceX have announced that ‘Starship’, their 120m tall re-useable rocket, is ready to conduct its first orbital test flight this month."
        },
        {
            "text": "It will be the largest, most powerful rocket ever built, and SpaceX are working with NASA to develop the upper stage as part of the ‘Human Landing System’ that will return humans to the Moon."
        },
        {
            "text": "The UK is playing a key role in humanity's return to the Moon, including contributing vital parts of the planned Moon-orbiting Lunar Gateway. Read more here."
        }
    ]
}