{
    "url": "https://civilservice.blog.gov.uk/2021/09/22/international-week-of-the-deaf-people-2021/",
    "title": "International Week of the Deaf People 2021",
    "authors": [
        "Ben Jaab"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-09-22T09:19:15+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Ben Jaab discusses the challenges facing deaf colleagues in the Civil Service, and looks at the latest research and work underway to improve their working conditions."
        },
        {
            "text": "In the UK, there are 10-11 million people who are deaf or hard of hearing (one in six). One in eight are affected by tinnitus. There are around 150,000 British Sign Language (BSL) users. Many more people are either relatives, friends or colleagues of those on the hearing spectrum."
        },
        {
            "text": "Deaf BSL users please follow this link for a translation of the blog. "
        },
        {
            "text": "To mark the International Week of the Deaf People 20-26 September, the Civil Service Deaf and Hard of Hearing Network has teamed up with the Deaf: Inclusion, Visibility, Accessibility and Awareness (DIVAA) group to highlight our work to raise awareness and improve working conditions for deaf civil servants. "
        },
        {
            "text": "What is DIVAA? "
        },
        {
            "text": "DIVAA is a Future Leaders Academy group comprised of members from across different Civil Service departments. Richard Purvis was the first profoundly deaf colleague to participate as an academy delegate in England. As hearing members of society, our group had never experienced the difficulties raised by Richard. "
        },
        {
            "text": "We’d never had any training or awareness on how to best support our deaf colleagues. It was Richard and his interpreters who helped educate us - but should we have been better prepared before we met him? The weight of this question and Richard’s knowledge and experience motivated us to explore what resources were and are available across the Civil Service."
        },
        {
            "text": "“The Future Leaders Academy is designed to facilitate collaborative working across government and encourages the sharing of good practice, especially with under-represented groups… by increasing awareness of the challenges deaf people face on a day-to-day basis, lobbying for equality and ensuring there is a community of support available.” "
        },
        {
            "text": "Anne-Marie Blackburn, Future Leaders Academy Coach & Facilitator"
        },
        {
            "text": "What has DIVAA done so far and discovered?"
        },
        {
            "text": "We created a survey focusing on the inclusion, visibility, accessibility, and awareness (IVAA) of the deaf community in the Civil Service. We then distributed it across the Civil Service networks. Asking over 20 questions, we aimed to find out what deaf colleagues felt was lacking or being done well to meet their needs; nearly 1,000 civil servants participated."
        },
        {
            "text": "Importantly, questions were presented in written English and BSL, which is not the current norm in many all-staff surveys. The responses were astounding!"
        },
        {
            "text": "We didn’t stop there. From the volume of responses, over half were happy to be included in further project participation. We asked those deaf colleagues and managers to participate in focus groups to explore their first-hand experiences.      "
        },
        {
            "text": "One colleague explained that we need “greater visibility of deaf colleagues at all levels.” Whilst another stated, “There are big differences in approach between departments,” which may prevent colleagues from taking on new challenges. Most concerning was feedback around visibility, with one colleague sadly explaining that “It is embarrassing and humiliating to keep asking people to remember [my deafness].” Another told us, “Sometimes I feel I need to wear a big hat saying, ‘By the way… I’m still deaf!’”     "
        },
        {
            "text": "How can we make things better? "
        },
        {
            "text": "If you work with a deaf colleague, good communication is key. Don’t assume you know what’s best – ask your deaf colleagues or the support networks."
        },
        {
            "text": "The Civil Service Deaf and Hard of Hearing Network has good knowledge and resources, including support for managers working with deaf staff. "
        },
        {
            "text": "You can find out about Workplace Adjustment Passports in your home department’s HR and L&D handbook or by contacting the Workplace Adjustments team in the Cabinet Office."
        },
        {
            "text": "Finally, if you’ve been inspired, we’d recommend the Civil Service Local Future Leaders Academy  for the opportunity to meet people from all departments and walks of life. We have gained valuable skills and the chance to develop this project with the potential to implement a legacy of positive change. You could too!"
        },
        {
            "text": "The Civil Service Deaf and Hard of Hearing Network welcomes new members. Visit the network’s page on gov.uk to find out more."
        },
        {
            "text": "Moving forward"
        },
        {
            "text": "Our work doesn’t stop here. We plan to continue supporting the Civil Service Deaf and Hard of Hearing Network. We will also liaise with other government departments to push for improvements and positive change. Watch this space!"
        }
    ]
}