{
    "url": "https://environmentagency.blog.gov.uk/2021/09/22/planning-for-flood-resilient-places/",
    "title": "Planning for flood-resilient places",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2021-09-22T10:56:03+00:00",
    "content": [
        {
            "text": "Getting the right kind of growth in the right places is one of the main ways of achieving climate resilient places. Effective spatial planning is an essential tool for making land use choices that help to achieve greater flood and coastal resilience, as well as wider environmental benefits. And that is why good place making is a central theme in the National Flood and Coastal Erosion Risk Management (FCERM) Strategy for England laid in Parliament last Autumn."
        },
        {
            "text": "Today, I presented at the Flood Expo Conference about the steps we are taking to work with partners to put the Strategy into practice. One of the many actions we have committed to in our 2021 Strategy Action Plan is to improve the data we publish around the effectiveness of our planning advice. This also contributes to recommendations made by the Public Accounts Committee and the Environmental Audit Committee."
        },
        {
            "text": "As a statutory planning consultee, the Environment Agency has a key role to play in advising planners and developers to avoid inappropriate development in flood risk areas and to enable climate resilient development. We do this both at the strategic level - advising local planning authorities on their spatial plans for future development - and at the site-specific level - advising on individual development proposals at pre-application and application stage. The Environment Agency has found that for every pound it has invested in providing spatial planning advice, around 12 pounds of flood damages have been avoided."
        },
        {
            "text": "We can never prevent all flooding from happening, and climate change means the risks are increasing, but we can reduce the consequences. We are likely to see nearly double the number of properties in the floodplain over the next 50 years. Predictions also show that by 2050 we could see 59% more winter rainfall and once-a-century sea level events could become annual events by 2100. Therefore, it is more important than ever for us to work with local partners to avoid unsafe development in areas at high risk of flooding and coastal change."
        },
        {
            "text": "Today we have published more information on where we have made flood risk objections on planning applications over a five year period. For those cases where we also recorded the local planning authority decision, we now include details on whether or not our flood risk advice was followed. We hope this data will improve the transparency of local planning decisions where flood risk is an issue. It will also assist local authorities complete their annual monitoring reports which help measure the effectiveness of local planning."
        },
        {
            "text": "The good news is that this data shows our advice is followed the vast majority of the time. In fact, last year, we provided flood risk advice on around 7,000 applications, registering initial objections to around 2,500 of them. Of those cases where we also recorded the local planning authority decision, over 97% of them were decided in line with our advice. This advice helped prevent around 30,000 homes being allowed in the floodplain in a potentially unsafe or inappropriate way. But we cannot be complacent. As a nation there is still more we can do to avoid the misery and damage from flooding associated with inappropriate new development built in the floodplain. For example, we are aware in 2020-21 that at least 600 homes were granted planning permission against our flood risk advice. We would like that number to be zero."
        },
        {
            "text": "A great example of how our advice helps to ensure that development is safe and sustainable is in Longbridge in Birmingham. Working with the local community and developers, we positively influenced the design of the redevelopment of the former MG Rover site, to ensure the previously culverted River Rea was integral to the design of the new development. The redesign ensures that new buildings are resilient to flooding whilst also creating a better local environment for businesses and community to enjoy. It is an example of the value the Environment Agency can bring to the design of more resilient and beautiful places through our role in the planning process."
        },
        {
            "text": "In July 2021 the Government published a Review of policy for development in areas at flood risk that the Environment Agency helped contribute to. The review set out the actions the Government will take and have already taken, such as clarifications to the National Planning Policy Framework, to ensure the safety of new developments from flooding now and in the future. With both the Planning White Paper reforms and the 26th United Nations Climate Change Conference on the horizon there are huge opportunities to maximise opportunities for creating better places for people and wildlife. This includes opportunities for greater use of sustainable drainage systems, natural flood management and wider environmental net gain."
        },
        {
            "text": "We need to start planning in earnest for the unavoidable impacts of climate change. Building more flood resilient places will be a corner stone of adapting to future hazards and responding to the climate emergency."
        },
        {
            "text": "Author: Julie Foley, Director of Flood Strategy & National Adaptation, Environment Agency"
        }
    ]
}