{
    "url": "https://homeofficemedia.blog.gov.uk/2021/09/22/policing-minister-statement-on-insulate-britain-protests/",
    "title": "Policing Minister statement on Insulate Britain protests",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Uncategorised"
    ],
    "pub_date": "2021-09-22T13:45:22+01:00",
    "content": [
        {
            "text": "Minister for Crime and Policing Kit Malthouse delivered the below statement to the House on 22 September 2021."
        },
        {
            "text": " "
        },
        {
            "text": "With permission, Sir, I would like to make a statement about protests."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, there is widespread anger throughout the country about the disruption, danger, and misery caused by so-called climate protesters with their selfish actions."
        },
        {
            "text": " "
        },
        {
            "text": "On the 13th, 15th, and 17th of September, a group called “Insulate Britain” staged coordinated sit-down protests on the M25, leading to major traffic delays."
        },
        {
            "text": " "
        },
        {
            "text": "They also targeted the wider road network, namely the M1, M3, and M11."
        },
        {
            "text": " "
        },
        {
            "text": "Dealing with this involved Surrey Police, Essex Police, Thames Valley Police, Hertfordshire Constabulary, Kent Police, and the Metropolitan Police as the lead Force.  A total of 241 arrests were made across these three days."
        },
        {
            "text": " "
        },
        {
            "text": "Then on Monday, these groups attempted to block the carriageway at Junction 1a of M25 in Kent, the M25 at Hertfordshire, and Junction 4 of the A1."
        },
        {
            "text": " "
        },
        {
            "text": "Hertfordshire Constabulary were present at both scenes and made 29 arrests."
        },
        {
            "text": " "
        },
        {
            "text": "Yesterday, protesters blocked both M25 carriageways between Junction 9 and Junction 10. Surrey Police arrived on scene within three minutes and officers cleared the carriageway quickly."
        },
        {
            "text": " "
        },
        {
            "text": "It is clear that police response times have improved significantly following the first two days of protests. The affected forces have dedicated significant resources to spotting protesters and removing them quickly."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, protest is a right, but it must be balanced against the rights of others to go about their daily lives. The right to protest is not unqualified and does not include the right to endanger others, to intimidate people, or to break the law."
        },
        {
            "text": " "
        },
        {
            "text": "The events of recent days have crossed this line."
        },
        {
            "text": " "
        },
        {
            "text": "As anyone should know, sitting in the road is extremely dangerous, both to yourself and to others."
        },
        {
            "text": " "
        },
        {
            "text": "Delays caused by protests between the 13th and 17th of September have cost drivers in excess of half a million pounds."
        },
        {
            "text": " "
        },
        {
            "text": "And this figure does not take into account the knock-on effect for the local road network, manufacturing businesses, or indeed for those who missed connections at ports."
        },
        {
            "text": " "
        },
        {
            "text": "Previously, Mr Speaker, the actions of Extinction Rebellion – of which Insulate Britain is, I understand, an offshoot of – have cost the taxpayer £50 million and diverted valuable police resources."
        },
        {
            "text": " "
        },
        {
            "text": "And we have all heard the heart-breaking stories about people not getting the medical treatment they needed and seen people standing by their cars literally crying in frustration at this appallingly stupid and selfish behaviour."
        },
        {
            "text": " "
        },
        {
            "text": "We have all had enough, Mr Speaker."
        },
        {
            "text": " "
        },
        {
            "text": "The Government has been working very hard to address these concerns."
        },
        {
            "text": " "
        },
        {
            "text": "The Home Secretary and I are in constant contact with the police."
        },
        {
            "text": " "
        },
        {
            "text": "And we have been crystal clear in our support for the robust and swift enforcement of the law."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, there is absolutely no excuse for this selfish and disruptive behaviour. The irony is that it actually undermines the cause of climate change, as well as creating more traffic and pollution."
        },
        {
            "text": " "
        },
        {
            "text": "These protesters live in a free country where they can lobby politicians, stand for election, and boot us out of office if they don’t like what we do."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, there is now widespread agreement in this House and across the political spectrum that climate change demands major action. In November, the UK will host a huge international conference where we will discuss and debate these very issues."
        },
        {
            "text": " "
        },
        {
            "text": "But we do not change policies or make law in this country through mob rule or being held to ransom."
        },
        {
            "text": " "
        },
        {
            "text": "And these people should not suppose - for one moment - that the public is with them."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, the Police, Crime, Sentencing and Courts Bill currently under consideration in the Other Place, contains proportionate measures better to enable the police to deal with disruptive protests.  By putting public nuisance on to a statutory footing – as recommended by the independent Law Commission – we will increase the powers available to the police for dealing with this sort of protest."
        },
        {
            "text": " "
        },
        {
            "text": "However, the disruption to our transport network is now so harmful and dangerous that we need to take swift action."
        },
        {
            "text": " "
        },
        {
            "text": "The Home Office and Department for Transport have been working closely with National Highways to keep the situation under review and explore options for enabling police to take a more robust approach."
        },
        {
            "text": " "
        },
        {
            "text": "With our full support, National Highways has now won an interim injunction to prevent protesters from occupying the M25. As colleagues will know, an injunction is a judicial order made, in this case, by the High Court, which can either require someone to do something or to refrain from doing something."
        },
        {
            "text": " "
        },
        {
            "text": "This injunction prohibits people from blocking, endangering, slowing down, obstructing or otherwise preventing the free flow of traffic on the M25."
        },
        {
            "text": " "
        },
        {
            "text": "If they breach the injunction, or encourage or help others to do so, people will be held in contempt of court and may be imprisoned or fined. The fine, Mr Speaker, is unlimited."
        },
        {
            "text": " "
        },
        {
            "text": "This should act as a major deterrent and recognises that this law-breaking is serious with consequences that match the offending."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, the police should be fighting crime in our neighbourhoods, not chasing activists across busy motorways."
        },
        {
            "text": " "
        },
        {
            "text": "That is why we have taken this action now and we are working with National Highways on obtaining a full injunction later this week."
        },
        {
            "text": " "
        },
        {
            "text": "Mr Speaker, this is a free country, but that freedom, particularly to assemble, speak out and protest, does not come without responsibilities to respect the rights of others and the democratic process."
        },
        {
            "text": " "
        },
        {
            "text": "The British people expect us to make decisions in a civilised, democratic manner and that those who seek to bully or blackmail are sent packing."
        },
        {
            "text": " "
        },
        {
            "text": "And so with some pleasure, Mr Speaker, I commend this statement to the House."
        }
    ]
}