{
    "url": "https://space.blog.gov.uk/2023/04/05/action-advocacy-and-networking-at-the-united-nations/",
    "title": "Action, advocacy, and networking at the United Nations",
    "authors": [
        "Jonathon Simons"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2023-04-05T12:07:38+01:00",
    "content": [
        {
            "text": "“Action, advocacy and networking”; this is how we describe the work that the UK Space Agency does at the UN Committee on Peaceful Uses of Outer Space (UNCOPUOS) in Vienna."
        },
        {
            "text": "It is the primary international platform for the peaceful uses of space, which decides the future of global and commercial space law and guidelines.\nWhat the agency does at UNCOPUOS and how we engage there make up a large part of my work as the International Regulation Manager in the UK Space Agency Regulation team."
        },
        {
            "text": "This is a team effort with input from across the agency and across the departments and organisations with responsibility for space, such as the newly formed Department for Science, Innovation and Technology, the Foreign, Commonwealth and Development Office, the Civil Aviation Authority, and the Department for Transport."
        },
        {
            "text": "Vienna is a beautiful city, with stunning gothic architecture and lovely green areas. However, a trip to UNCOPUOS means you are spending most of your time at the Vienna International Centre (known as the VIC). The VIC is the home of UNCOPUOS, as well as other UN bodies on atomic energy, human rights, drugs and crime."
        },
        {
            "text": "At the start of the day, the UK delegation will meet to plan the day ahead. Then there may be time to catch up with other countries to discuss what’s happening at the Committee, or watch a technical presentation from invited representatives from industry and academia."
        },
        {
            "text": "I attended a fascinating presentation about the upcoming US led Mission Extension Vehicle (MEV), which will attach small fuel pods to satellites that are out of fuel, in order to extend their life or enable them to move to a new orbit. It’s motivating to hear about these exciting new technologies and intriguing to think about how they will be regulated."
        },
        {
            "text": "Then it's onto the ‘main session’ to hear statements from over 100 member states, and observer organisations on agenda items. The STSC session had agenda items ranging from space debris, space weather, nuclear power sources in space, and dark and quiet skies."
        },
        {
            "text": "The UK gave a record 10 statements at this year’s session with myself giving five of those (read our general statement). It can be a nerve-wracking experience, giving the UK’s update to a room full of international delegates, but it’s rewarding to have the privilege to do it."
        },
        {
            "text": "After this is a two-hour lunch break, which sounds like a lovely way to decompress after a busy morning, but many of these breaks involve ‘working group’ meetings.\nAlongside the above-mentioned agenda items, the UNCOPUOS working groups get together to talk through substantial issues that the committee have decided needed further discussion. That phrase ‘the committee have decided’ is key, with UNCOPUOS voting by consensus, meaning every country needs to agree to every decision made at UNCOPUOS."
        },
        {
            "text": "There were three working groups taking place at STSC this year, and the UK took part in all three. I focused mostly on the working group on the Long-Term Sustainability of Outer Space Activities (LTS WG)."
        },
        {
            "text": "The LTS WG adopted 21 voluntary guidelines for space sustainability in 2019 with guidelines covering thematic areas, such as space debris, space situational awareness, regulatory regimes, and space supporting sustainability on Earth."
        },
        {
            "text": "The working group is now focusing on how the guidelines can implemented and how emerging space states can be supported. The UK has been leading on capacity building with a multi-year project with UN Office for Outer Space Affairs (UNOOSA), who are the secretariat for UNCOPUOS."
        },
        {
            "text": "This year’s project outputs will fund UNOOSA to create a free-to-access e-module providing information about the LTS guidelines and organise four events centred around different areas of the guidelines."
        },
        {
            "text": "One of the key outputs from this year’s LTS WG was a repository to store and display every country’s experience of adopting the guidelines with the current system being a list of single submissions from countries, which can be difficult to navigate and compare."
        },
        {
            "text": "This was something the UK helped conceptualise and advocate for, so we were really excited to see this agreed and get support from a wide range of countries."
        },
        {
            "text": "We also had the UK chair, Sam Harbison for the working group on the Use of Nuclear Power Sources in Outer Space step down after years of expert leadership, and it was great he was acknowledged with a standing ovation in the room."
        },
        {
            "text": "After the working group meetings, it's straight back into the second main session with more statements from countries on their space activities. Once this session ends, another round of technical presentations starts, and UK delegates usually take some time to summarise what happened in the day."
        },
        {
            "text": "Depending on the day, you could then have an evening event to attend. This could range from a reception hosted by a country or organisation, to a regulator roundtable where regulators come together to share their approaches or an evening side event bringing experts together on a pertinent issue. This time, there were events on Dark and Quiet Skies and large constellations."
        },
        {
            "text": "This daily schedule takes place over two weeks, with the end of the committee culminating in the ‘report stage’. This is where countries negotiate the final report of the session, which aims to reflect what countries have expressed at the meeting and what has been agreed at the agenda items and working groups. This requires you to read through the report documents drafted by the secretariat and make sure they reflect your position and priorities."
        },
        {
            "text": "The chair runs through each report to see if it has the consensus of the entire committee, and this is where the UK and other countries will suggest revisions. This takes as long as it needs to and will finish on the final Friday evening, where the final step is the adoption of the report."
        },
        {
            "text": "Attending the session was a whirlwind two weeks that required juggling the deeply technical areas of space alongside the inevitable geopolitics that come as part of the UN process."
        },
        {
            "text": "While it was very busy, I enjoyed learning about new policy developments and promoting the UK’s progress and achievements in space."
        }
    ]
}