{
    "url": "https://food.blog.gov.uk/2023/04/05/chief-executives-message-to-stakeholders-our-meat-fraud-investigation/",
    "title": "Chief Executive’s message to stakeholders - Our meat fraud investigation",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-04-05T16:44:49+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "In the last few weeks, there has been media coverage of one of the Food Standards Agency's criminal investigations into suspected meat fraud, which has since led to allegations of food safety breaches. Our investigation into a particular supplier has been underway since August 2021. There is no indication that unsafe food is currently on the market."
        },
        {
            "text": "As one of our key stakeholders I thought you might find it helpful to hear a bit more about this: what has happened, what we currently know, and who does what to protect your plate."
        },
        {
            "heading": 2,
            "text": "Food fraud"
        },
        {
            "text": "The FSA was alerted about food fraud allegations linked to cooked beef products from a single supplier in August 2021 and began seizing evidence shortly afterwards. Products from the affected retailer were removed from shelves immediately. We gave advice to industry in December 2021 and May 2022 to do extra due diligence on cooked meat supply chains."
        },
        {
            "text": "In March this year, the FSA received additional intelligence about suspected wider fraud, and possible hygiene issues relating to the same supplier. This led us to execute a warrant at a premises, with the assistance of police and local trading standards and environmental health officers. More evidence was seized and three people arrested."
        },
        {
            "text": "Investigating food fraud in complex supply chains for a prosecution is a painstaking task. When criminal allegations are received, they need to be considered with due process and fairness – which is why we have been unable to name the meat supplier. Our trained investigators are working on behalf of consumers to the standards expected by the College of Policing."
        },
        {
            "heading": 2,
            "text": "Food safety"
        },
        {
            "text": "The additional allegations in March were made about the safety of meat as well as fraud. The respective local authority, which is the relevant enforcement authority of the supplier, has withdrawn approval for the business. Those businesses referred to in the new allegations have been advised of these concerns. They have begun specific sampling relating to these allegations and ended their relationship with the suspect supplier. Food production using meat from this supplier has been stopped in order to ensure that their food is safe."
        },
        {
            "text": "There have been previous occasions when the FSA received intelligence about possible food safety issues at this supplier. The FSA passed these to the local authority in order for them to investigate and resolve."
        },
        {
            "text": "As our statement makes clear, and based on the investigation to date, the FSA and the relevant local authority for the implicated business have no indication that there is unsafe food on the market, or that there is a current increased risk to consumers."
        },
        {
            "text": "In light of the new intelligence, the FSA recently added possible historic food safety concerns to our lines of inquiry for this criminal investigation."
        },
        {
            "heading": 2,
            "text": "Who does what"
        },
        {
            "text": "There are several lines of defence in the food system that keep the public protected."
        },
        {
            "text": "First and foremost, primary responsibility is with businesses. The law says that they must ensure that their food is safe and authentic. There are around 610,000 food premises in England, Wales and Northern Ireland, where the FSA works, representing an industry worth £240 billion of consumer spend. Businesses must have the knowledge and controls to ensure the food they produce, import and sell can be trusted. The food industry works hard to maintain the public’s trust, often using third-party auditors to monitor their supply chains."
        },
        {
            "text": "The second line of defence is the network of 351 local authorities across England, Wales, and Northern Ireland whose environmental health and trading standards officers enforce food safety and standards, such as composition and food labelling, like country of origin. Supported by FSA guidance, each local authority is responsible for determining how risky the business is, and therefore how frequently they should inspect it."
        },
        {
            "text": "The FSA has for some time been concerned about the pressure on local authority resources and its impact on food inspections. In our annual report on food standards, published last year, we highlighted a fall in the level of local authority inspections of food businesses. While local authorities are recovering from the situation we saw during the pandemic, it remains the case that there are many fewer local authority inspectors than there were a decade ago."
        },
        {
            "text": "These concerns were voiced by the FSA Board at successive public board meetings and by the National Audit Office in 2019."
        },
        {
            "heading": 2,
            "text": "The FSA's role"
        },
        {
            "text": "Finally, providing a backstop for these protections, is the FSA. As the national regulator for food, we assure the performance of local authority partners. We do this by monitoring and auditing how local authorities are performing, with quarterly pulse checks reported publicly to the FSA Board. We also audit some local authorities each year."
        },
        {
            "text": "In addition, our National Food Crime Unit (NFCU) investigates and prevents serious food crime where intelligence suggests there might be serious criminal activity.  It also works in support of local authorities."
        },
        {
            "text": "Despite the pressures on local authorities, there is no current evidence of systemic fraud in the food system, of an increase in food safety incidents, or of increased risk to consumers linked to this supplier."
        },
        {
            "text": "We base these judgments on what we can see. It is therefore vitally important that, if you are aware of suspected poor practice, evidence and intelligence are shared with the relevant authorities so that appropriate action can be taken. If you have information about a food crime, please email us at foodcrime@food.gov.uk, phone our Food Crime Confidential hotline on 020 7276 8246 or submit information through the online form on our website."
        },
        {
            "heading": 1,
            "text": "\nDiweddariad i randdeilaid gan yr Asiantaeth Safonau Bwyd ar yr ymchwiliad i dwyll cig"
        },
        {
            "text": "Yn ystod yr ychydig wythnosau diweddaf,  mae un o ymchwiliadau troseddol yr Asiantaeth Safonau Bwyd (ASB) i amheuaeth o dwyll cig wedi sylw yn y wasg, gan arwain at honiadau am dorri rheolau diogelwch bwyd. Rydym wedi bod yn ymchwilio i’r cyflenwr dan sylw ers mis Awst 2021. Nid oes unrhyw arwydd bod bwyd anniogel ar y farchnad ar hyn o bryd."
        },
        {
            "text": "Fel un o’n prif randdeiliaid, roeddwn eisiau rhannu ychydig mwy o fanylion â chi am hyn, gan nodi beth sydd wedi digwydd, beth rydym yn ei wybod ar hyn o bryd, a phwy sy’n gwneud beth i ddiogelu’r bwyd sydd ar eich plât."
        },
        {
            "heading": 2,
            "text": "Twyll bwyd"
        },
        {
            "text": "Cafodd yr ASB wybod am honiadau o dwyll bwyd yn ymwneud â chynhyrchion cig eidion wedi’u coginio gan un cyflenwr ym mis Awst 2021, a gwnaethom ddechrau atafaelu tystiolaeth yn fuan wedyn. Cafodd cynhyrchion gan y manwerthwr dan sylw eu tynnu oddi ar y silffoedd ar unwaith. Y cyngor a roddwyd gennym i’r diwydiant ym mis Rhagfyr 2021 a mis Mai 2022, oedd y dylid gwneud gwaith diwydrwydd dyladwy ychwanegol mewn perthynas â chadwyni cyflenwi cig wedi’i goginio."
        },
        {
            "text": "Ym mis Mawrth eleni, cafodd yr ASB ragor o wybodaeth am dwyll ehangach a amheuir, a phroblemau hylendid posib yn ymwneud â’r un cyflenwr. Arweiniodd hyn at chwilio safle dan warant, gyda chymorth yr heddlu a swyddogion safonau masnach ac iechyd yr amgylchedd lleol. Atafaelwyd mwy o dystiolaeth a chafodd tri o bobl eu harestio."
        },
        {
            "text": "Mae ymchwilio i dwyll bwyd mewn cadwyni cyflenwi cymhleth ar gyfer erlyniad yn dasg araf a manwl. Rhaid ystyried honiadau troseddol yn deg gan ddilyn y broses briodol – a dyna’r rheswm pam nad ydym wedi gallu enwi’r cyflenwr cig. Mae ein hymchwilwyr cymwys yn gweithio ar ran defnyddwyr i’r safonau a ddisgwylir gan y Coleg Plismona."
        },
        {
            "heading": 2,
            "text": "Diogelwch bwyd"
        },
        {
            "text": "Roedd yr honiadau ychwanegol a wnaed ym mis Mawrth yn ymwneud â diogelwch cig yn ogystal â thwyll. Mae’r awdurdod lleol priodol, sef awdurdod gorfodi perthnasol y cyflenwr, wedi tynnu cymeradwyaeth y busnes yn ôl. Mae’r busnesau hynny y cyfeirir atynt yn yr honiadau newydd wedi cael gwybod am y pryderon hyn. Maent wedi dechrau gwaith samplu penodol yn ymwneud â'r honiadau hyn, ac wedi dod â'u perthynas â'r cyflenwr dan sylw i ben. Mae prosesau cynhyrchu bwyd sy’n defnyddio cig gan y cyflenwr hwn wedi’u hatal er mwyn sicrhau bod eu bwyd yn ddiogel."
        },
        {
            "text": "Mae’r ASB wedi cael gwybodaeth am faterion diogelwch bwyd posib yn gysylltiedig â’r cyflenwr dan sylw ar achlysuron blaenorol. Trosglwyddodd yr ASB y materion hyn i'r awdurdod lleol er mwyn iddynt ymchwilio iddynt a’u datrys."
        },
        {
            "text": "Fel y nodir yn glir yn ein datganiad, ac yn seiliedig ar yr ymchwiliad hyd yma, nid yw’r ASB na’r awdurdod lleol perthnasol ar gyfer y busnes dan sylw wedi gweld unrhyw arwydd bod bwyd anniogel ar y farchnad, na bod mwy o risg i ddefnyddwyr ar hyn o bryd."
        },
        {
            "text": "Yng ngoleuni’r wybodaeth newydd, yn ddiweddar ychwanegodd yr ASB yr holiadau hanesyddol o bryderon diogelwch bwyd at ein trywyddau ymholi ar gyfer yr ymchwiliad troseddol hwn."
        },
        {
            "heading": 2,
            "text": "Pwy sy’n gwneud beth?"
        },
        {
            "text": "Mae sawl llinell amddiffyn yn y system fwyd sy’n cadw’r cyhoedd yn ddiogel."
        },
        {
            "text": "Yn y lle cyntaf, busnesau sydd yn bennaf gyfrifol. Mae’r gyfraith yn dweud bod yn rhaid iddynt sicrhau bod eu bwyd yn ddiogel ac yn ddilys. Ceir tua 610,000 o safleoedd bwyd yng Nghymru, Lloegr, a Gogledd Iwerddon lle mae’r ASB yn gweithio, gan gynrychioli diwydiant gwerth £240 biliwn o wariant defnyddwyr. Rhaid i fusnesau feddu ar y wybodaeth a’r rheolaethau i sicrhau y gellir ymddiried yn y bwyd y maent yn ei gynhyrchu, ei fewnforio a’i werthu. Mae’r diwydiant bwyd yn gweithio’n galed i gynnal ymddiriedaeth y cyhoedd, gan ddefnyddio archwilwyr trydydd parti yn aml i fonitro eu cadwyni cyflenwi."
        },
        {
            "text": "Yr ail linell amddiffyn yw’r rhwydwaith o 351 o awdurdodau lleol ledled Cymru, Lloegr a Gogledd Iwerddon, y mae eu swyddogion iechyd yr amgylchedd a safonau masnach yn gorfodi diogelwch a safonau bwyd, fel cyfansoddiad, a labelu bwyd, fel gwlad tarddiad. Wedi’u cefnogi gan ganllawiau’r ASB, mae pob awdurdod lleol yn gyfrifol am benderfynu faint o risg sy’n gysylltiedig â phob busnes, ac felly pa mor aml y dylent arolygu pob busnes."
        },
        {
            "text": "Mae’r pwysau ar adnoddau awdurdodau lleol ac effaith hyn ar arolygiadau bwyd wedi peri pryder i’r ASB ers peth amser. Yn ein hadroddiad blynyddol ar safonau bwyd a gyhoeddwyd y llynedd, gwnaethom dynnu sylw at ostyngiad yn nifer yr arolygiadau o fusnesau bwyd a gynhelir gan awdurdodau lleol. Mae awdurdodau lleol yn dal i adfer ar ôl y pandemig, ac mae llai o arolygwyr awdurdodau lleol nag a oedd ddegawd yn ôl."
        },
        {
            "text": "Mae’r rhain yn bryderon y mae Bwrdd yr ASB wedi’u lleisio mewn nifer o gyfarfodydd bwrdd cyhoeddus, ac fe’u nodwyd hefyd gan y Swyddfa Archwilio Genedlaethol yn 2019."
        },
        {
            "heading": 2,
            "text": "Rôl yr ASB"
        },
        {
            "text": "Yn olaf, mae’r ASB yn darparu cymorth wrth gefn ar gyfer y mesurau diogelu hyn. Fel y rheoleiddiwr cenedlaethol ar gyfer bwyd, ni sy’n sicrhau perfformiad ein partneriaid yn yr awdurdodau lleol. Rydym yn gwneud hyn drwy fonitro ac archwilio perfformiad awdurdodau lleol, gan adrodd yn gyhoeddus ar y gwiriadau rheolaidd a gynhelir bob chwarter i Fwrdd yr ASB. Rydym hefyd yn archwilio rhai awdurdodau lleol bob blwyddyn."
        },
        {
            "text": "Yn ogystal, mae ein Huned Genedlaethol Troseddau Bwyd (NFCU) yn ymchwilio ac yn atal troseddau bwyd difrifol lle mae cudd-wybodaeth yn awgrymu y gallai fod gweithgarwch troseddol difrifol.  Mae hefyd yn gweithio i gefnogi awdurdodau lleol."
        },
        {
            "text": "Er gwaethaf y pwysau ar awdurdodau lleol, nid oes tystiolaeth gyfredol o dwyll systemig yn y system fwyd, cynnydd mewn digwyddiadau diogelwch bwyd, na risg uwch i ddefnyddwyr sy’n gysylltiedig â’r cyflenwr hwn."
        },
        {
            "text": "Rydym yn seilio’r datganiadau hyn ar yr hyn y gallwn ei weld. Mae’n hanfodol bwysig felly, os ydych yn ymwybodol o amheuon ynghylch arferion gwael, eich bod yn rhannu’r dystiolaeth a’r gudd-wybodaeth â’r awdurdodau perthnasol fel y gellir cymryd camau priodol. Os oes gennych wybodaeth am drosedd bwyd, cysylltwch â ni drwy foodcrime@food.gov.uk, drwy ein llinell gymorth Trechu Trosedd Bwyd yn Gyfrinachol ar 020 7276 8246 neu drwy gyflwyno gwybodaeth gan ddefnyddio’r ffurflen ar-lein ar ein gwefan."
        }
    ]
}