{
    "url": "https://nda.blog.gov.uk/day-in-the-life-how-environmental-specialist-david-smith-is-shaping-the-future-at-sellafield/",
    "title": "Day in the life: How environmental specialist David Smith is shaping the future at Sellafield",
    "authors": [
        "David Smith"
    ],
    "categories": [
        "Recruitment",
        "Skills"
    ],
    "pub_date": "2023-04-05T14:01:18+01:00",
    "content": [
        {
            "heading": 2,
            "text": "When did you join the Sellafield Ltd team?"
        },
        {
            "text": "I joined the Sellafield Ltd Graduate Scheme in 2008, as a Graduate Environmental Advisor. Prior to joining I’d studied geography and environmental science at university."
        },
        {
            "text": "In my career I’ve supported a variety of facilities and projects as an environment manager, including some of the highest profile challenges across the global nuclear decommissioning industry."
        },
        {
            "text": "Having spent 10 years in a direct support role, I’ve spent the last few years in a cross-business role as the environmental strategy and development specialist for Sellafield Ltd, leading a team of environmental experts."
        },
        {
            "heading": 2,
            "text": "What does your job involve?"
        },
        {
            "text": "The team and I prepare the business for some of our most significant environmental challenges today, and those expected to emerge in future decades, such as climate change, sustainability, biodiversity, or government and international policy changes."
        },
        {
            "text": "Our responsibilities are varied and can range from delivering our Carbon Management Plan and improving business-wide environmental performance in line with company sustainability targets, through to managing legal obligations like our participation in the national Emissions Trading Scheme."
        },
        {
            "heading": 2,
            "text": "What is a typical day like in your role?"
        },
        {
            "text": "Personally, I feel fortunate to work in an organisation where there is no typical day in the office."
        },
        {
            "text": "In my previous roles with the company, I’ve led teams who’ve directly supported plant operations and projects through the monitoring of environmental discharges and disposals, managed regulator interactions, and assessed impacts from new operations and projects."
        },
        {
            "text": "In my current role I spend time leading on initiatives such as our Carbon Management Plan or Sustainability Portal, while supporting the work of others or attending the company Sustainability Working Group."
        },
        {
            "text": "I also work with a number of external groups and committees, such as the Nuclear Industry Liaison Group’s Sustainability Task Team, involving nuclear operators and regulators from across the UK."
        },
        {
            "heading": 2,
            "text": "How did you get into your current job role?"
        },
        {
            "text": "My passion for the environment is deeply instilled, and it’s something I carry outside of work through my conservation volunteering, so an environmental career seemed inevitable!"
        },
        {
            "text": "To undertake my current role effectively, I lean upon the experience gained from directly supporting some of our complex nuclear facilities over many years."
        },
        {
            "text": "My role also requires a broader knowledge of external events and issues, such as future national and international policies and strategies, and the subsequent potential risks and opportunities this brings to the organisation."
        },
        {
            "text": "Being a Chartered Environmentalist and professional member of an environmental institute is a key enabler to performing my role well."
        },
        {
            "heading": 2,
            "text": "What do you enjoy most about your job?"
        },
        {
            "text": "Being able to work with and learn from world-class experts both within and outside of the organisation is enjoyable in its own right, however it’s the real changes you can make on a project, programme, or throughout the organisation with these people which is most enjoyable."
        },
        {
            "text": "Substantial positive change requires prolonged dedication and collaboration, so whether I’ve worked on a complex technical issue, supported a new operation or project, or set new standards in environmental performance, it’s always been important to enjoy both the collaboration and results equally."
        },
        {
            "heading": 2,
            "text": "What is the hardest part of your job?"
        },
        {
            "text": "When you’re passionate about your area of expertise or achieving your own deliverables, it’s often easy to become blinkered to other views, passions and even constraints, potentially becoming a barrier to success."
        },
        {
            "text": "Therefore, the hardest part of my job has been learning to see other perspectives and balancing all views to create collective outcomes."
        },
        {
            "text": "Ultimately, I’ve learnt that this approach vastly increases the likelihood of success."
        },
        {
            "heading": 2,
            "text": "Why did you decide to pursue this career?"
        },
        {
            "text": "I wanted to spend my career working on some of the greatest environmental challenges we face as a nation."
        },
        {
            "text": "At Sellafield I get to do exactly that."
        },
        {
            "text": "For me, making a career choice aligned to your passion gives you an extra level of motivation every day, and makes you proud of the positive changes you lead or support throughout your career."
        },
        {
            "text": "Seeing a skyline change, a reduction in hazard, or improved environmental performance is all incredibly rewarding."
        },
        {
            "heading": 2,
            "text": "What can this type of job lead on to?"
        },
        {
            "text": "Undertaking a role as an environmental advisor or specialist can lead to many opportunities both within and outside of the organisation."
        },
        {
            "text": "You get to increase expertise within your own field, but also have the opportunity to work with experts in many other disciplines – technical, construction, design, operations, safety case, projects – meaning you’ll not only be steering a sound environmental approach on our facilities and projects but will equally be learning from others."
        },
        {
            "text": "There’s also opportunity to advance your career through Continued Professional Development, whether that’s company financial support to a Professional Membership, or through volunteering as part of our STEM programme or community projects."
        },
        {
            "text": "All of this provides the foundation to build an incredibly meaningful and diverse environmental career."
        },
        {
            "heading": 2,
            "text": "What advice would you give to somebody considering this role as a career?"
        },
        {
            "text": "If you’re a prospective environmental professional, there are few places which can offer the range of environmental challenge and opportunity which Sellafield Ltd brings."
        },
        {
            "text": "Environmental roles range from compliance and waste management, environmental monitoring, land quality, right through to supporting multi-million-pound projects and decommissioning of complex nuclear facilities."
        },
        {
            "text": "So, if you’re looking to make a significant contribution to our company purpose of creating a clean and safe environment for future generations, then an environmental career at Sellafield Ltd provides exactly that."
        }
    ]
}