{
    "url": "https://defrafarming.blog.gov.uk/2023/04/05/how-were-supporting-hedgerow-planting/",
    "title": "How we're supporting hedgerows",
    "authors": [
        "Dr Elspeth Steel"
    ],
    "categories": [
        "Farm visits",
        "Payments to improve tree health",
        "Payments to plant trees and manage woodland"
    ],
    "pub_date": "2023-04-05T11:02:07+01:00",
    "content": [
        {
            "text": "Hedgerows are a crucial feature of our countryside. They can provide a range of benefits: from reducing soil erosion and flooding to providing forage and shelter from the wind for livestock, boosting their health and yield."
        },
        {
            "text": "Last month, members of the team gathered at Hockey’s Farm in Hampshire situated on the edge of the New Forest. Together, we planted 1,500 small trees to establish a new native hedgerow across pastural farmland. "
        },
        {
            "text": "In this post, I'll share more about the day and some of the ways through which we're supporting hedgerows in our schemes."
        },
        {
            "heading": 2,
            "text": "Our visit"
        },
        {
            "text": "Our tree planting was part of a wider project to establish and link up native hedges across multiple farm ownerships throughout the Ogdens valley, connecting existing habitats across the area."
        },
        {
            "text": "At Defra, we are given 3 days a year to volunteer, so we used one of those days to take part. "
        },
        {
            "text": "In short, the treatments were as follows:"
        },
        {
            "text": "All trees were then slot planted."
        },
        {
            "text": "The project partners were landowner Colin Andrews, farmer Crispin Sampson and the Tree Council.  "
        },
        {
            "text": "The planting comprised a native mixed hedge which was compatible with the typical vegetation of the New Forest. "
        },
        {
            "text": "It was a hugely enjoyable day. It was great to see how multiple stakeholders on farm brought benefits to nature, people and the environment. "
        },
        {
            "text": "The weather held out too, which was a plus! "
        },
        {
            "heading": 2,
            "text": "Hedgerows and our environmental land management schemes "
        },
        {
            "text": "We want to increase the length of hedgerows and make the most of the benefits existing hedgerows offer to wildlife, water quality and carbon sequestration. "
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship"
        },
        {
            "text": "Through Countryside Stewardship, we already pay for the management of hedgerows by rotational cutting and leaving some hedgerows uncut (BE3), restorative pruning of fruit trees (BE7) and capital grants to plant and restore hedgerows. "
        },
        {
            "text": "In addition to what is already available, we want to offer a wider range of actions to manage hedgerows. We plan to do this by paying for new actions including: "
        },
        {
            "text": "Hedgerows can link areas of woodland and other habitat so species can move from one habitat to another."
        },
        {
            "text": " They also provide fruit and berries as food for birds and other species and can harbour beneficial insects which predate crop pests to support an integrated pest management approach. "
        },
        {
            "heading": 3,
            "text": "Sustainable Farming Incentive"
        },
        {
            "text": "Under the Sustainable Farming Incentive, we're rolling out 6 new standards this year. One of these will be a hedgerows standard. "
        },
        {
            "text": "The standard contains actions around assessing and recording hedgerow condition, managing hedgerows and maintaining or establishing hedgerow trees. "
        },
        {
            "text": "Together, these actions aim to help farmers to understand and plan management of their hedges, provide habitat and resources for wildlife and provide carbon storage. "
        },
        {
            "heading": 3,
            "text": "Tree Health Pilot"
        },
        {
            "text": "Sadly, the risk of hedgerows being affected by tree pests and diseases is increasing. Farmers and land managers can often find themselves with diseased trees for reasons entirely out of their control. "
        },
        {
            "text": "That is why, through the Tree Health Pilot (which operates in the south-east, north-west and West Midlands), we offer funding to help land managers deal with tree health issues, including in hedgerows. "
        },
        {
            "text": "For those who have hedgerow ash trees affected by ash dieback alongside roads and public footpaths, we pay for:  "
        },
        {
            "text": "This funding is available for groups of land managers led by a facilitator, to support coordinated action by local land managers and to protect neighbouring healthy trees from the risk of pests and diseases. Visit GOV.UK for more information and details of how to apply. "
        },
        {
            "heading": 3,
            "text": "Advice for small farmers dealing with tree health issues "
        },
        {
            "text": "Recognising that some smaller land managers may not be used to dealing with tree health issues, we have bolstered our support. The Tree Health Pilot now offers a new advice package which is available to land managers issued with Statutory Plant Health Notices. "
        },
        {
            "text": "This £475 package contributes to the costs of forestry or land agent advice, a biosecurity kit, signage and training, and will improve land managers' ability to identify and deal with tree health issues.  "
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "A big thank you to the Tree Council for organising the hedgerow planting day for us."
        }
    ]
}