{
    "url": "https://insidehmcts.blog.gov.uk/2023/04/05/how-the-indian-justice-system-and-hmcts-are-working-together-to-share-knowledge-on-justice-reform/",
    "title": "How the Indian justice system and HMCTS are working together to share knowledge on justice reform",
    "authors": [
        "Amar Morjaria - Senior Project Manager, HMCTS Strategy and Change"
    ],
    "categories": [
        "Court and tribunal reform",
        "Working at HMCTS"
    ],
    "pub_date": "2023-04-05T15:53:23+01:00",
    "content": [
        {
            "text": "As the HMCTS reform programme reaches its final stages, I’m continuing to work with Ministry of Justice's (MOJ) International Rule of Law Programme and the Foreign, Commonwealth and Development Office, along with our counterparts in India to share knowledge of our respective justice transformation programmes."
        },
        {
            "text": "Last year, I blogged about a week-long trip to India to better understand how we could best work together and share expertise. Now, after a secondment visit, I want to share some of the things I learned."
        },
        {
            "text": "Before I arrived in New Delhi, the scale of working on a transformation programme in a country with a population of 1.4 billion, across 28 states, was hard to contemplate - particularly when you consider all these states have different elected legislatures and governments."
        },
        {
            "text": "But India is doing just that with its e-Courts project. Started in 2005, it shares a number of similar aims with our own modernisation programme – ultimately to make the justice system more accessible for users."
        },
        {
            "heading": 2,
            "text": "Differences between the Indian and UK justice systems"
        },
        {
            "text": "Each Indian state has a High Court, with the Supreme Court working nationally at the top. The federal system in India means that each state’s High Court can choose whether to adopt the e-Courts system, which differs from the HMCTS approach where we’re developing national reformed services."
        },
        {
            "text": "In practice, this means that reformed digital systems in India vary according to a given state’s additional investment and development, as well as being configured for different languages and practices."
        },
        {
            "text": "Although this is recognised as a challenge, it’s seen as a practical solution to operating in a federal structure, with a common module providing a national view of disposals and backlogs."
        },
        {
            "text": "The other major difference is that administration of Indian courts is managed by the judiciary themselves. The driving force behind the e-Courts project is the Supreme Court’s e-Committee, a group of judges headed by the Chief Justice of India. They’re responsible for developing the strategy as well as the delivery and implementation of digital-led court reforms."
        },
        {
            "heading": 2,
            "text": "Sharing knowledge about our respective reform efforts"
        },
        {
            "text": "One of the first things that struck me (and on one level is quite reassuring), is that aside from the obvious differences in population and culture, our shared experiences of delivering reform have - at times - presented challenges for both countries."
        },
        {
            "text": "Both India and the UK have a similar set of deliverables for reform. For the Indian e-Courts project this started with providing infrastructure to buildings such as Wi-Fi connectivity, laptops and screens."
        },
        {
            "text": "They’re aiming for an end-to-end digital journey for cases, and so far, have built a Case Information System that deals with all case types, that links to an e-Filing module. Like the Common Platform here that deals with criminal cases, the system links to partners across the criminal justice system to increase efficiency. There are also facilities for video hearings, like ours in the UK."
        },
        {
            "text": "A significant challenge for India is that there’s no HMCTS-equivalent organisation. This means that senior judges can spend up to half of their time on the administration of the courts, rather than on their judicial duties."
        },
        {
            "text": "We have discussed our model with them, outlining the benefits of having a specialist organisation that administrates courts, which has been met with a lot of interest."
        },
        {
            "text": "This issue is particularly pressing with regards to the third phase of the e-Courts project being approved with a budget of £700 million to be delivered over the next 4 years. The need for project management, implementation and change management expertise to support the judiciary has been recognised."
        },
        {
            "heading": 2,
            "text": "Learning from the Indian e-Courts project"
        },
        {
            "text": "In India, a transformation which is possibly further on from HMCTS reform, is their fully virtual court which has been built for lower-level offences. For example, with traffic offences, Delhi High Court has a virtual traffic court set up. Where previously it would take around 40 judges to handle the volume of cases, it now takes 2."
        },
        {
            "text": "India has also developed 3 mobile apps as part of its e-Courts project, including:"
        },
        {
            "text": "There are around 30 developers that work on the e-Courts project and have built the digital infrastructure using free and open-source software to keep costs low."
        },
        {
            "text": "Although this approach comes with risks around security, scalability and stability, they have been able to build up a system which is flexible to their own requirements and investigate new technologies and platforms as they develop."
        },
        {
            "text": "There’s an openness in India to exploring the applications of artificial intelligence within the justice system, which they have ambitions to implement over the next couple of years."
        },
        {
            "text": "One area being looked at, is a tool to translate English language court judgments from the Supreme Court and High Courts into Hindi and 25 other languages used across the country."
        },
        {
            "text": "Further to this, a tool to assist the searching of legislation and past judgments is being tested, aiming to reduce the time taken to conduct this research."
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "The collaboration between the UK MOJ,  HMCTS reform programme and the Indian e-Courts project was solidified at a recent India-UK Dialogue on Court Administration, Reform and Digitisation. "
        },
        {
            "text": "MOJ Second Permanent Secretary Jo Farrar, the Hon. Mrs Justice Cheema-Grubb of the High Court and the senior responsible officer for HMCTS reform, Gemma Hewison, virtually joined me in reflecting on our respective transformation journeys with our counterparts in the Indian Ministry of Law and Justice and Judiciary.  "
        },
        {
            "text": "Over the coming months, an Indian delegation will travel to the UK to observe the implementation of reform to date, see first-hand the HMCTS model in action, and meet various functional teams to share lessons learned from across India and the UK. "
        }
    ]
}