{
    "url": "https://insidedio.blog.gov.uk/2023/04/05/how-is-a-rugby-legend-helping-keep-the-public-safe-on-mod-land/",
    "title": "How is a rugby legend helping keep the public safe on MOD land?",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Armed Forces",
        "British Army",
        "Defence Training Estate (DTE)",
        "Public safety",
        "Salisbury Plain Training Area"
    ],
    "pub_date": "2023-04-05T09:30:25+00:00",
    "content": [
        {
            "text": "Mike on Salisbury Plain Training Area, kitted up ready for a ride in a Warrior armoured vehicle. [Crown Copyright / MOD 2023]Last month DIO’s Corporate Communications team invited England Rugby legend and ‘I’m a Celeb’ contestant Mike Tindall to Salisbury Plain Training Area (SPTA) to help us promote our ‘Respect the Range’ public safety campaign."
        },
        {
            "text": "‘Respect the Range’ is DIO’s biggest behavioural change campaign and is designed to raise the public’s awareness and understanding of the risks to personal safety when accessing military land. Risks include live firing, unexploded ordnance and fast-moving military vehicles.  "
        },
        {
            "text": "The public are encouraged to enjoy the beautiful countryside that we are proud to steward and maintain, however it’s important that they only access the land when and where it is safe to do so.  "
        },
        {
            "heading": 2,
            "text": "What has Mike Tindall in a Warrior got to do with public safety? "
        },
        {
            "text": "We arranged for colleagues in 5 Rifles, an Armoured Infantry battalion based in Bulford, to take Mike out on the training estate in a Warrior Armoured Vehicle.  "
        },
        {
            "text": "Mike got to experience first-hand what it was like to be in a 25 tonne military vehicle moving at speed and witness the very-real risks that people can face when accessing military training areas.  "
        },
        {
            "text": "Mike prepares for his Warrior ride. [Crown Copyright / MOD 2023]We captured Mike’s experience and reflections from the day and produced a short video for the media and social channels. The video’s aim was to bring to life in an engaging way the dangers that the public can face if they access our training areas when and where it’s not safe to do so. "
        },
        {
            "text": "In a world of the 24-hour news cycle and over-saturated social media feeds, a big challenge communicators face is how to ensure our content cuts through the noise and engages audiences.  "
        },
        {
            "text": "By working with Mike Tindall, a well-known and respected public figure with a considerable online presence and following, we hope to reach and engage existing and new audiences with our important safety messaging.  "
        },
        {
            "heading": 2,
            "text": "Shoot day  "
        },
        {
            "text": "As you can imagine a project like this takes months of meticulous planning. Everything needs to be considered from scoping out the best filming locations, developing storyboards to briefing those featuring in the video. "
        },
        {
            "text": "We started our day with a safety brief in Bulford Camp’s vehicle park and got Mike kitted up ready to go out in the Warrior. Filming took place on a bitterly cold and windy day in February. Those familiar with Salisbury Plain will know there is little chance of hiding from the elements out there and Mike was going to be particularly exposed stood in the Warrior turret.  "
        },
        {
            "text": "Mike, who we were relieved to discover was indeed the down to earth and friendly guy we all imagine, received no VIP treatment. He happily stayed outside with our Warrior Commander and Driver team all day, getting a real experience of military training. Luckily all those years on the rugby pitch seemed to have prepared him well as he took the day and the unforgiving Wiltshire weather in his stride. "
        },
        {
            "heading": 2,
            "text": "Collaborative success "
        },
        {
            "text": "One of the biggest challenges of a project like this is liaising with and managing all the various stakeholders that need to be involved to make it happen. We worked closely with Creative Agency 23 Red and LDR Media to help bring our vision to life. Their industry knowledge and expertise proved invaluable to making the most of this opportunity and ensuring a high-quality finished product. "
        },
        {
            "text": "Behind the scenes Mike Tindall runs the messages he needs to get across. [Crown Copyright MOD 2023]We were also lucky to have amazing support from colleagues across Defence. This included DIO’s Defence Training Estate team, Army Communications and 5 RIFLES who all provided support, advice, and guidance. Without them the day could not have happened.  "
        },
        {
            "text": " It has been an interesting and unique project to work on and it is great to see how our work in communications helps to support our Armed forces to safely train.  "
        },
        {
            "heading": 2,
            "text": "The Respect the Range campaign   "
        },
        {
            "text": "You can read more about Mike’s visit to SPTA and the Respect the Range Campaign on the gov.uk website. But if you take one thing away from the campaign, please let it be the following simple steps you can take when visiting MOD land to help keep you and our Armed forces safe: "
        },
        {
            "text": "If we all work together to use these spaces with respect and consideration, the public will stay safe, and our Armed Forces will be protected during their important training exercises. Your safety is our top priority."
        }
    ]
}