{
    "url": "https://educationhub.blog.gov.uk/2023/04/05/new-year-and-kings-birthday-honours-how-to-nominate-someone-who-is-making-a-difference/",
    "title": "New Year and King’s Birthday Honours: How to nominate someone who is making a difference",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Further education",
        "Schools"
    ],
    "pub_date": "2023-04-05T17:31:07+01:00",
    "content": [
        {
            "text": "Every year, people who have made a significant contribution to public life through vital and extraordinary work are recognised with an honour awarded by the King."
        },
        {
            "text": "Most of the awards are given to those who have been nominated by a colleague or member of the public, and are then recommended by the Prime Minister or senior Government Minister."
        },
        {
            "text": "Anyone can nominate someone to be considered for an honour and we’re encouraging those who work or volunteer in education and childcare to put forward peers and colleagues who have made an outstanding contribution. Here’s how you can get involved."
        },
        {
            "heading": 3,
            "text": "What are honours awards?"
        },
        {
            "text": "Nominating someone for an honour is a way to recognise those who are making a positive impact through their service, going above and beyond in their role."
        },
        {
            "text": "Receiving an honour can be life changing. It’s an opportunity to spotlight important causes and celebrate those who are working to make society a better place."
        },
        {
            "text": "There are different types of honours awards, ordered by rank. For example:"
        },
        {
            "text": "Activist Benjamin Lindsay received an OBE in 2023 for his work at Power the Fight, a charity which tackles violence affecting young people. He said of an OBE: “It’s for all the unsung heroes working tirelessly to make sure communities are safe. I felt it was something that would shine a spotlight on the work that we do and the causes we are trying push.”"
        },
        {
            "heading": 3,
            "text": "Who can be nominated for an honour?"
        },
        {
            "text": "While all nominations for people who have been extraordinary or made life better for others are welcome we are especially encouraging nominations from the following categories:"
        },
        {
            "text": "Those who received a New Year’s honour for services to education included Shirley Irlham BEM, a lunchtime supervisor at Wistaston Academy in Crewe; Principal at Newham Collegiate Sixth Form Centre, Mouhssin Ismail OBE; and Paula Hudgell OBE, a foster carer and campaigner. Further examples of recent nominees are available here."
        },
        {
            "heading": 3,
            "text": "How do I nominate someone for an honour?"
        },
        {
            "text": "Anyone can nominate someone for an honour. Nomination forms should be completed online, at this link. It’s a simple online process – applicants will need two supporting letters to back up their nomination."
        },
        {
            "text": "Advice on writing a successful nomination is available here."
        },
        {
            "text": "It is important that the person nominated is not made aware they have been put forward and the process is completed in the strictest of confidence."
        },
        {
            "heading": 3,
            "text": "When is the deadline to nominate someone for an honour?"
        },
        {
            "text": "There is no formal deadline to make a nomination, but to be considered for an honour in 2024, it’s best to submit nominations as soon as possible."
        },
        {
            "text": "Applications may roll over for consideration in a future round."
        },
        {
            "heading": 3,
            "text": "When will I find out if my nomination has been successful?"
        },
        {
            "text": "The process takes a long time, so don’t be disheartened if your nominee is not honoured at the next round. It can take 12 to 18 months to work its way through the system."
        },
        {
            "text": "All nominees will be checked by various government departments to make sure they’re suitable for an honour. This may include checks by HM Revenue and Customs."
        },
        {
            "text": "The independent honours committee reviews those nominations that they receive and select the outstanding individuals to be awarded."
        },
        {
            "text": "The person nominated is then sent a letter to confirm that they have been awarded an honour."
        }
    ]
}