{
    "url": "https://deframedia.blog.gov.uk/2023/04/05/the-integrated-plan-for-water/",
    "title": "The Integrated Plan for Water",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water",
        "Weekly stories"
    ],
    "pub_date": "2023-04-05T15:18:34+01:00",
    "content": [
        {
            "text": "There has been widespread coverage across print, broadcast, online and trade media outlets on the government’s Plan for Water."
        },
        {
            "text": "The Plan for Water covers both the water environment – how clean it is – and water resources – how much of it we have. It brings together the significant action already taken, along with more investment, stronger regulation and tougher enforcement on those who pollute."
        },
        {
            "text": "It includes action to tackle every single source of pollution – storm overflows, agriculture, plastics, road run-off and chemicals – as well as the pressures on our water resources. New action includes:"
        },
        {
            "text": "There has been national coverage on the Plan including in The Telegraph, The Times, BBC News, iNews, Daily Mail, The Independent, The Sun, ITV News and the Daily Mirror, as well as the Sheffield Star, Eastern Daily Press and Western Morning News."
        },
        {
            "text": "In a comment piece in The Telegraph, Environment Secretary Thérèse Coffey shared how our Plan for Water will meet the challenges faced by our complex, interconnected water system – including a growing population and a changing climate."
        },
        {
            "text": "Secretary of State Thérèse Coffey said: "
        },
        {
            "text": "Water Minister Rebecca Pow said:"
        },
        {
            "text": "Environment Agency Chair Alan Lovell said:"
        },
        {
            "text": "Natural England Chair Tony Juniper said:"
        },
        {
            "text": "A Rivers Trust spokesperson said:"
        },
        {
            "text": "Chairman of the Environmental Audit Committee Philip Dunne MP said:"
        },
        {
            "text": "A Water UK spokesperson said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}