{
    "url": "https://defradigital.blog.gov.uk/2023/04/05/what-its-like-being-on-planet-earth-when-youre-from-planet-autistic/",
    "title": "What it’s like being on Planet Earth when you’re from Planet Autistic",
    "authors": [
        "David Waller"
    ],
    "categories": [
        "Data Transformation"
    ],
    "pub_date": "2023-04-05T14:59:32+01:00",
    "content": [
        {
            "text": "As people around the world marked World Autism Awareness Day on Sunday 2nd April, David Waller shares his own experiences of being diagnosed with the condition relatively late in life."
        },
        {
            "text": "It’s just over five years ago that I was diagnosed as being autistic, when I was in my early 50’s.  This was unusual because assessments are usually conducted for younger people when it can make a big positive difference to their chances in life.  At one point during my diagnosis, the medical practitioner said something along the lines of: ‘Good grief, how have you survived up to now?’"
        },
        {
            "text": "My late diagnosis came about because I was experiencing performance difficulties at work, which if left unchecked would likely have led to disciplinary proceedings, or worse, and my manager suggested that I have an occupational health assessment.  That assessment indicated that I might be autistic and so it led to my applying for a formal assessment.  And, here I am!"
        },
        {
            "text": "Only 16% of autistic people are in full-time employment.  This employment gap has been described as a scandal, and last August, the UK Government pledged £7.6m to help fill this gap."
        },
        {
            "heading": 2,
            "text": "Me, my autism, and my dog"
        },
        {
            "text": "Autism affects different people in different ways, which is why it’s difficult to diagnose.  So, let me tell you what my autism means for me."
        },
        {
            "text": "Before I do that, I’ll introduce you to Revel, my dog in the photo with me.  He’s my best and most loyal friend.  He’s really my mum’s dog, but I regard him as my dog.  He’s a ‘rescue dog’ and my parents gave him a loving home about four years ago and he’s 13 years old now."
        },
        {
            "text": "He’s become deaf in the last couple of years, so when I’ve been with him at weekends, I’ve taught him sign language and I can call him to me from a quarter of a mile away, just by raising my hand.  Who says you can’t teach an old dog new tricks?  Hope for me yet, then J"
        },
        {
            "text": "Ok, back to what autism means for me. I don’t feel that I fit in this world, I feel like I’m from another planet; hence the title I chose for this blog!  I am not a social person – I find social and work situations where I’m meeting people awkward."
        },
        {
            "text": "At work, I notice this trait mostly at meetings, even with colleagues I’ve known for years.  I find it difficult to interject at meetings, as I’m trying to work out what I want to say and then the best time to say it and often, by the time I’ve done that, the conversation has moved on and I’ve missed the opportunity."
        },
        {
            "text": "Or I’ll interject at the wrong moment to my embarrassment.  MS Teams meetings with the electronic ‘hand up’ flag have been one of the bonuses for me to come out of the covid pandemic, as that has been really helpful."
        },
        {
            "text": "Just one thing with Teams meetings, which is common among people who are neuro diverse, is that blurred backgrounds are not good and they affect me so much that I can’t concentrate on what the speaker is saying and within a few seconds they give me a severe headache."
        },
        {
            "text": "I like to see people live in Teams meetings and, as a reasonable adjustment, I just ask that the blurred background is replaced by a real or fake background.  You wouldn’t believe the huge difference to the quality of my working life that this simple adjustment makes to me and others who are neuro diverse. It turns me from being disabled to being enabled."
        },
        {
            "text": "As I’m not comfortable in social situations with people, my autism isolates me.  If I had the choice, I wouldn’t live with me."
        },
        {
            "heading": 2,
            "text": "Job interviews - what a nightmare!"
        },
        {
            "text": "Interviews for jobs that I’ve applied for are a nightmare.  I know they’re not easy for anyone, but for me they’re devastating.  For one thing, I’m no good at thinking on my feet and I’m always like the rabbit caught in the headlights at interview!  Also, you’re tested at interview as to whether your strengths listed in the success profiles are a natural ability or learned behaviours.  I can tell you that all of my strengths and any other behaviours I have are learned behaviours; none comes naturally to me."
        },
        {
            "text": "I hear and read things literally and act accordingly.  At interviews, when I’ve been asked: ‘Can you tell me of a time when you’ve had to take a certain action’, my immediate thought is to answer ‘Yes”, as it is a ‘yes’ or ‘no’ question, and then wait for the panel to ask me to give further details."
        },
        {
            "text": "I’ve learned that when someone asks if I can do something, they’re usually not asking whether I’m capable of doing whatever it is that they’re asking, but that they’re asking will I do it."
        },
        {
            "text": "One of my favourite jokes is:  ‘A man is walking across a field and falls down a deep hole and is stuck.  He calls out:  'Help, Help, can anyone help me? A man walking nearby says 'yes' ... and then walks on’.  I’ve learned not to walk on."
        },
        {
            "text": "A common symptom of autism is insomnia and I suffer that every day.  For as long as I can remember, I have not slept through the whole night, often waking at 1am or 2am and being awake for 2 or 3 hours or not sleeping at all after then.  So, quite often when I start work, I’ve been awake for 7 or 8 hours.  It’s often debilitating, and, at times, it is very depressing.  Sometimes, I’ll do some household chores, so that I derive a benefit from my insomnia and turn it from being a curse to a blessing."
        },
        {
            "heading": 2,
            "text": "Memorising numbers, that's my thing"
        },
        {
            "text": "It’s not all negative though.  my autism gives me abilities that I wouldn’t otherwise have.  For example, in just a few minutes I memorised my 48-digit bitlocker pin recovery pass code.  The same goes for my various bank cards with different PIN numbers.  I also know the random numbers and my different passwords for logging into my bank, mortgage, savings etc  accounts."
        },
        {
            "text": "I’m not boasting here – I give this as a statement of fact, as this is nothing for me to boast about; it’s a gift I was born with and is not as a result of anything I’ve done (1 Corinthians 4:7).  Data Security experts tell us not to have the same PIN for different cards or the same password for different accounts, which leads me to my next positive symptom of autism."
        },
        {
            "text": "My job involves explaining to colleagues what the data protection laws require.  I’m not a lawyer, but I’m able to read complex laws, understand them and put them in layman’s terms and I can recall the Article and section numbers.  I’m certain that my autism gives me the ability to do that with ease."
        },
        {
            "heading": 2,
            "text": "Autism is who I am"
        },
        {
            "text": "I was horrified to read in the media a few months ago that a medical team was working on a ‘cure’ for autism.  I don’t want my autism to be cured; I don’t believe that autism is a condition that should or needs to be ‘cured’.  Without my autism, I wouldn’t be the person I am or that I would have the abilities that I have."
        },
        {
            "text": "Autism is a condition that people from all walks of life are born with, and it needs to be embraced by people in general, by friends, relatives and, most of all, by employers and colleagues.  We have a lot of positive qualities to give."
        },
        {
            "text": "I can’t end this blog without giving a great shout of praise to my managers and my colleagues as they have all been very understanding and supportive of me.  Without them, I wouldn’t have been able to have achieved the work successes that I have achieved, or be as happy in my job as I am.  I couldn’t have wished for a better team to be in, or a better employer than Defra to work for."
        },
        {
            "text": "And I extend my praise to everyone I’ve been in contact with throughout the Defra group – I make no secret of the fact that I am autistic (it isn’t a secret; it is who I am). Everyone has shown me great understanding and been of immense help to me.  Thank you to all of them."
        }
    ]
}