{
    "url": "https://insolvencyservice.blog.gov.uk/2023/04/05/what-you-need-to-know-about-bankruptcy/",
    "title": "What you need to know about bankruptcy",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Bankruptcy",
        "Debt management",
        "Debt solutions"
    ],
    "pub_date": "2023-04-05T16:16:14+01:00",
    "content": [
        {
            "text": "If you can’t pay your debts, there are various solutions that can help, ranging from: informal solutions like a consolidation loan or a debt management plan to formal solutions like a debt relief order, individual voluntary arrangement (IVA) or bankruptcy."
        },
        {
            "text": "It is important to seek free debt advice from a money adviser before making any decision on debt solutions. Free advice can be sought from: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "text": "One way of dealing with debt is bankruptcy. But does bankruptcy mean ruin or reset? What happens, from start to finish? And what might be the impact of bankruptcy on your life?"
        },
        {
            "text": "Here we look at the fears, facts and features of bankruptcy to help you understand whether it might be the right or wrong solution for you."
        },
        {
            "heading": 3,
            "text": "What bankruptcy is"
        },
        {
            "text": "Bankruptcy is a legal process designed to help get a financial fresh start where you won’t have to repay all of your debts, although this will depend on your circumstances."
        },
        {
            "text": "When you are declared bankrupt, you enter a legal process which comes with restrictions. The restrictions are about borrowing money, managing or being director of a company, the name of a business you trade and doing certain jobs. Breaking the restrictions is against the law."
        },
        {
            "text": "You can also be asked to make payments or contributions towards your debts after the bankruptcy has started."
        },
        {
            "text": "In most bankruptcies the person applies to make themselves bankrupt. However, sometimes creditors (the people or organisations that you owe money to) can apply to court to make you bankrupt if you can’t repay your debts."
        },
        {
            "text": "Bankruptcy is a matter of public record. All bankruptcies are published in an official public record called The Gazette, and also in the Individual Insolvency Register. Anyone can search these online. Your details will usually be removed from the register after 15 months but remain in The Gazette. If you are at risk of violence you can apply for a court order, known as a Person At Risk of Violence Order, to stop your address being published."
        },
        {
            "text": "Bankruptcy is available for people in England and Wales. The process to become bankrupt is different if you live in Scotland or live in Northern Ireland."
        },
        {
            "text": "Bankruptcy is a serious step. You must hand over control of your assets – the things that you own – to the person managing your bankruptcy. Your home, car and other valuable belongings could be sold to pay your debts."
        },
        {
            "text": "Certain assets can be exempt from being sold, including essentials such as household equipment, furniture, bedding, clothes and tools/equipment/vehicle needed for your job."
        },
        {
            "text": "You might have to make monthly contributions towards your debts from any income you have left over after you’ve paid necessary living costs too."
        },
        {
            "text": "Assets that come into your possession after bankruptcy can, in some circumstances, be claimed to pay your debts."
        },
        {
            "text": "It is important to seek free debt advice from a money adviser before making any decision on problem debt solutions. Free advice can be sought from: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "heading": 3,
            "text": "What bankruptcy is not"
        },
        {
            "text": "Bankruptcy is not just being unable to pay your debts (which is called insolvency). Bankruptcy is a legal process."
        },
        {
            "text": "Bankruptcy is not permanent. Bankruptcy restrictions usually last for 12 months, although it stays on your credit record for six years. Bankruptcy can be extended beyond a year if you don’t cooperate with the person managing your bankruptcy (known as your trustee) or if you’re found to have acted carelessly or dishonestly."
        },
        {
            "text": "Bankruptcy is not the only way out of debt or insolvency. Talk to a debt advisor to see if other solutions may suit you better. Find out more about options for dealing with money worries here."
        },
        {
            "text": "Bankruptcy is not the best solution for everyone. Bankruptcy is best suited to people who have little chance of paying off their debts in a reasonable time and who are not eligible for a Debt Relief Order."
        },
        {
            "text": "Bankruptcy is not the quickest way out of debt. Although bankruptcy normally lasts for a year, you can be required to make payments from your income for  three years.  It can also take longer to deal with some assets."
        },
        {
            "text": "Bankruptcy is not free to apply for. It costs £680 to apply to become bankrupt. Bankruptcy application fees can be paid online and in instalments."
        },
        {
            "text": "Bankruptcy is not a magic solution. Going into bankruptcy is a major decision, as its consequences can affect you for years afterwards."
        },
        {
            "text": "Bankruptcy is not the end of the financial road: If you have no alternative way out of insolvency, bankruptcy can reset your finances and free you from debts you cannot pay."
        },
        {
            "heading": 3,
            "text": "Who can be made bankrupt?"
        },
        {
            "text": "A bankruptcy order can be made for one of three reasons:"
        },
        {
            "heading": 3,
            "text": "What happens when you are made bankrupt?"
        },
        {
            "text": "When you’re made bankrupt, you must hand over control of your assets to a trustee, who is the person appointed to manage your bankruptcy. To begin with this will usually be an Official Receiver – an officer of the Court employed by the Insolvency Service – who manages your bankruptcy."
        }
    ]
}