{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/19/a-year-of-transforming-englands-planning-system/",
    "title": "A year of transforming  England’s planning system ",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Data",
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2025-12-19T11:29:40+00:00",
    "content": [
        {
            "text": "We're wrapping up another year for the MHCLG Digital Planning Programme – and what a year it’s been.  "
        },
        {
            "text": "Our journey to transform England's planning system has continued with new partnerships, innovations and momentum, building on foundations laid over recent years. Everything we do is aimed at giving our communities a planning system that is data-driven, more efficient and accessible, and supporting the government’s mission to deliver 1.5 million homes this Parliament. "
        },
        {
            "text": "Huge thanks to the incredible network of Local Planning Authorities (LPAs) and partners in Open Digital Planning (ODP), the wider planning community, other government departments and colleagues at MHCLG. Your collaboration has been integral to our progress. "
        },
        {
            "text": "This isn't about technology for technology's sake. It's about empowering the people and organisations that make planning happen every day.  "
        },
        {
            "text": "We've organised this year's highlights around the different groups we've worked to support – local authorities and tech companies, developers and the public. "
        },
        {
            "heading": 2,
            "text": "Supporting Local Planning Authorities "
        },
        {
            "text": "Planning and digital professionals in local authorities are at the heart of what we do. We’re equipping them with the technology and support they need to make digital transformation business as usual. "
        },
        {
            "heading": 3,
            "text": "Open Digital Planning – sector-led improvement "
        },
        {
            "text": "ODP is our cross-sector transformation network, bringing together almost 200 forward-thinking councils to share best practice, increase data availability, adopt modern planning services and strengthen digital capabilities. Together ODP is creating a more efficient, data-driven and transparent planning system to better serve communities. A highlight was the recent event hosted by Medway Council, when more than 170 attendees from 57 councils gathered to share progress and insights. "
        },
        {
            "heading": 3,
            "text": "Supporting plan-making "
        },
        {
            "text": "Planning authorities have told us they need clearer guidance, consistency and more practical tools to speed up plan-making. In February we published a new dedicated home for plan-making resources on GOV.UK. ‘Create or update a local plan’ now acts as a central hub bringing together user-tested guidance and templates in one place. "
        },
        {
            "text": "Last month we added to the content by publishing the first release of draft guidance for the new plan-making system. This guidance will grow into a trusted resource for planners across England, providing clarity and support on critical areas including site selection, consultation, evidence production and how to structure and present a local plan to make it clear and accessible for everyone. Early testing is already showing the impact – 83% of users told us the guidance gave them greater confidence in meeting Planning Inspectorate expectations, which is exactly what we set out to achieve. "
        },
        {
            "heading": 3,
            "text": "Making planning data consistent and accessible  "
        },
        {
            "text": "The Digital Planning Improvement Fund now supports 122 LPAs to publish data to the Planning Data platform – 70 of these joined this year. Through the fund and dedicated support, participating authorities join ODP and are accelerating the pace at which they publish their data, enabling data-driven decisions and accessible information.  "
        },
        {
            "text": "New authorities begin their journey with the Digital Planning Maturity Assessment – a tool that helps council teams understand their digital strengths and areas to improve. We're increasingly seeing LPAs return to repeat the exercise and track their progress. "
        },
        {
            "heading": 3,
            "text": "Using artificial intelligence (AI) to speed up data creation "
        },
        {
            "text": "Extract – the AI tool we’re developing with the Department for Science, Technology and Innovation’s (DSIT), Incubator for Artificial Intelligence (iAI) –  was chosen to be part of the Prime Minister's AI Exemplar programme. It will help councils to digitise their planning maps and documents in minutes rather than hours – speeding up the time it takes to make consistent planning data and publish it openly to help make planning decisions and create local plans. 5 councils are now alpha testing the tool, with more to join private beta testing in the new year. Better access to high-quality data will help developers and councils realise the housing potential of land and make England's planning system more transparent. "
        },
        {
            "heading": 3,
            "text": "Developing a spatial approach to infrastructure planning with better data and tools "
        },
        {
            "text": "We are developing the ALIGN spatial tool (government's national infrastructure spatial tool), in collaboration with the National Infrastructure and Service Transformation Authority, so that local and central government will have a consistent way to test how policies, strategies and decisions interact spatially with infrastructure and to understand spatial trade-offs.  "
        },
        {
            "text": "A single digital platform it brings together strategies, data and tools,  including AI, to identify local infrastructure needs and constraints for housing, industrial growth and land use scenarios. It is already supporting the government's growth agenda and place-based investment decisions, the 10-Year Infrastructure Strategy and aims to support Spatial Development Strategies. "
        },
        {
            "heading": 3,
            "text": "Proving the impact of modern planning software "
        },
        {
            "text": "Once their data is digitised, LPAs can adopt modern digital planning software  to process applications more efficiently, using products such as PlanX – now live in 16 LPAs and the Back Office Planning System (BOPS) – with live pilots in 4 LPAs. These tools have been developed 'by planners, for planners'. This year, Medway Council, London Borough of Camden, London Borough of Barnet and London Borough of Lambeth have been involved in  end-to-end pilots collecting valuable monitoring data to evaluate these ODP products. Results show significant efficiency gains – 40% time savings when  validating and assessing householder applications. In Lambeth this translates  to 35 minutes saved per application.  "
        },
        {
            "heading": 3,
            "text": "Solving real problems together "
        },
        {
            "text": "The 2-day Local Government Innovation Hackathon in Leeds, organised in partnership with Government Digital Service (GDS) and i.AI, brought together 150 planners, technologists and digital leaders, to tackle real-world planning challenges. Winning teams demonstrated their tools to Feryal Clark MP, when she was Minister for AI and Digital Government and have worked with i.AI engineers to discuss routes to scale their ideas.  "
        },
        {
            "heading": 3,
            "text": "Making digital tools easier to adopt   "
        },
        {
            "text": "Only 17% of LPAs believe they have the skills and knowledge to identify the right available digital planning tools. To address this, we seed-funded and launched the Digital Planning Directory, with the Digital Task Force for Planning, bringing all the digital planning suppliers together in one place. It  now lists 121 digital service providers and has reached 36,000 users. Over the course of the year, the Directory has also organised a series of 'must see' online show and tells with LPAs demonstrating what's possible – all available to watch back.  "
        },
        {
            "text": "Through our engagement with LPAs and suppliers and recent roundtables organised as part of our PropTech Growth programme, with the UK PropTech Association (UKPA), we know that procurement is a significant hurdle for adopting new technology. Last month the Directory launched a Procurement Resource Hub, and a benefits calculator based on the results from our innovation pilots, helping authorities make the business case and accelerate the adoption of digital planning tools. "
        },
        {
            "text": "We’ve published some case studies showing the art of the possible  from Round 4 of the PropTech Innovation Fund:  "
        },
        {
            "text": "Following on from Round 4, 22 LPAs are completing work on 12 pilots – demonstrating scalable solutions that can unlock sites and speed up plan-making processes.  We’ll soon be receiving their practical implementation guides which we’ll share, providing authorities with another resource to help them confidently adopt innovative technology.   "
        },
        {
            "heading": 2,
            "text": "Supporting technology companies "
        },
        {
            "heading": 3,
            "text": "Supporting property technology sector growth "
        },
        {
            "text": "Our commissioned Opportunity for PropTech report, published by the UK PropTech Association (UKPA) and PUBLIC earlier this year, shows the sector has the potential to grow by 20% by 2032 and generate revenue of approximately £72bn. To support this growth, we have evolved our approach with a series of partnerships, working with the Digital Task Force for Planning on the Digital Planning Directory, Geovation (part of Ordnance Survey), and the UKPA, to improve underlying market conditions."
        },
        {
            "heading": 3,
            "text": "Creating open, standardised planning data "
        },
        {
            "text": "Technology companies need reliable, standardised planning data to build services that modernise planning. Our research however reveals critical barriers with inconsistent data standards and excessive time spent scraping and cleaning data. As one start-up told us, they want to spend time \"working with the data, not trying to make the data work\". "
        },
        {
            "text": "Our Planning Data platform is addressing this, with at least 5 companies starting to use the platform’s data this year. It now hosts more than 400  datasets from England's LPAs, attracting 1.2 million weekly visitors and 20 million monthly hits – 4 times greater than this time last year. Richard Pope, author of Platformland, has highlighted the platform as an exemplar for UK government digital transformation – a 'template' to create better digital services and unlock private sector innovation. "
        },
        {
            "text": "The platform’s open, standardised data is driving the development of modern planning software and supporting authorities with their local plan monitoring and delivery. We have also made significant progress on a data standard for planning application submissions and decisions, working with stakeholders in a data standards community. This will enable all LPAs to record and share information about planning applications consistently, providing a national picture of development. We’ve been testing the emerging data standards with established software suppliers. Technology companies will be able to  use this standard to build new tools and scale them nationally."
        },
        {
            "heading": 2,
            "text": "Supporting developers  "
        },
        {
            "heading": 3,
            "text": "Reducing planning costs and overcoming key challenges "
        },
        {
            "text": "Many of our interventions directly support developers and other planning applicants. Better planning data helps to reduce the costs of bringing forward development by making information about site constraints available so they can identify sites and assess viability faster.  "
        },
        {
            "text": "Developers are also key partners in the PropTech Innovation Challenge, which we’re delivering with Geovation and aims to unlock housing delivery at scale. With £1.2 million of funding, 12 technology companies are working on pilots  with developer and local authority partners addressing systemic barriers – including small site viability, access to land data, and infrastructure certainty. The pilots are due to present their impact in February 2026.  "
        },
        {
            "heading": 3,
            "text": "Helping planning services to respond quickly and efficiently "
        },
        {
            "text": "One of the areas PlanX is transforming services is how councils handle pre-application advice. Doncaster Council pioneered a digital service that allows planners to specify required information upfront and ensures requests include relevant policy considerations from the start. The results show pre-application validation time reduced to less than half a day and the valid-to-decision period cut from 50 days to 29 days. These improvements mean developers receive faster, more useful feedback while officers can focus on providing quality advice. "
        },
        {
            "heading": 2,
            "text": "Supporting public involvement in planning "
        },
        {
            "text": "Making planning more accessible to residents, businesses and community organisations remains a key focus area. "
        },
        {
            "heading": 3,
            "text": "Making planning guidance accessible "
        },
        {
            "text": "The user-friendly PlanX interface asks simple questions and uses data to  automatically generate planning guidance in minutes, helping people understand if they need planning permission, report planning breaches or  submit applications. The content management system makes planning data and processes work better for planners and the public. "
        },
        {
            "heading": 3,
            "text": "Improving public consultation and engagement through property technology "
        },
        {
            "text": "Our PropTech Innovation Fund has supported several pilots that are revolutionising how LPAs engage with residents in planning consultations.  A series of user-centred case studies have been published on GOV.UK as part of our plan-making guidance to demonstrate how councils have used digital tools to make local plan consultations more efficient and accessible.   "
        },
        {
            "text": "Greater Cambridge Shared Planning has partnered with the University of Liverpool to develop a bespoke AI model that summarised planning consultation comments across three supplementary planning document consultations in just 16 minutes – a task that took 18.5 hours previously. Officers still review every representation but can now focus on analysing the feedback and stakeholder engagement, creating faster feedback loops with communities. "
        },
        {
            "text": "These innovations demonstrate how digital tools can make planning more inclusive and responsive, enabling residents to participate more easily on development plans that affect their areas. "
        },
        {
            "heading": 2,
            "text": "Sharing our work and learning with the planning sector "
        },
        {
            "text": "We've shared our progress at major industry events throughout the year. At the UK’s Real Estate Investment and Infrastructure Forum (UKREiiF) in May, we presented alongside Nottingham City Council and City of London Corporation, showcasing their work on digital planning and supported an engaging session in the UKPA PropTech Hub featuring live demos from suppliers in the Digital Planning Directory.  "
        },
        {
            "text": "We demonstrated Extract, at the Tech for Growth event in Paris, showing how the UK is harnessing AI to improve public services and presented at events with the Royal Town Planning Institute and the Planning Officers Society, encouraging more LPAs to embrace digital transformation. "
        },
        {
            "text": "Our collaborative approach with LPAs in ODP has been recognised through shortlisting at both the Local Government Chronicle Awards (LGC) 2025 and the Digital Technology Leaders Awards 2025. While we didn't win, the LGC  judges commended our \"highly innovative partnership between national government and local planning authorities\" and highlighted \"the value of MHCLG seeding sector-led improvement in authorities\". "
        },
        {
            "heading": 2,
            "text": "Building momentum in 2025 "
        },
        {
            "text": "This year has demonstrated what's possible when we work collaboratively across the planning sector. From councils publishing standardised data and adopting modern software, to technology companies building innovative solutions we're seeing the building blocks of a transformed planning system coming together. And with almost 200 councils now part of ODP, growing momentum in data standardisation, and AI tools like Extract set to launch widely next year, we're on track to deliver the efficient, transparent and accessible planning system that England needs to meet its ambitious housing targets. "
        }
    ]
}