{
    "url": "https://defencedigital.blog.gov.uk/2025/12/19/mod-digital-commercial-end-of-year-message-to-industry-delivering-digital-advantage-together/",
    "title": "MoD Digital Commercial End of Year message to Industry Delivering Digital Advantage Together",
    "authors": [
        "V. Cope"
    ],
    "categories": [
        "commercial"
    ],
    "pub_date": "2025-12-19T17:26:01+00:00",
    "content": [
        {
            "text": "As we close out the calendar year, I want to take the opportunity to extend my thanks to all our industry partners for your continued commitment and collaboration in working towards delivering Defence’s outcomes."
        },
        {
            "text": "It remains another year of raising the bar on how we procure and deliver exceptional digital capabilities to our Defence users and deliver operational advantage at home and overseas. "
        },
        {
            "text": "Digital has never been more important within Defence, as recognised and highlighted within the Strategic Defence Review and Defence Industrial Strategy. Your part as industry partners in our programmatic outcomes and digital transformation, are key and we welcome your ongoing support."
        },
        {
            "text": "Acknowledging the Strategic Defence Review, we took the opportunity to refresh our Digital Commercial Strategy this year and published a roadmap update. If you haven’t had the opportunity to read it, please do so: Digital Commercial Strategic Roadmap"
        },
        {
            "text": "Digital Skills: Thank you to those who have partnered with us on our Digital Skills for Defence programme, and we are pleased to welcome new partners as well as renewing partners on this important agenda. The Digital Skills programme is a great way to partner with us ‘off contract’ so if your organisation would like to partner with us on the Digital Skills agenda or our E-Sports initiative, please reach out to us: UKStratComDD-DS4D-Engagement@mod.gov.uk"
        },
        {
            "text": "Enacting Our Commitments: Our laser focus has remained on programme delivery, ensuring we achieve the outcomes required to equip users with the capabilities they need now and in the future.  "
        },
        {
            "text": "In the new year we will be rolling out a refreshed approach to obligations management ensuring industry standards, objective measures are used across each project and reiterating the importance of the RAG status. It will allow us to celebrate our best performing contracts and suppliers more fervently and to get earlier indication of those who need more help. "
        },
        {
            "text": "Strategic Category Management: With thanks to industry colleagues who have attended our category briefings, roundtables and helped us design our optimised routes to market to secure maximum appetite and innovation from industry. Your collaborative engagement in helping us shape those category strategies has been superb and we look forward to continuing this collaboration in years to come. "
        },
        {
            "text": "Commercial Optimisation: The teams have worked hard to develop and implement new ways of working to drive pace, scale and ease of doing business into our Digital Commercial practices, taking procurements from years to months, and months to days! It’s been superb to hear from many of you on the improvement in your lived experience in working with us! In 2026, the full roll out of the #11 Levers of Digital Acquisition will take this to the next level."
        },
        {
            "text": "We have had some brilliant awards in 2025 recognising the combined efforts of MOD and Industry in delivering these innovative outcomes at pace and scale including the World Commerce & Contracting Award for Strategic Achievement."
        },
        {
            "text": "Strategic Market Engagement: We have undertaken more than 40 engagement opportunities this year to collaborate on challenge statements, new ways of working as well as upcoming procurements. We have opened previously closed markets, and I am delighted to welcome almost 200 new suppliers to Defence. Many of these are SMEs making up 45% of the digital supplier ecosystem at all levels."
        },
        {
            "text": "In any partnership, what really matters is how we collectively show up to the challenges and opportunities in front of us to ensure Defence’s outcomes are met. "
        },
        {
            "text": "As we move into 2026, I ask that we build and grow our partnerships approach and ask for your help in embedding our Digital Commercial Enterprise Behaviours: "
        },
        {
            "text": "I wish all our suppliers and partners a restful festive break and look forward to working together in 2026, to continue to strengthen the nation’s defence."
        },
        {
            "text": "Victoria Cope"
        },
        {
            "text": "Defence’s Digital Commercial Director"
        },
        {
            "text": "Contact Us"
        }
    ]
}