{
    "url": "https://mhclgmedia.blog.gov.uk/2025/12/19/next-steps-for-english-council-reorganisation/",
    "title": "Next steps for English council reorganisation",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Local government"
    ],
    "pub_date": "2025-12-19T15:17:08+00:00",
    "content": [
        {
            "text": "Yesterday, the government announced that English councils undergoing reorganisation have been invited to give views on postponing their local elections next May."
        },
        {
            "text": "This follows multiple councils approaching the department and requesting delays, noting that upcoming elections could undermine their plans for reorganisation. "
        },
        {
            "text": "The government is acting now so councils can provide views before final decisions are taken. Legislation will be needed to delay elections, in line with usual Parliamentary process."
        },
        {
            "text": "No decision on delays has been made but 63 English councils have until midnight on 15 January 2026 to feedback to the department. The Secretary of State will then make a decision early next year."
        },
        {
            "text": "Our starting point is that all elections will go ahead, but we will consider all views provided before taking the final decision early next year."
        },
        {
            "text": "If councils decide they don’t want to postpone, we will listen. This is a locally led approach about councils and their capacity, and we recognise that individual councils are in the best position to judge this."
        },
        {
            "text": "If it is decided that elections will be postponed, legislation will be brought forward in the usual way. We will set out transparently to Parliament what councils told us and the basis for any decisions."
        },
        {
            "text": "Where elections are postponed, we will continue to work with councils to hold elections as soon as possible to the new local councils. We expect these elections to be in May 2027 and they would replace scheduled elections."
        },
        {
            "text": "The new councils will go live in April 2028. Surrey is on an accelerated timetable so elections to the new councils in May 2026 will replace the scheduled elections there, subject to Parliament."
        },
        {
            "text": "See here for the full story."
        }
    ]
}