{
    "url": "https://space.blog.gov.uk/2025/12/19/unlocking-space-in-florida-uk-space-agency-takes-centre-stage-at-the-space-economy-summit/",
    "title": "Unlocking Space in Florida: UK Space Agency Takes Centre Stage at the Space Economy Summit",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2025-12-19T09:00:00+00:00",
    "content": [
        {
            "text": "At the Space Economy Summit 2025 in Florida, the UK Space Agency’s Unlocking Space team, with the support of the Space and Aerospace Department for Business and Trade (DBT) team, stepped onto a global stage to position the UK as a thought leader in space commercialisation, as we brought UK expertise into direct dialogue with some of the USA’s most influential investors, innovators and government partners."
        },
        {
            "heading": 2,
            "text": "Strengthening UK–US Collaboration"
        },
        {
            "text": "The week began with a tour of the innovation labs at the University of Central Florida (UCF), followed by a roundtable bringing together wider Space Coast stakeholders. Discussions on deepening collaboration between the UK and Florida across research, commercialisation and investment, and on sharing approaches to building resilient space ecosystems, drawing on the UK’s mission led approach to connecting public demand, private capital and technical excellence."
        },
        {
            "text": "As part of the UCF Space Week, the team experienced a guided tour of the Kennedy Space Center, which offered insights into NASA’s operations, the industrial depth underpinning Florida’s space economy, and the broader US space sector."
        },
        {
            "heading": 2,
            "text": "Driving Global Dialogue on the Space Economy"
        },
        {
            "text": "At The Economist’s Space Economy Summit 2025, the UK Space Agency delegation hosted a roundtable on “Bridging space tech’s ‘valley of death’”, bringing together 35 investors, space companies and end-user businesses to discuss the key challenges facing space companies as they scale. The conversation covered shared challenges including the difficulty of securing capital at the right moment, the complexity of navigating assurance, standards and procurement, and the persistent challenge of building international routes to market."
        },
        {
            "text": "There was a shared view that investor understanding remains a critical gap, which could be addressed with better education, better evidence and clearer demand signals. There was also an emphasis on the importance of focusing on real markets rather than speculative ones: identifying a customer, articulating the value add, and demonstrating how satellite tools complement existing solutions. Several participants highlighted that governments have far more influence than they often acknowledge, not only as procurement bodies, but as enablers of launch access, tax environments and regulatory clarity across non-space bodies."
        },
        {
            "text": "Overall, the roundtable reinforced the importance of the Unlocking Space approach: using real operational needs to generate early demand and deploying contract funding mechanisms to effectively to move suppliers into genuine adoption pathways, for both public and private end-users."
        },
        {
            "text": "As a sponsor of the event, the UK Space Agency also helped to shape and lead one of the Summit’s headline conversations: how artificial intelligence is unlocking the true value of satellite data. Dr Craig Brown, the UK Space Agency’s Investment Director, joined global leaders to explore how AI is transforming space-derived information into real world insight, drawing upon live case studies from the Unlocking Space portfolio. The discussion underscored a theme central to the UK’s approach – that transparency, standards and data quality are as important as the algorithms themselves, if AI-enabled space services are to earn public trust and scale internationally."
        },
        {
            "heading": 2,
            "text": "Showcasing UK Leadership"
        },
        {
            "text": "The UK presence was further strengthened by contributions from Scottish Enterprise and Minister Richard Lochhead, who highlighted the strong momentum of Scotland’s space economy, particularly in satellite communications and downstream innovation. Their interventions, alongside insights from UK industry leaders on defence investment, dual-use capabilities and space-enabled healthcare, demonstrated the breadth and depth of the UK’s innovation ecosystem. "
        },
        {
            "text": "Commenting on the UK Space Agency’s visit, Dr Craig Brown said:"
        },
        {
            "heading": 2,
            "text": "Next Steps"
        },
        {
            "text": "The engagements in Orlando set the stage for deeper international market collaboration to support the growth of the UK space ecosystem, particularly in emerging markets such as in-orbit pharmaceutical manufacturing, where the UK's life sciences strength and regulatory leadership position us to play a defining role in the global market. The Unlocking Space team’s visit comes ahead of DBT’s Trade Mission in January 2026, which will further open doors for UK companies by building on the strong UK-US partnership anchored in Florida’s Space Coast."
        }
    ]
}