{
    "url": "https://nda.blog.gov.uk/a-new-initiative-takes-volunteering-to-a-new-level/",
    "title": "A new initiative takes volunteering to a new level",
    "authors": [
        "Jenni Midgley"
    ],
    "categories": [
        "Skills",
        "Socio-economic",
        "Uncategorized"
    ],
    "pub_date": "2022-05-30T16:08:46+01:00",
    "content": [
        {
            "text": "The Programme and Project Partners at Sellafield uses the Social Value Model throughout all of their activity, meaning that anyone working on the partnership, including key delivery partners and supply chain has committed to delivering the maximum positive social impact for our local communities in West Cumbria and Warrington."
        },
        {
            "text": "One of the 5 social impact themes in the partnership is volunteering. The Programme and Project Partners Timebank Scheme makes it simple for anyone who works for an organisation that’s part of this framework to commit to volunteer opportunities, via the West Cumbria Exchange, that provide real impact for the communities we operate in."
        },
        {
            "text": "This means they provide something beneficial that’s sustainable and long-term through the voluntary work that takes place."
        },
        {
            "text": "Head of social impact for the Programme and Project Partners, Luke Richardson says:"
        },
        {
            "heading": 3,
            "text": "Programme and Project Partners Timebank - Hospice at Home and Cavendish Nuclear"
        },
        {
            "text": "The Timebank scheme used Cumbria Exchange to connect a bid writer from supply chain partner, Cavendish Nuclear, with 2 charities in need of those expertise – one of those was Hospice at Home West Cumbria."
        },
        {
            "text": "Thanks to the work they carried out together, Hospice at Home went on to secure a grant for £85,000 using the new skills they acquired."
        },
        {
            "text": "Sustainable volunteering such as this provides prolonged and meaningful improvement for other people and organisations by upskilling them and sharing knowledge that will ensure ongoing dividends."
        },
        {
            "text": "Julie Monk, CEO of Hospice at Home West Cumbria, said:"
        },
        {
            "heading": 3,
            "text": "Programme and Project Partners Timebank - Citizens Advice Bureau Copeland"
        },
        {
            "text": "Citizen Advice Bureau Copeland is an independent charity that relies heavily on funding, grants, and volunteer time to be able to maintain the delivery of its free and independent advice service."
        },
        {
            "text": "An opportunity arose to apply for National Lottery funding and Citizens Advice Bureau wanted to apply to fund their financial inclusion service – a service to help build resilience in the local community."
        },
        {
            "text": "This was made possible by the voluntary work offered by Andrew Hopkins from Cavendish Nuclear, who worked closely with bureau to audit the bid applications and in turn help them secure National Lottery funding of more than £160,000."
        },
        {
            "text": "Shelly Hewitson, chief officer at Citizens Advice Bureau Copeland said:"
        },
        {
            "text": "Shelley’s team are approached by the community with concerns spanning from debt, housing, mental health, relationships etc."
        },
        {
            "text": "The National Lottery funding has not only aided Citizens Advice in continuing to help the community with vital advice during the cost-of-living crisis, but the volunteering from Cavendish has given Shelley the confidence to apply for further funding and grants."
        },
        {
            "heading": 3,
            "text": "Programme and Project Partners Timebank - Our people volunteering in schools "
        },
        {
            "text": "The Elements Work Awareness Programme teams up with the Centre for Leadership Performance and Sellafield Ltd in a week-long interactive programme that supports Year 10 students across West Cumbria, developing their leadership, teamwork, communication, and problem-solving skills."
        },
        {
            "text": "Through the Timebanking scheme, volunteers Jenefer Alam, Benefits Lead and Philip Greyling, Head of P3M from our team, were matched with schools across West Cumbria and were tasked with guiding the students through project management, marketing, and communications."
        },
        {
            "text": "The sessions they led offered expert guidance for the students to help tackle a particular challenge - designing a system for workplaces (offices/factories) that:"
        },
        {
            "text": "Other topics they covered included: Mechanical and electrical engineering, solution development, product development and sales."
        },
        {
            "text": "Schools that took part included: Energy Coast UTC, Nether hall school, Beacon Hill community school, Solway community school, Workington Academy, St Benedict's Catholic Highschool and Westlake's Academy."
        },
        {
            "text": "Student feedback: "
        },
        {
            "text": "Setting goals and looking at how we make sure young people participating in the programme can develop their leadership, teamwork, communication, and problem-solving skills."
        },
        {
            "text": "This ultimately helps them build a career pathway of their choosing. Having professionals with advanced knowledge volunteer their time highlights any opportunities they may not have been aware of, getting them to think about the bigger picture."
        },
        {
            "text": "Phillip Greyling, head of P3M, for the Programme and Project Partners"
        },
        {
            "text": "Jenefer Alam, benefits lead for the Programme and Project Partners"
        },
        {
            "text": "Bill Leslie-Miller is contracted as a Recruitment Manager at Doosan Babcock for the partnership. Bill volunteers his time mainly to primary schools, providing sessions that build the children's communication, teamwork, and critical thinking skills to benefit them when they join the world of work."
        },
        {
            "text": "Bill has been a STEM Ambassador since 2015, working closely with the Centre for Leadership Performance and previously working with Prince’s Trust to build relationships with schools and facilitate his workshops."
        },
        {
            "text": "In Bill's sessions, called the Fun Job Workshop, he uses the student's imaginations by asking questions like 'what is your dream job?' and 'what are the 10 most dangerous jobs in the world?' All with the set goal of getting the children to think about where they want to be when they grow up."
        }
    ]
}