{
    "url": "https://disabilityunit.blog.gov.uk/2022/05/30/a-sign-of-the-times-the-bsl-act-has-landed/",
    "title": "A sign of the times: The BSL Act has landed",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Policy"
    ],
    "pub_date": "2022-05-30T17:42:24+01:00",
    "content": [
        {
            "heading": 3,
            "text": "The British Sign Language Act has arrived!"
        },
        {
            "text": "When the British Sign Language Act received Royal Assent a few weeks ago, it was big news for the Civil Service BSL Network. The theme of Deaf Awareness Week 2022 was Deaf Inclusion, and this is exactly what the new Act Brings to the fore."
        },
        {
            "heading": 3,
            "text": "The Civil Service Language Network for BSL"
        },
        {
            "text": "A lot of great work is already underway across government to create a more inclusive and accessible society. The Civil Service Language Network was set up in October 2020, and has been growing and growing, now with over 7,500 members in over 40 language groups! The Network has been providing Departmental language-based support to projects in government, from creating a survey in Ukrainian for the ONS, delivering basic Cantonese to assist FCDO in their work with British Nationals from Hong Kong and helping HMRC with some of their investigations in Farsi too! (If you’re in the Civil Service, please contact the Network if you would like to join or if you need Departmental language-based support.)"
        },
        {
            "text": "The Civil Service Languages Network established a sub-network for BSL in 2021. Having started 2022 with 213 members, the Civil Service BSL Network has rapidly increased to over 400! Members meet up regularly to practise and learn BSL supported by Deaf BSL-using colleagues. The Network helps support those on their BSL learning journey with conversation practice, hosts taster sessions (introductory classes) and also circulates a newsletter."
        },
        {
            "heading": 5,
            "text": "Desmond, one of the Civil Service BSL Network committee members explaining what the BSL Act means for government departments."
        },
        {
            "text": "Mariesa is based in the Cabinet Office and started signing to communicate with her cousin. She has now gained Level 3 BSL accreditation and is one of the organisers of the BSL Network."
        },
        {
            "text": "My inspiration for learning British Sign Language (BSL) was my cousin who was born Deaf. Growing up I remember thinking how frustrating and draining it must have been for her to be part of our family dinners. She could sign and lipread and vocalise in English if needed. She was so patient with me and the whole family, none of whom signed with any proficiency."
        },
        {
            "text": "The first time I had a conversation in BSL with my cousin was such a special moment for me. For her? I think she felt it was about time someone in our family learned and she teases my mum about not doing the same."
        },
        {
            "text": "Over time I have not kept up with my studies. I sign along to songs and do my best when I see my cousin but I am rusty so I am excited that there is a BSL group in the Civil Service that will help me get back into it."
        },
        {
            "text": "It is so exciting to now have BSL as a recognised language here in Britain. I am looking forward to the new opportunities it will give my cousin and others, knowing how frustrating it can be to feel left out of the conversation. Having a statutory commitment to improving communication for Deaf people feels very empowering."
        }
    ]
}