{
    "url": "https://civilservice.blog.gov.uk/2022/05/30/civil-service-winds-of-change/",
    "title": "Civil Service winds of change",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-30T08:38:28+00:00",
    "content": [
        {
            "heading": 3,
            "text": "In the same week, Her Majesty celebrates her Platinum Jubilee, we speak to loyal, long-term civil servants on how life at work has changed over the decades."
        },
        {
            "heading": 3,
            "text": "‘I felt really modern having a push button phone’"
        },
        {
            "text": "Dawn Lennie is a Wellbeing Consultant for the Cabinet Office in Leeds. "
        },
        {
            "text": "I vividly remember the typing pools, loads of paper files etc. I joined as an AA in Park Place DHSS, Leeds in 1983. You only had a phone on your desk if you were an AO or above, and there were no direct lines as everything came via a switchboard. "
        },
        {
            "text": "I felt really modern having a phone with push buttons, compared to our old dial phone at home. All payments were made to customers by order books or giros - I'm sure if you went to Leeds Market, you'd have found hundreds lying around because that’s where all the customers told us they'd lost them when coming in for a replacement."
        },
        {
            "text": "The customer’s payday was determined by the last two numbers of their national insurance number (0-24 Monday, 25-49 Tuesday, 50-74 Wednesday and 75-99 Thursday). I still have nightmares working out customer entitlement manually with just a form and a calculator - how things have changed."
        },
        {
            "text": "......................................................................................................................."
        },
        {
            "heading": 3,
            "text": "‘Looking back, I wouldn’t change a thing’"
        },
        {
            "text": "Martin Coe is an E1 at the Army Reserve Unit, Blighmont Army Reserve Centre Southampton."
        },
        {
            "text": "I joined the MOD in 1988 aged 19, at the Directorate General Naval Manpower and Training in Old Admiralty Building, Whitehall. I got job offers from both the Ministry of Defence and the Department of Transport on the same day. Back then, I did a daily commute from Southampton, then Winchester – which had its hairy moments including the awful Clapham rail crash. I caught the train just minutes before that one, and my parents aged considerably as they frantically tried getting through to me on the office phone - we didn’t have mobiles then."
        },
        {
            "text": "Office life was very different in the eighties. I can remember a presentation about the paperless office and the way it would be achieved. I never went after promotion as I suffered from crippling interview nerves, but I’ve had a blast with postings at the Old Admiralty Building, Defence Export Services, HMS Collingwood, St George’s Barracks and Portsmouth Naval Base. The days of phoning up your Career Manager, asking for a move and getting three options are long gone. I really enjoyed doing something different. Now I work at the Army Reserve with a view opposite Southampton container docks. Looking back, I wouldn’t change a thing."
        },
        {
            "text": "......................................................................................................................."
        },
        {
            "heading": 3,
            "text": "‘One claimant tried climbing through our window’"
        },
        {
            "text": "Jodie Dewsnap is a Bill Team Policy Adviser for the Fraud and Error Policy Group, Department for Work and Pensions, Sheffield."
        },
        {
            "text": "I started my career as an Admin Assistant in the ‘Machine Room’ in Doncaster Unemployment Benefit Office in October 1986, producing ticker tapes. Great days, apart from the day a claimant tried to climb through the window in front of my machine because the office had closed (3.30pm on a Friday) and he'd missed collecting his giro!"
        },
        {
            "text": "............................................................."
        },
        {
            "heading": 3,
            "text": "‘An earthquake struck so we fled the building’"
        },
        {
            "text": "Andrew Buckley, Worcester Service Centre, DWP."
        },
        {
            "text": "I started my first job at Crewe DHSS during the Winter of Discontent in 1979. On day two, the trains went on strike so I borrowed Dad’s car and drove from Manchester. In heavy fog, I went the wrong way down a dual carriageway near Middlewich. Only a guardian angel extended my career beyond my first day. "
        },
        {
            "text": "In week two, it was our turn to go on strike. Everyone suddenly put their coats on and walked out. This was a problem as I’d only just joined. I was up and downstairs like a yo-yo, unsure what to do. "
        },
        {
            "text": "Life was never dull. ​​Every Saturday during the era of IRA bombings, the gate was locked for security. Once someone went out and raced back to say a plastic bag filled with a strange object was hanging on the gate. Being in charge that day, I went to investigate and in the bag was a dead badger – left by a farmer for the Ministry of Agriculture in the same building. "
        },
        {
            "text": "On another occasion, we had an earthquake at Shrewsbury – we fled the building before I remembered I was the floor warden and had to race back in."
        },
        {
            "text": "Within my first year working, I was put on ‘insurance officer’ duties and now in year 44, I’m back to ‘decision making’ and still loving every minute. I’ve lived the dream and I never want it to end."
        },
        {
            "text": "..................................................................................................................."
        },
        {
            "heading": 3,
            "text": "‘I’ll probably be here until I retire’ "
        },
        {
            "text": "Sally Dewhurst is a Call Handler for the National Advance Line, DWP. "
        },
        {
            "text": "I started as a temporary AA in Redditch Jobcentre in 1985, then 'passed the panel' to start at Selly Oak Benefit UBO the following year. I was 18; on my first day there was a bulk delay of giros and 250 customers stood in the portacabin, all shouting and swearing at me. I cried when I got home and told my mum and dad. Yet here I still am, 36 years later... still being sworn at on the National Advance Line. However I love my job, love helping people, and will probably be here until I retire."
        },
        {
            "text": "..................................................................................................................."
        },
        {
            "heading": 3,
            "text": "‘It can be great fun catching drug smugglers’"
        },
        {
            "text": "Joseph Taylor is a Border Force Officer based at Dover Eastern Docks."
        },
        {
            "text": "I started in the Inland Revenue (which later became HMRC) in April 1986. Two years later, I joined the Customs division of HMRC in Dover. It was a cultural change clambering into the back of lorries in the middle of a night shift or at 6am, compared to sending out income tax bills from a warm office. "
        },
        {
            "text": "I’ve enjoyed my many years as a civil servant. One thing some of my colleagues aren’t always aware of is how well we’re cared for by our employers. I even appeared in a Sky documentary UK Customs in 2008 when I played a drug smuggler getting arrested! "
        },
        {
            "text": "Of course, in return I’ve given loyal and diligent service. From the day I joined, I’ve always been treated fairly and consider myself lucky to be a civil servant for one of the most powerful governments in the world. I have no regrets and enjoyed every moment. I retire at the end of April, and I just wished I’d joined the Border Force earlier in life - it can be great fun catching smugglers."
        },
        {
            "text": "......................................................................................................................."
        },
        {
            "heading": 3,
            "text": "‘We worked hard and played hard’"
        },
        {
            "text": "Jane Lyes works in Compliance at HMRC, Bristol."
        },
        {
            "text": "I joined HMRC at 18 in 1976. On my first day, I wore a red, white and blue striped skirt and red blouse and blazer that cost £5 - my whole Saturday job wage. I looked very smart. "
        },
        {
            "text": "It was my first full-time job and my take home pay was £100 per month. I saved £50 and lived on £50 as I lived at home and didn’t pay rent. Based in Public Department 9 in Ty-Glas, Cardiff, we dealt with the Tax affairs for all civil servants. PD1 dealt with the royal family, MPs, famous people, and of course, HMRC staff. You couldn’t go near any of the PD1 offices without authority."
        },
        {
            "text": "The building had a restaurant, snack bar, bar and branch of Barclays bank. A trolley visited every office, morning and afternoon, filled with drinks, rolls, cakes and chocolate."
        },
        {
            "text": "I planned to only stay for a year, but life in PD was the best. We played hard but worked hard and you never heard people moan. It was a happy place. Colleagues I met then are still friends for life. If someone fell a bit behind, we’d all pitch in. "
        },
        {
            "text": "The Admin Assistants did most of the bulk of clerical work and filing. Typically ladies in their sixties and seventies, they wore navy overalls and white gloves for filing. Most got paid in cash in brown envelopes delivered to each office every Friday morning. Us youngsters were modern people, paid straight into our bank accounts. "
        },
        {
            "text": "There were no computers in those days. Everyone whose tax affairs we dealt with had a ‘concard’ (control card) containing all their information from which we calculated their income tax codes manually. The concard covered several years; every so often, we’d need to write new ones out, a major job, often involving overtime. "
        },
        {
            "text": "We were Tax Officer grade (equivalent of AO), we had a manager, support team and an inspector in charge of each wing with their own office. Each floor had a District Inspector in overall charge. Inspectors were addressed by Mr or Mrs and if we had to enter their office, we’d feel very nervous!"
        },
        {
            "text": "We had the most amazing social lives and local pubs and the rugby club were favourite haunts, especially on a Friday afternoon to celebrate someone’s birthday. Then we’d all take a bus into the centre of Cardiff where we’d eventually get trains or buses home, up in the valleys. Christmas was a particularly social time. We had a day off for Christmas shopping, half day for the group Christmas meal and a half day for the floor party. But we appreciated it and never had problems meeting our targets.  "
        },
        {
            "text": "In 2003 I moved to Bristol and got a transfer to Debt Management and Banking. Now I work in Compliance on a Hidden Economy team which is very interesting. When I turned 60, I’d worked over 40 years so I was able to take partial retirement. Now I work 22 hours a week and take out part of my Civil Service pension - a great way to ease myself into retirement after working full time for so long."
        },
        {
            "text": "......................................................................................................................."
        },
        {
            "heading": 3,
            "text": "‘I worked with World War II veterans’"
        },
        {
            "text": "Lorraine McBride is the Blog Editor for Civil Service Internal Communications."
        },
        {
            "text": "Aged just 17, I started my first office job in Stanmore. My job was arranging investitures at Buckingham Palace for army personnel awarded honours in the New Year and Birthday Honours List. It was a lovely job because all the recipients were excited at the prospect of meeting the Queen. "
        },
        {
            "text": "My colleagues included retired army officers, Colonel Frank Walker and Major Bob Timme, both World War II veterans. Major Timme had brylcreem hair, wore an immaculate pin-stripe suit and walked with a pronounced limp, an old wartime injury. I was curious about the war, but both were modest chaps, and never uttered a word - which everyone respected. There was a huge generation gap - yet everyone got on brilliantly and we even had an annual work trip to the Derby. "
        },
        {
            "text": "Lifelong friendship remains my fondest memory. I was so lucky to work with Carol, Olive and Mary who were all in their 40s and fifties.  They were kind, encouraging, fun and taught me a lot - decades before anyone spoke about 'mentoring'. I kept in touch with Carol and Olive for the rest of their lives (I still swap xmas card with their husbands) and still meet up with Mary who is now 82."
        },
        {
            "text": "Back in the eighties, there were so many government buildings, you could work just five to 10 minutes’ walk from virtually any tube stop in London. Finding a job was easy; your grade manager came up with a selection of roles and arranged an interview. Many youngsters chose jobs based on where they fancied going out after work because the social life was brilliant. As an admin clerk, I didn’t earn much, but I felt rich when my pay hit £100 a week. "
        },
        {
            "text": "The biggest change was switching to open plan offices in 2003 following a three-year refurb. As an in-house reporter, I did a vox pop quizzing staff on what they’d like to see in the shiny new HQ. Bright ideas included water features, a bar and a TGI Fridays on the ground floor. "
        },
        {
            "text": "In 2022, it’s hard to fathom how much work life has changed but it’s refreshing how much more possible it is for women, Black, Asian and minority ethnic colleagues, and staff with disabilities to progress in the workplace - and up the ladder.◼︎ "
        }
    ]
}