{
    "url": "https://environmentagency.blog.gov.uk/2022/05/30/managing-the-risk-from-non-native-fish/",
    "title": "Managing the risk from non-native fish",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Fisheries and biodiversity"
    ],
    "pub_date": "2022-05-30T13:09:55+00:00",
    "content": [
        {
            "text": "Dr Gareth D Davies, Technical Specialist – Non-native Species and Fish Ageing, National Fisheries Laboratory"
        },
        {
            "text": "Some have ‘whiskers’, some are slithery, and some can even clone themselves. Non-native fish come in all shapes and sizes, from the small, unassuming topmouth gudgeon and fathead minnow, to giant wels catfish. They all carry a different degree of risk to our native fish stocks and wildlife."
        },
        {
            "text": "We have a long history of non-native fish in England. Rainbow trout, wels catfish and zander first arrived in the 19th century. Grass carp, topmouth gudgeon and Prussian carp are more recent introductions. While some are restricted to just a few sites, others have colonised many parts of the UK by escaping from fish farms and ornamental ponds, being introduced legally for angling, or stocked illegally or unintentionally."
        },
        {
            "text": "Popular recreational fisheries have been developed for some non-native fish. For instance, the River Severn and Fenland drains are famed for zander and many stillwaters attract anglers targeting specimen wels catfish."
        },
        {
            "text": "However, introducing non-native species will always pose some risk. Wels and zander are predators. The feeding habits of others, like grass carp, can upset the ecology of a water, making it less favourable for native wildlife. All non-native species can act as vectors for new exotic fish parasites and diseases."
        },
        {
            "text": "The level of risk depends on the species and the type of water it is being introduced to. At the Environment Agency, we regulate which fish can be stocked and kept in which waters. While we take a precautionary approach to non-native fish, we do permit a handful of species to be stocked to support angling, but only in certain circumstances."
        },
        {
            "text": "It is vital that the right fish are stocked in the right place. For instance, we do not take any chances with rainbow trout. Despite having only bred successfully in just a few waters throughout their 150-year history, we will only permit their stocking with infertile “triploid” fish."
        },
        {
            "text": "However, there are certain non-native fish that can pose a serious risk to our native stocks and the wider environment."
        },
        {
            "text": "Prussian carp - also known as gibel carp, gibelio and carassio, are native to central and eastern Europe. Despite it being illegal to import them into the UK, they have now been found in several waters in England."
        },
        {
            "text": "Prussian carp can reproduce in a novel way, using the sperm of other fish species to fertilise their eggs. Called gynogenetic reproduction, this process effectively produces clones and increases their ability to establish new populations."
        },
        {
            "text": "Identifying Prussian carp is extremely difficult. However, my team at our National Fisheries Laboratory has been leading the way on identifying Prussian carp through detailed morphological and molecular (DNA) analysis. We have also provided expert input to risk assessments to better understand the biology of this fish and the risk they pose to our fisheries. More information is available on the Angling Trust website."
        },
        {
            "text": "We have placed fish movement controls on all waters with confirmed Prussian carp as part of a national containment programme. Work is also underway to establish how they have entered the UK and assess their distribution across England."
        },
        {
            "text": "Topmouth gudgeon  - originating in Asia, these small cyprinid fish have spread throughout Europe, including the UK. The species are extremely invasive, they outcompete our native fish for food and habitat, and in some waters, they can account for over 90% of the fish biomass, ruining the quality of the angling and wider ecology."
        },
        {
            "text": "We are working closely with angling clubs and other partner organisations to eradicate topmouth gudgeon. Our non-native invasive species management team has successfully removed 27 populations of the species and continue to work with fishery owners to remove all known populations."
        },
        {
            "text": "Black bullhead - North American catfish first introduced to Great Britain in 1885, however, unlike in Europe, where they have become widely distributed, they have not gained a foothold here."
        },
        {
            "text": "They are invasive and can become abundant. They compete with other fish for the same food and can impact native stocks. They are predatory and like most non-native fish, can host exotic diseases and parasites, to which our native fish may be vulnerable."
        },
        {
            "text": "The Environment Agency remains vigilant at ensuring the species do not become established in the UK. We eradicated the only known population in 2014 and we are  not permitting any new introductions."
        },
        {
            "text": "The future"
        },
        {
            "text": "Due to factors such as climate change, the risk posed by invasive species is likely to increase in the UK. While warmer summers may slow the spread of cooler water species, it will help other species distribute and establish more easily."
        },
        {
            "text": "The Environment Agency is remaining vigilant, and our lab is working hard to ensure robust detection and mitigation measures are in place. However, we all have a part to play. If you plan to stock any fish into your fishery, make sure you apply to us for a permit. Permits are there to protect you and other fisheries by checking fish are suitable for the fishery and you are not inadvertently putting stocks at risk."
        },
        {
            "text": "We can all avoid transferring any non-native species. The Check Clean Dry campaign offers advice to anglers, boaters and paddlers on how to minimise this risk."
        },
        {
            "text": "Please call us on our 24-hour incident hotline 0800 80 70 60 if you see any fish which don’t seem like they belong and alert the fishery owner or angling club. We will investigate to see if we can remove the species before they become established."
        },
        {
            "text": "Follow Environment Agency on Twitter, and sign up for email alerts here."
        }
    ]
}