{
    "url": "https://deframedia.blog.gov.uk/2021/12/09/fly-tipping-annual-statistics-in-england/",
    "title": "Fly-tipping annual statistics in England",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste",
        "Weekly stories"
    ],
    "pub_date": "2021-12-09T15:03:48+00:00",
    "content": [
        {
            "text": "There has been widespread coverage today in the Times, The Independent, the Guardian , the Daily Mail, Daily Express, Sun and Daily Star of Defra’s publication of the 2020/21 fly-tipping statistics for England."
        },
        {
            "text": "Local authorities dealt with just under 1.13 million fly-tipping incidents this year, an increase of 16% from the 980,000 reported in 2019/20. As in the previous year, just under two thirds (65%) of fly-tips involved household waste. Total incidents involving household waste were 737,000 in 2020/21, an increase of 16% from 635,000 incidents in 2019/20."
        },
        {
            "text": "Through our landmark Environment Act 2021, we are ensuring agencies and authorities can work more effectively to combat waste crime through better access to evidence and improved powers of entry. These new powers will help hold waste criminals, such as illegitimate waste operators reliant on fly-tipping for income, accountable."
        },
        {
            "text": "We are also developing proposals for the reform of the waste carrier, broker, and dealer regime and the introduction of mandatory electronic waste tracking, which will help to ensure that waste is dealt with appropriately."
        },
        {
            "text": "The first national lockdown in March 2020 led to some local authorities being unable to maintain collections of dry materials, with some suspending garden and bulky waste collections. There was also a widespread closure of household waste recycling centres, which were later re-opened but with some restrictions in place. These factors and other factors such as changes in household consumption, travel and leisure patterns may have contributed to the increases seen in the number of fly-tipping incidents reported for 2020/21."
        },
        {
            "text": "Resources and Waste Minister Jo Churchill said:"
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}