{
    "url": "https://deframedia.blog.gov.uk/2021/12/09/headline-severn-trent-water-fined-1-5m-for-sewage-discharges/",
    "title": "Severn Trent Water fined £1.5m for sewage discharges",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-12-09T16:07:15+00:00",
    "content": [
        {
            "text": "There has been coverage in The Guardian, Metro, BBC, ENDS Report and Reuters of a £1.5 million fine handed to Severn Trent Water for illegal sewage discharges from four treatment works in Worcestershire in 2018 following an Environment Agency prosecution. The story was also covered in The Birmingham Mail, Worcester News, Malvern Gazette, Redditch Advertiser and Bromsgrove Standard."
        },
        {
            "text": "The court heard how a blockage at a sewage treatment works at Blackminster near Evesham resulted in some 360,000 litres of sewage being illegally discharged into the nearby Broadway Brook in February 2018. It also heard how at another site, sewage sludge was not managed properly over the winter, causing it to build up and discharge into Sugar Brook and Hen Brook, while equipment failure at the Priest Bridge works led to discharges over a two-day period in August 2018."
        },
        {
            "text": "David Throup, Environment Manager for West Midlands Area of the Environment Agency said:"
        },
        {
            "text": "The conviction follows the announcement that the Environment Agency has launched a major investigation into more than 2000 sewage treatment works after new checks led to water companies admitting that they could be releasing unpermitted sewage discharges. Any company caught breaching their permits could face a range of possible enforcement action – up to and including fines and prosecution. Fines can be up to 10% of annual turnover for civil cases, or unlimited in criminal proceedings."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}