{
    "url": "https://publicguardian.blog.gov.uk/2021/12/09/modernising-lasting-powers-of-attorney-consultation-what-happens-next/",
    "title": "Modernising lasting powers of attorney consultation – what happens next?",
    "authors": [
        "Holly Simpson"
    ],
    "categories": [
        "Digital",
        "Future planning",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2021-12-09T13:22:36+00:00",
    "content": [
        {
            "text": "The Ministry of Justice’s (MoJ) consultation on modernising lasting powers of attorney closed on 13 October 2021, after being open for public response for 12 weeks."
        },
        {
            "text": "Over 300 responses were received through the online hub, direct via email and through the post, from stakeholders and members of the public."
        },
        {
            "text": "Alongside the consultation, a series of workshop events took place covering key themes and giving the opportunity for our stakeholders to have in depth discussions around these areas. We had over 110 attendees over the seven events which was a fantastic result. We received encouraging feedback that the events generated some meaningful conversations and improved confidence on discussion the consultation and its purpose."
        },
        {
            "text": "Nick Goodwin, Public Guardian for England and Wales, has shared his gratitude to everyone who took the time and effort to respond to the consultation, saying:"
        },
        {
            "text": "“The 12-week consultation has now come to an end, during which time, many of you have provided invaluable insights and responses to our questions. Thank you for all your time and interest so far, we’ll keep you informed as things progress.”"
        },
        {
            "text": "You can see a video note from Nick Goodwin below:"
        },
        {
            "text": "The MoJ is now in the process of analysing responses and intends to publish the government’s response to the consultation in spring 2022. Until the response is published, the Modernising LPA project teams across MoJ and OPG are continuing to work on researching the experiences of the public with LPA processes and exploring prototypes in the possibility that a digital channel can be developed."
        },
        {
            "text": "Thanks again to everyone who took part in our events and responded to the consultation. This is a big step for MoJ and the Office of the Public Guardian in making LPAs more secure and accessible for all our users."
        },
        {
            "text": "If you have any queries around the consultation, please email mlpaconsultation@justice.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}