{
    "url": "https://civilservice.blog.gov.uk/2021/12/09/skys-the-limit-how-apprenticeships-inspire-opportunities/",
    "title": "How apprenticeships inspire great opportunities",
    "authors": [
        "Alexander Lever"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Apprenticeships"
    ],
    "pub_date": "2021-12-09T15:44:25+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Civil Service recognises the value of apprenticeships to nurture talent and help new recruits  get started. Below, three apprentices from disadvantaged backgrounds tell how their apprenticeships in different industries opened new doors. "
        },
        {
            "heading": 3,
            "text": "Jack’s Story"
        },
        {
            "text": "Jack Tennant from Knottingley, West Yorkshire, is an apprentice in the House of Commons. "
        },
        {
            "text": "I joined Parliament by chance. I went to my local comprehensive in Knottingley, West Yorkshire. "
        },
        {
            "text": "I was raised by a single mother and could never work out where I wanted to take my life after education. After joining the Army Cadet Force, I set my mind on pursuing a career in the Armed Forces, but was medically deferred. "
        },
        {
            "text": "I applied to university with no real plans, and no real motivation. I began to doubt how successful I would be at university, so instead, I decided to look for apprenticeships. Previously, I had enjoyed work experience with my local MP, so I was interested in Parliament and discovered an apprenticeship opportunity in the Commons."
        },
        {
            "heading": 4,
            "text": "House of Commons"
        },
        {
            "text": "I work for the International Development Committee, leading on Middle East- and North Africa-related work. The work is often challenging, but the support and guidance of my colleagues has boosted my confidence, and I feel trusted and skilled enough to make an impact in my role.  "
        },
        {
            "heading": 4,
            "text": "Unique opportunities"
        },
        {
            "text": "The apprenticeship offered complementary learning to my job. The unique opportunities for learning, development and networking have been unparalleled. For me, working in Parliament gives me a huge sense of pride and service, making a difference, helping other people and seeing my work make an impact. "
        },
        {
            "heading": 4,
            "text": "Go for it!"
        },
        {
            "text": "If I was advising someone like me on looking at ways to start a career in the Civil Service, I’d say, go for it! It’s been challenging, but I’ve learnt, experienced and achieved more than I could have ever imagined. Self-belief is everything. Our public sector serves the entire United Kingdom - every class and every region, and its people should reflect that too."
        },
        {
            "heading": 3,
            "text": "Sophie’s Story"
        },
        {
            "text": "Sophie Richardson from South Shields, Tyne and Wear, was an apprentice with RSM."
        },
        {
            "text": "My parents were ready to downsize to send me to university but I didn’t want to impose that burden onto them. Instead I found a local scheme where I worked towards a qualification whilst earning a salary. It’s hard to get a job on the graduate market and this meant I could go straight in and get experience first."
        },
        {
            "text": "From a young age, I was always interested in numbers and in sixth form, I decided to go down the finance route. Now I’m an audit supervisor for a professional services company.  "
        },
        {
            "text": "I talk to finance directors and CEOs, and I manage a team. Initially, it was really intimidating but gradually I felt like my apprenticeship has given me the confidence to say, “I deserve a job like this.”"
        },
        {
            "heading": 4,
            "text": "First house"
        },
        {
            "text": "Just before lockdown, I bought my first house. But I wouldn’t be in this position if I’d gone to university. As soon as I started working, I started saving up. I always knew I wanted to be comfortable, knowing how hard my parents worked when I was growing up. "
        },
        {
            "text": "Now that I've successfully completed the ACA and my four-year Level 7 apprenticeship, I’ve been promoted to Assistant Audit Manager. It’s great to just focus on my work and my clients now that my studying is over. It’s also nice to have a social life back in time for Christmas! "
        },
        {
            "text": "I’ve been able to apply the knowledge I gained in my apprenticeship to tackle more complex work. I now look forward to coaching the next cohorts of apprentices through their exams."
        },
        {
            "heading": 3,
            "text": "Angel’s story"
        },
        {
            "text": "Angel Maynard from Moss Side, Manchester, is an apprentice with Leidos. "
        },
        {
            "text": "I spent most of my youth in Moss Side, Manchester, and my mum and dad separated when I was six. When I received my first year A-level results, I got the worst results ever and I panicked, “What do I do now?” I went to college and studied a BTEC in business and decided I wanted to be in control of my own progress."
        },
        {
            "text": "At college, I did the Career Ready programme and that’s really where it all started in terms of my professional career. I went on to win their regional and national Student of the Year awards and on the way up to receive them, I dropped my prepared  speech on the floor. I got up there and mostly, I cried my eyes out and ended up talking about how I spent most of my spare time binge-watching Netflix. "
        },
        {
            "heading": 4,
            "text": "From the heart"
        },
        {
            "text": "It was the craziest speech I’d ever given, but because it came from the heart, I got a standing ovation. I was approached by Leidos, BP and Aviva to potentially work for them and went to Glasgow to do an apprenticeship in digital application support with Leidos."
        },
        {
            "text": "Leidos is an IT and engineering firm, and I work as a change manager. Leidos is sponsoring me to do a Chartered Management Degree Apprenticeship and it’s great! I will complete my BA in Management Practice over the next three years. I’ve always been intrigued by the idea of juggling work whilst studying for a degree - and it’s challenging. University is interesting, distance learning has its challenges, but they’re very easy to overcome with the right techniques. "
        },
        {
            "heading": 4,
            "text": "Be open minded"
        },
        {
            "text": "I remember sitting there when I got my apprentice salary and I thought, no way do I earn that much money for learning! I’d say, be open-minded, recognise your own value and build the path that’s the best fit for you. There’s bound to be challenges along the way but believe in yourself through them all."
        }
    ]
}