{
    "url": "https://ruralpayments.blog.gov.uk/2021/12/09/start-preparing-for-your-rural-payments-applications-and-claims/",
    "title": "Start preparing for your Rural Payments applications and claims",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Rural Payments service"
    ],
    "pub_date": "2021-12-09T09:34:31+00:00",
    "content": [
        {
            "text": "In February 2022 applications will open for new Countryside Stewardship agreements, and from March 2022 you will be able to apply for Basic Payment Scheme 2022 and to submit Countryside Stewardship and Environmental Stewardship revenue claims."
        },
        {
            "text": "To make sure that you are ready to submit your application or claim when the time comes, RPA will be publishing a series of blog posts to help you prepare."
        },
        {
            "text": "Now that we have begun to make payments, this is a good opportunity to make sure that your details and permissions are up to date.  You can do this through the Rural Payments service."
        },
        {
            "text": "To log into the Rural Payments service, you will need your Customer Reference Number and password."
        },
        {
            "text": "If you need to reset your password, you can follow the guidance in this video which will take you through each step. We have also created a video on how to find your Customer Reference Number."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Contact Details"
        },
        {
            "text": "It’s important to make sure that your contact details are up to date. We will use these details to get in touch with you about important issues and this can be easily missed if your contact information isn’t correct. To avoid missing out on vital updates, check that you have included all of the right details for us to reach you on."
        },
        {
            "text": "You can check and amend your details in the Rural Payments service. If you send us information by email, we can only accept it if the email address is registered in the Rural Payments service, so it is important to make sure that it is up to date."
        },
        {
            "text": "You should also check that your contact number is correct, as we can send text reminders if you opt to receive them."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Permissions"
        },
        {
            "text": "You can set up permissions within your Rural Payments service account to allow someone else to act on your behalf within it. This can be adjusted to suit their responsibilities for your business."
        },
        {
            "text": "To add someone to your business in the Rural Payments service, they will need to be registered and you will need their Customer Reference Number. Your permissions will need to be set to ‘full permissions’ for ‘Business Details’ for you to be able to add a new person."
        },
        {
            "text": "If you have already added someone to your account, it’s important to make sure that they also have the right permissions set."
        },
        {
            "text": "You can watch this short video to see how to add someone to your business and amend permissions in the Rural Payments Service."
        },
        {
            "text": "We will soon be publishing more information to help you to prepare for the applications opening early next year."
        },
        {
            "text": "Sign up using your email address and you will be updated whenever we post a new article."
        }
    ]
}