{
    "url": "https://actuaries.blog.gov.uk/2021/12/09/swans-and-flamingos/",
    "title": "Swans and flamingos",
    "authors": [
        "Kailesh Patel - Analyst"
    ],
    "categories": [
        "Analysis",
        "Climate change",
        "Finance"
    ],
    "pub_date": "2021-12-09T17:31:30+00:00",
    "content": [
        {
            "text": "Sustainable finance can be thought of as the integration of environmental, social and governance factors into lending and investment. Climate change is currently at the fore of sustainable finance and is the subject of many academic and professional discussions."
        },
        {
            "text": "Several risks stemming from climate change to the global financial system have been recognised. These include physical risks, like economic losses resulting from increased severity and frequency of natural catastrophes, and transition risks that can arise from moving to a low carbon future."
        },
        {
            "text": "The development of renewable energy has the potential to widely disrupt financial markets that are interlinked with fossil fuel usage. As efforts are ramped up to address climate change in the decade of action, the financial sector must account for transition risks that could impact financial stability."
        },
        {
            "text": "Given the scale of the threat, an increasing number of financial institutions including central banks are connecting these risks to their activities. Some have gone a step further, by considering ways to direct financial flows to environmentally sustainable areas."
        },
        {
            "heading": 2,
            "text": "Innovative approaches"
        },
        {
            "text": "I’ve had the opportunity to study the implications of climate change related risks as part of my recent master’s degree. During my studies I’ve been looking at some innovative approaches different central banks are taking. These involve using ‘macroprudential’ policy, aimed at the economy as a whole, to mitigate systemic risks arising from climate change."
        },
        {
            "text": "In the run-up to the COP26 climate change conference, I was fortunate to attend the 2021 Climate Bonds Conference, hosted by the Climate Bonds Initiative. The conference gathered forward-thinking organisations from finance, government, and academia to discuss how sustainable finance is progressing in their areas."
        },
        {
            "heading": 2,
            "text": "A global dilemma"
        },
        {
            "text": "At the 2021 Climate Bonds Conference, several key figures in central banks met to discuss how climate change is being addressed in their countries, and whether central banks should be more proactive in financing green activities. Emerging markets are imminently exposed to the physical risks of climate change, and while sustainable finance is growing, there remain concerns about a large funding gap."
        },
        {
            "text": "Complicating matters are the innumerable interactions between economies and the climate. These have led to difficulties modelling climate-related risk using traditional methods, motivating the idea of a ‘green swan’."
        },
        {
            "text": "This originates from the concept of a ‘black swan’, a term coined by statistician Nassim Taleb and commonly cited following the global financial crisis. A ‘black swan’ is an unexpected and extreme event that can only be rationalised retrospectively. For the ‘green swan’ of climate change, however, while we are uncertain of its ultimate consequences, we are acutely aware that they will be severe."
        },
        {
            "text": "At the conference, the alternative metaphor of a ‘green flamingo’ was floated, representing the opportunity of sustainable finance taking flight in emerging markets. Speakers noted that a progressive approach by central banks is important for scaling up green finance. However, before the green flamingo can fly, there was agreement that more work is to be done, including to build the foundations of financial sector resilience and responsiveness to climate risk."
        },
        {
            "heading": 2,
            "text": "A case study"
        },
        {
            "text": "As part of my green finance module, I presented a mock policy briefing for a country’s central bank on actions to be explored to green the financial system. The challenge was to identify actions consistent with the central bank’s mandate and considerate of political economy ramifications. So, I found it insightful to hear at the conference how central banks are putting steps in motion to develop frameworks and guidance for credible risk assessments."
        },
        {
            "text": "The briefing included comparing options such as incentives for banks to finance environmentally friendly investments and introducing new rules for financial institutions that can support the effective deployment of green finance policy. These measures include climate-related scenario analysis, stress testing, and mandatory disclosures to address critical data gaps. These developments should help to manage climate risks and lay the groundwork for a green flamingo."
        },
        {
            "heading": 2,
            "text": "What's next"
        },
        {
            "text": "Globally, central banks play a key role in making sure risks are understood.  The UK has announced its own roadmap to embedding mandatory climate disclosures, which includes requirements for scenario analysis and stress testing. At COP26, over 100 central banks and supervisors reiterated their commitments via the Network for Greening the Financial System Glasgow Declaration."
        },
        {
            "text": "Over time, emerging markets can stimulate prudential green investment and scale-up green finance with the aid of:"
        },
        {
            "text": "As I found at the Climate Bonds Conference, collaboration is an important driver of action. Sharing experiences with peers can alleviate fears of a green swan and galvanise enthusiasm for a green flamingo."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}