{
    "url": "https://educationhub.blog.gov.uk/2021/12/what-does-covid-plan-b-mean-for-schools-colleges-universities-and-early-years/",
    "title": "What does Covid Plan B mean for schools, colleges, universities and early years?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2021-12-09T12:06:15+00:00",
    "content": [
        {
            "text": "Yesterday, the Prime Minister announced the implementation of Plan B of the COVID-19 Response: Autumn and Winter Plan, as a result of increasing pressure on the NHS."
        },
        {
            "text": "We have already increased safety measures across education settings and we set these measure out in a previous post on 28 November"
        },
        {
            "text": "Here we provide further details on what Plan B means for education settings."
        },
        {
            "heading": 3,
            "text": "Will schools be closing early? "
        },
        {
            "text": "No, schools will not be closing early and our updated guidance ensures face-to-face education continues. School attendance remains mandatory."
        },
        {
            "heading": 3,
            "text": "Will pupils and students have to wear face coverings or masks? "
        },
        {
            "text": "Our latest guidance does not change the advice on face coverings."
        },
        {
            "text": "We have already advised that staff, visitors and pupils or students in year 7 and above should wear a face covering in communal areas. This includes FE and HE settings. We do not recommend that pupils and staff wear face coverings in classrooms, unless their Director of Public Health advises them to temporarily do so in one of the circumstances described in the Contingency Framework Guidance."
        },
        {
            "text": "In early years settings and primary schools, we already recommend that face coverings should be worn by staff and adults (including visitors) when moving around in corridors and communal areas."
        },
        {
            "heading": 3,
            "text": "Can Nativities and Christmas events still go ahead? "
        },
        {
            "text": "Yes. Nativities and Christmas events can continue to go ahead."
        },
        {
            "heading": 3,
            "text": "Do parents and other people attending events need to test? "
        },
        {
            "text": "Schools, colleges early years settings and universities should continue to encourage those attending events to test beforehand and use face coverings and to ensure those events are held in well ventilated spaces."
        },
        {
            "heading": 3,
            "text": "What are the rules on testing?"
        },
        {
            "text": "Testing should take place regardless of symptoms – this is called asymptomatic testing and helps stop people with the virus but who don’t have symptoms spreading it inadvertently."
        },
        {
            "text": "Staff in all education and childcare settings and students, of secondary school age and above should continue to test twice weekly at home with lateral flow device (LFD) test kits, 3-4 days apart, for the remainder of the autumn term and on return in the spring term."
        },
        {
            "text": "Staff and students who are continuing to attend education/childcare settings over the Christmas period should continue to be encouraged to test at-home twice weekly."
        },
        {
            "text": "Staff and students who are not attending their setting during the holiday period may wish to take a rapid lateral flow test in situations where they are more likely to catch or spread COVID-19. This includes spending time in crowded and enclosed spaces, or before visiting people who are at higher risk of severe illness if they catch COVID-19."
        },
        {
            "text": "Schools and colleges are strongly encouraged to ask parents and other visitors to take a lateral flow device (LFD) test before visiting the school."
        }
    ]
}