{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/12/15/a-glass-half-full-my-adult-social-work-journey/",
    "title": "A glass half full: my adult social work journey",
    "authors": [
        "Donna Sharkey",
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Recruitment",
        "Viewpoint"
    ],
    "pub_date": "2023-12-15T16:07:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "An adventure, one day at a time"
        },
        {
            "text": "I have worked for Salford Adult Social Care for 18 years and 11 months, and I have been a level two social worker on the transition team for three weeks and about 23 minutes, but who’s counting?"
        },
        {
            "text": "I am a Salfordian. I am who I am because of the people of Salford. Make yourself a brew and read about my adventure and how an administrative error helped me achieve a goal I never dreamt possible."
        },
        {
            "text": "My social work journey began in year nine of secondary school, in my English lesson. I did a presentation on a country and western song from a documentary I’d been watching. The song was called “Jenny’s got a secret” and was speaking up about child abuse."
        },
        {
            "text": "The documentary explained that one in four children would experience some form of abuse, and I thought “that is six people in my class”. I wanted to give at least one child a way to speak out. My mum says now, “social work was written in the stars.”"
        },
        {
            "text": "After leaving school, I enrolled on a diploma in social work, but other things happened, it didn’t work out and I returned to work in my local hospital. I later took an opportunity through work to train as an assistant practitioner. The role was to be a combined, nursing, physio, and occupational therapy role, a health and social care foundation degree and my NVQ level 3."
        },
        {
            "heading": 2,
            "text": "A happy accident"
        },
        {
            "text": "Upon qualifying, I was applying for jobs and saw a Community Assessment Officer role within occupational therapy. I rang Salford Council and was put through to the wrong department. Adult social care department were advertising the same role. I spoke to them and I thought this sounds like something I could enjoy so, I took the chance, applied and got the job!"
        },
        {
            "text": "That phone call to the wrong department changed my direction, and I truly feel it put me where I was meant to be."
        },
        {
            "text": "There were six of us, the first social work apprentices for Salford. Without the support we had for each other, from our teams and the workforce development team, I wouldn’t be where I am now."
        },
        {
            "text": "At the end of my degree, I was nominated for the Umbuntu Memorial Award. This recognised outstanding social justice values in line with the Unbuntu Principles. One of my greatest achievements to date. It was created to commemorate Dr Allister Butler a fabulous, passionate, and creative teacher. I will be forever honoured to be the first person to receive it."
        },
        {
            "text": "I am so inspired by our work in Salford. I look forward to Friday’s good news stories to see what my colleagues have achieved. Even on a bad day, I feel privileged to do my job. Not many people do something they truly love and feel they were meant to do. The best moments are seeing the young people we support achieve their outcomes."
        },
        {
            "heading": 2,
            "text": "What it's all about"
        },
        {
            "text": "Recently I worked with a young woman who said, “I want to be a carer. I want to be able to make people a cup of tea and make them happy”. At that time, she couldn’t lift the kettle. I suggested the ‘one touch’ kettle, which she practiced with and, when she made a cup of tea, her face lit up. That day, she made someone a cup of tea and asked them how their day had been. She had achieved her goal."
        },
        {
            "text": "We arranged a volunteering opportunity within an extra care housing scheme, supported by Salford’s health improvement team. With an opportunity to volunteer in college holidays, she hopes to work as a carer one day. The last time I saw her she was setting up a brew club at college."
        },
        {
            "text": "I’ve learned so much about social justice, power, and the challenges that the people of Salford face. I implement a power with model when working with young people, and I want to understand their strengths. With confidence, they can challenge injustices, and inequalities, making the positive changes they desire, not what I think they should do."
        },
        {
            "text": "I am a different worker today than yesterday and a different worker than I will be tomorrow. Our workforce team helps me stay challenged, and motivated to continue to develop and be the best I can be."
        },
        {
            "text": "It’s been a whirlwind, the time has absolutely flown by. I am grateful for all my opportunities within adult social care, and I hope to pay it forward, I plan to become a Practice Educator, encouraging students just as I was encouraged."
        }
    ]
}