{
    "url": "https://aphascience.blog.gov.uk/2023/12/15/dishing-up-satisfying-visits-for-hungry-scientists/",
    "title": "Dishing up satisfying visits for hungry scientists",
    "authors": [
        "Sarah Stewart"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2023-12-15T09:00:01+00:00",
    "content": [
        {
            "text": "Hear from Sarah Stewart, Stakeholder and Events Manager, as she talks about what goes into organising an APHA event, including a recent event where 18 high-achieving international science students visited our headquarters at Weybridge."
        },
        {
            "text": "I recently wrote a blog about the outreach work that I am involved in. Another aspect of my role is to co-ordinate visits to the APHA Weybridge site in Surrey."
        },
        {
            "text": "Our science headquarters has been on its current site in Addlestone, Surrey for over 100 years and, as you can imagine, we get lots of enquiries to visit the site due to our world-wide reputation and expertise in an extensive range of animal and plant diseases. Many of these diseases can have a detrimental impact on the farming or horticulture industry if outbreaks occur and our experts are regularly tracking disease reports to assess the level of risk and severity."
        },
        {
            "text": "APHA and the Department for Environment, Food, Rural Affairs (Defra) provide advice to farmers, vets, plant growers and bee-keepers about managing diseases and respond to the more serious notifiable diseases in animals, plants and bees by putting in place control measures to protect the UK from severe outbreaks. We are currently dealing with a number of disease threats to the animal, plant and bee populations from bird flu, Colorado beetle and Asian hornets!"
        },
        {
            "text": "Organising visits to the APHA science headquarters is a little like preparing a gourmet meal, bringing all the best ingredients together to make a delicious starter, main course and dessert to fulfil the taste and appetite of the visitors."
        },
        {
            "text": "My job is to ensure the table is set (book a meeting room), the menu suits the time (2 or 3 course?) and assemble the key ingredients (scientific experts), then put them all together in the right order and best combination to make a satisfying meal (programme of talks and tours) to satisfy the diners (visitors). We have a ready-made meal that we can use at any time but enjoy tailoring the menu to suit specific requests and hope that everyone goes home satisfied, without any allergic reactions!"
        },
        {
            "text": "We regularly receive requests from industry, government, academia and other science institutes from across the UK and abroad to come to see the APHA Weybridge science headquarters. They wish to learn more about the research, surveillance and diagnostic work we do and to view the science facilities, some of which are unique in the country, including the high containment labs and post-mortem rooms."
        },
        {
            "text": "APHA and Defra are also in the process of redeveloping the site over the next 10 years to future-proof the facilities. This has brought a lot of interest from a range of stakeholders involved in the programme of work. Read about the importance of this in a previous blog by Jenny Stewart, Director of Science Transformation."
        },
        {
            "text": "In August, we were pleased to welcome 18 high-achieving science students from New Zealand, Poland, Belgium, China, Kenya, Barbados, Qatar, United Arab Emirates, Canada and the UK who chose to visit our site in Surrey. APHA Weybridge was one of the many science institutes that the students could visit during their two-week STEM Summer Camp organised by the London International Youth Science Forum. This was the sixth year that APHA has taken part in the programme, and we were pleased to welcome another group of engaged students this year."
        },
        {
            "text": "It is important to set the scene (or ‘lay the table’) when visitors arrive and the students were welcomed by our Science Director, Yvonne Spencer, who ‘ran through the menu’, giving an overview of APHA and the Science Directorate."
        },
        {
            "text": "The students then heard from our experts working in a range of science areas with topical, taster talks on Antimicrobial Resistance, the bird flu outbreak, developing a cattle vaccine for bovine tuberculosis, as well as APHA’s international outreach in Africa and Asia helping countries to develop their animal health knowledge and capabilities."
        },
        {
            "text": "The final presentation (or dessert) from the Department of Epidemiological Sciences highlighted the interdisciplinary work of our data analysts, statistician’s and modellers, who pull all the research and diagnostic reports together to assess risks and develop models of infection."
        },
        {
            "text": "The talks were broken up by four tours to the research and diagnostic laboratories working on vector borne diseases (and their insectary), high containment avian virology testing, animal feed testing and routine surveillance and international trade."
        },
        {
            "text": "At the end of the visit, Aliya Allen from New Zealand, thanked us for hosting the visit and explained how the students valued the opportunity to visit APHA and to have the chance to speak to so many experts in their field."
        },
        {
            "text": "Chan Hai Choi from China wrote a letter of thanks after the visit:"
        },
        {
            "text": "We hope that the range of presentations and tours gave the students a ‘flavour’ of our main areas of work and to understand the importance of animal health and its linkage with public health and the environment."
        },
        {
            "heading": 3,
            "text": "Open Days"
        },
        {
            "text": "More recently we held two open days for students from colleges close to the APHA Weybridge site. We welcomed students from Godalming Sixth Form College on 1 November and Brooklands College the following day to see some practical demonstrations by our STEM ambassadors and go on tours of our laboratories and animal science departments."
        },
        {
            "text": "Yvonne Spencer, the Science Transformation Director, met with all the students and was pleased to see their interest in talking to our staff. She hopes their visit highlights the diversity of roles in science and at the Agency and inspires them to continue with their science studies and ambition to work in science or associated areas."
        },
        {
            "text": "You can read about the Godalming College visit on their college website and the Brooklands College visit on theirs."
        },
        {
            "heading": 3,
            "text": "Other blogs"
        },
        {
            "text": "You might also be interested in other high-profile visits to the site"
        }
    ]
}