{
    "url": "https://moderncivilservice.blog.gov.uk/2023/12/15/how-the-mod-is-creating-psychologically-safe-environments-to-enable-project-success/",
    "title": "How the MOD is creating Psychologically Safe environments to enable project success",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Proud Civil Servant"
    ],
    "pub_date": "2023-12-15T11:14:39+00:00",
    "content": [
        {
            "text": "Evidence shows psychologically safe teams are more productive, innovative, and better at exposing and managing risk. Psychological Safety is a key enabler in building an innovative culture, high-performing teams, and promotes testing new ideas, whether they are successful or not."
        },
        {
            "text": "The Ministry of Defence’s (MOD) purpose is to protect the nation and help it prosper. The threats we face are increasingly complex and continue to evolve in ways we cannot predict. But how do we establish the right conditions to combat those challenges and empower our diverse workforce to perform at their best? We know that one important condition is Psychological Safety."
        },
        {
            "text": "As defined by Professor Amy Edmondson, Psychological Safety is the belief that one will not be punished or humiliated for speaking up with ideas, questions, concerns, mistakes and that the team is safe for interpersonal risk-taking."
        },
        {
            "heading": 2,
            "text": "Psychological Safety in MOD Major Projects report"
        },
        {
            "text": "Defence delivers 52 of the UK Government’s ‘major projects’ — more than any other government department. In July 2022, Defence published the Psychological Safety in MOD Major Projects report which revealed key factors that enabled and inhibited Psychological Safety within 12 of our major projects. Those factors included leading change; setting and communicating the vision; culture and learning from experience; designing and delivering capability; and driving value."
        },
        {
            "text": "One of the success stories following the study was the HYDRA Programme team, who scored relatively high in comparison with other programmes. Despite their high scores the team wanted to better understand how Psychological Safety could support the development of a sustainable high-performing team. They have since undertaken a series of collective activities to enhance their team environment."
        },
        {
            "text": "However, every project team is different and faces its own challenges; in some cases, a psychologically unsafe environment can make those challenges harder to overcome. In May 2023, the Armoured Cavalry Programme (Ajax) Lessons Learned Review led by Clive Sheldon KC concluded that although “information was not communicated due to problems with ‘psychological safety’ ... an absence of psychological safety did impact negatively on a number of individuals working on the programme, and for some it influenced the way in which information was reported”."
        },
        {
            "heading": 3,
            "text": "Assessing Psychological Safety"
        },
        {
            "text": "The success of embedding a psychologically safe environment is in tailoring and evolving the approach to the needs of the team as well as the environment in which the team is operating. Recognising this, we designed a Psychological Safety Assessment Service. Each assessment, independently conducted, extracts data on how psychologically safe a programme team environment is and assesses the extent to which key acquisition behaviours are exhibited. The results are compiled into a thematic report and a tailored action plan is co-created with the leadership of the team to support their progress towards becoming a sustainable high-performing team."
        },
        {
            "text": "In September 2023, we ran a pilot on one of the Army’s key programmes. Results revealed that the programme team were, in general, operating within a psychologically safe environment and were role-modelling those key behaviours, but it also identified some areas for improvement. The team are now implementing a tailored action plan to improve and sustain their Psychological Safety as a team. A follow-up will be undertaken in March 2024 to measure progress."
        },
        {
            "text": "With the success of the pilot and Psychological Safety high on Ministerial agendas, we are now assessing the feasibility of scaling the Psychological Safety Assessment Service to assess multiple Defence programme teams at pace. This will give us a better understanding of the overarching factors impacting Psychological Safety in Defence and drive improvement in our project team environments and ultimately the achievement of Defence’s objectives."
        },
        {
            "heading": 3,
            "text": "Leading advocate across Government"
        },
        {
            "text": "The research and initiatives carried out by Defence has enabled us to become a leading advocate for Psychological Safety across government. This year, we have run a cross-government advocacy campaign, sharing our experiences with government colleagues on how to successfully create psychologically safe environments in their departments and to empower their workforce on the path to successful delivery."
        },
        {
            "text": "The next chapter in our exciting campaign is exploring with the Cabinet Office how to embed our work on Psychological Safety into the core reform missions of A Modern Civil Service."
        },
        {
            "heading": 3,
            "text": "A Psychologically Safe Civil Service"
        },
        {
            "text": "Our aspiration is to embed a psychologically safe culture in MOD where our programmes are enabled to succeed, deliver the Government’s strategic objectives and uphold our commitment to protecting our nation. In 2024, we hope to continue developing our work on Psychological Safety by further strengthening our capabilities and sharing our experiences across government. While the work ahead may be challenging, it will be worthwhile to ensure that we can create a productive and successful Civil Service built on psychologically safe foundations."
        }
    ]
}