{
    "url": "https://environmentagency.blog.gov.uk/2023/12/15/meet-two-environment-agency-interns-helping-to-protect-our-water-environment/",
    "title": "Meet two Environment Agency interns helping to protect our water environment.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-12-15T11:00:04+00:00",
    "content": [
        {
            "text": "Every year Environment Agency (EA) Interns make essential contributions to our work, helping us protect the UK’s natural environment and making sure everyone in the UK has access to clean and plentiful water, as part of the Environment Agency EA2025 plan. Our Summer Diversity Internship Programme (SDIP) offers students from diverse backgrounds the chance to kickstart their careers and give them an insight into the breadth of work undertaken by the EA."
        },
        {
            "text": "Ever wondered what this would be like? We spoke to Rion Hoshino and Siobhan Gunn, who completed the internship this summer, to find out more about their experience."
        },
        {
            "text": "After both graduating from university last year, Siobhan and Rion both leaned towards work involved in the protection of natural resources. In July, they both began their internships as part of the EA’s SDIP. Siobhan says she thought that the Environment Agency seemed like a perfect place to begin her career. and the support she received through from the start was helpful: “I think that the Environment Agency was the one that got back to me the most during the application process,” she says."
        },
        {
            "text": "Their internships have given them a valuable insight into the EA’s work, including a two-day site visit on water resources in Cumbria where they learned first hand about protecting water resources. Siobhan says that a lot of the work was based around water resilience planning, in “making sure that water companies can provide sufficient water to their customers for the next twenty, thirty, fifty years - but also that it's not at the cost of the environment.” Rion agrees, “I think water is going to become a bit more of a scarce resource in the next twenty to thirty years. The EA is trying to plan for that. Our work will hopefully be a positive contribution to that,” he says."
        },
        {
            "text": "They spent time with the with Hydrology and Telemetry team, including operating a boat with a sensor attached to measure the flow of the river Thames. They worked with the ecology team, where they waded through a river to take water samples for invertebrate identification. They also attended EA and industry workshops on water and energy and learned about the EA’s work on drought incidents."
        },
        {
            "text": "The variety of different activities gave them both a taste of EA work areas that they hadn’t considered before. As Rion states: “Water resources planning was not something I ever had my eye on, but I’ve gained extremely useful knowledge and experience.” The internship also enabled him to build on the skills he learned in his degree. As someone with a fascination with maps, he says that getting to apply his knowledge of Geographic Information Systems (GIS) technology for mapping rivers was a personal highlight."
        },
        {
            "text": "One of Siobhan’s favourite internship experiences was a site visit to the Otter Catchment in Exmouth. They took part in an informative tour about the Lower Otter Restoration Project (LORP), a partnership initiative between Clinton Devon Estates and the Environment Agency which aims to enhance the downstream section of the river."
        },
        {
            "text": "Rion and Siobhan have both now managed to secure permanent positions at the EA, and they both plan on pursuing careers here. Reflecting on her work on water security, Siobhan says “I think people just always expect water to be there when you turn on the tap. I realized through the internship there's a lot more that goes on behind the scenes.” She feels proud of the work she’s done so far. “Even if we're contributing like tiny amount, it still feels we’re contributing to something, making sure people have enough water in the future” she says."
        },
        {
            "text": "The Environment Agency is dedicated to developing talent in people from all backgrounds. We want our workforce to reflect the diverse communities we work with, to help us create a better place for everyone. To find opportunities that suit your level and experience, visit: Working for EA - Environment Agency - GOV.UK (www.gov.uk)."
        }
    ]
}