{
    "url": "https://naturalengland.blog.gov.uk/2023/12/15/reflections-from-cop-28-nature-recovery-for-a-secure-future/",
    "title": "Reflections from COP 28 – Nature recovery for a secure future",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environment Act",
        "Marine environment",
        "Natural Capital",
        "Natural England",
        "Nature-based solutions",
        "Science and evidence"
    ],
    "pub_date": "2023-12-15T13:52:12+00:00",
    "content": [
        {
            "text": "The COP28 climate summit has concluded in Dubai with an agreement headlining on the need for a global journey away from fossil fuels. Behind the high drama of the oil, coal and gas economy were discussions about other subjects, including the importance of Nature recovery. I joined the British Government delegation to help raise the profile of that."
        },
        {
            "text": "The UK made strong connections between Nature and climate at COP 26 in Glasgow in 2021 and it was encouraging to see continuing momentum in Dubai. This was manifest in discussions about the role of ecosystems in mitigating emissions and also in how resilience and adaptation can be enhanced through ecosystems. The links between Nature and climate also played out in discussions about food and water security."
        },
        {
            "text": "The “global stocktake” which was the main negotiated output from the COP not only included the historic agreement by all nations to “transition away from fossil fuels” but also a reminder of the “urgent need to address… the interlinked global crises of climate change and biodiversity loss… as well as the vital importance of protecting, conserving, restoring and sustainably using nature and ecosystems for effective and sustainable climate action”."
        },
        {
            "text": "Having attended the Rio Earth Summit in 1992 and many of the subsequent COPs for Nature and climate, I have been repeatedly struck by the limitations often inherent in voluntary accords. The fact that emissions were about 60 per cent higher in 2022 compared with 1992 rather sums up the gap between stated ambition and delivery and presents a compelling reminder of why implementation is everything."
        },
        {
            "text": "Whether it is commitments on energy or Nature, in the end it will be down to the choices made by individual countries when they get back home which will determine whether they collectively make progress on what has been agreed. This is where Natural England comes in."
        },
        {
            "text": "The Dubai agreement reiterates the pledge from Paris to continue “pursuing efforts to limit the temperature increase to 1.5 °C above pre-industrial levels.” It goes on to acknowledge that Nature can help us in that regard if we can “halt and reverse deforestation… by 2030 and (the decline of) other terrestrial and marine ecosystems acting as sinks and reservoirs of greenhouse gases and by conserving biodiversity.”"
        },
        {
            "text": "In England our peatlands contain over half of the country’s terrestrial carbon stores and provide a haven for wildlife, as well as supporting better water quality and natural flood management. Some 87 per cent of them are, however, degraded, highlighting the importance of the £16 million investment Natural England helped award to 12 restoration projects across the country through the third round of the Nature for Climate Peatland Grant Scheme this year."
        },
        {
            "text": "It’s not only about catching carbon though. The global stocktake goes on to portray just how much our way of life depends on Nature – and therefore how we need a multi-pronged approach if we are to recover Nature and adapt to the demands of a changing climate."
        },
        {
            "text": "The stocktake “encourages the implementation of integrated, multi-sectoral solutions, such as land use management, sustainable agriculture, resilient food systems, nature-based solutions and ecosystem-based approaches”. As well as “protecting, conserving and restoring nature and ecosystems, including forests, mountains and other terrestrial and marine and coastal ecosystems, which may offer economic, social and environmental benefits such as improved resilience and well-being, and that adaptation can contribute to mitigating impacts and losses”."
        },
        {
            "text": "This gets to the heart of what we need to do, not just internationally but in every corner of our country. Only by joining up the way we use land and sea can we deliver the outcomes needed to restore Nature and meet our goals under the Environment Act. That means strengthening and creating partnerships at all levels, including government, business, academic, charity and community."
        },
        {
            "text": "In England, where agriculture accounts for more than two thirds of the land, our relationship with farmers in helping them to produce food in a more environmentally beneficial way is vital. Food security is best achieved in the long term by environmental security and that is what we are aiming for through the new Environmental Land Management schemes."
        },
        {
            "text": "Similarly, in a highly populated country the way we maintain and build our communities will dictate how well we can provide the homes and Nature-rich places that we know people want to live in and which will make them healthier and happier. Local Nature Recovery Strategies are one way in which Natural England can support local government and people to identify and implement the measures that will enhance their towns and villages."
        },
        {
            "text": "Many of the solutions are at hand and while I was in Dubai I was pleased further tools were announced. Defra Secretary of State announced a new pilot platform – Projects for Nature – as part of a 10 Point Plan."
        },
        {
            "text": "This platform has been developed by a pioneering new partnership between Defra, Natural England, Environment Agency and the Council for Sustainable Business, Crowdfunder, and Accenture. It will help to connect businesses who have shown leadership in addressing their Nature impact, such as Lloyd's Banking Group, with Nature recovery projects that have been selected by Defra Group and that align with our domestic and international environmental commitments."
        },
        {
            "text": "This will support our overall strategy to establish a Nature Recovery Network across England, which will allow us to arrest wildlife decline, enhance our resilience to climate change and improve the health of our population. Achieving this will be a clear demonstration that this country is serious about tackling Nature loss and climate change together and will, I hope provide encouragement to others around the world.\n"
        },
        {
            "text": "If we don’t act decisively in England, it is hard to conceive of reasons why other countries should do any more than us, and if everyone does what they’ve always done then the prospects for people and the rest of life on Earth are not bright."
        },
        {
            "text": "Mike Morecroft’s pre-COP blog Looking ahead to COP28 provides more insight into Natural England’s work on climate change and nature."
        }
    ]
}