{
    "url": "https://publicguardian.blog.gov.uk/2023/12/15/top-tips-on-starting-difficult-conversations-about-lpas/",
    "title": "Top tips on starting difficult conversations about LPAs",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Future planning",
        "Guidance",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2023-12-15T09:40:09+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Starting a conversation about lasting powers of attorney (LPAs) with family and friends can feel uncomfortable."
        },
        {
            "text": "You may think family members can make decisions about your finances or health and welfare if you are no longer able to. This might be something like paying bills on your behalf. This is not the case and they would need legal authority to do so. Although it can be a challenging topic to discuss, having a registered LPA makes it easier for loved ones to support you when you need it most."
        },
        {
            "text": "Someone who has created an LPA is known as the ‘donor’. Only the donor can make decisions about their LPA, such as choosing their attorneys. An attorney is the person chosen to act for the donor on an LPA. Find more definitions in our tackling terminology blog."
        },
        {
            "text": "We spoke to Age UK and Dementia UK for their advice on how to start a conversation about LPAs."
        },
        {
            "heading": 2,
            "text": "5 top tips for starting a conversation with family and friends about LPAs"
        },
        {
            "text": "With thanks to Age UK and Dementia UK for their support"
        },
        {
            "heading": 3,
            "text": "1.   Plan ahead"
        },
        {
            "text": "Think in advance about the best time and place to start the conversation. Finding a place where everyone feels comfortable and can talk for as long as you need to, can help with getting the conversation off to the right start. It can be useful to bring a few key facts, to explain more about what an LPA is, the different types, and how to set one up."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "2.   Have an open conversation"
        },
        {
            "text": " Having an open conversation involves discussing all the options, without any expectations. Give everyone time and space to express their views and feelings and ask questions. Listen to each other without judging and consider choices around finances, health and welfare."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "3.   Respect each other’s choices"
        },
        {
            "text": "Many people may feel anxious talking about LPAs. Always respect each other’s choices. If a family member or friend does not want to talk about making an LPA, respect their choice. Remind each other, you can have this conversation another time when everyone is ready. Remember, as a donor it is your choice who you appoint as your attorneys."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "4.   Start the conversation early"
        },
        {
            "text": "Early discussions result in considered and informed decisions. Avoiding the discussion or leaving it too late can make things more difficult. You can only make an LPA if you have the mental capacity to do so. It’s about putting things in place to make things easier later on."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "5. Take time to find out more"
        },
        {
            "text": "Try not to give too much information about making an LPA all at once. After all, there may be many things to consider at length and too much information in one go can be overwhelming. Instead, note where more information can be found, either online at gov.uk/opg or by printing off information for them."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Caroline Abrahams, Age UK Charity Director says:"
        },
        {
            "text": "“It can give enormous peace of mind to know someone you trust can act for you in the event you are ever unable to make your own decisions.  At the same time, we know, conversations about making an LPA, with loved ones or others, are not always easy. It might be hard to talk about money, health and welfare decisions and the possibility of being unable to make their own decisions in the future. Sometimes it is difficult to know where to start”."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sue Kirkup, Dementia UK Admiral Nurse says:"
        },
        {
            "text": "“Having an open discussion together enables family members to express their wishes. LPAs help families and healthcare professionals make informed decisions which represent the best interests of their loved one and ensures a person-centred approach. Having an LPA helps avoids confusion and uncertainty in the future. It can reduce the pressure on family members when the time comes to making difficult decisions”."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "By starting a conversation today, you can protect your future choices, and make it easier for the people you trust to make decisions for you on your behalf. For more information and guidance visit  www.gov.uk/opg."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Gall dechrau sgwrs am atwrneiaeth arhosol (LPA) gyda theulu a ffrindiau deimlo’n anghyfforddus."
        },
        {
            "text": "Efallai eich bod yn meddwl y gall aelodau o’r teulu wneud penderfyniadau am eich sefyllfa ariannol neu eich iechyd a’ch lles os nad ydych chi’n gallu gwneud hynny mwyach. Gallai hyn fod yn rhywbeth fel talu biliau ar eich rhan. Ond nid felly y mae a byddai angen iddynt gael awdurdod cyfreithiol i wneud hynny. Er ei fod yn gallu bod yn bwnc heriol i’w drafod, mae cael atwrneiaeth arhosol gofrestredig yn ei gwneud yn haws i anwyliaid eich cefnogi pan fydd angen hynny arnoch fwyaf."
        },
        {
            "text": "Gelwir rhywun sydd wedi creu atwrneiaeth arhosol yn ‘rhoddwr’. Dim ond y rhoddwr sy’n gallu gwneud penderfyniadau am ei atwrneiaeth arhosol, fel dewis ei atwrneiod. Atwrnai yw’r person sydd wedi cael ei ddewis i weithredu ar ran y rhoddwr mewn atwrneiaeth arhosol. Mae rhagor o ddiffiniadau ar gael yn ein blog ar fynd i’r afael â therminoleg."
        },
        {
            "text": "Fe wnaethom ni ofyn i Age UK a Dementia UK am eu cyngor ar sut i ddechrau sgwrs am atwrneiaeth arhosol."
        },
        {
            "heading": 2,
            "text": "5 top tips for starting a conversation with family and friends about LPAs"
        },
        {
            "text": "Gyda diolch i Age UK a Dementia UK am eu cymorth"
        },
        {
            "heading": 3,
            "text": "1.  Cynllunio ymlaen llaw"
        },
        {
            "text": "meddyliwch ymlaen llaw am yr adeg a'r lle gorau i ddechrau’r sgwrs. Gall dod o hyd i rywle y mae pawb yn teimlo’n gyfforddus ynddo a lle rydych chi’n gallu siarad am faint bynnag o amser sydd ei angen arnoch, yn gallu helpu i roi cychwyn da i'r sgwrs. Gall fod yn ddefnyddiol cynnwys ychydig o ffeithiau\nallweddol, er mwyn esbonio mwy am beth yw atwrneiaeth arhosol, y gwahanol\nfathau sydd ar gael, a sut i sefydlu un."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "2.  Cael sgwrs agored"
        },
        {
            "text": "Mae cael sgwrs agored yn golygu trafod yr holl opsiynau, heb ddisgwyl dim byd. Rhowch yr amser a’r lle i bawb fynegi eu barn a’u teimladau ac i ofyn cwestiynau. Gwrandewch ar eich gilydd heb farnu ac ystyriwch y dewisiadau o ran cyllid, iechyd a lles."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "3.  Parchu dewisiadau eich gilydd"
        },
        {
            "text": "Mae llawer o bobl yn gallu teimlo’n bryderus wrth sôn am atwrneiaeth arhosol. Dylech bob amser barchu dewisiadau eich gilydd. Os nad yw aelod o’r teulu neu ffrind am drafod gwneud atwrneiaeth arhosol, parchwch ei ddewis. Atgoffwch eich gilydd y gallwch chi gael y sgwrs rhywbryd eto pan fydd pawb yn barod i wneud hynny. Cofiwch, fel rhoddwr, eich dewis chi yw pwy rydych chi’n eu penodi’n atwrneiod i chi."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "4.  Dechrau’r sgwrs yn gynnar"
        },
        {
            "text": "Mae trafodaethau cynnar yn golygu bod modd gwneud penderfyniadau ystyriol ar sail gwybodaeth. Mae osgoi'r drafodaeth neu ei gadael hi’n rhy hwyr yn gallu gwneud pethau’n fwy anodd. Dim ond os oes gennych chi’r galluedd meddyliol i wneud hynny y gallwch chi wneud atwrneiaeth arhosol. Mae’n ymwneud â rhoi pethau yn eu lle i wneud pethau’n haws yn nes ymlaen."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "5. Cymerwch amser i gael rhagor o wybodaeth"
        },
        {
            "text": "Ceisiwch beidio â rhoi gormod o wybodaeth i bobl ar yr un pryd am wneud atwrneiaeth arhosol. Wedi’r cyfan, efallai y bydd llawer o bethau i’w hystyried yn fanwl a gall gormod o wybodaeth ar y tro fod yn llethol. Yn hytrach, nodwch lle gellir dod o hyd i ragor o wybodaeth, naill ai ar-lein yn gov.uk/opg neu drwy argraffu gwybodaeth a’i roi iddynt."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Dywed Caroline Abrahams, Cyfarwyddwr Elusen Age UK:"
        },
        {
            "text": "“Mae’n gallu rhoi tawelwch meddwl enfawr i wybod bod rhywun rydych chi’n ymddiried ynddo yn gallu gweithredu ar eich rhan os byth na fyddwch chi’n gallu gwneud penderfyniadau drosoch chi eich hun. Ar yr un pryd, rydym yn gwybod nad yw sgyrsiau am wneud atwrneiaeth arhosol, gydag anwyliaid neu unrhyw un arall, bob amser yn hawdd. Gall fod yn anodd trafod penderfyniadau ynghylch arian, iechyd a lles a’r posibilrwydd na fydd rhywun yn gallu gwneud penderfyniadau drosto’i hun yn y dyfodol. Weithiau mae’n anodd gwybod ble i ddechrau”."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Dywed Sue Kirkup, Nyrs Admiral Dementia y DU:"
        },
        {
            "text": "“Mae cael trafodaeth agored gyda’ch gilydd yn galluogi aelodau o'r teulu i fynegi eu dymuniadau. Mae atwrneiaeth arhosol yn helpu teuluoedd a gweithwyr gofal iechyd proffesiynol i wneud penderfyniadau ar sail gwybodaeth sy’n cynrychioli buddiannau gorau eu hanwyliaid ac yn sicrhau dull sy’n canolbwyntio ar yr unigolyn. Mae cael atwrneiaeth arhosol yn helpu i osgoi dryswch ac ansicrwydd yn y dyfodol. Gall leihau’r pwysau ar aelodau’r teulu pan ddaw’r amser i wneud penderfyniadau anodd”."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Drwy ddechrau sgwrs heddiw, gallwch ddiogelu eich dewisiadau yn y dyfodol, a’i gwneud yn haws i’r bobl rydych chi’n ymddiried ynddynt wneud penderfyniadau ar eich rhan. I gael rhagor o wybodaeth ac arweiniad, ewch i www.gov.uk/opg."
        },
        {
            "text": " "
        }
    ]
}