{
    "url": "https://socialcare.blog.gov.uk/2023/08/18/the-power-of-nhs-and-care-volunteer-responders/",
    "title": "The power of NHS and care volunteer responders",
    "authors": [
        "Samantha Ward OBE"
    ],
    "categories": [
        "Care and support",
        "Workforce"
    ],
    "pub_date": "2023-08-18T15:46:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Enhancing care experiences"
        },
        {
            "text": "The NHS and Care Volunteer Responders programme, which was originally created to support NHS colleagues and services in England during the pandemic, has recently extended its reach to adult social care. The joint programme aims to ease pressure on care providers and enhance the experience of people drawing on care services."
        },
        {
            "text": "Historically, volunteering in social care has been a little more informal than volunteering within the NHS. This expansion is changing that."
        },
        {
            "text": "By offering services including collection and delivery of groceries, medication and essentials, and providing wellbeing support through friendly check-in calls, volunteer responders are freeing up valuable time for care colleagues and adding value for those receiving care."
        },
        {
            "text": "That’s not to say volunteer responders are the answer to workforce shortages. They will never be a replacement for paid social care professionals."
        },
        {
            "text": "The programme’s expansion is backed by research, conducted by Royal Voluntary Service, which found that volunteer support improved and enriched people’s experiences of care in care home settings. The evidence highlighted further benefits for care recipients, including improved mood, enhanced cognitive functions, and general improvements in care service quality."
        },
        {
            "heading": 2,
            "text": "Supporting full time care colleagues"
        },
        {
            "text": "Care colleagues also actively want to work with volunteers. 98% stated they ‘enjoy working with volunteers’ and 90% of colleagues not currently working with them would like to see their involvement increase."
        },
        {
            "text": "In opening up to social care, the programme is extending the positive impact of  volunteering in the sector by making it as easy as possible for social care providers to request volunteer support, and for individuals to receive support."
        },
        {
            "text": "The research also showed there is a public interest in care sector volunteering with 43% planning or considering offering their time. The NHS and Care Volunteer Responders programme offers flexible volunteering that makes it incredibly easy for individuals to support and enrich the sector."
        },
        {
            "text": "To reiterate, volunteers do not replace highly valued health and care staff or take on their roles and responsibilities; instead, they offer a complementary support function, enhancing the care experience for everyone involved. By collaborating with volunteers, care professionals can focus on individuals with complex needs, empowering them to live independently and improving the overall quality of care."
        },
        {
            "text": "Local authorities, health, wellbeing, prevention and care staff can leverage the programme to arrange various types of volunteer support. Some local authorities have already begun including this provision in care packages, adding value and boosting people’s experiences of care."
        },
        {
            "heading": 2,
            "text": "Proving it works"
        },
        {
            "text": "Caroline Callaghan, Senior Community Navigator at Hartlepool Borough Council, has been making referrals for Volunteer Responders support and is eager for other colleagues to make use of the service, commenting: ‘It’s quick and easy to make a… referral. I regularly remind our team the programme is there for us to refer into and to support the people we’re working with.’"
        },
        {
            "text": "Personal testimonies reveal the profound impact of volunteer phone calls on the lives of isolated individuals with chronic illnesses. David Fielden is a 54-year-old man from Somerset who is housebound. In addition to a carer who visits once a week, David receives regular phone calls as part of the programme. He said:"
        },
        {
            "text": "The Volunteer Responders programme has proven to be a meaningful and transformative initiative that positively impacts volunteers, care recipients and health and care providers. Local government professionals are encouraged to refer individuals in need to this programme, allowing them to experience the multiple benefits of volunteer support. Embracing the power of volunteers and utilising this resource can complement the existing workforce packages and help to strengthen our communities."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We want more local government professionals and health and care providers to make full use of the programme. It’s incredibly straightforward to add Volunteer Responders support to care packages and I urge anyone interested in exploring this additional service to visit our website or call our Support Team on 0808 196 3382 to find out more information or to make a referral."
        }
    ]
}