{
    "url": "https://prisonjobs.blog.gov.uk/2023/08/18/why-working-in-prison-catering-is-a-great-career-choice/",
    "title": "Why working in prison catering is a great career choice",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "Prison catering"
    ],
    "pub_date": "2023-08-18T14:38:54+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Having started out as a chef in the Army, Darren has carved out a career for himself in prison catering. Now a catering manager at HMP Lewes, he tells us what it’s like working in a prison kitchen and what he enjoys about his work."
        },
        {
            "text": "Working as a caterer in the Prison Service is similar to working as an Army chef. We work in big, commercial sized kitchens preparing meals for large numbers of people. And there’s no difference between cooking meals for prisoners and Armed Forces personnel – if they don’t like your food, they’ll soon let you know!"
        },
        {
            "text": "When I first left the Army, after serving for nearly 16 years, I worked split shifts in a pub restaurant kitchen. Six days a week, I’d start at 9am, finish around 3pm, be back in work for 5pm and often not get home until midnight. The main reason I’d left the Army was to spend more time with my family, so it wasn’t long before I was looking for a new job with better hours."
        },
        {
            "text": "A better work-life balance and opportunities for progression"
        },
        {
            "text": "It was the working hours that initially appealed to me when I saw an advert for a catering job at HMP Ashwell: 5 days a week, including every other weekend, and I’d get to spend evenings with my family. I applied, was successful, and started what’s been a great second career for me in prison catering. Starting off as a Band 3 caterer, I was promoted to catering supervisor within 4 years. And, following another progression 4 years later, I’ve been a catering manager ever since."
        },
        {
            "text": "The transition from Army chef to prison caterer was easy for me. Just like in the Army, there’s a great sense of teamwork and camaraderie in a prison kitchen and the focus is on getting meals out on time for large numbers of hungry people. The main differences are that in prisons, we work alongside prisoners and the kitchen knives are kept in locked cabinets and checked in and out every day."
        },
        {
            "text": "What it’s like working in a prison kitchen"
        },
        {
            "text": "Safety and security in a prison kitchen are taken very seriously and I’ve never felt at risk. The prisoners you work with are generally happy to be out of their cells and working. While they’re obviously in prison for a reason, they’re people just like you and me. You just need to be able to give them clear instructions and supervise their work. "
        },
        {
            "text": "Prison caterers supervise prisoners to prepare meals for the prison population. Many of the individuals you work with have little or no knowledge of catering, so a key part of your role is showing them how to cook different meals and teaching them how to work safely and efficiently in a large kitchen. The new skills prisoners learn can be beneficial when they leave prison. For some, it could simply mean they are able to cook affordable, nutritious meals for themselves and their families. Others choose to study for catering qualifications while they’re in prison, increasing their chances of employment when they return to their communities. This is one of the most rewarding parts of the job: knowing your work has an impact far beyond the kitchen."
        },
        {
            "text": "Make an impact and get great benefits"
        },
        {
            "text": "When you work in a prison kitchen, every day is different. So you need to be adaptable and resilient. But if you’ve got good people skills, it’s a great opportunity to continue doing what you love best – cooking for others – and start every day with a sense of purpose."
        },
        {
            "text": "Plus, you’ll benefit from a good work-life balance, career progression opportunities, job security and a range of Civil Service benefits – including a great pension. "
        }
    ]
}