{
    "url": "https://apprenticeships.blog.gov.uk/2022/11/04/cop27-update-70-green-apprenticeships-fit-for-a-king/",
    "title": "COP27 Update: 70 green apprenticeships fit for a King",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "COP27",
        "Employers",
        "Green apprenticeship advisory panel",
        "The Institute"
    ],
    "pub_date": "2022-11-04T15:12:42+00:00",
    "content": [
        {
            "text": "November is the United Nations Climate Change summit COP27."
        },
        {
            "text": "Recently, King Charles III - who hosted a reception at Buckingham Palace ahead of the conference - expressed how \"vital\" apprenticeships are."
        },
        {
            "text": "Apprenticeships received the Royal seal of approval from the nation’s most prominent environmentalist the King when he appeared on the BBC One television show The Repair Shop."
        },
        {
            "text": "We believe technical education and apprenticeships are important in both retraining the current workforce and equipping young people with the skills required for the transition to net zero."
        },
        {
            "text": "A total of 70 apprenticeships are now supportive of green or net zero goals, with well over 100 existing apprenticeships also up for revision to make them greener. These include sustainability business specialist, ecologist, countryside ranger, and forest craftsperson. They have been updated by employers, to make sure they fit the economy’s emerging green skills needs, with support from the Institute for Apprenticeships and Technical Education (IfATE)."
        },
        {
            "text": "One of the 70 is for aspiring electricians. As well as all the traditional skills for this trade, this apprenticeship now trains people to install and maintain domestic heat pumps, solar panels, and electric vehicle charging points, proving all occupations can make a difference.  "
        },
        {
            "text": "Jennifer Coupland, chief executive of IfATE, said:"
        },
        {
            "text": "The Green Advisory Panel has also worked with IfATE to launch a sustainability framework for employers to use in assessing how the apprenticeships can contribute to climate change goals, no matter what sector they are in. "
        },
        {
            "text": "Later this month, we will be publishing our environmental and climate change skills strategy detailing what more we will be doing in support of the green agenda."
        }
    ]
}