{
    "url": "https://defencedigital.blog.gov.uk/2022/11/04/digital-discoveries-part-1-reviewing-projects-to-proceed-with/",
    "title": "Digital Discoveries Part 1: Reviewing projects to proceed with",
    "authors": [
        "Jonathan Richardson"
    ],
    "categories": [
        "Digital Discovery Assessment Board"
    ],
    "pub_date": "2022-11-04T12:47:14+00:00",
    "content": [
        {
            "text": "The Digital Discovery Assessment Board (DDAB) is part of D Info and it accepts submissions to the Digital Discovery Gateway for project proposals. "
        },
        {
            "text": "Anyone can submit a project through the Digital Discovery Gateway and submitters are asked to summarise and give key information about their project and why they want DDAB’s assistance. "
        },
        {
            "heading": 2,
            "text": "Deciding which proposals to proceed with"
        },
        {
            "text": "In many ways the team became a victim of its own success once teams heard about the projects we had helped with. With a limited team, a way to prioritise projects was needed to prevent the team being overstretched, or important or urgent projects being overlooked. "
        },
        {
            "text": "We needed to produce a way to vet the proposed Discovery applications to review if the proposal needed a Discovery. This is not a new problem within defence as Silvia Grant's post from earlier this year explains."
        },
        {
            "text": "Some organisations run these reviews as pre-Discoveries or assessments but we used the term “First Look” as that’s what the Navy used in a (since deleted) blog post and where we got the inspiration."
        },
        {
            "text": "We reviewed these methods but couldn’t find one that solved all of our problems so we assembled a team to decide what we needed. We were fortunate in that we were at a firebreak before starting new projects so we had time to plan First Looks, test them out on new projects and allocate some time to review and refine them as we continued with the other work."
        },
        {
            "heading": 2,
            "text": "Creating First Looks"
        },
        {
            "text": "A First Look lets the team quickly get a broad enough understanding of a potential Discovery project’s problems, users, potential outcomes and current priorities to allow it to decide what the best next steps are. "
        },
        {
            "text": "These next steps could be to proceed to a full Discovery, hand back to the team, or pass onto a development team. "
        },
        {
            "heading": 2,
            "text": "First Look creation team"
        },
        {
            "text": "The team that worked on the First Look had similar skill sets to those who would carry out a Discovery – a Delivery Manager, User Researchers, Business Analyst."
        },
        {
            "text": "Being based across the country we used an online whiteboard to discuss ideas while having several in-person workshops to debate it. "
        },
        {
            "text": "We treated this like any other Agile project with a Product Owner and giving regular show and tells to the wider team along with regular standups to track progress. "
        },
        {
            "heading": 2,
            "text": "Defining our needs and users"
        },
        {
            "text": "Our sessions focused on “What did we want to achieve by the end of a First Look?”. Early on we decided that it had to be that “we had enough information for the team to make a decision on the best next step”."
        },
        {
            "text": "For users we decided that the First Look team would be the main users with the wider DDAB team being secondary users along with the Gateway submission users as other users."
        },
        {
            "text": "We then looked at how we would get about answering this with the least amount of work:"
        },
        {
            "text": "We decided that we needed to have good enough answers to high level questions. To help us then focus these questions into more specific areas we looked at what other user researchers have looked at and used the 8 Pillars of User Research as one framework."
        },
        {
            "heading": 2,
            "text": "The 8 Pillars of User Research and forming interview questions "
        },
        {
            "text": "The global ResearchOps community researched what are the main areas that user research operates within. As Discovery is a user research-led process it made sense to frame our questions within a user research framework. "
        },
        {
            "text": "The 8 pillars are:"
        },
        {
            "text": "We took these 8 pillars and created top-level questions or outcomes around them:"
        },
        {
            "text": "2.  Scope"
        },
        {
            "text": "3.  Recruitment and Admin"
        },
        {
            "text": "4.  Data and Knowledge Management "
        },
        {
            "text": "5.  People"
        },
        {
            "text": "6.  Organisational context"
        },
        {
            "text": "7.  Governance"
        },
        {
            "text": "8.  Tools and infrastructure "
        },
        {
            "text": "Once we decided what we needed to achieve we set out defining how we would go about answering these questions and validating our assumptions that this was the right approach. "
        },
        {
            "text": "Read more in Part 2 our principles and methods for a First Look."
        }
    ]
}