{
    "url": "https://disabilityunit.blog.gov.uk/2022/11/04/disability-cricket-a-growing-world-of-opportunity/",
    "title": "Disability Cricket – A growing world of opportunity",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-11-04T16:15:34+00:00",
    "content": [
        {
            "text": "One of cricket’s best kept secrets is the opportunity that exists for people living with disability to get involved in the sport. The game’s latest participation figures show a staggering 70,000 plus disabled people play the game through  a variety of formats. The number continues to grow, as do the opportunities."
        },
        {
            "text": "Cricket is an inclusive sport by its nature. It’s a sport that many people play and follow and have a life-long passion for. "
        },
        {
            "heading": 2,
            "text": "Get back into the game or start up"
        },
        {
            "text": "A strong working relationship between the England and Wales Cricket Board (ECB)and the Lords Taverners is in place which helps every county cricket board develop community-based cricket provision for disabled people through their Super1’s initiative. "
        },
        {
            "text": "There is an ever-growing list of adapted ways to play the game which are being played across the country to ensure the reach of cricket is maximised and meets everyone's needs."
        },
        {
            "heading": 2,
            "text": "Tabletop cricket"
        },
        {
            "text": "One adapted way to play is tabletop cricket, where people’s fine and gross motor skills are challenged in a competitive way. "
        },
        {
            "text": "It is specially designed to give disabled people the chance to play and compete in the sport we all love. It is played through all county boards and competitions that culminate in a national final, held at the home of cricket, Lords Cricket Ground."
        },
        {
            "text": "The ECB last year launched their Disability Champions Club scheme. The scheme encourages mainstream cricket clubs to sign up to become a champion club and develop disability cricket as part of their core club offer. Over 2,100 cricket clubs across the UK have already signed up!"
        },
        {
            "text": "For those disabled players who wish to advance their careers in cricket, county-level disability cricket is available through the Super9’s Softball competitions, the D40 Hardball competitions, and for people who are blind or visually impaired."
        },
        {
            "heading": 2,
            "text": "Disability Premier League"
        },
        {
            "text": "In 2022, a new disability cricket league was launched called the Disability Premier League."
        },
        {
            "text": "This competition will see the best disabled players compete against one another at a star-studded event over three weekends late in the summer. The two top teams will get the chance to compete in a final at the county ground in Bristol, preceding a women’s international game."
        },
        {
            "text": "At the top of the tree, there are four England disability teams, all of whom compete in international series both home and abroad. Teams containing physical disability, learning disability, hearing and visual impairments play regularly with domestic fixtures and foreign tours."
        },
        {
            "text": "The squads with learning, visual and hearing impairments are headed to Australia in June 2022 to compete against their counterparts in the first ever multi-squad tour. The England Learning Disability team, which has lost just one match since 2009, last played in 2019 when they defeated Australia 8 to none. England also hold the Blind Ashes and won on their last trip to Australia in 2016, so fingers crossed for the teams this year!"
        },
        {
            "heading": 3,
            "text": "Cricket is a year long sport, so if you are interested in getting involved in disability cricket, or know someone who would like to, please email us at disabilitycricket@ecb.co.uk"
        }
    ]
}