{
    "url": "https://defradigital.blog.gov.uk/2022/11/04/leaders-blog-chris-howes-why-ill-be-at-cop27/",
    "title": "Leader's blog: Chris Howes - why I’ll be at COP27",
    "authors": [
        "Chris Howes, Chief Digital and Information Officer"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation",
        "ICT sustainability"
    ],
    "pub_date": "2022-11-04T11:30:26+00:00",
    "content": [
        {
            "text": "Defra Chief Digital and Information Officer Chris Howes looks ahead to COP27 and sets out the benefits of the new Government Digital Sustainability Alliance charter."
        },
        {
            "text": "Last year, at COP26, we hosted our ground-breaking Technology for Climate event in Glasgow. During the event, attended by close to 2,000 stakeholders, CEOs and senior leaders from a range of technology companies came together to discuss how they could best help reduce the harmful impact industrialisation is having on the environment."
        },
        {
            "text": "Next week I’m heading to COP27 in Sharm El Sheikh, and I’ll be inviting our partners in the Government Digital Sustainability Alliance (GDSA), formerly the Defra e-Sustainability Alliance, to join me as the first cohort to sign our joint charter."
        },
        {
            "text": "The charter aims to seek technological solutions to meet Defra and the UK Government’s sustainability commitments."
        },
        {
            "heading": 2,
            "text": "How we’re leading on ICT sustainability"
        },
        {
            "text": "As a global leader, Defra needs to ensure Information Communications Technology (ICT) is rationalised, resilient, responsible, and free from exploitation throughout our digital infrastructure and associated supply chains.\nGDSA is a collaborative partnership made up of existing or prospective suppliers to the UK Government, working with members varying from small and medium enterprises to multinational global firms."
        },
        {
            "text": "I am most proud of our work to break down traditional organisational boundaries, to share information and knowledge. As we work together to develop, design, and deliver demonstrators we will enable the government and our partners to manage and mitigate risks, and maximise opportunities."
        },
        {
            "text": "The 2022 United Nations Climate Change Conference, more commonly referred to as COP27, will be the twenty seventh such event. It takes place from 6th to 18th November."
        },
        {
            "text": "At the event, countries come together to take action towards achieving the world's collective climate goals as agreed under the Paris Agreement."
        },
        {
            "heading": 2,
            "text": "Making further progress"
        },
        {
            "text": "This year I’m hoping to ensure momentum isn't lost from the ground-breaking tech for climate event at COP26 through direct engagement, and attendance at keynotes and panels. I also hope to learn more about the priorities and challenges facing global climate, first-hand."
        },
        {
            "text": "And I plan to use the insight gained to inform our GDSA 12-month plan, building on the great progress of our working groups on Circular Economy, Scope 3 emissions and Global Ecological Impact."
        },
        {
            "text": "As an organisation we are keen to understand what may, or may not, be possible and how we can use our leadership role and influence to bring the global ecosystem of technology and digital leaders together to tackle some of the planet’s most pressing issues."
        },
        {
            "text": "I’d love to hear from organisations who are interested in joining us in the Government Digital Sustainability Alliance, so do get in touch."
        }
    ]
}