{
    "url": "https://hmlandregistry.blog.gov.uk/2022/11/04/protecting-your-property-from-fraud-form-ll-the-counter-fraud-restriction/",
    "title": "Protecting your property from fraud: Form LL – the ‘counter-fraud’ restriction",
    "authors": [
        "Chloe Evans, Head of Counter-Fraud Policy"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2022-11-04T14:43:49+00:00",
    "content": [
        {
            "text": "A restriction in the property title register limits the owner’s ability to deal with the property.  For example, depending on the wording, it might prevent the owner from selling, leasing, mortgaging or remortgaging the property without taking further action."
        },
        {
            "text": "There are different types, or forms, of restriction. Form LL is often referred to as the 'counter-fraud' restriction."
        },
        {
            "heading": 2,
            "text": "Form LL restriction – the pros"
        },
        {
            "text": "For many people, property is their most valuable asset and they want to protect it. There are a few ways to do this and, depending on the circumstances, sometimes conveyancers recommend applying to enter a Form LL restriction against the property."
        },
        {
            "text": "Organised criminals often target the most vulnerable properties or property owners. If you're living or working away from home, for example, or it's empty for a while, sometimes fraudsters can impersonate the registered owner and sell or mortgage the property without your knowledge."
        },
        {
            "text": "So, a Form LL could be worth considering if you’re a landlord, you don’t live in your property or if it’s likely to be left empty for any period of time. If you’re in such a category and you add this restriction to your property register, it might make your property a less tempting target for fraud."
        },
        {
            "heading": 2,
            "text": "Form LL restriction – the cons"
        },
        {
            "text": "But, having this restriction in your register can cause delays in the process of selling, leasing or mortgaging your property because, as we’ve said, you’ll need to address additional hurdles, which can take time to resolve. You might want to consider other measures instead - see below."
        },
        {
            "heading": 2,
            "text": "How it works"
        },
        {
            "text": "A Form LL restriction is designed to help prevent the type of fraud in which a swindler obtains identity documents in the name of the registered property owner, and uses them to persuade a buyer or lender that they are the true owner of the property. This could be a tenant with access to it, or another party."
        },
        {
            "text": "The restriction reads: \"No disposition of the registered estate by the proprietor of the registered estate is to be registered without a certificate signed by a conveyancer that the conveyancer is satisfied that the person who executed the document submitted for registration as disponor is the same person as the proprietor.\""
        },
        {
            "text": "To sell or mortgage the property, the fraudster has to obtain a certificate from a conveyancer to comply with the Form LL restriction in the register. It might be difficult to convince the conveyancer that they are the true owner, so the fraudster could be deterred from targeting the property."
        },
        {
            "heading": 2,
            "text": "What this means for the registered proprietor"
        },
        {
            "text": "In simple terms, it means that – like the fraudster - you'll need a professional conveyancer, such as a solicitor, to personally verify your identity before you (the owner) can mortgage or sell the property.  You’ll need to obtain a certificate signed by a conveyancer to say that you, as the registered proprietor, have signed the transfer, lease or mortgage deed."
        },
        {
            "text": "That isn’t necessarily a problem, but it can cause delay in the transaction process while you obtain the required certificate."
        },
        {
            "heading": 2,
            "text": "Other measures you can take"
        },
        {
            "text": "For greater peace of mind, you can sign up to HM Land Registry's free Property Alert service. Property Alert notifies you when there’s activity on the register in relation to the property so that you can address it if needs be."
        },
        {
            "heading": 2,
            "text": "Apply for a Form LL restriction – three ways"
        },
        {
            "text": "If, after careful consideration, you've decided you want a Form LL restriction in your property title register, what next?"
        },
        {
            "text": "Although we recommend seeking legal advice, you don't need anyone to help you apply for the restriction. Head to GOV.UK for information about protecting your land and property from fraud, and for detailed guidance see HM Land Registry’s Practice Guide 19."
        },
        {
            "text": "Fill in a request for a restriction if you’re a company owning property and send your application to the address on the form - there’s no fee."
        },
        {
            "text": "Fill in a request for a restriction for owners not living at the property if you own the property privately – again there’s no fee."
        },
        {
            "text": "Fill in an application for a restriction. It costs £40."
        },
        {
            "text": "Send completed forms to HM Land Registry Citizen Centre, PO Box 74, Gloucester GL14 9BB."
        },
        {
            "text": "We’ll tell you when we add the restriction."
        }
    ]
}