{
    "url": "https://ipo.blog.gov.uk/2022/11/04/tackling-ip-crime-with-trading-standards/",
    "title": "Tackling IP crime with Trading Standards",
    "authors": [
        "Marcus Evans"
    ],
    "categories": [
        "Business",
        "Enforcement",
        "IPO"
    ],
    "pub_date": "2022-11-04T15:09:19+00:00",
    "content": [
        {
            "text": "Collaboration and partnerships are key to the IPO’s efforts to combat IP crime and form the core of the IPO’s new counter-infringement strategy. The IPO’s work with our partners is crucial for the strategy’s success. Our partnership with Trading Standards is a central element of this jigsaw. Marcus Evans, IPO’s Deputy Director of Intelligence and Law Enforcement explains…"
        },
        {
            "heading": 3,
            "text": "IP crime – an ongoing threat to us all"
        },
        {
            "text": "IP rights are only as valuable as our ability to protect them.  The power of brands in adding value to our economy is beyond doubt. But the infringement of IP rights, and IP crime, are significant ongoing threats to this value."
        },
        {
            "text": "In the fight against IP crime, we all have a role to play.  And the IPO is working with partners including City of London Police IP Crime Unit (PIPCU), Border Force, the Regional Organised Crime Unit (ROCU) network, as well as Trading Standards, to join the dots."
        },
        {
            "text": "This year, we published our ambitious new Counter-Infringement Strategy. It represents a step-change in our ambition to protect IP rights. An intelligence-led, harm focussed approach based on collaboration and partnership is at its heart."
        },
        {
            "text": "The role of Trading Standards is a crucial piece of this jigsaw."
        },
        {
            "heading": 3,
            "text": "Trading Standards – a central role in an evolving landscape"
        },
        {
            "text": "Counterfeit goods are often sold locally, having been facilitated and routed across global supply chains by organised and international criminal networks."
        },
        {
            "text": "Trading Standards authorities combat all kinds of IP crime in our communities. This often involves tackling complex criminal networks."
        },
        {
            "text": "The threat of IP crime – like other forms of criminality – is becoming increasingly complex. New and evolving technology has changed the way both legitimate and illegitimate goods are accessed. The pandemic has changed things too. Criminals can act at speed - we need to react just as quickly, and stay ahead."
        },
        {
            "text": "The intelligence gathered from the work of Trading Standards is a key weapon in our collective armoury and a powerful tool to inform our approach."
        },
        {
            "heading": 3,
            "text": "Building a picture from the front line"
        },
        {
            "text": "Trading Standards officers are working tirelessly on the front line to tackle all kinds of IP crime directly."
        },
        {
            "text": "As well as helping to tackle the supply of counterfeits head-on, their work also provides invaluable insight into the real impact of IP crime on consumers and communities, and the nature of the criminality involved."
        },
        {
            "text": "This year’s Trading Standards Successes Report shows that IP crime is very much ‘back on the streets’, with Trading Standards Authorities reporting an increase in engagement with high street retailers and outdoor markets in particular."
        },
        {
            "text": "There has been a 10% increase in investigations involving the sale of both counterfeit tobacco products and clothing and an increase of just under 10% in respect of footwear."
        },
        {
            "text": "The type of counterfeit product encountered by trading standards officers during their investigations has also seen changes, with an increase of around 30% in respect of goods related to vaping.  This shows how the market for counterfeit vaping products has transformed during the last four years from a relatively niche area of criminal activity into a more significant one."
        },
        {
            "text": "Similarly, when compared with statistics for 2020-21, increases in levels of investigation were encountered in all major product types, particularly, tobacco products, clothing, footwear and alcohol."
        },
        {
            "text": "The trends we can discern from these figures help us identify how criminal activity is evolving.  For example, while investigations into cases involving products like cosmetics, makeup, perfume, electric goods, watches and jewellery are rising, they have not returned to pre-pandemic levels. Indeed, in more positive news, investigations into DVDs, CDs and computer games have declined in volume consistently over the past four years."
        },
        {
            "heading": 3,
            "text": "Exposing the link with organised crime"
        },
        {
            "text": "We know that IP crime is often considered by criminals as a low-risk but very high-reward crime. The IPO’s new strategy highlights the link between IP crime and other serious criminality such as money laundering, which we know from very sad evidence causes significant harm across communities.\nThe work of Trading Standards helps us understand this aspect of the problem, providing valuable intelligence to help build a more detailed and complete picture.\nThe figures in this year’s trading standards successes report again are telling:"
        },
        {
            "text": "These show that benefit fraud, for example, may often be related to cases involving IP crime. Increases in cases involving violence, people trafficking, and money laundering are also all sadly evidenced in this year’s statistics. 40% of contributing trading standards authorities reported cases linked to organised criminal groups - a significant increase compared with the previous year."
        },
        {
            "text": "The link between IP crime and other forms of  organised criminality is already well-established.  Our emphasis on collaboration between government departments, law enforcement agencies and private industry is motivated by a desire to increase awareness of these links.  A strong evidence base is the bedrock of this work, and Trading Standards plays a crucial role in providing this."
        },
        {
            "heading": 3,
            "text": "Collaboration is key"
        },
        {
            "text": "The IPO’s new counter-infringement strategy is ambitious. Effective partnerships across government, and with industry, will be vital to its long-term success."
        },
        {
            "text": "The most recent trading standards successes report clearly demonstrates the importance of a continued close relationship within the Trading Standards community, with police forces, HM Revenue and Customs (HMRC), Companies House, the IPO’s Intelligence Hub and UK Border Force. This is why we are trialling the secondment of funding of IP  crime coordinator and analyst posts in Trading Standards, police Regional Organised Crime Units (ROCUs) and UK Border Force."
        },
        {
            "text": "This wider network of partners allows for more effective crime prevention, and a better understanding of the scale and scope of the challenge. In turn, this helps us work together to build a range of solutions based on the strongest possible intelligence base."
        },
        {
            "text": "Our stakeholders representing the interests of industries are equally important. The Anti-Counterfeiting Group (ACG), React and FACT, help maintain close cooperation between IP owners and Trading Standards Authorities. We need the involvement and expertise of rights holders, and their representatives, to collaborate on a shared approach to awareness raising, and increasing understanding of IP rights."
        },
        {
            "text": "All our partners – across the public sector and within industry - have a crucial role to play.  Respect for IP rights, in the long run, stems from awareness and understanding.  Our partnership with Trading Standards plays a pivotal role in both tackling the supply of counterfeits, and educating consumers about the real threats counterfeits pose to them and their families."
        },
        {
            "text": "How we all work together to promote this message will be crucial to our shared goal of making IP crime and infringement socially unacceptable to all."
        },
        {
            "text": " "
        }
    ]
}