{
    "url": "https://ukhsa.blog.gov.uk/2022/11/04/the-uk-public-health-rapid-support-team-a-renewed-commitment-to-tackling-infectious-diseases/",
    "title": "The UK Public Health Rapid Support Team - A renewed commitment to tackling infectious diseases",
    "authors": [
        "Ed Newman"
    ],
    "categories": [
        "Global health"
    ],
    "pub_date": "2022-11-04T17:07:39+01:00",
    "content": [
        {
            "text": "The UK-Public Health Rapid Support Team is a key international partner in infectious disease outbreak detection, prevention, preparedness and response; operational research; and capacity strengthening."
        },
        {
            "text": "The team partners with low- and-middle income countries to support effective response to outbreaks before they develop into global health emergencies, and are able to deploy teams of public health specialists over a range of technical disciplines to outbreak areas within 48 hours."
        },
        {
            "text": "This is an innovative partnership between the UK Health Security Agency and the London School of Hygiene & Tropical Medicine, funded with UK aid by the UK Department of Health and Social Care."
        },
        {
            "text": "New director Dr Ed Newman reflects on the history of the UK Public Health Rapid Support Team, its relevance in a post-COVID world and his plans for its future."
        },
        {
            "heading": 2,
            "text": "From the beginning"
        },
        {
            "text": "Since its inception in 2016, the UK Public Health Rapid Support team (UK-PHRST) has worked tirelessly to provide effective support to low- and-middle income countries (LMICs) in outbreak response. The UK-PHRST, which draws on a talented and multi-disciplinary team of public health specialists from across a range of disciplines and backgrounds, can be deployed to affected areas within 48 hours."
        },
        {
            "text": "The UK-PHRST was formed in the wake of the 2014-2015 West Africa Ebola outbreak to support low- and-middle income countries to prepare, detect and respond to disease outbreaks before they develop into global health emergencies."
        },
        {
            "text": "It’s fair to say that COVID-19 has proven the team’s mandate crucial – viruses can and do move unpredictably and at great speed. Infectious diseases are not constrained by borders, and no one is safe until we all are safe."
        },
        {
            "heading": 2,
            "text": "Our strategy"
        },
        {
            "text": "I am honoured and excited to be the director of the UK-PHRST at a time when there is so much work to be done. Having spent most of my career involved in outbreak response and global public health, this is a real highlight for me and a great opportunity to draw on my previous experience in leadership and as a virologist."
        },
        {
            "text": "The UK-PHRST have had many successes in the last six years, and I want us to build and expand on these. As outlined in our new strategic framework, there is still scope for us to improve the impact of our deployments. This includes reviewing and improving how we deploy so that we can support our partners better and respond to more than one emergency at a time."
        },
        {
            "text": "From a research perspective, we will be looking to address key priorities that have been identified and increasingly co-developed with partners, and further strengthen our research capacity in the low-and-middle-income countries we work with."
        },
        {
            "text": "We will also look to formalise and expand the capacity strengthening work we do with our partners to ensure we make meaningful and sustainable improvements to public health emergency and response workforces in partner organisations."
        },
        {
            "text": "To achieve all this, we will work closely with our partners around the world to identify their needs and how we can best support them in a way that is sustainable in the long-term."
        },
        {
            "heading": 2,
            "text": "2022 deployments"
        },
        {
            "text": "The ongoing COVID-19 pandemic has remained the biggest immediate health threat in the last year."
        },
        {
            "text": "In 2021, the team deployed an epidemiologist and microbiologist via the Global Outbreak Alert and Response Network (GOARN) under the World Health Organization (WHO) in Cambodia to help improve the country’s testing and surveillance capacity to the Omicron variant."
        },
        {
            "text": "Our work in the last few months has not started and ended with the pandemic, however. In June 2022, UK-PHRST deployed to various West, Central and East African countries to support activities in response to Yellow Fever outbreaks, including the deployment of a case management expert to Burkina Faso for six weeks to improve the effectiveness and quality of clinical care."
        },
        {
            "text": "The breadth of our outbreak response support over the years, including Lassa fever, meningitis, pneumonic and bubonic plague, and acute watery diarrhoea has emphasised that epidemics don’t wait for the pandemic to end. Infectious diseases besides COVID-19 continue to threaten global health security for LMIC populations, which is reflected in the diversity of work the team has delivered to date.  Recently, epidemiologists were deployed to support Slovakia and Czech Republic in preventing and preparing for COVID-19 and other public health challenges that posed a threat as a significant number of people fled the war in Ukraine to neighbouring countries."
        },
        {
            "heading": 2,
            "text": "The Future"
        },
        {
            "text": "As I write this message, we have a specialist in Infection Prevention Control from the UK-PHRST in Uganda supporting GOARN and the response to the ongoing Ebola outbreak ongoing, while other members of our team are ready to be deployed as requested."
        },
        {
            "text": "This latest outbreak of Ebola in Uganda and our response to it offers valuable insight into how we can provide rapid support at short notice when requested whilst continuing a full programme of ongoing work in/with other UK aid eligible countries. Our strategy is underpinned by three principles: learning, partnerships and impact. Expanding our horizons in all three of these areas will allow us to increase global capacity and ensure a more coordinated international response to outbreaks across the world that affect the health and wellbeing of everyone."
        },
        {
            "text": "The UK Public Health Rapid Support Team will take these ambitions forward by building and maintaining equitable partnerships with the low- and middle-income countries we work with."
        },
        {
            "text": "Providing support is not a one-way conversation - we rely on learning from our partners and leveraging their expertise to make a sustainable impact that prevents infectious diseases that can have such detrimental effects on our lives and livelihoods from spreading, so improving the health security of us all."
        }
    ]
}