{
    "url": "https://deframedia.blog.gov.uk/2022/05/31/emma-howard-boyd-visits-wyre-natural-flood-management-project-as-grants-issued-to-boost-investment-in-nature/",
    "title": "Emma Howard Boyd visits Wyre Natural Flood Management project as grants issued to boost investment in nature",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-31T16:31:55+01:00",
    "content": [
        {
            "text": "There has been positive coverage in The Independent, Yorkshire Post, Surrey Comet, The Leader and Business Green today of our announcement on the second round of the Natural Environment Investment Readiness Fund (NEIRF) – which will provide grants of up to £100,000 to environmental groups, local authorities, businesses and other organisations to drive private investment in nature and tackle climate change."
        },
        {
            "text": "Chair of the Environment Agency, Emma Howard Boyd, visited one of the four NEIRF pilot schemes today, the Wyre Natural Flood Management project, which has already secured investment and is now working to reduce flood risk to downstream communities generating income through the sale of these services."
        },
        {
            "text": "Over several years, interventions in the Wyre catchment will include wetland creation and temporarily storing water by putting in place leaky barriers, sloped embankments and hedgerows alongside peatland restoration and river restoration. Other measures include slowing overland water flow through changes in grassland management, and tree planting to allow water to seep into the ground."
        },
        {
            "text": "Among the 50 projects successful in the second round of the fund include those to restore and rewet peatlands, create green urban spaces and improve flood resilience."
        },
        {
            "text": "The funding will help to develop projects so they can demonstrate a return on that investment by capturing the value of carbon, water quality, biodiversity and other benefits provided by natural assets such as woodlands, peatlands and rivers – with revenue generated through the sale of carbon storage, improvements in biodiversity, natural flood management benefits and reduced water treatment costs."
        },
        {
            "text": "Lord Benyon, Minister for Green Finance, said:"
        },
        {
            "text": "Emma Howard Boyd CBE, Chair of the Environment Agency and interim Chair of the Green Finance Institute, said:"
        },
        {
            "text": "Working on behalf of Defra, the Environment Agency is working closely with the Green Finance Institute and Ecosystems Knowledge Network to make the knowledge generated by these projects available publicly to encourage similar approaches to access private sector finance for nature projects in the future."
        },
        {
            "text": "The government has set an ambitious target to stimulate at least £500m of private investment per year by 2027 to support nature recovery – rising to at least £1bn per year by 2030."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}