{
    "url": "https://apprenticeships.blog.gov.uk/2022/05/31/external-quality-assurance-thanks-for-a-job-well-done/",
    "title": "External Quality Assurance: Thanks for a job well done",
    "authors": [
        "Nikki Christie",
        "Rob Nitsch"
    ],
    "categories": [
        "Apprenticeship standards"
    ],
    "pub_date": "2022-05-31T11:08:47+01:00",
    "content": [
        {
            "text": "The introduction of end-point assessment (EPA) for apprenticeships has been essential to driving up quality, meeting the aspirations of employers, and boosting public confidence in the programme."
        },
        {
            "text": "External Quality Assurance (EQA) is the system for making sure the assessments are delivered to a high standard, and our partners at Open Awards have played a critical role in evolving our arrangements and delivering on that."
        },
        {
            "text": "In the past, you would have been tested progressively in an apprenticeship – so different skills that you learned would have been tested as you went along. Now the focus is on a holistic assessment that really unpacks occupational competence at the end of the apprenticeship."
        },
        {
            "text": "This change was introduced because employers needed more confidence that an apprentice could do the job for which they’d been trained before finishing their apprenticeship. It also provides the people doing the training with a chance to establish that they really know their stuff."
        },
        {
            "text": "To put this in a context, if you’ve been learning to write new stories and your bosses want to know whether you can really do this, you shouldn’t just be tested on whether you can read up on background information and carry out interviews. They need to see if you can process everything you find out and write this up into great stories for your editor to publish."
        },
        {
            "text": "The EPA is set and run by established end-point assessment organisations (EPAOs), but you need skilled and knowledgeable people in place to make sure it’s all done consistently, fairly, and to high standards, which is where EQA comes in."
        },
        {
            "text": "When IfATE launched in April 2017, part of our remit was to make a success of EQA, which was new at the time."
        },
        {
            "text": "The Government designed the outgoing system so EQA could be provided by professional and employer groups, Ofqual, or for higher levels the Office for Students."
        },
        {
            "text": "IfATE was also tasked with providing EQA where no preferable  provider could be identified. We did this from July 2017 through a successful partnership with Liverpool-based awarding organisation Open Awards, who delivered this EQA service on our behalf. Since then, they have produced almost 800 EPAO highly valued reports and set and completed approaching 2,000 actions and recommendations. This has helped shape the apprenticeship landscape for the better and improved the EPA journey for thousands of apprentices."
        },
        {
            "text": "We’ve made considerable progress in recent months with simplifying and strengthening the EQA process, in response to concerns that the old system was over-complicated, with an excessive number of EQA organisations, the majority of whom are not statutory regulators. The reforms now being rolled out will see EQA predominantly just provided by statutory regulators, Ofqual, or, for integrated degree apprenticeships, the Office for Students."
        },
        {
            "text": "That has required a transition period while apprenticeships previously overseen by IfATE and Open Awards moved over to Ofqual, through which Open Awards have responded flexibility and continued to provide stability throughout this time."
        },
        {
            "text": "As our contract with Open Awards draws to the a close, we would like to take the opportunity to thank Open Awards and their Chief Executive, Heather Akehurst, for their professionalism, contribution and commitment to the delivery and improvement of the apprenticeship system and particularly EPA.  They have made a unique and seminal contribution to the development and delivery of standards based apprenticeships."
        },
        {
            "text": "Open Awards have played a key role in the establishing the credibility of EQA and the wider apprenticeship programme which I’m confident will serve our nation with distinction for generations to come.  We are very grateful and now look to working with Ofqual and OfS to further strengthening EPA for the benefit of employers, apprentices and seizing the opportunities that simplification offers in partnership with all stakeholders."
        }
    ]
}