{
    "url": "https://educationhub.blog.gov.uk/2022/05/free-school-meals-and-other-support-for-disadvantaged-pupils-heres-what-you-need-to-know/",
    "title": "Free school meals and other support for disadvantaged pupils - here's what you need to know",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Families",
        "Free School Meals"
    ],
    "pub_date": "2022-05-31T14:56:45+01:00",
    "content": [
        {
            "text": "NOTE: This post was updated on 20 October 2022 to refresh the number of pupils in receipt of Universal Infant Free School Meals and to make clearer the ways in which families can be eligible for free school meals."
        },
        {
            "text": "Every child should have the same opportunities to meet their potential regardless of their background or where they’re from. That’s why we have additional support for children from disadvantaged backgrounds."
        },
        {
            "text": "This includes providing free school meals, special support during school holidays, funding breakfast clubs, and providing extra funding to schools to support pupils from disadvantaged backgrounds and improve education outcomes."
        },
        {
            "text": "Here’s everything you need to know about the support we offer and how to access it."
        },
        {
            "heading": 3,
            "text": "Which children get free school meals and how do they access them?"
        },
        {
            "text": "We’ve significantly expanded access to free school meals in recent years. You can check your eligibility for free school meals here. The link will also show you how to contact your local authority (usually known as councils) to apply."
        },
        {
            "text": "Your child may be able to get free school meals if you get any of the following:"
        },
        {
            "text": "All infants (those in reception, year 1 and year 2) are also eligible for free school meals. In 2014 we extended free school meal eligibility so that further education students can access them and in 2018 we introduced new eligibility criteria to support the transition to Universal Credit."
        },
        {
            "text": "These changes mean we expect to help more children under the new system. We have also permanently extended eligibility for free school meals to children from families with No Recourse to Public Funds (subject to income thresholds)."
        },
        {
            "text": "Practically, this means that 1.25m children in reception, years 1 and 2 receive Free Schools Meals, and 1.9m other pupils in all year groups because of household benefits. That’s around 37.5% of the total pupil population."
        },
        {
            "heading": 3,
            "text": "How can disadvantaged pupils get free school meals during the holidays?"
        },
        {
            "text": "Vulnerable families can get support throughout the year via their councils. The Household Support Fund was extended earlier this year and helps families in need with essentials, like food and utility bills. You can check your eligibility here."
        },
        {
            "text": "The Holiday Activity and Food Programme (HAF) has also been supporting children and families in major school holidays since 2018. The HAF programme provides healthy food and enriching activities to children and young people, with free places available for those on free school meals during some of the school holidays."
        },
        {
            "text": "HAF is funded by Government and run by councils who help deliver the holiday clubs. Some councils may coordinate the clubs and others may work with other organisations to provide clubs for children locally."
        },
        {
            "heading": 3,
            "text": "How can I get my child into the Holiday Activity and Food Programme?"
        },
        {
            "text": "HAF is primarily for children in primary or secondary school who receive benefits-related free school meals, but councils do have some flexibility to provide free access to other children."
        },
        {
            "text": "We also encourage councils to make the holiday clubs available to any children not eligible for and in receipt of free school meals, so parents can pay to attend."
        },
        {
            "text": "We want all children who attend the programme to benefit from:"
        },
        {
            "text": "For information on how you and your family can get involved, please contact your local council."
        },
        {
            "heading": 3,
            "text": "What else do you do to support children from disadvantaged backgrounds?"
        },
        {
            "text": "Schools get funding for benefits-related free school meals as part of their core schools funding allocation – that’s money they get from Government. Mainstream core school funding for 5–16-year-olds increased by £2.5 billion in 2022-23 compared to 2021-22. This is equivalent to an average 5.8% cash increase, or an average of £300 per pupil."
        },
        {
            "text": "We are also investing up to £24 million in the National School Breakfast Programme, and research has revealed the benefits breakfast clubs have had on children in disadvantaged areas, including improved readiness to learn, increased concentration, and improved wellbeing and behaviour."
        },
        {
            "text": "Through the Pupil Premium, we also target funding in schools to directly help disadvantaged children. In 2021-22 this funding helped support over 2 million disadvantaged pupils across the country, and we’ve increased this investment so in this academic year – 2022-23 – it is worth over £2.6 billion."
        },
        {
            "text": "The government is also providing over £37billion to help households with the greatest need, including almost all of the eight million most vulnerable households across the UK receiving support of at least £1,200 this year, including a new one-off £650 cost of living payment, universal support increasing to £400 and is supporting families through the Household Support Fund."
        },
        {
            "text": "The Household Support Fund continues to be distributed by councils, who know their local areas best and can directly help those who need it most. This includes through small grants to meet daily needs. You can find out more about that here."
        },
        {
            "text": "In September  the Government announced that a new Energy Price Guarantee (EPG) would replace the price cap from October 2022 until April 2023. The EPG applies to all domestic customers of gas and electricity. Typical UK households will pay no more than £2,500 a year on their energy bill from Saturday 1 October, saving the average household £1,000 a year based on current energy prices from October."
        },
        {
            "text": " "
        }
    ]
}