{
    "url": "https://educationhub.blog.gov.uk/2022/05/31/how-were-preventing-suicides-in-higher-education-and-supporting-mental-health/",
    "title": "How we’re preventing suicides in higher education and supporting mental health",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Mental Health"
    ],
    "pub_date": "2022-05-31T15:19:52+01:00",
    "content": [
        {
            "text": "The Office for National Statistics (ONS) has published data on recent suicide rates amongst higher education students to help the sector gain a better understanding of how to prevent suicides."
        },
        {
            "text": "Here, we guide you through what this data shows and highlight what support is available for those struggling with mental health issues."
        },
        {
            "heading": 3,
            "text": "What has been published?"
        },
        {
            "text": "The ONS has published figures estimating the number of suicides in higher education from academic year 2016/17 to 2019/20. The data breaks down the number of suicides based on characteristics such as sex, type of study and age group."
        },
        {
            "heading": 3,
            "text": "But why has this data been published?"
        },
        {
            "text": "Every single suicide is a tragedy and suicide prevention is a key priority for the Department. That is why in, June 2021, we wrote to the ONS to ask it to undertake more regular analysis of student suicide data. This analysis will help university leaders better understand risk factors which is central to informing preventative action."
        },
        {
            "heading": 3,
            "text": "What does this data show?"
        },
        {
            "text": "The data showed that the suicide rate for higher education students in the academic year ending 2020 in England and Wales was 3 deaths per 100,000 students which is the lowest rate observed over the last 4 years."
        },
        {
            "text": "This data also shows that students in higher education in England and Wales had a significantly lower suicide rate compared with the general population of similar ages. Between the academic years ending in 2017 and ending in 2020, higher education students in England and Wales had a significantly lower suicide rate compared with the general population of similar ages."
        },
        {
            "heading": 3,
            "text": "What should I do if I’m worried about a friend or family member at university?"
        },
        {
            "text": "We understand that helping a friend or family member with mental health issues can be difficult."
        },
        {
            "text": "If for any reason you have cause to believe that someone you know is struggling with mental health and wellbeing issues at university, we recommend following the NHS’ guidance: Helping others with mental health problems - Every Mind Matters - NHS (www.nhs.uk)."
        },
        {
            "heading": 3,
            "text": "What is the Department doing to reduce suicides at universities?"
        },
        {
            "text": "One of our main priorities is to improve suicide prevention in higher education. That is why in addition to commissioning the latest data we have written to university leaders asking them to adopt and embed the Universities UK led Suicide Safer Universities framework. This sets out the steps all universities should take to prevent suicide in their student populations."
        },
        {
            "text": "Earlier this month, we also launched a survey of universities’ policies and practices on suicide prevention, so we can better understand how universities are supporting their students and identify gaps where additional funding or support is needed."
        },
        {
            "heading": 3,
            "text": "What action are you taking to support student mental health more generally?"
        },
        {
            "text": "Students struggling with their mental health can access Student Space, a mental health and wellbeing hub supporting students impacted by the pandemic. Funded by £3.6m from the Office for Students (OfS), Student Space provides dedicated one-to-one text and web chat facilities as well as a collaborative online platform providing vital mental health and wellbeing resources. The platform includes resources and specialist services for BAME students."
        },
        {
            "text": "We also asked the OfS to allocate £15 million towards student mental health in 2022/2023 to give additional support for transitions from school or college to university, and through targeting funding to support partnership working with NHS services to provide pathways of care for students."
        },
        {
            "text": "To ensure all the information is readily available for students and young people, we have put together some useful links and sources of mental health support so that everyone can get the advice and help they need. This information is available here: Mental health resources for children, students, parents, carers and school/college staff - The Education Hub (blog.gov.uk)."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}