{
    "url": "https://civilservice.blog.gov.uk/2022/05/31/meet-the-top-team-we-make-ministers-media-moments/",
    "title": "Meet the Top Team: We make ministers’ media moments!",
    "authors": [
        "Cabinet Office External Affairs and Engagement team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-31T08:33:11+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Cabinet Office External Affairs and Engagement team reveals what goes on behind the scenes to get our ministers out and about meeting people,  making tomorrow’s headlines."
        },
        {
            "text": "Amrita Devaiah - Head of External Affairs and Engagement"
        },
        {
            "text": "When it came to my career, I never dreamed that I’d end up doing my role. In fact, I'm not even sure I knew jobs like mine existed!"
        },
        {
            "text": "I have the immense privilege to lead the team and support our ministers in delivering for citizens. Every year, we deliver hundreds of engagements, visits, meetings and media moments. It’s always with the aim of amplifying key Cabinet Office policy and allowing ministers to meet stakeholders and the public, to hear from them on the issues that matter to citizens."
        },
        {
            "text": "I’ve been able to travel to all corners of the UK, met fishermen, musicians and lorry drivers, climbed down sewers, toured a sausage factory, co-presented the Civil Service Awards and even been treated to a Gregg's buffet at their HQ. Each and every time, we see first-hand how our work impacts people day-to-day."
        },
        {
            "text": "I've gained a broad understanding of a whole raft of policy areas across government and work with a super talented group of external affairs and press officers to make sure our work has the most impact and value. "
        },
        {
            "text": "Every day is different and challenging, making me think strategically, problem solve creatively and support my team to be the best at what they do."
        },
        {
            "text": "Hayyan Bhabha - Senior External Affairs Manager"
        },
        {
            "text": "I really enjoy working in external affairs. We manage briefings, visits and engagements for ministers and senior civil servants."
        },
        {
            "text": "Our role involves working proactively with private offices, policy and communications teams to produce ‘forward looks’. These are proposals for future engagements that dovetail with ministerial responsibilities and government priorities."
        },
        {
            "text": "We work with policy teams to brainstorm ideas for visits or speeches to support  announcements, or meetings and roundtables to engage external stakeholders. We then work with the press office to propose how we’ll capture what ministers will be doing and communicate this to the public."
        },
        {
            "text": "Following agreement, we work with private offices to carve out diary time, seek approval of the communications plan from No. 10 and manage relationships with stakeholders. We manage engagements from start to finish."
        },
        {
            "text": "One of the great things about working in our team is that we often work with policy teams from other departments and embassies around the world, which means we get exposure to a broad range of policy teams across Whitehall and arrange international visits."
        },
        {
            "text": "Izzy Knight - Senior External Affairs Manager"
        },
        {
            "text": "Is five years in the Civil Service too long?! Joining fresh out of sixth form in 2017, straight into DExEU as a PA and then in ministerial events and visits, I’ve worked in four departments across a range of policy areas but always events and visits."
        },
        {
            "text": "Most recently, I worked in the events team delivering COP26, one of the best things I’ve ever experienced. I’ve been very lucky to travel around Europe and across the UK with ministers - definitely one of the many perks of the job! "
        },
        {
            "text": "We have many roles on a visit, ranging from making sure stakeholders are comfortable, to managing media and keeping ministers to time. Visits are about conveying government policy to the public and engaging with supportive stakeholders, so managing our relationship with them is extremely important. "
        },
        {
            "text": "There’s never a time where a visit runs perfectly, issues always pop up but it’s our job to make sure the minister and private office never notices. It could be as simple as the wrong food or the weather changing!"
        },
        {
            "text": "Mairead Weir - Senior External Affairs Manager"
        },
        {
            "text": "Hi! I’m Mairead, a Canadian who joined Cabinet Office almost three years ago and who probably had no business planning ministerial visits. "
        },
        {
            "text": "This job isn’t a normal government job - I’ve travelled on an the RAF plane, met royalty, appeared on Indonesian TV,  presenting on disinformation to more than 1,000 students and even ran into Leonardo DiCaprio at COP26.  "
        },
        {
            "text": "I’ve learned what it takes to make headlines - it can be as simple as the wrong sign behind the minister, a minister eating an ice cream or meeting a cute animal. That's why it’s important our team work closely with the press office to create media moments to help demonstrate the vital work of government and prevent an embarrassing image hitting the headlines. "
        },
        {
            "text": "We have a rule in the office: if you are seen on the news walking behind a minister, you have to bring in treats for the team, so I try to stay behind the scenes. One of my most memorable moments was during the September reshuffle when a clip of a visit I planned to Glasgow for then CDL Michael Gove kept replaying on BBC news - featuring me trying to avoid the camera! "
        },
        {
            "text": "Adam Perrett - External Affairs Manager"
        },
        {
            "text": "I’ve always wanted to join the Civil Service and work with dynamic people on unique challenges, so I was extremely excited to join CO External Affairs after university."
        },
        {
            "text": "My role partly involves carrying out recces of venues ahead of ministerial visits, considering how the minister will tour the site, the visuals and their publication on internal and external channels, as well as flagging any potential issues."
        },
        {
            "text": "On my first recce, I needed to travel to a London music hub. Nervous and early, I was waiting for the stakeholder when Noel Gallagher appeared and looked me straight in the eye, before going inside. During the tour, I met teams who’ve worked on the musical score for Avatar, Dunkirk and Doctor Who, saw one of the few remaining vinyl cutters in Europe and chatted with representatives for Dua Lipa and Billie Eilish. "
        },
        {
            "text": "Working in external affairs isn’t always glamorous, and I’ve been to far more government offices than music studios, but I’ve had the humbling privilege of meeting a lot of amazing people and visiting companies and places I’d never have otherwise known existed."
        },
        {
            "text": "Charlotte Prothero - External Affairs Manager"
        },
        {
            "text": "I started by working in events and private office in the Scotland Office, then moved onto tackling pension scammers in the Department for Work and Pensions. However, I found myself missing the pace and excitement of events."
        },
        {
            "text": "A hectic day in the office could start with a minister requesting a visit at the last minute, meaning we have to draft a proposal detailing how the visit would look and an itinerary. We also start drafting briefing documents and commissioning policy teams for lines, working with press colleagues on the media side. We’d also reach out to the stakeholders and scope their interest in hosting and ask what exciting things they’d show the minister on the day."
        },
        {
            "text": "The briefing acts as the source of all information for everyone on the day, and the work we put in ensures the smooth running of the engagement. Hectic days in the office can feel like a lot, but there’s a sense of urgency and camaraderie that helps carry you through, and then there's the joy of seeing all your efforts come together successfully on the day.◼︎"
        }
    ]
}