{
    "url": "https://traderemedies.blog.gov.uk/2022/05/31/what-a-difference-a-year-makes/",
    "title": "What a difference a year makes",
    "authors": [
        "Adam Marshall, Non-executive Board Director"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-31T13:40:36+01:00",
    "content": [
        {
            "text": "As I reflect on my first full year as a non-executive director of the TRA, it’s fantastic to see the progress that the organisation has made since it became an independent body. "
        },
        {
            "text": "While dozens of our colleagues were already working diligently on trade remedies matters as part of the Department for International Trade (DIT), our independence on 1st June 2021 was a milestone event for our organisation. As a Board member, it meant having formal oversight responsibilities for the first time - but for the organisation as a whole, it meant so much more. The ability to develop our own culture, the ability to ‘think outside the box’ when tackling knotty economic and trade issues, and our ability to give robust and scrupulously independent advice to government ministers were all heightened when we made that transition a year ago. It really started to ‘feel different’ as we developed our own ways of working, making us more effective and more confident.  "
        },
        {
            "text": "Our work, since then, has had a real impact. Many colleagues have worked on sensitive and high-profile issues that have attracted interest and scrutiny from businesses, the media, and the political world. Others have built the foundations of a strong organisation, navigating the complexities of building a new government body from the ground up, amidst ceaseless political and global change. And we grew, as well, with many new colleagues joining the organisation and swiftly making their mark. "
        },
        {
            "text": "The initiation of the UK’s first new trade remedies investigation, too, was a milestone event. No longer were we simply reviewing and revising measures that had been put in place during our decades as part of the EU; instead, we were beginning to shape a more tailored and specific trade remedies regime for the UK. And this was just the first of many to come over the years ahead.  "
        },
        {
            "text": "Of course, there have been and will be bumps in the road, too. Yet we must continue our work without fear or favour - making a transparent, robust and well-evidenced case for each and every investigation, as we deliver our mission to defend UK interests from unfair international trade practices.   "
        },
        {
            "text": "Like the other non-executive directors, I am proud to be a small part of this ambitious, forward-thinking and relevant organisation. Happy first birthday to my TRA colleagues. Here’s to many more big milestones to come. "
        }
    ]
}