{
    "url": "https://dluhcdigital.blog.gov.uk/2022/05/31/women-working-in-digital-data-and-technology-part-1-product-and-delivery/",
    "title": "Women working in digital, data and technology, part 1: product and delivery",
    "authors": [
        "Sarah Clive",
        "Alice Whitehead",
        "Annie Crabtree"
    ],
    "categories": [
        "DDAT Careers"
    ],
    "pub_date": "2022-05-31T16:00:17+01:00",
    "content": [
        {
            "text": "There’s no set path to working in digital, data and technology (DDAT). Women working in these professions here at the Department for Levelling Up, Housing and Communities (DLUHC) have come from many different backgrounds. Here are some of their stories."
        },
        {
            "heading": 2,
            "text": "Coming together to solve a problem"
        },
        {
            "text": "I did a law degree and then a postgraduate Legal Practice Course. I hated property law but got a paralegal role for a conveyancing firm while studying. On the brink of becoming a solicitor, I realised how clueless I was about other career options because of my focus on being a lawyer."
        },
        {
            "text": "I took a fixed-term contract at the Department for Work and Pensions (DWP) to broaden my experience. I intended to return to law straight after. With encouragement, I applied for a promotion which I got. It gave me the courage to tell my family I would not be a solicitor any time soon (if you know, you know)."
        },
        {
            "text": "I applied for a digital capability role at HM Revenue & Customs (HMRC) because I’m passionate about supporting the development of others and myself. The digital transformation in the department was intriguing. The interview panel explained that the role had been filled, but they thought I’d be great for their product manager vacancy. I was honest and said I’d never heard of it. They gave me an overview and it seemed like something I could do."
        },
        {
            "text": "I had the best introduction to working in digital on the Your tax account and Online card payments services at HMRC. I found my calling in building great services for the public and flourished as an advocate for users. I enjoyed the pace of agile delivery, stakeholder engagement and the matrix management culture."
        },
        {
            "text": "Before I joined DLUHC, I was a product owner for a pensions service. I represented DWP on cross-government policy and on steering groups, and presented to the Minister for Pensions. After a successful live assessment and Civil Service (digital) Award nomination, it felt like the right time to find a new challenge."
        },
        {
            "text": "What I really love about my role: the whole process of a bunch of people with different skills all coming together to try to solve a problem. I love the difference it can make to everyday life when we build a service for the people who need it."
        },
        {
            "heading": 2,
            "text": "Being part of teams creating meaningful things"
        },
        {
            "text": "I have been working in Digital for around 8 years now. I started as an admin officer at the Ministry of Justice (MOJ), and worked my way around different roles. I was a team leader and a performance analyst. Then I joined a transformation programme to map and improve processes before becoming a product manager."
        },
        {
            "text": "After working without a delivery manager for a while, I worked with a very strong delivery manager to get my first GOV.UK service live. I took some time out for my second job (being a mum) and reflected on my career, then moved into a delivery role. After a few years at MOJ I wanted to get a wide range of experience beyond justice and moved to DLUHC in March 2022."
        },
        {
            "text": "If you had asked me 15 years ago what I would be, I might have said teacher, librarian, museum curator or another role helping others. I didn’t aspire to work in digital in government, I ended up here and I enjoy it!"
        },
        {
            "text": "People mean a lot to me. I enjoy team working, helping others and developing my coaching and mentoring skills. I did not have 'tech skills' but I have learnt a lot on the way. Having an open receptive mind is crucial."
        },
        {
            "text": "Being part of teams that create meaningful things for wider society makes me love what I do. Working with lots of different people who put users at the centre of what we are doing makes all the difference."
        },
        {
            "heading": 2,
            "text": "Sharing ideas and mutual support"
        },
        {
            "text": "I’ve always cared about using my skills to improve the lives of others. I studied pharmacology at university with the intention of going into medical research. This career path didn’t suit me so I moved into local government. I was fortunate to rotate around many teams including environmental health, town planning, human resources, transformation and digital/IT."
        },
        {
            "text": "In the summer of 2020 my team pivoted to work on coronavirus (COVID-19) response. We built systems to allow local businesses and people on low incomes to apply for financial support. This was a stern test of our technical skill, speed and team cohesion, and I’m pleased to say it was a successful project. This gave me the confidence to apply for the role in the rapid response team at DLUHC. In my new role, I’ve continued to work on high-profile, fast-paced projects, like Homes for Ukraine."
        },
        {
            "text": "Our community is what makes working in digital special. There are many people in DLUHC and beyond who have helped me to feel welcome. My colleagues are always generous in sharing their knowledge and feedback. This type of work is not easy. We’re grappling with multi-faceted human problems and limited resources. Sharing ideas and mutual support with colleagues and peers helps."
        }
    ]
}