{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/16/emerging-technologies-team-lead-g7/",
    "title": "Emerging technologies team lead (G7)",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-08-16T12:13:41+01:00",
    "content": [
        {
            "text": "The Genomics Science and Emerging Technologies Team (GSET) is a policy team, sitting within the Science, Research and Evidence Directorate working to ensure health research and healthcare are closely linked to get the maximum benefit for patients out of innovation."
        },
        {
            "text": "Drawing on learning from the 100,000 genomes project, the GSET team promotes the linkage of research and healthcare, supports other policy teams drawing on expertise within GSET and our networks, and supports DHSC, NIHR and others work on cross cutting themes."
        },
        {
            "text": "GSET is responsible for policy on:"
        },
        {
            "text": "• emerging technologies associated with human genetics including genomics science, cell and gene therapies, and regenerative medicine\n• rare diseases including implementation of the 2021 UK Rare Diseases Framework"
        },
        {
            "text": "The team are looking to hire a G7 who is able to do the following:\n• Developing science policy and providing scientific advice on emerging technologies associated with human genetics e.g. genomics, genome editing and cell and gene therapies\n• Further defining and developing the emerging technologies portfolio including engaging in horizon scanning activities\n• Working closely with the Office for Life Sciences to support the activities of the National Genomics Board and implementation of Genome UK - the national genomic healthcare strategy\n• Overseeing DHSC’s funding of the Stem Cell Programme, delivered by Anthony Nolan and NHSBT, and the NIBSC UK Stem Cell Bank and ensuring future opportunities for advanced therapies are maximised\n• Contributing to international genomics initiatives including overseeing our investment in the Global Alliance for Genomics and Health (GA4GH)\n• Building and maintaining effective and purposeful engagement with colleagues across government, in NIHR, NHSBT, NHSE and the wider health and care sector, Genomics England, wider research funders, and the third sector\n• Providing support as needed to the wider team’s delivery of the Rare Disease Framework and ensuring effective cross-linkage to work on emerging technologies\n• Ensuring the delivery of excellent support to Ministers and senior officials, including responses to parliamentary questions, provision of speeches and briefings"
        },
        {
            "text": "If you're interested in applying, more information can be found on the job description located here."
        },
        {
            "text": "Vacancy reference:140832, Various Locations; closing date:  11:55 pm on Thursday 2nd September 2021"
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}