{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/16/gse-role-modelling-blog-head-versus-heart/",
    "title": "GSE Role Modelling Blog: Head versus Heart",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog",
        "Our People & Deep Dives",
        "Role Model Series"
    ],
    "pub_date": "2021-08-16T11:58:07+01:00",
    "content": [
        {
            "text": "We make numerous decisions every day. Whether it is deciding to take an umbrella when the skies look gloomy, or volunteering for a cause when your diary is already full, these decisions can be relatively simple through to extremely challenging. The conflict that presents itself in decision-making can be boiled down to logic versus emotion – head versus heart."
        },
        {
            "text": "Think about volunteering again; you have an opportunity to get involved with a phenomenal cause for something you are deeply passionate about, but you are already committed on many other extracurricular projects. Your heart says yes, but your logical head reminds you that you just don’t have the time to fully commit and add value to the project."
        },
        {
            "text": "As a role model, you may feel there is an expectation to always do the right thing, and that certainly is not easy. You may feel you are letting people down, or even look like a bad role model if you choose not to support this worthy cause."
        },
        {
            "text": "So how do we overcome this conflict? Research illustrates decisions are made through a mix of cognition and emotion; participants were found to use individual patterns or a combination when reasoning and decision-making. We should reflect and learn about our own preferences – everyone will be unique. If we understand our personal preference, we can learn to ‘re-balance’ it and work with a greater combination of head and heart. This can overcome bias, improve awareness and lead to wiser and more effective decisions."
        },
        {
            "text": "As a role model, this can ensure your reasoning is well informed, showing others you make measured decisions. Otherwise you may risk spreading yourself too thin – taking on too much could even impact your own health and welfare."
        },
        {
            "text": "Colleagues may be critical of those that rely more on head or more on heart in the workplace, describing them negatively as hard/robotic or emotional. The language we use to describe others can have a long lasting and detrimental effect on people’s career prospects and mental health. Accepting that we are all different and we achieve more and work better with a diverse skill set is key to cohesive working. Think about your own preference in decision making and be aware of those around you. Saying no is not a failure when you need to, and accept new challenges when you can. This can work some way towards overcoming the head versus the heart."
        }
    ]
}