{
    "url": "https://defrafarming.blog.gov.uk/2021/08/16/how-were-improving-advice/",
    "title": "How we're improving advice",
    "authors": [
        "Jane Green"
    ],
    "categories": [
        "Things we're doing",
        "Things we've learned",
        "Ways to get involved"
    ],
    "pub_date": "2021-08-16T13:02:25+01:00",
    "content": [
        {
            "text": "The Future Farming Advice team is responsible for making sure that people have the advice they need to support them through the agricultural transition and beyond."
        },
        {
            "text": "In this post, I’ll give you an overview of our work. I’ll share some of our findings and explain what we’re doing next."
        },
        {
            "text": "And because we believe co-design is the way to ensure our advice leads to better outcomes, I’ll share details of how you can get involved at the end of this post."
        },
        {
            "text": "Before I get started, I want to explain what we mean by advice and guidance and how they differ."
        },
        {
            "heading": 4,
            "text": "Advice"
        },
        {
            "text": "Advice, in the context of the Future Farming and Countryside Programme, is tailored information shared between an adviser and a farmer or other land manager. For example, it might relate to a specific holding or situation. The relationship between the parties can mean that over time, a high-degree of trust is established. The adviser can be from a delivery partner (Natural England or Forestry Commission for example) or from a commercial organisation."
        },
        {
            "text": "Advice is based on subject matter expertise."
        },
        {
            "text": "In addition to face-to-face discussions with advisers, it can be delivered through a variety of different means, such as online forums, on farm discussions, through technology, by phone or email."
        },
        {
            "heading": 4,
            "text": "Guidance"
        },
        {
            "text": "Guidance, on the other hand, is published information. It is designed to help an individual complete a task."
        },
        {
            "text": "The Future Farming and Countryside Programme primarily uses GOV.UK for guidance. People can navigate to GOV.UK themselves and they can sign up for alerts when new guidance is published too. The guidance on GOV.UK is also promoted through the press, networks, events, social media, and here on the blog."
        },
        {
            "text": "Advice and guidance are part of the same service which ensures all our users have the information they need for their circumstances, at the right time, in a way that works for them."
        },
        {
            "heading": 3,
            "text": "What the team has been working on"
        },
        {
            "text": "Advice and guidance are not something we’ve only just started looking at. Defra has been thinking and planning over the past few years. The work will certainly continue as more schemes and services become available."
        },
        {
            "text": "We have worked with people from across the industry to really understand what good advice looks like and how we can make sure our offer matches that. For example:"
        },
        {
            "text": "We’ve pulled everything we’ve learned together into one place and we’ve formed a community of specialists who review the evidence and work through problems as a team."
        },
        {
            "text": "This will help us to reach a common understanding of the advice situation and ensure that we’re all aligned when it comes to the interpretation of the evidence."
        },
        {
            "heading": 3,
            "text": "What the evidence is telling us"
        },
        {
            "text": "One theme to emerge from the evidence is that advice works best when it comes from a source the individual trusts. For example, a farmer is more likely to trust advice if it comes from an adviser who has knowledge of the local area and understands the farmer’s business and their objectives."
        },
        {
            "text": "It's also clear that advice from peers can be just as important as advice from a professional source. We are working with farmers and land managers to understand how we might support this important activity."
        },
        {
            "text": "People want to be clear what they need to do, not just to meet the terms of the scheme, but also their legal responsibilities. This is something that good content design can achieve."
        },
        {
            "text": "Another theme we are finding is that training and exchanging knowledge form important parts of advice-giving. This can be achieved through facilitated sessions, online systems, peer-to-peer, webinars, in person on a farm as well as through formal courses and accreditation."
        },
        {
            "text": "COVID-19 has prompted changes in the ways that people interact with advisers. We have trialled engaging with people through webinars. Feedback suggests that this works for many people. We are working with advisers, farmers, and land managers to understand what works best online and when face-to-face advice is needed or preferable."
        },
        {
            "text": "A big theme is the need for different channels of advice to reach a wider audience. The information should be consistent, and the delivery should be positive and trusted with specific knowledge of the local area and the persons business. Balancing these requirements is vital for a successful advice service."
        },
        {
            "heading": 3,
            "text": "What the team is doing next"
        },
        {
            "text": "We want to build a comprehensive picture of what works well now, where there are problems, what needs to improve and where advice could provide a solution. We are looking at what advice should be provided by Defra organisations, and what should be provided through the market."
        },
        {
            "text": "In particular, we want to find out the problems Defra colleagues, farmers, land managers and advisers have with advice. In addition to speaking to people at agricultural shows, we will do this by interviewing people and looking at existing user research."
        },
        {
            "text": "Equipped with a solid understanding, we can then start to look at ways to solve these problems. Co-design workshops will help us understand how we could meet these user needs."
        },
        {
            "heading": 3,
            "text": "Get involved"
        },
        {
            "text": "We will be holding workshops on 23, 24 and 26 August and interviews throughout the next few weeks to help us answer our questions and to start designing the options for the future. If you are a farmer, forester or grower and would like to get involved in our research please contact DEFRA-FFCP-Advice@defra.gov.uk. To find out more please leave a comment below and we will get back to you."
        },
        {
            "text": "Get involved with co-design activity in the rest of the programme."
        }
    ]
}