{
    "url": "https://naturalengland.blog.gov.uk/2024/02/29/catchment-sensitive-farming-sharing-sustainable-farming-techniques-at-the-arable-knowledge-hub/",
    "title": "Catchment Sensitive Farming: Sharing sustainable farming techniques at the Arable Knowledge Hub",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Farming",
        "wildlife and farming"
    ],
    "pub_date": "2024-02-29T10:22:43+00:00",
    "content": [
        {
            "text": "Guest blog: By John Charles-Jones, Woodborough Park Farm arable farmer"
        },
        {
            "text": "Sustainable farming is vital. Both food production and nature rely on healthy soils, clean water and air, and farmers can have a big impact."
        },
        {
            "text": "Environmentally friendly farming isn’t just good for nature either; done right, it can boost food production and provide farmers and landowners with financial incentives too. It’s a win-win."
        },
        {
            "text": "To help ensure farmers have access to the latest research and knowledge, we have helped facilitate the East Midlands Catchment Sensitive Farming (CSF) team to provide a free event for farmers from across the Midlands and beyond."
        },
        {
            "text": "Bringing farmers together"
        },
        {
            "text": "On the first Wednesday of each month, farmers from as far afield as Cumbria, Louth and Cirencester travel to our farm, Woodborough Park Farm in Nottinghamshire, to discover the latest sustainable farming practices at the CSF Arable Knowledge Hub."
        },
        {
            "text": "The monthly event features a presentation on the Sustainable Farming Incentive (SFI) from leading East Midlands farmer, consultant and agronomist Andrew Wells, covering the different SFI options and how to apply."
        },
        {
            "text": "Visitors then board a trailer for a brief tour of the farm, stopping off to see field-scale demonstrations of herbal leys, legume fallows, winter cover crops, and more. Although this year it is more of a demonstration of how not to do it than how to do it well!"
        },
        {
            "text": "Woodborough Park Farm is hopefully a fitting venue for the event. Stretching to 240ha, our predominantly arable farm is situated in picturesque but topographically challenging countryside, just seven miles north of Nottingham city centre."
        },
        {
            "text": "We have been farming here since 2004 and have enthusiastically embraced Environmental Stewardship since we arrived."
        },
        {
            "text": "Our Entry Level Stewardship/Higher Level Stewardship agreement, which replaced an original Countryside Stewardship agreement, is due to expire later this year."
        },
        {
            "text": "We very much hope therefore that our farm at Woodborough is a good venue to help provide an SFI knowledge hub. I say hub rather than ‘demonstration farm’ because, like so many other farmers at the moment, we are unsure as to precisely what we should be doing."
        },
        {
            "text": "However, by showcasing some of the options available under the scheme, we can at least help initiate an open and honest discussion regarding the benefits and possible pitfalls. We are there to learn alongside everyone else."
        },
        {
            "text": "Benefits for farmers and the environment"
        },
        {
            "text": "The Arable Knowledge Hub event is a continuation of a similar project in the Peak District called the White Peak Trials. I attended a White Peak Trials event last July (last Friday of the month between April-October), to learn more about herbal leys and came away feeling it had been one of the most inspiring events I had been to for years."
        },
        {
            "text": "A pitfall of asking too many questions on the day was to discover that Natural England had been looking for an East Midlands arable farmer to work with, and after further discussions with the CSF team, the Arable Knowledge Hub was formed."
        },
        {
            "text": "Like the Arable Knowledge Hub, the White Peak Trials bring together farmers - from across the Peak District and beyond - to share knowledge and best practice, particularly around herbal leys. Herbal leys are temporary grasslands made up of legume, herb and grass species and so are beneficial for pollinators, soil, water, natural flood management, air and farm productivity."
        },
        {
            "text": "That is a lot of potential boxes to tick, and so we ended up planting 25ha in early September 2023, which, despite the dreadful weather we have endured since, has established well. We may yet plant significantly more in 2024."
        },
        {
            "text": "Herbal leys are just one option under the SFI. You can explore the full range of what’s available for your farm by joining us at a future Arable Knowledge Hub or White Peak Trials event."
        },
        {
            "text": "You can view and book onto further events on the CSF farm Knowledge Hub Eventbrite page."
        },
        {
            "text": "More information about Catchment Sensitive Farming"
        },
        {
            "text": "Catchment Sensitive Farming is a joint project led by Natural England, in partnership with the Environment Agency and Defra, that works with farmers and partners across England to produce food in a way that protects water, air and soil."
        },
        {
            "text": "Further information, including contact details for your local CSF adviser, is available on the Catchment Sensitive Farming page."
        }
    ]
}