{
    "url": "https://space.blog.gov.uk/2024/02/29/contracts-awarded-in-uk-space-agency-unlocking-space-for-business-project/",
    "title": "Contracts awarded in UK Space Agency Unlocking Space for Business project",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Business",
        "Catalysing Investment"
    ],
    "pub_date": "2024-02-29T12:00:42+00:00",
    "content": [
        {
            "text": "Twelve applicants have been awarded contracts for feasibility study projects as part of the UK Space Agency’s Unlocking Space for Business project."
        },
        {
            "text": "Contracts are up to £200,000 each and aim to develop innovative and commercially viable feasibility studies that combine ground-based and satellite services for the transport, logistics and finance sectors. Each project will run for 6 months to July 2024. "
        },
        {
            "text": "Unlocking Space for Business is an 18-month project delivered by the UK Space Agency to foster innovation by combining satellite data and services with other data sources and technology to drive business benefits for those outside the space industry. "
        },
        {
            "text": "The funding competition was run by the UK Space Agency using Innovate UK’s Small Business Research Initiative (SBRI), which supports research and development of solutions to public sector challenges. Organisations applied for a share of up to £2 million to develop feasibility studies aiming to combine terrestrial technologies with satellite data for the transport, logistics and financial services sectors."
        },
        {
            "text": "Andrew Griffith MP, Minister for Space at the Department for Science, Innovation and Technology, said:"
        },
        {
            "text": "Successful applicants propose studies that could combine terrestrial data and services (such as AI, quantum, machine learning and geospatial data) with satellite data and services, and provide deeper analysis to develop insights and present new solutions to UK customers. "
        },
        {
            "text": "For example, Reading-based company Assimila are developing an Earth observation and climate-based service to understand how the scale of wildfires impacts insurance portfolios, whereas One Big Circle is developing an infrastructure monitoring system using satellite and ground-based data and AI to map areas of geographical challenge across the UK rail network. "
        },
        {
            "text": "The diversity of contracts awarded demonstrates the wide range of applications of space services can provide innovative solutions for UK customers."
        },
        {
            "heading": 2,
            "text": "The contracts "
        },
        {
            "text": "The following organisations have been awarded contracts under the SBRI competition: "
        },
        {
            "heading": 3,
            "text": "Assimila  "
        },
        {
            "text": "Development of a new Earth observation and climate-based service to help insurers, insurance brokers and risk managers to understand the scale of wildfires and how this affects their portfolio of insurance coverage. "
        },
        {
            "heading": 3,
            "text": "BolgiaTen, with support from Polestar Space Applications Limited "
        },
        {
            "text": "Development of a maritime trade vessel monitoring and logistics risk assessment ‘Software as a Service’ (SaaS) platform. It combines AI and machine learning with Earth observation data to provide near real-time tracking of trade vessels to identify unusual shipping behaviour. "
        },
        {
            "heading": 3,
            "text": "Craft Prospect "
        },
        {
            "text": "Development of an AI-powered maritime software application using Synthetic-Aperture Radar (SAR) data."
        },
        {
            "heading": 3,
            "text": "EOLAS Insight Ltd "
        },
        {
            "text": "Development of an end-to-end service for ordering, delivery and validation of satellite data solutions for customers in the financial services sector."
        },
        {
            "heading": 3,
            "text": "Geospatial Ventures Ltd "
        },
        {
            "text": "Development of a prototype On Board Unit for use on transport and logistic applications, using satellite connectivity and communications, and position, navigation and timing technologies."
        },
        {
            "heading": 3,
            "text": "GMV "
        },
        {
            "text": "Integrating Ordnance Survey data into a commercial Global Navigation Satellite System (GNSS) service called GMV GSharp®. It aims to increase the precision and assurance of position data for the autonomous transport and logistics sector. "
        },
        {
            "heading": 3,
            "text": "National Oceanography Centre  "
        },
        {
            "text": "Combining satellite data with tidal data to produce intertidal elevation maps and accompanying uncertainty plots."
        },
        {
            "heading": 3,
            "text": "One Big Circle  "
        },
        {
            "text": "Development of an Advanced Infrastructure Monitoring by Satellite system that fuses terrestrial and satellite data with AI to produce a condition map of UK rail and known critical geographical areas of challenge. "
        },
        {
            "heading": 3,
            "text": "Ordnance Survey  "
        },
        {
            "text": "Integrating geospatial and Earth observation data for use in financial services to support improved outcomes for investors, environment and society.  "
        },
        {
            "heading": 3,
            "text": "Safe Earth Solutions  "
        },
        {
            "text": "A platform to measure and monitor biodiversity in line with requirements established in the Environment Act 2021, leveraging space and aerial data to address the needs of councils, landowners, biodiversity credit sellers, buyers and registry operators. "
        },
        {
            "heading": 3,
            "text": "Space Intelligence  "
        },
        {
            "text": "Development of an algorithm to enable access to timely analysis of satellite-derived nature data, supporting banks and asset managers to improve operational efficiency of due diligence processes and risk reporting. "
        },
        {
            "heading": 3,
            "text": "Treeconomy  "
        },
        {
            "text": "Development of an online software platform conducting automated analysis on vegetated natural capital assets, enabling financial institutions to more confidently and transparently invest in nature. "
        }
    ]
}