{
    "url": "https://socialcare.blog.gov.uk/2024/02/29/dancing-for-fun-and-inclusivity/",
    "title": "Dancing for fun and inclusivity",
    "authors": [
        "Julie Nicholson"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Leadership",
        "learning disabilities",
        "Viewpoint"
    ],
    "pub_date": "2024-02-29T15:46:56+00:00",
    "content": [
        {
            "heading": 2,
            "text": "First (dance) steps"
        },
        {
            "text": "I first met DanceSyndrome founder, Jen Blackwell, in the very early stages of her journey. I was working for UnLtd and supported Jen and her mum Sue to find funding to help them get the organisation off the ground."
        },
        {
            "text": "I was inspired by their desire to overcome barriers they faced in supporting Jen to have a career of her choice. Jen has Down’s syndrome, but she has never let this fact stop her living the life she wants. She went to mainstream school but met with challenges when she left the education system."
        },
        {
            "text": "If you speak to Jen and ask her why DanceSyndrome started, she always says:"
        },
        {
            "text": "DanceSyndrome began in 2009 and was registered as a charity in 2013. Over the years, our small charity has gone from strength to strength, not just working in local communities but also with businesses and public sector organisations to try and make the world a more inclusive place."
        },
        {
            "heading": 2,
            "text": "Unique offer"
        },
        {
            "text": "Our work is divided up into three distinct areas. We deliver community dance activities, artistic development opportunities and training and consultancy."
        },
        {
            "text": "What sets us apart from other organisations is our application of a co-delivery model to all aspects of our work, with people with learning disabilities taking visible leadership roles working in equal partnership with professional dance artists. We provide the training needed through our own accredited leadership training course, Dance By Example, which can be a Level 1 or Level 2 qualification through the Leadership Skills Foundation."
        },
        {
            "text": "We have recently secured Arts Council England National Portfolio Organisation status, which supports our artistic development strand. Our team of performers delivers high quality co-choreographed performance pieces which can be performed at festivals, awards ceremonies, conferences and other special events to inspire audience members to see what people with learning disabilities can achieve if given the right support."
        },
        {
            "text": "We also deliver training and consultancy for businesses, students and qualified dance artists so that people can look at how they can make their own professional practices more inclusive and accessible."
        },
        {
            "text": "As we go from strength to strength, we are getting so much recognition for our work, with a range of local and national awards from the dance industry, third sector and beyond. Our most notable recognition was the Queen’s (now King's) Award for Voluntary Services, which is the voluntary organisation equivalent of an MBE."
        },
        {
            "heading": 2,
            "text": "Award winning innovation"
        },
        {
            "text": "As a result of her work with DanceSyndrome, Jen has received a significant number of personal awards too. She has made TV appearances alongside her favourite celebrities, including popstar, Alexandra Burke and professional dancer, Giovanni Pernice. Her proudest moment without a doubt was hearing she had been recognised with a British Empire Medal in the 2023 King’s Birthday Honours. "
        },
        {
            "text": "I asked Jen how she felt about receiving the BEM:"
        },
        {
            "text": "Jen's vision all those years ago has resulted in some truly life changing experiences for so many people involved in the work of DanceSyndrome! To find out more about our work and how to get involved, please visit the DanceSyndrome website. "
        }
    ]
}