{
    "url": "https://civilservice.blog.gov.uk/2024/02/29/did-you-know-you-can-become-a-magistrate/",
    "title": "Did you know you can become a magistrate?",
    "authors": [
        "Imaad Bajwa1"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-29T10:16:57+00:00",
    "content": [
        {
            "text": "Find out why civil servant Christine Wright decided to apply."
        },
        {
            "text": "Many of the legal decisions made in England and Wales are made by magistrates. They are ordinary\npeople who work in all sorts of fields and have no previous connection to the law profession."
        },
        {
            "text": "Magistrates play a vital role in the justice system, volunteering their time to hear cases in the criminal and family court, to help to reduce the caseload in court and give access to justice to those who really need it."
        },
        {
            "text": "You do not need any special qualifications or experience to be a magistrate. You are provided with the necessary training and will be given the support of a legal adviser."
        },
        {
            "text": "People between 18 and 74 can apply, provided you can commit to at least 13 days a year, for at least five years. You can find out more about eligibility on the magistrate recruitment website. Christine Wright, who works in the transformation team at the Legal Aid Agency (LAA), tells us why she applied and how the Ministry of Justice (MoJ) supported her in the process."
        },
        {
            "text": "Can you describe your role as a magistrate?"
        },
        {
            "text": "As a magistrate in the adult criminal court, I sit on a ‘bench’ of usually three magistrates. We hear\ncases on things like minor assaults, motoring offences, theft and stalking. We pass the most serious\ncrimes, such as murder, rape and robbery, to the Crown Court.\nAfter hearing all the evidence, we consider all the facts and decide if the person has committed an offence."
        },
        {
            "text": "When considering a sentence we use sentencing guidelines, and consider culpability, harm, and any aggravating or mitigating factors, to make rational judgements on the punishment (e.g a short term prison sentence). We always bear in mind if any rehabilitation measures (e.g unpaid work) could help to reduce re-offending behaviour. We are supported by a legal adviser who ensures our proposed sentence is aligned with the law."
        },
        {
            "text": "How did you find the process of applying to be a magistrate?"
        },
        {
            "text": "It was very straightforward. I read an article about being a magistrate on the MoJ intranet and decided to read up about it and apply when there were vacancies available in my local area. My\nDeputy Directors were supportive of my application and I’ve been able to fit my 13 sitting days around work."
        },
        {
            "text": "What are the biggest misconceptions?"
        },
        {
            "text": "That being a magistrate is an exclusive club and you have to be posh, old, male, and a lawyer to join. My cohort are a mix of people from all over Nottinghamshire – different genders, ethnicities, backgrounds, and careers. Out of 14 we have one student, some who work full time in sectors as broad as credit finance, retail and some stay-at-home carers – it really is for everyone."
        },
        {
            "text": "How has being a magistrate helped you at work and beyond?"
        },
        {
            "text": "Not only does sitting as a magistrate help me at work, it also helps me give back to my community. It\nhas given me a real insight into the wider criminal justice system and the way all partners and agencies work together to deliver access to justice. For example, through Judicial College training, I’ve learned a lot about issues such as mental health and domestic abuse and this reminded me the importance of the LAA making it easier for vulnerable people to get legal support."
        },
        {
            "text": "How to apply: www.icanbeamagistrate.co.uk."
        }
    ]
}