{
    "url": "https://insideDIO.blog.gov.uk/2024/02/29/dio-teams-praised-for-swift-clean-up-operation-after-tornado-rips-through-raf-akrotiri/",
    "title": "DIO teams praised for swift clean-up operation after tornado rips through RAF Akrotiri",
    "authors": [
        "Col Bob MacDonald"
    ],
    "categories": [
        "Cyprus",
        "Estates"
    ],
    "pub_date": "2024-02-29T15:06:53+00:00",
    "content": [
        {
            "text": "RAF Akrotiri in Cyprus is an extremely busy military site, which supports operations in the region and is used as a forward mounting base for overseas operations in the Middle East.  "
        },
        {
            "text": "On Wednesday, 14 February 2024, the area was hit by a Category three tornado, which caused significant damage across the station.  "
        },
        {
            "text": "While it is a blow to see many of our buildings suffer serious damage, we are grateful that nobody suffered any injuries in the tornado. The safety of our personnel is always what is most important for us.   "
        },
        {
            "text": "Without delay, DIO Regional Delivery (RD) teams were out as early as 2.30am on the morning of the tornado to clear up debris and carry out repairs on areas that had sustained damage.  "
        },
        {
            "text": "Major Steve Stewart, in particular, has received vast praise after getting involved in the clear up in the early hours of the morning, despite his own living quarters, personal possessions and car suffering damage. He immediately took the lead in damage assessment and got to work. "
        },
        {
            "heading": 2,
            "text": "Extent of the damage "
        },
        {
            "text": "Sixteen service family houses were damaged during the tornado. These were a priority for us to repair for the wellbeing of the families involved and all were repaired very quickly, though unfortunately two families whose homes were more severely damaged did have to move out for a couple of days.  "
        },
        {
            "text": "Two blocks of single living accommodation were damaged in the tornado, but within a matter of days, one has been made safe and occupants provided with alternative accommodation. The other building was the Officers' Mess and a small number of personnel have had to temporarily move out while roof tiles are replaced. "
        },
        {
            "text": "Operational buildings on site were also hit by the tornado, with the roof of the petroleum storage depot ripped off and the fuel supply temporarily disrupted, though there were no leaks. Buildings at the Mole, where ships dock, also had damaged roofs. Both of these were quickly returned to full functionality, with further repair works ongoing.  "
        },
        {
            "text": "Meanwhile, a hangar also suffered damage and some aircraft have been moved to alternative locations until repair works are completed.  "
        },
        {
            "heading": 2,
            "text": "Working together to keep people safe "
        },
        {
            "text": "Staff from our Regional Delivery teams and our Hard Facilities Management contractor, Mitie, have all done fantastic jobs.  "
        },
        {
            "text": "They jumped straight into action, assessing damage, isolating power, and alerting occupants to the damage of potentially unsafe buildings. As soon as it was daylight, the DIO teams began to compile a list of all damaged buildings to allow Mitie to undertake immediate works. "
        },
        {
            "text": "One member of my team told me by the time they had woken up in the morning, Mitie contractors were already out starting the clean-up works. They were collecting roof tiles from the road and clearing a path to make way for the fire service so they could carry out building inspections.  "
        },
        {
            "text": "One of the houses that was worst hit had lost most of the roof tiles, which had been launched across the street, damaging a further two houses and a car in their wake. Some of the tiles were even embedded into a wall in an opposite house, really showing the force of the tornado. Uprooted trees also had to be cleared and debris removed from the airfield operating surfaces before aircraft operations could resume. "
        },
        {
            "text": "The teams from Mitie did a brilliant job in making buildings safe and removing hazards from houses, buildings, roads and pathways. The valiant efforts of all involved have meant injuries have been avoided and operations have returned to normal in a very short amount of time. "
        },
        {
            "text": "I was genuinely impressed by the speed of response and collaboration between DIO onsite team and Mitie to deal with the devastation the tornado left across Akrotiri. My personal thanks to all and particularly to Major Steve Stewart, who I spoke to the morning after, for his exceptional leadership and selfless commitment in the early hours to ensure people were safe, the immediate response was effective, and operations could continue as quickly as possible. "
        }
    ]
}