{
    "url": "https://dragonsden.blog.gov.uk/2024/02/29/dragons-den-ip-blog-series-21-episode-9/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 9",
    "authors": [
        "Emma Richards"
    ],
    "categories": [
        "Copyright",
        "Designs",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2024-02-29T21:00:13+00:00",
    "content": [
        {
            "text": "Having just watched the latest episode of Dragons’ Den, it’s clear that innovation is still strong in the UK, with many keen entrepreneurs pitching their ideas to the Dragons and looking for investment. The pitches on offer this week cover a wide range of products, from dog treats to post-exercise recovery items and surprisingly, IP was not mentioned, but there was a wide range of products that could most certainly be protected."
        },
        {
            "heading": 3,
            "text": "It’s a dog’s life!"
        },
        {
            "text": "As a dog lover and owner, I was easily distracted by the gorgeous ‘Penny’ who was in danger of dominating the whole pitch. Once the allure of Penny had left, it was on to business. You may be wondering how dog treats can be protected by IP as they are not a unique or creative item?"
        },
        {
            "text": "When we consider IP protection, we consider the overall business and deciding which elements could potentially be protected. It is true that you cannot protect the idea of a dog treat but Richard Marles, founder of Park Life, has developed quite an eye-catching brand which Steven Bartlett highlighted during the pitch."
        },
        {
            "text": "If you have created a noticeable brand, it would be disappointing to have that stolen by your competitors so protecting it with a trade mark would be essential. A trade mark also adds value to your business and allows you the opportunity to look at licensing agreements and defend them if you are infringed."
        },
        {
            "heading": 3,
            "text": "Living independently "
        },
        {
            "text": "Jayne and Martin presented a heart-warming personal story which led them to develop an app allowing dementia patients to spend money and maintain their independence. As many of the Dragons pointed out, the idea is not unique as there are other applications offering a similar service. It is not possible to protect a conceptual idea with IP, but there are elements that you can protect to strengthen your business to scale and grow."
        },
        {
            "text": "The Sibstar app already has a great brand that has potential for protection with a trade mark, this will prevent any competitor developing a similar idea and using the name. An app is also considered a creative piece of work and as such will have automatic protection through copyright."
        },
        {
            "heading": 3,
            "text": "Recovery the right way "
        },
        {
            "text": "Last into the Den was MyoMaster founders, Lottie and Joe, who believed they had the solution to post exercise recovery. It was pointed out by many of the Dragons that the technology has been in existence for many years, so in terms of IP, it would be very difficult to protect these items."
        },
        {
            "text": "For a product to be eligible for patent protection the requirement is for it to be completely unique. As these items were not unique, the Dragons were most interested in the application that supported their business allowing users to pinpoint the post exercise recovery dependant to the exercise. As a keen runner of half marathons this would be very useful, even if I’m still not convinced by the ice bath!"
        },
        {
            "text": "The application was the unique element of the business that secured them the deal. In terms of protection for this; they could utilise a trade mark for their brand, copyright for the creative aspects of the app and potentially design protection if the products are unique in shape."
        },
        {
            "text": "Another great episode of Dragons’ Den this evening with my standout being when Richard Marles bravely declared “I’m out”, and for that reason alone, I will be looking out for his products the next time I’m in the supermarket."
        },
        {
            "text": "Hope you enjoyed this episode and don’t forget to come back for more upcoming editions as we follow the BBC Dragons' Den series."
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}