{
    "url": "https://insidehmcts.blog.gov.uk/2024/02/29/getting-it-right-for-civil-family-and-tribunals-reform/",
    "title": "Getting it right for civil, family and tribunals reform",
    "authors": [
        "Rachel Hunt, Civil, Family and Tribunals Programme Director"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Family",
        "Tribunals"
    ],
    "pub_date": "2024-02-29T10:00:07+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Earlier this month Nick Goodwin, CEO talked in his blog about adjustments to the Reform Programme across HMCTS and described how we would be rebalancing our operational priorities. My colleague Daniel Flury also wrote about how this will affect the delivery of the Crime Programme."
        },
        {
            "text": "To complete this series of updates, I wanted to tell you more about what this means across the civil, family and tribunals (CFT) jurisdictions, as well as some changes to our central functions."
        },
        {
            "heading": 2,
            "text": "Reform plans across civil, family and tribunals "
        },
        {
            "text": "Reformed services are having a significant impact on those who need our justice system, as well as helping the most vulnerable in our society. Uptake of these services – including divorce, money claims, family public law and immigration and asylum – has been strong and at the end of 2023, we published data which shows a trend towards the increased use of digital services."
        },
        {
            "text": "But the remaining services in the civil jurisdiction and family private law are the largest and most complex services in the CFT Programme. As a result, we’ve decided to extend the completion date for the overall Programme from March 2024 to March 2025, to make sure we get this right."
        },
        {
            "text": "We must balance delivery of reform with other policy areas, such as changes in immigration and the introduction of automatic referral to mediation in the civil process. This has resulted in further development work needing to be prioritised over planned reform work. I’ve set out our plans in more detail in this blog."
        },
        {
            "heading": 2,
            "text": "Civil implementation"
        },
        {
            "text": "Civil enforcement changes will be removed from our plans, to help us focus on the large services that we have already started to reform.  Our plans still include providing the ability for users to issue warrants of control to enforce County Court judgments digitally through the reforming Online Civil Money Claims (OCMC) Service. We instead plan to deliver change to all other enforcement process outside of the Reform Programme, subject to funding."
        },
        {
            "text": "We will continue to deliver our priorities for 2024 across civil which include:"
        },
        {
            "heading": 2,
            "text": "Family private law online and updates across tribunals"
        },
        {
            "text": "In family private law, we spent longer than planned in the early adopter phase to resolve issues identified through early testing and now plan to complete national rollout by the end of March 2025."
        },
        {
            "text": "Across tribunals projects, we will continue to deliver an end-to-end digital service for public and professional users across Employment, Immigration and Asylum, Social Security and Child Support and Criminal Injuries Compensation Tribunals by the end of March 2024 (April for the Immigration and Asylum Tribunal).  Work will continue thereafter in these services to implement and rollout List Assist (except for Criminal Injuries Compensation Tribunal)."
        },
        {
            "text": "Last month in the Employment Tribunal, we introduced the ability for more claim types to be issued and managed within the digital service. Soon legal representatives will be able to issue claims for the first time. This service is currently live in several early adopter sites, so our focus will then move to rolling it out nationally in the Spring."
        },
        {
            "heading": 2,
            "text": "Service Centres and National Business Centres"
        },
        {
            "text": "Across our five Service Centres – which help people with cases going through the justice system – the movement of civil work to these sites will continue, but future movement of services will be dependent on the progress of digital reforms. No further family private law and Employment Tribunal work will move to Service Centres until at least April 2025."
        },
        {
            "text": "Across National Business Centres, as the change process from paper to digital will be slower than anticipated, we must still support paper processes and legacy systems. National Business Centres will therefore continue to make a valued contribution to HMCTS."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "As ever, we’ll work together with our staff, judiciary and justice partners and continue to update and engage with our stakeholders, including professional and public user groups. We’ll work with these groups to gather feedback from the people they represent."
        },
        {
            "text": "You can stay up to date with progress on the final phase of Reform in several ways:"
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Dilyn y trywydd iawn ar gyfer diwygio’r awdurdodaethau sifil, teulu a’r tribiwnlysoedd"
        },
        {
            "text": "Yn gynharach y mis hwn siaradodd Nick Goodwin, Prif Swyddog Gweithredol yn ei flog am addasiadau i'r Rhaglen Ddiwygio ar draws GLlTEF a disgrifiodd sut y byddem yn ail-gydbwyso ein blaenoriaethau gweithredol. Ysgrifennodd fy nghyd-Weithiwr Daniel Flury hefyd am sut y bydd hyn yn effeithio ar gyflawni'r Rhaglen Droseddol."
        },
        {
            "text": "I gwblhau'r gyfres hon o ddiweddariadau, roeddwn i eisiau dweud mwy wrthych am beth y mae hyn yn ei olygu ar draws yr awdurdodaethau sifil, teulu a’r tribiwnlysoedd (CFT), yn ogystal â rhai newidiadau i'n swyddogaethau canolog."
        },
        {
            "heading": 2,
            "text": "Trefniadau diwygio ar draws yr awdurdodaethau sifil, teulu a’r tribiwnlysoedd "
        },
        {
            "text": "Mae gwasanaethau diwygiedig yn cael effaith sylweddol ar y rhai sydd angen ein system gyfiawnder, yn ogystal â helpu'r rhai mwyaf agored i niwed yn ein cymdeithas. Mae'r nifer sy'n manteisio ar y gwasanaethau hyn - gan gynnwys ysgariad, hawliadau am arian, cyfraith deulu gyhoeddus a mewnfudo a lloches - wedi bod yn uchel ac ar ddiwedd 2023, fe wnaethom gyhoeddi data sy'n dangos tuedd tuag at y defnydd cynyddol o wasanaethau digidol."
        },
        {
            "text": "Ond y gwasanaethau sy'n weddill yn yr awdurdodaeth sifil a chyfraith deulu breifat yw'r gwasanaethau mwyaf a’r rhai mwyaf cymhleth yn y Rhaglen CFT. O ganlyniad, rydym wedi penderfynu ymestyn y dyddiad cwblhau ar gyfer y Rhaglen gyffredinol o fis Mawrth 2024 i fis Mawrth 2025, er mwyn sicrhau ein bod yn ei chael yn iawn."
        },
        {
            "text": "Rhaid i ni gydbwyso cyflwyno diwygiadau â meysydd polisi eraill, megis newidiadau mewn mewnfudo a chyflwyno atgyfeiriad awtomatig at gyfryngu yn y broses sifil. Mae hyn wedi arwain at yr angen i flaenoriaethu gwaith datblygu pellach dros waith diwygio a drefnwyd eisoes. Rwyf wedi nodi ein trefniadau yn fanylach yn y blog hwn."
        },
        {
            "heading": 2,
            "text": "Gweithredu newidiadau sifil"
        },
        {
            "text": "Bydd newidiadau i’r system gorfodi sifil yn cael eu dileu o'n trefniadau, i'n helpu i ganolbwyntio ar y gwasanaethau mawr yr ydym eisoes wedi dechrau eu diwygio.  Mae ein cynlluniau yn dal i gynnwys darparu'r gallu i ddefnyddwyr gyhoeddi gwarantau rheolaeth i orfodi dyfarniadau Llys Sirol yn ddigidol trwy ddiwygio'r Gwasanaeth Hawliadau am Arian Sifil Ar-lein (OCMC). Yn hytrach, rydym yn bwriadu cyflwyno newid i'r holl brosesau gorfodi eraill y tu allan i'r Rhaglen Ddiwygio, yn amodol ar gyllid."
        },
        {
            "text": "Byddwn yn parhau i gyflawni ein blaenoriaethau ar gyfer 2024 ar draws y meysydd sifil, sy'n cynnwys:"
        },
        {
            "heading": 2,
            "text": "Cyfraith deulu breifat ar-lein a diweddariadau ar draws y tribiwnlysoedd"
        },
        {
            "text": "Yn maes cyfraith deulu breifat, gwnaethom dreulio mwy o amser na'r disgwyl yn y cyfnod mabwysiadu cynnar i ddatrys problemau a adnabuwyd trwy brofion cynnar ac rydym bellach yn bwriadu cwblhau'r broses gyflwyno genedlaethol erbyn diwedd mis Mawrth 2025."
        },
        {
            "text": "Ar draws prosiectau’r tribiwnlysoedd, byddwn yn parhau i ddarparu gwasanaeth digidol o'r dechrau i'r diwedd ar gyfer defnyddwyr cyhoeddus a phroffesiynol ar draws y Tribiwnlysoedd Cyflogaeth, Mewnfudo a Lloches, Nawdd Cymdeithasol a Chynnal Plant a’r Tribiwnlys Iawndal am Anafiadau Troseddol erbyn diwedd mis Mawrth 2024 (Ebrill ar gyfer y Tribiwnlys Mewnfudo a Lloches). Bydd gwaith yn parhau wedi hynny yn y gwasanaethau hyn i weithredu a chyflwyno List Assist (ac eithrio’r Tribiwnlys am Iawndal Anafiadau Troseddol)."
        },
        {
            "text": "Fis diwethaf yn y Tribiwnlys Cyflogaeth, fe wnaethom gyflwyno'r gallu i gyhoeddi mwy o fathau o hawliadau a'u rheoli o fewn y gwasanaeth digidol. Cyn bo hir, bydd cynrychiolwyr cyfreithiol yn gallu cyflwyno hawliadau am y tro cyntaf. Ar hyn o bryd mae'r gwasanaeth hwn yn weithredol mewn sawl safle mabwysiadu cynnar, felly bydd ein ffocws wedyn yn symud i'w gyflwyno'n genedlaethol yn y Gwanwyn."
        },
        {
            "heading": 2,
            "text": "Canolfannau Gwasanaeth a Chanolfannau Busnes Cenedlaethol"
        },
        {
            "text": "Ar draws ein pum Canolfan Wasanaeth - sy'n helpu pobl gydag achosion sy'n mynd drwy'r system gyfiawnder - bydd symud gwaith sifil i'r safleoedd hyn yn parhau, ond bydd symud gwasanaethau yn y dyfodol yn ddibynnol ar gynnydd diwygiadau digidol. Ni fydd unrhyw waith cyfraith deulu breifat na gwaith y Tribiwnlys Cyflogaeth bellach yn symud i Ganolfannau Gwasanaeth tan o leiaf Ebrill 2025."
        },
        {
            "text": "Ar draws y Canolfannau Busnes Cenedlaethol, gan y bydd y broses o newid o bapur i ddigidol yn arafach na'r disgwyl, mae'n rhaid i ni barhau i gefnogi prosesau papur a hen systemau. Felly, bydd Canolfannau Busnes Cenedlaethol yn parhau i wneud cyfraniad gwerthfawr i GLlTEF."
        },
        {
            "heading": 2,
            "text": "Cael yr wybodaeth ddiweddaraf"
        },
        {
            "text": "Fel erioed, byddwn yn gweithio gyda'n staff, y farnwriaeth a'n partneriaid cyfiawnder ac yn parhau i ddiweddaru ac ymgysylltu â'n rhanddeiliaid, gan gynnwys grwpiau defnyddwyr proffesiynol a chyhoeddus. Byddwn yn gweithio gyda'r grwpiau hyn i gasglu adborth gan y bobl y maent yn eu cynrychioli."
        },
        {
            "text": "Gallwch gael yr wybodaeth ddiweddaraf am y cynnydd ar gam olaf y Rhaglen Ddiwygio mewn sawl ffordd:"
        }
    ]
}