{
    "url": "https://environmentagency.blog.gov.uk/2024/02/29/harnessing-the-hidden-power-of-restored-saltmarshes-for-carbon-capture/",
    "title": "Harnessing the hidden power of restored saltmarshes for carbon capture",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Climate change",
        "Environment Agency",
        "Fisheries and biodiversity",
        "Sustainability"
    ],
    "pub_date": "2024-02-29T14:35:39+00:00",
    "content": [
        {
            "text": "A recent collaboration involving the Environment Agency, the environmental consultancy Jacobs and Manchester Metropolitan University (MMU) is shining a light on the role of restored saltmarshes in storing blue carbon – carbon captured by the oceans and coastal ecosystems. The scientific reports published today demonstrates the valuable role saltmarshes can play in achieving our Net Zero targets.   "
        },
        {
            "text": "Saltmarshes are dynamic coastal wetlands that are flooded and drained by tides and rich in plant and animal life. They form in areas where salt water is brought in by tides, inundating marshland and creating a unique habitat characterized by mud and peaty sediment.   "
        },
        {
            "text": " The EA's Restoring Meadows, Marsh and Reef (ReMeMaRe) initiative has a target to restore at least 15% of the current extent of saltmarsh habitats within the next 20 years.  "
        },
        {
            "text": "Coastal habitat creation often involves making physical changes to the landscape- removing man-made tidal barriers and restoring the original saltmarsh and mudflat ecosystems – a method known as “Managed Realignment”. There are many examples of these schemes across the country, such as Steart Marshes in Somerset, or Medmerry in Sussex.   "
        },
        {
            "text": "It’s already known that saltmarshes are important coastal ecosystems that store carbon naturally.   "
        },
        {
            "text": "However, unlocking the full potential of these habitats requires a deeper understanding of how they accumulate carbon and the benefits this offers. The two EA studies covered in the report looked at 25 saltmarsh restoration sites for a deeper exploration.  "
        },
        {
            "text": "Bridging the Knowledge Gap  "
        },
        {
            "text": "Despite the important role that saltmarshes play in our ecosystems, significant gaps in our understanding still remain. Questions such as how much and how fast restored saltmarshes can store carbon, the types of carbon they store and the overall net carbon benefit they provide are still under investigation. These gaps are not just areas of academic interest; they have real-world implications for how we manage our natural resources and respond to climate change.   "
        },
        {
            "text": "To tackle some of these questions the EA initiated two studies with Jacobs and MMU, aimed at uncovering the carbon storage capabilities of restored saltmarshes. The first focuses on identifying and defining the data gaps that exist, paving the way for future research and policy development. The second study dives deeper into the analysis of carbon accumulation, gathered using real-world sampling, seeking to expand our evidence and establish a more robust understanding of how restored salt marshes contribute to our carbon capture efforts. This involved collecting and analysing sediment cores from the restored saltmarshes (or reanalysing cores and data kindly provided by the Wildfowl and Wetlands Trust).   "
        },
        {
            "text": " The Defra-funded studies will support the ongoing development of a UK Saltmarsh Code- a set of rigorous standards and practices designed to sell saltmarsh carbon credits and fund further restoration, similar to the pre-existing Woodland Carbon Code and Peatland Code in the UK. The studies fit into previous research done by Manchester Metropolitan University and Jacobs for the Environment Agency in 2022 - part of the summary report published on the two studies is a comparison of the findings with this previous research.  "
        },
        {
            "text": "According to Dr Ben Green, Senior Advisor in the EA’s Estuaries and Coasts Planning team, these reports provide vital new information on the ability of restored saltmarshes to lock away carbon. “The data from this report will feed into two key projects that the Environment Agency are working on - the development of a UK Saltmarsh Code and the reviewing of evidence needed for the addition of saltmarsh to the UK Greenhouse Gas Inventory. Both these projects look to utilise the climate mitigation benefits of saltmarshes to help us achieve Net Zero,” he says.  "
        },
        {
            "text": "While the research has yielded valuable insight it also highlights the need for further exploration. The EA’s holistic approach to understanding the power of these landscapes storing carbon emissions, plus the many other benefits they provide, underscores our commitment to mitigating the effects of climate change.  "
        },
        {
            "text": "To find out more about the EA’s work with partners in restoring salt marshes visit: Restoring Meadow, Marsh and Reef (ReMeMaRe) | Estuarine & Coastal Sciences Association (ecsa.international)  "
        },
        {
            "text": "You can also Follow the Environment Agency on Twitter, and sign up for email alerts.  "
        },
        {
            "text": "  "
        }
    ]
}