{
    "url": "https://dluhcdigital.blog.gov.uk/2024/02/29/join-us-at-our-digital-recruitment-days-in-manchester/",
    "title": "Join us at our Digital Recruitment Days in Manchester",
    "authors": [
        "DLUHC Digital team"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-02-29T15:12:16+00:00",
    "content": [
        {
            "text": "Do you work in technology, digital or data, and are looking for a fulfilling and impactful career opportunity?  "
        },
        {
            "text": "Join us for our Digital Recruitment Days event in Manchester on 14 and 15 March. We will be recruiting for the following roles at DLUHC. Find out more and apply to attend: "
        },
        {
            "heading": 3,
            "text": "14 March event"
        },
        {
            "heading": 3,
            "text": "15 March event "
        },
        {
            "text": "Our Manchester event builds on the success of our previous recruitment days – in Darlington in February, in Leeds in January, and in Wolverhampton in November last year. We welcomed over 200 people in total from a wide range of backgrounds across a variety of digital, data and technology specialisms, which subsequently resulted in over 80 job offers made across different specialisms and levels. "
        },
        {
            "heading": 2,
            "text": "Why attend"
        },
        {
            "text": "Our Digital Recruitment Days provide a unique opportunity for you to meet, connect and engage in two-way conversations with our digital teams. You will meet professionals who work in your specialism, as well as our senior leadership team. "
        },
        {
            "text": "It's a chance for you to learn more about DLUHC Digital and how we work, ways to develop and grow your career with us, and the range of staff benefits we offer. "
        },
        {
            "text": "You will also get an opportunity to tell us about yourself, your skills, experience and aspirations. "
        },
        {
            "text": "The event will be informal and, for the right people, we’re looking to make job offers shortly after the event, which means it’s potentially a great way to fast-track your job search. "
        },
        {
            "heading": 2,
            "text": "Join our purpose-driven work"
        },
        {
            "text": "At DLUHC, our work focuses on solving problems, delivering innovative services and achieving ambitious outcomes that have a big impact on communities and people right across the UK. "
        },
        {
            "text": "We work in autonomous, multi-disciplinary teams in 20 locations across the UK, including Manchester, Warrington, Leeds and Sheffield, and our people enjoy flexible and hybrid working, plus generous benefits and development routes for learning and progression. "
        },
        {
            "text": "Find out more about what it’s like to work in a digital, data or technology role at DLUHC."
        },
        {
            "heading": 2,
            "text": "Apply and attend our recruitment days"
        },
        {
            "text": "If it sounds like something you’d like to be part of, meet us and let’s chat. "
        },
        {
            "text": "Use the links at the top of this post to apply and attend our recruitment days."
        },
        {
            "text": "If you have any questions contact our recruitment team."
        }
    ]
}