{
    "url": "https://earlyyears.blog.gov.uk/2024/02/29/my-priorities-for-the-early-years-sector/",
    "title": "My priorities for the early years sector",
    "authors": [
        "Sir Martyn Oliver, His Majesty’s Chief Inspector for Standards in Education, Children’s Services and Skills"
    ],
    "categories": [
        "Childminder registration",
        "Early years",
        "Nannies"
    ],
    "pub_date": "2024-02-29T09:00:17+00:00",
    "content": [
        {
            "text": "I’ve now been in the post of His Majesty’s Chief Inspector for nearly two months. It has been an incredibly busy but rewarding start to this new role."
        },
        {
            "text": "As you may know, I come from a schools background, having been a teacher, headteacher, and most recently the Chief Executive of a multi-academy trust."
        },
        {
            "text": "The importance of the early years"
        },
        {
            "text": "But Ofsted is about much more than schools. And I’m determined to give equal focus to each sector that Ofsted regulates and inspects. We owe it to parents and families to make sure their children receive the best education and care at every stage. And that of course includes the vital early years sector."
        },
        {
            "text": "That’s why I’ve already met with leaders of key organisations including the Early Years Alliance (EYA) and the National Day Nurseries Association (NDNA). And I will be meeting with more organisations, providers, and individuals in the coming months. The EYA and NDNA have also kindly agreed to share this blog with their members to make sure the whole sector knows that Ofsted recognises the essential job you all do."
        },
        {
            "text": "Children only get one childhood, and getting those precious early years right is absolutely crucial. Without the building blocks laid in the first few years of a child’s life, they may fall behind in language and communications, struggle in school, need additional help later in life, and find it difficult to form meaningful relationships. Ultimately, they may not be able to reach their full potential."
        },
        {
            "text": "I want to make sure nobody thinks the early years is just “what happens before education.” It is, of course, the first stage of a child’s education, and most importantly the one on which all of their future education and life is built."
        },
        {
            "text": "The nurseries and childminders, nannies and teachers, staff and carers, and everyone else helping the youngest children to learn, thrive, and grow deserve as much recognition as all the other groups that Ofsted works with."
        },
        {
            "text": "And parents deserve the same reassurance that the people and places which they are trusting with their children in their first few years are of a high quality and have high-ambitions for them."
        },
        {
            "text": "My first 2 months"
        },
        {
            "text": "As you may have seen in the news, it has been a complicated start to 2024. In response to the Coroner’s inquest in to the tragic death of Ruth Perry, we made a number of changes and announcements."
        },
        {
            "text": "This included pausing our routine school inspections for two weeks to allow for inspector training. I know some were disappointed that this pause didn’t extend to our other inspections, including those of early years providers."
        },
        {
            "text": "It was a complicated and difficult decision. We always have to consider our duty to inspect in the best interests of children."
        },
        {
            "text": "We are the inspectorate for schools, while the Department for Education is the regulator. But for the early years sector, we have both roles. So, we register new provision, respond to concerns when they arise, and confirm when the essential improvements have been made. And so, we continued our regulatory work in the interest of keeping children safe and enabling new providers to open."
        },
        {
            "text": "But we are, of course, always looking at how we make further changes to improve the way we work with early years providers. I can confirm that early years inspectors will also have training on recognising and responding to visible signs of anxiety."
        },
        {
            "text": "And we have already updated our inspection handbook to reflect the other changes that we have made."
        },
        {
            "text": "My priorities"
        },
        {
            "text": "These changes were necessary, pressing, and they will make a real difference. That’s why I prioritised making them on my first days in post."
        },
        {
            "text": "But I want any future changes we make to be developed with input from all of you. I don’t believe it’s the job of a Chief Inspector to impose their own views or cause frequent disruption to the sectors we regulate."
        },
        {
            "text": "That’s why, next month, we will launch our Big Listen. We want to hear from all of you, and all of your parents and children. And we want to hear every idea or proposal, big or small. Nothing will be off the table."
        },
        {
            "text": "We will publish more details soon, so look out for those. And please respond and encourage others to do so."
        },
        {
            "text": "Because, with your input, I want to make sure that Ofsted is the best it can be. I want us to be of the system, by the system, and for children and parents."
        },
        {
            "text": "I want our inspections to get to a real understanding of what it’s like to be a child in your setting."
        },
        {
            "text": "I want us to use our insights and our unique view across all the services that impact children’s lives, so that we can see the bigger picture and a child’s full journey."
        },
        {
            "text": "I want us to recognise the great work that most of you do, even in trying circumstances, but also unapologetically hold high standards for all children."
        },
        {
            "text": "And I especially want us to focus on and speak up for the most disadvantaged and vulnerable children, those who can’t advocate for themselves."
        },
        {
            "text": "With these goals in mind, and with your input, I hope we can work together to make sure all children receive the best possible childcare and early education."
        },
        {
            "text": "My team"
        },
        {
            "text": "Of course, Ofsted is also a lot more than a single Chief Inspector, and I want to take this opportunity to introduce the senior early years team who I will be working with over my five years in the post."
        },
        {
            "text": "Lee Owston HMI - Lee is our National Director, Education, and leads the development of our education inspection policy, including the guidance and training for our inspectors."
        },
        {
            "text": "He was my first appointment in the role, and has held several roles at Ofsted, including as Deputy Director for Early Education. He knows very well the importance of early childhood which is why he is our senior champion for our ‘Best Start in Life’ strategic priority. Lee is a former primary school headteacher as well as a senior adviser for early education and primary schools for a local authority."
        },
        {
            "text": "You can read Lee’s profile to find out more."
        },
        {
            "text": "Yvette Stanley - Yvette is our National Director, Regulation and Social Care. She leads on the regulation of early years and social care provision as well as several other areas."
        },
        {
            "text": "She has over 30 years of experience in children’s services in early years, education, social care and wider services for children. Yvette is passionate about making sure every single child has access to high quality provision to get the best start in life and to achieve their potential."
        },
        {
            "text": "You can read Yvette’s profile to find out more."
        },
        {
            "text": "Jayne Coward HMI - Jayne is our new Deputy Director, Early Years Regulatory Policy and Practice. She supports Yvette in making sure our early years regulation is rigorous but fair, and considerate of providers."
        },
        {
            "text": "Jayne has extensive experience as an early years practitioner and as a local authority adviser."
        },
        {
            "text": "You can read Jayne’s profile to find out more."
        },
        {
            "text": "Richard Kueh HMI - Richard is our Deputy Director, Schools and Early Education. He supports Lee in making sure that children get a great early education before and once they start school."
        },
        {
            "text": "He has experience in primary and secondary schools, and has significant expertise across several areas of education."
        },
        {
            "text": "You can read Richard’s profile to find out more."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "I’m hoping to see and speak to as many of you as possible over the next five years. I’ll be visiting settings, attending events, and contributing to webinars, podcasts, blogs, and articles. "
        },
        {
            "text": "You can find out more about the resources we have for you, and the ways we can keep in touch in this blog post."
        },
        {
            "text": "We’ll also be publishing more details about the Big Listen next week, so please do give us your honest feedback about our current approach, the changes we are making, and whether we can do more. "
        }
    ]
}