{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/02/29/rg-complete_ex_diamondback/",
    "title": "Royal Gibraltar Regiment Soldiers Complete Exercise Diamondback",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "International",
        "Overseas Bases"
    ],
    "pub_date": "2024-02-29T10:01:39+00:00",
    "content": [
        {
            "text": "Soldiers from the Royal Gibraltar Regiment have successfully completed a two-month deployment to Fort Irwin, California, as part of Ex DIAMONDBACK."
        },
        {
            "text": "Members of the Regiment joined with X Company from the Royal Regiment of Fusiliers as part of the American 2-37 Armoured Battalion, who were conducting their readiness training with the 1st Armoured Combat Brigade out in California."
        },
        {
            "text": "The deployment saw participants and mentors from I Company conduct a mixture of training, lessons, kit issue and talked through their Standard Operating Procedures before they underwent a two-day Battle Craft Syllabus exercise which allowed them to train and integrate with their counterparts."
        },
        {
            "text": "The troops then conducted a Force-on-Force exercise before conducting live firing which concluded with a Live Firing Aviation Assault. This saw the soldiers deploy for 14 days into the field, operating in urban and rural environments with American aviation, artillery, and tanks."
        },
        {
            "text": "Working with the Fusiliers and Americans was a great experience and Acting Company Commander, Captain Mike Milward said: “To take part in such a large scale and well-resourced exercise was an excellent opportunity for all the soldiers deployed."
        },
        {
            "text": "The benefit of operating within an American Brigade, and all their supporting assets allowed members of the Royal Gibraltar Regiment to experience Combined Arms Manoeuvre on a significant scale."
        },
        {
            "text": "This exercise has really helped develop all ranks and it has been another great opportunity for the junior members of the Regiment to travel overseas, experience working with the Americans, and to refine their skills.”"
        },
        {
            "text": "The troops will join the rest of the Regiment who are conducting their annual live firing package at Hythe Ranges, in Kent, before finally returning to Gibraltar for some well-earned leave."
        }
    ]
}