{
    "url": "https://defradigital.blog.gov.uk/2024/02/29/spotlight-on-talent-development-meet-fast-streamer-warsome-hersi/",
    "title": "Spotlight on talent development: Meet Fast Streamer Warsome Hersi",
    "authors": [
        "Warsome Hersi"
    ],
    "categories": [
        "Defra digital",
        "Software tools"
    ],
    "pub_date": "2024-02-29T07:00:53+00:00",
    "content": [
        {
            "text": "First year Digital Data Technology and Cyber Fast Streamer Warsome Hersi tells us about his journey into the Civil Service Fast Stream and his first posting as a Product Manager within Defra Digital Data and Technology."
        },
        {
            "text": "I joined the Civil Service Fast Stream last September and am currently working as a Product Manager for the Career Pathways tool within Digital Data and Technology Services (DDTS) at Defra. This is the first of three, 12-month postings I’ll undertake across different government departments as part of the scheme, and it’s been a great place to start my Fast Stream journey!"
        },
        {
            "heading": 2,
            "text": "My career journey so far"
        },
        {
            "text": "Before joining the Fast Stream, I was working in the Forestry Commission as an Incentives Development Admin Officer, having graduated from Coventry University with a degree in Economics in 2020."
        },
        {
            "text": "I applied to the Fast Stream after participating in the Summer Diversity Internship Programme (SDIP) in 2022, where I spent five months working in the Central Digital and Data Office, at the Cabinet Office."
        },
        {
            "text": "Following successful completion of the internship, I received a ‘Fast Pass’, which allowed me to proceed directly to the Assessment Centre stage of the Fast Stream application process. Completing the internship programme was really beneficial, as it allowed me to feel confident and informed going into the assessment process for the Fast Stream."
        },
        {
            "text": "The opportunity to develop my skills and become a leader was what initially attracted me to both the SDIP and the Fast Stream. Both schemes offer opportunities to get out of my comfort zone and grow, both personally and professionally."
        },
        {
            "text": "I’ve still got a couple of years left on the Fast Stream and I’ll use that time to continue my development, build on my skills and determine what direction I want to take my career in."
        },
        {
            "text": "I’ve already had the opportunity to put some of the leadership skills I’ve developed through the Fast Stream and the SDIP into practice outside of work though; both in my role as the Chair of the Young Persons Independent Advisory Group for the Avon and Somerset Police, and when setting up NextGen Circle, a community organisation aimed at empowering minority communities through sport."
        },
        {
            "heading": 2,
            "text": "What does a Fast Stream posting involve?"
        },
        {
            "text": "All Fast Stream postings will be different, but when I was thinking of applying, I found it really useful to hear examples of the kinds of things that Fast Streamers get involved in, and what that looks like on a day- to-day basis."
        },
        {
            "text": "The Defra DDTS Career Pathways tool that I’m currently working on is designed to provide a comprehensive resource to explain the learning, development, and career opportunities available to each team and role within DDTS, in an easy-to-access SharePoint site, with a focus on great user experience."
        },
        {
            "heading": 2,
            "text": "The Fast Stream – both challenging and meaningful in equal measure"
        },
        {
            "text": "A typical day in my role involves engaging with teams or professional leads across DDTS to build their Career Pathway sites."
        },
        {
            "text": "The best thing about the programme for me, so far, is the opportunity I’ve had to get involved in really meaningful work. Contributing to the development and delivery of these careers sites, and seeing our vision come to fruition has been so rewarding and I can already feel my confidence as a leader growing throughout this posting."
        },
        {
            "text": "One of the most challenging parts of the role has been adjusting to having so much autonomy to manage my own time and workload, but I’ve been fortunate to have the support of a wonderful team."
        },
        {
            "heading": 2,
            "text": "My advice to anyone thinking of applying for the Fast Stream"
        },
        {
            "text": "This is probably the same advice every Fast Streamer will give you, but clichés are clichés for a reason; go ahead and apply! It's a fantastic programme and you get the opportunity to work with so many amazing, talented, supportive people, there's really nothing to lose. If you don't get in first time, don’t be put off, learn from your feedback, and try again."
        }
    ]
}