{
    "url": "https://supportingfamilies.blog.gov.uk/2024/02/29/supporting-families-maximising-the-capacity-and-connectivity-of-the-voluntary-and-community-sector/",
    "title": "Supporting Families: Maximising the capacity and connectivity of the voluntary and community sector",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Evaluation",
        "Multidisciplinary Teams",
        "News",
        "Transformation"
    ],
    "pub_date": "2024-02-29T07:34:34+00:00",
    "content": [
        {
            "text": "Good practice project led by Durham County Council "
        },
        {
            "text": "Introduction "
        },
        {
            "text": "Durham County Council led a project on behalf of the national team to gather good practice around improving connectivity with the voluntary and community sector.  They worked with 19 Local authorities to gather good practice around working with the Voluntary and Community sector (VCS) within early help."
        },
        {
            "text": "Early help System Guide "
        },
        {
            "text": "The Supporting Families: Early Help System guide - GOV.UK (www.gov.uk) outlines a national vision and descriptors for a mature early help system that is shared by Department for Levelling Up, Housing and Communities and Department for Education. It has been widely consulted upon across other government departments and local areas and is based on what is working around the country."
        },
        {
            "text": "The guide is intended for the local strategic partnership responsible for the early help system. It aims to provide a framework for local workshops, partnership conversations and strategic planning and to support prioritisation. The guide provides a self-assessment tool to support discussion, reflection and action planning against key areas that have been shown to influence the effectiveness of early help. "
        },
        {
            "text": "Early Help is the total support that improves a family’s resilience and outcomes or reduces the chance of a problem getting worse. The self-assessment section is structured as five sections focusing on Family voice and experience, Workforce, Communities, Leaders and Data. This project focussed on the Communities section, identifying good practice which exemplify the descriptors."
        },
        {
            "text": "Sharing success via Supporting Families webinars "
        },
        {
            "text": "The project recognised the significant impact that the VCS can make as part of the early help system and the fundamental positive changes in the relationships between statutory services and VCS partners in recent years. Five areas agreed to share their success via webinars on how they work closely with the VCS using a variety of methods. Both webinars were positively received with over 80 attendees at each session."
        },
        {
            "text": "Webinar Part One"
        },
        {
            "text": "EHSG descriptor 7.1. Public services partner closely with voluntary and community groups to maintain up to date information about local community assets, community groups, voluntary sector support and faith groups and have made this information accessible to local staff and residents e.g. through a website. "
        },
        {
            "text": "Wirral council and Sheffield City Council provided insight into their online platforms utilised to share information, resources and guidance that are accessible for both professionals and families and importantly ensure the support and resources available for families within the VCS are included and easily accessed."
        },
        {
            "text": " 7.4. We are improving the connectivity between voluntary and community sector activity, family networks and formal early help activity."
        },
        {
            "text": "Thurrock Council and Durham County Council shared their experiences of how practical on the ground resource has improved connectivity with VCS partners and the evidence gathered to demonstrate the difference this has made to families."
        },
        {
            "text": "Webinar Part Two"
        },
        {
            "text": "7.2. Our relationship with community groups and voluntary organisations embodies a culture of valuing the contribution of all, prizes creativity, collaboration, and local solutions, alongside quality and inclusivity. We are building a culture and system where our communities understand that everyone helps to deliver a whole family approach."
        },
        {
            "text": "Isle of Wight council shared how Community Capacity grants are community led and community focussed for the whole family."
        },
        {
            "text": "7.5 We are shifting decision making about local services and facilities towards families and communities. "
        },
        {
            "text": "Bath and North East Somerset council shared a collaborative approach to commissioning and how they involve service users and the community in the commissioning process"
        },
        {
            "text": "VLOG’s"
        },
        {
            "text": "7.4. We are improving the connectivity between voluntary and community sector activity, family networks and formal early help activity"
        },
        {
            "text": "Wirral council showcased their Family Toolbox Alliance that consists of seven VCS organisations who work as one, sharing decisions and responsibility for planning and delivering family support across Wirral.  https://youtu.be/SMTLt2oX8yc"
        },
        {
            "text": "Durham County Council presented their VCS Alliance model and gained insight from a range of practitioners that work together with VCS to support families and shared examples of the difference that this makes. https://www.youtube.com/watch?v=eEYz_u-dEiU"
        },
        {
            "text": "Further Examples of Good Practice  "
        },
        {
            "text": "All the areas that engaged with the project shared further examples of how they have embedded early help within the sector."
        },
        {
            "text": "Key Findings following the project. "
        },
        {
            "text": "If you would like more information, then please email the families.team@levellingup.gov.uk"
        }
    ]
}