{
    "url": "https://nda.blog.gov.uk/the-strategy-series-disposing-of-waste-safely-permanently-and-sooner/",
    "title": "The Strategy Series: Disposing of waste safely, permanently and sooner",
    "authors": [
        "Martin Walkingshaw"
    ],
    "categories": [
        "Waste management"
    ],
    "pub_date": "2024-02-29T16:02:49+00:00",
    "content": [
        {
            "text": "We’ve reached the last instalment of our Strategy Series! Over the course of the last few months, we’ve dissected our corporate strategy with some of our best experts, and as we step into 2024, we’ve got some exciting plans."
        },
        {
            "text": "Our Corporate Strategy will help us to move forward in new, innovative ways with a refreshed focus on value and safety. With a newly integrated approach, we are in an even better position to make radioactive waste permanently safe, sooner."
        },
        {
            "text": "To finish off, we’re speaking to Martin Walkingshaw, Chief Operating Officer, about the final stage of the waste management lifecycle – disposal!"
        },
        {
            "text": "Why do we have radioactive waste to dispose of? "
        },
        {
            "text": "We have a fascinating nuclear history in the UK; Nuclear physicists John Cockroft and Ernest Newton (working under Ernest Rutherford) split the atom in 1932 at Cambridge University’s Cavendish Laboratory, and kickstarted the UK’s journey to pioneer the use of radioactive materials and develop a whole new industry for the ‘nuclear age’."
        },
        {
            "text": "Ever since then we’ve employed our nuclear technology for a range of purposes; In 1956 Calder Hall began operating as a full-scale nuclear power station and the UK has possessed an independent nuclear deterrent for over 60 years. It’s worth reflecting that every Government elected since WW2 has maintained the nuclear elements of our energy and defence policies and supported the development of nuclear medicine, as well as the use of radioactive materials in a wide range of industries."
        },
        {
            "text": "I’d suggest that as a society, we’ve really benefited from nuclear advances. But that history, and our continued use of radioactive materials, means we have a growing legacy of waste which we now must make permanently safe. That’s where my role comes in – to close the loop and make sure people are protected now and long into the future."
        },
        {
            "text": "How does radioactive waste disposal work?"
        },
        {
            "text": "The UK Radioactive Waste Inventory identifies 4,560,000 m3 of radioactive waste. And all of it requires careful management."
        },
        {
            "text": "But first, we need to understand what we are dealing with. For example, what type of radioactivity is the waste generating and how intense is that radiation? We gain this knowledge from understanding the elements (or ‘radionuclides’) that are present in the waste and their proportion. From this information we can determine how long the waste will stay harmfully radioactive, (remember- radioactivity gradually decays over time) but we also need to understand the other physical and chemical properties of each waste form – e.g. liquid/sludge or solid – and what treatment processes have been used. The non-radioactive (but still hazardous) properties of the waste need to be considered too. Once we understand (or ‘characterise’) the waste fully, we can treat it, appropriately, package it and transport it to be recycled, reused or disposed."
        },
        {
            "text": "Once characterised and confirmed suitable for disposal, that’s when the waste comes to me! We bring all those factors together to understand the full inventory and find the most suitable disposal route. There are a range of solutions available including our Low Level Waste Repository site and our future Geological Disposal Facility (GDF)."
        },
        {
            "text": "How do we manage our capacity for waste?"
        },
        {
            "text": "The Repository site has been the national disposal facility since 1959, ensuring that the UK’s low level waste is safely and permanently disposed of in a way that protects people and the environment. In other words, we know what we’re doing, and we’ve been doing it for a very long time."
        },
        {
            "text": "That includes planning for the future. We’re always looking at treatment or other alternatives to disposal for waste that doesn’t need the protection of an engineered facility like ours. We’ve also started work on installation of the final closure engineering (capping) of historical disposal areas, and we’re planning the construction of future vaults to accommodate the waste that will arise over the next century."
        },
        {
            "text": "Our future GDF deals with higher activity waste, and we are currently engaging with potential host communities to establish where it should be built. A key consideration for the GDF’s design is that it must have the capacity to deal with the ‘inventory for disposal’ that has been identified. Although the higher activity waste category is much smaller in volume than the waste we deal with at the Repository, it requires the additional protection provided by deep disposal in a suitable geology, and a portion of the waste is heat generating so we need to take that into account."
        },
        {
            "text": "Managing radioactive waste safely is an effort that continues over multiple generations; We are the current custodians of these facilities, with a moral obligation to leave our sites better than we found them so our successors can take what we have done and improve it again. That way, we can create a chain of continuous improvement on our journey to dispose of our radioactive waste in the safest way possible."
        },
        {
            "text": "What does 'capping' at the Repository site involve?"
        },
        {
            "text": "We’ve currently got close to a million cubic metres of low level waste permanently disposed of at the site. Whilst it is already safe, putting an engineered ‘cap’ over the top of it is an essential component of our Environmental Safety Case, it enables us to demonstrate that we meet all the requirements placed on us by our regulators, and that the site will be safe long after we’re gone. The cap will be made of multiple layers of strong impermeable materials to form the final barrier to protect the waste, while its radioactive content gradually reduces through the process of radioactive decay. The land above the cap will look like a natural feature in the landscape."
        },
        {
            "text": "What is a Geological Disposal Facility? "
        },
        {
            "text": "The concept of using multiple layers or barriers also forms key part of the science behind geological disposal. A GDF is made up of a series of highly engineered vaults and tunnels between 200 and 1,000 metres below ground in a suitable rock formation. Combined with engineered barriers, this multi-barrier approach will protect the environment by keeping the waste isolated from the surface while the radioactivity naturally reduces to safe levels."
        },
        {
            "text": "It’s a complex programme that will certainly take time to find the right location, build the facility and get it running. The findings from our site evaluation work will inform our decisions, for approval by UK Government, about the site or sites to be taken forward into the phase known as ‘site characterisation’. This involves understanding the properties of the geology with detailed investigations such as the drilling of deep boreholes. We also have to consider logistics and transport, and potential local and environmental impacts. This isn’t something we can rush.  Our next major milestone for the programme is to start deep sub-surface borehole investigations. You can learn more about GDFs here."
        },
        {
            "text": "How do you make sure disposal is safe?"
        },
        {
            "text": "We also have a responsibility to demonstrate our disposal facilities are safe, not just to the public and the Government who fund the work but to the independent safety, security and environmental regulators, who we work with closely.  The research we do internationally and in the UK is vital to support the evidence backed safety cases for all the disciplines of work across NWS."
        },
        {
            "text": "At our Repository site we conduct extensive environmental surveys on, around and underneath the site, sampling the groundwater, soil, plants, vegetation and local produce. We also monitor radiation exposure to our workforce and take long term dose readings at the site boundary."
        },
        {
            "text": "For the GDF and the Repository, the regulators need to be sure our proposals are safe in order for us to hold the licences and permits we need to build and operate them. We also need to create and maintain the Environmental, Nuclear and Operational Safety Cases that set out our models, all the pathways of possible exposure and the environmental impact of all our projects."
        },
        {
            "text": "Once closed, our disposal facilities are designed to contain and isolate radioactivity underground by combining the use of engineered and natural geological barriers to prevent radioactivity from reaching the surface. This is known as passive safety and removes the need for human intervention while the radioactivity decays, keeping future generations safe."
        },
        {
            "text": "That’s the end of our Strategy Series! To learn more, check out some of the other blogs in the series or read our full corporate strategy."
        }
    ]
}