{
    "url": "https://userresearch.blog.gov.uk/2024/02/29/what-i-learned-as-a-user-research-course-facilitator-and-what-you-can-gain-from-it-too/",
    "title": "What I learned as a user research course facilitator and what you can gain from it too",
    "authors": [
        "Venyah Kowalik, User researcher, Parliamentary Digital Service"
    ],
    "categories": [
        "Training",
        "Uncategorised",
        "User research"
    ],
    "pub_date": "2024-02-29T12:20:33+00:00",
    "content": [
        {
            "text": "Last year in July, I joined the cross-government user research training community to facilitate an ‘Introduction to User Research in Government’ online course. The course aims to educate researchers and practitioners from non-user research backgrounds to apply good research practice in a government context. It also offers avenues to network and connect with other professionals."
        },
        {
            "text": "The training is offered by a community of researchers who are passionate about improving access to education and upskilling for user-centred design professionals. Over the years, it has evolved to accommodate the changing needs of user groups as well as the effects of the Covid-19 pandemic. Currently, it’s delivered every few months remotely and is available to all professionals across government. Here are some things I have gained from being a facilitator, and some ideas about what you could learn from it too."
        },
        {
            "heading": 2,
            "text": "Networking"
        },
        {
            "text": "Running training is not a solo sport and collaboration is at the heart of it from the moment you sign up. When I expressed my interest in facilitation, I was matched with another user researcher to co-facilitate the course with me."
        },
        {
            "text": "We collaborated on all the subsequent activities from arranging training invitations to agreeing on what modules each of us would run. I also joined the user research training community on Slack and got to know a group of researchers who all share the same passion in enabling wider central and local government community to understand and apply good user research practice in their work."
        },
        {
            "heading": 2,
            "text": "Facilitation skills"
        },
        {
            "text": "Ahead of the course, I had a chance to asynchronously complete a facilitation course that explained good practice and had helpful tips to make sure the course ran smoothly."
        },
        {
            "text": "The facilitation course covered logistics around effectively setting-up the course in a remote setting, as well as tips about active listening and fostering a safe, open discussion forum."
        },
        {
            "heading": 2,
            "text": "Understanding the wider government context"
        },
        {
            "text": "Getting involved gave me insight into the cross-government community, something I wanted to explore as a user researcher in the Parliamentary Digital Service. Before joining as a facilitator, I hardly knew anyone in the cross-government community and my understanding on its structure was quite hazy. Through running the course, I had the chance to speak to professionals from across the organisation who helped me piece the puzzle together and better understand how the government community is built. The trainees also offered insightful comments on their day-to-day and unique user research considerations, like informed consent or safeguarding."
        },
        {
            "heading": 2,
            "text": "Learning"
        },
        {
            "text": "Being a facilitator doesn’t mean knowing everything! The structure of the course allows plenty of time for open and interactive discussions where trainees have a chance to share their experiences employing different research methods or overcoming challenges. As a result, at the end of the course, we gathered a comprehensive list of tips and resources as supplementary learning for everyone."
        },
        {
            "heading": 2,
            "text": "Training and development"
        },
        {
            "text": "As a facilitator I learned how to best frame training for the specific audience. The course was a chance to champion good user research practice, particularly in low maturity teams. A big consideration was to be as useful as possible to practitioners who may be from non-user research backgrounds too."
        },
        {
            "text": "The open discussion and feedback was particularly useful in understanding what attendees got from the training. I’ve brought this thinking back into the Parliament Digital Service as part of my role, to provide training and development opportunities for other teams."
        },
        {
            "heading": 2,
            "text": "Getting involved"
        },
        {
            "text": "As we continue improving the training we deliver and growing our team, we’d love to hear from you if you’re interested in joining future courses as a facilitator and help shape the work that we do."
        },
        {
            "text": "And if you’re interested in joining the course as an attendee, register your interest for the next session here."
        }
    ]
}