{
    "url": "https://publicpolicydesign.blog.gov.uk/2024/02/29/you-the-aspiring-innovator/",
    "title": "You: the aspiring innovator",
    "authors": [
        "Malcolm Beattie"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2024-02-29T13:00:45+00:00",
    "content": [
        {
            "text": "Perhaps you have been assigned a key role in a transformation programme; or to develop a new policy; or you might be a budding Public Entrepreneur keen to innovate."
        },
        {
            "text": "This is the second of four blog posts describing my experiences in establishing and running the Innovation Lab (iLab) in the Department of Finance in Northern Ireland.  In this post I discuss your role in the Enabling Ecosystem as one who aspires to public entrepreneurship and I suggest some of the qualities needed for success."
        },
        {
            "heading": 2,
            "text": "You are the single most important part "
        },
        {
            "text": "The first stop on this analysis is to look at yourself as the one who sees the need for innovation, has the motivation and ambition to innovate and who needs to operate successfully in the system."
        },
        {
            "text": "First, some basic questions;"
        },
        {
            "text": "I have suggested that it is in the DNA of many public servants to be Public Entrepreneurs. On the other hand, many see their role as maintaining the status quo, as system stewards, which is a legitimate role and major part of what government does – keeping the lights on, so to speak, meeting targets, running business as usual. Self- awareness is vital here, but chances are that if you are reading this article then you have the ambition to be a Public Entrepreneur!"
        },
        {
            "text": "But, is it as simple as just having that ambition? Of course it isn’t. Here are some more things that you might consider in this context."
        },
        {
            "text": "First, do you have the mandate, status, authority and budget to drive innovation in your area? And if you don’t, do you know how to build these foundational enablers?"
        },
        {
            "text": "Other considerations are:"
        },
        {
            "text": "In the iLab we have learned that passion is a major component of just keeping good ideas alive, and that protecting innovation from the inclination of the system with a low appetite for change to stifle change requires a lot of determination. In From Design Thinking to System Change, Rowan Conway puts language to this phenomenon, referring to it as the “immune response” of the system to innovation. Our bodies are programmed to kill off rogue cells, viruses and diseases, so too are large bureaucracies. Legitimately, these are systems geared specifically to ensure compliance and to protect the interests of Accounting Officers, to prevent, detect and destroy what is illegal or fraudulent or at variance from agreed procedures. But the prevailing culture, coupled with these systems, will also act to prevent innovation."
        },
        {
            "text": "Innovators need to work ‘against’ this tide. Being alert for this will help you understand that what is happening is neither new, nor personal - it is just how large bureaucratic entities react to change. Forewarned is forearmed!"
        },
        {
            "heading": 2,
            "text": "Vision and Ambition"
        },
        {
            "text": "Will you be easily satisfied with the tactical, short term, or do you aspire to make strategic, and even system level change? Do you realise that achieving a system level or step change – one that will become deeply embedded and permeate the whole system - is a long game? There really are no quick fixes. Complex problems will take time to work through – some of the most pressing issues that need to be addressed in our public services have existed for years, and despite the best intentions of many who have preceded us, and the investment of public money, these remain entrenched, even intractable and apparently unsolvable."
        },
        {
            "heading": 2,
            "text": "‘Not Invented Here’ syndrome"
        },
        {
            "text": "Equally important, are you prepared to look for solutions elsewhere and to be prepared to adopt them, or do you suffer from NIH (Not Invented Here) syndrome? We waste a lot of time and resources by not looking for an already existing solution that can be easily adapted to meet local need. And we have all heard the common reasons for not doing so: our system is different, our population has slightly different characteristics etc. But successful Public Entrepreneurs will just as readily, and successfully, go with an existing, proven solution, rather than waste time and resource on building new. It is a most credit-worthy thing to do, and we need more of it! In this regard are you prepared to invest the time in researching what is ‘out there’, embarking on a literature review, visits to other jurisdictions, forming alliances, to find the already existing and proven solution to your problem?"
        },
        {
            "text": "It is also worth asking if you are able to let go when something isn’t working. Are you prepared to experiment, test, iterate, modify and generally take calculated risks to ensure the innovation is shaped and altered in the light of learning from experimentation? And are you really going to cut loose things that aren’t working, and hold out for the next iteration? And are you prepared to terminate decrepit, creaking systems and process that are in the way of your innovation."
        },
        {
            "heading": 2,
            "text": "Kindred Spirits"
        },
        {
            "text": "And finally, are you a lone voice in your ecosystem, or are there kindred spirits with whom you can collaborate for mutual encouragement and support? Is there a support network of people with whom you can exchange ideas and gain help? The ecosystem can be a lonely place and mutual encouragement is important."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "In my next blog post, I will look at the social and political parts of the Enabling Ecosystem."
        }
    ]
}