{
    "url": "https://cddo.blog.gov.uk/2022/11/21/cddos-autumn-of-digital-learning/",
    "title": "CDDO’s Autumn of Digital Learning",
    "authors": [
        "Barbra Webber, Head of Digital learning and frameworks, CDDO"
    ],
    "categories": [
        "CDDO",
        "DDaT",
        "DDaT community",
        "DDaT events",
        "Digital learning and development",
        "Digital transformation"
    ],
    "pub_date": "2022-11-21T11:15:34+00:00",
    "content": [
        {
            "text": "Credit: Jason Goodman [unsplash]The season may change, but our commitment to learning doesn’t, and we’re delighted to share that the Autumn of Digital Learning will continue into the festive period. "
        },
        {
            "text": "This blog follows my previous blog on events to support digital transformation across government."
        },
        {
            "text": "As we turn our heads towards the festive period we have the following opportunities lined up: "
        },
        {
            "text": "The Innovation Masterclass is back "
        },
        {
            "text": "Due to the popularity of the Innovation Masterclass earlier this year, we’re delighted that the third cross-government cohort of this online course commences on the 5 December 2022. "
        },
        {
            "text": "The programme, featuring videos and case studies from the world’s leading innovators, breaks down the art of innovation into small steps that you can directly apply to your future projects. You will also learn how to evaluate ideas and pitch solutions. Suggested engagement is just 3-4 hours a week over 3-4 weeks, but you can take longer if you wish. Applications are open to Senior Civil Servants of all professions, and those who are aspiring to become one in the near future."
        },
        {
            "text": "Here is feedback from one of the participants:"
        },
        {
            "text": "Lunchtime webinar: The Art of the Possible in Data Science "
        },
        {
            "text": "15 December 2022  1300-1430"
        },
        {
            "text": "Join us for this data science introductory session from the ONS Data Science Campus where you will be able to find out how you can apply data science techniques in your organisation to add value. You will benefit from a brief overview of data science and see the \"Art of the Possible'' within the pragmatics and ethics of using data. You will also gain awareness of the different tools and techniques utilised to draw insights from data and practical examples of using these from across government. "
        },
        {
            "text": "And there’s more!"
        },
        {
            "text": "We have also put together a list of other courses we feel may be of interest to you and anyone who would like to know more about digital, data and technology and innovation: "
        },
        {
            "text": "Reforming and modernising public services to better serve the British public is a key government priority, ensuring we can meet both expectations and needs in the digital age.  We hope these learning events empower this transformation. "
        }
    ]
}