{
    "url": "https://ipo.blog.gov.uk/2022/11/21/dont-blow-christmas-avoid-a-mistake-spot-the-fake/",
    "title": "Don't blow Christmas: avoid a mistake, spot the fake",
    "authors": [
        "Kelsey Jones"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Enforcement",
        "Trade marks"
    ],
    "pub_date": "2022-11-21T16:18:50+00:00",
    "content": [
        {
            "text": "Kelsey Jones, Senior Outreach and Engagement Advisor of the IPO's Enforcement team outlines the advice we're giving to consumers to help them stay safe from counterfeit electrical goods this festive period."
        },
        {
            "text": " "
        },
        {
            "text": "With prices dropping across retail and Christmas around the corner, Black Friday and Cyber Monday can be irresistible. Because who doesn’t want to make their Christmas savings to go even further?"
        },
        {
            "heading": 2,
            "text": "But did you know that you could be targeted by online traders selling counterfeit goods?"
        },
        {
            "text": "Fake electrical products, also known as counterfeits, are everywhere, targeting you on e-commerce sites you know and trust or appearing as you scroll through your go-to social media channels​. Think fake AirBuds, straighteners, hairdryers, phone chargers."
        },
        {
            "text": "Dodgy sellers will be trying to fool even more people into buying fakes this year, knowing that lots of us are looking for a bargain. They may look like the real deal, but counterfeits are often poor-quality imitations that aren’t guaranteed to work and can be dangerous. You might save a few pounds, but at what cost?​"
        },
        {
            "text": "Use these tips to stay smart, stay savvy and stay safe​."
        },
        {
            "text": "Don’t buy fakes​. Don’t blow Christmas."
        },
        {
            "heading": 2,
            "text": "Tips to avoid being duped into purchasing counterfeit products"
        },
        {
            "heading": 3,
            "text": "1) Vet the seller"
        },
        {
            "text": "Do they look official? Have you bought from this seller before, is the website or platform well known? Does the seller have a returns policy? If you are in doubt, look for a genuine online review, not just recommendations from influencers to buy the item."
        },
        {
            "heading": 3,
            "text": "2) Avoid payments by bank transfer"
        },
        {
            "text": "Always beware of retailers asking for payment to be made via bank transfer. Well known credit card providers like Visa or Mastercard, and services like PayPal offer protection to buyers if the goods don’t arrive or are proven to be counterfeit."
        },
        {
            "heading": 3,
            "text": "3) Trust your instincts"
        },
        {
            "text": "Does the item on offer look and feel like an authentic product? Sellers of counterfeits often make spelling mistakes in their descriptions and sometimes on the products themselves, which is an obvious warning sign. Spelling and grammar mistakes can indicate fakes!"
        },
        {
            "heading": 3,
            "text": "4) Look for EU and UK safety markings"
        },
        {
            "text": "The safety standards of counterfeit items are poor and can be dangerous, especially when they are shipped from abroad. Do items have EU and UK safety markings? You should always check for the correct age restrictions and hazard warnings on the packaging."
        },
        {
            "heading": 3,
            "text": "5) Question the price if much cheaper than elsewhere"
        },
        {
            "text": "Whether buying online or in person, always think about the price. Scammers often sell counterfeit goods at discounted prices to make you drop your guard. If the item is significantly cheaper than you’d expect, that’s a good reason for alarm bells to ring. If the price looks too good to be true, it probably is."
        },
        {
            "text": "Follow @dontblowchristmas on your socials for more advice and guidance on staying safe and avoiding disappointment this Christmas."
        }
    ]
}