{
    "url": "https://ukhsa.blog.gov.uk/2022/11/21/espaur-report-2022/",
    "title": "ESPAUR report 2022 - the latest findings on Antimicrobial Resistance",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance"
    ],
    "pub_date": "2022-11-21T14:51:56+01:00",
    "content": [
        {
            "text": "Antimicrobial drugs are commonly used. We have all heard of antibiotics, which fight bacteria, but there are also antifungals, antivirals and antiparasitics that fight fungi, viruses and parasites, respectively."
        },
        {
            "text": "The more we use these drugs, the less effective they become and this problem is known as antimicrobial resistance (AMR). It means that microbes have developed resistance to our commonly used medications, meaning these medicines do not always work to treat infections."
        },
        {
            "text": "The national annual report ESPAUR (English Surveillance Programme for Antimicrobial Utilisation and Resistance) outlines the scale of the problem and this blog reflects its latest findings, as well as the actions we can all take to mitigate the effects of AMR."
        },
        {
            "heading": 2,
            "text": "What’s the problem?"
        },
        {
            "text": "The more we use antimicrobial medicines, the less effective they become against their target organisms, and the less they work at making us better when we need them."
        },
        {
            "text": "Inappropriate or excessive use of antimicrobials – including antibiotics such as penicillin – allows the target bacteria to develop antimicrobial resistance (AMR). Examples of inappropriate use include taking antibiotics for colds, sore throats, coughs and so on that are viral in origin, so cannot be treated by antibiotics."
        },
        {
            "text": "Drug resistant microbes are difficult to treat, and they may be impossible to treat in vulnerable people or people with weak immune systems. Tackling AMR is important for us all, but particularly those who are at higher risk of infection or of getting seriously unwell."
        },
        {
            "text": "In the absence of effective antibiotics, cancer treatments and common surgeries like caesareans would become very high-risk procedures and for many people, could lead to infections that cannot be treated and may become fatal."
        },
        {
            "text": "A global review of AMR and its future impact estimated that there would be 10 million global AMR deaths annually from the year 2050 if we do nothing to preserve our current effective antibiotics or do not develop new ones."
        },
        {
            "text": "AMR also causes problems in settings like hospitals because in some cases, inpatients contract infections known as ‘healthcare associated infections’ which pose a serious risk to patients, staff and visitors to health and social care sites."
        },
        {
            "text": "You may have heard the term ‘superbug’ to describe drug resistant microbes such as Methicillin-resistant Staphylococcus aureus, better known as MRSA. MRSA is a common healthcare associated infection that has developed naturally to resist antibiotics, making infections harder to treat and increasing the risk of disease spread, severe illness and death."
        },
        {
            "text": "In some countries, problems of sanitation and a lack of clean drinking water can mean infections spread more easily and, in turn, this means drug resistant microbes spread more easily. As COVID-19 has demonstrated, infections do not respect borders. This is a problem that impacts everyone."
        },
        {
            "text": "The cost of AMR to the economy is significant. Those suffering prolonged illness due to AMR infections are more likely to stay in hospital. The longer the stay in hospital may mean the greater the need for expensive medicines, and the greater the financial impact on the person who is sick."
        },
        {
            "heading": 2,
            "text": "ESPAUR report: AMR in England"
        },
        {
            "text": "ESPAUR is a programme developed by UKHSA to improve the surveillance of antibiotic resistance. It provides data on antibiotic use and supports interventions and toolkits to improve antibiotic prescribing in the community (including prescribing in general practices (GPs), dental and other settings) and hospitals."
        },
        {
            "text": "The latest report showed that the estimated total number of severe antibiotic resistant infections in England rose by 2.2% in 2021, compared to 2020. This is equivalent to 148 severe antibiotic resistant infections a day in 2021, although antibiotic resistant infections are at lower levels than before the pandemic. In the years before the pandemic started, we were seeing year-on-year higher increases. This is due to a number of factors including changes in how NHS services were delivered and how much people contacted the NHS, as well as social behaviour (reduced social mixing and enhanced hand hygiene) during the pandemic."
        },
        {
            "text": "This year’s report also highlights variations in antibiotic-resistant infections across the country and differences between different demographic groups. Those from the most deprived 10% of the country were more likely to have particularly serious forms of antibiotic resistant bugs, known as carbapenemase-producing Gram-negative bacteria, compared to those from the least deprived 10% of the country (6.8 compared to 2.8 per 100,000 population). Understanding the impact of ethnicity, deprivation, regional divergence, along with potential confounders, remains an important area of investigation."
        },
        {
            "text": "Antibiotic use fell by 15.1% between 2017 to 2021 meaning that England has exceeded the Government’s National Action Plan goal to reduce prescribing by 15% by 2024 from a 2014 baseline. However, unless we continue to use antibiotics appropriately and continue to drive down infections overall, the trend may not be sustained."
        },
        {
            "heading": 2,
            "text": "Spreading awareness, Stopping resistance"
        },
        {
            "text": "We can all spread awareness. The Antibiotic Guardian website encourages everyone to choose a pledge on how they can personally help contribute to tackling AMR. More than 145,000 people have already signed up as Antibiotic Guardians."
        },
        {
            "text": "Becoming an Antibiotic Guardian and encouraging others to do the same can help the public and healthcare professionals to think about how they can make better use of antibiotics."
        },
        {
            "text": "The pledges go beyond simply raising awareness of AMR and help people to take at least one concrete personal action that can lead to much wider changes in behaviour."
        },
        {
            "text": "Stopping resistance starts with reducing inappropriate prescribing. Antimicrobial medicines should only be taken when a doctor has made a prescription."
        },
        {
            "text": "Everyone should avoid asking their doctor, nurse, dentist or pharmacist to prescribe antibiotics. And when a health professional prescribes antibiotics, it is important that you always take them as directed, never save them for later and never share them with others."
        },
        {
            "text": "Healthcare professionals in general practice can also contribute by involving patients in shared decisions about treatments of illnesses, such as delaying prescriptions or offering back-up prescriptions if symptoms do not improve."
        },
        {
            "text": "To find out more about some of the simple actions that the public and professionals can take to reduce the impact of AMR, visit the Antibiotic Guardian website or check out our AMR toolkit blog."
        }
    ]
}