{
    "url": "https://marinescience.blog.gov.uk/2022/11/21/fish-observers-the-life-and-sole-of-collaborative-fisheries-science/",
    "title": "Fish Observers: The life and 'sole' of collaborative fisheries science",
    "authors": [
        "James Lamb",
        "Sam Birch"
    ],
    "categories": [
        "Fisheries",
        "Science"
    ],
    "pub_date": "2022-11-21T10:00:58+00:00",
    "content": [
        {
            "heading": 2,
            "text": "It's World Fisheries Day!"
        },
        {
            "text": "As world leaders in marine and aquatic science with 120 years of fisheries expertise, Cefas will be highlighting the importance of healthy ocean ecosystems and sustainable fisheries stocks across our social media channels. To celebrate, we asked James Lamb and Sam Birch from our Applied Fisheries Science & Technology team to tell us what life is like as a fisheries observer on board the Carhelmar BM23, where they conduct the Western Channel sole and plaice survey; one of the longest running surveys of its kind."
        },
        {
            "heading": 4,
            "text": "Can you tell us more about the Western Channel sole and plaice survey? "
        },
        {
            "text": "The Western Channel sole and plaice survey is a time-series beam trawl survey that was started in 2003 as part of the Defra-funded Fisheries Science Partnership (FSP) programme. The FSP was established to build relationships between fishermen and scientists and to get fishermen more actively involved in the science. The survey has been running every year since 2003 and provides valuable data for stock assessments."
        },
        {
            "text": "Our role as observers is to collect real time survey data on catch rates, age, and length of commercially important, and valuable, Western Channel sole and plaice stocks from commercial trawls. We also collect data for other valuable commercial species such as cod, lemon sole, megrim, monkfish and cuttlefish, alongside important data for over 50 species of fish and shellfish that make up the retained and discarded portions of the catch."
        },
        {
            "text": "The survey is split into two parts, Eastern and Western (each with a trip of around 6 days at sea), and covers an area from Lyme Bay to Scilly Isles between August and October each year. Within this area, 90 locations are sampled and these ‘prime stations’ are repeated every year. A few different vessels have been chartered for this survey over the years, but since 2009 the FV Carhelmar has been chartered for both the Eastern and Western survey annually."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Why is it so important to collect this data?"
        },
        {
            "text": "This data is important for the UK fishing industry as it helps to monitor fish stocks and contributes to advice on fishing opportunities. The survey datasets are incorporated into assessments by large scientific bodies, such as International Council for the Exploration of the Sea (ICES), who provide evidence and advice on the conservation and management of fish species. As the survey methodology has been relatively consistent across the time-series, the data has been used as part of the ICES stock assessment for Western Channel plaice since 2007. Next years’ FSP Western Channel Sole and Plaice survey will add the twentieth year to the time series, helping Cefas to continue its mission to embed marine and freshwater science at the heart of policy making."
        },
        {
            "text": "It's great to see our data in action, as previously discussed by Interfish Ltd"
        },
        {
            "text": "“The time series is of significant importance to the sector and represents a long and trusted partnership of CEFAS working alongside commercial Fishermen to produce trusted and comprehensive data set relevant to the mixed demersal fisheries in the Southwest.”"
        },
        {
            "heading": 4,
            "text": "How did you get involved in this survey?"
        },
        {
            "text": "James Lamb: When I started at Cefas and heard the name “Carhelmar” mentioned, it was always said with great pride by the people who have taken part in the survey. There is a real legacy behind it, and it became somewhat of a bucket list survey for me as an observer.  When I was asked if I wanted to get involved, I was excited to join a long line of Cefas scientists, past and present, to staff the survey."
        },
        {
            "text": "My first introduction to the survey was working on data from previous years, so being able to carry out the survey in person and contribute to such a long-standing survey was excellent. I can’t wait to do it again next year."
        },
        {
            "heading": 4,
            "text": "What happens during the survey?"
        },
        {
            "text": "James Lamb: The survey design restricts sampling to daylight, and with 90 stations to complete, it can present a sizeable challenge. Life aboard the Carhelmar during the survey is busy, the trawls are towed for an hour at each prime station, and you need to sample the full catch – which is a lot of fish as a single catch can range from 50kg to several hundred kilograms, depending on what is being caught."
        },
        {
            "text": "Sam Birch: Catches are small compared to commercial tows, but full catch sampling with the low raising factors required for the survey makes it challenging to measure everything within the time available. Length measurements are taken from each species of fish (and commercial crustaceans) caught. Otoliths (calcium carbonate structures found inside the heads of bony fish) are extracted from sole and plaice for age analysis at the Cefas laboratory back in Lowestoft. Prime stations can be very close together, so you might only have an hour between hauls to collect and record all the required data before you start again. But the skipper and crew work closely with the scientists to ensure that each fishing location is sampled precisely and effectively."
        },
        {
            "heading": 4,
            "text": "What is the best part of being involved in this survey?"
        },
        {
            "text": "Sam Birch: I have been to sea on seven of these trips and have found them to be a shining example of collaborative research. Scientists and industry work closely together to achieve the survey aims, year after year, which is a real partnership requiring dedication and enthusiasm from all involved. It’s fascinating to see how species diversity changes across the survey area, and how catches change year-to-year. Knowing that this survey contributes directly to the stock assessments and influences fishing opportunities makes you feel part of something worthwhile and valuable."
        },
        {
            "text": "James Lamb: It’s a real collaborative effort with the crew. The daily life on board was great, the crew were friendly and welcoming, and we were certainly well fed. Each trawl is slightly different, and it’s interesting to see how the catch changes as we move across the survey area. Species are caught more in certain areas than others. The sampling is quite different to how we sample on a commercial trip, so it's great to do something different from the usual work."
        },
        {
            "heading": 4,
            "text": "What would you say to anyone interested in this survey and the data?"
        },
        {
            "text": "Contact us! We feel that the data collected over the last 20 years has masses of unrealised potential and would be of interest to a wide range of people. With time series data for over 50 different species, there is a wealth of information available. So anyone who feels that the data can be useful, please let us know!"
        },
        {
            "text": "James Lamb is a Fisheries Observer in the Applied Fisheries Science & Technology North team: james.lamb@cefas.gov.uk"
        },
        {
            "text": "Sam Birch is a Senior Fisheries Observer in the Applied Fisheries Science & Technology South team: samantha.birch@cefas.gov.uk"
        }
    ]
}