{
    "url": "https://forestrycommission.blog.gov.uk/2022/11/21/how-were-working-to-improve-the-england-woodland-creation-offer-application-process/",
    "title": "How we're working to improve the England Woodland Creation Offer application process",
    "authors": [
        "Alec Rhodes"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-11-21T10:40:05+00:00",
    "content": [
        {
            "text": "The England Woodland Creation Offer (EWCO) was launched in June 2021 to offer financial incentives to help land managers and farmers establish new woodland that offers environmental and social public benefits. EWCO was generally well received and as we entered its second year, we focused on improving our delivery of the scheme, recognising that continuous improvement was key to getting more trees in the ground, rather than making significant changes to EWCO’s design."
        },
        {
            "text": "One of the concerns expressed by customers is how long some EWCO applications are taking to be processed. I wanted to directly address these concerns and provide reassurance that we are continuing to develop ways to improve things."
        },
        {
            "text": "Supporting as many appropriate woodland creation proposals as possible is a priority for us but we also need to balance this alongside processing Countryside Stewardship Higher Tier applications, and undertaking our regulatory duties. This can be challenging and we are carefully prioritising activity through the year while we continue to work hard to recruit and train more staff to increase our capacity."
        },
        {
            "text": "We recognise that the application forms ask for a lot of detailed information. Much of this information is required to justify award of the grant, including to check that the design requirements for the Additional Contributions are met. We understand this can result in a more complex experience for customers, and we have a project underway to review the forms to see if they can be more user friendly. We will share updates on this project and any changes to the forms via Forestry Commission eAlerts."
        },
        {
            "text": "The information we ask for is also required for us to consider proposals from a regulatory perspective, something we do as part of the EWCO process, to ensure the proposals meet the requirements of the UK Forestry Standard and the Environmental Impact Assessment Regulations. We have started work on regulatory reform to streamline this process, in line with the commitment of the England Trees Action Plan. Some of these regulatory reforms will take time to implement and have a longer-term impact, so we are also looking at ‘quick wins’ where we can; some of which we hope to be able to implement as early as 2023."
        },
        {
            "text": "In advance of these reforms, we have already updated our sensitivity maps to better inform where tree planting is likely to be most appropriate in England, and where planting proposals are likely to receive greater scrutiny due to environmental constraints."
        },
        {
            "text": "We are also looking at what changes we can make to the Woodland Creation Planning Grant to make its requirements more proportionate, and to consult stakeholders on planting proposals only once, at the most suitable time in the proposal’s life cycle. In the Yorkshire and the Northeast Area, we are testing whether consultation with stakeholders immediately on receipt of a EWCO application enables us to accelerate processing."
        },
        {
            "text": "It is important to note that applications that are in locations less sensitive to woodland creation, which readily demonstrate compliance with UK Forestry Standard and are completed thoroughly can be processed faster because we don’t need to come back to you for more information. There are certain steps you can take to ensure your application is correct that we have set out in our previous blog post ‘Six tips to help you apply for the England Woodland Creation Offer’."
        },
        {
            "text": "You also need to make sure you comply with the biosecure procurement requirement which came into force in June, and which applies to EWCO applications made after 22 June 2022. This 12-month pilot is an important step to ensure the new woodlands we are creating are protected against pests and diseases. Recommendations on how you can meet this requirement can also be found in the six tips to help you apply blog post."
        },
        {
            "text": "We will keep listening to and working with our customers to improve planting proposals’ journey from concept to delivery; be it small changes such as removing the need to provide a Customer Reference Number (CRN) with an application, to more fundamental changes such as allowing materials to be pre-ordered before agreements are offered, allowing land in Environmental Stewardship into EWCO without repayment where it will result in an improved environmental outcome, and through future regulatory reform."
        },
        {
            "text": "Our shared goal remains to establish many more woodlands across the country, and to ensure those schemes successfully establish to become thriving woodlands."
        }
    ]
}