{
    "url": "https://teaching.blog.gov.uk/2022/11/21/how-does-it-feel-to-be-an-award-winning-teacher/",
    "title": "How does it feel to be an award-winning teacher?",
    "authors": [
        "Jackie Birch"
    ],
    "categories": [
        "Inspiring teachers",
        "Primary schools"
    ],
    "pub_date": "2022-11-21T13:25:54+00:00",
    "content": [
        {
            "text": "Jackie Birch works at St. Peter's C of E Primary School in Wigan, Greater Manchester. In 2021, she won The Award for Teacher of the Year in a Primary School at the Pearson National Teaching Awards."
        },
        {
            "text": "How did it feel to win the Gold Award, and have it presented to you by some of your celebrity heroes on The One Show?"
        },
        {
            "text": "It has been an amazing experience. Like most teachers, I work with a great team of people, so simply being nominated was incredibly humbling. Not for one minute did I think that I would win! I’m just doing my job and I’m very fortunate that it’s a job I love."
        },
        {
            "text": "There was lots of secrecy around school on the day that the BBC came to film the clip for The One Show. It felt very surreal for the cameras and Mehreen Baig to be in the classroom. It was such a surprise when I saw the message from Janette Manrara and to then have Katya Jones visit. To receive a further message from Sir Rod Stewart was truly wonderful, it was a day that I will never forget. The positivity and feel-good factor for me personally, for our school and for the local community that has come from this award has been immeasurable. Eleven months later and I am still asked about it!"
        },
        {
            "text": "How did you transfer skills from your previous roles in housing and social care, to teaching?"
        },
        {
            "text": "In my time working in housing and social services, I felt I made a difference to people who really needed help. As I reflected on a starting a career in teaching, I knew those skills would be useful in the classroom context."
        },
        {
            "text": "My experience gave me valuable skills in dealing with a range of people, helping me become a more approachable and relatable person that parents can talk to. I also found, as a parent, that it was very difficult to speak to my children’s teacher at the start and end of the day. As a result, I make myself available for all our parents. Their child is important, and they deserve for me to give them and their child my time and best efforts."
        },
        {
            "text": "How do you set pupils up for success – are there any particular tools you use to increase their motivation and engagement with learning? "
        },
        {
            "text": "Our school and Trust have made major improvements in how we use digital technology to empower pupils to control their own learning and prepare them to thrive in today’s digital world. All of our children in KS2 have an tablet and each class in KS1 and EYFS have a number of tablets to share. This gives children access to a range of learning opportunities, both inside and outside of the school day. Students have developed their digital skills, are able to set their own goals and their learning is personalised - helping them to achieve their full potential."
        },
        {
            "text": "We also talk to them daily about resilience and giving their best. I try to instil these values into children and foster a belief that they can achieve. It is important for us all to recognise that outside factors can affect children and it is our job to make sure that their emotional, physical, and educational needs are met during challenging times."
        },
        {
            "text": "What gets you up in the morning and motivates you to teach?"
        },
        {
            "text": "Seeing a child’s face and hearing their response when you have engaged them with their learning gives me all the confirmation I need that this is my vocation, not just my job. The most rewarding aspect of my job is seeing children’s confidence increase. Also nurturing their self-belief - encouraging them to persevere and overcome obstacles to achieve their goal."
        }
    ]
}