{
    "url": "https://ukhsa.blog.gov.uk/2022/11/21/increasing-transparency-in-our-winter-statistics/",
    "title": "Increasing transparency in our winter statistics",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Winter"
    ],
    "pub_date": "2022-11-21T16:07:30+01:00",
    "content": [
        {
            "text": "The winter is a busy time for those working in public health and the health services."
        },
        {
            "text": "This coming winter, there is potential for respiratory or infectious diseases such as COVID-19, flu, RSV and norovirus (the “winter vomiting bug”) to coincide. We can also anticipate that there may be weather events, such as particularly cold spells and flooding."
        },
        {
            "text": "Additionally, the current cost-of-living crisis may have an impact on the ability of vulnerable people to keep warm and stay healthy. Health security hazards like these require a coordinated response across the public health system to ensure the health of the nation is secure and protected. Statistics and analysis are an important enabling tool for this."
        },
        {
            "text": "UKHSA publishes a range of statistics to help inform policy-makers, health professionals and the general public about the latest evidence relating to a range of public health matters. This blog sets out what we plan to publish this winter and how often. It also explains why we may take different approaches to apparently similar situations."
        },
        {
            "heading": 2,
            "text": "But first, why do we publish statistics?"
        },
        {
            "text": "Statistics are a foundation of our society. They support decisions made at every level, from national and local government to individuals in their everyday lives. They are part of the lifeblood of democratic debate."
        },
        {
            "text": "UKHSA aims to publish statistics that are trustworthy, of good quality and of value. The statistics we publish are fit for purpose and measure the things that most need to be measured. We are transparent about what we will publish and when, and about the methods and data sources used to compile the statistics."
        },
        {
            "text": "We believe this gives all our users – including ministers, policy-makers, health professionals and the general public – confidence that our statistics can be relied upon to help them make the decisions. Our approaches align with the standards and principles set out in the Code of Practice for Statistics and regulatory guidance on the transparent use and release of data."
        },
        {
            "heading": 2,
            "text": "Planned statistical publications"
        },
        {
            "text": "Over the winter period, we plan to publish regular statistics about:"
        },
        {
            "text": "We have compiled a comprehensive calendar to bring together all the relevant information about the planned statistical or analytical publications in the coming months, including their coverage and frequency of publication. This augments the statistics release calendar where our official statistics are announced at least 4 weeks in advance of publication. We hope that this transparency around what we plan to publish and when, will provide the information different users need for planning purposes."
        },
        {
            "heading": 2,
            "text": "Ad hoc statistical publications"
        },
        {
            "text": "It is likely that we will supplement these planned publications with ad hoc publications. Ad hoc publications are an important tool for transparency because they allow us to release statistics when they are needed and in response to specific situations."
        },
        {
            "text": "For example, we are likely to publish statistics about cold weather-related excess mortality following the winter season."
        },
        {
            "text": "We will give as much notice as possible of upcoming ad hoc statistical publications by announcing them on Statistics at UKHSA, the one-stop shop for information about our published statistics. However, the very nature of these ad hoc publications means they may be produced and published at short notice."
        },
        {
            "heading": 2,
            "text": "Different approaches to apparently similar situations"
        },
        {
            "text": "UKHSA statistics about different diseases are sometimes published with different frequencies and to different levels of detail. This can reflect how quickly the situation relating to a particular disease may change. In some situations, a weekly update provides valuable information to enable decision-making; in other cases a monthly update is sufficient."
        },
        {
            "text": "Syndromic surveillance monitors trends in patient health care-seeking activity. In UKHSA we undertake daily analysis of syndromic data to understand the patterns of activity and look for unusual changes that might inform us of potential public health problems."
        },
        {
            "text": "During winter, syndromic surveillance reports are published weekly to support decision-making in UKHSA and other parts of the health sector. However, the analysis goes on year-round, enabling us to provide support to various public health incidents such as heatwaves, air pollution episodes or situations where the risk of disease transmission is high, such as at mass gatherings."
        },
        {
            "text": "Surveillance systems change over time, often in response to significant public health events such as the 2009 flu pandemic and the 2020 COVID-19 pandemic. Some of the approaches developed during the COVID-19 pandemic may become longer term surveillance tools, and they may enable different levels of reporting in the future."
        },
        {
            "text": "We are also using the knowledge gained through the COVID-19 pandemic, along with user feedback, to develop our statistical outputs. For example, we are working with the ONS to deliver a small-scale flu survey to run alongside the Coronavirus (COVID-19) Infection Survey (CIS)."
        },
        {
            "heading": 2,
            "text": "How you can help us"
        },
        {
            "text": "We’d love your feedback on this blog, our statistics and our new release calendar. Please get in touch."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}