{
    "url": "https://planninginspectorate.blog.gov.uk/2022/11/21/never-mind-the-quality-feel-the-width/",
    "title": "Never mind the quality, feel the width",
    "authors": [
        "Richard Schofield"
    ],
    "categories": [
        "Performance",
        "Service improvement"
    ],
    "pub_date": "2022-11-21T12:58:28+00:00",
    "content": [
        {
            "text": "Richard Schofield, Head of Inspector Profession, asks the question 'what is a “quality” decision?' and invites feedback on how we should define our approach. "
        },
        {
            "text": "I am not old enough to have watched the 1970s sitcom, the title of which I have pinched for this post. It is, however, remarkably apposite."
        },
        {
            "text": "At the Planning Inspectorate, quality assurance is integral to our work. Local Plan and National Infrastructure reports are peer reviewed. A random selection of inspectors’ decisions are reviewed after and, sometimes, before issue."
        },
        {
            "text": "For a long time we relied upon the number of complaints that we upheld, and the number of High Court Challenges that we lost, or where we submitted to judgement (very few, for the record), as a barometer of the quality of our output. Now, however, one of our Ministerial measures, against which we report, is the number of cases we have quality assured."
        },
        {
            "heading": 3,
            "text": "But, so what?"
        },
        {
            "text": "Well, our processes allow us to identify and to investigate, among other things, trends in appeal types; areas where additional training and/or guidance may be required; and areas where we need to help our customers to do things better (more on that another time)."
        },
        {
            "text": "But what IS a “quality” decision? What we regard as such may not be what you regard as one. And I am keen to (re)define our approach in this area."
        },
        {
            "heading": 3,
            "text": "So, let’s hear your thoughts!"
        },
        {
            "text": "What factors go into making something that inspectors and all interested parties would regard as being of high quality? Feel free to reply to this."
        },
        {
            "text": "And, yes, we know our written reps decision times are slower than they should be. And we’re working on it. This is about something else. By way of a clue, the answer is definitely NOT, “a case that is determined in my favour”."
        }
    ]
}