{
    "url": "https://companieshouse.blog.gov.uk/2022/11/21/register-of-overseas-entities-what-why-and-when/",
    "title": "Register of Overseas Entities – what, why and when",
    "authors": [
        "Mike Ward - Founder and Executive Chairman, Armalytix"
    ],
    "categories": [
        "Companies House transformation",
        "Company guidance",
        "Digital transformation"
    ],
    "pub_date": "2022-11-21T13:31:40+00:00",
    "content": [
        {
            "text": "Following Putin’s invasion of Ukraine, the Economic Crime (Transparency and Enforcement) Act 2022 was accelerated and rapidly passed. A key component was the new Register of Overseas Entities, along with other measures to combat financial crime."
        },
        {
            "heading": 2,
            "text": "What is the Register of Overseas Entities?"
        },
        {
            "text": "Effective from 1 August 2022, overseas entities are required to provide greater transparency over their beneficial ownership to crack down on money laundering."
        },
        {
            "text": "Overseas entities transacting with property or land in the UK must now register with Companies House and identify their beneficial owners."
        },
        {
            "text": "The new regulations will also apply, retrospectively, to overseas entities who bought property or land on or after:"
        },
        {
            "text": "The deadline for registration is 31 January 2023."
        },
        {
            "text": "If these entities do not register with Companies House, they will not have an overseas entity ID and will not be able to register a change of interest at the relevant land registry. This will prohibit that entity from buying or selling property or land in the UK."
        },
        {
            "heading": 2,
            "text": "Why we need it"
        },
        {
            "text": "Globally, money laundering is estimated to account for up to 5% of global gross domestic product (GDP), equivalent to a value of $2 trillion. In the UK, there’s a significant amount of dirty money flowing through the country - most notably in the property sector. Laundered money has become a significant issue and companies have been given plenty of warnings about the financial and social consequences of not following anti-money laundering regulations."
        },
        {
            "text": "Looking at London in particular, its continued rise as an international capital and desirable destination has driven a booming, high-value property market. This, when combined with an openness to international money, has created the ideal conditions for financial crime to grow."
        },
        {
            "text": "Wealthy investors often buy property through corporate entities, including those offshore. Whether deliberate or not, this can hide who the ultimate beneficial owners are."
        },
        {
            "text": "This is an issue for both commercial and residential properties. Since 2010, overseas ownership of residential property has tripled, now sitting at over 1% of all UK properties. It’s also not confined to London. In the last 10 years, foreign investment in property has spread out across the UK."
        },
        {
            "heading": 2,
            "text": "What you need to do now"
        },
        {
            "text": "If you’re an overseas entity and you own land or property in the UK or wish to do so, you must register with Companies House. The key requirement is that you must disclose who has a beneficial interest in the entity."
        },
        {
            "text": "If you’re in scope and you do not register, you could face significant sanctions."
        },
        {
            "heading": 2,
            "text": "Requirements for registration"
        },
        {
            "text": "There are 3 key parties involved in registration:"
        },
        {
            "text": "The first step is to engage a registered agent."
        },
        {
            "heading": 2,
            "text": "Who can be an agent"
        },
        {
            "text": "Eligible firms will have to register with Companies House to get an agent assurance code. Broadly, as a minimum, agents must be subject to the Money Laundering, Terrorist Financing, and Transfer of Funds Regulations (2017). This means agents could be financial institutions, accountants, lawyers, and even estate agents. Some of the representative bodies of these professions have urged caution about becoming an agent. Agents need subject matter expertise and are liable for correctly verifying the information given to them by entities."
        },
        {
            "heading": 2,
            "text": "Considerations if you’re transacting with an overseas entity"
        },
        {
            "text": "There can be risks involved when buying and selling property involving an overseas entity. If you’re acting upon or are one of the parties involved in the purchase, contractually you must allow for the new legislative requirements so that you do not run into issues down the line. An example is a conveyancer whose seller involves an overseas entity. If the new requirement is not satisfied, the recipient could potentially be liable for receiving criminal funds, which is an offence. There is also more risk to parties in a property transaction where there is an overseas entity in the chain."
        },
        {
            "text": "The Register of Overseas Entities will be an effective step in reducing financial crime committed by those hiding behind overseas entities. Everyone should be aware of its implications."
        },
        {
            "heading": 2,
            "text": "Links to further guidance"
        },
        {
            "text": "About Armalytix"
        },
        {
            "text": "Armalytix is a data intelligence firm that allows consumers to safely share open banking and other data to deliver financial insights to firms, helping those firms conduct faster and more effective Source of Funds and Wealth checks."
        },
        {
            "text": "About Mike Ward"
        },
        {
            "text": "Mike Ward is a founder and Executive Chairman of Armalytix. Much of Mike’s career has been spent in banking where he managed the various equity divisions for Nomura, Bank of America Merrill Lynch and Deutsche Bank."
        },
        {
            "text": "Mike is passionate about stemming the rise of financial crime. Too often in his 20 year career in banking, he saw poor processes, which despite people’s best intentions, allowed bad actors to deploy illicit funds in the financial system."
        }
    ]
}