{
    "url": "https://insideDIO.blog.gov.uk/2022/11/21/transforming-the-british-army-estate-in-belize/",
    "title": "Transforming the British Army estate in Belize",
    "authors": [
        "Lieutenant Colonel M A Jenkins"
    ],
    "categories": [
        "BATSUB",
        "Belize",
        "British Army"
    ],
    "pub_date": "2022-11-21T15:58:29+00:00",
    "content": [
        {
            "text": "The refurbished Sailfish Club at the British Army Training Support Unit Belize (BATSUB) [Crown Copyright / MOD 2022]DIO’s overseas teams are constantly working to support the training requirements of our Armed Forces in locations across the globe. In Belize, we’re responsible for maintaining the British Army Training Support Unit Belize (BATSUB) estate, which has recently benefited from a programme of infrastructure improvement works worth around £7m."
        },
        {
            "heading": 2,
            "text": "About BATSUB"
        },
        {
            "text": "BATSUB enables jungle training exercises for the British Army as well as the Belize Defence Force (BDF) and various partner nations. It has a licence to train up to 3,750 personnel a year across a network of government and privately-owned land spanning 375,000 hectares. At the heart of BATSUB is the headquarters at Price Barracks, which is shared with the Belize Defence Force."
        },
        {
            "heading": 2,
            "text": "The Life Cycle Replacement Programme"
        },
        {
            "text": "The Life Cycle Replacement Programme (LCR) was originally developed in 2018 to ensure that BATSUB would be set to meet the challenge of providing a first-class training base for personnel conducting jungle warfare training. The programme has seen the much-needed replacement of the DIO Logistics Building, the refurbishment of the Sailfish Club recreational facility, and the installation of a new Water Treatment and Fire Suppression System. These facilities are essential for achieving the BATSUB mission, to “support and facilitate unit-delivered collective training in order to support the preparation of forces for readiness and operations.”"
        },
        {
            "text": "Inside the new water treatment plant [Crown Copyright / MOD 2022]With final approval received in 2020, it was a challenging programme from the outset. The contract was awarded during the COVID-19 lockdown, when BATSUB was reduced to minimal staffing levels and many of our DIO staff were re-deployed back to the UK. However, the expertise of the DIO Commercial team in working on overseas projects proved invaluable, helping to ensure a successful start to the programme despite the challenges involved."
        },
        {
            "text": "The LRC programme was funded by the British Army and was initially supported by DIO’s Regional Delivery Overseas and Training team, before being handed over to our Major Programmes and Projects team in 2021 for completion. Close collaboration with our industry partners and key stakeholders, including the BDF, was central throughout the programme and helped to ensure its successful completion in August 2022."
        },
        {
            "heading": 2,
            "text": "Improving the training experience at BATSUB"
        },
        {
            "text": "The new Water Treatment and Fire Suppression System will provide reliable potable water to BATSUB and BDF personnel, as well as an improved, camp-wide fire suppression system. The refurbishment of the Water Treatment Works will also help to enhance the sustainability of BATSUB, by reducing both the amount of wasted water and the energy – and associated carbon footprint – required in its treatment."
        },
        {
            "text": "The new, modernised DIO Logistics Building [Crown Copyright / MOD 2022]The DIO Logistics Building will provide a modernised space to store construction and maintenance materials, aiding effective and efficient service delivery. Meanwhile, the newly refurbished Sailfish Club will provide a much needed social and recreational space for BATSUB personnel and soldiers returning from intense jungle training. The refurbishments to the club, including a new bar and improved dining space, were designed with the welfare of personnel firmly in mind, as well as being an important space to promote team cohesion."
        },
        {
            "text": "The new and improved facilities will also benefit our international partners, helping to meet the training requirements of partner nations’ forces at BATSUB in addition to those of the UK and Belize Armed Forces."
        },
        {
            "text": "The LCR programme forms part of a larger investment package in Belize, with the construction of a new, purpose-built ammunition compound at Hattiville Ranges now underway. It’s greatly encouraging to witness the collaborative efforts of our DIO teams, working with British Army colleagues and our industry partners, to transform the BATSUB estate. Our ongoing efforts to maintain and improve infrastructure at BATSUB will ensure its continued effectiveness in supporting UK Defence interests in the region."
        }
    ]
}