{
    "url": "https://forestrycommission.blog.gov.uk/2022/11/21/trees-on-farms-success-stories-for-nature-and-people/",
    "title": "Trees on farms: success stories for nature and people",
    "authors": [
        "Eleanor Marks"
    ],
    "categories": [
        "Climate change and resilience",
        "nature",
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2022-11-21T09:00:53+00:00",
    "content": [
        {
            "text": "Seventy-two per cent of UK land is agricultural. Farmers are balancing a demand to grow nutritious food and materials, while ensuring the environment in which they are grown remains healthy. Many want the land in better condition for future generations and are eager to learn how best to mitigate risks to the environment and ultimately, their livelihoods. Trees play an important role in this balancing act between food, business, and the environment.   "
        },
        {
            "text": "LEAF (Linking Environment And Farming) has formed a network of inspiring members, demonstration farms and beacons of sustainable farming excellence over the last 30 years. This has been achieved through LEAF’s unique ability to develop strategic and influential partnerships to enable change and encourage the implementation of Integrated Farm Management (IFM) principles.   "
        },
        {
            "text": "Here we showcase two farmers integrating trees into their farm’s systems. Despite operating at different scales, both farms are actively enhancing habitat quality for wildlife and improving their business’ resilience to climate change following their involvement in LEAF-led projects.    "
        },
        {
            "heading": 3,
            "text": "Nature Based Solutions to Climate Change funded by the Linder Foundation  "
        },
        {
            "text": "Objectives: Work with 10 selected farmers and experts to implement nature-based solutions for effective carbon reduction and benefits to nature. March 2021-February 2022 "
        },
        {
            "text": "Our case studies booklet demonstrates how the solutions used have impacted the farms, and highlights farmers’ recommendations as a result of their experience. Farmers have calculated their carbon footprints, met with bespoke advisors, and taken part in training workshops and events.  "
        },
        {
            "text": "One example is David Rose, an arable mixed farmer at Home Farm in Nottinghamshire. It is a 182 hectare business with a flock of sheep, cattle, cereal crops, agroforestry, and combination of arable and tree crops. David is an early adopter of agroforestry and its integration into arable fields, which is now a key element of the farm. Two fields of 15 acres include 3-metre-wide strips of grasses, wildflowers with fruit and nut trees at 24 metre intervals with arable crops between. This combination of arable crops and tree crops is known as a ‘silvoarable’ system.  "
        },
        {
            "text": "David’s silvoarable system has improved overall soil health, continues to sequester carbon, and visibly supports wildlife. Various tests by project advisors found an increase in both earthworms and nematodes (microscopic wormlike organisms that indicate healthy soils). By incorporating trees, Home Farm has also diversified and formed a strong connection with the local community through tree planting projects and woodland workshops. David is now in the process of creating a new, 2 acre hazel and willow agroforest. David says:"
        },
        {
            "text": "One year is not usually considered a long enough time to see positive change on farm. This project, however, has shown that with the right support, positive change for nature and people can happen. "
        },
        {
            "heading": 3,
            "text": "Resilient and Ready, LEAF and Corteva Agriscience"
        },
        {
            "text": "Objectives: Work with four forward thinking farms, two in Scotland and two in England to help improve business resilience for the future through expert advice and knowledge exchange. January 2019 – December 2022 "
        },
        {
            "text": "The selected farmers underwent a three-year, tailored training programme with technical mentoring. Building their skills and confidence to go on and lead change in the industry. Wildlife surveys, soil health and carbon measurements were benchmarked, monitored and trials set up.  "
        },
        {
            "text": "One of our participants is Andy Bason, farm manager of Newhouse Farm, an 800 hectare estate with 600 hectares of arable cropping in Hampshire. Newhouse Farm also has a small flock of sheep, pigs and 70 hectares of woodland. Andy applied for the Resilient and Ready programme because it coincided with his vision to grow public engagement, receive and share advice, and to improve his knowledge of measuring and enhancing the farm’s biodiversity and sustainability.  "
        },
        {
            "text": "In spring 2022, 30-metre-long strips of wildflowers and grasses with 375 trees were planted in an arable field. These 10 hectares have created an opportunity for Newhouse to monitor change to yields, biodiversity, insect, and pest populations. It is intended that the mature trees will supply the public with apple, pear, and nut products directly from the farm, improving business resilience.  "
        },
        {
            "text": "Newhouse are set to plant 10 hectares with 19,000 trees this autumn through a woodland creation grant. This woodland will connect with tree belts to enhance habitat connectivity across the estate and supplement the existing 70 hectares of woodland that provides biomass energy. Andy has noticed more roe deer, fallow deer and muntjac across the farm as well as an increase in brown hares and nesting barn owls. All signs that the integration of habitats and farming is benefitting local wildlife.  "
        },
        {
            "text": "While Newhouse’s main commercial enterprise is arable, Andy is working hard towards integrating trees into the farm system and wider countryside while continuing to engage the public and fellow farmers. LEAF was delighted to have Newhouse Farm become a LEAF Demonstration Farm earlier this year (May 2022).  Andy says: "
        },
        {
            "heading": 3,
            "text": "Growing into the future"
        },
        {
            "text": "Incorporating trees and woodlands into the farm system can be challenging. It is an investment of time and resources which is why projects such as these are so important. Trees and woodlands bring management costs not typically incorporated into farming operations. For example, a risk to Newhouse Farm’s young agroforestry plot has been the local deer population. The cost of deer fencing the in-field strips is unfeasible, but they are hoping enough trees survive to maturity. Managing diseased or dangerous trees also requires professional help and external resources. No farm is entirely the same; integrating trees into silvoarable or agroforestry systems, or creating new woodland, depends greatly on the farm’s capacity to take chances and make changes with a long-term perspective, and on the support available to do so. Both David and Andy have a genuine ambition to integrate trees and habitats across their farm, produce food sustainably, and share their experiences with others. Thank you to them both for sharing their knowledge and experience.   "
        },
        {
            "text": "LEAF continues to build on its 30 years of experience working with farmers to drive more sustainable, regenerative food production. Go to the LEAF website to find guidance, training, and other project opportunities. After the success of both projects, the second round of the Resilient and Ready Program and Linder: Nature Based Solutions project are underway: Find out more here.\n"
        },
        {
            "text": "If you have any questions about LEAF’s work and how to get involved please contact enquiries@leaf.eco "
        }
    ]
}