{
    "url": "https://hodigital.blog.gov.uk/2022/11/21/what-does-a-technical-architect-at-the-home-office-do/",
    "title": "What does a Technical Architect at the Home Office do?",
    "authors": [
        "Abimbola Odeyinde, Interim Head of Architecture Profession/ Head of Business Architecture",
        "Shueb Khilji, Lead Enterprise Architect"
    ],
    "categories": [
        "Development",
        "Technical Architect"
    ],
    "pub_date": "2022-11-21T09:25:07+00:00",
    "content": [
        {
            "text": "Our Technical Architects are responsible for the design and build of the technical architecture that benefits Home Office teams as well as the services you use."
        },
        {
            "text": "To do that we provide:"
        },
        {
            "text": "Our Technical Architects work closely with delivery teams and are hands-on – they might code prototypes or be involved in the technical management of teams. The type of projects we work on include:"
        },
        {
            "text": "Technical Architecture is recognised as one of the DDaT Professions. This means our people work within a Profession Capability Framework with clear career pathways and commitment to continuous professional development."
        },
        {
            "text": "The framework includes Heads of Role, who are industry specialists. They build communities, set standards for what ‘good’ looks like, and ensure we have the right people in the right jobs at the right time."
        },
        {
            "heading": 2,
            "text": "‘A day in the life of a Tech Architect at the Home Office’: Meet Shueb"
        },
        {
            "text": "Hello, I’m Shueb. I’m the Lead Enterprise Architect in the Chief Technology Office (CTO) Architecture Team."
        },
        {
            "text": "The CTO Architecture Team is responsible for establishing and maintaining architectural standards while exploring the latest IT trends."
        },
        {
            "text": "As a Lead Technical Architect, I work across multiple projects and teams on challenges that require broad architectural thinking. I help guide project colleagues using architectures, principles, standards and tooling to deliver new systems or enhance existing systems - for both Home Office users and the public."
        },
        {
            "text": "A big part of my role is gathering stakeholder opinions and balancing different demands to make design decisions. By demonstrating leadership, clarity of thought and impartiality I deal with objections and trade-offs."
        },
        {
            "text": "I’ve worked on massive, complex projects as well as creating 5-year roadmaps for departmental portfolios. I’ve identified technical debt across the Home Office leading to substantial savings, completed exercises to allow us to better understand our current IT estate architecture and created roadmaps outlining how we can move toward our target IT architecture."
        },
        {
            "heading": 2,
            "text": "Joining the civil service from the corporate world"
        },
        {
            "text": "I joined Home Office DDaT a year ago. Before submitting my application I had many reservations. Some of them included being of Indian origin and having no experience in the civil service (having previously spent over 25 years in the corporate world). But all these concerns vanished at interview. The interview was one of the most inviting ones I’ve had in my entire career!"
        },
        {
            "text": "The level of engagement I received during the onboarding process made me feel so welcome – as though I were joining one big family. While I found my feet, colleagues did all they could to support me."
        },
        {
            "heading": 2,
            "text": "Loads of work variety and making a positive impact"
        },
        {
            "text": "As a Tech Architect in the Home Office not a single day is the same."
        },
        {
            "text": "From internal business challenges to keeping our citizens and the country safe, there are many opportunities to help make a positive difference."
        },
        {
            "text": "Our Home Office Careers site has more information on our roles and how to apply for them."
        }
    ]
}