{
    "url": "https://insidedio.blog.gov.uk/2022/11/02/a-new-start-for-facilities-management-on-overseas-sites/",
    "title": "A new start for facilities management on overseas sites ",
    "authors": [
        "Brigadier Jonathan Bartholomew OBE"
    ],
    "categories": [
        "Commercial",
        "Facilities Management",
        "Gibraltar"
    ],
    "pub_date": "2022-11-02T09:58:35+00:00",
    "content": [
        {
            "text": "Today marks the start of the first of a new suite of contracts to provide key services for the UK Armed Forces on overseas Ministry of Defence (MOD) bases. "
        },
        {
            "text": " We awarded the £155 million contract, which provides maintenance work, repairs, servicing, and hard facilities management to the MOD's estate in Gibraltar, to Mitie in May. DIO staff have been working with Mitie colleagues since then to prepare for the changeover to the new contracts. "
        },
        {
            "text": "This is the first contract to come into service under DIO’s new Overseas Prime Contracts (OPC) programme, which will also see further contracts come into force at Defence sites including Cyprus, Germany, the Falkland Islands and Ascension Island. The Gibraltar contract will last for an initial period of seven years.   "
        },
        {
            "heading": 2,
            "text": "The MOD in Gibraltar "
        },
        {
            "text": "Gibraltar is an important site for the Ministry of Defence. It’s been a British Overseas Territory since 1704 and has had an Armed Forces presence for more than a century. Despite its small size, Gibraltar is a regular stop for ships and aircraft to refuel and take on supplies. "
        },
        {
            "text": "It boasts the Royal Navy’s Gibraltar Squadron, consisting of two Fast Patrol Boats, HMS Cutlass and HMS Dagger, with further support provided by three Pacific Rigid Inflatable Boats. They uphold the security of the territorial waters and support exercises and operations. "
        },
        {
            "text": "The Royal Air Force also has a presence, with RAF Gibraltar at the northern end of the peninsula providing an important operational airhead. DIO resurfaced the runway back in 2016. The Army’s Royal Gibraltar Regiment are also based there. DIO’s work, and by extension this contract, supports all of these personnel as well as the civilian staff and contractors who work with them.  "
        },
        {
            "heading": 2,
            "text": "Designing the contracts "
        },
        {
            "text": "We are not reinventing the wheel with these new contracts, but making a number of smaller improvements based on what we have learned from previous facilities management arrangements. This includes recommendations made by those who are directly affected – service personnel. Accordingly, we have designed the contracts to have closer alignment to current industry standards, which will result in increased collaboration between DIO and its suppliers and allow for services to be better tailored to the requirements of specific locations.  "
        },
        {
            "text": "The contracts have also been designed to promote more efficient processes and the quicker delivery of high volume, lower value works, ensuring increased value for money. A new, integrated software system will enable information to be shared more effectively and performance targets will encourage a high standard of repairs and reduce the need for repeat visits. In short, these new contractual arrangements will mean a better service for hundreds of military personnel based overseas. "
        },
        {
            "text": "We expect the contract coming into force today in Gibraltar to directly sustain around 200 jobs and support around 1,400 military personnel and staff.  "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "The next of this suite of contracts to be awarded will be for hard facilities management in Cyprus in early 2023. Now that the Gibraltar contract is up and running, we’ll be turning our attention to that and the other locations which will follow. The final contract is planned to be for the South Atlantic Islands in summer 2024.  "
        },
        {
            "text": "\n"
        }
    ]
}