{
    "url": "https://educationhub.blog.gov.uk/2022/11/applying-to-university-everything-you-need-to-know/",
    "title": "Applying to university – everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Admissions",
        "Universities"
    ],
    "pub_date": "2022-11-02T16:22:01+00:00",
    "content": [
        {
            "text": "Young people who are considering going to university next year should be thinking about their applications and what grades/qualifications they need. But how does that process work?"
        },
        {
            "text": "Here, we answer your questions."
        },
        {
            "heading": 3,
            "text": "I’m at school/college in England – how do I apply to university?"
        },
        {
            "text": "If you are at school/college in England and want to study at a UK university, you must submit an application through UCAS."
        },
        {
            "text": "But before you submit make sure you:"
        },
        {
            "text": "UCAS has a helpful guide on Applying to University - learn about everything involved (ucas.com) including support for what to do after, like student finance and when you’ll receive an offer."
        },
        {
            "heading": 3,
            "text": "But what if I’m at school/college in Scotland/Wales/Northern Ireland?"
        },
        {
            "text": "If you have a British passport, the process for applying to study in the devolved nations of Scotland, Wales and Northern Ireland remains the same as above."
        },
        {
            "text": "If you are a resident of a devolved nation and want to apply to university in your home country, there may be some differences, and you will be made aware of these the application stage and any open days you attend."
        },
        {
            "heading": 3,
            "text": "I’m an international student – how do I apply to a UK university? "
        },
        {
            "text": "If you’re a prospective international student wanting to apply to a UK university, the application process is the same as it is for UK students – through UCAS."
        },
        {
            "text": "The majority of international students must prove they have enough money to pay for their course and support themselves in the UK before being granted a visa to study in the UK."
        },
        {
            "text": "There are also other steps prospective international students need to comply with to be granted a student visa to study in the UK. You can find out more here: How do international students access UK universities? - The Education Hub (blog.gov.uk)."
        },
        {
            "heading": 3,
            "text": "But are there enough university places for everyone?"
        },
        {
            "text": "Applying to university is a competitive process and will depend on your personal statement, grades and other information like your reference and any exceptional personal circumstances."
        },
        {
            "text": "Statistics from UCAS for the 2022 cycle, however, show:"
        },
        {
            "heading": 3,
            "text": "Is it easier or harder for pupils from state funded schools to get into top universities compared to their counterparts from private schools?"
        },
        {
            "text": "Universities are autonomous and decide who they admit. Historically, private schools have taken a relatively larger share of places at Oxford, Cambridge and the most selective universities."
        },
        {
            "text": "But this is changing. The proportion of UK undergraduate entrants at these institutions who attended state-funded schools and colleges shows an increasing trend."
        },
        {
            "text": "In 2015/16, 62% of Cambridge's UK based undergraduate entrants and 56% of Oxford’s UK based undergraduate entrants came from state funded schools and colleges. In 2020/21 those percentages had risen to 70% and 69% respectively."
        },
        {
            "text": "We are keen that admission to the most selective universities isn’t dependent on what type of school a pupil went to or their background, but their suitability and what they can achieve."
        },
        {
            "text": "Ensuring that students are well prepared their higher education course is what will help them to get on at university and will also help them to access that course that best suited to them. That is why the Office for Students is refreshing Higher Education providers' access and participation plans, to focus more on raise attainment in schools."
        },
        {
            "heading": 3,
            "text": "Are international students taking places away from UK based students?"
        },
        {
            "text": "No."
        },
        {
            "text": "Universities allocate and offer places to students in separate streams – for those who are from the UK and for those that are from overseas. It is a myth that offering a place to an international student takes away a place from a student from the UK."
        },
        {
            "text": "Most universities have separate home and international student recruitment targets, set before the admissions cycle even begins."
        },
        {
            "text": "Universities plan their student numbers carefully, not least because there are important implications for the provision of student support and wellbeing services, accommodation, and everything else needed to deliver the best student experience."
        },
        {
            "text": "While we welcome international students, who make an important contribution to the diversity of our universities, we know that the number of UK students studying across the country is going up, not down.This has been the case for the last five academic years. Last year, over two million UK students were studying for a higher education qualification in this country. UK students take up the vast majority of places on university undergraduate courses, accounting for 84.3% of the undergraduate student population."
        }
    ]
}