{
    "url": "https://environmentagency.blog.gov.uk/2022/11/02/everything-you-need-to-know-about-beach-wash-ups/",
    "title": "Everything you need to know about beach wash ups",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-11-02T12:29:03+00:00",
    "content": [
        {
            "text": "The Environment Agency often receives reports of marine life and seaweed washed up along coastlines across the UK."
        },
        {
            "text": "Wash ups are not unusual but, with heightened awareness since crustacean deaths in the North East and Yorkshire back in 2021, such reports have increased."
        },
        {
            "text": "What is a wash up? "
        },
        {
            "text": "Following rough seas, higher tides and strong winds, large amounts of marine material such as seaweed gets washed up on beaches regularly around the UK."
        },
        {
            "text": "Seaweed wash ups are more likely to happen, and be more visible, when the plant is large after a long growing season and starts to break down. This means they tend to be seen more in the autumn and winter months."
        },
        {
            "text": "Marine life such as whole invertebrates (like starfish), crabs and other crustaceans can be vulnerable to wash ups as they tend to live in or migrate to shallow water, which means they are more likely to be swept on to beaches. This could happen all year round but is more common in the autumn and winter months."
        },
        {
            "text": "Empty shells are generally the remains following predation by other animals or from ongoing growth and shedding."
        },
        {
            "text": "We know it’s concerning to see large numbers of dead marine life washed up on the beach, especially when animals and plants washed up can pile up in areas where there is a ‘trap’ such as a beach end or harbour wall."
        },
        {
            "text": "What happened when high numbers of crabs and lobsters washed up on the beach in 2021? "
        },
        {
            "text": "A comprehensive investigation, which the Environment Agency was part of, concluded a naturally occurring algal bloom was the most likely cause."
        },
        {
            "text": "Wash ups are usually natural occurrences, but we always look for anything out of the ordinary that may need a different response."
        },
        {
            "text": "What does the Environment Agency do about them? "
        },
        {
            "text": "The role of the Environment Agency is to look at whether any sources on land could be polluting water. There are some circumstances where we may not expect to see wash up  activity, so we would carry out further investigation."
        },
        {
            "text": "If we receive any reports of unusual wash ups, for example if the weather is calm, officers will take steps to investigate the likely cause. This could include site visits, taking water samples and analysis of photos or weather reports."
        },
        {
            "text": "Other factors we will consider when investigating a wash up include the presence of a large number of animals we don’t normally expect in natural wash ups, such as fish and large invertebrates that are more mobile and live in deeper water, discoloured or smelly water and whether the animals would normally be expected for the time of year."
        },
        {
            "text": "If we conclude a wash up has occurred due to water pollution, we may be able to take steps to tackle that including enforcement action against those responsible. We will also work with other organisations such as the Marine Management Organisation (MMO) or the relevant Inshore Fisheries Conservation Authority so they can investigate if we don’t believe pollution is the cause."
        },
        {
            "text": "If you see any wash ups on the beach that you are concerned about, please report it to the Environment Agency’s 24-hour incident hotline on 0800 807060."
        }
    ]
}