{
    "url": "https://hmlandregistry.blog.gov.uk/2022/11/02/what-kind-of-joint-ownership-do-i-have/",
    "title": "What kind of joint ownership do I have?",
    "authors": [
        "Tracy Huitson, Change Manager, Customer Support Centre"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2022-11-02T15:57:30+00:00",
    "content": [
        {
            "text": "People often call our Customer Support Centre to ask about joint ownership and if they can confirm whether they own their property as a ‘joint tenant’ or ‘tenant in common’ from looking at their copy of their register. Our Customer Support Centre staff are unable to tell you whether you are a joint tenant or tenant in common as it is not always definitely stated in our documents, but there are a few places you can check to try and find out."
        },
        {
            "text": "There are a variety of documents relating to property ownership which may hold some information on the type of joint ownership you have. HM Land Registry often has copies of some of these, but not all. Before you bought your property, your solicitor or conveyancer should have explained the options to you and asked you to confirm what type of joint ownership you wanted. We always recommend you contact a solicitor or conveyancer to check the type of joint ownership you have if you’re unsure."
        },
        {
            "heading": 2,
            "text": "What do the terms ‘joint tenant’ and ‘tenant in common’ mean?"
        },
        {
            "text": "If you buy, inherit or become a trustee of a property with someone else, you must decide how you want to ‘hold’ the property together. There are two ways you can become a joint owner of property under UK law: as either ‘joint tenants’ or ‘tenants in common’."
        },
        {
            "text": "The type of ownership you choose affects what you can do with the property if your relationship with a joint owner breaks down, or if one owner dies. Your conveyancer will discuss this with you and include your choice when they register the property with us."
        },
        {
            "heading": 2,
            "text": "Joint tenants"
        },
        {
            "text": "As joint tenants (sometimes called ‘beneficial joint tenants’):"
        },
        {
            "heading": 2,
            "text": "Tenants in common"
        },
        {
            "text": "As tenants in common:"
        },
        {
            "heading": 2,
            "text": "Documents that may hold information on your joint ownership"
        },
        {
            "text": "If you are looking for information on the type of joint ownership you have, this information may be held in the following documents."
        },
        {
            "text": "You can apply for copies of any of the documents in the left-hand column using the form OC2, for a fee."
        },
        {
            "text": "We do not usually hold copies of the documents in the right-hand column, so you should ask your conveyancer about these documents."
        },
        {
            "heading": 2,
            "text": "How HM Land Registry records joint ownership"
        },
        {
            "text": "When we receive your documents from your conveyancer, we will check panel 10 of your Transfer (TR1) form to check whether you’ve chosen to be joint tenants or tenants in common. Therefore, it’s worth double-checking this panel when your conveyancer asks you to sign the form."
        },
        {
            "text": "If you’ve chosen to hold the property as tenants in common, we’ll register a ‘Form A restriction’, which you will see in your title register. You will not see the words ‘tenants in common’ in your register, so here’s what to look for to see if you have this restriction:"
        },
        {
            "text": "If you choose to be joint tenants, no Form A restriction is added to your register."
        },
        {
            "text": "Download a copy of your title register. If you’ve got your title register see our guidance on how to read it."
        },
        {
            "heading": 2,
            "text": "How to change the ownership"
        },
        {
            "text": "Sometimes, over the years, circumstances change and you might want to alter the way you hold your property as a result."
        },
        {
            "text": "You can find more information on how to change from joint tenants to tenants in common, or vice versa, on GOV.UK."
        },
        {
            "text": "We strongly recommend consulting a legal adviser and a financial adviser before making any changes, to consider the possible impact of any decisions you make – which might affect you either now or at a later date."
        }
    ]
}