{
    "url": "https://educationhub.blog.gov.uk/2024/07/26/free-speech-act-what-you-need-to-know/",
    "title": "Free Speech Act: what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2024-07-26T15:47:16+01:00",
    "content": [
        {
            "text": "In 2023, the Higher Education (Freedom of Speech) Act became law. Due to concerns from vulnerable groups about how the rules might harm student welfare, we are stopping the implementation of the Act. "
        },
        {
            "text": "This means that although the Act received Royal Assent last year, the government will no longer be bringing it into force. The Education Secretary will consider options for the Act, including repeal, in the longer term.  "
        },
        {
            "heading": 3,
            "text": "What is the Higher Education (Freedom of Speech) Act 2023 and why are you stopping its implementation?"
        },
        {
            "text": "The implementation of the Higher Education (Freedom of Speech) Act 2023 has been stopped due to concerns that the legislation was potentially damaging to student welfare. "
        },
        {
            "text": "When bills, or proposed laws, become Acts, commencement regulations are needed for them to be legally enforced. It is these commencement regulations that are being stopped.  "
        },
        {
            "text": "The Act requires universities, colleges and students’ unions in England to take steps to ensure lawful freedom of speech on campus.  "
        },
        {
            "text": "However, there is widespread concern about the negative impact of the Act from vulnerable groups. For example, there are fears that the legislation could protect those using hate speech on campuses, and that it could also push providers to overlook the safety and well-being of minority groups, including Jewish students.  "
        },
        {
            "text": "There are also fears the Act could expose higher education providers, like universities, to costly legal action that would impact teaching and learning. "
        },
        {
            "heading": 3,
            "text": "What happens next?"
        },
        {
            "text": "We committed to protecting freedom of speech on campus and the Secretary of State will confirm the government’s long-term plans in due course.  "
        },
        {
            "text": "Sir David Behan has also been appointed as the interim chair of the Office for Students (OfS) to refocus its mission."
        },
        {
            "text": " While the OfS previously had a role in enforcing the Freedom of Speech Act, it will now focus on tackling financial security for universities and boosting outcomes for students, alongside strengthening protections against harassment and sexual misconduct on campus. "
        },
        {
            "text": "We will work closely with Sir David Behan and the refocussed Office for Students (OfS), to achieve financial sustainability in the higher education sector and improve student outcomes. "
        },
        {
            "heading": 3,
            "text": "How are you continuing to protect free speech on campus?"
        },
        {
            "text": "Existing protections remain in place for free speech on campus and we continue to support the current legal duty on higher education providers to secure freedom of speech.  "
        },
        {
            "text": "Additionally, the OfS is planning to introduce strengthened protections against the use of Non-Disclosure Agreements (NDAs) in cases of harassment and sexual misconduct, to improve support for student safety and well-being. "
        }
    ]
}