{
    "url": "https://naturalengland.blog.gov.uk/2024/07/26/holme-fen-national-nature-reserve-peatland-restoration-project/",
    "title": "Holme Fen National Nature Reserve peatland restoration project",
    "authors": [
        "Catherine Weightman"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "National Nature Reserve",
        "Nature Recovery",
        "Peat"
    ],
    "pub_date": "2024-07-26T16:58:44+01:00",
    "content": [
        {
            "text": "By Catherine Weightman, Natural England’s Senior Project Manager for Peatland Restoration in the Fens - West Anglia Team  "
        },
        {
            "text": "I’ve been working for Natural England and its predecessors for more than twenty years. I’m currently working on peatland restoration in the Fens, in particular at Holme Fen National Nature Reserve (NNR) in Cambridgeshire which is part of the Great Fen. "
        },
        {
            "text": "Holme Fen "
        },
        {
            "text": "Natural England owns Holme Fen, and it’s a very important site for us because it was one of the first National Nature Reserves to be designated. Years of drainage for nearby agriculture has dried out the peat here, causing greenhouse gases to be released and habitats for important species to disappear. So we’re hoping to re-wet Holme Fen to preserve the remaining peat and restore habitats for nature. "
        },
        {
            "text": "The impact of peat loss "
        },
        {
            "text": "Historically, fenlands started being drained because they become really fertile agricultural land when dry. Pre-drainage, Holme Fen would have been a raised bog of about six metres of wet, spongy peat. Peat loss across the whole fenland basin has been huge. We should really be able to squeeze the water out of peat, but now it’s very dry here."
        },
        {
            "text": "At Holme Fen, the surrounding area was extensively drained in the 1850s. At the time, the landowner foresaw the impact on peat, so he installed a post to measure the shrinkage. The post was pushed into the wet peat and the top was flush with the ground. Since 1851, over four metres of peat has been lost and the posts (a second post was installed later) are now very visible above ground. The shrinkage has started to slow down but it’s still reducing by about 9mm a year. "
        },
        {
            "text": "Peat is incredible at storing carbon. Peat is formed very slowly over thousands of years through the accumulation of plant material. There’s so much more carbon held in peat than a tropical rainforest because peat is solid and dense, so we’re trying to keep our remaining peat here. Preventing further greenhouse gas emissions is so important as climate change worsens.  "
        },
        {
            "text": "Re-wetting the Fen "
        },
        {
            "text": "We can’t have one of our first established National Nature Reserves just drying out. People admire the silver birch trees and numerous species of fungi at Holme Fen, but that’s not what this site is important for - it should never have been a dry habitat.  "
        },
        {
            "text": " To restore the wetland habitat and reduce peat shrinkage, we want to raise the water level in the existing drainage ditches. To do this we plan to install sluice gates to move water around the fen, and a water storage area so we can keep the area wet during dry summers. After some final modelling, we will apply for planning permission later this year.  "
        },
        {
            "text": "Nature recovery "
        },
        {
            "text": "In the fenlands area there are 13,500 species, but a lot of them are confined to the small remaining areas of suitable habitat such as Holme Fen, so we need to create a bigger habitat if we are seriously going to do nature recovery.  Great Fen seeks to restore the land between Holme Fen and another neighbouring reserve, Woodwalton Fen NNR, to create one larger block of land for wildlife to thrive. "
        },
        {
            "text": "It’s easy to assume that rewilding involves just letting nature do its thing, but we have to really manage the site carefully. We’ve got so many precious species just hanging on here with very little resilience due to changing weather patterns. "
        },
        {
            "text": "At Holme Fen we hope to see the return of nightingales, spoonbills, and species of moths, beetles and plants that are specific to these wetland habitats. Wildlife doesn’t come back instantly, but wetlands are some of the quickest habitats to create, rather than a habitat like an ancient woodland. In 50 years’ time, you will see a changed landscape at Holme Fen and hopefully more species thriving. "
        },
        {
            "text": " Working together "
        },
        {
            "text": "Natural England can’t do all this alone – we ‘re part of the Fens East Peat Partnership alongside the Wildlife Trusts, National Trust and RSPB. To help us deliver our conservation plans, we’ve been awarded a Peatland Restoration Grant from Defra’s Nature for Climate Fund. We also work with partners including the Environment Agency, Internal Drainage Board and the local council. "
        },
        {
            "text": "Engaging with farmers is vital. Holme Fen is surrounded by farmland, and restoring wetlands will bring changes to farming practices. Many farmers have been very open to change, especially family farms now being run by the next generation, but they have to think about income for their families. "
        },
        {
            "text": "To find solutions, we’re working closely with Fenland SOILs, a farmer-led organisation looking into which crops will grow in a higher water table. They’re also looking into regenerative farming and how to reduce emissions while making an income.    "
        },
        {
            "text": "Through this project, we’re working to keep water in the fens, rather than letting it being pumped out into the sea. We need water for farming, wildlife, and people, especially in areas with growing water scarcity issues. Water is such a precious commodity and we don’t value it enough. "
        }
    ]
}