{
    "url": "https://ukhsa.blog.gov.uk/2024/07/26/how-you-can-help-us-resist-the-tiger-mosquitos-conquest-of-europe/",
    "title": "How you can help us resist the tiger mosquito’s conquest of Europe",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Zoonoses"
    ],
    "pub_date": "2024-07-26T16:13:30+01:00",
    "content": [
        {
            "text": "As our world becomes increasingly interconnected and the climate changes, the UK faces challenges that we might associate with more exotic destinations. One such challenge is the potential introduction of invasive mosquito species, particularly the tiger mosquito (Aedes albopictus). This small but formidable insect is causing concern among public health officials across Europe, and for good reason."
        },
        {
            "text": "The UK Health Security Agency's Medical Entomology and Zoonoses Ecology (MEZE) team is at the forefront of monitoring and responding to this emerging threat. Their work involves assessing the risks posed by arthropods – primarily ticks and mosquitoes – that can act as vectors for disease transmission."
        },
        {
            "heading": 2,
            "text": "Why the concern over the tiger mosquito?"
        },
        {
            "text": "The tiger mosquito is not just any mosquito. It's highly adaptable, capable of breeding in both natural and artificial water containers, and unlike many of its counterparts, it bites during the day. What's more, its eggs can survive frost, allowing it to potentially establish itself in cooler climates. It was initially named the Asian tiger mosquito but is now called the tiger mosquito due to its distribution far beyond the continent where it was first identified."
        },
        {
            "text": "This mosquito has already spread across much of mainland Europe and has been implicated in outbreaks of dengue, chikungunya, and Zika viruses. In 2022, it was responsible for over 60 cases of dengue in the South of France, and in 2023, 3 locally acquired dengue cases were reported in Paris."
        },
        {
            "text": "Tiger mosquitoes have not yet become established in the UK."
        },
        {
            "heading": 2,
            "text": "What is the risk of catching dengue fever in Europe?"
        },
        {
            "text": "Global case numbers of dengue fever are very high due to a large outbreak in South America and the Caribbean, which is expected to result in more cases imported to Europe. This could lead to higher numbers of locally transmitted cases this summer."
        },
        {
            "text": "The overall risk of vector-borne disease for UK travellers in mainland Europe remains low and is considerably lower than travel to other parts of the world where it is endemic. However, there is a risk that patients and medical practitioners will dismiss any possibility of catching dengue fever in Europe and fail to identify symptoms."
        },
        {
            "text": "To avoid being bitten by a mosquito:"
        },
        {
            "heading": 2,
            "text": "The UK's battle against invasive mosquitoes"
        },
        {
            "text": "The MEZE team coordinates a national surveillance programme to detect any incursions of the tiger mosquito into the UK. This effort involves collaboration with local authorities and other government agencies (including the Animal and Plant Health Agency), with over 115 surveillance sites and more than 1,100 traps deployed in 2024."
        },
        {
            "text": "The surveillance focuses on potential entry points such as seaports, ferry terminals, distribution centres, and lorry parks – anywhere the mosquito might hitch a ride into the country. Climate modelling suggests that parts of South East England, particularly around London, may already have suitable conditions for the mosquito's survival, prompting intensified surveillance in these areas."
        },
        {
            "heading": 2,
            "text": "What happens when invasive mosquitoes are detected?"
        },
        {
            "text": "When eggs of invasive mosquitoes are found, a cross-government contingency plan is triggered. The MEZE team deploys to the site, sets up enhanced surveillance, and provides control advice to local authorities. Environmental Health Officers then work with landowners and businesses to remove potential habitats and apply control measures where necessary."
        },
        {
            "text": "Since 2016, this approach has successfully detected invasive mosquitoes in 7 locations in South East England, preventing their establishment each time."
        },
        {
            "heading": 2,
            "text": "International collaboration"
        },
        {
            "text": "The MEZE team is part of VectorNet, a European network that coordinates data sharing among medical and veterinary entomologists. This collaboration keeps the UK informed about developments across the continent and helps in preparing for potential threats."
        },
        {
            "heading": 2,
            "text": "How can you help?"
        },
        {
            "text": "The MEZE team operates a citizen science mosquito recording scheme, encouraging the public to send photos of mosquitoes for identification. They're particularly interested in potential sightings of tiger mosquitoes or reports of unusual biting issues."
        },
        {
            "text": "While the risk of vector-borne diseases in the UK remains low, vigilance is key. As our climate changes and global travel increases, the work of the MEZE team and their partners becomes ever more crucial in protecting public health."
        },
        {
            "text": "By staying informed and participating in citizen science efforts, we can all play a part in safeguarding the UK against these tiny but potentially dangerous invaders."
        }
    ]
}