{
    "url": "https://forestrycommission.blog.gov.uk/2024/07/26/into-the-woods-growing-up-with-the-trees/",
    "title": "Into the woods: growing up with the trees",
    "authors": [
        "Faye Dawson"
    ],
    "categories": [
        "Into the woods series",
        "Tree planting",
        "Wellbeing"
    ],
    "pub_date": "2024-07-26T12:00:53+01:00",
    "content": [
        {
            "text": "Growing up I always took trees for granted. My earliest memories are of complaining about visiting Westonbirt Arboretum again (the irony is not lost on me that I went on to work for the organisation that manages it!) or going for walks in our local woodlands. So it was unsurprising when my parents purchased a house near Bath with some land and decided to plant a small woodland in the winter of 1988/89."
        },
        {
            "text": "The original plans were for a main planting block at the top of the field along with hedgerow trees on the south side and a central block, but the latter was replaced with an orchard towards the bottom instead. Measuring just 2000 square metres, the main block was small but planted with a wide range of different species including field maple, wild cherry, poplar, and ash."
        },
        {
            "text": "Over the years the view from our garden changed as the trees grew and matured, and it wasn’t long before they grew bigger than me. My childhood was spent playing in the field and the wood, waiting impatiently for the trees to grow big enough to climb. It’s only now that I can look back and appreciate what having that space to play in and enjoy did for me and my appreciation of nature."
        },
        {
            "text": "As I got older the woods became a backdrop for many of my core memories. My wedding reception was held in the field and my husband and I escaped to the woods for our first photographs. My children were introduced to them from an early age and they have spent many happy times there building dens, picking flowers and climbing trees."
        },
        {
            "text": "And when my father died nine years ago he made it clear that it was of great importance that the wood remain in the family as a legacy to continue to be enjoyed."
        },
        {
            "text": "As with many woodlands, the years since planting have seen some changes due to mammal damage and diseases, but management of the site and replanting have helped it continue to flourish."
        },
        {
            "text": "Some smaller trees and shrubs died off as the bigger, slow growing trees started to take over and honeysuckle, bluebells and wild garlic were planted along with replacement native trees, a wild pear and three walnut trees."
        },
        {
            "text": "There are a few entrances into the wood from the field. Some small and hidden between branches, my favourite ones as a child, but towards the right-hand side there’s a larger opening framed by trees. As you approach this entrance a large goat willow stands in front of you that in recent years has become the starting point of races and treasure hunts, marked with a fairy door that hints at magic in the trees."
        },
        {
            "text": "Turning left the path winds through the centre of the wood, through carpets of wild garlic and bluebells in the spring, you can catch glimpses of the field in which it stands, beyond the leaves. Sounds from the country road behind and the village beyond reach you but there’s a quietness and stillness as you walk that isolates you from everything. It’s here I can catch my breath and slow down my thoughts and despite growing up with fairytales with dark woods and hidden monsters, I have only ever felt calm here."
        },
        {
            "text": "I will never again take trees for granted. I feel very lucky to have grown up in such a beautiful place with an abundance of nature on my doorstep, and can now appreciate how important it is that everyone is able to have access to nature in some way."
        },
        {
            "text": "Our family woodland is more than just a piece of land; it’s a place we can connect with our roots and be reminded of our childhood. It’s a space for outdoor activities, education and play, and quiet reflection, where nature can be appreciated and enjoyed."
        },
        {
            "text": "It stands as a testament to my parents love of the outdoors and a reminder of the importance of preserving a piece of nature for future generations."
        }
    ]
}