{
    "url": "https://moderncivilservice.blog.gov.uk/2024/10/09/celebrating-one-year-of-innovation-project-simplifys-digital-makeover/",
    "title": "Celebrating one year of innovation: Project Simplify’s digital makeover",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Innovation",
        "One Big Thing",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-10-09T10:21:14+01:00",
    "content": [
        {
            "text": "Starting as a six-week sprint for quick improvement wins, the success of the Department for Business and Trade’s Simplify initiative brought a new challenge - how to manage a wealth of ideas from across the department."
        },
        {
            "text": "Launched in July 2023 by Permanent Secretary, Gareth Davies, Simplify gave colleagues the opportunity to identify areas of improvement or to put forward proposals on how to get things done more quickly or easily. "
        },
        {
            "text": "Anyone, in any role or grade, can make suggestions about processes and ways of working with the aim to remove barriers to delivery."
        },
        {
            "text": "More than a year on, Simplify has received innovative ideas from colleagues working in every part of the department. A third of these suggestions have been delivered or have a plan for delivery."
        },
        {
            "heading": 3,
            "text": "Simplify’s quick wins "
        },
        {
            "text": "Wins include everything from quick improvements to working spaces, such as more private pods in our regional hubs, to a long-term project to overhaul onboarding processes, speeding up time to hire."
        },
        {
            "text": "Victoria Edwards, Simplify and Continuous Improvement Lead, said: “The scale of suggestions means Simplify has transformed from an initial six-week sprint to a business-as-usual improvement programme.  "
        },
        {
            "text": "“We’ve been able to keep colleagues engaged and submitting suggestions for the longer term. As a result, we’re often scoping more complex changes, cutting across teams – particularly our core corporate services – so we needed a more effective process.”"
        },
        {
            "heading": 3,
            "text": "A system for Simplify "
        },
        {
            "text": "Initially the Simplify team managed suggestions via email and a manually updated tracker on a spreadsheet. This summer, they created the digital Simplify Management System (SMS). "
        },
        {
            "text": "The whole suggestion process became automated, moving to a digital form for colleagues to enter their ideas. The team scoped how they could visualise the data and store suggestions so that they could be viewed on demand, making best use of existing digital tools. "
        },
        {
            "text": "It’s now easier to track ideas, real time reporting and an improved ‘customer journey’. "
        },
        {
            "text": "Victoria added: “Automating the Simplify suggestion process has made a huge difference to the Simplify workstream, freeing up more time to engage with our delivery teams.  "
        },
        {
            "text": "“The dashboard allows us to analyse trends across the organisation, to see where change is happening and where it is needed. "
        },
        {
            "text": "“It also feels like the data is now working for our stakeholders. The Simplify Management System is a collaborative tool to exchange ideas, and creative solutions, for the benefit of all colleagues.”  "
        },
        {
            "text": "Find out more about the launch of Project Simplify. "
        },
        {
            "heading": 3,
            "text": "Supporting innovation "
        },
        {
            "text": "This Autumn, the Department for Business and Trade will be taking part in the cross-government One Big Thing initiative which will focus on how small changes can add up to a big overall impact. "
        },
        {
            "text": "The department wants to build on the successes achieved together in Simplify’s first year by creating a culture of innovation."
        },
        {
            "text": "Victoria said: “Colleague suggestions have been inspiring and demonstrate a shared commitment to making small changes to get better results overall. It shows just how innovative a department can be when everyone has the opportunity to share their ideas.” "
        },
        {
            "heading": 3,
            "text": "Make it simple"
        },
        {
            "text": "Here are the Simplify team’s top tips for encouraging bright ideas:"
        }
    ]
}