{
    "url": "https://forestrycommission.blog.gov.uk/2024/10/09/cultivating-resilient-trees-and-woodlands-in-london-a-model-for-all/",
    "title": "Cultivating resilient trees and woodlands in London: a model for all",
    "authors": [
        "Richard Cobb"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree health",
        "Urban trees"
    ],
    "pub_date": "2024-10-09T10:00:00+01:00",
    "content": [
        {
            "text": "Trees and woodlands are one of our most effective tools for tackling the climate and nature crisis and deliver many other benefits [1], but they’re at huge risk from climate change and pests and diseases."
        },
        {
            "text": "The London Urban Forest Resilience Project has been investigating the challenge. Our new report [2] shows what policy makers, funders, local authorities and tree professionals can do – in London and beyond."
        },
        {
            "text": "I’ll share some of the key findings to show how the impacts of climate change, pests and diseases can be assessed and managed. The project has made it clear that we need to do more to safeguard the urban trees we have and the new ones that many are working hard to establish, and Local Authorities will need support and resource to manage them."
        },
        {
            "heading": 2,
            "text": "Why London?"
        },
        {
            "text": "London boasts a broad diversity of tree and woodland types that inform an integral part of the city’s landscape. They weave their way through and around the capital from understated oases among dense urban living to the vast and prestigious."
        },
        {
            "text": "London’s urban forest consists of 8 million trees; in royal and public parks, along streets, rivers, road, canals and railway, copses and woodlands from brand-new to ancient, hedgerows, gardens and more. In other words, a microcosm for much of the variety that we find across England."
        },
        {
            "text": "The infographic above represents where London's trees are:"
        },
        {
            "text": "The report analysed the vulnerability of London’s top 10 most common street trees, which accounts for 35% of the capital’s overall street tree population. While London- and street-tree focused, this report provides lessons and a robust model that can be adapted to other settings, and to all other component parts of a local tree population."
        },
        {
            "heading": 2,
            "text": "The threat of climate change to London's trees"
        },
        {
            "text": "London and the surrounding areas in the south of England are anticipated to be among the first and most severely affected by climate change (Forest Research). As highlighted in the London Climate Resilience Review, the impacts of climate change are already being felt and will only become more prevalent in the future with more droughts, extreme wind, wildfires and expanding pests and diseases."
        },
        {
            "text": "A snapshot of some of the key anticipated changes is provided below (CHELSA):"
        },
        {
            "text": "We rated the risk that threats such as drought, flooding and wind present to London’s top 10 most common street tree species, using multiple sources. This assessment considered two climate scenarios: one where CO2 emissions are limited (RPC 4.5) versus a business-as-usual scenario (RPC 8)."
        },
        {
            "text": "Our findings are sobering:"
        },
        {
            "heading": 2,
            "text": "The threat of pests and diseases to London's trees"
        },
        {
            "text": "Pests and diseases are also a serious threat. This is not a new challenge, but its impact is compounded with the added stress changing climate will impose onto trees and the likely increase of new pests and diseases able to thrive in the UK. We only have to look at the likes of ash dieback to see the devastating impact that just one disease can have."
        },
        {
            "text": "The Forestry Commission, Forest Research, and the wider sector have been working hard on these challenges for a long time including proactive efforts to monitor, manage and prevent the spread of pests including those relevant to London such as Ash dieback, Ips typographus and oak processionary moth."
        },
        {
            "text": "The report shows that collectively the top 10 most common street tree species in the capital are vulnerable to 51 pests and diseases deemed to represent a ‘medium’ or a ‘high risk’ in the UK Plant Health Register. Four of these are already present in London while seven more are known to be present elsewhere in the UK."
        },
        {
            "text": "Even with mitigation measures in place, about 15 of these pests and diseases would continue to represent ‘medium’ or ‘high’ risks."
        },
        {
            "text": "Between the time of producing the report and releasing it, the plane lace bug tree pest has been identified on a number of London plane trees in central London, which we are investigating. This demonstrates how important it is to proactively anticipate and monitor threats as they emerge."
        },
        {
            "text": "It’s clear that tree managers will be under greater pressure in the future to dedicate more resources to pest and diseases management – either through preventative or remedial action. Prevention should pay for itself in the long run, but these are challenging economic times."
        },
        {
            "heading": 2,
            "text": "Actions to improve resilience"
        },
        {
            "text": "The report fulfils two commitments in the London Urban Forest Plan (LUFP) [3]. First, to assess the threats of pests and diseases and climate change on London’s urban forest. And second, to develop a set of principles for improving resilience to these threats."
        },
        {
            "text": "We’ve outlined best practice guidance and practical actions to enhance urban forest resilience in the report. This was informed by an extensive literature review, national and local data, insights from local stakeholder workshops and expert peer review."
        },
        {
            "text": "To help support effective local and landscape-scale action, the report provides some practical recommendations on key good practices and principles to guide this journey including:"
        },
        {
            "heading": 2,
            "text": "Change will take time"
        },
        {
            "text": "Establishing and expanding the next generation of trees is crucial but they will take time to deliver the same benefits that mature trees already provide, which also represent the vast majority of the total treescape."
        },
        {
            "text": "The message is clear – more attention and support is needed for tree management if the long-term value of these assets is to be secured for more sustainable, climate-resilient and healthier places to live and work [1]."
        },
        {
            "heading": 2,
            "text": "References"
        },
        {
            "text": "[1] Research has been carried out to try and illustrate how much value the ‘ecosystem services’ trees provide in monetary terms; £133 million of value for London every year (Greater London Authority, 2018), £3.8 billion for individual trees outside woodlands in the UK (Forest Research, 2022),  an asset value of £382 billion for UK woodlands and a total annual value of £10 billion (ONS, 2024)."
        },
        {
            "text": "[2] The full report can be found in the London Urban Forest Resource Hub. Treeconomics were contracted by the Forestry Commission, supported by Mayor of London and London Tree Officers Association, to carry out the project and author this report which involved extensive literature review, stakeholder engagement and expert peer review (see Acknowledgements and Consultation sections in the report)."
        },
        {
            "text": "[3] London Urban Forest Plan (2020)."
        },
        {
            "text": "[4] Met Office (2022) UK Climate Resilience: London City Pack."
        }
    ]
}