{
    "url": "https://kingsawards.blog.gov.uk/2024/10/09/luminous-show-technology-kings-award-for-international-trade-recipient/",
    "title": "LUMINOUS Show Technology – King's Award for International Trade recipient",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-10-09T10:09:57+01:00",
    "content": [
        {
            "text": "LUMINOUS are leading manufacturers of special effects hardware."
        },
        {
            "text": "“Winning The King’s Award for Enterprise in International Trade is a momentous occasion for the team, and we are immensely proud of this achievement. It serves as confirmation of our dedication to excellence and innovation and inspires us to continue shining brightly in the global market.” Mike Badley, Director (pictured on the left in the below photo). "
        },
        {
            "text": "“LUMINOUS designed and built the phenomenal flame systems and a multitude of new technologies. They engineer and fabricate in-house and are extraordinary.” – Markus Maurette, SFX Supervisor at Harry Potter & The Cursed Child in North America"
        },
        {
            "text": "Why did you apply for the Awards?"
        },
        {
            "text": "LUMINOUS applied for The King’s Awards to establish ourselves as a premium business and gain prestigious recognition for our exciting industry. We’re tucked away in Devon and not many people know we supply equipment to some of the world’s biggest events, so we thought The King’s Awards could help to increase awareness of the business."
        },
        {
            "text": "Why did you choose to apply for the International Trade category?"
        },
        {
            "text": "LUMINOUS applied to the category for International Trade because it represents our unique relationships with the entertainment industry worldwide. It also outlines our substantial growth in the face of many challenges. Just a few years prior, in response to COVID-19, we transformed the business into manufacturing PPE as the live events industry stood still. We quickly bounced back to doing what we do best and have exceeded expectations. We have provided equipment for events all around the world, such as Disney’s touring productions, the Commowealth Games in Birmingham, Terhal by Dragone in Saudi Arabia, and Harry Potter & The Cursed Child theatre shows across the USA, Canada, Germany, Japan, and Australia."
        },
        {
            "text": "How did you find the application process?"
        },
        {
            "text": "The application process for the King's Award for Enterprise was clear and well-structured. The guidelines provided were easy to follow, making the submission straightforward. However, the period of waiting for a decision was undeniably nerve-wracking. Given the significance of the award, we were eager to hear the outcome and anxious to know if our efforts had been recognised. Despite the anxiety of waiting, the process itself was efficient and allowed us to effectively showcase our accomplishments."
        },
        {
            "text": "How do you and your team feel about receiving the Award?"
        },
        {
            "text": "Receiving the King’s Award is the royal stamp of approval for LUMINOUS. We feel proud to be recognised at this level as it validates the team’s hard work, creativity and passion that we pour into each project. As the award is acknowledged globally, it adds credibility to our trading relationships and reinforces our position as premium manufacturers. We hope this award opens up new opportunities for growth and helps to inspire the team to keep pushing boundaries."
        },
        {
            "text": "Has your business received any government support (such as an Innovate UK grant etc.) either before or after applying?"
        },
        {
            "text": "We received the Innovate UK Smart Grant in 2022 for new immersive technology designed for Location Based Entertainment VR and other augmented attractions. LUMINOUS developed FXMotion, an interactive control system that enables users to control various real-world and digital devices through simple body movements."
        },
        {
            "text": "Links:"
        },
        {
            "text": "Instagram: https://www.instagram.com/luminousshowtech/ @luminousshowtech"
        },
        {
            "text": "Facebook: https://www.facebook.com/luminousshowtech/"
        },
        {
            "text": "LinkedIn: https://www.linkedin.com/company/luminousshowtech/"
        }
    ]
}