{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/09/renters-rights-bill-takes-a-crucial-step-forward-with-second-reading-in-parliament/",
    "title": "Renters’ Rights Bill Takes a Crucial Step Forward with Second Reading in Parliament",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-10-09T17:43:36+01:00",
    "content": [
        {
            "text": "Today, our Renters’ Rights Bill returned to Parliament for the Second Reading, less than a month since it was first introduced. This will be the first time MPs will debate the Bill, as these much-needed protections for renters take another step closer to becoming law."
        },
        {
            "text": "The Housing Minister, Matthew Pennycook, spoke to Vicky Spratt, Housing Correspondent from inews detailing key aspects of the Bill and what they will mean for the 11million private renters. The Minister was clear that the Bill will stamp out discrimination in the sector, where often renters with children, or in receipt of benefits are turned away. He also expanded on other protections, including the end to rental bidding wars, banning section 21 evictions, stopping unfair rent hikes and how these ambitious reforms will be implemented once the Bill is in law."
        },
        {
            "text": "Minster Pennycook said “What we are going to do through this Bill is strength provisions, and clamp down on the over-abuse in terms of discrimination…If landlords think they can get around this bill… they’re wrong.”"
        },
        {
            "text": "There was also widespread coverage from The Independent, The Evening Standard, Inside Housing and Housing Today focusing on its ability to strengthen tenants' rights. Noting the swift passage on the Bill, this underscores the determination to deliver these protections as quickly as possible."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said: "
        },
        {
            "text": "“I am determined to get this Bill in to law as soon as possible. The thousands of children and families living in unsafe housing or under the cruel threat of a Section 21 eviction notice have been waiting far too long already.”"
        },
        {
            "text": "“We will deliver on our promise to renters and transform the sector into one where families can put down roots, where children can grow up in healthy homes, and where young people can save for their future.”"
        }
    ]
}