{
    "url": "https://naturalengland.blog.gov.uk/2024/10/09/state-of-natural-capital-report-for-england-published-today/",
    "title": "State of Natural Capital Report for England published today",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Evidence",
        "Natural Capital",
        "Natural England",
        "Nature Recovery"
    ],
    "pub_date": "2024-10-09T10:00:00+01:00",
    "content": [
        {
            "text": "The State of Natural Capital Report for England 2024 : Risks to nature and why it matters, a new report from Natural England, is published today, 9th October 2024. "
        },
        {
            "text": "The economy and society are intimately dependent on the health of the natural environment. Indeed, the Dasgupta Review demonstrated how the economy is embedded in nature and how critical the links are with nature and our ongoing wealth and prosperity.   This relies on nature being in good working order. "
        },
        {
            "text": "Healthy functioning ecosystems are more resilient and adaptive to change and are more productive, providing us with a wide range of benefits that we rely on.  These benefits include clean air and water, health and wellbeing and helping us adapt to climate change amongst many others. These all in turn contribute to society and the economy."
        },
        {
            "text": "Given the importance of nature, why is it still declining?  One critical reason is that it is often missing in decision making even if its relevant.  Nature is therefore invisible, unaccounted for and we all suffer the consequences. "
        },
        {
            "text": "For years now we have taken more from nature than it can supply sustainably.  We are in effect running down our assets and we are beginning to see some serious consequences of that, through the impacts of climate change for example. "
        },
        {
            "text": "Making the invisible, visible"
        },
        {
            "text": "The State of Natural Capital Report for England seeks to provide the information on nature decision makers need so that they can include it. It describes why nature is relevant to broad policy areas – making the invisible visible and providing the missing evidence needed.  The report assesses the state of our natural capital in relation to its ability to continue to provide us with the benefits we rely on, it describes the risks that we are carrying and points to what we can do about it. "
        },
        {
            "text": "The State of Natural Capital Report in a nutshell:"
        },
        {
            "text": "Assesses risk to England’s natural capital based on past and ongoing impacts on ecosystems and the benefits they provide."
        },
        {
            "text": "Highlights the consequences of this risk on policy areas that are most dependent on the benefits from nature."
        },
        {
            "text": "Identifies priority actions to mitigate the risks, through reducing pressures and large-scale ecosystem restoration."
        },
        {
            "text": "Shows how the evidence and analysis can be used to bring the state of natural capital into decision making across government."
        },
        {
            "text": "Action for nature is urgent"
        },
        {
            "text": "This report demonstrates how risk to our ecosystems, is a risk to society and the economy. But we need to work with ambitious urgency."
        },
        {
            "text": "Tony Juniper says: “Tackling the Nature crisis will require action across all sectors to reduce risks to society. This report is your guide to action. I encourage you to read it, use it, and secure the benefits Nature provides into the future, not just for yourself but for society as a whole and the natural world which sustains us.”"
        },
        {
            "text": "What’s in the report?"
        },
        {
            "text": "Natural England’s Natural Capital team can be contacted by email to discuss what this report might mean for you."
        },
        {
            "text": "The State of Natural Capital report and underpinning technical reports and data are out now on the Access to Evidence catalogue, A recording of the launch event will be available soon. "
        }
    ]
}