{
    "url": "https://mhclgmedia.blog.gov.uk/2024/09/20/building-safety-remediation-august-data/",
    "title": "Building Safety Remediation: August data",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Building safety"
    ],
    "pub_date": "2024-09-20T16:30:11+01:00",
    "content": [
        {
            "text": "Yesterday (19th September), we published the August Building Safety Remediation data which received some national coverage."
        },
        {
            "text": "The Daily Mirror and The Daily Mail  have run straight coverage of the data, noting that there has been a rise in the number of buildings that have been identified as having unsafe cladding."
        },
        {
            "text": "Building Safety Minister, Rushanara Ali, is quoted in both pieces from her speech in the commons last week and her post on X, pointing out that the pace of remediation has been 'too slow' and building owners have the responsibility to fix their buildings. Coverage also relays how the Government is taking action to ensure dangerous buildings are urgently dealt with."
        },
        {
            "text": "Coverage can also be seen online in Sky News who provide a thorough breakdown of the statistics, and the government's plans to invest £5.1bn into removing unsafe cladding."
        },
        {
            "text": "A Ministry of Housing, Communities & Local Government spokesperson said:"
        },
        {
            "text": "“The progress on remediation has been too slow – and this government is taking action to ensure that dangerous buildings are urgently dealt with."
        },
        {
            "text": "“The full force of government will be brought to bear to make sure building owners fix this andpeople have the safe and secure homes that they deserve."
        },
        {
            "text": "\"We are ramping up work with regulators and local authorities and using new tools to identify properties with plans to accelerate the pace of remediation to be announced in the autumn.”"
        }
    ]
}