{
    "url": "https://insidehmcts.blog.gov.uk/2024/09/20/classroom-to-the-court-room/",
    "title": "Classroom to the court room",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "Podcast",
        "Training and support",
        "Working at HMCTS"
    ],
    "pub_date": "2024-09-20T13:31:51+01:00",
    "content": [
        {
            "text": "The latest Inside HMCTS podcast offers an insightful look into the collaboration between HMCTS and the University of Reading, providing law students with valuable real-world experiences in the criminal justice system."
        },
        {
            "text": "Join us as we meet District Judge Sam Goozee, Senior Legal Manager Rachel Newman, and Associate Professor Liz Conaghan as they delve into the joint outreach programme that allows students to observe court proceedings, participate in mooting, and gain firsthand experience in legal roles within HMCTS."
        },
        {
            "text": "Listeners will also hear from students Amber Farmer and Zahra Navarro, who share their personal experiences and the impact of the programme on their career aspirations."
        },
        {
            "text": "This episode is a must-listen for anyone interested in the legal profession, offering a unique perspective on the opportunities available within HMCTS and the importance of practical experience in legal education."
        },
        {
            "text": "Tune in now to discover how we’re helping to shape the future of legal professionals and how this important work is making a significant difference in the lives of university law students. "
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": "A transcript of the podcast is also available here."
        }
    ]
}