{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/09/20/new-chief-social-worker-and-mental-health-social-work-lead-appointed/",
    "title": "New Chief Social Worker for Adults and Mental Health Social Work lead appointed",
    "authors": [
        "Michelle Dyson"
    ],
    "categories": [
        "Mental health",
        "Our profession"
    ],
    "pub_date": "2024-09-20T13:38:25+00:00",
    "content": [
        {
            "text": "I am delighted to announce the appointment of a new Chief Social Worker for Adults and a Mental Health Social Work lead to the Department of Health and Social Care."
        },
        {
            "heading": 2,
            "text": "Chief Social Worker"
        },
        {
            "text": "Sarah McClinton will be joining us in January 2025 as the Chief Social Worker."
        },
        {
            "text": "As Chief Social Worker, Sarah will be the head of profession, the public face of adult social work in England and a senior leader within the Department. Sarah will work with colleagues across DHSC, including Ministers, to provide expert advice on all matters relating to social workers and social care practice. She will offer a frontline perspective on issues to inform policymaking and will maintain her already established strong links with the adult social care sector."
        },
        {
            "text": "Sarah is currently in post as deputy Chief Executive and Director of Health and Adult Services in the London Borough of Greenwich. She is also the Place Executive Director on the  Southeast London Integrated Care Board, an integrated role which sits across the local authority and health system.  She was previously President of the Association of Directors of Adult Social Services (ADASS) and has worked in DHSC as Director for Mental Health, Learning Disabilities and Dementia."
        },
        {
            "text": "Speaking of her appointment, Sarah said:"
        },
        {
            "text": "“I am delighted to be appointed to this important role towards the beginning of a new government and look forward to working closely with colleagues both inside and outside the Department”."
        },
        {
            "heading": 2,
            "text": "Mental Health Social Work Lead"
        },
        {
            "text": "Robert Lewis joins us, on secondment, as the Mental Health Social Work (MHSW) Lead. He succeeds Jason Brandon who finished his time at the Office for Chief Social Worker (OCSW) on the 29 May."
        },
        {
            "text": "As MHSW lead, Robert will be working jointly across the Office of The Chief Social Worker and DHSC’s Mental Health Policy team. Robert will be working closely with colleagues and stakeholders to improve social work in mental health services across all settings including local authorities, NHS trusts and Voluntary Community and Social Enterprise sector. He will also support sustainability of the Approved Mental Health Professional (AMHP) workforce."
        },
        {
            "text": "Robert is a qualified  AMHP and will be joining us from the Devon County Council, NHS Devon Partnership Trust. He has 30 years of experience across a number of public service settings. His wide-spanning career includes working in Community Mental Health Teams, secure forensic services, services for people with a learning disability, in higher and adult supported education, and supporting family contacts in prison."
        },
        {
            "text": "Both Sarah and Robert join the Department at a busy time with a new Government at the helm. Their arrival marks an exciting opportunity to strengthen our response to challenges across the adult social care sector. Stay tuned for upcoming articles direct from both individuals and for more details on what this means for the sector."
        }
    ]
}