{
    "url": "https://nationalscreening.blog.gov.uk/2024/09/20/partners-updated-on-sma-screening-project-workstreams/",
    "title": "Partners updated on SMA screening project workstreams",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-09-20T10:46:28+01:00",
    "content": [
        {
            "text": "The SMA Screening In-service evaluation (ISE) Partnership Board held its latest meeting on 17 September, and received updates from partners, stakeholders and expert sub-groups."
        },
        {
            "text": "Results from the ISE, along with a new modelling study for the UK screening context, will inform the UK National Screening Committee’s (UK NSC’s) recommendation on whether spinal muscular atrophy (SMA), a rare inherited condition, should be screened for."
        },
        {
            "heading": 2,
            "text": "NIHR research study brief"
        },
        {
            "text": "The National Institute for Health and Care Research (NIHR) will advertise the specification for the research study that will address many of the questions the UK NSC wants the ISE to answer."
        },
        {
            "text": "Approval and publication of the research study brief is just awaiting clarification of a few points. Once the specification is advertised, the NIHR will organise a workshop with potential applicants where it will discuss the brief and ensure the proposed research is deliverable."
        },
        {
            "text": "The NIHR is also drafting a document to describe the governance arrangements once a contract has been awarded. These will include the requirement for the appointed researchers to submit 6-monthly reports to an independent steering and monitoring committee."
        },
        {
            "text": "Data and methodology sub-group chair Rachel Knowles reported that they had provided suggestions on what the NIHR workshop should cover. The sub-group has also provided detailed input into the NIHR research brief, including issues around which labs to use, study size, comparator data requirements, incidence, prevalence and the impact of screening on quality of life."
        },
        {
            "text": "At its next meeting, the data and methodology group will discuss the core monitoring requirements that will be needed to ensure an agreed pathway is adhered to throughout the running of the ISE. The group will also discuss how ISE data and monitoring arrangements would transition into business-as-usual arrangements if a final decision is made to approve a national screening programme."
        },
        {
            "heading": 2,
            "text": "Refining the ISE pathway"
        },
        {
            "text": "Detailed discussions continue on issues to resolve before the end-to-end screening pathway for the ISE can be finalised."
        },
        {
            "text": "Clinicians in the UK cannot start a specific approved treatment for SMA without knowing a baby’s SMN 2 copy number results. And, at present, screening labs cannot measure SMN 1 homozygous deletion and SMN 2 copy numbers concurrently from the same sample, although this would be the ideal scenario when the technology is available in the UK."
        },
        {
            "text": "Prof Jim Bonham, chair of the laboratory subgroup, reported that the 6 English screening labs which can test for SMA are keen to take part in the ISE, but  workload pressures will need to be factored in. Genetic labs have the technology to test for both SMN 1 deletion and SMN 2 copy numbers concurrently but their timescales for testing may be longer than the screening labs."
        },
        {
            "text": "Prof Bonham outlined the following 3 pathway options for the follow-up of SMN1 homozygous deletion results in the ISE:"
        },
        {
            "text": "The overriding pathway priority will be to ensure accurate results from both tests are available quickly so that:"
        },
        {
            "text": "The 3 options summarised above are a balance of what would currently be practical and most effective."
        },
        {
            "text": "To determine the optimum pathway option, we may need to first conduct a survey of clinical specialists to find out what timelines are feasible. The chairs of the laboratory and clinical subgroups will continue to work with clinicians on refining the pathway so it can be presented to the ISE researchers, once they have been appointed."
        },
        {
            "heading": 2,
            "text": "NHSE sets up implementation group"
        },
        {
            "text": "An NHSE implementation group has been established for the SMA screening ISE."
        },
        {
            "text": "The NHSE team is working on IT and data requirements and these will be aligned with those needed for the forthcoming implementation of a newborn blood spot screening programme for tyrosinaemia."
        },
        {
            "text": "NHSE has updated its government spending review bid to include costs for the SMA work, and it has also briefed NHS specialised commissioning services."
        },
        {
            "heading": 2,
            "text": "Generation Study"
        },
        {
            "text": "Genomics England reported on progress with the Generation Study. A total of 800 participants have been enrolled and 400 samples taken. No cases of SMA have been detected yet."
        },
        {
            "text": "The current 12-week turnaround time for Generation Study results is not suitable for SMA screening, but it is hoped these timescales will reduce."
        },
        {
            "text": "The Generation Study will report any SMA deletions and copy numbers consecutively and refer to specialist centres. The partnership board asked to see the Generation Study diagnosis and treatment pathways and protocols."
        },
        {
            "heading": 2,
            "text": "Other updates"
        },
        {
            "text": "Jo Harcombe updated the board on the work of the task and finish group that is preparing content for patient-facing information and staff training resources for the ISE."
        },
        {
            "text": "This group recently received presentations on research from the Thames Valley study and from parent perspectives which will help inform the development of materials."
        },
        {
            "text": "The group may need to reach out to additional stakeholder groups and individuals to gather more information and conduct user testing of draft resources. Draft patient and professional information materials will be brought to the partnership board for comment in due course."
        },
        {
            "text": "A workshop will be held on 26 November when the Sheffield Centre for Health and Related Research (ScHARR) will present interim results from the new modelling study it is developing on SMA screening for the UK context. Feedback from this workshop will inform the model’s assumptions and parameters."
        },
        {
            "text": "More than 30,000 babies have now been screened by the Oxford/Thames Valley based SMA newborn screening study. No more babies with SMA have been detected by the study since the previous update."
        },
        {
            "text": "The next meeting of the partnership board will be held at the end of November."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}