{
    "url": "https://ruralpayments.blog.gov.uk/2024/09/20/rpa-visit-to-the-allerton-project/",
    "title": "RPA visit to the Allerton Project",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-09-20T15:45:59+01:00",
    "content": [
        {
            "text": "In the second of a series of blogs from Customer Director Marie Hardeman, we hear about her visit to the Allerton Project with members of the RPA Customer Board. "
        },
        {
            "text": "The board, which was created in March this year, is exploring how RPA can continuously improve its service delivery for customers. Members are from across different areas within RPA. As well as sharing best practice, they look at the problems customers experience from different angles to help ensure that RPA improves its services and provides a seamless customer experience. "
        },
        {
            "text": "The Allerton Project is a 320-hectare demonstration farm based in Leicestershire that researches the effects of different farming methods on wildlife and the environment. Board members learned about the impact of different farming methods, the effect of weather, the ways they’re trying to maximise land use and about their agroforestry trials. The board also spent time discussing the wider challenges across the agricultural sector and how RPA can help its customers to deliver their outcomes."
        },
        {
            "text": "Marie explained: “at the Allerton Project they’re passionate about farming, the environment and using their research to help across the sector. What we learned from the visit can really benefit RPA by understanding the reality facing farmers and land managers. This helps us to improve our services to make things easier for our customers to access support. We found the visit really insightful and we walked around different areas of the farm to get a real feel for different land uses, the challenges faced by farmers and the ways the funding we deliver can help”."
        },
        {
            "text": "Kath Illidge, RPA’s Head of Customer Engagement and Support, also went on the visit. Having grown up on a farm she didn’t initially think there would be much she could learn, but said: “how wrong I was! At the Allerton Project they really made us think about how there are so many factors impacting agriculture, the majority of which are outside the farmer’s control e.g. climate change. This February was the wettest on record, compared with last year which was the driest - and that has a massive effect on getting crops sown, growth rates and the success of the crop. Already they’re thinking about how they’re going to feed animals through the winter months; will there be enough forage to go around? Coupled with other rising costs, especially fertiliser and fuel, this all adds to the stresses of farming\"."
        },
        {
            "text": "The Allerton Project’s work covers natural capital accounting, agri-environment schemes, regenerative farming systems and its aim is to build farmland resilience."
        },
        {
            "text": "Customer Board member Janine Christie is based in RPA’s Regulatory and Advice Service which provides farmer-focused visits for schemes. They aim to support farmers by offering greater levels of advice, guidance and signposting to help improve compliance with standards and scheme requirements. Janine’s intelligence team will be recommending different types of visits with customers. For her, it was great to get an understanding of how field visits are normally received and be able to change customers’ perceptions in a positive way."
        },
        {
            "text": "She added: “It was great to see options stacked side by side, or the impact of the same item being planted in different parts of a field using different methodology and the resultant crops (or in some cases lack of crops!) Talking about the challenges farmers face and hearing how the weather was having such a detrimental effect on the project’s planting plans wasn’t something I would have truly understood as a non-farmer, so having that as context was also useful. It’s going to sound naïve, but I was so surprised that each parcel of land could be so different – and that there could be differences within the parcel. One size doesn’t fit all was my takeaway”."
        },
        {
            "text": "Marie concluded: “As a group we spend a lot of time in offices –  so regular farm visits keep us in touch with the reality of what we’re working to achieve in partnership with the agricultural community\"."
        }
    ]
}