{
    "url": "https://defraenvironment.blog.gov.uk/2024/09/20/the-government-announces-new-uk-special-representatives-on-climate-change-and-nature/",
    "title": "The Government announces new UK Special Representatives on Climate Change and Nature",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "30by30",
        "Climate change",
        "Nature"
    ],
    "pub_date": "2024-09-20T09:56:59+01:00",
    "content": [
        {
            "text": "It's been a big week for nature as two prominent Cabinet ministers stressed its importance ahead of the upcoming biodiversity COP16."
        },
        {
            "text": "The UN Convention on Biological Diversity (CBD) is the main international forum devoted to the conservation and sustainable use of the world’s biological diversity: from genetic resources, to species, to whole ecosystems."
        },
        {
            "text": "The 16th Conference of the Parties to the CBD (COP16) will take place in Cali, Colombia, on October 21 to November 1, with 'Peace with Nature' as its central theme. "
        },
        {
            "text": "It will be the first COP since Montréal's COP15 in December 2022, where 196 countries agreed the landmark Global Biodiversity Framework, to protect at least 30% of the world’s land and ocean by 2030, and dramatically increase finance for nature.  "
        },
        {
            "text": "On Monday, Defra Secretary of State, Steve Reed, spoke at a pre-COP16 ‘send-off’ event at the Natural History Museum, held in partnership with the Colombian Embassy and WWF."
        },
        {
            "text": "Steve Reed opened his speech by stressing the importance of taking action now to restore nature, as well as working closely with the Colombian hosts to secure a successful COP16, and ‘deliver the positive outcomes we all want to see during the negotiations’."
        },
        {
            "text": "He emphasised that this starts with action at home."
        },
        {
            "text": "He set out his 3 main priorities at COP16."
        },
        {
            "text": "Firstly, to agree the final details of how we monitor and report our progress on the Global Biodiversity Framework."
        },
        {
            "text": "Secondly, to agree the details of a new global fund to share the benefits that arise when companies use genetic information derived from biodiversity in the creation of products and services."
        },
        {
            "text": "This mechanism will ensure genetic information of plants, animals and microorganisms is accessible for research and innovation, like the development of new vaccines. It will also help mobilise financial resources from the private sector."
        },
        {
            "text": "Which is part of our third priority: to increase efforts to mobilise finance from all sources - and align these with the Global Biodiversity Framework. "
        },
        {
            "text": "On Tuesday, Foreign Secretary David Lammy delivered his first major foreign policy speech at Kew Gardens."
        },
        {
            "text": "In his speech, echoing the themes of Steve Reed’s, David Lammy said that action on the climate and nature crisis will be central to all that the Foreign Office does."
        },
        {
            "text": "He said that the environmental crisis “is not some discrete policy area, divorced from geopolitics, conflict and insecurity. The threat may not feel as urgent as a terrorist or an imperialist autocrat. But it is more fundamental.”"
        },
        {
            "text": "In his speech, he announced the creation of new roles: UK Special Representatives for Climate Change and Nature."
        },
        {
            "text": "The Special Representatives will be appointed shortly. They will have extensive environmental expertise, and their role will be to amplify the UK's diplomatic engagement on climate and nature, and deepen and strengthen our partnerships internationally. "
        },
        {
            "text": "He also pledged to build a Global Clean Power Alliance – a new coalition committed to accelerating the clean energy transition globally, as part of the cross-government mission to make Britain a clean energy superpower."
        },
        {
            "text": "The Foreign Secretary also set out the importance of climate finance and ensuring that those countries on the frontline of the crisis receive more international climate finance. He said “we are pushing for an ambitious new climate finance goal focused on developing countries at COP29 in November.”"
        },
        {
            "text": "(COP29 will be the 29th United Nations Climate Change conference. COP29 will be held in Baku, Azerbaijan from 11 to 22 November 2024)"
        },
        {
            "text": "Finally, reiterating the points made by Steve Reed, the Foreign Secretary said that we must not just halt, but reverse the decline in global biodiversity."
        },
        {
            "text": "Read or watch the Foreign Secretary’s speech for more detail."
        },
        {
            "text": "Now, as we look forward to both COP16 and COP29, Ministers across government will be setting our their ambitions to support international climate and nature recovery."
        }
    ]
}