{
    "url": "https://naturalengland.blog.gov.uk/2025/09/04/designing-and-delivering-woody-habitats-to-aid-nature-recovery-six-principles-for-success/",
    "title": "Designing and Delivering Woody Habitats to aid Nature Recovery: Six Principles for Success.",
    "authors": [
        "Alisa Swanson"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Ecosystem Services",
        "Farming",
        "Flood Management",
        "Natural Capital",
        "Natural England",
        "Nature Recovery",
        "Woodland"
    ],
    "pub_date": "2025-09-04T09:25:05+01:00",
    "content": [
        {
            "text": "By Alisa Swanson, Natural England"
        },
        {
            "text": "Creating new woody habitats, whether woodlands, scrub, wood pasture, wooded meadows or wet woodlands, can play a vital role in reversing biodiversity loss and building climate resilience across England’s landscapes. Natural England’s ambition is to ensure new woody habitat creation offers the maximum benefit for nature and to avoid damage to existing environmental assets. To deliver this, Natural England set up a team of officers across England who can give free advice to landowners and partners interested in creating woody habitats."
        },
        {
            "text": "We have developed a set of guiding principles when out on the ground explaining our woody advice. These are evidence-based, starting from the Lawton Review, published 15 years ago, and following on from that, work to integrate biodiversity advice, nature networks and climate resilience, published in various Natural England Research Reports. "
        },
        {
            "text": "We wanted to make this practical and accessible for partners, farmers and land managers, to help them deliver even more for nature recovery. Clare Pinches, our Principal Specialist for New Trees and Woodland, took on the challenge to summarise the existing evidence as 6 principles."
        },
        {
            "text": "So, what are these 6 principles?"
        },
        {
            "text": "1. Check for existing interest and restoration potential"
        },
        {
            "text": "Before planting, assess what’s already there. Some areas may already support valuable habitats or species or have high potential for restoration—especially peatlands or species-rich grasslands. In these cases, it will not be the best option. Instead, where appropriate consider integrating low-density native trees or shrubs to enhance diversity and provide shade or shelter. The key is to work with the land’s existing character and potential, not against it."
        },
        {
            "text": "2. Get wet! Restore hydrology and other natural processes"
        },
        {
            "text": "Where possible, restore natural hydrology, block drains, re-wiggle streams, or create ponds. Wet features add habitat diversity and support a range of priority species. This principle includes adjusting, usually by reducing, grazing pressure and letting natural processes shape the land over time to build resilience and allow wildlife to adapt to change. "
        },
        {
            "text": "It also delivers wider benefits like flood management, improved water quality, and carbon storage. Starting with hydrology ensures that new habitats are built on a foundation that supports long-term ecological function."
        },
        {
            "text": "3. Go native and diverse"
        },
        {
            "text": "Native trees and shrubs have co-evolved with our wildlife and support far more species than non-native alternatives. For example, our native oaks alone support over 2,300 species. Using a mix of canopy trees, sub-canopy species, and scrub-species increases habitat diversity and resilience to pests, diseases, and climate change. Where appropriate, use of natural colonisation should be encouraged, accompanied by supplement planting or direct seeding using local seed sources."
        },
        {
            "text": "4. Get better connected"
        },
        {
            "text": "New woody habitats should link up with existing ones, especially ancient woodland, to create bigger, better-connected networks. This improves the ability of wildlife to move through the landscape, especially in response to climate change. Trees outside woods - such as in hedgerows, scrub, or wood pasture - can be just as valuable as woodland in enhancing connectivity. Agroforestry can help bridge gaps between isolated habitats."
        },
        {
            "text": "5. Go large if you can"
        },
        {
            "text": "Size matters. Larger wooded areas support more species and more stable populations. For example, marsh tits need over 25 hectares to thrive, and some beetles require over 100 hectares. While not every site can be this big, aiming for larger, well-connected patches with internal variation will deliver more for nature than small, isolated plots."
        },
        {
            "text": "6. Be edgy! Embrace structural complexity"
        },
        {
            "text": "Nature thrives in messy, varied habitats. Incorporating open glades, open wooded habitats and dense groves creates a rich mosaic of niches for birds, insects, and other wildlife. Natural colonisation, where feasible, can produce this complexity over time. In planted schemes, we can mimic this by varying planting density, ideally combining with some natural colonisation, introducing wet features and including thorny shrubs like hawthorn and bramble, which provide food and shelter."
        },
        {
            "text": "Hopefully, the 6 Principles have grabbed your attention, and you want to know more on how to apply in your own woodland creation projects."
        },
        {
            "text": "You can start by finding out who is your local Natural England officer for woody habitat creation in your area, or you can email the national team at enquiries@naturalengland.org.uk. Woodland creation queries will be forwarded to the relevant mailbox."
        },
        {
            "text": "References:"
        },
        {
            "text": "Climate Change Adaptation Manual - Evidence to support nature conservation in a changing climate - NE546 2014"
        },
        {
            "text": "Generating more integrated biodiversity objectives – rationale, principles and practice - NERR071 2018"
        },
        {
            "text": "Nature Networks Evidence Handbook - NERR081 2020"
        }
    ]
}