{
    "url": "https://foresightprojects.blog.gov.uk/2025/09/04/helping-government-to-understand-the-technologies-of-the-future/",
    "title": "Helping government to understand the technologies of the future",
    "authors": [
        "rorysaitch"
    ],
    "categories": [
        "Emerging Technologies"
    ],
    "pub_date": "2025-09-04T17:08:53+01:00",
    "content": [
        {
            "text": "Technology development has the potential to surprise even the most astute of experts. With emerging technologies evolving so rapidly, how do we make sure that everyone is on the same page when it comes to understanding them?"
        },
        {
            "text": "A challenge that accompanies building a science and technology future for the UK is ensuring that everyone across government is using the same language and definitions when referring to specific technologies. This challenge is not an insignificant one, given the pace at which science continues to advance and new technologies emerge.In the Government Office for Science’s Emerging Technology team, one of our aims is to strengthen cross-government collaboration on emerging technology. A problem that we identified was that people using different terms for identical, or overlapping, technologies was holding back collaboration. For example, which are the most important technologies out of AI, neural networks or machine learning? This isn’t a question likely to lead to useful insight."
        },
        {
            "text": "We thought developing a “taxonomy” of new and emerging technologies had the potential to minimise this kind of confusing conversation across government. We also hoped it would allow for easier communication of our insights and help us structure our data-led technology assessments. Finally, we thought it would also give us a snapshot of science and technology, which we could regularly update to keep pace with new developments. So what have we done?"
        },
        {
            "heading": 3,
            "text": "Emerging Technology Taxonomy"
        },
        {
            "text": "Our Emerging Technology Taxonomy arranges over 350 technologies into eight ‘technology families’ across a number of levels, with definitions for each technology. Technologies are organised into a hierarchy, whereby each level goes into more granular detail, but not all technologies at the same level are equal in size or importance."
        },
        {
            "text": "We have worked with over 150 experts, including subject matter specialists across academia and industry, taxonomists, consultancies, and the policy community to develop this tool and to ensure that it is scientifically robust. We hope that a consistent, quality-assured approach to the defining of technologies should lead to better analysis and more rigorous evidence underpinning science and technology policies.  "
        },
        {
            "text": "Click here to see our Emerging Technology Taxonomy."
        },
        {
            "heading": 3,
            "text": "Horizon Scanning for Emerging Technologies"
        },
        {
            "text": "The Emerging Technology Taxonomy is designed to be a living document that is regularly updated. One of the reasons for this – and one of the associated challenges with doing so – is that our understanding of science is constantly developing and new technologies are continually emerging. New technologies don’t neatly evolve from an ancestor. Often, a new technology will be the combination of several innovations. The taxonomy structure is always going to be a judgement we could revisit. For example, does quantum computing sit in quantum technology or future computing? Of course, it’s both. One of the ways in which we ensure our taxonomy keeps pace with new developments is through our horizon scanning function."
        },
        {
            "text": "By integrating signals from a variety of sources, including desk research, cross-government knowledge sharing and engagement with experts in industry and academia, we monitor evolving trends in the science and technology world."
        },
        {
            "text": "Not only does this allow us to identify new technologies to add to our taxonomy, it can also provide an early warning system for government. We draw on this function to help government anticipate “technology surprise”, which we broadly define as a disruptive and unexpected development in science or technology. This can bring challenging domestic and international policy issues, lead to substantial socioeconomic impacts, and present wholly new opportunities or risks for government. There are a range of ways in which technology surprise might occur, be it a major breakthrough in a particular field, a new application or rapid adoption of an existing technology, or a convergence of different technologies to create new possibilities and use cases."
        },
        {
            "heading": 3,
            "text": "Get in touch"
        },
        {
            "text": "We are always keen to hear from the wider science and technology community, to ensure that we stay abreast of cutting-edge R&D and make sure our advice to government draws on the best expertise. If there are technologies which you think are missing from our taxonomy, we’ve mis-labelled a technology, or there are new developments which you think could pose a surprise to government, we’d love to hear from you. Please fill out the survey linked here to share your ideas with us or get in touch by emailing emtech@go-science.gov.uk. "
        }
    ]
}