{
    "url": "https://educationhub.blog.gov.uk/2025/09/prime-ministers-letter-to-parents-and-carers-on-best-start-in-life/",
    "title": "Prime Minister's letter to parents and carers on Best Start in Life",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-09-04T08:33:00+01:00",
    "content": [
        {
            "text": "Dear Parent/Carer,"
        },
        {
            "text": "Across England, millions of children and families are beginning a new school year."
        },
        {
            "text": "As a father of two, I know well the pride and joy of watching your children grow up. But I also understand how juggling parenthood, work and other responsibilities can sometimes be difficult especially when the cost-of-living is still tough, childcare is expensive, and your time is tight."
        },
        {
            "text": "Supporting families is at the heart of our Plan for Change. Over the past year we have started to deliver the change promised – new help designed to make your life easier and give your children the best possible start."
        },
        {
            "text": "We are making high quality childcare more affordable by introducing 30 hours of government-funded childcare during term time, from the end of parental leave to the start of primary school, saving an average working parent up to £7,500 per year – money that stays in your pocket foryour family's needs."
        },
        {
            "text": "We are making family life easier too, with hundreds of school-based nursery places opening this September, and thousands more to come. This means more families can access government-funded childcare and perhaps manage with just one school run in the morning. This comes alongside expanding wraparound childcare available to you outside of school hours, including a free Best Start Breakfast Club which we will be rolling out in every primaryschool."
        },
        {
            "text": "We are proud to build on the legacy of Sure Start through our Best Start Family Hubs, a growing network of welcoming spaces. Families can access a wide range of support and services to make the journey of being a parent a little easier – from expert advice on feeding your baby to how to support your toddler’s learning and development at home."
        },
        {
            "text": "Of course, this is just the beginning. This government will keep building support for you and your family to help make parenting easier and ensure no child’s background dictates what they go on to achieve. I know that this is also a priority for local MPs and councils, who can provide more information about what is available in your area. I encourage you to get in touch withthem directly."
        },
        {
            "text": "To find out more about the support available to you and your family, including free breakfast clubs, eligibility for childcare offers, Best Start Family Hubs in your area and support with your child’s early health and learning, visit our new site that brings this all together in one place: www.BestStartinLife.gov.uk."
        },
        {
            "text": "I also wanted to thank you, the parents and carers, and the grandparents, as well as the childminders, early educators, teachers and health workers, for all you do to give children the best start in life."
        },
        {
            "text": "Nothing will stop me in my mission to back families like yours through our Plan for Change, to build a better future for you, for your children, and for Britain."
        },
        {
            "text": "All best wishes,"
        },
        {
            "text": "Keir Starmer"
        }
    ]
}