{
    "url": "https://civilservice.blog.gov.uk/2021/10/05/5-lessons-from-the-forces-about-getting-things-done/",
    "title": "5 Lessons from the Forces about getting things done",
    "authors": [
        "Rupert Cryer, COVID-19 Task Force, Cabinet Office"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-10-05T08:08:01+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When Rupert Cryer joined the Cabinet Office COVID-19 Task Force, his new colleagues - from the Armed Forces - couldn’t have had more different day jobs. Yet the stark contrast was the very thing that made it work."
        },
        {
            "text": "I’ve often thought about the SAS Iranian embassy siege of 1980. Six gunmen attacked the embassy in London and took 26 people hostage. Negotiators sought a peaceful release until, on the sixth day, a hostage was executed. Almost immediately, two small SAS teams stormed the building and, in a 17-minute raid, rescued the remaining hostages, killing five of the gunmen and capturing the sixth."
        },
        {
            "text": "Explosions; smoke; abseiling down the building in front of the world’s media - it sounds like a work of fiction. But this really happened. "
        },
        {
            "text": "For me, an entrepreneur in government keen to channel something of a start-up culture in tackling large, complex problems, the SAS siege poses an interesting challenge. How is it that 30 people can do what 30,000 can’t? And how can we apply some of the Armed Forces’ “get it done” ethos into our everyday work?  So when Brigadier Marcus Reedman and some 50 members of the Forces joined the Cabinet Office COVID-19 Task Force, I jumped at the opportunity to work shoulder to shoulder with them.  "
        },
        {
            "text": "Working alongside commandos from the Paras and the Marines, a Typhoon fighter pilot, an Apache helicopter pilot and an Arctic warfare specialist, the experience proved invaluable. Here’s what I learnt."
        },
        {
            "text": "Planning and implementation are inseparable"
        },
        {
            "text": "The best way to get the result you want is to integrate planning and implementation.  Military planning focuses relentlessly on The Effect:  the thing that the team wants to make happen. Even from the get-go, preparation time is divided between the planning and implementation in the near-immortalised “one third: two thirds” rule. "
        },
        {
            "text": "Planning and implementation teams work closely together, but crucially it’s the “implementers” who are given two thirds of the time to test, challenge and rehearse the plans and come back with any questions. While it’s natural to want just a little more time to perfect the approach, what good is a brilliant idea on paper that doesn’t work in practice?"
        },
        {
            "text": "Planning continues “after the bang”\n"
        },
        {
            "text": "Military planning doesn’t stop when a perfect plan is published: it stops when the objective has been achieved. In Forces-thinking, “no plan survives contact with the enemy:” that is, you make the best plan you can knowing that lots of factors will derail it and you expect to continue to adapt it as things unfold. "
        },
        {
            "text": "Former General and US President Dwight D Eisenhower went one step further, saying: “Plans are worthless but planning is invaluable.” "
        },
        {
            "text": "While this may sound contradictory, as the Allies’ Supreme Commander in charge of D-Day and the liberation of Europe, he spoke with some authority. Though the plans will doubtless change, the process of planning is a vital way to think through potential problems and opportunities, stress-test the idea and build wider team relationships - all of which makes it easier to adapt as you go, and therefore much more likely to succeed."
        },
        {
            "text": "Plan from right to left\n"
        },
        {
            "text": "Arguably the main difference in the default approach between the Civil Service and the Forces is the direction in which they plan. Unlike the public sector where the end-point typically follows the completion of certain necessary steps, the military approach is, “I need to achieve x and I only have y amount of time and resource. How do I do that?”  Time matters hugely, and it’s important to use what you’ve got, not what you wish you had. \n\nOrders set direction but aren't set in stone\nContrary to popular belief, orders aren’t followed slavishly. They’re designed to allow autonomy and the application of judgement, within boundaries. With a strong emphasis on the ‘why’ - the purpose - they set out the ‘who’, ‘where,’ ‘when’ and ‘what’.  But the ‘how’ is left to the person on the frontline - because they’re best placed to judge how to achieve The Effect with the resources they’ve got. "
        },
        {
            "text": "On occasion, when the way forward was not clear, I heard Forces colleagues say, “Right, I’m going to do x. I can defend that.” In empowered teams, the risk of doing the wrong thing is far outweighed by the risk of not doing the right thing in time."
        },
        {
            "text": "Mindset matters"
        },
        {
            "text": "“Who dares wins” is not just a famous regimental motto. The sheer willingness to dare - to take on a risk and face it down when others won’t - is a competitive edge that can be the difference between success and failure.  "
        },
        {
            "text": "Of course a key reason why a small, elite team excels at what it does is that it’s the right job for the people involved (who may be less effective in a team of 30,000). Much of this is about recognising and using the different skills people bring. It doesn’t mean we need to approach every situation like a paratrooper ready to storm, but mindset matters. It’s about moving from ‘Can we?’ to ‘We can.’ "
        }
    ]
}