{
    "url": "https://marinedevelopments.blog.gov.uk/2021/10/05/how-technology-is-assisting-tristan-da-cunha-to-monitor-compliance-in-its-areas-to-be-avoided/",
    "title": "How technology is assisting Tristan da Cunha to monitor compliance in its Areas to Be Avoided",
    "authors": [
        "Karen Leech, Blue Belt Programme"
    ],
    "categories": [
        "Blue Belt",
        "technology"
    ],
    "pub_date": "2021-10-05T14:03:11+01:00",
    "content": [
        {
            "text": "In November 2020, Tristan da Cunha made international news when it designated 687,000 square kilometres of its waters as a fully protected Marine Protection Zone (MPZ) - the largest in the Atlantic. This follows-on from an important earlier announcement - in April of the same year - that it was creating two Areas to be Avoided (ATBA) around the islands in the archipelago."
        },
        {
            "heading": 3,
            "text": "The Areas to be Avoided"
        },
        {
            "text": "The ATBAs are voluntary and request that all vessels above 400 tonnes adhere to a 25 nautical mile exclusion zone around Tristan. This action, by the Tristan Government, was a direct response to the danger of shipwrecks such the MS Oliva in 2011, which caused significant damage to Tristan's marine environment and lobster fishery. Quite naturally, this event led to a wider concern that Tristan could be exposed to further pollution incidents for which it would be unable to provide an effective and adequate response. Therefore, the Tristan Government decided that the best approach would be the creation of two ATBAs, which would minimise the risk to the island from maritime accidents."
        },
        {
            "text": "The ATBAs provide a number of benefits. They:"
        },
        {
            "text": "Creating the ATBAs was a great step forward, but perhaps the bigger challenge was how Tristan could effectively monitor and ensure compliance of them? Well, that's where the Blue Belt Programme lends a hand- by assisting Tristan with surveillance and improving compliance with the ATBAs."
        },
        {
            "heading": 3,
            "text": "\nTechnology comes into its own"
        },
        {
            "text": "There is no doubt that monitoring the vast area of ocean around Tristan is an additional challenge."
        },
        {
            "text": "However, with the assistance of the Blue Belt Programme, Tristan has access to a range of new and innovative technologies that are helping daily surveillance of the ATBAs to identify any vessels that might be entering the zones, as well as information available through the Blue Belt Shared Intelligence Hub (BBSIH). The surveillance assistance provided to Tristan includes:"
        },
        {
            "heading": 3,
            "text": "Automatic identification system"
        },
        {
            "text": "The monitoring of vessel automatic identification systems (AIS), is key to the Blue Belt Programme's surveillance of Tristan's ATBAs. AIS is primarily used by vessels to avoid collisions in the water; a transceiver on the vessel sends a signal to satellites, or land-based receivers, which identifies their location, speed and course, and allows other vessels to 'see' them.  This information is increasingly being used to monitor vessel movement and can be integrated into online tracking systems. The Blue Belt Programme has access to two different and complementary AIS tracking systems to monitor Tristan ATBAs."
        },
        {
            "text": "Between 1st April 2020 and 31st March 2021, AIS surveillance identified 109 vessels which had transited through the ATBAs. Of those 109, seven vessels were within ten nautical miles (nm) of an island - and therefore considered high risk. For example, this year a fishing vessel entered the Tristan Group ATBA, heading straight for Nightingale Island. Fortunately, nine miles from the Island, it changed course avoiding a serious collision. AIS is mandatory in the Tristan EEZ for all cargo vessels over 300 tonnes and all passenger vessels."
        },
        {
            "heading": 3,
            "text": "NovaSAR-1"
        },
        {
            "text": "Although AIS is an incredibly useful means of tracking vessels, it is easy to switch off and there is a possibility that 'dark vessels' transiting Tristan's ATBAs are not being picked up. Therefore, the Blue Belt Programme is currently trialling a new system called NovaSAR as it is particularly beneficial in the surveillance of dark vessels."
        },
        {
            "text": "NovaSAR-1 was launched in September 2018 and is a medium resolution Synthetic-Aperture Radar (SAR). SAR is a form of radar used to create two-dimensional images or three-dimensional reconstructions of objects, such as landscapes. It uses the motion of the radar antenna over a target region to provide a clearer image, than that received by AIS."
        },
        {
            "text": "Through the trial the Blue Belt Programme has access to the Sentinel Data Access Service (SEDAS), an online data hub only available to UK government agencies, offering open access to Earth Observation (EO) data from the Copernicus Sentinel 1 and 2 satellites, along with additional datasets from other EO satellites, including NovaSAR. If the trial is successful, the combined use of NovaSAR and AIS (any detections through NovaSAR are manually correlated with AIS) will significantly help in the monitoring and identification of dark vessels."
        },
        {
            "heading": 3,
            "text": "Visible infrared Imaging radiometer suite"
        },
        {
            "text": "In addition, the Blue Belt Programme also provides surveillance assistance to Tristan through a number of other remote and innovative monitoring systems including visible infrared imaging radiometer suite (VIIRS). The VIIRS instrument observes and collects global satellite observations that span the visible and infrared wavelengths across land, ocean and atmosphere and is particularly good at picking up vessels which are lit-up at night."
        },
        {
            "heading": 3,
            "text": "Ensuring compliance benefits everyone"
        },
        {
            "text": "As the ATBAs are voluntary, it's vital that a key aspect of compliance is ensuring that the shipping industry is aware that the ATBAs exist and, vitally, understand the benefits that they provide to their own livelihoods and industry by respecting them. For example, the owners and insurers of the MS Oliva, had to pay for the cost of the salvage, clean-up of the Island and compensate the Islanders, as well as suffer the loss of the ship."
        },
        {
            "text": "There is clear self-interest for the industry to adhere to the ATBAs, voluntary or not, so an essential part of the assistance provided by the Blue Belt Programme is raising awareness of the ATBAs with key industries - such as the soya industry in South America and the fishing industry in the South Atlantic."
        },
        {
            "heading": 3,
            "text": "Notifying flag States"
        },
        {
            "text": "As well as awareness raising amongst industry, a process has been created for detecting, confirming and then informing a flag State (the country in which the vessel is legally registered) that a number of its vessels have transited the ATBA. Tristan government requests that the flag State advises their ships to avoid the Tristan ATBAs in future and also provides them with a leaflet setting out why the ATBAs are there."
        },
        {
            "heading": 3,
            "text": "Conclusion"
        },
        {
            "text": "It's quite clear that satellite and other technology plays an essential role in Tristan's armoury - helping them to protect its waters and its economy. Through surveillance Tristan has greater awareness of who and what is transiting its waters. Therefore, The Blue Belt Programme will continue to engage and work with flag States, industries and vessel owners to be more aware of the ATBAs, and the importance of adhering to them."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Editor’s Postscript"
        },
        {
            "text": "It is reassuring that the Tristan Government, through the Blue Belt programme, is taking marine safety seriously in creating a 25- nautical mile Area to be Avoided around the Tristan Islands. There have been three 21st century shipwrecks around the islands which are shown and described briefly below. Of the three, the 2011 MS Oliva wreck, referred to in the article, could have been avoided if the vessel had adhered to the ABTA rules, but it carried no proper chart and its crew were negligent in other respects. Even under the modern ABTA surveillance system errant vessels are very unlikely to be contacted during their voyages to be warned. Certainly no such communication would have helped stop the oil rig being wrecked in 2006, as no-one was aboard, or the MFV Geo Searcher which was a bona fide Ovenstone fishing vessel operating off Gough Island."
        },
        {
            "text": "In 2006 the 6400 tonne oil platform A Turtle was being towed by the heavy-duty tug Mighty Deliverer from Brazil to Singapore. It was released by the tug in early March, was lost but found by islanders in June marooned off Tristan's Trypot Beach. It was later towed to sea and sank 10km off the island at a depth of 3500m. Environmental damage was probably limited to a small oil slick and the arrival of invasive Brazilian porgy fish."
        },
        {
            "text": "In March 2011 the 75,300 tonne MS Oliva was wrecked at Spinner's Point on Nightingale Island. The crew were miraculously rescued. 1500 tonnes of fuel oil and 65,000 tonnes of whole raw soya beans were discharged causing major environmental damage including the loss of rockhopper penguins and other seabirds."
        },
        {
            "text": "In 2020 the 1863 tonne MFV Geo Searcher struck a rock during routine lobster-fishing off the north coast of Gough Island. 62 people aboard abandoned ship and managed to escape to the local Met. base. So far no environmental reports have been received nor details of an enquiry into the cause of the disaster."
        }
    ]
}