{
    "url": "https://companieshouse.blog.gov.uk/2021/10/05/how-to-choose-or-change-your-companys-registered-office-address/",
    "title": "How to choose or change your company’s registered office address",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-10-05T11:35:36+01:00",
    "content": [
        {
            "text": "One of the legal requirements when starting a limited company is to provide a registered office address."
        },
        {
            "text": "As well as storing your company’s documents and registers for inspection, your registered office address is the address for receiving statutory mail and legal documents and it’s where all written communication must be sent."
        },
        {
            "text": "It must be a physical location in the same country that your company is registered in and can be a residential or non-residential address."
        },
        {
            "text": "In our recent Becoming a better director webinar series, Stephanie Kirkwood from the Business Support Helpline explained:"
        },
        {
            "text": "See information on running a business from either home or a rented business property."
        },
        {
            "text": "Another important consideration is that details of your registered office address will appear on the public register. This means that anyone inspecting the public register will be able to view your residential address if you have used it as your registered office address. We do not have the legal power to remove a home address that’s been used as a company’s registered office."
        },
        {
            "text": "There are many companies who will offer a registered office address service, and for a fee, they'll forward your post and any other correspondence. Another option could be to use the address of your accountant or professional adviser, if they give you permission. If you choose to use a third party agent to handle your mail, you must make sure that the service includes sending all of your company’s mail to your registered office address."
        },
        {
            "heading": 2,
            "text": "Changing your company's registered office address"
        },
        {
            "text": "You can change your registered office address at any time, as long as the new address remains within the same part of the UK in which your company is registered – England and Wales, Scotland or Northern Ireland."
        },
        {
            "text": "Changing your registered office address is quick and easy and can be done online. There’s no fee to change your registered office address, but you’ll need your email address and your authentication code."
        },
        {
            "text": "We’ll send you a confirmation email within a few minutes."
        },
        {
            "text": "Your address will not officially change until it’s registered with Companies House. Do not forget to update the address on:"
        },
        {
            "text": "You can change your registered office address, but any previous addresses you’ve used as a registered office will remain on the public register for the lifetime of the company and 20 years after the company has been dissolved."
        }
    ]
}