{
    "url": "https://defrafarming.blog.gov.uk/2021/10/05/introducing-the-annual-health-and-welfare-review/",
    "title": "Introducing the Annual Health and Welfare Review",
    "authors": [
        "Jonathan Statham"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2021-10-05T12:41:10+01:00",
    "content": [
        {
            "text": "In this guest post, Jonathan Statham introduces the Annual Health and Welfare Review. "
        },
        {
            "text": "Jonathan is a cattle vet and chair-elect for England’s Animal Health and Welfare Board. He has 25 years of experience in veterinary practice, including a range of wider industry and academic roles. He is still active in practice at Bishopton Veterinary Group in Yorkshire."
        },
        {
            "text": "Over the past couple of years, I’ve worked with farmers, the Defra team and other specialists to develop the new Animal Health and Welfare Pathway  which is due to launch in Spring 2022."
        },
        {
            "text": "The Review is the first part of the Animal Health and Welfare Pathway to launch. In this post, I’ll give an overview."
        },
        {
            "heading": 3,
            "text": "The Review"
        },
        {
            "text": "The Review is a fully-funded vet visit which farmers will receive on a yearly basis."
        },
        {
            "text": "Farmers’ own vets will carry out diagnostic testing and provide bespoke advice on management to improve the health and welfare of their animals."
        },
        {
            "text": "They will also be signposted to other financial support to improve health and welfare. This includes help to control endemic disease in their herd or flock; invest in sustainable approaches that mitigate impact on the environment; or improve the environments in which animals live so they live a good life by investing in higher welfare."
        },
        {
            "text": "This Review will support improved understanding of health and welfare priorities on individual farms and nationally."
        },
        {
            "heading": 3,
            "text": "Eligibility"
        },
        {
            "text": "The offer will initially be available for all commercial cattle, pig and sheep farmers in England who are currently eligible for the Basic Payment Scheme (BPS)."
        },
        {
            "text": "Longer term, the plan is to open up the Review to more farmers, with a vision of universal participation for all commercial farmers above a minimum threshold (50 pigs, 20 sheep or 10 cows in total)."
        },
        {
            "text": "Access to other aspects of the Pathway however, such as capital grants, are not limited by BPS eligibility from the outset. The Pathway will therefore enable farmers to adapt their business strategy accordingly and access alternative provisions."
        },
        {
            "text": "The annual visit will also enable the vet to work with the farmer and farm team on everything from biosecurity to sustainable use of antimicrobials."
        },
        {
            "text": "Later in the Pathway, capital grants for farmers will be awarded based upon criteria defined by Defra through the co-design process and support for farmers from vets and the vet-led team."
        },
        {
            "text": "The Annual Health and Welfare Review will be the first part of the Pathway to launch, but it may not be essential for every farm, so for some, it may be that grants, for example, will be their first interaction with the Pathway."
        },
        {
            "text": "We hope that the scheme will increase veterinary boots on the ground at farms."
        },
        {
            "heading": 3,
            "text": "Applying"
        },
        {
            "text": "The application process is designed to be simple and accessible to all farmers either online or by phone."
        },
        {
            "text": "Farmers are user testing the application process before it goes live. There will be a 'quiz' integrated into the GOV.UK application process, so farmers can check their eligibility."
        },
        {
            "text": "The date for applications opening will be published here on the blog, so do subscribe."
        },
        {
            "heading": 3,
            "text": "The relationship between farmers, vets and Defra"
        },
        {
            "text": "The Pathway is all about the farmer’s own vet working with the farmer on an individual farm basis, so if you’re sheep, cattle or mixed, if you’re farm assured, if you’re non-farm assured, we will have a format that covers your farm’s needs."
        },
        {
            "text": "The vet is primarily there to support the farmer, but the data collected will help to inform the next bespoke financial and endemic disease support available."
        },
        {
            "text": "By sharing this data with the Defra team, we'll get a better understanding of the health and welfare of the national and regional herd and flock by benchmarking."
        },
        {
            "text": "This data will not be used for inspections. It will be stored securely, and in instances where data is shared, for example, medicine data, the farm won't be identifiable. "
        },
        {
            "text": "While the Pathway is a collaboration between government, vets and industry, the level of veterinary involvement at every stage of its development has been impressive."
        },
        {
            "text": "Making the Pathway a success will be a team effort, but vets have a central and coordinating role in this, underscoring why the farmer-vet relationship is so important."
        },
        {
            "text": "We will keep you updated here on the blog, so do subscribe for alerts when we publish new posts."
        }
    ]
}