{
    "url": "https://mojdigital.blog.gov.uk/2021/10/05/nothing-to-fear/",
    "title": "Nothing to Fear",
    "authors": [
        "Simon Menear"
    ],
    "categories": [
        "A day in the life",
        "a great place to work"
    ],
    "pub_date": "2021-10-05T15:13:16+01:00",
    "content": [
        {
            "text": "On my first day as an Associate Delivery Manager (ADM), both new to the profession and the Civil Service, I was nervously excited about getting stuck in and discovering how I could add value. I was then humbled fairly abruptly by being instantly met with the following;"
        },
        {
            "text": "“Here is your laptop, here is your Dom1 laptop, here is a seven-page manual for how to login to your Dom 1, see attached your login details for 2 different instances of Jira, login details for  confluence, Github, Trello, Miro and Slack, Instructions for your My Learning account, 2 different email accounts, we use the Google suite except when we need to use the Microsoft office suite, SOP login details, the intranet ...”"
        },
        {
            "text": "Blimey… It would’ve been easy to feel daunted by the prospect and for a little bit of imposters syndrome to kick in. With a background of typically having just 1 central CRM application and a telephony solution to navigate, getting my head around what each of these resources did and how to navigate them felt like a mountain to climb."
        },
        {
            "text": "“This is Assma and Mohammed, they’ll be your buddies whilst you settle in and will help you get your head around it all” - Shout out to Assma and Mohammed, who did just that. Being patient and always pointing me in the right direction and sharing resources that aided my initial settling in period."
        },
        {
            "text": "“I’m the Lead DM and I am here to help, support, and guide you on this Journey” From giving me a virtual tour of the OPG and wider MoJ, offering advice and guiding my learning objectives, I really felt I had/have a pillar of support and was given the time to absorb all the information. Not only did this create a perfect environment to learn and grow, it also provided me networking opportunities and to meet other people that can give me a better understanding of how the role of ADM fits in and supports the wider needs of the MoJ/OPG."
        },
        {
            "text": "What followed on from there were introductions to the brilliant and diverse team of Product Managers, Delivery Managers, Senior Developers, Tech Architects, Webs Ops communities and Communities of Practices. The latter of which, the DM Community of Practice, has been a permanent source of knowledge and experience, the weekly meetups are the highlight of my calendar. "
        },
        {
            "text": "I was then sent on a Scrum Master course, which filled in some knowledge gaps around Agile methodologies and the importance of the role, gaining a nationally recognised accreditation in the process! "
        },
        {
            "text": "All of a sudden, that daunting feeling had turned into confidence and an eagerness to support all these ace people I’ve just met. I felt I had enough information and exposure to the role in action that I could start to facilitate ceremonies and get stuck in with the needs of a typical delivery team. I was given the autonomy to slowly increase my responsibilities as I felt comfortable to do so. "
        },
        {
            "text": "I was ready to be introduced to my new team, the Live LPA team, who maintain and improve the live service to make an LPA online (amongst many other things). Just as everyone else had been up to this point, this team were all extremely welcoming, supportive and talented in their fields. Everyone was willing to give me their time so that I could pick their brains and, importantly, find out what they expected from me so I could support each individual as well as the team collectively, in the best possible way. So off I went, that support always in place if and when I needed it, I was now a working ADM supporting and hopefully adding value to vital MoJ services. "
        },
        {
            "text": "In short, it’s easy to feel daunted at the prospect of starting a new career, in a new profession, in a new organisation, I mean who wouldn’t be nervous at that? However I have never before experienced such a welcoming and comfortable environment to excel in this new career, and that's a testament to extraordinary people within the MoJ. "
        }
    ]
}