{
    "url": "https://forestrycommission.blog.gov.uk/2021/10/05/the-forestry-commission-co-organises-the-fourth-annual-forestry-conference/",
    "title": "The Forestry Commission co-organises the fourth annual Forestry Conference",
    "authors": [
        "Sarah Haskew"
    ],
    "categories": [
        "Events",
        "Woodland creation"
    ],
    "pub_date": "2021-10-05T11:08:03+01:00",
    "content": [
        {
            "text": "Held on Wednesday 13 October at the Grandstand at Newbury Racecourse, the annual 2021 Forestry Conference will provide you with strategic information and advice to help inform key land ownership and management decisions."
        },
        {
            "text": "The conference, now in its fourth year, is co-organised by the Forestry Commission, the CLA and Grown in Britain."
        },
        {
            "text": "If you're involved in any aspect of forestry, this is the conference for you."
        },
        {
            "text": "More than ever, it’s important to understand forestry possibilities and enhance the prospects of those involved in the industry."
        },
        {
            "text": "This conference will explore this with the overall theme: 'The Era of Opportunity: Understanding Possibilities & Enhancing Prospects'."
        },
        {
            "text": "The day will focus on these key areas:"
        },
        {
            "text": "Topics such as woodland creation, carbon offsetting, timber and wood fuel markets, and environmental net-gain will also be discussed."
        },
        {
            "text": "The day will be headlined by Lord Deben, Chairman of the Climate Change Committee. There will also be an exciting range of speakers including, Hillary Alison, Environmental Consultant and Forestry Commissioner, Sam Pollock, Head of Future Woodland Creation Incentive at the Forestry Commission, and Jo Harrison, Director of Environment, Planning and Innovation at United Utilities."
        },
        {
            "text": "Richard Pearce, our Partnerships and Expertise Manager, said: \"This year’s conference has an excellent range of speakers who will help to showcase the opportunities and possibilities for new and existing woodland.\""
        },
        {
            "text": "Our experts will be speaking about payment for public benefit, as well as running a workshop about woodland creation design. Our workshop will highlight what to consider when developing a new woodland creation scheme that works for you."
        },
        {
            "text": "Our workshop and talks have been designed in light of the ambitious plans of the Nature for Climate Fund Tree Programme, to deliver 30,000 hectares of new trees across the UK by 2025 to help tackle climate change and improve biodiversity."
        },
        {
            "text": "Throughout the conference, our staff, including our Woodland Creation Officers, will be on hand to answer any questions you may have. There will also be information available about current Forestry Commission grants and support for woodland creation."
        },
        {
            "text": "Luke Everitt, our Field Manager and Woodland Creation Lead in South East and London, said: “The conference is a great opportunity for agents and landowners to come together to discuss forestry issues."
        },
        {
            "text": "“We’re looking forward to promoting the benefits of new woodland and sharing important design principles that help make woodland creation a success.”"
        },
        {
            "text": "Tickets are currently available and are priced at:"
        },
        {
            "text": "The full event programme, more information on tickets and T&Cs can be found on CLA's website."
        }
    ]
}