{
    "url": "https://space.blog.gov.uk/2021/10/05/the-night-sky-in-october-2/",
    "title": "The night sky in October",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2021-10-05T15:49:57+01:00",
    "content": [
        {
            "text": "The evenings have taken on an autumnal chill in recent days, and having passed the equinox last month, there is now more night-time than daylight, perfect for a night of stargazing!"
        },
        {
            "text": "The large constellations of Pegasus, Aquarius and Pisces appear in the south east soon after dark, and now dominate the southern sky through the night."
        },
        {
            "text": "The ‘great square’ that makes up the body of Pegasus (the mythical flying horse that appears upside-down from UK skies!) can be used as a guide to finding the Andromeda Galaxy, the most distant object visible with the naked eye."
        },
        {
            "text": "Another way is to use the distinctively ‘W’ shaped constellation of Cassiopeia, where the right-hand ‘v’ of the ‘W’ points in the direction you should look to find the great galaxy."
        },
        {
            "text": "Look for the Pleiades star cluster rising in the north-east soon after dark and see if you can spot the ‘Double Cluster’, which will appear as a faint smudge of light between the constellations of Cassiopeia and Perseus."
        },
        {
            "text": "More on that in coming months!"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Meteor showers this month"
        },
        {
            "text": "October sees two meteor showers in our night skies."
        },
        {
            "text": "The Draconid Meteor Shower peaks around 8-9 October, and will see fragments of debris from Comet Giacobini-Zinner entering our atmosphere, relatively slowly by cosmic standards, at ‘just’ 21 kilometres (13 miles) per second."
        },
        {
            "text": "While this tends to be a less active meteor shower, it falls just a couple of days after the new Moon, so the darker skies will enable you to see more of the faint meteors than October’s other meteor shower."
        },
        {
            "text": "The Orionid Meteor Shower peaks around 21-22 October, and is the result of fragments of debris left by Halley’s Comet as it last passed through our inner solar system in 1986."
        },
        {
            "text": "While the near-full Moon will limit the number that can be seen, the relatively fast speed of these meteors (65km or 40 miles per second) makes these meteors spectacular to see."
        },
        {
            "heading": 3,
            "text": "The Moon and Planets"
        },
        {
            "text": "Look south-east after sunset to see Jupiter and Saturn emerge.  The gas giants reach their highest point in our southern night skies between 9 and 10pm this month."
        },
        {
            "text": "Brightest planet Venus can be seen low to the south-west horizon in the hour after sunset, and towards the end of the month, early risers can catch Mercury rising in the eastern skies just before dawn."
        },
        {
            "text": "October’s full moon will appear in the constellation of Pisces on 20 October, while nights around the new moon of 6 October will provide darker skies."
        },
        {
            "heading": 3,
            "text": "Space Exploration"
        },
        {
            "text": "A number of exciting space exploration missions are developing in the coming weeks."
        },
        {
            "text": "NASA’s ‘Lucy’ mission to study the swarm of asteroids that interact with Jupiter’s orbit is due to launch this month.  You can find more information here."
        },
        {
            "text": "The European Space Agency’s ‘Bepi-Columbo’ mission will fly past the innermost planet Mercury at the start of the month."
        },
        {
            "text": "It is the first of a number of flybys the spacecraft will perform before being captured in orbit around Mercury in 2025.  You can find more information here."
        },
        {
            "heading": 3,
            "text": "The International Space Station"
        },
        {
            "text": "There are a number of visible passes of the International Space Station this month, with the brightest and easiest to spot occurring at the end of the month."
        },
        {
            "text": "Visit https://www.heavens-above.com/ for all of the passes for your location."
        },
        {
            "heading": 3,
            "text": "Did you know?  "
        },
        {
            "text": "Dwarf planet Pluto is nearly 40 times further from the Sun than the Earth is."
        },
        {
            "text": "One orbit of the Sun, or ‘year’ on Pluto takes 248 earth years, so it has yet to complete a single orbit since it was discovered in 1930. Outermost planet Neptune has completed just one of its 165-year orbits of the sun since its discovery in 1846."
        }
    ]
}