{
    "url": "https://hmlandregistry.blog.gov.uk/2021/10/05/were-customer-support-but-who-are-we/",
    "title": "We’re Customer Support, but who are we?",
    "authors": [
        "Alex Cook, Customer Support Centre Change Delivery Manager"
    ],
    "categories": [
        "Buying and selling property",
        "Working at HM Land Registry"
    ],
    "pub_date": "2021-10-05T10:33:57+01:00",
    "content": [
        {
            "text": "The Customer Support Centre occupies a unique position in HM Land Registry, using insight and expert, impartial knowledge to assist our customers directly."
        },
        {
            "text": "They listen, deal with, sort out or refer queries so that our caseworkers can concentrate on complex applications without the constant distraction of calls and emails."
        },
        {
            "text": "Customers sometimes wonder if the person at the other end of the phone really can help with their application, so let’s take a look behind the scenes. When you contact HM Land Registry’s Customer Support Centre, who are you actually talking to?"
        },
        {
            "heading": 2,
            "text": "A mix of skills and experience"
        },
        {
            "text": "More than 300 colleagues work in our Customer Support Centre, based in Durham or Swansea. Between them, they respond to around a million queries every year."
        },
        {
            "text": "Support centre staff encompass a range and breadth of casework skills, with the newest recruits undergoing a minimum of 12 weeks’ training. Working alongside them are longer-serving, experienced staff, who have spent many years in casework teams, processing all types of cases as well as information services. Everyone is trained on register updates such as transfers and charges, and all have knowledge of register creates - for example, leases - so they can deal with enquiries on those applications."
        },
        {
            "heading": 2,
            "text": "Good all-round knowledge"
        },
        {
            "text": "Customer Support representatives not only understand current and historic policies, processes and documentation changes but also have a grounding in other areas, such as Commercial Arrangements and Data Services, plus knowledge of operational priorities. They are also fully conversant with the various systems we use, from casework tools to portal services, including recent additions such as View My Applications and Estimated Completion Dates."
        },
        {
            "text": "On top of that, they must have excellent interpersonal skills, be able to control calls, deal with vulnerable, distressed and challenging customers, manage complaints and know what to do if they receive a report of registration fraud - all of which is incorporated into their training."
        },
        {
            "heading": 2,
            "text": "The right people"
        },
        {
            "text": "It’s a demanding role, requiring a host of registration skills, coupled with problem-solving abilities. Reassuring an anxious customer their application is on track, chasing up an urgent transfer or walking a nervous user through a portal application is all in a day’s work for this team."
        },
        {
            "text": "“I really enjoy assisting customers, giving them clear explanations and demystifying land registration,” says Durham-based Customer Support Officer Gillian Close. Her colleague, Peter Benson, adds: “I get so much satisfaction from helping people. I do a job where I know I make a difference, and that is so rewarding.”"
        },
        {
            "heading": 2,
            "text": "Dealing with customer calls"
        },
        {
            "text": "Calls and webforms received are directed to the best person to deal with the enquiry, based on the customer’s choice of options from the menus available on the telephone or Contact Us page on GOV.UK."
        },
        {
            "text": "As well as casework points, some staff specialise in creating and maintaining portal account applications or supporting customers using specific services. Searches of the Index Map, correspondence by private individuals, police and fraud enquiries, plus all expedite requests also feature in the Customer Support Centre’s daily work schedules."
        },
        {
            "text": "We know how important it is for customers to get in touch with the right person quickly. In June, the team received more than 91,000 calls, answering nearly half within 40 seconds. Others took on average less than three minutes to answer but reducing wait times remains our area of focus. Another priority is staff development: we’re ensuring new recruits continue to hone their skills alongside more established colleagues to bolster the team’s overall knowledge, expertise and ability to resolve queries speedily, as well as providing information and assistance."
        },
        {
            "heading": 2,
            "text": "And finally"
        },
        {
            "text": "The Customer Support Centre is here to help you and, whether you’re a business customer, member of the public or simply an interested party, they always aim to provide “absolutely superb service” (thank you, Talia on Twitter)."
        }
    ]
}