{
    "url": "https://mojdigital.blog.gov.uk/2022/08/30/becoming-a-truly-data-led-justice-system/",
    "title": "Becoming a Truly Data Led Justice System",
    "authors": [
        "Richard Price"
    ],
    "categories": [
        "Data",
        "digital strategy",
        "Justice Digital Strategy",
        "MoJ Digital Strategy 2025",
        "Network services",
        "Our People",
        "Our services",
        "our users",
        "Technology"
    ],
    "pub_date": "2022-08-30T13:15:31+01:00",
    "content": [
        {
            "text": "The Permanent Secretary and I share the ambition to be a data led and digital department which uses our data assets in an exemplary way to deliver for Ministers and citizens and to change lives for the better."
        },
        {
            "text": "At the centre of our strategy is a simple idea: get data of the right quality to the people who need it, so that they can get a better understanding of how our services are performing and take better-informed decisions to improve them."
        },
        {
            "text": "Our data strategy works hand-in-hand with our Digital Strategy."
        },
        {
            "text": "The MoJ and the criminal justice system are data-rich. Collecting data of the right quality and using it effectively are vital for the high-impact work we do. But we should also acknowledge that at present, our data does not always meet our requirements. Too often it is fragmented, hard to share and not exploited to its fullest extent."
        },
        {
            "text": "What do we need to do?"
        },
        {
            "text": "To make a reality of our vision, my focus will be on transforming the management of our data, building our data capability and changing the way users engage with our information."
        },
        {
            "text": "We will promote data as one of our strategic assets alongside our policies, our people and our services. This means creating a culture where everyone understands the value of data, has the skills needed to use it to maximise its positive impact on services and outcomes, and knows their role in maintaining it."
        },
        {
            "text": "We know that change won’t happen overnight, and it will take several years to reach our full ambition. We have begun making progress and now is the time to scale our approach up."
        },
        {
            "text": "We’ve set up a new Data Improvement Programme, working across the MoJ and with our partners across the Criminal Justice System, which will drive our data transformation."
        },
        {
            "text": "Our strategy - three things to remember"
        },
        {
            "text": "Read more in the summary of our data strategy below, and look out for our next blog where we will share more on our roadmap."
        },
        {
            "text": " "
        }
    ]
}