{
    "url": "https://civilservice.blog.gov.uk/2022/08/30/civil-service-choirmaster-stephen-hits-the-right-note/",
    "title": "Civil Service Choirmaster Stephen hits the right note",
    "authors": [
        "Lorraine McBride"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-08-30T10:24:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Since founding the Civil Service Choir in 2009, Stephen Hall OBE has conducted in iconic venues and built the choir’s reputation for remarkable performances. Interview by Lorraine McBride"
        },
        {
            "text": "I joined the Civil Service some 30 years ago as a Fast Stream statistician and I work in the Department for Environment, Food and Rural Affairs (Defra)."
        },
        {
            "text": "My family wasn’t at all musical but at primary school, some instruments were brought in and if you could produce a note, you were allowed music lessons. I picked up a cornet and made a respectable noise. As well as having lessons, I joined a village junior band and quickly progressed to the main band. Unfortunately, music at my secondary school was a discouraging experience and on arriving at a different school for the sixth form, I’d effectively given up on making music. "
        },
        {
            "text": "My sixth form was an ex-grammar school, and it maintained a range of competitive activities including a House Music competition. I was having none of it, but a friend told the house recruiters that I played the cornet, and I was told I was in the house brass ensemble, non-negotiable!"
        },
        {
            "text": " Threat"
        },
        {
            "text": "On the assumption I could sing, I was made to join the house choir but having never sung before, that wasn’t for me either. When I didn’t turn up at rehearsals, I was pulled from class to explain myself with the threat of going to see the housemaster. I agreed to bring my cornet the next day and, to my surprise, hugely enjoyed the rehearsal. I also found myself in a choir for the first time, aged 16, and discovered that I could sing! I then got involved in lots of music-making, probably at the expense of my A levels."
        },
        {
            "text": "Leaping forward several years, the beginnings of the Civil Service Choir were four of us singing in a basement club room, and two months later, a choir of 25 giving a debut concert. I had limited conducting experience and told the singers, “Look, you don’t know what you’re doing, and I don’t know what I’m doing - let’s learn together!”"
        },
        {
            "text": "Conductor development"
        },
        {
            "text": "More than 140 performances later, and with a choir of 150 singers, I like to think I do know what I’m doing. However, I never want to be the reason why the choir can’t do anything, so I’ve taken my conductor development seriously and have done various forms of training in my free time. When learning a piece of music, I prepare by listening to a variety of performances of the same piece with different conductors. I went to a lot of BBC proms concerts last year, and whereas most people look at the players, I spent 80% of my time watching the conductor!"
        },
        {
            "text": " "
        },
        {
            "text": "The choir’s membership is across all grades and departments and from those who’ve just joined the Civil Service to those who’ve come out the other end as retirees but still want to sing with us."
        },
        {
            "text": "Our repertoire is very broad. Our mainstream activity leans towards large-scale works, regularly performing at St John’s Smith Square accompanied by an orchestra.  We also sing at events in government departments; at the recent Civil Service Awards, we sang Abba and A-ha. We have performed in the London Jazz Festival."
        },
        {
            "text": "Huge adrenaline rush"
        },
        {
            "text": "A concert can be a huge adrenaline rush. In our bigger concerts, I’ve stood in front of a choir and orchestra of more than 150 people, with up to 700 in the audience - it’s a big deal. The first time I conducted in St John’s Smith Square, I had to tell my hand to stop shaking because it was no use if I added in extra beats."
        },
        {
            "text": "We rehearse one lunchtime a week but have recently trialled evening rehearsals. People say the choir is a major de-stresser, and for many it’s the highlight of the week. We organise occasional evening socials and hold some workshops at weekends."
        },
        {
            "text": "For government events, we get to sing in venues such as Lancaster House, but we haven’t done No. 10 yet. We were honoured to sing at a Service of Thanksgiving in Westminster Abbey for the life of Lord Heywood, former Head of the Civil Service. That was an audience of over 2,000! Lord Heywood was a Bob Dylan fan, so we had a Bob Dylan song arranged for us."
        },
        {
            "text": "Scary"
        },
        {
            "text": "At Westminster Abbey, I was only allowed 40 singers, so I had to audition people. I’m very conscious that auditioning can be scary, so I ask two or three people to stand together so nobody’s singing alone, but I am listening. I try to make it as supportive as possible."
        },
        {
            "text": "However, no auditions are required to join the choir and people determine, fairly quickly, whether the standard is right for them. People do join us having never read music before. "
        },
        {
            "text": "My choral dream? Now, it’s getting back my choir after COVID-19. In 2020, we had four concerts in St John’s Smith Square in the diary, all of which were cancelled.  We gave our first concert in two and a half years last month – a modern piece in seven languages, including Zulu. It was a triumphal return to the concert hall, but we still have a lot of rebuilding to do. I also occasionally wonder whether there’s scope to pursue choir conducting on a professional basis."
        },
        {
            "text": "We did have some activities during the COVID-19 lockdowns and produced four virtual recordings. One of these was The Beach Boys’ God Only Knows. At the beginning of the video, you see a record on a turntable which is the Beach Boys album given to me by my dad as a child."
        },
        {
            "text": " "
        },
        {
            "text": "Awarded an OBE"
        },
        {
            "text": "In 2018, I was awarded an OBE for voluntary and charitable service. This was in recognition of developing and running what has become the Civil Service Choir and for our fundraising for charities – more than £40,000 so far – as well as other volunteering activities outside the Civil Service.  My mum was having treatment for cancer that year, so we delayed my investiture until 2019. Prince William presented my medal and had been well briefed as he was genuinely interested and asked such pertinent questions."
        },
        {
            "text": "Joining a choir is incredibly rewarding. Want to join the Civil Service Choir? Go to www.civilservicechoir.org.uk or email etcetera@civilservicechoir.org.uk."
        }
    ]
}