{
    "url": "https://deframedia.blog.gov.uk/2022/08/30/daily-mail-coverage-on-the-badger-culling/",
    "title": "Daily Mail coverage on the badger culling",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-08-30T13:54:06+01:00",
    "content": [
        {
            "text": "There is inaccurate coverage in the Daily Mail today on Defra’s involvement in a research paper published in Vet Record."
        },
        {
            "text": "The piece claims that Defra “forced” Vet Record, the journal of the British Veterinary Association, to make changes to “water down” a study by Iain McGill, Mark Jones and Tom Langton on badger culling. However, this is simply not true."
        },
        {
            "text": "As is often the case with such papers, Defra was given advance sight of the study by the editor of Vet Record, and invited to make comment for an accompanying news piece."
        },
        {
            "text": "Upon reviewing the paper, our experts found that the analysis was scientifically flawed. This meant that it was impossible for the study’s authors to have reached the conclusions that they did about the effects of badger culling, and that the study’s conclusions were therefore wrong."
        },
        {
            "text": "As we had been invited to, we presented our findings to Vet Record to help inform its editorial decisions around publication of the paper, with the journal deciding to publish the study alongside a letter of response from the Chief Vet and Defra Chief Scientific Adviser. There was absolutely no attempt to make changes to the scientific research, as the Mail claims was the case."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "The Daily Mail also fails to recognise the success of our bovine TB eradication strategy in dealing with this insidious disease. Published scientifically rigorous analysis of the disease shows that licensed badger culling is helping to drive down bTB in cull areas."
        },
        {
            "text": "For example, TB incidence in the areas where culling started in 2016 has dropped from 17.2 Official TB Free Status Withdrawn (OFTw) breakdowns per 100 herd years at risk in 2016-17, to 8.7 in 2019-20.  Similarly in the areas where culling started in 2017 it dropped from 15.3 in 2017-18 to 8.4 in 2019-20.  In contrast, in the parts of the High Risk Area where no culling took place incidence has remained relatively stable fluctuating between 10.9 and 12.8."
        },
        {
            "text": "We do not want to continue the cull indefinitely, which is why we are moving to the next phase of our long-term strategy, with new intensive cull licences being issued for the final time this year and improved testing and cattle vaccination when available so that we can eradicate this insidious disease."
        }
    ]
}