{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/08/30/measuring-environmental-change-at-defra/",
    "title": "Measuring Environmental Change at Defra",
    "authors": [
        "Thomas Butterfield"
    ],
    "categories": [
        "Guest Blog",
        "Our People & Deep Dives",
        "Specialism Deep Dives"
    ],
    "pub_date": "2022-08-30T08:08:00+01:00",
    "content": [
        {
            "text": "In 2018 the government published the 25 Year Environment Plan, which set out plans to improve the environment in England and ensure that we become the first generation to leave the environment in a better state than we found it. To understand how the plan was progressing, there was a need to develop an evidence framework to objectively monitor environmental changes (or outcomes) in England, and so the Outcome Indicator Framework was born."
        },
        {
            "heading": 3,
            "text": "What is the Outcome Indicator Framework?"
        },
        {
            "text": "The framework is a robust collection of evidence from a vast range of sources that people can use to quickly understand how the environment in England is changing. It contains 66 indicators, each of which provides an environmental insight linked to the 10 goals in the 25 Year Environment Plan. The indicators are divided into the following 10 broad themes:"
        },
        {
            "text": "The full set of indicators is not yet complete, as their custom design necessitates novel research and development, which remains ongoing. Each one is classified as either final (no major anticipated changes to the data we present), interim (we present data but recognise the need for future development, sometimes this may be creating an England subset of data from an existing UK data series), or in development (data is not yet available to present)."
        },
        {
            "text": "Once per year we publish an Outcome Indicator Framework update report where we present indicators newly developed since the previous year’s report, and the most recent available data for every indicator (sometimes this will be a repeat of the previous year’s data if an indicator’s reporting cycle is longer than one year)."
        },
        {
            "heading": 3,
            "text": "What’s new this year?"
        },
        {
            "text": "We published the 2022 update to the Outcome Indicator Framework in May this year, and it had some exciting new additions. 5 indicators were reported in the framework for the first time:"
        },
        {
            "text": "Also, for the very first time we presented a brand-new assessment of change for each of the indicators. Before this year’s report, while we did state the direction of change for each indicator, we made no comment on whether this change was in a favourable direction for meeting environmental goals. This year’s assessment uses a consistent, peer reviewed, quantitative approach to state whether an indicator shows an environmental deterioration, improvement, or little or no change, over short, medium, and long-term time periods."
        },
        {
            "text": "Overall, the picture painted by the assessment is mixed. Over a short-term time period (the most recent 5 years of available data) we were able to assess 63 indicator components. Of those 63 components, 29 showed an environmental improvement, 18 showed little or no change, and 16 showed a deterioration. The 2022 Outcome Indicator Framework update elaborates which specific elements of the environment can be understood to be improving or deteriorating and changes are collated under the banner of the ten overarching goals of the 25 Year Environment Plan."
        },
        {
            "text": "As part of the new indicator assessment we also presented a systems analysis for the first time, describing how indicators within each 25 Year Environment Plan goal are likely to influence each other. This is intended to help a user better understand the interconnectivity between different environmental goals."
        },
        {
            "heading": 3,
            "text": "Where can I go to learn more?"
        },
        {
            "text": "We publish the annual Outcome Indicator Framework update report as a pdf on gov.uk, it’s available in the collection of 25 Year Environment Plan: progress reports alongside Defra’s 25 Year Environment Plan Annual Progress Reports (which use the Outcome Indicator Framework as an evidence base)."
        },
        {
            "text": "To aid usability of the framework, we also present it in an interactive dashboard, currently in alpha."
        },
        {
            "text": "If anyone wants to get in touch for advice on how to use the framework, or to give the team feedback, the easiest way is to email us at 25yepindicators@defra.gov.uk."
        }
    ]
}