{
    "url": "https://ofsi.blog.gov.uk/2022/08/30/reporting-to-ofsi-what-do-i-need-to-do/",
    "title": "Reporting to OFSI: what do I need to do?",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "enforcement",
        "Financial sanctions",
        "Uncategorized"
    ],
    "pub_date": "2022-08-30T15:57:27+01:00",
    "content": [
        {
            "text": "Following its illegal invasion of Ukraine in February 2022, the UK put in place the largest package of financial sanctions it has ever imposed against Russia. It is more important than ever that reporting obligations, a key component of financial sanctions, are understood and carried out."
        },
        {
            "text": "This blog outlines what companies' reporting obligations are and how they can be met."
        },
        {
            "heading": 3,
            "text": "Who should report?"
        },
        {
            "text": "UK financial sanctions legislation sets out specific reporting obligations which requires certain individuals and entities (‘relevant firms’) to report to OFSI if:"
        },
        {
            "text": "You only need to report this information if, as a relevant firm, it comes to your knowledge while carrying out your business."
        },
        {
            "heading": 3,
            "text": "Who are relevant firms?"
        },
        {
            "text": "Relevant firms are legally required to report to OFSI in the circumstances outlined above and failure to comply with these requirements is an offence under sanctions regulations. This obligation applies (but is not limited) to the following businesses and professions:"
        },
        {
            "text": "Definitions of relevant firms can be found in the statutory instrument for each sanctions regime, which can be found here."
        },
        {
            "heading": 3,
            "text": "What do I report?"
        },
        {
            "text": "When you report as above to OFSI, you should provide us with the information on which your knowledge or suspicion is based and any information that you hold by which the person can be identified. This may include name, address, date of birth, passport or identity card details, company registration information or International Maritime Organisation identification number. The provision of this information assists OFSI to identify any new aliases or methodologies that may be used to circumvent sanctions. In particular, if you hold any identifying information about a designated person that is not on OFSI’s consolidated list of asset freeze targets, we want to know."
        },
        {
            "heading": 3,
            "text": "What are frozen assets?"
        },
        {
            "text": "When reporting to OFSI you must include details of the nature and amount or quantity of any funds or economic resources held. Types of funds or economic resources can include but are not limited to:"
        },
        {
            "text": "OFSI also conducts an annual frozen assets review that requires individuals or organisations who hold or control funds or economic resources belonging to, owned, held, or controlled by a designated person, to provide a report with the details of these assets. Further information on the annual frozen asset review can be found here."
        },
        {
            "heading": 3,
            "text": "What type of offences do I report?"
        },
        {
            "text": "The offences that need to be reported will depend on the relevant regulations, but can include:"
        },
        {
            "heading": 3,
            "text": "Examples"
        },
        {
            "heading": 4,
            "text": "Example 1: Suspected designated person and frozen funds"
        },
        {
            "text": "A customer of yours becomes subject to an asset freeze. You must report this, along with any information you hold to identify the person, to OFSI. You should also include the nature and quantity or amount of any assets you have frozen."
        },
        {
            "heading": 4,
            "text": "Example 2: Payment to a person owned or controlled by a designated person"
        },
        {
            "text": "You have identified a payment to an entity you suspect is owned or controlled by a designated person. Your investigation into the payment shows that the persons involved in sending the funds may have committed an offence by making funds available to a designated person. You must report this to OFSI as soon as practicable."
        },
        {
            "heading": 4,
            "text": "Example 3: Breaching a financial sanctions prohibition"
        },
        {
            "text": "You identify that loans have been made available to a firm subject to financial and investment restrictions. This may be a breach of financial sanctions and should be reported as soon as practicable."
        },
        {
            "heading": 4,
            "text": "Example 4: Breaching the conditions of a Treasury licence"
        },
        {
            "text": "You work for a relevant firm who is party to an OFSI licence and become aware that another party to the licence is breaching the terms of the licence by exceeding a cap on payments. You must report this to OFSI as soon as practicable with reference to the specific licence that is being breached."
        },
        {
            "heading": 3,
            "text": "How do I report?"
        },
        {
            "text": "OFSI’s reporting form can be found here. You can use the form to report a suspected designated person, frozen assets and suspected breaches. Completed forms should be sent to ofsi@hmtreasury.gov.uk."
        },
        {
            "text": "If you are reporting a significant number of frozen accounts, you may use the template provided for the annual frozen assets reporting exercise in addition to the standard reporting form."
        },
        {
            "text": "OFSI will always treat any information you provide in accordance with the relevant financial sanctions and data protection legislation."
        },
        {
            "text": "For more information on financial sanctions reporting obligations, please see chapter 5 of our general guidance for financial sanctions. If you are unsure of your reporting obligations, you should seek independent legal advice."
        },
        {
            "text": " "
        }
    ]
}