{
    "url": "https://apprenticeships.blog.gov.uk/2022/08/30/route-review-update-construction-and-the-built-environment/",
    "title": "Route review update – construction and the built environment",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Route review",
        "Update"
    ],
    "pub_date": "2022-08-30T16:13:20+01:00",
    "content": [
        {
            "text": "In April 2022, we published the construction route review report. In the report, we made a number of commitments. Four months on, we are pleased to report the progress made to date on these commitments:"
        },
        {
            "text": "Gain approval from the Secretary of State to change the name of the route  - you will see on our website that permission was granted very quickly and we have now updated all of our references to the route to ‘construction and the built environment’"
        },
        {
            "text": "Create progression routes from ‘trade’ level 2 occupational standards – we are pleased to report that we are currently working on revisions of bricklayer, painter and decorator and are soon to commence the review and revision of the plasterer occupation. The revisions to date have redefined the occupations, creating progression routes at level 3. These will be available for delivery in 2023."
        },
        {
            "text": "Retrofit  - the consultation responses indicated that a suite of retrofit occupations were missing from our occupational maps. We agree! We are currently working with a trailblazer group to define these occupations, supported by the CLC future skills working group and employers from both private and public sector."
        },
        {
            "text": "Common knowledge, skills and behaviours (KSBs) – as part of the route review report, we published principles and characteristics that we expect to be reflected in every new and revised occupational standard in the route. To support trailblazer groups, we have produced common KSBs for each principle and characteristic at different levels, along with associated end point assessment (EPA) grading descriptors. With thanks to employers and stakeholders such as the UK Green Building Council, these are now being used by trailblazer groups and will continue to be refined where needed. This will help speed up revision and development work and reduce the burden on employers time."
        },
        {
            "text": "Aligning competency standards across the route. The construction and built environment route currently has various definitions of competence produced by different organisations. We made a commitment in the report that we would work with partners to define occupational competence, meaning the standard is the same no matter what document is read. We have been working with partners such as CLC, CITB, BSI and SDS on this and we all share the same ambition. The outputs from this work will be seen over coming months."
        },
        {
            "text": "There is lot of work to do following the route review and many revisions are already underway or imminent. If you would like to be part of any trailblazer group, please do get in touch with our construction and built environment team construction.transport@education.gov.uk"
        }
    ]
}