{
    "url": "https://deframedia.blog.gov.uk/2022/08/30/sale-of-horticultural-peat-to-be-banned-to-protect-englands-peatlands/",
    "title": "Sale of horticultural peat to be banned to protect England’s peatlands",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-08-30T14:22:09+01:00",
    "content": [
        {
            "text": "There was widespread coverage over the weekend including across the Telegraph, Guardian, Express, Press Association, BBC, ITV and Sky News of new Government action to protect peatlands and the natural environment by banning the sale of peat for use in the amateur gardening sector by 2024."
        },
        {
            "text": "The announcement followed an extensive public consultation, which received more than 5,000 responses with over 95% in favour of government taking action to ban retail peat sales. The Government has also pledged to continue to work closely with the professional horticulture sector on speeding up their transition to peat-free alternatives ahead of a ban for the professional horticulture sector, recognising that the professional horticulture sector faces additional technical barriers that will take longer to overcome."
        },
        {
            "text": "Environment Minister Richard Benyon said: "
        },
        {
            "text": "Chair of Natural England, Tony Juniper said:"
        },
        {
            "text": "Professor Alistair Griffiths, Director of Science and Collections at the Royal Horticultural Society, said: "
        },
        {
            "text": "The Government also launched a new £5million fund to promote the use of peatlands for sustainable farming. It will support the uptake of paludiculture – the practice of farming on rewetted peatland – which will help, further safeguard food security, produce alternatives to horticultural peat and reduce environmental impacts."
        },
        {
            "text": "Alongside, through round two of the Nature for Climate Fund Peatland Restoration Grant, Natural England awarded nearly £11 million to six projects to support restoration works on over 7,000 hectares of peatland, adding to more than 8,000 hectares already funded through round one."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}