{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/10/21/apha-marks-biology-week-2022/",
    "title": "APHA Marks Biology Week 2022",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Our People & Deep Dives",
        "Outreach"
    ],
    "pub_date": "2022-10-21T15:38:42+01:00",
    "content": [
        {
            "text": "The Animal and Plant Health Agency (APHA) took part in the Royal Society of Biology’s Biology Week in October to raise awareness of the range of scientific roles at the Agency and hopefully inspire the next generation of scientists to continue studying and working in science. We hosted a science exhibition for local college students and ran a series of social media posts during the annual event to celebrate all aspects of the biosciences.  In addition, we also supported the national #IAmABiologist campaign and posted photographs of our scientists in action on the APHA Facebook, Twitter and LinkedIn accounts to highlight the diversity of our scientific staff and roles."
        },
        {
            "text": "The week ended with a visit by a group of science students from Woking College to Weybridge site where they met scientists from our Bacteriology, Virology, Pathology, Epidemiology and Animal Science departments to learn about the range of animal disease work and career options available. They also learnt more about our study and apprenticeship opportunities, both in science and related roles. The students were really engaged in the hands-on science demonstrations, a tour of our research and diagnostic laboratories and a game to match the notifiable disease with the animal affected."
        },
        {
            "text": "We hope to do more science and career engagement activities with colleges, through our STEM Ambassador Group, aiming to improve our talent pipeline for the future at APHA. Please get in touch with Sarah Stewart if you are running similar events and would like to collaborate or get involved."
        }
    ]
}