{
    "url": "https://mattersoftesting.blog.gov.uk/how-we-improved-the-mot-reminders-service-using-feedback-from-motorists/",
    "title": "How we improved the MOT reminders service using feedback from motorists",
    "authors": [
        "Nikola Coleman"
    ],
    "categories": [
        "MOT Modernisation",
        "News and updates"
    ],
    "pub_date": "2022-10-21T10:02:00+01:00",
    "content": [
        {
            "text": "Earlier this month we made some improvements to our MOT digital services to make them easier for motorists and businesses to manage their MOT reminders, and to view all their MOT certificates in one place."
        },
        {
            "text": "We also celebrated reaching 4 million sign ups to the MOT reminders service, over 10% of the vehicles that need an MOT."
        },
        {
            "text": "Finding out what motorists think of our service"
        },
        {
            "text": "Despite the MOT reminders service scoring highly in our customer satisfaction surveys (around 90%) we always want to see if we can improve it. Feedback from customers started to show us what wasn’t working for them and what we could change."
        },
        {
            "text": "This initial research highlighted several pain points and opportunities which then became our focus areas for the project. These were:"
        },
        {
            "text": "Digging deeper into the feedback "
        },
        {
            "text": "We began by carrying out a deeper analysis of the themes identified from the feedback. This really helped us understand the specific pain points within the themes and how big of a problem they were."
        },
        {
            "text": "All of this told us that motorists’ biggest issues with the service were around our communication with the DVLA and the difficulty they had unsubscribing from the service:"
        },
        {
            "text": "Motorists also felt it was difficult to remember what reminders they’d signed up for and the some said they felt the content of the reminder came across as too threatening."
        },
        {
            "text": "Developing our ideas to improve the service"
        },
        {
            "text": "Using this research, we wrote some clear user need statements to capture:"
        },
        {
            "text": "One of our highlights on the project was getting together with a range of different people from across DVSA to find some creative solutions for the issues identified by motorists.  Seeing everyone come together to create a sea of coloured post-it notes all containing a range of varied ideas was amazing."
        },
        {
            "text": "We went through all the ideas generated in the workshop and scored them by how much effort would be needed to deliver them against how much impact it would have on motorists. This allowed us to choose which ideas we would prioritise doing first, and which would form a backlog for us to look at later down the line."
        },
        {
            "text": "Testing our idea with customers"
        },
        {
            "text": "The first idea we prioritised for development was giving customers the ability to view what MOT reminders they have signed up for and to make it easier for them to amend their reminders."
        },
        {
            "text": "We built a prototype service, and then carried out some user testing to see what motorists thought. We carried out pop-up user testing in local MOT garages, asking members of the public to try out our prototype service and give us their feedback."
        },
        {
            "text": "Overall it tested brilliantly, with comments on how “extremely simple” it was to use. We also got some great feedback to help us to tweak it further and get it ready for further development and launch."
        },
        {
            "text": "Getting ready to launch"
        },
        {
            "text": "Our ‘Manage your reminders’ improvement to our MOT Reminder service went live on GOV.UK last month, giving motorists the ability to manage their current MOT reminders and remove any old ones they don’t want to receive anymore."
        },
        {
            "text": "We’ve also improved the MOT reminder message itself to make the language less threatening and updated the feedback survey link. This will help us conduct monthly analysis on feedback responses and support further improvements to our services."
        },
        {
            "text": "Thank you for your support over the last few weeks sharing our service improvements on social media and with your customers. It’s been really great to see you using our toolkit and images online."
        },
        {
            "text": " Moving on to our next project"
        },
        {
            "text": "We’re now working on the development of our next idea - around how we can better use the data we receive every day from the DVLA to prompt customers to update their reminders when they sell or scrap a vehicle."
        },
        {
            "text": "Working with another agency means it might take slightly longer to develop this, but we think it’s something that will really benefit motorists."
        },
        {
            "text": "I hope it’s been useful to understand more about how we improve our services, the process we go through, and to highlight how important feedback is to our work and services."
        },
        {
            "text": "Please let us know below in the comments if there’s any areas you think could be improved in our digital services and we can add these to our research list."
        }
    ]
}