{
    "url": "https://dluhcdigital.blog.gov.uk/2022/10/21/proptech-sector-wants-to-help-deliver-housing-and-planning-ambitions/",
    "title": "PropTech sector wants to help deliver Housing and Planning ambitions",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2022-10-21T11:44:50+01:00",
    "content": [
        {
            "text": "In the summer the DLUHC Digital Planning team held a virtual Roundtable event to connect senior DLUHC officials with a wide range of voices to help the Property Technology (PropTech) sector understand the government’s levelling up agenda and discuss where their insights, experience and solutions could help."
        },
        {
            "text": "The roundtable was attended by PropTech entrepreneurs as well as influential individuals from the housing industry, public sector, and venture capital investors. Areas of discussion aligned with the core pillars of social change that DLUHC is looking to deliver through programmes of work such as the Levelling Up and Regeneration Bill. This article highlights some of the key takeaways from the event, as we acknowledge the important role that PropTech can play in modernising and reforming the planning system, and improving the productivity of wider housing and planning markets."
        },
        {
            "heading": 2,
            "text": "PropTech and the Levelling Up Missions"
        },
        {
            "text": "In our ongoing work to engage and support PropTech, we recognise there are many ways that innovative approaches can inform the department’s aims across planning, community engagement, regeneration, home ownership, private rental sector, social housing, sustainability and beyond. "
        },
        {
            "text": "At the event, the group explored how the PropTech sector’s expertise and capabilities can help us deliver against levelling up missions, while also looking at barriers that need to be addressed for greater value to be unlocked. "
        },
        {
            "text": "Emran Mian, Director General at DLUHC, shared opening remarks about the Department’s levelling up agenda, upcoming legislative changes and how PropTech might look to support place shaping, both in terms of broader master planning and delivery of development on the ground. "
        },
        {
            "text": "With Faisal Butt, Founder & CEO of Pi Labs facilitating the discussion, the group were able to dive into the following questions in the context of DLUHC’s broader vision:"
        },
        {
            "text": "Faisal’s introduction highlighted the breadth of the PropTech sector, with innovative products and business models addressing a broad range of problems: from digitising planning, to enabling community engagement, tackling housing affordability and helping the industry reach net zero. "
        },
        {
            "text": "We learnt that between Q1 2019 and Q1 2022 there was £47 billion of global venture capital investment in PropTech startups (of which circa £3.5 billion has been in the UK). The technology sector is growing, but there is still a long way to go to see digital change across housing and planning in the way that other industries like financial services have been transformed. "
        },
        {
            "heading": 2,
            "text": "Adoption and diffusion of technology"
        },
        {
            "text": "During the first part of the session, attendees discussed how the private sector can help accelerate the delivery of DLUHC’s levelling up goals. When thinking about how to drive more technology into the sector to improve productivity, the group highlighted that the issue is not always about bringing new technology to market, but that instead the current priority may need to be ‘adoption and diffusion’ of that technology."
        },
        {
            "text": "Participants emphasised that PropTech companies often have a good understanding of what some of the challenges to adoption are across the industry. For example, with many companies offering digital solutions across the planning process, PropTech firms will be speaking with Local Planning Authorities, planners and architects and will have key insights as to why adoption is still slow in many areas. This ‘on the ground’ knowledge that PropTech companies hold can help central government to better understand and address the barriers to adoption of new technologies."
        },
        {
            "text": "Discussion pointed to barriers including lack of awareness, lack of credibility, organisational inertia, skills gap and cultural changes needed. Participants called attention to the opportunity for DLUHC to help overcome these challenges and drive a greater understanding across industry and local authorities of what new efficiencies are actually possible. "
        },
        {
            "heading": 2,
            "text": "Legislation and data-driven enforcement as ‘critical enablers’ "
        },
        {
            "text": "Whilst the work of the PropTech Engagement Fund was recognised as a strong platform to support Local Planning Authorities (LPAs) in trialling digital engagement tools, key points were made throughout the session that legislation is needed as a ‘critical enabler’ for digital transformation to progress. "
        },
        {
            "text": "There was a consensus that policymakers need to legislate for things to be done in a digital way, with outdated policies seen as a barrier in numerous areas. Examples of this came from the planning world during attempts to digitise Environmental Impact Assessments, and during the creation of solutions to support first time buyers into home ownership. As one participant explained, ‘The reality is if we were to do it in a digital format, it wouldn’t gain a professional accreditation. It wouldn’t be received as a proper Environmental Impact Assessment.’ This is just one example of policy persisting from a previous era, but it is a challenge Planning policy colleagues are working to address."
        },
        {
            "text": "Attendees posed the important question of what data is required to measure the types of levelling up priorities policymakers are trying to achieve. They advised that identifying relevant measurements and data sources needs to be central to policy development and not treated as an add-on. We are working to make sure we take this approach across our priority outcomes, starting with planning data, and that we articulate relevant measurements more clearly both internally and externally. Building on this, others emphasised the importance of strong problem definition combined with understanding the necessary data flows for local authorities to both fulfil reporting requirements and provide critically enabling data for market innovation."
        },
        {
            "text": "Discussion further looked at data-driven enforcement and the role of data in supporting regulatory compliance. Although data can be a powerful enabler, conversation highlighted that any insights generated will only be able to provide maximum value if there is also resource for enforcement. An example shared in discussion about the private rental sector illustrated where a company has brought relevant data together, but where local authorities have reported they do not have sufficient bandwidth for enforcement to put the results to use. Resourcing to take action will need to be considered alongside data-driven insights in order to achieve the intended legislative outcomes. "
        },
        {
            "heading": 2,
            "text": "Championing PropTech"
        },
        {
            "text": "What became clear during the session, is that there is a need for DLUHC not to ‘underestimate the power that it has to raise the profile and bang the drum for the PropTech market more generally’ (as observed by Matthew Trimming, Senior Advisor at PUBLIC). This was reiterated by a number of attendees, who voiced that the government can always do more to signpost and raise awareness, not just of particular technologies, but of the PropTech market more generally. "
        },
        {
            "text": "It was acknowledged that government backing would not only raise awareness of the capabilities and breadth of the PropTech sector, but could also act to attract investors to the UK and serve as a point of co-education for LPAs. "
        },
        {
            "text": "Attendees agreed that Ministers should not miss the opportunity to see PropTech companies as a real success story in the making for the UK. They added that in turn the private sector must shine in its entrepreneurial role and not rely wholly on the Government to fund or drive the sector forward."
        },
        {
            "heading": 2,
            "text": "Summing up"
        },
        {
            "text": "At the closing of the event, Faisal nicely summarised the consensus reached by all, that the ‘UK sits at this really interesting intersection of a world class real estate industry and world class tech industry so we really are at the epicentre of some of the most fundamental change happening within the sector.’"
        },
        {
            "text": "Government has an important role to play in fostering relationships with the private sector in order to make it easier for existing PropTech companies to bring their skills and platforms forward, rather than those companies working in isolation to educate the market."
        },
        {
            "text": "This event served as a wonderful reminder of how we’re #DoingPlanningDifferently as a team and the vast opportunities in this space for the PropTech sector and for DLUHC as a Department. We are actively working to bring policy reforms to fully enable digital approaches in planning, and we will be speaking at events including the Public Sector Proptech Summit next month to raise awareness and champion PropTech capabilities. We intend to take on suggestions such as utilising ‘on the ground’ knowledge of barriers to adoption and identifying further opportunities to support diffusion of existing solutions across the housing and planning industries. In Faisal’s words, we can ‘achieve more, faster - with more efficiency - by listening to, collaborating with, and promoting some of the innovations in the private sector.’"
        },
        {
            "heading": 2,
            "text": "Stay in touch "
        },
        {
            "text": "Sign up to our team’s newsletter and follow the Digital Planning Team’s Twitter and LinkedIn accounts to stay up to date on the work we are doing across the PropTech Fund and beyond. You can view the Terms and Conditions of our mailing platform here."
        }
    ]
}