{
    "url": "https://mojdigital.blog.gov.uk/2022/10/21/rejoining-the-digital-workplace-as-a-part-time-developer/",
    "title": "Rejoining the Digital Workplace as a Part Time Developer",
    "authors": [
        "Jo Gilder"
    ],
    "categories": [
        "developer",
        "Digital skills",
        "digital strategy",
        "employee experience",
        "Our People",
        "Our services"
    ],
    "pub_date": "2022-10-21T15:57:33+01:00",
    "content": [
        {
            "text": "I had been out of the workplace for 3 years and last applied for a job well over 6 years ago so I started my job search by looking for advice on “returning to the workplace”. The world of applications has moved on. No longer can you expect a human to be first to read your CV and you are unlikely to have an interview where they just say “tell me about yourself”. I read about parsing software, tailored CVs and the STAR interview technique."
        },
        {
            "text": "Long Covid and continuing responsibilities meant working part-time but there are few advertised part-time developer roles so I extended the search to employers offering flexible or remote working.\nAfter several months, I was offered a role as a software developer within LAA Digital. I asked about a 3 day week. Whilst many work either 4 days or compressed hours, none of the developers work fewer than 4 days."
        },
        {
            "text": "Before agreeing, there was discussion about whether this could actually work. All development is agile which means regular “ceremonies” (meetings) such as sprint planning, retros and refinement sessions. Technical staff are also encouraged to hold meetings sharing experiences and have dedicated time to learning and development. There was a lot of concern about whether there would actually be sufficient time for me to do any development!"
        },
        {
            "text": "I offered to work different days every other week if that helped but was told no, work life balance was important too. A three day week was agreed."
        },
        {
            "text": "The team was keen to make sure I didn’t feel overwhelmed and truly did have time to fit development in whilst not being excluded from meetings. As I got to grips with new technologies and being back in the office, we all got to grips with new ways of working."
        },
        {
            "text": "Agile working actually lends itself well to a shorter week. Work is divided up, each developer usually taking on a discrete element and each element is usually no more than a few days' work in total. Unlike a job share, there is little need for handing over unfinished work."
        },
        {
            "text": "Using an instant messaging system and project tracking software means that when I start my week I can easily catch up with what I missed and when I finish my week I am able to let my team know where I am up to. A positive of hybrid working is that all meetings are now recorded so even if you are busy and can’t join live, you can catch up another time. The only real issue I have found is fitting in learning and development but that is not a problem unique to part-timers!"
        },
        {
            "text": "All in all I think everyone in the team would agree that it has worked better than we could have expected and my team members wouldn’t hesitate to recommend employing a part-time developer to other teams."
        }
    ]
}