{
    "url": "https://socialcare.blog.gov.uk/2022/10/21/we-are-social-care-nursing-conference-preview/",
    "title": "We Are Social Care Nursing: conference preview",
    "authors": [
        "Lucy Gillespie"
    ],
    "categories": [
        "Events",
        "Workforce"
    ],
    "pub_date": "2022-10-21T09:59:39+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A commitment to partnership"
        },
        {
            "text": "Last month, I attended the Chief Nursing Officer (CNO) Summit - a highlight of the NHS nursing leadership calendar, gathering chief nursing officers and nursing leaders from across health and social care."
        },
        {
            "text": "It was an important opportunity to engage in positive dialogue with colleagues. There was a real interest in the social care nursing workforce and a willingness to discuss how we work as partners across the system."
        },
        {
            "text": "The agenda included spotlight sessions, with a specific focus on social care, which were well received and well attended. A main stage presentation by Deborah Sturdy, Chief Nurse for Adult Social Care, about what we can all do to be more inclusive, drew much positive feedback."
        },
        {
            "text": "Ruth May, Chief Nursing Officer for NHS England, announced the development of a national nursing strategy, without the sector-based boundaries of previous strategies. She set out an ambition to inclusively represent the registered nursing profession and is supported by Deborah as a single professional voice for nurses working everywhere. You can find out more and have your say on the strategy here."
        },
        {
            "text": "The strategy proposes four essential areas of development:"
        },
        {
            "text": "I am delighted to see this strategy reflected in our conference agenda as we consider the future of social care nursing."
        },
        {
            "heading": 2,
            "text": "What does the future look like?"
        },
        {
            "text": "We’re proud to share the great innovation and nursing work happening in social care. The conference will give us space to think about the future and consider where we want to be as a nursing workforce in three years’ time."
        },
        {
            "text": "The agenda for the day covers nursing hot topics for workforce leaders, providers, nurses and nursing associates, student nurses and trainee nursing associates, university nursing leaders, and academics. We feel it’s important to include everybody in the conversation."
        },
        {
            "text": "We’ll showcase good nursing practice examples from across the care sector. For example, Maria Mallaband Care Group will share their experience with recruiting and developing nursing associate roles. Meanwhile, Lynn Craig from the North East will share the Integrated Care Board’s pilot to develop advanced practice roles in social care."
        },
        {
            "text": "'The state of the adult social care sector and workforce in England' report released this month reveals that 40% of our nursing workforce are from a global majority background. Our data also tells us this group faces challenges when it comes to career progression. Our conference has a breakout session on anti-racist practice, using an established model to open conversation and increase self-awareness."
        },
        {
            "text": "Earlier this year, the Nursing and Midwifery Council (NMC) revised the Specialist Proficiency Qualifications Standards and the QNI are working collaboratively across the sector to develop field specific standards for social care nursing. The NMC will host a session at the conference about the new standards and what they mean for social care."
        },
        {
            "text": "In our panel discussion, we’re bringing together leaders invested in the adult social care nursing workforce. The group will discuss what the future holds for the workforce and how we make sure we have the recognition and growth needed to support people who draw on care and support."
        },
        {
            "text": "Recognising our field specific nursing workforce and understanding what support and development learning disability nurses and mental health nurses need is crucial to growing and valuing this specialist workforce and therefore we have session for both during the afternoon."
        },
        {
            "text": "Finally, we’ll be closing the conference with a bespoke piece commissioned by Skills for Care. I had the privilege of travelling to Durham to meet the cast of ‘See Me’, a media piece recognising the importance of people in co-produced planning and care delivery."
        },
        {
            "text": "This conference is an opportunity to value nursing for the safety-critical role it provides and not a ‘nice to have’ workforce option."
        },
        {
            "text": "Sign up for your free place at the event."
        }
    ]
}