{
    "url": "https://gott.blog.gov.uk/2022/05/03/gott-welcomes-new-ceo-dr-alison-campbell/",
    "title": "GOTT welcomes new CEO Dr Alison Campbell",
    "authors": [
        "Hayley Goldsbrough"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2022-05-03T11:03:24+01:00",
    "content": [
        {
            "text": "We are very pleased to announce the appointment of Dr Alison Campbell OBE as CEO of the Government Office for Technology Transfer (GOTT) – our new knowledge assets strategic capability unit which officially launches later this year. We are very excited to welcome Alison on board to drive forward the knowledge assets work."
        },
        {
            "text": "Alison brings with her a wealth of experience in tech transfer, most recently as Director of Knowledge Transfer Ireland. She started her career in biotech and has led commercialisation and research support at King’s College London and was the interim CEO at MRC Technology, the Medical Research Council’s technology transfer company. Alison has been Chair of the Board of AUTM, the international association for technology transfer based in the USA. In 2010 she was awarded an OBE in recognition of her contribution to Knowledge Transfer."
        },
        {
            "text": "\"I’m delighted to take up this new role, helping to support the exploitation of knowledge assets from across the public sector to deliver societal and economic impact. In the Government Office for Technology Transfer we have a strong platform to build from thanks to the significant work and delivery from the Knowledge Assets Team.\""
        },
        {
            "text": "CEO Dr Alison Campbell OBE RTTP"
        },
        {
            "text": "We have some incredible milestones on the horizon, including officially introducing the unit and expanding our team to support this programme of work. Later this year, we will launch the second round of the Grant Fund and introduce a new Managed Fund. The Grant Fund provides small grants to support the development of promising public sector knowledge assets towards more investment-ready propositions. The Managed Fund focuses on making pre-seed and seed capital investments in public sector knowledge assets and will be administered by UK Innovation & Science Seed Fund. We can’t wait to discover more brilliant knowledge assets across the public sector and to see them develop through access to the funding and support they need to realise their potential."
        },
        {
            "text": "To keep up to date, please subscribe to our newsletter here. We will let you know when we officially launch the unit and keep you updated with the timescales for our two public sector funding schemes; the grant fund, investing in pre-commercial proposals, and the managed fund focused on providing pre-seed and seed capital to public sector knowledge assets."
        }
    ]
}