{
    "url": "https://educationhub.blog.gov.uk/2022/05/nadhim-zahawi-how-the-national-tutoring-programme-is-helping-children-all-over-the-country-catch-up-following-the-pandemic/",
    "title": "Nadhim Zahawi: How the National Tutoring Programme is helping children all over the country catch up following the pandemic",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-05-03T09:12:06+01:00",
    "content": [
        {
            "text": "Education Secretary Nadhim Zahawi has written to parents to tell them about how the National Tutoring Programme is helping children all over the country catch up on learning missed during the pandemic."
        },
        {
            "text": "As we start the last term of the school year, I’m writing to update you on our work to help children and young people catch up on their learning after the impact of the pandemic. I know that for many reasons lots of parents across the country are concerned about how the pandemic has disrupted their children’s education and wellbeing. I want to assure you that making up for the impact of this lost time in their education is one of my top priorities."
        },
        {
            "text": "You may have seen that as part of my paper, Opportunity for All, I made a pledge to all parents: that if your child falls behind in English or maths their school will tell you – their parents – and provide the tailored support that child needs to help them get back on track."
        },
        {
            "text": "The National Tutoring Programme provides one-to-one or small group tuition for those children who have been particularly disadvantaged by the impact of the pandemic. It is for all eligible state-funded schools – primary school pupils can receive support in literacy and numeracy, whilst secondary school pupils can receive support Maths, Science, English, Humanities and Modern Foreign Languages."
        },
        {
            "text": "Tutoring used to be something that only wealthier families could benefit from – now around 1.2 million starts have been made on tutoring courses by pupils through the Programme since November 2020. That is an incredible addition to our children’s education, and I want the numbers who benefit to continue to grow. Evidence tells us tutoring has many benefits. Class teachers who know what each child needs guide tutors in which topics to focus on. We know 77% of schools in our autumn survey told us that tutoring is helping their pupils’ progress and 80% think it is building their pupils’ confidence."
        },
        {
            "text": "Over the next 2 years, my aim is to help even more children benefit from the incredible boost tutoring can give to their learning. I am delighted that around 60% of schools have started tutoring their children this year. I want all children who need support to have access to tuition."
        },
        {
            "text": "To help parents understand how and whether schools are doing this, I am planning to publish the number of tutoring sessions each school delivers, alongside the amount of money they have been given for this. I’m doing this so you can see the numbers for your children’s school which will help to make sure those who need support get it."
        },
        {
            "text": "Please speak to your school if you want to hear more about what your school is doing to help children catch up. You can find more information about the National Tutoring Programme here. I hope you agree this is a great way to help millions of young people to get on at school. I know together we can make a difference to all our children’s futures."
        }
    ]
}