{
    "url": "https://civilservice.blog.gov.uk/2025/03/13/championing-young-adult-carers-in-the-civil-service/",
    "title": "Championing Young Adult Carers in the Civil Service",
    "authors": [
        "Civil Service"
    ],
    "categories": [
        "A Modern Civil Service"
    ],
    "pub_date": "2025-03-13T13:07:16+00:00",
    "content": [
        {
            "text": "Tamara Finkelstein DCB, introduces herself as the new Civil Service Champion for Carers and shares the experience of a young adult carer in the Civil Service"
        },
        {
            "text": "Tamara Finkelstein DCB is Permanent Secretary at DEFRA and has recently become the Civil Service (CS) champion for Carers taking over the role from Sir Alex Chisholm. Tamara talks about her commitment to hearing first hand from carers from across the CS to understand how in her role as Champion she can drive change and make a tangible difference to carers in the CS."
        },
        {
            "text": "Tamara said: “I am delighted to have very recently taken on the role of CS Carers Champion and I am looking forward to working closely with the carers networks and departmental champions and building on the great work that Alex did previously in this role.  "
        },
        {
            "text": "“I am particularly keen that I start my tenure as Champion by meeting people and taking time to listen and get underneath what the evidence, data and insight is telling us about what it feels like to be a carer in the CS."
        },
        {
            "text": "“The CS People Survey showed that 21% of civil servants are carers. Last year figures showed nearly 4000 civil servants are carers under 30. Young Adult Carers Action Day gives us all an opportunity to recognise the work that our younger carers do each and every day, and to raise awareness of some of the support services that are available to all carers within the Civil Service.”"
        },
        {
            "text": "One young carer has shared her story with us"
        },
        {
            "text": "Ciara (pronounced “kih-ra”) is 31 years old and loves cats, videogames, and creative drawing and writing. Ciara joined the civil service in 2017, encouraged by her mum who has also enjoyed a long and varied career as a civil servant. "
        },
        {
            "text": "Ciara cares for her mother who was diagnosed in 2008 with Multiple Sclerosis. Ciara’s mother was living with relative ease with the disease until her health rapidly deteriorated  over an approximate period of 2 years, following a series of events that exacerbated her condition."
        },
        {
            "text": "Ciara says: “My mother was headstrong, confident and if a little cliché to say, an inspiration. "
        },
        {
            "text": "Now, my mother is a shadow of her former self. She requires a wheelchair if we go anywhere, which isn’t often. She can walk short distances with support, but due to the overwhelming fatigue and the risk that her legs may suddenly give way due to the MS it is easier for all to use a wheelchair. She is in constant pain, takes a cocktail of drugs to just be able to face the day, and suffers from migraines almost daily."
        },
        {
            "text": "“My dad looks after mum on a daily basis, making meals and keeping her company as she hardly leaves her room, let alone the house. However, dad works too, which means mum can be by herself for a lot of the time. I will go and keep her company, make meals and keep an eye on her when she needs to shower, etc. If she needs a lift to the doctors, I go. I will push the wheelchair when we are out, I will carry all her bags, anything she needs, I will do."
        },
        {
            "text": "“My mental health has never been great, but over the past couple of years it has been harrowing to watch my mother deteriorate before my eyes, and the impact it has had on me has been immeasurable. I spoke with a local Mental Health First Aider who worked on my floorplate. After explaining everything and having a good cry, they encouraged me to contact the Employee Assistance Programme (EAP) and talk to my manager about putting a Carer’s Passport in place.  I was assigned a counsellor whom I spoke to for 6 sessions. I found it incredibly cathartic and it helped me immensely during a particularly difficult time. I also looked up Carer’s Passports, and arranged a meeting with my line manager who was and has been incredibly supportive about the whole thing. We have an understanding that I may need to leave work at a moment’s notice, or work from my parent’s house on occasion. "
        },
        {
            "text": "“I am on the Flexible Working Agreement, I go into the office, at a minimum, two days a week but aim for three where possible.  "
        },
        {
            "text": "“The future is uncertain. Mum is now retired, and can try to focus on not getting any worse. My line manager and I regularly review the Carer’s Passport, especially if my situation changes significantly enough, and I’m thankful that they have been so understanding and flexible with me.  "
        },
        {
            "text": "“A lot of the flexibility required to care for others while working a full time job relies t on the employee’s management being sympathetic. I am part of my organisation's Carers’ Network, and I try to support others where I can, using my own experiences and knowledge of policies to advise or point in the right direction. I will sing the praises of EAP and encourage anyone to look after themselves as well as others.” "
        },
        {
            "text": "Young Adult Carers Network"
        },
        {
            "text": "Ciara is a member of the Civil Service Young Adult Carers Network and as you will see, young adult carers often juggle significant responsibilities both at home and in the workplace. This balancing act can be challenging, but having the right support and a sense of community can make all the difference. That’s where the Young Adult Carers Network comes in."
        },
        {
            "text": "The network is dedicated to supporting young adult carers across the CS. Our goal is to provide a safe and inclusive space where carers can share their experiences, find understanding, and access support."
        },
        {
            "text": "We aim to support through peer discussions, sharing best practices, or advocating for change, the network is here to ensure that young adult carers feel seen, heard, and supported. By joining, you’ll be part of a growing community committed to making the CS a place where carers can flourish."
        },
        {
            "text": "If you’d like to learn more about the network or get involved, please don’t hesitate to reach out via email: Caris.Greyson@dhsc.gov.uk"
        },
        {
            "text": "Wider Support Available"
        },
        {
            "text": "We encourage all our carers to complete a carer’s passport with the help of their line manager. They may find this on their departmental intranet but we have also put it here on GOV.UK. There is also a conversation map to guide them through the process."
        },
        {
            "text": "Young people may be carers long before they start work. They may experience barriers to accessing and fully participating in education and training because of their caring roles and this can translate into barriers to employment. We are keen to break down these barriers which is why the Civil Service has included young carers in the Going Forward into Employment (GFiE) programme."
        },
        {
            "text": "The carers’ GFiE scheme is run in partnership with the Carers Trust. It is available across the civil service, year-round and nationwide.  It opens up opportunities in the civil service directly to carers, offering 12-24 month fixed term appointments with the potential for permanency in some cases. Alongside the job, the scheme offers support to candidates and their line managers."
        }
    ]
}