{
    "url": "https://mhclgdigital.blog.gov.uk/2025/03/13/open-digital-planning-a-cross-sector-partnership-to-transform-local-planning-services/",
    "title": "Open Digital Planning: a cross-sector partnership to transform local planning services",
    "authors": [
        "Matt Wood-Hill, Planning Software Service Owner"
    ],
    "categories": [
        "Digital Planning",
        "Planning Software",
        "Ways of working"
    ],
    "pub_date": "2025-03-13T14:36:48+00:00",
    "content": [
        {
            "text": "The Ministry of Housing, Communities and Local Government’s (MHCLG) Digital Planning Programme co-ordinates Open Digital Planning (ODP) – a cross-sector partnership of forward-thinking local planning authorities (LPAs) working together to create a more efficient, data-driven planning system. "
        },
        {
            "text": "Over the last 4 years, we’ve worked closely with council officers to understand their technology and data challenges and have used these insights to drive meaningful change. "
        },
        {
            "heading": 2,
            "text": "The challenge"
        },
        {
            "text": "Planning is essential to delivering the homes and infrastructure our communities need. But by modern standards the process isn’t digital, meaning it can be slow and complicated.  "
        },
        {
            "text": "Though many documents are now available online, truly ‘data-driven’ planning remains an aspiration. Few LPAs can invest time and money into digital and data skills, and most are unable to maximise the technology and data available. "
        },
        {
            "text": "Each of the 311 LPAs in England follows some national rules and guidance but sets their own planning policies and delivers services in their own way. "
        },
        {
            "text": "Since planning is interconnected – rules, policies, and technology all affect each other – digital transformation at scale is a significant co-ordination challenge. "
        },
        {
            "heading": 2,
            "text": "Open Digital Planning (ODP) "
        },
        {
            "text": "ODP brings forward-thinking councils together to share ideas and develop digital solutions that benefit everyone. ODP is how we are working with LPAs to modernise the planning system to make it fit for the 21st century. Working with the sector in this way helps us to: "
        },
        {
            "text": "ODP started following 2 local authority-led digital innovation projects – Reducing Invalid Planning Applications (RIPA) and Back Office Planning System (BOPS) – funded by MHCLG’s Local Digital Fund.  "
        },
        {
            "text": "It has since been expanded into a nationwide effort supporting LPAs in several key areas: "
        },
        {
            "text": "New product development: a pioneering group of LPAs are co-designing user-friendly alternative planning application software to speed up planning decisions. The 3 products in the suite – PlanX, BOPS, and the Digital Planning Register are already being used in several authorities, with some already cutting processing times by 30% per application. Our role is to establish the right culture and working environment for co-design at scale, to guide product strategy in line with ministerial priorities, and to gather insights that inform our programme delivery. "
        },
        {
            "text": "PropTech (property technology) pilots: MHCLG’s PropTech Innovation Fund has supported LPAs to experiment with emerging technologies and new market offerings since 2021. So far, projects have covered digital citizen engagement, land assessment, artificial intelligence use in planning, and more. 77 LPAs have been funded to date. Our role is to set the challenge areas to be addressed in each funding round, and to support teams to share their learnings and the impact of their work. "
        },
        {
            "text": "Data sharing: Digital planning requires trustworthy data. MHCLG’s Planning Data service helps LPAs to openly publish several key datasets which are held locally: Conservation Areas, Article 4 Directions, Listed Buildings, and Tree Preservation Orders. These can be collected and made available through the national Planning Data Platform, powering a marketplace of planning products and services. Working groups in ODP provide shared spaces for support and feedback so that we can iterate the data standards and identify other datasets useful for improving planning. At least 55 LPAs have currently made their data available through the platform.  "
        },
        {
            "text": "Digital Planning improvement: Many LPAs need help getting started with digital improvements. ODP runs a Digital Planning Maturity Assessment service for LPAs to baseline where they are today and to create a self-directed action plan. Our team delivers training through a combination of virtual and in-person sessions and runs working groups to support further knowledge sharing.  "
        },
        {
            "text": "The ODP network creates spaces for activities and conversations that otherwise wouldn’t happen and gets participants and their organisations ready to start using modern technology, data and working practices. Here’s what some members have said: "
        },
        {
            "heading": 2,
            "text": "MHCLG’s role "
        },
        {
            "text": "We are reframing the relationship between local authorities and MHCLG. Typically, central government defines policy, which is then implemented locally. This doesn’t work in the context of service transformation, where a test-and-learn mindset requires close collaboration, increasing the chances of success.  "
        },
        {
            "text": "LPAs are empowered to be central to the transformation of planning. ODP isn’t ‘owned’ by a single organisation – it's a genuine transformation partnership united by a shared mission. This approach ensures we develop solutions that truly work on the ground, combining local expertise with national resources. "
        },
        {
            "heading": 2,
            "text": "Community coordination "
        },
        {
            "text": "Supporting digital transformation requires careful coordination, and this is often overlooked. We have evolved our support offer over the last few years; our team helps LPAs stay connected and work together effectively through: "
        },
        {
            "text": "We’re delighted by how organic this way of working has become, and how much practical wisdom is shared between LPA teams every day. The peer network strengthens bonds and encourages continuous learning and professional growth. "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "ODP continues to grow, with more LPAs joining and new projects launching to tackle emerging challenges.  "
        },
        {
            "text": "In December 2024 the Digital Planning Programme Steering Board endorsed ODP’s continued growth as the key vehicle for scaling digital transformation across England’s planning system.  "
        },
        {
            "text": "We’re already working with teams across MHCLG in planning and the built environment service areas to explore how ODP can improve outcomes, or where a similar partnership model could add value. "
        },
        {
            "text": "In the short term, we’ll soon announce the results of a recent round of funding for LPAs. Over the next year, we’re excited to welcome more LPAs into the network and support new LPA-led projects in collaboration with established software vendors and emerging digital planning solutions. Stay tuned! "
        },
        {
            "heading": 2,
            "text": "Get involved "
        }
    ]
}