{
    "url": "https://cddo.blog.gov.uk/2025/03/13/techtrack-revolutionising-digital-apprenticeships-in-the-civil-service/",
    "title": "TechTrack: revolutionising digital apprenticeships in the Civil Service",
    "authors": [
        "Angie Jones, Strategic Communications Lead, GDS",
        "Richard Kelly, Digital Capability Programme Lead, GDS"
    ],
    "categories": [
        "Digital strategy",
        "Government Digital and Data"
    ],
    "pub_date": "2025-03-13T10:36:02+00:00",
    "content": [
        {
            "text": "The UK Government is embarking on an ambitious digital transformation of public services as outlined in the blueprint for a modern digital government released earlier this year. TechTrack, our innovative digital apprenticeship programme, is at its heart. This programme will bring in 2,000 talented apprentices into Whitehall departments by 2030, creating a powerful pipeline of digital expertise across government and comes alongside a wider announcement to nearly double the number of civil servants working in digital and data roles. Alongside the reskilling of thousands of existing civil servants, TechTrack represents a bold commitment to ensuring we have the critical skills needed to revolutionise public services through technology - generating opportunities nationwide and delivering tangible benefits to citizens."
        },
        {
            "text": "In February, we proudly welcomed our first cohort of 50 TechTrack apprentices who have begun their digital apprenticeship journey. We celebrated these pioneers during National Apprenticeship Week with a special welcome event on Monday 10 February at Whitehall led by Minister Feryal Clark, Parliamentary Under-Secretary of State at the Department for Science, Innovation and Technology."
        },
        {
            "text": " The programme opened in Summer 2024 and we were delighted to see that the applications we’ve received for the first cohort, which included the first two apprenticeship roles of Software Developers and DevOps Engineers demonstrated a diverse pool. This included 70% of applicants coming from minority backgrounds and over 60% based outside of London."
        },
        {
            "heading": 2,
            "text": "Why digital matters in government"
        },
        {
            "text": "From accessing healthcare to filing taxes, and from applying for passports to checking their state pension, behind these services are talented digital professionals who transform complex policy into user-friendly solutions that work for everyone."
        },
        {
            "text": "TechTrack isn't just another apprenticeship programme – it's a ground-breaking initiative designed to address the most critical digital skills gaps in government and a unique opportunity to join the growing Government Digital and Data community of experts transforming lives through technology. Apprentices earn a competitive salary while gaining valuable qualifications and real-world experience. Each role offers clear progression opportunities within government, with many apprentices going on to secure permanent positions and build rewarding careers. "
        },
        {
            "text": "Our initial focus is on the four most in demand roles:"
        },
        {
            "heading": 2,
            "text": "Be part of something special"
        },
        {
            "text": "We're excited to see the first cohort starting in roles right now and making their mark across nine government departments, including the Ministry of Justice, the Department for Energy Security and Net Zero and the Department for Education."
        },
        {
            "text": "One of our new apprentices, Hannah Hargreaves, who joined HMRC as a DevOps Engineer, reflects on what drew her to the programme: \"Technology has interested me for years but I hadn't known what path to take or what role would suit me best. This apprenticeship programme has the structure and the learning community I want, and paves a pathway in tech with the security I need.\""
        },
        {
            "heading": 2,
            "text": "What makes TechTrack different?"
        },
        {
            "text": "What sets TechTrack apart is how apprentices develop the skills needed to lead digital transformation projects, learning how to guide teams, influence decisions, and shape the future of government services. "
        },
        {
            "text": "Our apprentices won't just be learning theory - they’ll be putting skills into practice from day one. From developing AI-powered features that make services more responsive to user needs to analysing data to improve service design and implementing smart security measures to protect sensitive information, or collaborating with policy experts to turn innovative ideas into reality.  You can read more in our previous blog."
        },
        {
            "heading": 2,
            "text": "Your digital journey starts here"
        },
        {
            "text": "It's an exciting time to be part of the programme, so join us. Whether you're passionate about coding, problem-solving, or protecting digital services, TechTrack offers a unique pathway into a meaningful tech career. We're looking for curious minds, problem solvers, and people who want to make government services work better for everyone. If you're ready to earn while you learn, tackle complex challenges, and develop in-demand skills - whether you're already a civil servant or looking to start your government career - join us in building a modern digital government."
        },
        {
            "text": "Ready to start your digital journey? Discover our tech career opportunities and be the first to know when applications open for our next cohort."
        },
        {
            "heading": 2,
            "text": "Secure your department's digital future"
        },
        {
            "text": "Is your department looking to build its digital capability? Join the growing number of departments already benefiting from TechTrack's pool of diverse, talented apprentices ready to make an impact. Departments can get involved and talk to our apprenticeship providers about how to bid for TechTrack talent on our dedicated platforms:"
        },
        {
            "text": "TechTrack is led by the Government Digital Service (GDS), the digital centre of government and part of the Department of Science, Innovation and Technology. As the digital heart of government, GDS exists to serve the public, departments and the wider public sector, ensuring digital services work better for everyone."
        }
    ]
}