{
    "url": "https://accessibility.blog.gov.uk/2025/03/13/text-digitised-and-videotape-video-transcripts-help-everyone-not-just-people-with-access-needs/",
    "title": "Text (digitised) and videotape: video transcripts help everyone, not just people with access needs",
    "authors": [
        "Susan Walton, Communications Officer, Ministry of Defence"
    ],
    "categories": [
        "Accessibility"
    ],
    "pub_date": "2025-03-13T09:15:37+00:00",
    "content": [
        {
            "text": "From stumbling across comments on an online forum I learnt that, like me, many people at work prefer reading or /scanning video transcripts rather than watching the videos themselves. This really interested me, and led me to wonder how many other people preferred to read video transcripts, and was it for the same reason?"
        },
        {
            "text": "For context, I should explain that I work in Internal Communications in the Ministry of Defence, and on our intranet, we provide separate transcripts with our videos to ensure the widest majority of our colleagues can access and understand the content. In addition to captions within the video itself, the transcript is displayed below the video. "
        },
        {
            "text": "Adding these features ensures our video content is accessible to people with disabilities. Captions help those with hearing impairments follow the audio, while transcripts assist individuals with cognitive disabilities in understanding the content. These features also benefit people with attention difficulties and those with visual impairments who may prefer using screen readers/web narrators to read text on web pages. "
        },
        {
            "text": "Additionally, captions and transcripts offer greater flexibility for users with motor disabilities. Altogether, this ensures our video content fully complies with the Web Content Accessibility Guidelines (WCAG) 2.2 AA standard. "
        },
        {
            "text": "We provide headsets for online meetings and to quietly watch work related videos in the office and at home."
        },
        {
            "text": "However, I was particularly interested in how our colleagues interacted and used video transcripts if they did not have any particular accessibility requirements. Although my results are focused on the behaviours of internal MOD colleagues, I suspect the results are similar for external audiences too."
        },
        {
            "text": "I asked a cross section of Ministry of Defence personnel questions on whether they preferred to watch videos, read the transcripts, or both, and their reasons.  "
        },
        {
            "text": "I really wanted to understand the motivation and reason for their choices. I listed some possible examples based on what I already knew from reading and talking to stakeholders. There was a free text option too. They could select more than one statement and complete the free text option."
        },
        {
            "heading": 2,
            "text": "The questions"
        },
        {
            "text": "Non-accessibility reasons for reading video transcripts:"
        },
        {
            "text": "Reasons for watching videos:"
        },
        {
            "text": "Reasons for both watching videos and reading the transcripts:"
        },
        {
            "heading": 2,
            "text": "The results"
        },
        {
            "text": "We had 87 respondents, and we discovered:"
        },
        {
            "text": "Some people said they would watch a video if they had time (or if it was short) otherwise they would read the transcript. The topic of the video was also a deciding factor on whether they chose to watch or read the content."
        },
        {
            "text": "Other reasons people gave for only reading video transcripts were, “I don't like wearing a headset” and “Bandwidth”. "
        },
        {
            "heading": 2,
            "text": "Accessibility is usability"
        },
        {
            "text": "We may provide transcripts for accessibility reasons; however, people read and use transcripts for many non-accessibility reasons too. Video transcripts are treated as a standalone piece of content. "
        },
        {
            "text": "This clearly demonstrates that when we present content in accessible ways, it benefits all users, regardless of their  needs."
        }
    ]
}