{
    "url": "https://movingon.blog.gov.uk/2025/03/13/the-importance-of-load-security/",
    "title": "The importance of load security ",
    "authors": [
        "Mark Horton"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2025-03-13T11:15:00+00:00",
    "content": [
        {
            "text": "Load security is incredibly important but is often overlooked. It’s a topic which may not seem exciting or interesting, but the consequences of neglecting it can be truly devastating.  "
        },
        {
            "text": "Back in December 2024, Driver Vehicle Standards Agency (DVSA) updated its load security guidance to help operators ensure their loads are properly secured. Changes included: "
        },
        {
            "heading": 2,
            "text": "A tragic reminder "
        },
        {
            "text": "The tragic story of Harry Dennis - an 11-year-old who lost his life due to an insecure load - highlights just how critical this issue is.  "
        },
        {
            "text": "Harry was killed in 2022 when the driver of a light goods vehicle carrying scaffolding failed to secure its load. The driver, Russell Le Beau, pleaded guilty to causing death by dangerous driving and was sentenced to 4 years in prison and disqualified from driving for 7 years. In court, he admitted that he hadn’t received any training on load security for 15 years - which he blamed for the incident.  "
        },
        {
            "text": "This heartbreaking incident is a reminder of the importance of proper training and diligence. It’s not just about following rules; it’s about saving lives.  "
        },
        {
            "heading": 2,
            "text": "Prevention through guidance, prohibitions and prosecutions "
        },
        {
            "text": "DVSA encounters around 2,000 vehicles each year with insecure loads. These vehicles are stopped from continuing their journey until the load is secured, often resulting in fixed penalties or prosecutions for the drivers. This proactive approach is crucial in preventing further tragedies.  "
        },
        {
            "text": "Had the driver in Harry’s case been more diligent and kept up to date with the basic requirements for driving a commercial vehicle, he would have known to secure the load properly. But it’s not just on the drivers – operators have a big responsibility too. They need to make sure staff are properly trained and fully aware of all requirements. Regular training sessions and updates can go a long way in preventing oversights and ensuring safety. By investing in employee knowledge and skills, operators can significantly reduce the risk of incidents. "
        },
        {
            "text": "DVSA’s load security code of practice provides extensive guidance, including specific sections on scaffolding which is a known area of concern identified by enforcement examiners. The guidance is easy to understand and avoids any technical jargon - so, everyone can follow it.  "
        },
        {
            "text": "The Guide to Maintaining Roadworthiness (GTMR) also offers operators clear instructions and reminders about their responsibilities. It emphasises the importance of daily walkaround checks and inspections to ensure vehicles are safe to drive.  "
        },
        {
            "text": "Maria Dennis, Harry’s mother, has been working to promote road safety. Her courage and dedication to preventing similar tragedies is truly inspiring.  "
        },
        {
            "text": "“Every day, I live with the pain of losing my son. No family should have to endure this heartbreak.  "
        },
        {
            "text": "“I am dedicated to promoting road safety to ensure no other lives are lost due to preventable negligence. I am committed to working with enforcement agencies – such as the Police and DVSA – to help raise awareness, improve industry standards and share best practice.  "
        },
        {
            "text": "“It’s crucial that everyone follows the guidance and regulations in place to secure loads properly. Together we can make our roads safer for everyone.” "
        },
        {
            "heading": 2,
            "text": "Commit to following the guidance  "
        },
        {
            "text": "The guidance isn’t just for HGVs – it covers a range of vehicles, including vans and other light goods vehicles. Remember, every vehicle carries a risk if not properly managed and loaded.  "
        },
        {
            "text": "Whether you’re an operator, manager, transport manager or responsible for loading any type of vehicle - please make sure you’re familiar with and follow the guidance, so that you can ensure vehicles are loaded safely and appropriately.  "
        },
        {
            "text": "It’s not just about compliance; it’s about keeping our road safe and protecting lives.  "
        },
        {
            "text": "What steps do you take to ensure safety? Comment below to share your best practice! "
        }
    ]
}