{
    "url": "https://mhclgmedia.blog.gov.uk/2025/03/13/the-nature-restoration-fund-in-the-planning-and-infrastructure-bill/",
    "title": "The Nature Restoration Fund in the Planning and Infrastructure Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-03-13T17:49:45+00:00",
    "content": [
        {
            "text": "On Tuesday, the Government introduced the Planning and Infrastructure Bill to Parliament – alongside which Parliament has published the normal explanatory notes for legislation, and the Government has published a guide to the Bill and a set of fact sheets on key measures."
        },
        {
            "text": "One of those key measures is the establishment of the Nature Restoration Fund (NRF). This marks a wholly new way for developers to discharge environmental obligations by making a payment, with that funding then used by Natural England to take a strategic approach to nature restoration."
        },
        {
            "text": "The NRF is the result of significant engagement across the development sector, environmental groups, and nature service providers since last summer, with the final model building on the proposals the Government set out last December in its working paper. And yesterday saw a range of voices welcoming the new approach it brings to unlocking a win-win for development and for nature."
        },
        {
            "text": "With the Bill now public, some people are understandably asking whether the NRF means an end to costly scheme-by-scheme interventions, such as the HS2 bat tunnel. There are three principal challenges: does the legislation do enough to establish an alternative to the current rules; will the Government and Natural England move fast enough to implement the NRF, such that it supports development in the near term; and will the payments required of developers be set at an appropriate level?"
        },
        {
            "text": "This blog outlines three key features of the NRF that the Government is confident means we will meet these tests, and stop talking about issues like bat tunnels and nutrient neutrality."
        },
        {
            "text": "Outcomes focussed approach"
        },
        {
            "text": "First and most importantly, the NRF is built around delivering overall positive outcomes for protected sites and species, rather than forcing a rigid focus on individual sites and particular specimens."
        },
        {
            "text": "The flexibility under this model means that Natural England can take forward actions that protect and improve the conservation status of sites and species, rather than developers having to go to sometimes extreme lengths to try and precisely calculate and offset the impact of each project."
        },
        {
            "text": "This is the right way to deliver better outcomes for nature, and to enable developers to get on with building the homes and infrastructure we need. And it is achieved by providing a new route in primary legislation that allows for this flexibility, without being bound by the constraints of the status quo. "
        },
        {
            "text": "But this new route can be used only where an Environmental Delivery Plan is in place, which tells developers how much they need to pay, and gives everyone confidence in the strategic measures that will be taken to improve the overall status of the habitat or species in question. Where this is not the case, existing environmental assessment requirements will continue to apply."
        },
        {
            "text": "Environmental Delivery Plans"
        },
        {
            "text": "So what is an Environmental Delivery Plan? The NRF is designed to be modular, because we want to use this new approach to provide a better way of dealing with the impact of development on both protected habitats and species. And that can only be done sensibly if we allow for different actions to be taken in different places for different issues.  "
        },
        {
            "text": "Environmental Delivery Plans are how this will happen in practice. In creating an Environmental Delivery Plan, either on its own initiative or at the request of the Secretary of State, Natural England will set out a package of conservation measures sufficient to address one or more environmental impacts of development and secure an environmental uplift for the relevant environmental feature."
        },
        {
            "text": "Different Environmental Delivery Plans will be aimed at different scales. Some will pool resources from lots of development and deliver conservation measures at scale to maximise the outcome for the environment. Others could be directed at a single, large development."
        },
        {
            "text": "So in the case of a protected species, an Environmental Delivery Plan would include conservation measures that ensured an improvement in the overall conservation status of the species, recognising that in some places where development occurred there might be impacts on specific specimens. This principle is already applied in practice with respect to District Level Licensing for Great Crested Newts."
        },
        {
            "text": "And while Environmental Delivery Plans will mainly be deployed to address issues like nutrient neutrality across different types of development, the model also allows for Natural England to be tasked with developing a comprehensive Environmental Delivery Plan to cover relevant environmental impacts for a specific infrastructure project. This aligns with our push for better strategic planning where Environmental Delivery Plans could de-risk projects and speed growth for the economy and nature."
        },
        {
            "text": "We are confident this is the right model – one which allows for a new strategic approach, but only where people can be confident it will work and deliver the outcomes we need to see for nature as well as development."
        },
        {
            "text": "And we are also confident that we can get Environmental Delivery Plans in place fast. That is why the Government has been clear it wants to see the first Environmental Delivery Plans prepared alongside the Bill, and operational for developers to use shortly after Royal Assent. The Government will also look at opportunities to provide upfront funding to commence actions in advance of need, with costs recovered over time as development comes forward, allowing for homes and infrastructure to be unlocked more quickly."
        },
        {
            "text": "Clarity for developers"
        },
        {
            "text": "Finally, once in place, developers will be able to pay to contribute to the delivery of the Environmental Delivery Plan. Under the legislation, this is considered as discharging the developers' relevant obligations. This means that for the issues covered in the Environmental Delivery Plan, developers will no longer need to undertake an Appropriate Assessment, or take any other actions themselves. It will be for Natural England to deliver the necessary measures to secure environmental improvement. This will not only save time for developers but it will reduce the risk of legal challenge to projects which has led to so much additional cost and delay."
        },
        {
            "text": "Crucially, where an Environmental Delivery Plan exists, the legislation is clear that these should not undermine the economic viability of development and the Secretary of State will be able to reject an Environmental Delivery Plan where the tariff is too high. But it is important to remember that these are existing environmental obligations where developers already have to pay to address the impact of development and by moving to a strategic approach we can drive down costs through strategic action and economies of scale."
        },
        {
            "text": "There will, of course, be circumstances where an Environmental Delivery Plan isn’t the right approach and we cannot use these to put our protected sites and species at risk of irreparable harm. However, this new system will allow developers to understand upfront where they can benefit from this new approach. As the coverage of Environmental Delivery Plans extends to more and more issues, developers will be able to benefit from more environmental obligations being discharged in this way."
        },
        {
            "text": "While this will take some time to build up, this is a major shift that will fundamentally change the relationship between development and the environment for the better."
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "So is this the end of bat tunnels? Taken together, we are confident that the NRF gives us the model we need avoid this sort of expensive intervention in the future, and focus more on driving meaningful outcomes for nature at the right scale."
        },
        {
            "text": "That is why we are supporting Natural England to develop these at pace and are working to prioritise the implementation of Environmental Delivery Plans to support our housing and infrastructure ambitions."
        }
    ]
}