{
    "url": "https://companieshouse.blog.gov.uk/2025/03/13/third-party-providers-get-ready-to-register-as-an-authorised-corporate-service-provider/",
    "title": "Third-party providers: Get ready to register as an Authorised Corporate Service Provider",
    "authors": [
        "Mark Buckley - Implementation Lead, ACSP"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2025-03-13T09:52:39+00:00",
    "content": [
        {
            "text": "On 18 March 2025, Companies House will launch our new ‘Apply to register as a Companies House authorised agent’ service. Find out how to get your business ready."
        },
        {
            "heading": 2,
            "text": "Service launch"
        },
        {
            "text": "We recently published a blog post on what third-party providers, such as accountants and legal professionals, need to know about becoming an Authorised Corporate Service Provider (ACSP), also known as an authorised agent. Since then, we’ve been busy developing the registration service."
        },
        {
            "text": "The ‘Apply to register as a Companies House authorised agent’ service launches on 18 March 2025. Third-party providers who plan on carrying out identity verification checks on behalf of clients for Companies House will need to register as an ACSP from this date."
        },
        {
            "text": "From spring 2026, third-party providers will also need to be registered as an ACSP to make any filings on behalf of other companies. "
        },
        {
            "text": "There will be a fee of £55 to register as an ACSP."
        },
        {
            "heading": 2,
            "text": "Completing the registration process"
        },
        {
            "text": "To register as an ACSP, businesses must be supervised within the UK by an Anti-Money Laundering (AML) supervisory body. There are currently 25 supervisory bodies in the UK. When registering as an ACSP, businesses will need to provide their AML supervisory body membership number."
        },
        {
            "text": "The ACSP registration process will need to be completed by someone who holds a senior role within the business, such as a director. During the registration process, they will be asked to verify their identity through GOV.UK One Login."
        },
        {
            "text": "After an ACSP registration has been completed, a digital account and a unique identity number will be provided."
        },
        {
            "text": "Once the account has been approved, other employees of the ACSP can then be added to the account. These employees will not have to verify their identity, but will be allowed to carry out services on behalf of the ACSP, such as identity verification checks and filing accounts for clients."
        },
        {
            "heading": 2,
            "text": "Get ready to register"
        },
        {
            "text": "There are 4 key things you can do to prepare your business for ACSP registration:"
        },
        {
            "heading": 2,
            "text": "Verifying your clients’ identity"
        },
        {
            "text": "From 8 April 2025, company directors and people with significant control (PSCs) will be able to voluntarily verify their identity for Companies House."
        },
        {
            "text": "Directors and PSCs will be able to verify their identity directly through GOV.UK One Login, or through a third-party provider who has registered and been approved as an ACSP."
        },
        {
            "text": "If you’re a third-party provider who plans to carry out identity verification checks on behalf of clients, you can prepare by registering once the ‘Apply to register as a Companies House authorised agent’ service launches on 18 March 2025."
        },
        {
            "text": "For now, only providers that plan to verify the identity of clients need to register. In the future, all providers that file with Companies House on behalf of clients will need to register as an ACSP."
        },
        {
            "heading": 2,
            "text": "The importance of staying compliant"
        },
        {
            "text": "In the future, if an ACSP is found to be noncompliant (for example if they lose their AML supervision status) Companies House may suspend their account whilst any misconduct is investigated."
        },
        {
            "text": "Companies House may also cease their status as an ACSP if they are deemed unfit to carry out ACSP functions. Public notices will be published when an ACSP has been suspended or removed. It’s important to make sure your business stays compliant with the legislation, even after the registration process is complete and approved."
        }
    ]
}