{
    "url": "https://ukhsa.blog.gov.uk/2025/03/13/what-is-space-weather-and-why-are-we-monitoring-it/",
    "title": "What is space weather, and why are we monitoring it?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2025-03-13T15:10:46+01:00",
    "content": [
        {
            "text": "Space weather occurs when explosive events near the Sun’s surface project strong radiation fields towards the Earth. These events typically peak during solar maximum – a cycle that occurs approximately every 11 years – but serious events can also happen during solar minimum. Currently, we are experiencing a maximum, with solar activity at its highest level in more than 2 decades."
        },
        {
            "text": "As the Sun reaches its most active period in 22 years, we’re increasingly aware of the risks we face from severe space weather events. An example of this was seen in the ‘Mothers’ Day Storm’ in May 2024, which produced aurora visible across southern England. This was the strongest solar storm since 2003 to hit the Earth’s upper atmosphere. There were stunning images to be seen, but UKHSA scientists were also studying these events to work out whether they posed a risk to people."
        },
        {
            "text": "These solar phenomena may seem distant, but their potential impacts on public health and national infrastructure are significant enough to be included on the National Risk Register. For this reason, the UK government takes this risk very seriously. "
        },
        {
            "heading": 2,
            "text": "Understanding the threat"
        },
        {
            "text": "The consequences of severe space weather could be far-reaching, potentially disrupting electrical power grids, transport and satellite operations: satellite disruptions can cause the loss of GPS, which has navigational impacts. "
        },
        {
            "text": "However, a particularly concerning aspect for the Radiation, Chemical, Climate and Environmental Hazards Directorate within UKHSA is the radiation exposure risk to both workers and the general public. Those at greatest risk include individuals in high-altitude aviation and space environments, where the magnetic and atmospheric protection offered by the Earth is reduced."
        },
        {
            "text": "The threat related to the aurora is chiefly from the magnetic fields that cause them, which can induce currents in conductors at sea level. These magnetic fields caused a major electricity grid failure in Ottawa in 1989 and less significant grid failures in South Africa and Sweden more recently. But none of the events that caused those impacts were close to being as powerful as the 1859 Carrington Event, which caused geomagnetic storms and disruption to telegraph communications. It is often taken as a benchmark for a worst-case scenario, but historic records show that events in the one-in-a-thousand-year category could be much worse even than the Carrington Event."
        },
        {
            "text": "An event that emits very high energy protons would be the most significant in terms of radiation experienced by people. In this regard the May 2024 event was not major, but radiation was still detectable at sea level from a relatively small peak in radiation dose rates."
        },
        {
            "text": "Government response"
        },
        {
            "text": "Recognising the potential severity of this ‘low frequency, high impact’ threat, the Department for Energy Security and Net Zero (DESNZ) is leading cross-government response planning. UKHSA has been contributing expertise specifically related to radiation exposure during commercial flights. Arrangements for a severe space weather event are regularly exercised to test preparedness, including the advice we feed into the Scientific Advisory Group for Emergencies (SAGE)."
        },
        {
            "heading": 2,
            "text": "Advancing our monitoring capabilities"
        },
        {
            "text": "Until recently, the UK lacked the capability to estimate radiation doses in real time during severe space weather events. This crucial gap is now being addressed through the Space Weather Instrumentation, Measurement, Modelling and Risk project (SWIMMR), which has developed improved measurement capabilities that enable rapid assessment of radiation exposure."
        },
        {
            "text": "Key advances include:"
        },
        {
            "heading": 2,
            "text": "Practical applications and future planning"
        },
        {
            "text": "Working with the Space Environment Impacts Expert Group (SEIEG), UKHSA is developing forecasting capabilities to identify high-risk periods when commercial flight patterns might need adjustment. These recommendations would only be implemented during the most extreme solar conditions."
        },
        {
            "text": "On-board flight monitors are already operational, with efforts underway to extend their use on long-haul flights to improve nowcasting accuracy. These practical applications represent significant progress in the UK's ability to respond to severe space weather events."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "The next 2 to 3 years will provide a critical test of these new capabilities and response frameworks, before we face the next solar maximum expected in the mid-2030s. However, major space weather events can happen at any stage in the solar cycle, so even during the solar minimum there is no room for complacency."
        },
        {
            "text": "This period will be crucial for refining our understanding and responses to space weather threats, ensuring the UK remains resilient to these cosmic challenges that, while invisible to most, could have profound impacts on our technologically dependent society."
        },
        {
            "text": "Rick Tanner,  Radiation Metrology Group Leader, UKHSA said: "
        }
    ]
}