{
    "url": "https://food.blog.gov.uk/2025/02/27/a-message-from-fsa-chair-susan-jebb/",
    "title": "A message from FSA Chair Susan Jebb",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-02-27T16:24:07+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Last week’s news that inflation had increased from 2.5% to 3% in January was a reminder that higher food prices will continue to be a concern for many households this year."
        },
        {
            "text": "Food insecurity and its impact on peoples’ diets is something that the FSA has been focussed on since the pandemic, particularly as food prices increased in the wake of global events after the invasion of Ukraine."
        },
        {
            "text": "Our Annual Report on Food Standards and our contribution to the most recent Defra-led UK Food Security Report show that the proportion of households experiencing food insecurity has increased from 8% in 2020 to 10% in 2023. That’s around an extra one million people facing real hardship. This means some families having to make very difficult choices, whether its parents skipping meals to feed their children or people taking more risks with their food, like ignoring Use By dates."
        },
        {
            "text": "Earlier this month, I spoke alongside Defra Minister Daniel Zeichner at the launch of the Food Foundation’s report ‘The Broken Plate’, which showed that the cost of essential healthy foods – particularly dairy products and vegetables – has risen sharply in recent years, putting nutritious diets even further out of reach for many. We were joined by MPs from across the political spectrum and I was pleased to have the opportunity to discuss with them the need to deliver safe, healthy, sustainable food as the default across the food system."
        },
        {
            "text": "It’s important for organisations like the FSA to gather insights into food insecurity, but we also need to find solutions. We need a food system that’s fair and works for everyone, where a healthy diet isn't a luxury. A system that ensures our collective food security and adequately rewards those who produce and prepare the food we enjoy. I am keen that the FSA plays its part in the development and delivery of the cross-government food strategy announced by the Defra Secretary of State, Steve Reed."
        },
        {
            "text": "At a time when government is looking closely at public expenditure, it’s important to remember that costs of inaction far outweigh the investment needed to deliver a safe, healthier, and more sustainable supply of food for all."
        },
        {
            "heading": 1,
            "text": "Neges gan Susan Jebb, Cadeirydd yr ASB"
        },
        {
            "text": "Wrth glywed y newyddion yr wythnos diwethaf fod chwyddiant wedi cynyddu o 2.5% i 3% ym mis Ionawr, cawsom ein hatgoffa y bydd prisiau bwyd uwch yn parhau i fod yn bryder i lawer o gartrefi eleni."
        },
        {
            "text": "Mae’r ASB wedi bod yn canolbwyntio ar ddiffyg diogeledd bwyd a’i effaith ar ddeiet pobl ers y pandemig, yn enwedig wrth i brisiau bwyd gynyddu yn sgil digwyddiadau byd-eang ar ôl goresgyniad Wcráin."
        },
        {
            "text": "Mae ein Hadroddiad Blynyddol ar Safonau Bwyd a’n cyfraniad at Adroddiad Diogeledd Bwyd diweddaraf y DU, a arweiniwyd gan Defra, yn dangos bod y gyfran o aelwydydd sy’n profi diffyg diogeledd bwyd wedi cynyddu o 8% yn 2020 i 10% yn 2023. Mae hynny’n golygu bod tua miliwn o bobl ychwanegol yn wynebu caledi gwirioneddol. O’r herwydd, mae’n rhaid i rai teuluoedd wneud dewisiadau anodd iawn: mae rhieni yn hepgor prydau bwyd er mwyn bwydo’u plant ac mae pobl yn cymryd mwy o risgiau gyda’u bwyd, fel anwybyddu dyddiadau ‘defnyddio erbyn’."
        },
        {
            "text": "Yn gynharach y mis hwn, ochr yn ochr â Gweinidog Defra, Daniel Zeichner, siaradais yn lansiad adroddiad y Sefydliad Bwyd ‘The Broken Plate’, a ddangosodd fod cost bwydydd iach hanfodol – yn enwedig cynhyrchion llaeth a llysiau – wedi codi’n sydyn dros y blynyddoedd diwethaf, gan wthio deiet maethlon hyd yn oed ymhellach allan o gyrraedd llawer o bobl. Ymunodd ASau o bob rhan o’r sbectrwm gwleidyddol â ni, ac roeddwn yn falch o gael y cyfle i drafod yr angen i sicrhau bod bwyd diogel, iach a chynaliadwy ar gael i bawb ar draws y system fwyd."
        },
        {
            "text": "Mae’n bwysig i sefydliadau fel yr ASB gasglu gwybodaeth am ddiffyg diogeledd bwyd, ond mae angen i ni ddod o hyd i atebion hefyd. Mae angen system fwyd sy’n deg ac yn gweithio i bawb, lle nad yw deiet iach yn foethusrwydd anghyffredin. Mae angen system sy’n sicrhau ein diogeledd bwyd ni i gyd, a honno’n system sy’n gwobrwyo’n ddigonol y rhai sy’n cynhyrchu ac yn paratoi’r bwyd rydym yn ei fwynhau. Rwy’n awyddus i’r ASB chwarae ei rhan wrth ddatblygu a chyflawni’r strategaeth fwyd drawslywodraethol a gyhoeddwyd gan Ysgrifennydd Gwladol Defra, Steve Reed."
        },
        {
            "text": "Ar adeg pan fo’r llywodraeth yn edrych yn fanwl ar wariant cyhoeddus, mae’n bwysig cofio bod diffyg gweithredu yn costio llawer mwy na’r buddsoddiad sydd ei angen i ddarparu cyflenwad bwyd diogel, iachach a mwy cynaliadwy i bawb."
        }
    ]
}