{
    "url": "https://dragonsden.blog.gov.uk/2025/02/27/dragons-den-ip-blog-series-22-episode-8/",
    "title": "Dragons’ Den IP Blog - Series 22 Episode 8",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "International",
        "IP",
        "Licensing",
        "Patents"
    ],
    "pub_date": "2025-02-27T21:00:00+00:00",
    "content": [
        {
            "text": "Dragons' Den never fails to surprise me, but tonight's episode was on another level. As someone who quite obviously has a love for intellectual property (IP), I found myself frantically taking notes one moment and then wiping away my tears the next. From expertly protected innovations to heartfelt personal journeys, it was a powerful reminder that while patents and trade marks protect our innovation, it's the stories behind them that truly move us."
        },
        {
            "text": "The Den witnessed four extraordinary pitches tonight, but it was the first one that set my IP pulse racing. Fresh from the rolling hills of Monmouth, Welsh inventors Lisa and Antony Hicks strode confidently into the Den. They were armed with innovation that would soon have five Dragons leaning forward in their chairs. Their opening gambit? £50,000 for a 5% stake in their business. But the real story was yet to unfold..."
        },
        {
            "heading": 3,
            "text": "Soap-erior patents"
        },
        {
            "text": "When Lisa stepped into the Dragons' Den and introduced their invention, I felt that familiar surge of excitement that only comes from hearing about well-protected innovation. Those magic words - 'patented solid soap and solid shampoo dispenser' - signalled that here was an entrepreneur who truly understood the value of intellectual property protection."
        },
        {
            "text": "Their business, Snoap, was born from a simple domestic challenge - the fact that it was impractical and could be a bit gross to share a bar of soap among family members. The pair set off on their journey to research an alternative to sharing. When researching if they should switch to liquid soap instead, the couple were disappointed to identify a concerning environmental issue with it. Rather than admitting defeat and switching to liquid soap, Lisa and Anthony instead set their sights on developing a solution. "
        },
        {
            "text": "What particularly impressed me was their thorough approach to IP protection. Dragon Sara Davies, who clearly understands the value that patents can bring to a business, got straight to the point asking about the status of the patent - a question that brought a smile to my face. The response couldn't have been more reassuring: the squeaky clean pair have fully granted patents in the UK, with US and EU patents pending."
        },
        {
            "text": "The pair have a portfolio of patents which can be found on our One IPO Search tool, such as [link]: GB2611773 – Search for intellectual property – GOV.UK"
        },
        {
            "text": "Both their dispenser and the bars of soap themselves have patents. But how do you patent a bar of soap, you might wonder?"
        },
        {
            "text": "Anthony explained that their soap bars feature specific design elements that serve crucial functional purposes, namely, a precisely engineered hole that allows the bar to rotate around a pin and carefully designed surface etchings that enhance the bar's performance within the dispenser. This isn't just about aesthetics - these features make their soap bars a novel technical innovation. It's a perfect example of how something as seemingly simple as a bar of soap can be patentable when it incorporates new, inventive features that solve a technical problem and serve a practical purpose. You can learn more about what you can patent here [link]: Apply for a patent: Overview - GOV.UK "
        },
        {
            "text": "The couple’s acknowledgement of the crucial role of their patent attorney was particularly noteworthy. It's a reminder of how vital professional IP guidance can be in securing robust protection for innovative products. "
        },
        {
            "heading": 3,
            "text": "Sud-tastic licensing "
        },
        {
            "text": "The commercial potential of Lisa and Antony's protected innovation became evident when Deborah Meaden raised the possibility of licensing the technology to other brands. This is where strong IP protection truly proves its worth, creating opportunities for multiple revenue streams through licensing while they maintain control of the core innovation. Watch our IP Basics video (below) on licensing and franchising to find out if licensing could be the right move for your business:"
        },
        {
            "text": "Lisa and Antony’s pitch certainly caught the eye of the Dragons with all five rushing to make offers. Although they were massively conflicted and sad to lose the other investors, the couple decided to accept Peter Jones and Deborah’s joint offer of all the money for 7.5% of the business."
        },
        {
            "text": "If you enjoyed reading about this episode of Dragons' Den as much as I enjoyed watching it, don't forget to subscribe. We'll be bringing you closer looks into how the entrepreneurs are protecting and pitching their innovations."
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it.  "
        }
    ]
}