{
    "url": "https://mhclgdigital.blog.gov.uk/2025/02/27/setting-the-foundations-for-faster-plan-making/",
    "title": "Setting the foundations for faster plan-making ",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Digital Planning",
        "Strategy"
    ],
    "pub_date": "2025-02-27T12:31:46+00:00",
    "content": [
        {
            "text": "Up-to-date local plans in every planning authority across the country are essential to delivering the homes and infrastructure our communities need. But the reality is that local planning authorities (LPAs) often face challenges and experience delays during plan-making, meaning many have struggled to get up-to-date local plans in place.  "
        },
        {
            "text": "In July, the Deputy Prime Minister and Secretary of State for Housing, Communities and Local Government made it clear that the government expect every LPA to have an up-to-date local plan. Alongside this, following a previous consultation, the government has been developing a package of reforms to help streamline the process and make it more effective. The outcome of this consultation has been published today (27 February), setting out how we’ll work with the sector to put these reforms into action. Through user research and during the consultation we heard that LPAs are looking for clearer guidance, consistency and more practical tools to speed up plan-making. That’s why today we’re launching a new dedicated home for plan-making resources on GOV.UK. "
        },
        {
            "text": "So, what is a local plan? It’s a document that lays out a local planning authority’s long-term strategy for development, growth, and land use. It shows where new homes, jobs, infrastructure and services should be located and how this development should be managed in line with national policies and local priorities.  "
        },
        {
            "text": "Creating local plans in England has proved challenging for many LPAs. In recent years, the process has been slow and difficult, often taking upwards of seven years and costing councils millions to produce. Plans often end up as long, inaccessible PDFs – running to 300 pages or more – which make them hard to read, navigate and engage with for both professionals and the public.   "
        },
        {
            "text": "We understand the challenges, and through our Digital Planning Programme, we’re working to address inefficiencies and pain points within local plan-making to make the process faster and more efficient. By using digital design tools and putting the needs of users first, we aim to help LPAs produce local plans in less time.  "
        },
        {
            "heading": 2,
            "text": "A new home for plan-making resources"
        },
        {
            "text": "This new home of guidance and resources, ‘Create or update a local plan’, is designed to bring together all the essential the tools and information LPAs need in one place, making the process more straightforward and efficient. Some of the new guidance and tools we’re rolling out now, testing how it performs for users include: "
        },
        {
            "text": "This is just the start, and further practical resources will be added over the coming months to help planners at all stages of creating or updating a local plan. We’ll continue to work closely with LPAs, the Planning Inspectorate, public agencies, communities and developers to build on these foundations and release more new content and tools designed to save plan makers' time. "
        },
        {
            "heading": 2,
            "text": "User-centred approach"
        },
        {
            "text": "We know that real change comes from working together. So far working groups and prototype testing have sparked real interest in the new tools and processes we’re developing. But we’re just getting started.  "
        },
        {
            "text": "If you're visiting the new pages, you can register to ‘get emails about this page’ to be notified when new content is added.   "
        },
        {
            "text": "We’re committed to solving real problems that affect LPAs and communities. That’s why we’re working with people from across the planning system at every stage of the development and design process, to make sure our solutions are practical, effective, and save time within the plan-making process. "
        },
        {
            "heading": 2,
            "text": "Get involved   "
        }
    ]
}