{
    "url": "https://marinedevelopments.blog.gov.uk/2025/02/27/what-cornwalls-whale-sightings-mean-for-our-seas-and-how-to-watch-responsibly/",
    "title": "What Cornwall’s whale sightings mean for our seas — and how to watch responsibly",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager",
        "Hope Armstrong, MMO Marine Conservation Manager"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2025-02-27T17:15:38+00:00",
    "content": [
        {
            "text": "This month, Cornwall’s coastline has become a hotspot for whale sightings. This includes humpback whales - large, beautiful and powerful wild animals that can range in length from 14–17 m (46–56 ft) and weigh up to 40 metric tons!"
        },
        {
            "text": "These spectacular sightings are a thrilling experience for wildlife watchers. Humpbacks feast on krill and small fish. They follow their food, Meaning their presence may be a positive indicator of the health of our marine environment and underwater ecosystems."
        },
        {
            "text": "But with the excitement brought by these awe inspiring and captivating marine mammals, comes responsibility. We remind everyone to follow safe wildlife-watching practices to protect these incredible animals — and to avoid breaking the law."
        },
        {
            "text": "Image credit @Martin Yelland"
        },
        {
            "text": "Be responsible for the safety of whales as well as your own"
        },
        {
            "text": "All dolphins, porpoises and whales are protected by wildlife legislation, including the Wildlife and Countryside Act 1981. Under the Act it is an offence to intentionally and/or recklessly disturb these animals, with offences of disturbance carrying a maximum penalty of six months imprisonment and/or an unlimited fine."
        },
        {
            "text": "Disturbance by boats can cause stress and harm to whales, affecting their ability to feed, breed or nurture their young."
        },
        {
            "text": "Follow the WiSe code"
        },
        {
            "text": "To ensure the safety and appropriate protection of these animals, MMO recommend that boat and vessel owners follow the Wildlife Safe (WiSe) scheme."
        },
        {
            "text": "The scheme, which is a UK standard for commercial marine wildlife watching, includes a code of conduct and sets out best practice for wildlife watching. The code includes that boats should:"
        },
        {
            "text": "Further information on safe wildlife watching can be found at Marine & Coastal Wildlife Code and Watch out for whales and dolphins when you are near the coast - Whale and Dolphin Conservation"
        },
        {
            "text": "Image credit @Adrian-Langdon"
        },
        {
            "text": "Report a disturbance event"
        },
        {
            "text": "If you see whales being disturbed, please contact your nearest MMO office or local police force wildlife crime officer on 101."
        },
        {
            "text": "In Cornwall incidents can also be reported to the Cornwall Wildlife Trust on their 24 hour hotline 0345 201 2626 immediately."
        },
        {
            "text": "If possible, photographs or video footage should also be taken of these concerns. These incidents will then be passed to the relevant enforcement authority."
        },
        {
            "text": "Find out more about MMO's role in marine conservation, protected species and marine wildlife licences."
        },
        {
            "text": "For any queries or questions please contact conservation@marinemanagement.org.uk"
        }
    ]
}