{
    "url": "https://healthmedia.blog.gov.uk/2025/10/31/how-the-government-is-tackling-corridor-care/",
    "title": "How the government is tackling corridor care",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "NHS"
    ],
    "pub_date": "2025-10-31T10:14:44+00:00",
    "content": [
        {
            "text": "The government’s position on corridor care is below:"
        },
        {
            "text": "Health Minister Karin Smyth said:"
        },
        {
            "text": "“No one should receive care in a corridor - it’s unacceptable, undignified and we are determined to end it."
        },
        {
            "text": "“To tackle a problem you’ve got to be honest about it. For the first time, the NHS will measure and publish the number of patients waiting in corridors. Sunlight is the best disinfectant. "
        },
        {
            "text": "“To give patients the care they deserve, we’re investing £450 million to build same day urgent and emergency care centres , buying 500 new ambulances, building 40 new mental health crisis centres, and giving NHS leaders on the ground more power to deliver local solutions."
        },
        {
            "text": "“Ahead of this winter, we urge everyone to protect themselves, their family, and the NHS by getting vaccinated.”"
        },
        {
            "text": "The fact sheet below outlines in further detail how the government is tackling this problem:"
        },
        {
            "text": "What is “corridor care” and why is it a problem? "
        },
        {
            "text": "Corridor care is when patients are treated or held in hospital corridors because there aren’t enough beds or space. This can affect patient dignity, safety, and the quality of care. The government is committed to ending this practice."
        },
        {
            "text": "What is being done to increase hospital capacity? "
        },
        {
            "text": "The government is investing in expanding and modernising hospitals, adding more beds, buying and upgrading 500 ambulances and choosing locations for new emergency units. Temporary care units are also being set up to help during busy times. "
        },
        {
            "text": "Patients can also get the same level of care and support they would receive in hospital, but at home, through virtual wards, with doctors and nurses keeping track of their health using regular check-ins and remote monitoring. "
        },
        {
            "text": "Alongside this, we are also shifting care out of busy hospitals through the role of Community Diagnostic Centres, meaning that patients can get quicker access to the vital tests, checks and scans they need in quicker time. Since July 2024, over 8.7 million tests have been carried out at these sites."
        },
        {
            "text": "Vital schemes, such as Advice and Guidance is also helping to keep patients away from busy hospitals. The process sees GPs and other healthcare professionals seek quick expert advice from hospital specialists, helping patients get the right care faster and often avoiding the need for a hospital appointment. Since April 2025, over half a million patients received more appropriate care in the community, rather than automatically being referred to hospital services thanks to the  scheme."
        },
        {
            "text": "How are you supporting emergency care? "
        },
        {
            "text": "A&E demand has increased compared to last year but we are making sure more patients are being treated in the right place at the right time, including through Same Day Emergency Care. "
        },
        {
            "text": "Patients will soon be able to book into the most appropriate urgent care service for them, via 111 or the NHS App before attending, by 2028.  "
        },
        {
            "text": "Patients may be redirected to care elsewhere, such as their GP or pharmacy, if not considered an emergency. "
        },
        {
            "text": "Through our Urgent and Emergency Care Plan published in the summer, backed by £450 million, we will introduce new Mental Health Emergency Departments to reduce the strain on A&E and ensure patients receive specialist support. Alongside this, we are also buying and upgrading 500 ambulances to ensure that patients can receive quicker pre-hospital care where they need it.  "
        },
        {
            "text": "The measures this government has taken will not only reduce unnecessary hospital attendance, but also put care in the places people need it, whether that is through the NHS App or in neighbourhood health centres."
        },
        {
            "text": "How are you supporting NHS staff?"
        },
        {
            "text": "NHS staff are the heart of our health service and programmes to support the mental and physical wellbeing of healthcare workers are being enhanced to improve retention and morale. "
        },
        {
            "text": "Alongside this there are national efforts to recruit more doctors, nurses, and healthcare assistants. This year we have seen record numbers of doctors working in the NHS in England, and more doctors working in almost every speciality area than a year ago — on top of this, we have committed to creating 1000 more speciality training places over the next 3 years in our 10 Year Health Plan.   "
        },
        {
            "text": "There are over 147,000 full time equivalent (FTE) doctors employed by NHS Trusts and integrated care boards in England as of July 2025, almost 6,800 (4.8%) more than a year ago. This includes over 59,000 FTE consultants, over 2,200 (3.9%) more than a year ago."
        },
        {
            "text": "In under 18 months we recruited over 2,500 GPs – smashing through our promise of 1,000 alongside the extra £1.1 billion investment we’ve made in general practice. "
        },
        {
            "text": "Over the long-term our 10 Year Health Plan will deliver a revolution in healthcare. It is through the NHS’s workforce that the transformed service will be delivered.  "
        },
        {
            "text": "To meet this challenge we must create a workforce that is more empowered, more flexible, and more fulfilled.  Over the long-term our 10 Year Health Plan will relieve NHS Staff of the unnecessary bureaucracy and empower them to reshape services to work for their patients. "
        },
        {
            "text": "We will work with the Social Partnership Forum to develop a set of Staff Standards so that all staff have access to healthy meals, support to work healthily and flexibly, and tackle violence, racism and sexual harassment.  "
        },
        {
            "text": "The Staff Standards will support a workforce model that is fit for the future, where staff wellbeing is more than a ‘nice to have’. "
        },
        {
            "text": "How will patient flow through hospitals improve?"
        },
        {
            "text": "Hospitals are speeding up safe discharges to free up beds for those who need them. "
        },
        {
            "text": "They are also working more closely with GPs and community services to help patients leave hospital sooner and avoid unnecessary admissions. "
        },
        {
            "text": "We are taking a more collaborative approach to how care is delivered, making it more organised, proactive, and focused on the patient, ensuring teams work together effectively, use data and technology wisely, and allow people to receive the right care at the right time and place. "
        },
        {
            "text": "We are also strengthening the use of a Single Point of Contact – for example a dedicated phone number or service that makes it easy for patients, families, or community healthcare teams to get in touch with the right hospital team, ask questions, or get updates about care without needing to make multiple calls. "
        },
        {
            "text": "NHS leaders on the ground are being given more power to deliver local solutions, so they can ensure the right plans are in place to be able to support the needs of their local communities."
        },
        {
            "text": "How are you supporting community services and social care? "
        },
        {
            "text": "Through the 10 Year Health Plan the government is expanding access to community care, urgent treatment centres, and rolling out technology to allow virtual healthcare services to reduce pressure on hospital A&E departments. "
        },
        {
            "text": "The shift from hospital to community will give older people more choice in how they access their care and make it more convenient as a wider range of services will be available at home or in the community. Quality of care will also be improved."
        },
        {
            "text": " The shift from sickness to prevention will ensure older people are supported to maintain their independence with more services coming to them, rather than being delivered in hospital. "
        },
        {
            "text": "Our neighbourhood health programme will see 43 hubs covering 12 million people as part of the first phase. Each area will receive £10 million to transform care for people with long term conditions. "
        },
        {
            "text": "Around 100 community diagnostic centres now offer services, 12 hours a day, 7 days a week. "
        },
        {
            "text": "More funding is going into social care to help people return home safely, especially older and vulnerable patients. Longer-term, we have launched the Casey Commission to build cross-party consensus for a National Care Service."
        },
        {
            "text": "When will you publish corridor care statistics? "
        },
        {
            "text": "To tackle a problem you’ve got to be honest about it. For the first time, the NHS will measure and publish the number of patients waiting in corridors. Sunlight is the best disinfectant. "
        },
        {
            "text": "This Government is committed to tackling the unacceptable practice of corridor care in our NHS. Our Urgent and Emergency Care Plan, published in June, set out steps we are taking, including the commitment to publish data on the prevalence of corridor care.  "
        },
        {
            "text": "NHS England has been working with trusts since 2024 to put in place new reporting arrangements related to the use of corridor care, to drive improvement.  Subject to a review of data quality, this information will be published shortly, and we will consider how this data could be published on a regular basis. "
        },
        {
            "text": "Will corridor care take over busy hospitals?  "
        },
        {
            "text": "We’re working closely with the NHS to prepare for winter - from ‘war game’ exercises, to extra checks for the most vulnerable and rolling out vaccines - to ease pressure on hospitals and ensure patients get the care they need.  We’re investing nearly £450 million to expand urgent and emergency care facilities so patients get better, faster emergency care. It’s easier than ever to book vaccine appointments available at GP surgeries, pharmacies and community centres across the country so get vaccinated to protect yourself, and your loved ones this winter.  "
        },
        {
            "text": "What about vaccinations? "
        },
        {
            "text": "Vaccines are one of the safest and most effective ways you can do this. They work by providing a barrier of protection to prevent serious illnesses that can cause lifelong problems or even death."
        },
        {
            "text": "This winter the government is ramping up activity ahead of winter more than ever before, encouraging people to ‘Stay Strong. Get Vaccinated’ and getting a flu vaccine is now as easy as ordering food or scheduling an appointment.  Since the start of September, vaccination teams have been rolling out flu vaccines to pregnant women and children across maternity services, in school settings or GP practices, and pregnant women, younger children and those who miss their school or nursery session will also be able to get the vaccine at their local pharmacy or drop-in community clinic. "
        },
        {
            "text": "High street pharmacies are now offering flu vaccinations for 2- and 3-year-olds - in addition to the offer for all other eligible adults - in a bid to make it as easy as possible for people to get protected closer to home. Local NHS teams are making getting a catch-up vaccination as easy as possible by hosting community clinics closer to home – with sessions set up in bowling alleys, football pitches, libraries and sports halls. "
        },
        {
            "text": "Those eligible for a free Covid-19 vaccine will also be able to find their nearest drop-in clinic via the NHS walk-in finder. "
        },
        {
            "text": "This winter, we’re keeping vaccination windows open for longer, with appointments for COVID-19 vaccinations will be available until Friday 30 January 2026, with flu jabs offered until the end of March 2026."
        },
        {
            "text": "How is technology helping?"
        },
        {
            "text": "A: Hospitals are adopting digital platforms to monitor and manage bed availability in real-time, reducing bottlenecks, while data tools are being used to forecast demand surges and allocate resources proactively and manage patient flow more effectively. "
        },
        {
            "text": "We are also investing £20 million so paramedics can access patient records from all NHS services, helping avoid unnecessary hospital admissions. "
        },
        {
            "text": "The NHS Federated Data Platform is being rolled out to 85% of acute trusts by March 2026, giving frontline staff a single view of operational systems to manage demand better.  "
        },
        {
            "text": "Furthermore, national standards for care technology will be set by March 2026 to reduce falls—which cost the NHS £2.3 billion annually —including remote monitoring that has halved falls in care homes, meaning less visits to A&E."
        },
        {
            "text": "How will progress be monitored?"
        },
        {
            "text": "The NHS has set clear targets and standards, including eliminating corridor care. Hospitals will be regularly inspected, and data on corridor care will be published for transparency."
        }
    ]
}