{
    "url": "https://mattersoftesting.blog.gov.uk/nightmare-on-mot-street-frightening-faults-lurking-in-uk-garages/",
    "title": "Nightmare on MOT Street: Frightening Faults Lurking in UK Garages ",
    "authors": [
        "Matters of Testing"
    ],
    "categories": [
        "Horror stories",
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2025-10-31T10:00:00+00:00",
    "content": [
        {
            "text": "Happy Hallo-wheels!  "
        },
        {
            "text": "While most horror stories are set in haunted houses or dark woods, some of the DVSA’s scariest tales come straight from the MOT testing bay.  "
        },
        {
            "text": "This year, testers have shared some truly hair-raising sights that would leave the bravest of testers shuddering.  "
        },
        {
            "text": "In our latest edition of MOT horror stories, a collection of terrifying tales from the garage floor is revealed. "
        },
        {
            "heading": 2,
            "text": "The Seatbelt Slasher "
        },
        {
            "text": "One tester reported a driver who arrived with a severed seatbelt that had been “repaired” with duct tape. While it might hold a parcel together, it will never hold a life.  "
        },
        {
            "text": "Seatbelts are engineered to lock instantly during a crash and withstand enormous forces. A taped-up or frayed belt simply cannot perform its vital function, leaving a vehicle’s occupant dangerously unprotected. "
        },
        {
            "text": " As the front line of defence against unsafe vehicles, a tester’s advice is a vital reminder – the owner is responsible for keeping their seatbelts in good condition, ensuring their car is roadworthy.  "
        },
        {
            "text": "The only safe choice is replacement. If the seat belt shows any cuts, frays or stiffness, it must be inspected and replaced – there’s no safe DIY fix.  "
        },
        {
            "heading": 2,
            "text": "A Fuel Tank on Elm Street "
        },
        {
            "text": "Another tester was stunned to find a fuel tank held in place with a fuse wire after its original strap had corroded away.  "
        },
        {
            "text": "This makeshift repair posed an extremely dangerous hazard.  "
        },
        {
            "text": "A fuel tank held in this way can shift or detach under road vibrations or impact, potentially damaging fuel lines and causing leaks.  "
        },
        {
            "text": "Just one spark could have catastrophic results – such as causing a fire.  "
        },
        {
            "text": "As experienced MOT professionals will be aware, fuel tanks must always be secured using manufacturer-approved fittings and brackets. It's also a good opportunity to remind motorists that DIY repairs of this kind can be incredibly unsafe. "
        },
        {
            "heading": 2,
            "text": "The Corroded Suspension Curse "
        },
        {
            "text": "A Ford KA was brought in after the owner reported steering issues on the motorway. The real problem uncovered during the MOT was far more serious – a coil spring mounting so corroded it had fractured completely.  "
        },
        {
            "text": "With the springs no longer safely attached, the vehicle was at risk of instability or loss of control, particularly when cornering or driving over uneven roads.  "
        },
        {
            "text": "As testers know, corrosion develops gradually, which is why regular inspections are so important. When corrosion is identified, it’s a good opportunity for garages to promote any additional services they offer, such as vehicle safety checks.  "
        },
        {
            "heading": 2,
            "text": "The Cursed Caliper "
        },
        {
            "text": "Not all MOT horrors are the result of wear and tear – some are the result of dangerous shortcuts.  "
        },
        {
            "text": "During one test, a brake caliper was discovered with its bleed nipple replaced by a radiator drain tap, glued into place… a true Frankenstein repair. "
        },
        {
            "text": "This wasn’t just a gruesome repair – it was an unsafe modification.  "
        },
        {
            "text": "A car’s braking system relies on precision, and using the wrong part could lead to leaking brake fluid, loss of pressure, and even total brake failure. "
        },
        {
            "text": "Spongy brakes, unusual noises, the car pulling to one side, or brake warning lights are all common complaints from customers.  "
        },
        {
            "text": "Quick fixes or unapproved modifications – especially involving the braking system – are never safe solutions. Makeshift repairs, incorrect parts, or shortcut fixes put both drivers and other road users at serious risk.  "
        },
        {
            "text": "By highlighting these dangers, testers can help prevent small issues from turning into a full-blown horror story on the road.  "
        },
        {
            "heading": 2,
            "text": "A stark reminder "
        },
        {
            "text": "We all know that a valid MOT certificate doesn’t automatically guarantee the vehicle is safe to drive for the year. "
        },
        {
            "text": "Encourage motorists to: "
        },
        {
            "text": "Promoting safety and inspection services available at the garage is an excellent way to help motorists stay on top of their vehicle maintenance and keep their vehicle safe all year round. "
        },
        {
            "text": "We’d love to know what testers think of these MOT horror stories – have you come across any spooky discoveries of your own? Share your thoughts and experiences by leaving a comment below.  "
        }
    ]
}