{
    "url": "https://mojdigital.blog.gov.uk/2025/10/31/standing-firm-in-power-and-pride/",
    "title": "Standing Firm in Power and Pride",
    "authors": [
        "Faye Johnson-James"
    ],
    "categories": [
        "Black History Month",
        "Justice Digital"
    ],
    "pub_date": "2025-10-31T13:28:08+01:00",
    "content": [
        {
            "text": "I am a Black woman of Jamaican heritage, born and raised in London. My parents instilled in me the values of dignity, honesty, and compassion. They taught me to stand up for myself and for others."
        },
        {
            "text": "My father had a passion for fixing electrical items, which sparked my interest in engineering. I chose a career in IT, a very uncommon path among my peers at an all-girls school. He also taught me the importance of reading carefully, especially before signing anything. My mother often said, “There’s good and bad in everyone,” reminding me to treat people with respect and to reject the labels others may assign to me."
        },
        {
            "heading": 2,
            "text": "Standing Firm for Fairness and Inclusion"
        },
        {
            "text": "Throughout my career in technology, primarily in the private sector, I’ve I’ve encountered microaggressions that have reaffirmed the importance of my values. I have witnessed—and benefited from—the quiet efforts of those advocating fairness for Black colleagues and other minorities."
        },
        {
            "text": "Support networks have been essential. An ally in my first job taught me that my setbacks could inadvertently impact opportunities for others from similar backgrounds. A challenging experience when I joined the Civil Service led me to become involved with the race network, called RESPECT, where I later served as an area chair. I also joined PROUD and other networks as a member or ally when I moved to the Ministry of Justice."
        },
        {
            "text": "I entered the Civil Service expecting a short stay and over 20 years later, I am still here. My journey has been shaped by resilience and deeply held values."
        },
        {
            "text": "Standing firm means doing the right thing, even when it is difficult. While we all carry unconscious biases, we must still recognise and challenge unfairness. I have faced bullying for standing up for myself, but I stood firm, and support others facing similar challenges."
        },
        {
            "text": "Many of the opportunities we have today are built on the resilience of those who came before us and overcame immense obstacles. To waste what they fought for would dishonour their legacy. Our community has made significant contributions to humanity and technological progress often without recognition. We must continue to share knowledge and support future generations."
        },
        {
            "text": "Pride in my heritage means acknowledging the resilience and achievements of myself and my community. We have produced innovators, leaders, and role models—many of whom have gone unrecognised. Celebrating our heritage inspires me to keep striving for fairness and progress."
        },
        {
            "heading": 2,
            "text": "Inclusion and Normalising"
        },
        {
            "text": "I have always been uncomfortable with injustice. I have served as a Race Champion, network member, and ally. As a founding member of Digital & Technology’s (as we were then called) first Diversity & Inclusion Group, the Digital & Technology Normalising Group, that won the Civil Service Employee Network Excellence Award 2018 and were one of the finalists for the Civil Service Diversity & Inclusion. Winning the Employee Network Award sparked several initiatives, including a collaboration with UK Black Tech and continues to shape other initiatives, e.g. the Coding Black Females collaboration event which aims to increase the representation of Black women in technical role. In 2020, following the horrific murder of George Floyd, I organised the first listening event within Justice Digital and, alongside PROUD, developed the first allyship training template used across Justice Digital."
        },
        {
            "heading": 2,
            "text": "Hope for the Future"
        },
        {
            "text": "We acknowledge the ongoing work the department are doing as outlined within the MoJ Race Action Plan, and the work that Justice Digital are doing, which include the Coding Black Females collaboration.We have often been asked by senior leaders, “what can we as senior leaders do to improve Black representation in senior leadership?” and we have provided answers. So, this time, we ask - What do you (our senior leaders) believe needs to be done to increase Black representation in senior roles within Justice Digital? and What are your hopes for continual inclusion?"
        },
        {
            "text": "I hope that our senior leadership team confronts the tough questions. Meaningful change requires commitment across all levels of leadership and teams."
        }
    ]
}