{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/01/21/a-better-digital-identity-and-attribute-services-register-is-coming-soon/",
    "title": "A better digital identity and attribute services register is coming soon ",
    "authors": [
        "Laura Dias"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-01-21T09:43:10+00:00",
    "content": [
        {
            "text": "We think digital identity services are a great way to prove who you are. We know that government is in a unique position to help people find services they can trust. "
        },
        {
            "text": "My role – as the product manager for the “register of digital identity and attribute services” – is to make it easy to identify digital identity and attribute services that meet our trust framework and supplementary code rules and have been through our certification process. "
        },
        {
            "heading": 2,
            "text": "Moving away from our proof of concept "
        },
        {
            "text": "We’ve heard from digital identity providers, businesses and the public that we can support the adoption of digital identity services by maintaining an accessible, well-maintained, easy to use register of trusted digital identity providers and the services that they offer.  "
        },
        {
            "text": "We have been maintaining a proof of concept of such a register since 2022, when new digital routes for conducting Right to Work, Right to Rent and Disclosure and Barring Service checks were made available. "
        },
        {
            "text": "Our current list of certified services has allowed businesses to identify and check that a service meets their business needs and regulatory requirements. Whilst it’s a proof of concept, we’ve found it has quickly become a destination that is shaping purchasing decision making in the digital identity market. "
        },
        {
            "text": "But it is still a proof of concept. This list was always intended to be a temporary solution.  "
        },
        {
            "text": "We know that the current list is unwieldy, difficult to search and not very user friendly. That’s why over the last year, we have carried out extensive user research and tested multiple iterations of a new digital service that will be launched in public beta on GOV.UK next month. "
        },
        {
            "heading": 2,
            "text": "How the new register will work "
        },
        {
            "text": "Easier to search for services  "
        },
        {
            "text": "We know that businesses use the current list to find services which meet their business needs. The new register will make it easier to find digital identity services that provide Right to Work, Right to Rent and Disclosure and Barring Service checks to the levels recommended by the Home Office and DBS. New search and filtering tools will allow users to more quickly find suitable services for their needs.  "
        },
        {
            "text": "Easier to join and maintain information about a service   "
        },
        {
            "text": "Digital identity providers can apply to join the new register after they have been certified against the UK digital identity and attributes trust framework and, where applicable, additional rules needed for particular use cases. "
        },
        {
            "text": "Currently we manage that process entirely through email; which is difficult to scale and complex to manage. The new service will provide an easier, more streamlined process to apply, and providers and Conformity Assessment Bodies will be kept up-to-date on how the provider’s application onto the register is progressing in real time.  "
        },
        {
            "text": "Access to the new digital identities and attributes trust mark  "
        },
        {
            "text": "After the Data (Use and Access) Bill has become law, eligible digital identity services will be allowed to use a new digital identity trust mark. The trust mark will prove to businesses and members of the public, at a glance, that a digital identity service appears on the register, and can be trusted.  "
        },
        {
            "text": "The register will enable providers to quickly get access to their trust marks, and users will be able to confirm the trust marks are genuine. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "The new register will launch in February 2025.  "
        },
        {
            "text": "The current list will cease to be maintained following the transition to the new register. "
        },
        {
            "text": "If you are a provider on the current list and you haven’t already completed your transfer, please reach out to your Conformity Assessment Body to apply to be on the new register.  "
        },
        {
            "text": "If you are a provider who has never been on the list and you would like to join the new register, we’ve created guidance on how to join the register of digital identity and attribute services.    "
        }
    ]
}