{
    "url": "https://educationhub.blog.gov.uk/2025/01/everything-we-are-doing-in-education-to-tackle-climate-change-here-is-what-you-need-to-know/",
    "title": "Everything we are doing in education to tackle climate change",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "climate change",
        "School building"
    ],
    "pub_date": "2025-01-21T12:59:15+00:00",
    "content": [
        {
            "text": " Our Climate and Sustainability Strategy is preparing schools for the climate issues we face, encouraging positive environmental behaviours and creating a better environment for children’s futures.  "
        },
        {
            "text": "We want every setting, from early years to higher education, to join us in making education more sustainable and helping our children get the skills they need for a greener future. "
        },
        {
            "text": "We are updating our Sustainability and Climate Change Strategy, making sure it looks at how we are making sure teachers and pupils understand the support that is available to them and how their schools can thrive in a sustainable future.  "
        },
        {
            "text": "Here is what else we are doing to tackle climate change:  "
        },
        {
            "text": "Inspiring young people to connect with nature:  "
        },
        {
            "text": "The National Education Nature Park led by the Natural History Museum hopes to bring together to turn all the land from across schools in the UK into a virtual nature park. Children and young people are inspired to connect with nature and develop their understanding of their own role in climate change.  "
        },
        {
            "text": "The program puts boosting biodiversity in the hands of children and young people. They are turning their schools’ grey spaces green, all while connecting to nature and developing vital green and digital skills.  "
        },
        {
            "text": "In one year since it launched in October 2023, children and young people at more than 4000 schools, nurseries, and colleges across every region of England have been busy building green walls, digging ponds and growing pollinator-friendly plants. Using geospatial mapping tools, they have mapped two million m2 of habitats across the education estate - equivalent to about 1600 Olympic-size swimming pools.   "
        },
        {
            "text": "Every small act makes a big impact, and by monitoring wildlife on their sites and uploading their findings, young people can see the collective difference they are making.  "
        },
        {
            "text": "These young people’s efforts are also set to leave a legacy for our understanding of urban habitats. The data they upload to our system will be used by scientists at the Natural History Museum for research into nature recovery. "
        },
        {
            "text": "Free online activities that connect to the national curriculum allow students to get involved in things like community science activities, group mapping and collecting data. "
        },
        {
            "text": "Supporting education settings to become greener:  "
        },
        {
            "text": "We are committed to a whole system approach to embedding sustainability through the education system.   "
        },
        {
            "text": "In addition to the nature park, we are offering support for all education settings to get started or help with next steps on their sustainability journey. "
        },
        {
            "text": "As part of our Climate and Sustainability Strategy, we hope to have all schools implementing their own Climate Action Plans by 2025. A Climate Action Plan is a way to guide schools towards sustainability in a way that is unique and manageable for each individual school.  "
        },
        {
            "text": "These plans will allow the education sector to focus on the skills it needs to impact climate change with free support to do this, available online via the Sustainability Support for Education online service. This site ensures our schools are relying on trusted information.  "
        },
        {
            "text": "Where education settings need more help, the Climate Ambassadors program, supported by Let’s Go Zero Climate Advisers, can provide expert knowledge and on the ground support for our schools.  "
        },
        {
            "text": "Building greener schools:  "
        },
        {
            "text": " Since 2021 we have been designing schools that are low energy, more adaptable to climate change and Net Zero Carbon by design. "
        },
        {
            "text": "We are also supporting schools to tackle energy efficiency and improve the ways they are combatting the effects of climate change, and signposting to government-wide schemes such as the Workplace Charging Scheme for EV charging points. "
        },
        {
            "text": "Other initiatives include increasing the use of UK grown timber in construction, piloting different measures to improve schools’ ability to withstand the impacts of climate change and tackling flooding at highest risk settings.  "
        },
        {
            "text": "In 2023 the DfE delivered the UK’s first biophilic school, St Mary’s Voluntary Catholic Academy, a school that has had nature integrated into its school environment. A secondary school, will also be designed to follow biophilic principles and is at the early stages of development.  "
        },
        {
            "text": "How can I get my school involved? "
        },
        {
            "text": "To sign up to the National Education Nature Park – click here "
        },
        {
            "text": "For access to our online Sustainability Support for Education services  "
        },
        {
            "text": "Climate Ambassadors:\u2028Turning Climate Ambition into Climate Action in Education | Climate Ambassadors "
        }
    ]
}