{
    "url": "https://mhclgdigital.blog.gov.uk/2025/01/21/funding-service-how-a-glossary-helps-us-speak-the-same-language/",
    "title": "Funding Service: how a glossary helps us speak the same language",
    "authors": [
        "Kate Harries, Senior Content Designer"
    ],
    "categories": [
        "Design",
        "Funding Service"
    ],
    "pub_date": "2025-01-21T10:46:44+00:00",
    "content": [
        {
            "text": "If you’ve worked with a content designer before (or are one) then you’ll be familiar with one of our golden rules: avoid jargon. "
        },
        {
            "text": "We want to make sure everyone feels included and understands the content. If someone is trying to apply, find, check or look for something, we don’t want to slow them down by speaking in complicated specialist language which takes longer to interpret.  "
        },
        {
            "text": "For example, research into the use of specialist language in legal documents found that “80% of people preferred sentences written in clear English – and the more complex the issue, the greater that preference”. "
        },
        {
            "text": "That’s why you’ll also hear content designers talking (a lot) about the importance of using plain English, whether that’s in white papers or transactional digital services.  "
        },
        {
            "text": "However, the nature of our work in the Funding Service means that we often need to use technical terms that may be unfamiliar to some people. A technical term is a phrase that’s used to summarise a concept. It could also be the name of something, like a legal document. "
        },
        {
            "text": "You can see examples of technical terms in our grants glossary on GOV.UK.  "
        },
        {
            "text": "Technical terms are not jargon. Used correctly (and with the right audience), they can speed up comprehension and save people time. But we need to make sure that: "
        },
        {
            "heading": 2,
            "text": "What is a glossary (and do we need one)? "
        },
        {
            "text": "A glossary is a list of words and terms relating to specific subject area. It differs from an A-Z style guide as its main purpose is to help users understand what something means.  "
        },
        {
            "text": "A style guide’s objective is to help users know how something should be formatted, for example hyphenated or not hyphenated, title case or sentence case, and so on (see the Government Digital Service style guide). "
        },
        {
            "heading": 3,
            "text": "The user need "
        },
        {
            "text": "Before compiling a glossary, it’s important to establish the user need. You’ll probably find that you need a glossary if the service you’re working on has more than just a handful of technical terms that are not already defined in a glossary elsewhere. It’s important to check what already exists so there’s no duplication.  "
        },
        {
            "text": "The user groups for our glossary include: "
        },
        {
            "heading": 2,
            "text": "What we did "
        },
        {
            "text": "The Funding Service already had a grants glossary live on GOV.UK, but it was primarily aimed at potential grant recipients as something for them to refer to when applying for funding. We wanted to expand the scope to meet the needs of all the user groups. "
        },
        {
            "text": "I’d noticed that the definitions of some of the terms were not that clear and some were out of date. The glossary is missing terms, so we need to find a way to build and maintain it to create a better experience for users both inside and outside the department.  "
        },
        {
            "text": "Also, we want to make sure that we are aligned across the department by using terms consistently. For example, the Government Functional Standard also has a glossary of terms, so we need to discuss and incorporate these terms and work more closely with the team responsible for the guidance. "
        },
        {
            "heading": 3,
            "text": "The glossary working group "
        },
        {
            "text": "Drawing on my own experience of working on a glossary and style guide at the Department for Education, I set up a working group consisting of subject matter experts, content designers and communications specialists. I also looked at how other government departments manage their style guides and glossaries.  "
        },
        {
            "text": "The Home Office runs a monthly cross-government style guide meeting where they discuss methods for collating, editing and maintaining style guides and glossaries. A guest speaker from the NHS talked about their approach which involved setting up a Microsoft Planner board to collect contributions. It means that anyone can add a ticket at any time, whether it’s a new term that’s missing and needs to be added, or an existing term that needs to be updated. It worked well for the content team at the NHS, and other teams are also using a similar method.  "
        },
        {
            "text": "This is the approach we’re trialling: "
        },
        {
            "text": "We had our first meeting in October and the glossary had its first (small) update in November. We have around 30 terms in our backlog, so we expect our next update to be much bigger!  "
        },
        {
            "text": "We will also be testing the next update with users to validate our assumptions and will make further iterations following the testing. We’re aiming to review and update the glossary quarterly.  "
        },
        {
            "heading": 2,
            "text": "How to get involved "
        },
        {
            "text": "We’re passionate about making things easier and more accessible for our users both inside and outside the department. Having a clear, well-maintained glossary is just the beginning of this journey. "
        },
        {
            "text": "If you’d like to get involved in adding to the glossary, hear more about this project or find out about our wider work, you can: "
        },
        {
            "text": "Find out more about the objectives and principles that guide our work in digital. "
        }
    ]
}