{
    "url": "https://companieshouse.blog.gov.uk/2025/01/21/reflecting-on-a-landmark-year-for-companies-house/",
    "title": "Reflecting on a landmark year for Companies House ",
    "authors": [
        "Louise Smyth CBE - Chief Executive and Registrar of Companies for England and Wales"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2025-01-21T15:35:34+00:00",
    "content": [
        {
            "text": "As we begin 2025, it's a timely moment to reflect on a transformative year at Companies House and to share my vision for the year ahead – along with some personal news."
        },
        {
            "heading": 2,
            "text": "Looking back at 2024"
        },
        {
            "text": "2024 marked a pivotal year in our organisation's history with the implementation of new powers under the Economic Crime and Corporate Transparency (ECCT) Act. These powers represent a fundamental shift in the role of Companies House, from being a collector of information to becoming an active gatekeeper of the accuracy and integrity of information on our registers."
        },
        {
            "text": "Our new and enhanced powers enable us to query and remove false, misleading or incorrect information from our registers – a crucial step in improving the quality of our data. This directly supports individuals, businesses and stakeholders who rely on our data. We’re proud that the work we’ve been able to do over the last year is already having a positive impact on the UK’s business environment."
        },
        {
            "text": "We published a one-time management information release in November 2024 covering the first 6 months of progress since 4 March 2024."
        },
        {
            "text": "As of January 2025, we have:"
        },
        {
            "text": "This has affected 75,600 companies in total."
        },
        {
            "text": "In October 2024, we introduced new financial penalties for companies that do not comply with their legal responsibilities – another step in improving the quality of our data."
        },
        {
            "text": "We also published our first strategic intelligence assessment in October 2024 which gives an in-depth analysis of the key threats that Companies House is facing. The assessment has been very well received by key partners and stakeholders."
        },
        {
            "text": "I’m proud of everything we achieved together last year and I’m looking forward to building on this strong foundation in 2025."
        },
        {
            "heading": 2,
            "text": "What’s coming up in 2025"
        },
        {
            "text": "For the beginning of 2025, we're focusing on several key priorities:"
        },
        {
            "text": "We’re running a number of complex projects with multiple workstreams to implement the measures within the ECCT Act. We’ll maintain our rapid pace of work throughout 2025."
        },
        {
            "text": "Look out for these important dates in the first few months of the year:"
        },
        {
            "text": "We’re also in the final year of our strategy for 2020 to 2025, so look out for our new strategy for 2025 to 2030 over the coming months."
        },
        {
            "heading": 2,
            "text": "Personal news"
        },
        {
            "text": "I was deeply honoured to receive a CBE (Commander of the Order of the British Empire) in the King's New Year Honours list for services to public life and the economy. This recognition reflects the collective achievements of my brilliant colleagues at Companies House, and our dedication to delivering high quality public services which directly improve the UK’s economy."
        },
        {
            "text": "I'm planning to retire from my role as Chief Executive of Companies House at the end of August 2025. I'll miss working with such passionate colleagues every day – but, because of these colleagues, I'm fully confident that Companies House is well-positioned for the future."
        },
        {
            "text": "The impact of the ECCT Act and our wider transformation will extend far beyond our organisation. As well as playing a more significant role in supporting business decisions and economic growth, our enhanced role supports law enforcement and other agencies in the work they’re doing to disrupt economic crime."
        },
        {
            "text": "We welcome the increased scrutiny and higher expectations from our stakeholders and the general public as we continue to implement more changes over the year ahead."
        },
        {
            "text": "The organisation is already hugely different to what it was when I joined in 2017. I know Companies House will continue to evolve and adapt, maintaining our unique identity while embracing new opportunities to make a difference and to meet the challenges that lie ahead in 2025 and beyond."
        }
    ]
}