{
    "url": "https://defrafarming.blog.gov.uk/2025/01/21/watch-countryside-stewardship-higher-tier-webinar/",
    "title": "Watch: Countryside Stewardship Higher Tier webinar",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "Webinars"
    ],
    "pub_date": "2025-01-21T09:35:28+00:00",
    "content": [
        {
            "text": "Earlier this month, we hosted a webinar for farmers and land managers in England to learn more about Countryside Stewardship Higher Tier (CSHT) and the pre-application process. "
        },
        {
            "text": "We were joined by colleagues from the Environment Agency, Forestry Commission, Historic England, Natural England and the Rural Payments Agency (RPA)."
        },
        {
            "text": "They were on hand to answer questions posed and upvoted on Slido during the session. "
        },
        {
            "text": "In this post, you’ll find a recording of the webinar and a summary of the information in the session, reflecting the questions put to the team. "
        },
        {
            "text": "We received over 100 questions through Slido during the webinar. To avoid repetition, we’ve summarised the content and general questions in the top half of the post. We’ve consolidated more specific questions in the bottom half."
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "CSHT offers payments to farmers, foresters and land managers in England who take steps to protect and improve the environment. It focuses on funding actions tailored to specific areas, features and habitats. "
        },
        {
            "text": "On 11 December 2024, we published new CSHT guidance on GOV.UK. It includes: "
        },
        {
            "text": "Learning from what’s worked well in the rollout of the Sustainable Farming Incentive (SFI), CSHT will:"
        },
        {
            "text": "As with our other schemes, we’re rolling out CSHT in a controlled way so we can ensure people get the support they need.  "
        },
        {
            "text": "We’re currently offering pre-application advice to certain groups. Natural England and the Forestry Commission will work with them on pre-application activity.  "
        },
        {
            "text": "The scheme will open in summer to those who have been through the invited pre-application process. "
        },
        {
            "heading": 2,
            "text": "Getting into the scheme "
        },
        {
            "text": "The RPA is inviting certain groups to receive pre-application advice before the scheme opens. With advice from the Forestry Commission and Natural England, priority will go to those with:  "
        },
        {
            "text": "If you’re in one of these groups, the RPA will contact you. The RPA started to invite people at the start of this month. It will continue to invite people for pre-application advice every month. "
        },
        {
            "text": "You must receive pre-application advice before making an application. This advice ensures that your application is well-prepared and meets the necessary requirements, increasing the likelihood of a successful application.   "
        },
        {
            "text": "If you’re interested in applying for CSHT but you’re not in one of the 3 groups which are being prioritised to receive pre-application advice, we’ll provide further details in February on how you can contact the RPA. "
        },
        {
            "text": "CSHT agreements will be offered more quickly than previous rounds of CSHT, and we expect the first payments to be made before the end of this year. "
        },
        {
            "text": "Your CSHT agreement will include the details of the actions and capital items you have selected, the terms and conditions. The agreement will start on the first day of the calendar month after you accept the offer and will end on the last day of the month of the longest action in your agreement. "
        },
        {
            "text": "If you are not able to enter CSHT straightaway, you can still take steps to prepare, including applying for capital grants to help you prepare plans to support a CSHT application. For example, grants are available for implementation plans, woodland management plans, agroforestry plans, species management plans and feasibility studies, as well as a Moorland Mapping tool. "
        },
        {
            "heading": 2,
            "text": "How to prepare "
        },
        {
            "heading": 2,
            "text": "A summary of your questions "
        },
        {
            "text": "Where can I find the details of what CSHT offers? Is there a printed version? "
        },
        {
            "text": "Countryside Stewardship Higher Tier: get ready to apply is on GOV.UK. The guidance includes scheme information, actions and payment rates. You can print the guidance in PDF. On your keyboard, press Ctrl and P (or Command ⌘ and P on a Mac). It is 84 pages long."
        },
        {
            "text": "Will payment rates be increased in the new offer? Will payment rates increase with inflation? "
        },
        {
            "text": "The payment rates for all Countryside Stewardship (CS) and Sustainable Farming Incentive (SFI) actions were updated from 1 January 2024. This includes payments rates for all the actions in CSHT. This was done to ensure payment rates are up to date, including to reflect changes in agricultural markets.  "
        },
        {
            "text": "Can I apply for the Sustainable Farming Incentive (SFI) and CSHT? Is one better than the other? "
        },
        {
            "text": "You can participate in both schemes if your land is eligible, the actions are compatible and there is no double funding. You can apply for any SFI actions in a separate application now and the CSHT later. You may wish to speak with an adviser from Natural England before applying for SFI. The schemes are designed to work alongside each other. Consider SFI first. If you require tailored advice or specific work, explore CSHT. You could also explore carrying out an endorsed action through SFI without taking on a CHST agreement. The list of the 14 endorsed actions we expect to make available later this year can be found on GOV.UK in draft form. We’re taking on stakeholder feedback to shape them before they’re available this summer. GRH6 is available for SFI applications now.  "
        },
        {
            "text": "If I have a Sustainable Farming Incentive (SFI) agreement, can I transfer out of it and into Higher Tier (or vice versa)?   "
        },
        {
            "text": "If you have an SFI agreement you may want to speak with an adviser to discuss if you’re eligible for CSHT. If you have recently chosen to accept a CSHT mirror agreement, over time you’ll have the option to end your mirror agreement early if you want to apply for the new CSHT scheme once it becomes available.   "
        },
        {
            "text": "I have a Higher Level Stewardship (HLS) / Environmental Stewardship (ES) agreement. Can I move across to the new CSHT scheme when it opens and, if so, will I be penalised? "
        },
        {
            "text": "You can end your Higher Level Stewardship (HLS) / Environmental Stewardship (ES) agreement early if you want to apply for a new Sustainable Farming Incentive (SFI) agreement or a Countryside Stewardship Higher Tier (CSHT) agreement when it becomes available (initially by invitation). Ending an agreement early can be complex and may take some time (see answer above) which could result in a gap of several months between your current agreement ending and the new one starting. You can request to end your agreement at any point in the calendar year. If you end it at the end of your agreement year, you’ll receive full payment for that year, if you meet the agreement’s requirements. However, if you end it partway through the year, you won’t receive any payments for that year. We’ll share more details on how to do this soon. "
        },
        {
            "text": "My HLS has ended. Some of my land is a Site of Special Scientific Interest (SSSI) and I’m keen to consider CSHT. How do I get an invite?"
        },
        {
            "text": "If your land includes a SSSI, contact a Natural England adviser. "
        },
        {
            "text": "I’m facing a gap in funding. What do you suggest I do?"
        },
        {
            "text": "We know that funding gaps may arise for those with expiring agreements. Options to minimise gaps include exploring Sustainable Farming Incentive (SFI) actions that align with farm goals while reserving Higher Tier-specific actions for later applications. We recently wrote about CSHT mirror agreements and HLS extensions. Further info will be available in February to explain how people, not initially being invited, but interested, can get in touch with the RPA.   "
        },
        {
            "text": "Can I make multiple applications with one SBI (Single Business Identifier) number? "
        },
        {
            "text": "Yes. You can make multiple applications under the same SBI number. However, the first must be submitted within the Rural Payments service before you can start your next application. Each site must have received pre-application advice before applying. However, multiple sites can gain pre-application advice at the same time. "
        },
        {
            "text": "Will CSHT revenue and capital items be bundled in one agreement? "
        },
        {
            "text": "Generally, it will be in one agreement. You should discuss what capital grants would help support your agreement with your adviser. However, you may need to apply for some capital items separately, such as for planning tools like Implementation Plans, Feasibility Studies, Agroforestry Plans or Species Management Plans. "
        },
        {
            "text": "What’s happening with capital grants? "
        },
        {
            "text": "Over the past year, the demand for capital grants has been exceptional. High demand for some grant items has led to spending levels that aren't sustainable. We are forecast to spend 49% more on capital grants this year than we paid out in 2023/24 and 125% more than in 2022/23. To ensure the funding can be prioritised to help build a sustainable farming sector, we’re simplifying and rationalising grant funding. Due to the overwhelming demand for some capital grant items, the main capital grant offer has temporarily closed to new applications - a total of 76 grant items. This is being done to prioritise funds for areas that will have the greatest benefit for food security and nature conservation. "
        },
        {
            "text": "You can still apply for: "
        },
        {
            "text": "Some CSHT actions will also require capital items as part of an application. You’ll need to discuss this with your Natural England adviser or Forestry Commission woodland officer. You may need to complete some of these items in the first year of your CSHT agreement. For more information on capital grant items, please visit GOV.UK.   "
        },
        {
            "text": "Visit the Funding for farmers page on GOV.UK to check if any of the currently open standalone grants might suit your business.  "
        },
        {
            "text": "Are you expanding the scheme so more people can apply? "
        },
        {
            "text": "Yes, we’re increasing the capacity of the CSHT scheme to allow more farmers and land managers to apply. Over the next few years, we expect to issue more CSHT agreements each year as we gradually expand the scheme. By March 2026, we aim to have around 1,200 new Higher Tier agreements in place, which is more than in the previous round of CSHT. "
        },
        {
            "text": "Will there be a limit on how many people can get a CSHT agreement?"
        },
        {
            "text": "We’ll roll out the scheme in a managed way, starting with invitations only, to ensure it works well for customers and that we can handle demand with the support available from Natural England and the Forestry Commission. As we continue to expand the scheme over the next few years, we’ll increase the number of CSHT agreements issued each year. In February, we’ll share more details on how farmers and land managers who aren’t invited initially but are interested in applying for CSHT can contact the RPA. "
        },
        {
            "text": "Can those who farm on common land apply for CSHT? "
        },
        {
            "text": "Applications for agreements on common land will open as soon as possible after the scheme launches in summer 2025. In the meantime, you can prepare by completing any necessary plans or studies. If you have an agri-environment CSHT or HLS agreement on common land that is due to end soon, you will be offered a mirror agreement or an extension to maintain funding until you can apply for CSHT. For agreements ending in 2025, Natural England will support you to develop a new CSHT agreement. "
        },
        {
            "text": "Will I scupper a future Landscape Recovery (LR) application by doing CSHT now (or vice versa) ?"
        },
        {
            "text": "When planning for LR, think not only about the final agreement but also about the steps needed to get there. As it can take two years or more to develop an LR agreement, land managers can participate in the Sustainable Farming Incentive (SFI) and CSHT schemes in the meantime to access funding while awaiting the finalisation of their LR agreement. "
        },
        {
            "text": "What about my woodland-specific application?"
        },
        {
            "text": "Woodland management plans approved from 2023 onwards are being prioritised for pre-application activities. Those whose agreements expired in 2024, and older Woodland Management Plans, will follow. Contact your local Forestry Commission team. "
        },
        {
            "text": "Will there be a payment for educational access?"
        },
        {
            "text": "Payments for Educational access visits (ED1) are something we’re offering through CSHT. ED1 supports school pupils and care farming clients to visit the site to learn, understand and become engaged with farming and the environment. The payment rate is £363 per visit. There’s also a capital item which will pay you to be accredited: AC2 Countryside educational access visits. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "During the webinar, we shared the following links: "
        }
    ]
}