{
    "url": "https://stratcommand.blog.gov.uk/2025/01/21/we-are-strategic-command-sharon-brookes/",
    "title": "We Are Strategic Command: Sharon Brookes",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-01-21T08:00:00+00:00",
    "content": [
        {
            "text": "Interviewer: Can you introduce yourself and share a bit about your background?Sharon: My name’s Sharon Brookes, and I’m the Senior Civil Servant (SCS) 1* Director of the Defence College for Military Capability Integration (DCMCI), part of Defence Academy. I’m also the Strategic Command Social Mobility Champion. I’ve been in the Civil Service for 32 years now, with 26 of those spent in defence, predominantly at Defence Equipment and Support (DE&S) in Abbey Wood"
        },
        {
            "text": "Interviewer: What’s something people might find surprising about your role?Sharon: Probably that, as the Director of a technical college, I don’t actually have a background in Science, Technology, Engineering and Mathematics (STEM), or training and education. My strength is leadership and bringing a different way of thinking. Not being a technical specialist actually enables me to ask fresh questions and encourage new approaches - I can empower my subject matter experts to apply their deep knowledge while challenging assumptions and helping them see challenges from different angles. About four years ago, I got the chance to join the Defence Academy and contribute to the defence education system—it was an opportunity I was really excited to take on."
        },
        {
            "text": "Interviewer: How did you progress into your current position?Sharon: Throughout my roles within Defence, particularly within Acquisition, I've seen firsthand just how crucial training, education and staying current with technology is - particularly for our technical specialists and project professionals."
        },
        {
            "text": "As Chief Operating Officer (COO) at DCMCI, I witnessed the exceptional work being delivered by our outstanding people. When the opportunity arose to apply for the role of Director on promotion, I was thrilled to be successful and take on the role and help drive DCMCI forward, knowing I could make a real difference."
        },
        {
            "text": "Interviewer: Can you explain the overall purpose of the Defence Academy and DCMCI?Sharon: Absolutely. The Defence Academy’s core purpose is to contribute to our fighting power. We contribute to the moral component through the Command and Leadership courses and for DCMCI we contribute to the physical component by educating people on how to develop, bring into service, and use technology."
        },
        {
            "text": "DCMCI’s mission is to strengthen defence’s technological edge and decision-making advantage we do this through the delivery of technical, higher education and training to the whole force."
        },
        {
            "text": "Interviewer: What areas does DCMCI cover?"
        },
        {
            "text": "Sharon: We have six schools that focus on a range of specialties:"
        },
        {
            "text": "In addition to training and education, we provide subject matter expertise, advice, and guidance to operations and broader defence and Government. We also support research and development."
        },
        {
            "text": "We deliver courses to over 10,000 students per year through short courses and modules, also nine Masters programmes (through our academic partner Cranfield University) with an intake of 200 masters students per year."
        },
        {
            "text": "Interviewer: How does DCMCI contribute to real-world defence operations?"
        },
        {
            "text": "Sharon: We work closely with the wider defence community and have strong connections with teams supporting operations.  We ensure that lessons learned from ongoing operations are integrated into our education programmes, keeping our training relevant and impactful, this will be further enhanced following the development of the new Integrated Design Authority."
        },
        {
            "text": "Interviewer: If you had to summarise DCMCI’s role in a nutshell, how would you describe it?Sharon: In short, DCMCI is all about educating defence by advancing science and technology, fostering innovation and integration, and increasing knowledge."
        }
    ]
}