{
    "url": "https://educationhub.blog.gov.uk/2022/07/17/how-we-are-ensuring-all-schools-have-lifesaving-defibrillators/",
    "title": "How we are ensuring all schools have lifesaving defibrillators",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School safety",
        "Schools"
    ],
    "pub_date": "2022-07-17T00:01:22+01:00",
    "content": [
        {
            "text": "On 12 September, the Department for Education sent a survey to all schools in England to determine how many automated external defibrillators (AEDs) exist across the school estate. The term ‘automated external defibrillator’ refers to defibrillators that can be placed externally on the body."
        },
        {
            "text": "We have asked schools to respond by 10 October to tell us whether they have an AED onsite."
        },
        {
            "text": "If your school has not received a survey link, please contact AED.operations@education.gov.uk"
        },
        {
            "text": "There is clear evidence showing that defibrillators drastically increase the chance of survival from a cardiac arrest."
        },
        {
            "text": "That’s why we plan to provide all state funded schools with defibrillators by the end of next year."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "We have announced that state-funded schools across England will receive defibrillators."
        },
        {
            "text": "The defibrillators will make sure there is a life-saving device in every school and boost their numbers in communities across the country."
        },
        {
            "heading": 3,
            "text": "Why is this happening now? "
        },
        {
            "text": "Last year, we committed to looking at how every school site could have a defibrillator, following a meeting with the Oliver King Foundation - supported by ex-footballer Jamie Carragher - which has worked tirelessly to raise awareness of this issue."
        },
        {
            "text": "Since meeting with the foundation’s founder, Mark King, who tragically lost his son Oliver at the age of 12 to a cardiac arrest, the government has worked with charities and experts, including the British Heart Foundation, to identify the scale of need across English schools."
        },
        {
            "heading": 3,
            "text": "Why are defibrillators in schools important? "
        },
        {
            "text": "Defibrillators have the potential to save the lives of pupils, staff and visitors in schools, with latest research showing that accessing these devices within 3-5 minutes of a cardiac arrest increases the chance of survival by over 40%."
        },
        {
            "text": "It’s particularly important that they are available close to sports halls and playing fields that children, young people, and the wider community use daily."
        },
        {
            "heading": 3,
            "text": "What else are you doing in schools to help with health and safety? "
        },
        {
            "text": "The rollout of defibrillators will build on existing requirements for schools to teach first aid as part of the curriculum, with secondary school pupils being taught life-saving methods such as cardiopulmonary resuscitation (CPR) and why defibrillators are used."
        },
        {
            "heading": 3,
            "text": "When will all schools have defibrillators? "
        },
        {
            "text": "Many schools already have defibrillators on-site."
        },
        {
            "text": "The purpose of this programme is to plug the gaps, giving more schools and local communities access to this vitally important first-aid equipment."
        },
        {
            "text": "A survey will soon go out to all state-funded schools to finalise the number of devices that will need to be procured, which is estimated to be over 20,000."
        },
        {
            "text": "We have committed to funding all necessary devices so that every school has at least one on-site, or more for schools with larger sites."
        },
        {
            "text": "Further details of the rollout and device specification will be confirmed in the autumn term."
        }
    ]
}