{
    "url": "https://gfie.blog.gov.uk/2022/07/04/a-complete-guide-to-gfie-prison-leavers-and-lived-experience/",
    "title": "A complete guide to GFiE - Prison Leavers and Lived Experience",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "Life Chances",
        "Prison Leavers"
    ],
    "pub_date": "2022-07-04T14:18:00+01:00",
    "content": [
        {
            "text": "In this article we provide a full end to end guide to recruitment through Going Forward into Employment for those leaving prison and with lived experience."
        },
        {
            "heading": 3,
            "text": "What is this scheme?"
        },
        {
            "text": "Going Forward into Employment (GFiE) provides innovative approaches to recruitment, which provides people from a wide range of backgrounds, who face barriers to employment, with Life Chance opportunities within the Civil Service.  Our scheme helps to make the Civil Service more representative of the country it serves. "
        },
        {
            "text": "As part of the Government's Beating Crime plan, the Civil Service has committed to recruiting 1000 Prison Leavers by Dec 2023.  As part of this commitment, GFiE is leading the recruitment of 500 Prison Leavers (including those with lived experience) into roles across the Civil Service. "
        },
        {
            "text": "GFiE works with organisations that support people who have been released from prison or served a community sentence within the last 5 years, to find employment within the Civil Service.  We are working to break the negative stigma around hiring people with convictions, and providing work placements and fixed term contracts for up to 24 months across the Civil Service - which could lead to permanent employment."
        },
        {
            "heading": 3,
            "text": "Who is this scheme for?"
        },
        {
            "text": "The scheme is available to those who have recently been released or who have been released from prison within the last 5 years and/or served a community sentence order within the last 5 years.  You would normally be referred into the scheme by an organisation you are engaged with or who are providing you with support."
        },
        {
            "text": "There are a few convictions that at this time we have deemed as out of scope and these include: Life Sentences, Hate or Terrorism Crimes, Sex Offences and Arson."
        },
        {
            "text": "Currently, we are unable to accept candidates, who are risk assessed to be released on temporary licence (ROTL) while still serving their sentence."
        },
        {
            "text": "Please note: some job roles may also have additional convictions which cannot be accepted due to the nature of the role. These will be clearly stated on our materials and are handled on a case by case basis. "
        },
        {
            "heading": 3,
            "text": "What types of roles are available:"
        },
        {
            "text": "Most roles made available through the opportunities are open for entry level and up to first line management grades. "
        },
        {
            "text": "Each unique opportunity can offer a Fixed Term Appointment for up to 24 months, which may have a potential to be made permanent. "
        },
        {
            "text": "Typical opportunities can include roles which: "
        },
        {
            "text": "Some roles also provide the opportunity to complete qualifications (like an apprenticeship). Further professional learning is available to support your development and career. "
        },
        {
            "heading": 2,
            "text": "How does it work?"
        },
        {
            "heading": 3,
            "text": "Recruitment for Departments"
        },
        {
            "text": "Once a department has highlighted a vacancy that they wish to fill with a prison leaver, they bring it to the Going Forward into Employment team.  These are usually entry level roles up to first line manager (EO), but we can still work with you if you have other options."
        },
        {
            "text": "Departments will provide all relevant job descriptions, contract lengths (max two year fixed term appointment) and relevant details."
        },
        {
            "text": "We then work with the vacancy holder and relevant professional bodies to fill roles across the country.  Referees will usually do a risk-based assessment and highlight interested candidates who would be deemed as suitable for the advertised post, mindful of any specific skills requested for the role."
        },
        {
            "text": "The potential candidate(s) will then normally provide an expression of interest and undertake an informal interview/meeting with the department contact to ensure suitability and take the opportunity to find out more about each other."
        },
        {
            "text": "We ensure the department is happy to accept the candidate, supported by details of a full risk assessment undertaken by a relevant official.  We then agree on a date upon which the candidate will start, considering factors such as release circumstances and checks required."
        },
        {
            "heading": 3,
            "text": "Candidate Applications"
        },
        {
            "text": "All of our vacancies will be shared with our network of contacts from referring professional organisations - such as those from charities, DWP, Ministry of Justice, Prison and Probation etc. This network then shares the roles with any of their suitable candidates, working with them to submit an application to GFIE. "
        },
        {
            "text": "We do request where possible, that all applications are sent in by a suitable referee who is able to explain their recent experience of working with the candidate and their attitude and progress towards rehabilitation. "
        },
        {
            "text": "To apply for our roles, we ask all candidates to submit a CV and complete an Expression of Interest (EOI) form which will ask you to write a short 250 word description of why you would like to work for the civil service. (Please feel free to write more than 250 words). "
        },
        {
            "text": "We also ask for the CV and EOI to be accompanied with a candidate referral form, which needs to be completed and sent in by the person referring them. This form will ask for details of the candidate's conviction, so that we can check that they are eligible for the scheme. "
        },
        {
            "heading": 4,
            "text": "Candidates - Complete a CV and Expression of Interest form (min 250 words)\nReferee - Complete the Candidate Referral form "
        },
        {
            "text": "After receiving your application, the GFIE team will review the application to make sure that the candidate fits the criteria. Once signed off, we will then pass the candidates forms to the vacancy holder for review and interview selection. We will notify all candidates about the status of the application once we have the vacancy managers interview list. "
        },
        {
            "heading": 3,
            "text": "Candidate bank"
        },
        {
            "text": "This year, we opened up the GFIE candidate bank! That means that you can now submit your candidate's CV and candidate referral form straight into the GFIE inbox without even having to apply for a role. The GFIE team will contact the candidates directly (or the specified contact, if the candidate is still in custody) about any suitable upcoming roles and help them to apply directly with us. "
        },
        {
            "heading": 3,
            "text": "Interview"
        },
        {
            "text": "For those invited to interview, this will either be an in-person meeting or as a call held via MS Teams.  The interview is going to be an opportunity for the people candidates are meeting to find out a bit more about candidates and their potential to fit in the role. It's also a good opportunity for candidates to ask any questions they have about the role, including what a day in the job can look like or more information about the team."
        },
        {
            "text": "Please also be aware that we ask candidates to disclose their offence at interview, as we feel that this is the best opportunity to do so face-to-face when the circumstances can be explained in person, and any future support can be explored. There is some helpful guidance available on Unlock's website here about preparing for disclosure. If you are unsure about which offences you need to disclose, please use the disclosure calculator available here. "
        },
        {
            "heading": 3,
            "text": "Vetting"
        },
        {
            "text": "Once a candidate has accepted the job offer, they will go through the usual Civil Service vetting process, which on average takes between 8-16 weeks. Candidates will be asked to submit a number of ID documents including: Photo ID, 2x Proof of address, National Insurance number, contact details. The GFIE scheme’s use of exception 2 means that during the vetting stage we are able to accept offences that might not otherwise pass the security clearance. This stage requires the department's security team to sign off on the risk level. "
        },
        {
            "text": "It is hugely important that at this stage, the candidates disclose all of their past and current unspent offences. The vetting process will identify all unspent convictions, and any attempt to withhold convictions will be looked on unfavourably and can cause job offers to be retracted. If the candidate cannot remember all convictions, they can either request a copy of their record from the Police National database, or explain on the vetting forms that they have listed as many convictions as they can recall but others may be shown. Disclosure calculators available at MoJ website and Unlock website can help in working out which convictions need to be disclosed."
        },
        {
            "heading": 3,
            "text": "How to get involved:"
        },
        {
            "text": "If you are a Civil Servant you can use one of our schemes to fill your vacancy! Contact us for more information.  "
        },
        {
            "text": "If you are looking for work and are a Prison Leaver or have lived experience and are interested in applying for a role you can contact us for more information. "
        },
        {
            "text": "Many Civil Service roles are also advertised on CS Jobs and will state clearly if they are open to applications from prison leavers. You can find more information about this on the Civil Service Careers site."
        },
        {
            "text": "If you are a Probation Officer/Case Worker or similar and are looking to refer one of your candidates to our scheme, you can get in touch with us here to submit an application.  "
        },
        {
            "text": "If you are an organisation who works with Prison Leavers and are interested in our work, you can get in touch with us here."
        },
        {
            "heading": 3,
            "text": "Get In Touch"
        },
        {
            "text": "For more information on all of our other schemes check out our blog."
        },
        {
            "text": "Or check out our Twitter page."
        },
        {
            "text": "Get in touch with us by emailing us at  GFIE@cabinetoffice.gov.uk. "
        }
    ]
}