{
    "url": "https://digitaltrade.blog.gov.uk/2022/07/04/building-our-user-research-capability-in-dit/",
    "title": "Building our User Research Capability in DIT",
    "authors": [
        "Jonathan Nicholls, Head of User Research"
    ],
    "categories": [
        "Careers",
        "Culture",
        "People and Skills",
        "User research"
    ],
    "pub_date": "2022-07-04T16:08:19+01:00",
    "content": [
        {
            "text": "If you are interested in user research (UR) that makes a difference, 2022 is shaping up as an exciting year at the Department of International trade (DIT). This blog highlights 3 challenges we are working on to develop and embed the UR profession in DIT. "
        },
        {
            "text": "We have launched our new Digital, Data and Technology (DDaT) Strategy, with a clear aspiration to become a user centric organisation. This brings real opportunities for UR. "
        },
        {
            "text": "Firstly, DDaT is moving from “start-up”, developing lots of services at pace to support UK trade after EU Exit, to “scale-up”.  In this new phase, we are thinking far more about how our digital professions can best work together to deliver great services."
        },
        {
            "text": "Secondly, one of DIT’s five strategic pillars is “Championing the user”. Our User Centred Design (UCD) mission is to “explore and champion the needs of our users, helping DIT design services that maximise successful international trade”. User research is at the heart of this."
        },
        {
            "text": "Finally, DIT has some great values, including being “enterprising”, in other words, “commercially savvy … and innovative in how we work”.  So, it’s an exciting time to challenge ourselves about how we deliver user research to make sure we have an impact. "
        },
        {
            "heading": 2,
            "text": "The 3 challenges we are working on \n"
        },
        {
            "heading": 3,
            "text": "Making sure user research has impact "
        },
        {
            "text": "We’re really curious about how we can develop our practice to increase our impact. In lots of settings, user researchers see things being built that may not pay enough attention to user insights and not fully meet user needs. Yet when we raise this, we are sometimes told that we are slowing things down and being a blocker. "
        },
        {
            "text": "Of course, some of this comes with our role: we need to be the advocate for the user. We need to ask the awkward questions. We need to point out that, if the design team wait for our research findings, services will: "
        },
        {
            "text": "However, can we adapt how we play our role to increase our influence? DIT is highly delivery focused: all our stakeholders, from Ministers down, are ambitious for us to build the services that help exporters and investors. This means the pressure on our teams to deliver at pace is considerable. If, as user researchers, we are always saying, “hold on, wait for the research”, the risk is that our voice gets marginalised. "
        },
        {
            "text": "So, the challenge for us is how we manage this tension. To meet service standards, we need to make sure our teams hear and take the user voice into account as we design and build services. Beyond that, how do we reflect on our own practice and innovate to be as responsive as possible to the delivery pressures the department faces? "
        },
        {
            "text": "This raises some important questions for how we do user research. For instance, do we always get the balance right between focusing on the biggest risks versus understanding the whole system?  Where do we draw the line between the “ideal” research design, and doing “just enough research” to help the team make their next decision? How do we create a culture of continuous discovery, rather than seeing discovery as a gate we have to get through before starting to prototype? "
        },
        {
            "text": "By getting questions like this right, it helps us build decisions a little quicker, ensuring that teams deliver at the pace the department needs. So, this helps make sure the user research we do has the impact we want.  "
        },
        {
            "text": "This also relates to a broader ongoing debate about how service teams retain agility and flexibility. Voices such as Tom Loosemore and Richard Pope, key players in establishing the Government Digital Service (GDS) and the service standard, are waving cautionary flags. Their concern is that the formal discovery-alpha-beta-live design process is starting to look dated and risks becoming a straight-jacket. See Tom’s post on Twitter and Richard’s post on Twitter as examples. As user researchers, how should we be responding to this challenge? With DIT’s enterprising “willingness to innovate”, we are keen to find people who want to be part of working this out. "
        },
        {
            "heading": 3,
            "text": "Career paths and development "
        },
        {
            "text": "We want DIT to be a great place to develop your user research career. We are creating some new Grade 7 management roles to give us more management resilience and headroom for Senior Executive Officers (SEOs) with management ambitions. We also want to move towards growing our own talent by bringing people in at more junior levels, and as interns and apprentices. "
        },
        {
            "text": "This means we will be looking at establishing career paths for DIT user researchers. We need to make sure we have the right training and development in place to support that career development. "
        },
        {
            "text": "It also means for everyone already in the team, there will be a much greater emphasis on coaching and development of less experienced team members. This can be one of the most rewarding parts of the job. "
        },
        {
            "heading": 3,
            "text": "Reinvigorating our community "
        },
        {
            "text": "DIT has long had an active user research Community of Practice.  As we bring more permanent researchers into the team, we are keen to refresh our Community Hour meetings. These are great opportunities to share experiences and learn from each other and we plan to make them a hub of professional and community development.  "
        },
        {
            "text": "We are also keen to make our community meetings much more central to how we grow our capability, individually and as a team. For example, we want to get more external speakers and more training around some of our core skills as researchers. "
        },
        {
            "text": "We are also planning how to connect more with other DIT DDaT professions so we can consider how best to work together on building services. And we must continue building a safe space where we can reflect on our practice and do activities such as research crits.  Consequently, the research community should become a central part of thinking about how we build our profession in DIT.  We will need volunteers to keep this moving in the right direction."
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "There are many other challenges for us to look at. For instance, we are setting up a research operations function and one of its roles is to make sure we’ve got the right research tools. We also need to improve our knowledge management so our research can support more of the service development work we are doing. The list goes on.   "
        },
        {
            "text": "The team is already doing great work in some of these areas. Hopefully this gives you a sense of our direction of travel to build this out further. Our aspiration to bring the user voice into the business is strong. Do we always have the impact we want? No, we are still a relatively new team, and we are still working it out. But we’re keen to build a team with the ideas and energy to help take this agenda forward. "
        },
        {
            "text": "If this sounds an exciting journey, you’re up for a challenge and want to build a vibrant, impactful UR profession, please visit our jobs page. We are likely to have other roles coming up throughout the year, so please get in touch if you are interested to learn more."
        }
    ]
}