{
    "url": "https://deframedia.blog.gov.uk/2022/07/04/emma-howard-boyd-speech-on-finance-resilience-net-zero-and-nature/",
    "title": "Emma Howard Boyd speech on finance, resilience, net zero and nature",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-07-04T16:14:22+01:00",
    "content": [
        {
            "text": "Today there has been widespread coverage of warnings by Emma Howard Boyd, Chair of the Environment Agency and Interim Chair of the Green Finance Institute, of how widespread greenwashing is compromising efforts to prepare for climate impacts."
        },
        {
            "text": "Her comments have been widely covered by national, regional and trade publications, including the Daily Telegraph, Daily Express, Guardian, Independent, Daily Mirror, and Business Green, and she was also interviewed on BBC Radio 4 Today."
        },
        {
            "text": "In her speech to the UK Centre for Greening Finance and Investment Annual Forum at The Institution of Civil Engineers, Howard Boyd said that businesses are “embedding liability” and “storing up risk for their investors” by giving a false impression they are addressing the climate crisis and the danger is people “won’t realise this deception until it is too late.”"
        },
        {
            "text": "She said:"
        },
        {
            "text": "She also warned that nearly £650 billion of public and private infrastructure investment planned by 2030 is at considerable risk unless increasingly severe climate impacts are considered in planning and delivery, and called for more government involvement to help drive investment in climate adaptation, starting with a Treasury-commissioned review to assess the economics of climate resilience, similar to the 2021 Dasgupta Review into the economics of biodiversity."
        },
        {
            "text": "Her comments come after the publication of the Climate Change Committee’s annual progress report last week, which included a reminder that “expected changes in the UK climate will lead to risks across all areas of the UK’s economy, society and environment” and that “adaptation action must be undertaken today to prepare for these impacts and is essential alongside (but not in place of) efforts to reach Net Zero”."
        }
    ]
}