{
    "url": "https://educationhub.blog.gov.uk/2022/07/04/how-we-are-driving-down-the-costs-of-childcare/",
    "title": "How we are driving down the costs of childcare",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Childcare",
        "Funding"
    ],
    "pub_date": "2022-07-04T13:08:15+01:00",
    "content": [
        {
            "text": "The UK has some of the highest-quality childcare provision in the world with 96% of early years settings rated by Ofsted as good or outstanding, but it is also one of the biggest costs facing working families today."
        },
        {
            "text": "That’s why we have announced new plans to improve the cost, choice and availability of childcare that will benefit hundreds of thousands of parents across the country."
        },
        {
            "text": "Here is what you need to know about how we are driving down the cost of childcare for parents."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "To drive down costs for providers and parents, a new consultation will look at increasing the number of children that can be looked after by each staff member in early years settings."
        },
        {
            "text": "It will propose changing staff-to-child ratios from 1:4 to 1:5 for two-year-olds, giving providers more flexibility in how they run their businesses while maintaining safety and quality of care."
        },
        {
            "text": "This enables providers to keep costs as low as possible for parents."
        },
        {
            "heading": 3,
            "text": "Why have you done this? "
        },
        {
            "text": "With the cost of living continuing affect families, we are committed to doing everything we can to support families with their finances while keeping people in high-wage, secure jobs that help grow the economy."
        },
        {
            "text": "These new plans will ensure high-quality and affordable childcare is accessible to all."
        },
        {
            "heading": 3,
            "text": "Are you doing anything to help childminders as well as nurseries? "
        },
        {
            "text": "Yes, we also plan to increase choice and affordability for parents by taking action to open up the childminder market."
        },
        {
            "text": "While early years settings such as nurseries are the most popular option for families, childminders are generally the most affordable and flexible form of childcare."
        },
        {
            "text": "While the average cost of a two-year-old attending a nursery for 50 hours a week in England is £265 per week, this compares to £236 with a childminder."
        },
        {
            "text": "The government will support more people to become childminders in several ways. These include reducing the upfront costs of becoming a childminder via financial support, and we are consulting on giving childminders greater flexibilities within the ratios when looking after their own children or siblings of other children."
        },
        {
            "heading": 3,
            "text": "What childcare support is already available for my family? "
        },
        {
            "text": "We have spent more than £4 billion each year for the last five years helping families with the cost of childcare, but almost one million eligible families have not taken up their right to Tax-Free Childcare, which is worth £2,000 per year or £4,000 for children with disabilities."
        },
        {
            "text": "Universal Credit Childcare allows families to reclaim 85% of their childcare costs, worth up to £1,108 per month."
        },
        {
            "text": "The government also offers 15 hours per week of free childcare or early education for all 3- and 4-year-olds, rising to 30 hours for working families, and 15 hours for disadvantaged 2-year-olds."
        },
        {
            "text": "The Government recently announced that eight million of the most vulnerable households (around a third of all UK households) will receive £1,200 this year and all families will receive £400 – this is on top of changes to Universal Credit, National Living Wage and National Insurance thresholds, so that people keep more of what they earn."
        },
        {
            "text": "You can find out more info on support available on the Childcare Choices website."
        }
    ]
}