{
    "url": "https://space.blog.gov.uk/2022/07/04/the-night-sky-in-july-2/",
    "title": "The night sky in July",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy",
        "Stargazing"
    ],
    "pub_date": "2022-07-04T11:59:20+01:00",
    "content": [
        {
            "text": "With all of the planets in our Solar System, fascinating stars and constellations, the dense band of stars that make up our beautiful Milky Way galaxy, and the possibility of meteors and noctilucent clouds, July is a great month for a night under the stars!"
        },
        {
            "heading": 2,
            "text": "The Moon and planets"
        },
        {
            "text": "All eight planets in our Solar System can still be seen lined up in the pre-dawn skies, though you’ll likely need binoculars or a telescope to see Uranus and Neptune."
        },
        {
            "text": "For those of us that grew up with nine planets, even Pluto, which lost its planetary status in 2006, can be found to the right of Saturn between the constellations of Capricornus and Sagittarius."
        },
        {
            "text": "Mercury, the closest planet to the Sun and the fastest moving, becomes harder to spot after the first week of the month as it moves back into the glare of the rising Sun. It’ll pass back out of sight and behind our star mid-month, re-appearing in the evening sky by the end of the July."
        },
        {
            "text": "It’s a great time to see the gas giants of our Solar System: Jupiter and Saturn. Both planets rise in the south-east soon after darkness falls, and they’re relatively high in the southern pre-dawn skies. Earth is approaching ‘opposition’ to both planets – the point in our orbit around the Sun where we’re closest to the gas giants - so they appear larger and brighter than they have been in recent months."
        },
        {
            "text": "The full Moon this month is on 13 July and will appear low in the southern constellation of Sagittarius. It will be the largest full \"supermoon\" of the year, due to the Moon being closer to the Earth in its orbit around our planet at the time of the full Moon phase."
        },
        {
            "text": "In reality, a supermoon will only appear around 15% larger in our sky, but the effect can be magnified by the \"Moon illusion\", where the Moon will look even larger when it is close to the horizon. Find our more about this phenomenon."
        },
        {
            "text": "Top tip:  To observe the \"Moon illusion\", find the time for moonrise or moonset at your location and find a spot with a low or clear view of the horizon. The illusion takes effect regardless of the Moon’s phase, but is even more spectacular at full Moon."
        },
        {
            "heading": 2,
            "text": "Meteor showers"
        },
        {
            "text": "The peak of the Delta Aquarids meteor shower aligns with the new Moon towards the end of this month, and the darker skies this allows make it a great opportunity to watch for debris from comets Marsden and Kracht streaking through our atmosphere."
        },
        {
            "text": "This meteor shower overlaps with the start of two other showers: the Alpha Capricornids (a minor shower with just a few meteors per hour, but with a reputation for producing bright fireballs in recent years) and the greatest shower of the year, the Perseids."
        },
        {
            "text": "Unfortunately next month's peak of the Perseids falls with the bright full Moon, so the darker skies at the end of July and the start of August might be the best time to go meteor spotting!"
        },
        {
            "text": "Did you know: Over 900 meteor showers are believed to take place every year, with around 110 of these being well established. Around 30 of these produce the classic \"shooting stars\" visible to us here on earth’s surface."
        },
        {
            "heading": 2,
            "text": "Spectacular stars in the summer night sky"
        },
        {
            "text": "The brighter stars visible to us in the summer months give us a fascinating flavour of the variety of stars in our night skies."
        },
        {
            "text": "The first stars to appear high in the south-east as the light fades will Vega, Deneb and Altair, the stars that make up the \"summer triangle\"."
        },
        {
            "text": "Vega’s brightness is primarily due to its proximity to our Solar System, at just 25 light years away.  Around twice the size of our Sun, astronomers used Vega’s brightness as the baseline for measuring the brightness of all stars."
        },
        {
            "text": "Altair is just 16 light years away, and spins with such speed that it isn’t spherical but flattened at its poles. It’s only slightly larger than the Sun but takes just nine hours to rotate on its axis where our Sun takes around 25 days."
        },
        {
            "text": "Deneb is between 100 and 200 times larger than our star and as much as 200,000 times as bright. It lies over 1,500 light years away, and would cast shadows here on Earth if it were as close to us as Vega or Altair!"
        },
        {
            "text": "High in the south-west and around 37 lights years away is Arcturus, a red-giant star as bright as Vega, but with a visibly orange hue. It is 25 times larger than our Sun and is known for its power, radiating more than 200 times the heat of our sun."
        },
        {
            "text": "Low in the south lies the reddish glow of giant star Antares, whose name comes from the ancient Greek of \"rival to Mars\" because of its colouration. Having swollen to around 700 times the size of our Sun as it approaches the end of its life, it has developed a foam-like density of less than one-millionth of our Sun!"
        },
        {
            "text": "Did you know: These stars are all larger than our Sun, but they’re dwarfed by the star UY Scuti in the constellation of Scutum (situated between Aquilla and Sagittarius). It is one of the largest stars discovered, a red super-giant some 1,700 times larger than the Sun. Its characteristics make it hard to measure its distance exactly, but it’s likely between 5,000 and 9,000 light years away, meaning you’ll need binoculars or a small telescope to see it."
        },
        {
            "heading": 2,
            "text": "Noctilucent clouds"
        },
        {
            "text": "Noctilucent clouds have been spotted around the country through June, so keep your eyes out for the blue-ish glow of this beautiful phenomenon, which can appear an hour or two after sunset and before sunrise in the northern sky. They are caused by ice crystals high in our atmosphere being underlit by the Sun as it sweeps just below the northern horizon through the nights of the summer months."
        },
        {
            "heading": 2,
            "text": "The International Space Station"
        },
        {
            "text": "There are some bright passes of the ISS this month, sometimes several a night. The best time to see it is usually in the hour or two after sunset and before sunrise; also the best time to see noctilucent clouds. You can find the times of all ISS passes for your location online."
        },
        {
            "heading": 2,
            "text": "Space exploration"
        },
        {
            "text": "The BepiColumbo spacecraft conducted its second flyby of the innermost planet Mercury recently, and you can now view footage of the pass online."
        },
        {
            "text": "The mission is a collaboration between the European Space Agency (ESA) and the Japanese Aerospace Exploration Agency, and is just the third spacecraft to visit the innermost planet, following NASA’s Mariner and Messenger missions of the mid-1970s and 2010s."
        },
        {
            "text": "It is extremely difficult to visit Mercury, actually requiring more energy than propelling a spacecraft to Pluto. Once on a trajectory for Mercury, the challenge is slowing the spacecraft down when it gets there."
        },
        {
            "text": "The enormous gravity of the Sun accelerates any object heading in towards it, and ESA is using a series of manoeuvres to slow the spacecraft down sufficiently to bring it into orbit in 2025."
        }
    ]
}