{
    "url": "https://deframedia.blog.gov.uk/2023/09/17/environment-secretary-on-the-xl-bully-ban/",
    "title": "Environment Secretary on the XL Bully ban",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-09-17T16:02:45+01:00",
    "content": [
        {
            "text": "Shocking incidents cause concern among our communities and are a clear demonstration of the danger that out of control dogs pose.  We have been working hard with the police, local authorities and animal welfare groups to help prevent attacks by encouraging responsible dog ownership, to ensure dog control issues are addressed before they escalate and to make sure the full force of the law is applied."
        },
        {
            "text": "Owners who let their dogs terrorise people or other animals are already breaking the law, and we already have a full range of powers to apply penalties to owners who do not control their pets. Any dog that is dangerously out of control can be euthanised and their owners put in prison for up to 14 years and be banned from ever owning a dog."
        },
        {
            "text": "However, given the recent rise of fatalities and other attacks it is clear that the time has now come for more decisive action - aimed specifically at the American XL bully.  Very sadly, fatal and serious dog attacks have risen sharply this year - with the American XL bully disproportionately involved in this rise."
        },
        {
            "text": "That is why we will update the current list of banned dogs to include the American XL bully. These dogs would appear to be valued by some as status symbols prized for their aggressive temperament. We will not tolerate this any longer."
        },
        {
            "text": "This has been under consideration for some time, but making it happen within the law is not quite as straightforward as people may think, as the XL Bully is not formally recognised as a breed in the UK.  We will be working with experts at pace to formally define the American XL bully and its characteristics so it can be added to the four breeds already banned by the Dangerous Dogs Act."
        },
        {
            "text": "This is a critical first step on the road to a ban on the future breeding and sale of these dogs. While the courts have the power to allow people to keep banned breeds with certain conditions, like being muzzled and neutered, the number of so-called exempted dogs is higher than a decade ago. That was not the intention of the legislation passed over 30 years ago. Therefore, we will also review our guidance to enforcers of the law."
        }
    ]
}