{
    "url": "https://environmentagency.blog.gov.uk/2024/12/23/cornish-daffodils-without-the-muddy-floods/",
    "title": "Cornish daffodils without the muddy floods ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Environment Agency",
        "Flood",
        "Sustainability"
    ],
    "pub_date": "2024-12-23T08:59:02+00:00",
    "content": [
        {
            "text": "Stephen Webster is a land management officer in Cornwall and has worked with daffodil growers over the last two years to reduce flood risk and soil erosion.  "
        },
        {
            "text": "Cornwall is the home of daffodils, with four out of five flowers cut and sold globally coming from this beautiful county. That works out at roughly 900 million daffodil stems grown in Cornwall per year.  "
        },
        {
            "text": "The humble daffodil also contributes to the UK economy, generating more than £100 million in retail sales. And from a sustainability point of view, these home-grown flowers have a significantly lower carbon footprint when compared with the rest of the UK cut flower market of which 86% is imported, usually via air freight.    "
        },
        {
            "text": "That’s just a handful of the facts I’ve picked up in my job as an officer who is lucky enough to visit rolling yellow fields and work with knowledgeable growers to make sure the daffodil crop has a bright future in Cornwall, with as little environmental and flooding risk as possible. "
        },
        {
            "text": "What can be done to help prevent pollution and flooding? The most used technique by daffodil growers throughout Cornwall is the use of a fast-growing nurse crop to stabilise the soil in the first year after bulb planting. This first year is when the soil is bare and loose and most at risk of run off.  "
        },
        {
            "text": "Other measures (and there are many) include the use of a tied ridging, as seen in the photo below. This machine create ridges in the tramlines (impressions left by the wheels of tractors), to disrupt any overland water flows – allowing them to soakaway naturally into the flower ridges.  "
        },
        {
            "text": "One of the growers I work with is Varfell Farms in Penzance. Varfell is the world’s largest daffodil farm and managed by Farms director Simon Gardner.  "
        },
        {
            "text": "Varfell and Simon, over the last decade, have looked to improve soil and plant health, reduce soil erosion and water runoff. A longer and more diverse crop rotation has been planned to include cover cropping in the place of some cash crops, with species carefully chosen to enhance soil health. Varfell also controls the amount of farming traffic to minimise soil compaction. The farm uses appropriate tillage not just to address soil compaction but also to promote beneficial microbes, which are all part of the farm’s regenerative approach.  "
        },
        {
            "text": "Simon welcomes the new approach that the Environment Agency has adopted to work more proactively with growers like Varfell. He says its great working with competent officers to discuss cropping and how land management practises can be tweaked to reduce environmental risks in an ever-changing climate.  "
        },
        {
            "text": "The proactive work together includes using the free Environment Agency mapping tool called ￼ALERT which stands for The Agricultural Land & Environment Risk and Opportunity Tool, to help assess a field’s risk for causing pollution or surface water flooding. ALERT takes slope, LiDAR data - which shows where water will flow in extreme weather events, and soil type to indicate the inherent risk of a field. We then discuss if a high-risk crop like daffodils should or shouldn’t be grown, and if the field is suitable what in-field mitigations can be put in place to prevent any adverse impacts.  "
        },
        {
            "text": "ALERT isn’t just for daffodils and is publicly available on the farming advice service website to help all land managers. "
        },
        {
            "text": "The Environment Agency is a regulatory body. If you cause pollution, appropriate enforcement action will be taken. But it is the aim that using a best practice approach, as used by the Cornish daffodil growers, will reduce the likelihood of enforcement occurring.  "
        }
    ]
}