{
    "url": "https://defrafmp.blog.gov.uk/2024/12/23/highlights-of-2024-fmp-milestones-and-what-to-expect-in-2025/",
    "title": "Highlights of 2024: FMP milestones and what to expect in 2025",
    "authors": [
        "Claire Dyer - Policy Advisor, Defra",
        "Eleanor Pettitt-Fergusson - Senior Policy Advisor, Defra"
    ],
    "categories": [
        "-Defra FMPs"
    ],
    "pub_date": "2024-12-23T10:40:06+00:00",
    "content": [
        {
            "text": "As 2024 concludes, it feels like the perfect time to reflect on what we’ve achieved together. "
        },
        {
            "text": "It’s been a year full of challenges, change, and exciting milestones, all driven by your collaboration and support. None of this would have been possible without your engagement, insights, and commitment—thank you! "
        },
        {
            "heading": 2,
            "text": "A strong start to the year"
        },
        {
            "text": "January began with momentum as we had recently published the government’s summary of responses to our first five Fisheries Management Plans (FMPs).  "
        },
        {
            "text": "The Marine Management Organisation (MMO) also raised the Minimum Conservation Reference Size for crawfish in ICES area 7, to support the sustainability of the stock.  "
        },
        {
            "text": "Over February and March we held face to face and online workshops with stakeholders to promote a common understanding of the emerging FMP evidence gaps and support a collaborative approach to progressing FMP evidence development and delivery. "
        },
        {
            "heading": 2,
            "text": "Springing forward with new initiatives"
        },
        {
            "text": " In April, under the previous government, we introduced four new FMPs through a webinar.  "
        },
        {
            "text": "Meanwhile our delivery partners progressed the implementation of the published plans: MMO hosted a cuttlefish workshop which was followed by coastal events in Newlyn, Brixham, Shoreham and Hastings, and Seafish held discussions on the principles and options of a new national whelk permit. "
        },
        {
            "heading": 2,
            "text": "Casting the net wide through summer to autumn"
        },
        {
            "text": "In late August, we relaunched our FMP blog- a new way to share how we’re taking FMPs forward. "
        },
        {
            "text": "In September MMO introduced new codes on the Catch Recording App to differentiate between species of octopus and cuttlefish and gather evidence of catches.  Flashcards to help with identification are available from your local MMO office.  "
        },
        {
            "text": "October brought further announcements:  the flatfish FMP was published, and we laid legislation in Parliament to implement measures from the published FMPs."
        },
        {
            "text": "We also launched consultations for five new FMPs and amendment to Annex A of the Joint Fisheries Statement (JFS) proposing to review timelines.  "
        },
        {
            "text": "Meanwhile we supported a three-day pilot fisheries event held in Cornwall by Defra in partnership with the commercial fishing industry, to engage with stakeholders in shaping the future of fisheries management including several relevant FMPs for the area. We will be publishing a report summarising this workshop in early 2025- stay tuned to the blog for updates.  "
        },
        {
            "heading": 2,
            "text": "Closing the year with a bang"
        },
        {
            "text": "By November, Defra wrapped up the JFS consultation, with 40 positive responses—an encouraging sign of continued support.  "
        },
        {
            "text": "In December, we celebrated yet another milestone as the legislation laid in Parliament in October took effect.  "
        },
        {
            "text": "We also published the list of evidence statements and evidence gaps for the first six plans; you can explore the list here. These gaps were identified because of our engagement with communities, including commercial fishers and recreational anglers. We’ll be talking about evidence and your further involvement in a blog post in the new year. "
        },
        {
            "text": "We have now established the implementation groups for crab and lobster, whelk, scallop, as well as the new Bass Management Group. "
        },
        {
            "text": "Finally, we shared the outcome to the consultation proposing amendments to Annex A of the JFS.  "
        },
        {
            "text": "It’s been an ambitious year with many milestones reached. There is a lot more progress to make as we move into 2025.  "
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "2024 has taught us so many lessons through all the stages of FMP development. "
        },
        {
            "text": "Our five open consultations will end on 19 January 2025, and we’ll analyse your responses to inform the proposals and share a Government response later in the year  "
        },
        {
            "text": "The last four plans are currently being developed, and we’ll be engaging with stakeholder, so keep an eye out for opportunities.   "
        },
        {
            "text": "We will continue to progress the implementation of the FMPs. You can continue to get involved in this process in various ways, including through management groups advisory committees, Regional Fisheries Groups, and workshops.  "
        },
        {
            "text": "Thank you for being part of this journey. Your engagement remains vital as we work together to deliver sustainable fisheries. Here’s to more progress in 2025. "
        },
        {
            "heading": 2,
            "text": "​​Get involved"
        },
        {
            "text": "​​Stay informed, share your insights, and help shape the future of sustainable fisheries. Follow our blog for updates, and don’t hesitate to get in touch with your ideas and feedback. Let’s keep the conversation going!​ "
        }
    ]
}