{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/12/23/top-10-technologies-a-cma-horizon-scanning-perspective/",
    "title": "Top 10 technologies – a CMA horizon scanning perspective",
    "authors": [
        "Lindsay Taylor"
    ],
    "categories": [
        "CMA Technology Horizon Scanning"
    ],
    "pub_date": "2024-12-23T11:33:41+00:00",
    "content": [
        {
            "text": "In today's rapidly evolving technological and digital landscape, staying ahead of emerging trends is more important than ever. Being on the front foot – so that regulators and governments can keep pace with fast-moving markets – will help ensure that consumers and businesses can benefit from the incredible innovation and growth that new and emerging technologies bring, whilst being confident they are getting high-quality products and services.  "
        },
        {
            "text": "Each year our technology horizon scanning function looks ahead to provide strategic insights into the future of technology and digital markets. In 2023 we explored 10 Trends in Digital Markets, and our 2022 scan focused on emerging technologies, which helped to identify Foundation Models as a pivotal technology and informed our Foundation Models Initial Review and AI work.  "
        },
        {
            "text": "This year we delved again into the dynamic world of emerging technologies to explore how these technologies are shaping the future over the next five years and beyond, including the potential impacts for competition and consumers. We prioritised 10 technologies to explore further and have provided, in no particular order, a brief overview of these – and our approach – below.  "
        },
        {
            "heading": 2,
            "text": "Emerging technology trends"
        },
        {
            "text": "Generative AI: crafting new content"
        },
        {
            "text": "Generative AI is a type of AI that can create novel output that is potentially indistinguishable from human-generated content. It can be found in applications such as chatbots and web-based tools that use user prompts to produce or augment written text, images, videos, audio, and code."
        },
        {
            "text": "AI Agents and Assistants: solving tasks in dynamic environments"
        },
        {
            "text": "AI agents and assistants include various types of software designed to accomplish goals on people’s behalf. On one end of the spectrum, there are AI assistants that engage in conversational interactions with users to perform simple tasks or provide information. At the other end of the spectrum, there are more sophisticated AI agents that can employ advanced AI and computer vision to operate independently from human involvement. This type of agentic AI technology may be found in autonomous vehicles, commercial drones and robots that perform complex tasks."
        },
        {
            "text": "Robotics: programming machines to act in the physical world"
        },
        {
            "text": "Robotics is a field that deals with the design, manufacturing and operation of hardware to perform complex sequences of movements. This relies on technical components such as sensors and motors to interact with the physical environment. Robots are increasingly being used in fields such as manufacturing, medicine, and defence to perform tasks that are too repetitive, too delicate or too dangerous for humans."
        },
        {
            "text": "Quantum Computing: promising unprecedented computational power"
        },
        {
            "text": "Quantum computing uses advanced physics to solve problems beyond the ability of most traditional computers. It can be used to develop complex AI models, simulations, and robust cybersecurity methods. While quantum computing is still too expensive for widespread use, it has potential to drive advances in fields like finance, biology and physical sciences in future."
        },
        {
            "text": "Machine Learning: leveraging historical data to enhance predictions and decisions"
        },
        {
            "text": "Machine learning is a field that uses statistical algorithms to learn from past data to improve the accuracy and efficiency of predictive models. It is used in a broad range of industries such as healthcare, finance, and retail to identify risks and opportunities."
        },
        {
            "text": "AI-Powered Productivity Software and Tools: maximising human efficiency"
        },
        {
            "text": "AI-powered productivity applications are designed to automate and enhance the effectiveness of people’s professional and personal activities. These technologies may be used in planning and scheduling software, virtual work assistants, and collaboration tools."
        },
        {
            "text": "Spatial computing: facilitating interaction between physical and digital realities"
        },
        {
            "text": "Spatial computing uses sensors, computer vision, and AI technologies to map real-world environments. This allows users to visualise and manipulate digital information in 3D space using interactive devices such as headsets. "
        },
        {
            "text": "Virtual Reality (VR): immersing users in computer-generated environments"
        },
        {
            "text": "VR technologies use spatial computing to immerse users in simulated environments. The field of VR includes physical devices such as headsets as well as virtual worlds that users can visit."
        },
        {
            "text": "Synthetic data generation: filling in missing information to enhance AI"
        },
        {
            "text": "Synthetic data refers to artificially generated material such as images, videos, audio, text, and numeric data. It is used alongside real data for the purposes of training, tuning, and testing AI models. "
        },
        {
            "text": "Digital identity: strengthening security, accessibility and trust in digital services"
        },
        {
            "text": "Digital identity relies on the collection of various information attributes about a person or entity. Along with authorisation technology, digital identity can be used to grant people or organisations easier access to the resources that they are entitled to use, while simultaneously protecting their assets from unauthorised access."
        },
        {
            "heading": 2,
            "text": "Competition and consumer themes "
        },
        {
            "text": "These technologies can have a transformative impact on the UK. To fully realise the opportunities that these technologies bring, it is important to consider the potential competition and consumer concerns that they raise. If industry, regulators and wider stakeholders are aware of these challenges then we can work together to provide more clarity and certainty so companies using these technologies have the confidence to innovate and contribute to UK growth. We recently set out at the Chatham House Competition Policy 2024 conference and the Financial Times Artificial Intelligence (AI) Summit how the benefits from promoting competition are profound and far-reaching – not just for lower prices, but also to create more innovation, choice, quality, security of supply, productivity, investment and growth."
        },
        {
            "text": "Several technologies in our shortlist are an important input for, or rely on, AI as a key component. With strong competition, these technologies also have the potential to drive significant innovation and growth across the UK economy, increase efficiency and reduce costs across multiple industries. They could result in beneficial new products and services, and increased choice for consumers."
        },
        {
            "text": "The deployment of these technologies also has the potential to pose harm to competition and consumers. Larger firms may be able to restrict access to essential inputs such as data and compute or reinforce dominant positions by bundling products and capabilities across multiple sectors. This could, in turn, limit consumer choice and make it harder for new firms to enter the market to compete. There could also be negative implications for consumers if they do not sufficiently understand the performance of technologies they depend on and are not empowered to take well informed decisions."
        },
        {
            "text": "In addition, several technologies in our list present other potential challenges for UK firms that stem from hardware integration requirements. For example, the cost and complexity of developing and deploying technologies such as quantum computing, spatial computing, and VR could result in established companies with greater access to resources having more control over intellectual property, talent, and standards in these fields. The hardware in these technologies also has potential to create new ways that sensitive consumer data could be compromised or leave firms or consumers open to cyber-attacks. It is important that the market develops in a way that benefits all players in the digital ecosystem – including large and small firms, and consumers."
        },
        {
            "text": "We considered some of these themes in in our initial review of AI Foundation Models and the subsequent update report, where we identified potential concerns and set out 6 key principles to help guide the AI sector towards positive outcomes for consumers, businesses, and the UK economy, and to maximise the innovation opportunities of AI."
        },
        {
            "text": "The Digital Markets, Competition and Consumers Act (DMCCA) will commence in January 2025. The Act establishes a new pro-competition regime for digital markets, which will provide the CMA the ability to respond quickly and flexibly to the rapid developments of emerging technology markets, including AI. These developments will inform our decisions to prioritise investigations and take action under the new regime, to ensure that innovation delivers opportunities and benefits for UK consumers and businesses and drives productivity and growth in the UK."
        },
        {
            "heading": 2,
            "text": "Our approach "
        },
        {
            "text": "We conducted a ‘scan of scans’ of credible existing sources on emerging technologies, alongside surveying experts across digital markets, technology, policy and competition to gather analysis on critical technologies. From this research we produced a longlist of technologies and prioritised them using criteria significant to CMA interests, such as time to market and technology hype, to create this top 10.   "
        },
        {
            "text": "Alongside our manual scan, this year we also experimented with data science approaches to complete an automated ‘scan of scans’ longlist of technologies which we could compare to our manual scan. The automated scan recalled around 85% of the technologies identified through manual scanning which suggests some potential efficiencies can be gained in the future by undertaking more focused manual scanning. We will continue to explore and exploit data science tools within our horizon scanning.   "
        },
        {
            "heading": 2,
            "text": "Implications and next steps "
        },
        {
            "text": "The technologies identified hold significant potential for driving innovation, reshaping consumer and business experiences, and contributing to UK growth by creating dynamic and competitive markets now and in the future. The CMA will continue to use horizon scanning and other strategic tools to stay abreast of fast changing developments and ensure our work reflects a deep understanding of technologies and their implications for consumers and competition."
        },
        {
            "text": "We extend our gratitude to both our external and internal experts who contributed their insights to this project. Your invaluable expertise positively shaped our analysis and understanding.  "
        }
    ]
}