{
    "url": "https://defradigital.blog.gov.uk/2024/12/23/using-hypotheses-to-improve-our-content-review-process/",
    "title": "Using hypotheses to improve our content review process",
    "authors": [
        "Lauren Stopps"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2024-12-23T12:03:12+00:00",
    "content": [
        {
            "text": "Continuing our series on Defra content community projects, content designer Lauren Stopps writes about a project to improve the content team's internal review process."
        },
        {
            "text": "Did you know, every piece of content or change published by a member of the Defra content team must be reviewed by a second content designer? They make sure the original editor hasn’t missed anything and give the final nod to publish. We call this a ‘second pair of eyes’ or ‘2i’ for short."
        },
        {
            "text": "Our community project team found the content review process lacked consistency and clarity, with no standard approach among Defra content design teams."
        },
        {
            "heading": 2,
            "text": "A better 2i process"
        },
        {
            "text": "We found the current 2i process is:"
        },
        {
            "text": "Ultimately, this affects both Defra stakeholders and our users."
        },
        {
            "heading": 2,
            "text": "How we approached the problem"
        },
        {
            "text": "As content designers we regularly set and test hypotheses to make improvements."
        },
        {
            "text": "Hypotheses help us explore different ways to solve a problem. They include:"
        },
        {
            "text": "They should also be based on data and evidence."
        },
        {
            "heading": 2,
            "text": "Creating hypotheses"
        },
        {
            "text": "Hypotheses can be based on outcomes for users or changes to key performance indicators. They help us make sure the changes we make have the effect we wanted."
        },
        {
            "text": "We based ours on solving the problems we’d identified with the current 2i process. For example, through surveys and focus groups we found:"
        },
        {
            "text": "As a project group we used these results to create our hypotheses. These address bottlenecks and pain points in the current 2i process."
        },
        {
            "text": "We used the formula:"
        },
        {
            "text": "We believe … will …We’ll know this is true when …We believe this will ultimately help improve …"
        },
        {
            "text": "Essentially, our hypotheses were based on potential solutions to user pain points."
        },
        {
            "heading": 2,
            "text": "An ‘internal review’ rota"
        },
        {
            "text": "Our initial hypothesis said:"
        },
        {
            "text": "We believe a rota will ensure balanced workloads and reduce workload-related blockers for the 2i’er and the requester."
        },
        {
            "text": "We’ll know this is true when there’s a reduced timeframe between a 2i request being submitted and it being actioned."
        },
        {
            "text": "We believe this will ultimately help improve the overall amount of time it takes to 2i."
        },
        {
            "heading": 2,
            "text": "A ticketing system"
        },
        {
            "text": "Our second hypothesis said:"
        },
        {
            "text": "We believe a ticketing system with templates for requests will ensure the requester knows exactly what information is needed by the 2i’er and why."
        },
        {
            "text": "We’ll know this is true when there is a drop in requests for missing or additional information and the reviewer knows what level of review is needed."
        },
        {
            "text": "We believe this will ultimately help improve the overall amount of time it takes to 2i, make 2i’ing easier, and improve the quality of 2i’s."
        },
        {
            "heading": 2,
            "text": "Training and guidance"
        },
        {
            "text": "Our third hypothesis said:"
        },
        {
            "text": "We believe training and guidance on the end-to-end process of 2i’ing will standardise the 2i process and improve confidence and understanding for the 2i’er and requester."
        },
        {
            "text": "We’ll know this is true when pulse checks after the training result in a reduction on mistakes missed in 2i’s."
        },
        {
            "text": "We believe this will ultimately help improve the length of time to 2i and quality of 2i’s as well as democratisation of the 2i process."
        },
        {
            "heading": 2,
            "text": "Reduce jargon"
        },
        {
            "text": "Our final hypothesis said:"
        },
        {
            "text": "We believe a clear and plainer describing process will make communication easier for stakeholders and new starters."
        },
        {
            "text": "We’ll know this is true when there is a reduction in errors being missed in 2i’s and increased engagement with crits and peer reviews."
        },
        {
            "text": "We believe this will ultimately help improve the quality of published content and understanding of the process."
        },
        {
            "heading": 2,
            "text": "Next up"
        },
        {
            "text": "We’ll check our hypotheses with the wider content team. After gathering their feedback, we can test the hypotheses and analyse the data to understand the effect of the proposed solutions. Did we get it right? We’ll blog again when the results are in."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}