{
    "url": "https://lifeathmrc.blog.gov.uk/2023/07/17/care-leavers-internship-scheme-candices-story/",
    "title": "Care Leavers Internship Scheme: Candice's Story",
    "authors": [
        "Candice"
    ],
    "categories": [
        "Diversity and inclusion",
        "General"
    ],
    "pub_date": "2023-07-17T15:04:03+00:00",
    "content": [
        {
            "text": "The Civil Service Care Leavers Internship Scheme gives care leavers the chance to benefit from a 12-month paid internship in a central Government department or agency, with the possibility of the post being made permanent at the end of the 12 months. We caught up with Candice who shares her experience of this scheme."
        },
        {
            "heading": 2,
            "text": "My story"
        },
        {
            "text": "At the start of 2020 I was working as a chef at TGI Fridays, but due to COVID-19, I lost my job. It was a tough time and, having been unemployed for over a year, I was feeling the strain. It was then that I heard back about my application for the care scheme, I’d been accepted! It had such a positive impact on my life, it made me feel like something good was happening. And ever since joining HMRC – it’s been amazing."
        },
        {
            "text": "I started the scheme in March 2021. I settled in to HMRC quickly and had a wonderful team and manager to help me. I did my training and, for the first year, I worked from home which I felt very nervous about. I managed to settle in well and achieve more than I thought I would. When I was only 7 months into my internship, I was given a new role of coaching and mentoring new starters. I was then nominated to represent HMRC in London at a meeting with Will Quince, the Minister for Children and Families at the time. These additional responsibilities boosted my confidence in my own abilities."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Following the internship scheme, I was given a permanent position at HMRC checking PAYE and VAT returns, and it’s now been 2 years since I joined. I’m still really enjoying my coaching role and helping new starters settle into the department. This has been my longest and most favourite job. This is a great opportunity for care leavers to start work and it can open many doors. I’ve achieved more than I ever thought I could. It just goes to show that it doesn’t matter where you come from or how you got there – if you prove to yourself you can do it, you are capable of anything. The people here are amazing to work with and so supportive. I’m very grateful that I was given this opportunity. I’m currently applying for a promotion so anything is possible."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Visit the HMRC Careers Site to find out more about working for HMRC."
        }
    ]
}