{
    "url": "https://defrafarming.blog.gov.uk/2023/07/17/countryside-stewardship-higher-tier-agreements-to-start-in-2024/",
    "title": "Countryside Stewardship: Higher Tier agreements to start in 2024",
    "authors": [
        "John Place"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2023-07-17T09:41:07+01:00",
    "content": [
        {
            "text": "The window for applications for Countryside Stewardship Higher Tier closed on 28 April 2023. "
        },
        {
            "text": "Mid Tier and Wildlife Offer agreements are still open for applications until 18 August 2023. A number of 3-year capital grants are also open to help achieve specific environmental benefits, including a new Higher Tier Capital grant, woodland tree heath grants and Woodland Management Plans."
        },
        {
            "text": "In this post, we’ll set out the process for assessing applications and provide an update on the number of applications being taken forward.  "
        },
        {
            "heading": 2,
            "text": "What is the Higher Tier of Countryside Stewardship?"
        },
        {
            "text": "CS Higher Tier grants are offered for multi-year management options and capital items for the most environmentally important sites. These include commons and woodlands. They are usually in places that need complex management. For example, creating or restoring habitats and improving woodland. "
        },
        {
            "heading": 2,
            "text": "How do we assess applications?"
        },
        {
            "text": "Applications for a Higher Tier agreement, received by the Rural Payments Agency (RPA), are competitive and the highest quality applications are taken forward. A Natural England or Forestry Commission adviser will then offer support to help a farmer or land manager develop a final application. "
        },
        {
            "text": "When applying for a CS Higher Tier agreement on woodland, you need to have a Forestry Commission approved Woodland Management Plan covering all the woodland in your agreement."
        },
        {
            "heading": 2,
            "text": "How many applications did we receive this year?"
        },
        {
            "heading": 3,
            "text": "Agri-environment and mixed applications"
        },
        {
            "text": "We received 758 applications, which is 268 more than last year.  "
        },
        {
            "text": "We are taking forward 74% (560) of these applications to the next stage.  Last year, 420 new Higher Tier agreements started on 1 January 2024."
        },
        {
            "text": "We hope this could bring over 35,000 hectares of Sites of Special Scientific Interest (SSSI) land into favourable management.  Important habitats like lowland and upland heath, grazing marsh and chalk grassland will be managed and protected and habitats restored and created to help support recovery of threatened species like curlews, woodlarks, nightjars, corn buntings and fritillary butterflies."
        },
        {
            "text": "For those that were not accepted we will be contacting applicants to provide them with further advice, including asking them to consider applying for the Mid Tier offer. Alternatively it would be worth considering if there may be grants for capital works which would support specific habitat creation or restoration undertaken over the next year that will help prepare for entry into the scheme.  "
        },
        {
            "text": "Management of species rich or wet grassland, traditional orchards and wood pasture and parkland options are already available in Mid Tier and some SSSIs can be managed through a Mid Tier agreement."
        },
        {
            "text": "We recognise that some farmers and land managers will be disappointed and we urge them to contact Natural England further to discuss the possibilities available to them either in future years, or to consider what the Mid Tier and the Sustainable Farming Incentive has to offer."
        },
        {
            "heading": 3,
            "text": "Woodland management applications"
        },
        {
            "text": "We received 491 applications which is 160 more than last year."
        },
        {
            "text": "We are taking forward 435 woodland only applications. Applicants that have not been successful did not meet the scheme requirement e.g., having a woodland management plan approved. "
        },
        {
            "text": "We hope this could bring around 49,000 hectares of woodlands under management, including supporting the restoration and maintenance of planted ancient woodland sites and greater access to woodland sites for the general public. Any applicants that were not successful will be contacted by the RPA explaining why their application was not successful. "
        },
        {
            "heading": 2,
            "text": "Evolving our Higher Tier offer"
        },
        {
            "text": "We will be evolving our Higher Tier offer further to enable more farmers and land managers to be paid to carry out ambitious actions on their land to help deliver greater levels of environmental outcomes, including on our most environmentally important sites. We are planning to introduce a wider range of options to help support delivery of our Environmental Improvement Plan, as well as broadening the eligibility of some existing options. Across our land management offers, we are looking at ways to support local join-up, spatial targeting, and rewarding outstanding results. "
        },
        {
            "text": "We are also looking at how we support farmers and land managers to apply and ensure the right level of local advice and support can be provided. "
        },
        {
            "text": "We know more farmers and land managers are thinking about what else they can do to help manage, protect and create important habitats and species.  We already encourage and support applications for smaller areas and habitats through Higher Tier and the Mid Tier of the scheme and in the future want to see more applications of this type and size and help support farmers and land managers to apply for the right agreement for them. Additionally, we have set out a number of new options we were developing as part of our Environmental Land Management scheme update."
        },
        {
            "text": "We also know some farmers want to look at moving from their existing Higher Level Stewardship agreement into Countryside Stewardship. We’ve provided some more detailed guidance on this to help farmers to think about equivalent options available to them under the Countryside Stewardship scheme."
        },
        {
            "text": "If you have any questions for the team, please leave a comment below."
        }
    ]
}