{
    "url": "https://educationhub.blog.gov.uk/2023/07/17/how-were-improving-the-quality-of-degrees/",
    "title": "How we’re improving the quality of degrees",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education"
    ],
    "pub_date": "2023-07-17T17:06:25+01:00",
    "content": [
        {
            "text": "It’s crucial that university courses give students the skills they need to enter the world of work. Our universities are world-leading and the majority of degrees help to prepare young people for the future."
        },
        {
            "text": "However, we know there are some courses which aren’t up to scratch and are ripping students off."
        },
        {
            "text": "To make sure that students get value for money and the brilliant university experience they deserve, we’re cracking down on poor quality degrees that don’t deliver for students."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What are you doing to make sure degrees are the best they can be?"
        },
        {
            "text": "We’re asking the Office for Students (OfS), the independent regulator of higher education in England, to limit the number of students on courses that are delivering poor outcomes."
        },
        {
            "text": "This could be courses where too many students are dropping out or are not progressing into good jobs."
        },
        {
            "text": "We’ll drive up the quality of higher education by reducing the number of students who can be recruited to low quality degrees. In turn, more people across the country will have the tools to secure skilled jobs with higher wages."
        },
        {
            "text": "This will also make the system fairer for taxpayers, because it’s taxpayers that fund the system. Clamping down on low-quality courses will improve the overall financial sustainability of the system."
        },
        {
            "heading": 3,
            "text": "What have you announced about foundation years?"
        },
        {
            "text": "Foundation years can be essential to help students prepare for courses with specific entry requirements or knowledge, such as medicine and veterinary sciences. But too many students are getting a bad deal by being encouraged to do an unnecessary foundation year before their degree."
        },
        {
            "text": "To give students a fairer deal, we are reducing the maximum fees and student loans for all classroom-based foundation year courses to £5,760, down from £9,250."
        },
        {
            "heading": 3,
            "text": "How do you define what a “good outcome” is, or whether a course is good value for money? "
        },
        {
            "text": "The OfS already measures the quality of degrees by looking at factors such as the number of students who complete their course and the number who progress into good jobs."
        },
        {
            "text": "Because we believe students’ investment in their education should improve their career prospects, we’re also asking the OfS to consider how graduate earnings could be included in the assessment of higher education performance."
        },
        {
            "text": "We know that not all high-quality qualifications necessarily lead to high salaries. We’ll work with universities to consider exactly how earnings should be measured, while the OfS will continue to consider other outcomes alongside salaries."
        },
        {
            "text": "Things like what kind of jobs students go on to do, whether they complete the course, and how much they earn in later life are all important measures of the quality of degrees."
        },
        {
            "heading": 3,
            "text": "Will this disproportionately impact arts subjects?"
        },
        {
            "text": "High quality degrees in the arts are essential to boosting our thriving creative industries. No specific subject will be penalised under these reforms, and all subject areas will be treated the same."
        },
        {
            "text": "If a course leads to good outcomes, it won’t be affected. These measures will make sure we are tackling individual courses that don’t help students, regardless of background, to make choices that give them the best start in life."
        },
        {
            "text": "For foundation years, the new lower fee cap of £5,760 will only apply to foundation years in subjects that are fully classroom-based, such as humanities, business, and social sciences. Foundation years in subjects with a studio element – including many creative arts subjects - will continue to be able to charge fees of up to £9,250."
        },
        {
            "heading": 3,
            "text": "Will this stop people from disadvantaged backgrounds going to university?"
        },
        {
            "text": "Nobody should end up paying for a degree that doesn’t improve their career prospects and all students deserve high quality degrees that lead to great outcomes."
        },
        {
            "text": "Disadvantaged students should be confident that investing in higher education will equip them to begin good careers in skilled jobs."
        },
        {
            "heading": 3,
            "text": "Is university the right choice for me?"
        },
        {
            "text": "This country has some of the best universities in the world and most offer great courses which provide an enriching education, and prepare their students for the workplace."
        },
        {
            "text": "However, there are many different routes into a successful career, from apprenticeships, including those at degree level, T Levels, Higher Technical Qualifications and Skills Bootcamps."
        },
        {
            "text": "Whatever path you take, you should be confident that it’s the right one for you. If you’d like to get some free, impartial advice on possible options, you can get in touch with The National Careers Service by phone, webchat or in person."
        },
        {
            "text": "The Get the Jump homepage also explains the different pathways you could explore, beyond university."
        }
    ]
}