{
    "url": "https://educationinspection.blog.gov.uk/2023/07/17/insights-from-the-inspection-of-initial-teacher-education-ite-providers/",
    "title": "Insights from the inspection of initial teacher education (ITE) providers",
    "authors": [
        "Helen Matthews, Senior HMI for Teacher Development"
    ],
    "categories": [
        "initial teacher education",
        "ITE",
        "professional development",
        "teacher training"
    ],
    "pub_date": "2023-07-17T13:00:05+01:00",
    "content": [
        {
            "text": "Initial teacher education (ITE), together with the early career framework and national professional qualifications form the ‘golden thread’ of teacher training and professional development. The aim is to develop high-quality teachers and leaders, which is vital for giving pupils the very best education. Our ITE inspections give an independent, external evaluation of a provider’s effectiveness and, where appropriate, highlight areas for improvement. We do this by assessing a range of evidence on inspection against the judgement criteria set out in our ITE framework and handbook."
        },
        {
            "text": "We inspect all providers of teacher training that leads to early years teacher status or qualified teacher status. We also inspect ‘known’ providers of publicly funded further education and skills (FE and skills) ITE (see our blog to find out more about ‘known’ FE and skills ITE providers)."
        },
        {
            "text": "By August 2024, all registered ITE providers will have been inspected under the current ITE framework and handbook. This framework was introduced in September 2020 and intentionally raised the bar for ITE providers. Although the proportion of providers who received a judgement of good or outstanding has fallen from 100% in August 2020, to 94% in April 2023, we have seen many common strengths in those inspected so far."
        },
        {
            "text": "Good practice"
        },
        {
            "text": "In the providers we inspected, we typically found high-quality curriculums which are ambitious and well-sequenced. They consider the expert knowledge, skills and professional behaviours needed by teachers at each phase and subject-level. In the best examples, providers consider the starting point and end-goals of their trainees within their curriculum design. In the early years, primary and secondary phases, the Core Content Framework is comprehensively taught and learnt."
        },
        {
            "text": "Strong providers encourage their trainees to explore and reflect on pertinent research. This allows trainees to apply different learning theories to their teaching and critique what works well and what does not."
        },
        {
            "text": "Additionally, we have seen rigorous quality assurance processes across different types and sizes of providers. The best examples use a range of quality assurance and improvement processes which are proportionate, purposeful, and bespoke. For example, processes that align with trainees’ experience and use trainee feedback to identify what is working well and what could be improved to inform future curriculum design."
        },
        {
            "text": "In early years and primary ITE we have seen providers develop their trainees well to teach early reading, including systematic synthetic phonics. We have also seen trainees on secondary ITE routes prepared to support weaker readers, no matter what subject they are training to teach. An increasing number of providers are considering how best to prepare trainees to meet the needs of learners with special educational needs and disabilities (SEND). For example, explicitly teaching a variety of strategies for adapting teaching to meet the needs of all pupils. Or seeking out special schools or placements at schools with high numbers of pupils with SEND, to allow trainees to see effective planning and teaching in practice. This has also been identified as a strength in early career framework inspections."
        },
        {
            "text": "Areas for improvement"
        },
        {
            "text": "The areas in which some providers do well have also been identified as areas for improvement in the small number of providers who received a less than good judgement. Areas for improvement include:"
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "Overall, through our ITE inspections we have been able to identify and celebrate a wealth of good practice. As we enter the final year of this inspection cycle, we will continue reflecting on ITE inspections and engaging with providers to share our insights. We will also share insights with the Department for Education so that they can be considered in their updates to the early career framework and core content framework."
        }
    ]
}