{
    "url": "https://insidehmcts.blog.gov.uk/2023/07/17/people-progress-and-purpose-in-the-criminal-courts/",
    "title": "People, progress and purpose in the criminal courts",
    "authors": [
        "Nick Goodwin - Chief Executive, HMCTS"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2023-07-17T11:00:52+01:00",
    "content": [
        {
            "text": "Last year, with thanks to HMCTS colleagues, judges and justice partners,  we sat over 100,000 days in the Crown Court and in March 2023 we sat the most days in a single month (10,033) since July 2015. Our internal management information (MI) shows that productivity - sitting days per working days - increased in the second half of the last financial year, to average rates not seen since 2015/16, with November 2022 (443) the highest since November 2016. These are incredible achievements – particularly when you consider the operational volatility of the last 12 months – and I’m very grateful to everyone who has contributed to it. "
        },
        {
            "text": "Sitting days are one way of quantifying the level of activity carried out in the Crown Court, and they are used by the Ministry of Justice to allocate resources to HMCTS. To sit in court, HMCTS must co-ordinate the resources required – court and administrative staff, buildings, judges – and the availability of parties, their representatives, and justice partners to meet the demands of the outstanding caseload, all under the listing direction of resident judges. We have deployed all of the resources available to us, and the volume of days we sat in 2022-23 is testimony to that. "
        },
        {
            "text": "However, there’s no disputing that what we must continue to do in our criminal courts remains very challenging. The impacts of a worldwide pandemic were significant and enduring for HMCTS – as they have been for everyone – both personally and professionally. Add to this the other operational issues in the criminal justice system, and it has undoubtedly been an unrelentingly difficult time for everyone working within Crown and magistrates’ courts. "
        },
        {
            "text": "But there is also no disputing that during that time we’ve achieved a lot, learnt a lot, and adapted quickly. We successfully overcame some of the enormous and unexpected challenges brought by the global health crisis at a time when other comparable systems closed around the world and used our learning to overcome some of the operational challenges which have presented themselves since.  "
        },
        {
            "text": "These achievements are all down to the hard work, focus and collaboration of all those working in the criminal justice system, especially staff, judges and legal professionals.  And it’s these very same people who continue to make every effort to maintain the steady, but sure, progress we are now seeing. "
        },
        {
            "heading": 2,
            "text": "Challenges ahead, but hard-won headway made "
        },
        {
            "text": "Continuing our performance improvement remains challenging. But it’s important that we also take the time to recognise what’s been delivered by our people and partners over the past 12 months. "
        },
        {
            "text": "The number of trials listed and disposed of is higher than we have seen for several years. The rate of effective versus ineffective trials continues to improve. And we have surpassed sitting day expectations. That said, progress takes time, and each region faces its own unique challenges, meaning that the pace of recovery and operational performance inevitably varies. I take great heart in seeing our regions heading in the right direction.  "
        },
        {
            "text": "More importantly, it is a mark of the purpose, drive and determination shown by all those who work in the criminal courts, and testimony to their collective efforts. I therefore want to thank every member of HMCTS and our partners working in the criminal courts for your innovation, dedication and sheer effort to get us to this point. You keep striving to ‘do the right thing’ by those who find themselves involved in the criminal justice system, especially victims and witnesses, and every day I find another reason to be grateful for the efforts you are making. "
        },
        {
            "heading": 2,
            "text": "Overcoming the challenges together "
        },
        {
            "text": "So how will we build on this to keep pushing forward performance improvement across the criminal courts? Well, certainly not alone. All progress made is a result of partnership with others in the system – including legal practitioners, the CPS, the police, prisons, probation and prisoner escort custodial services. "
        },
        {
            "text": "And these partnerships are crucial, not just at a national level, but at a regional and local level too. I was delighted to recently speak at the Local Criminal Justice Board conference, for example, and touched on the important ways in which HMCTS partners with others to discuss system-wide issues, raise concerns, resolve local problems and collaborate on solutions. Operational independence must always be respected, of course, but working in silos will never be sensible or indeed have the greatest positive impact. "
        },
        {
            "text": "We’ll continue to rely heavily on these partnerships to underpin recovery in the year ahead. "
        },
        {
            "heading": 2,
            "text": "Focused on purpose "
        },
        {
            "text": "In June, I spoke at the Modernising Criminal Justice conference in London. I relished the opportunity to engage with a range of people working in the justice system about crime recovery – listening, learning and engaging to improve the service we provide. "
        },
        {
            "text": "Throughout all the current challenges and those we’ll contend with in the future, I’ll never lose focus of why we work so extraordinarily hard together. It’s because it allows us to improve the experience of each and every person – each victim, witness, or defendant – who finds themselves immersed in the criminal justice system, usually at an immensely difficult time in their lives. And that really is the most important point, isn’t it? "
        }
    ]
}