{
    "url": "https://environmentagency.blog.gov.uk/2023/07/17/the-fens-preserving-the-breadbasket-of-britain/",
    "title": "The Fens – preserving the ‘breadbasket of Britain’",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-17T10:46:32+00:00",
    "content": [
        {
            "text": "The Fens and Coastal lowlands, located across parts of Norfolk, Cambridgeshire, Lincolnshire, and Northamptonshire is 5000km2 hectares of historically swamp, marsh and wetland."
        },
        {
            "text": "It is an entirely unnatural landscape and we can only live and work here because of the way it is managed by the Environment Agency and Internal drainage boards (IDB’s). As the Fens and coastal lowlands are very low lying, continuous ‘flood risk management’ is required. The careful management reduces the risk to the local area, including 370,000ha of agricultural land, 400,000 people and 500km of road and rail infrastructure."
        },
        {
            "text": "The Fens hold significant agricultural importance as its home to over 50% of England’s grade 1 agricultural land providing a fifth of the nation’s crops and a third of its vegetables. Often referred to as the “breadbasket of Britain”, this industry employs 80,000 people in the agricultural food chain."
        },
        {
            "text": "What else makes the Fens unique?"
        },
        {
            "text": "The Environment Agency’s flood management work across the Fens is essential to keep several industries moving and to allow thousands of people live there. Also, as 2023 marks 70 years since the 1953 Flood it is timely that we look to the next 70 years and beyond to establish plans to ensure a vibrant and climate resilient future."
        },
        {
            "text": "With this in mind, we’re launching Fens 2100+. This is a new programme of work to enable the Fens to adapt to the challenges of climate change both now and into the future. This work will look at the ‘adaptive approach’ needed to manage this catchment to balance the needs of people, the environment and agriculture for the next 100 years. An adaptive approach takes a flexible approach to investment which can adapt to changes when they occur, such as, new areas of growth or changes to climate change predictions. It will involve developing investment plans which confirm what flood and coastal risk management investment will be required over the next 20 years across the Fens."
        },
        {
            "text": "Fens 2100+ has been designed with the aim of directly influencing national capital delivery. This means that the investment plans developed through Fens 2100+ will inform future Environment Agency’s capital programmes from 2027. This strategy for investment across the Fens will inform funding, future efficiencies and partnerships and support the delivery of projects that aim to reduce the risk of flooding from rivers, sea, groundwater or surface water and/or to reduce the risks from coastal erosion."
        },
        {
            "text": "Find out more about the Fens2100+ project here: Future Fens - Flood Risk Management - Association of Drainage Authorities (ada.org.uk)"
        },
        {
            "text": "For further information please contact the Fens 2100+ team via: Fens2100@environment-agency.gov.uk"
        }
    ]
}