{
    "url": "https://space.blog.gov.uk/2023/07/17/uk-space-agency-team-lands-at-2023-royal-international-air-tattoo/",
    "title": "UK Space Agency team lands at 2023 Royal International Air Tattoo",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Careers",
        "Championing Space",
        "Education",
        "Events"
    ],
    "pub_date": "2023-07-17T11:34:15+01:00",
    "content": [
        {
            "text": "A team from the UK Space Agency has been inspiring young people about the wonders of space at this year’s Royal International Air Tattoo in Gloucestershire.  "
        },
        {
            "text": "The Agency hosted a stand that offered people the chance to take part in interactive activities, get up close to meteorites, try on an astronaut suit and learn all about the opportunities in the growing UK space sector, which already employs nearly 49,000 people and generates £17.5 billion for the economy. "
        },
        {
            "text": "The stand, in partnership with the Ministry of Defence’s Space Command and the National Space Centre, was part of the show’s Techno Zone, where STEM subjects were brought to life with cutting-edge exhibits and hands-on activities to engage and inspire young minds.  "
        },
        {
            "text": "British ESA astronaut Tim Peake also took to the stage in the Techno Zone for a talk to inspire the next generation of space enthusiasts.   "
        },
        {
            "text": "Dr Meganne Christian, Reserve Astronaut and Exploration Commercialisation Lead for the UK Space Agency, said:  "
        },
        {
            "text": "The UK Space Agency recently launched its Space to Learn programme to boost initiatives dedicated to inspiring young people about space and improve access to STEM careers and learning opportunities all over the country. "
        },
        {
            "text": "The Space to Learn programme will see £4.3 million funding for four major educational projects.  "
        },
        {
            "text": "These include the National Space Academy’s series of 1,000 specialised masterclasses, engaging more than 40,000 students with science career opportunities; the Jon Egging Trust’s Blue Skies initiative delivering 28,000 hours of space-related education resources to students, and the Association for Science and Discovery Centre’s Our World From Space programme, launching this summer across 22 science centres and museums to help schoolchildren and families discover the relevance of UK space science for the future health and sustainability of our home planet. "
        },
        {
            "text": "The funding will also help the European Space Education and Resource Office run its Space Inspirations scheme, which sees regional volunteers from the space sector work with more than one million children across the UK, creating learning experiences that help young people to engage with the space sector in a way that they can really connect with. "
        }
    ]
}