{
    "url": "https://teaching.blog.gov.uk/2023/07/17/we-prioritise-understanding-our-pupils-key-barriers-to-learning-and-it-makes-a-big-difference/",
    "title": "Pupil Premium Strategy: We prioritise understanding our pupils’ key barriers to learning",
    "authors": [
        "Debi Bailey",
        "Sarah Stock",
        "Steve Gittins"
    ],
    "categories": [
        "Teachers' reflections"
    ],
    "pub_date": "2023-07-17T14:30:08+01:00",
    "content": [
        {
            "text": "In this blog, staff from NEAT Academy Trust explain how they have mastered identifying complex needs of disadvantaged pupils and the resources needed to support the development of their strategy."
        },
        {
            "text": "This blog has been written by 3 authors who all work for NEAT Academy - there is further background information about each of them at the end."
        },
        {
            "text": "Our tried and tested strategy"
        },
        {
            "text": "Understanding pupils, their families and their key barriers to learning is at the heart of our strategy to support disadvantaged pupils. It helps us help them to overcome challenges and difficulties, making the best use of our pupil premium funding."
        },
        {
            "text": "Our whole Trust strategy involves using a diagnostic tool which applies a range of criteria to identify pupils who are likely to need additional support. Criteria align to key areas of vulnerability, including socio-economic disadvantage, SEND, attendance, behaviour for learning, progress, mental and physical health."
        },
        {
            "text": "We then work to support all staff in recognising the level of needs within a particular criterion. This tool has enabled our schools to consistently identify barriers for all pupils and have a consistent language around both the barriers and the significance of the barrier."
        },
        {
            "text": "Developing a shared understanding around the barriers has enabled us to map the interventions, resources and assets that can be accessed by teachers and school leaders to have a positive impact. This has enabled a consistent and collaborative approach to developing shared resources across the Trust. For example, part of our pupil premium funding has provided counsellors to support disadvantaged young people who may be experiencing a barrier around mental health."
        },
        {
            "text": "The mapping of interventions and support has been informed by the EEF Teaching and Learning Toolkit and EEF guidance reports, ensuring they have impact."
        },
        {
            "text": "High quality teaching"
        },
        {
            "text": "Our universal offer is underpinned by a focus on quality first teaching: this is where the majority of our pupil premium funding is directed in line with the EEF’s tiered approach model. At the Trust, we have developed a shared set of principles to define quality first teaching informed by a range of evidence."
        },
        {
            "text": "We map out a professional development programme, ensuring there is a balanced approach as informed by the four groups of mechanisms  - building knowledge, motivating staffing, teaching techniques, and embedding practice - outlined in the EEF’s professional development guidance report."
        },
        {
            "text": "One key focus area of ours has been around implementing the EEF’s metacognition and self-regulated learning guidance report with a gradual release of responsibility. This seven-step model supports the move from explicit teacher modelling to guided practice, developing fluency and confidence and then into independent practice."
        },
        {
            "text": "Targeted Interventions"
        },
        {
            "text": "The second element of the tiered approach is a consideration of targeted intervention. Again, using a consistent approach to identifying barriers and level of need, our schools are able to identify appropriate interventions. For disadvantaged pupils whose learning progress is a concern we have implemented access to tutoring which has included small group, peer and 1:1 support."
        },
        {
            "text": "Wider school strategies"
        },
        {
            "text": "The third element of the tiered approach is around wider school strategies. At the heart of our intervention approach lies the identification of barriers:  these can often be external factors which are impacting on the pupil’s ability to engage successfully with learning within school."
        },
        {
            "text": "An example of this is identifying families that may have complex needs. Our Trust has created vulnerable learner leads who work with vulnerable pupils in a holistic way with school, family and wider professionals and often facilitate a complex package of support."
        },
        {
            "text": "Having a robust and consistent approach to identifying barriers and level of need ensures that any child who meets a threshold is ensured of access to appropriate intervention and support. Furthermore, leaders are able to review the impact of interventions by regularly reviewing levels of need."
        },
        {
            "text": "To make effective use of resource, we believe a deep and holistic knowledge of both the pupil and whole family is key to accurately identifying barriers and making evidence informed decisions around appropriate support and intervention."
        },
        {
            "text": "Authors background: "
        },
        {
            "text": "Debi Bailey is CEO of NEAT Academy Trust in the North East of England and has over 25 years of teaching experience including being head of a large inner city primary school, an Ofsted Inspector and Literacy Consultant."
        },
        {
            "text": "Steve Gittins has been teaching since 1993 and a Head Teacher since 2008.  "
        },
        {
            "text": "Sarah Stock is a primary school improvement lead across NEAT and is currently Director of Newcastle Research School. "
        },
        {
            "text": "NEAT Academy Trust comprises six schools across the North East of England: four primary and two secondary schools. Currently, there are 3226 pupils on roll with 59% of pupils receiving pupil premium."
        },
        {
            "text": "Further reading:"
        },
        {
            "text": "Pupil premium: overview - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Pupil premium: allocations and conditions of grant 2023-24 - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Using pupil premium: guidance for school leaders (publishing.service.gov.uk)"
        },
        {
            "text": "Guidance reports | EEF (educationendowmentfoundation.org.uk)"
        },
        {
            "text": "Teaching and Learning Toolkit | EEF (educationendowmentfoundation.org.uk)"
        }
    ]
}