{
    "url": "https://thebluebeltprogramme.blog.gov.uk/beyond-the-reef-caribbean-expedition-spotlight-on-the-cayman-islands-part-2/",
    "title": "Beyond the Reef Caribbean Expedition: Spotlight on The Cayman Islands - Part 2",
    "authors": [
        "mosscatriona"
    ],
    "categories": [
        "10 years",
        "Cayman Islands",
        "Climate",
        "Nature",
        "People",
        "Uncategorized"
    ],
    "pub_date": "2026-02-15T23:30:23+00:00",
    "content": [
        {
            "text": "In February 2026, researchers from the Cayman Island’s Department of Environment will join the Blue Belt Programme’s ‘Beyond the Reef’ expedition to the Caribbean."
        },
        {
            "text": "In Part 1 of this blog series we learnt about what makes the Cayman Islands’ marine habitats so distinctive, the challenges they face, and the innovative steps being taken to protect them."
        },
        {
            "text": "In Part 2 of this Q&A, we dive beneath the surface with Kelly Forsythe, Blue Belt Programme Officer for the Cayman islands’ Department of Environment, to learn more about the crew, and how the data generated will be used to support marine management in the future. "
        },
        {
            "text": "The Blue Belt Programme is excited to come to the Cayman Islands for the Beyond the Reef Caribbean expedition. What are your key aims for the survey, and how will it support the Government's marine conservation objectives?"
        },
        {
            "text": "This will be the first of its kind for the Cayman Islands – I know that myself, the crew and the Department are excited to be a part of it! We hope to gather a whole range of data to improve our understanding of our offshore and deep sea marine environment and directly feed into improved management of resources, species conservation plans and provide adequate justification for any future MPAs or Other Effective area-based Conservation Measures (OECMs). Areas we will look at include:"
        },
        {
            "text": "What is your role/s on board, and how will the team be supporting the survey's mission?"
        },
        {
            "text": "As the Blue Belt Programme Officer and Cayman Islands crew lead, I’ll be taking part in all areas of research onboard, establishing relationships with the wider Blue Belt Programme team and the other UKOT scientists and managers for lesson learning and collaboration. Joining me onboard for the Cayman leg are seven other members of the Cayman Islands Department of Environment. Check out the video to learn more about our interests and specialisms."
        },
        {
            "text": "The ecological research that we’re collecting on deep sea snapper, seabirds and Nassau grouper larvae for example will be used as evidence to bolster the protection and management of these species’ key habitats, breeding and feeding grounds. Identifying these important habitats means that they can be included in future protections going forward."
        },
        {
            "text": "What are you most looking forward to discovering or learning during this voyage?"
        },
        {
            "text": "It’ll be great to be back at sea again and I’m very much looking forward to that!"
        },
        {
            "text": "Equally – I’m excited to discover the different species of deep-sea snapper we have, what kind of habitats they prefer, how deep they can be found and any differences in composition and presence with depth. It’ll also be great to be able to engage and create relationships with the other UKOT representatives and local scientists from Anguilla and Turks and Caicos to help foster collaboration."
        },
        {
            "text": "How have you been engaging the public about the survey on island, and how can people get involved or follow your progress?"
        },
        {
            "text": "We started with an education campaign and the launch of the Research Expedition T-shirt design competition with the theme “Beloved Isle Cayman” in August. During the campaign over 600 students were reached and a total of 32 designs submitted. We have since confirmed three winning designs and are excited to feature the t-shirt onboard in the new year!"
        },
        {
            "text": "In addition to the t-shirt, we’re working in close collaboration with the Blue Belt comms team to launch the first ever Deep Sea Discovery education pack for the Cayman Islands which we hope to provide a sneak peak of before we embark!"
        },
        {
            "text": "The crew’s time onboard will be punctuated with short videos that will be shared via the Blue Belt Programme and Department of Environment YouTube channels so you’ll be able to see what we’ve been discovering and getting up to. Last but definitely not least, we’re inviting the Cayman community to celebrate the return of our scientists and hear all about what we found on our return on the evening of Wednesday 25th February, 2026 – so watch the Department of Environment socials for further information on what to expect!"
        },
        {
            "text": "Once you're back on dry land, what are the next steps for using this research to benefit the Cayman Islands' marine environment?"
        },
        {
            "text": "This past year we’ve been learning all about Other Effective Area-based Conservation Measures (OECMs). Although not legally protected, OECMs can complement our existing protected area network, provide tangible benefits for biodiversity and people, and contribute to progress towards the global target of 30% marine environments protected by 2030."
        },
        {
            "text": "To designate OECMs effectively, a starting point is to gather baseline data on local habitats and species. With the research on seabirds, we hope to incorporate their observed location and behaviours into the upcoming species conservation plan as well as the OECM. This is also the first time we are collecting data on our deep sea snapper species, which will help us make informed decisions on the future sustainable management of the fisheries. For nutrients and pollutants, this will feed directly into the future water quality strategy planning. This expedition will provide a unique opportunity for us to collect vital baseline data from the Cayman Islands vast and difficult to access offshore areas."
        }
    ]
}