{
    "url": "https://insidehmcts.blog.gov.uk/2024/12/20/12-months-of-justice-the-hmcts-2024-review/",
    "title": "12 Months of Justice: The HMCTS 2024 Review",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Crime",
        "Digital services",
        "Family",
        "Interviews",
        "Podcast",
        "Tribunals",
        "User experience and research",
        "Working at HMCTS"
    ],
    "pub_date": "2024-12-20T14:30:22+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Join us for a special end-of-year review episode of Inside HMCTS, where we reflect on the justice highlights of 2024 across all jurisdictions. "
        },
        {
            "text": "From new systems and campaigns to the opening of additional courtrooms and significant events, we cover the progress and transformation within HMCTS. "
        },
        {
            "text": "Tune in to hear from our colleagues and special guests as we celebrate a year filled with achievements and look forward to the challenges and opportunities of 2025. "
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": "A transcript of the podcast is also available."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "12 Mis o Gyfiawnder: Adolygiad GLlTEF 2024"
        },
        {
            "text": "Ymunwch â ni am bennod olaf Inside HMCTS am y flwyddyn, lle byddwn yn myfyrio ar uchafbwyntiau cyfiawnder 2024 ar draws yr holl awdurdodaethau."
        },
        {
            "text": "O systemau ac ymgyrchoedd newydd, i agor ystafelloedd llys ychwanegol a digwyddiadau o bwys, byddwn yn trafod y cynnydd a’r trawsnewid o fewn GLlTEF."
        },
        {
            "text": "Dewch i wrando ar ein cydweithwyr a gwesteion arbennig wrth i ni ddathlu blwyddyn llawn llwyddiannau ac yn edrych ymlaen i heriau a chyfleoedd 2025."
        },
        {
            "text": "Gwrandewch ar y bennod ddiweddaraf nawr, ar gael o ble bynnag rydych chi'n gwrando ar eich podlediadau!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": "Mae trawsgrifiad o'r podlediad ar gael yma hefyd."
        }
    ]
}