{
    "url": "https://moderncivilservice.blog.gov.uk/2024/12/20/celebrating-2024-a-year-of-achievements-at-darlington-economic-campus/",
    "title": "Celebrating 2024: A year of achievements at Darlington Economic Campus",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-12-20T14:40:49+00:00",
    "content": [
        {
            "heading": 6,
            "text": "This is a guest blog by Emma Dudman, Change Communications and Engagement Lead at the Department for Business and Trade, and Sara Gracey, HM Treasury’s Head of Engagement at Darlington Economic Campus."
        },
        {
            "text": "It’s a frosty Thursday morning at the Darlington Economic Campus (DEC) and around 30 civil servants crowd into a collaboration space in the modern, glass-fronted Feethams House."
        },
        {
            "text": "But in a move which arguably would take more legwork to arrange in London, two colleagues from the Treasury and Department for Business and Trade, who sit together daily on the second floor, co-chair a lively discussion."
        },
        {
            "text": "The talk is all fresh ideas for this year’s One Big Thing, but the make-up of attendees tells just as innovative a story. Joining in are representatives from across the Darlington Economic Campus’ nine departments, including policy professionals from the Department for Education, experts in local growth from Ministry of Housing, Communities and Local Government, and Office for National Statistics’ analysts."
        },
        {
            "text": "It’s this ability to bring Civil Service expertise together around a common aim, such as making impactful small changes, which has made Darlington Economic Campus a Places for Growth stand out. "
        },
        {
            "heading": 3,
            "text": "Positive evaluation"
        },
        {
            "text": "Celebrating three years since its spring budget inception in 2021, the campus hit a significant milestone this autumn of 1000 recruits. More than 80 percent were recruited locally."
        },
        {
            "text": "Creating good jobs in the north east is a benefit underlined in a recent evaluation report commissioned by HM Treasury. It also evidences high employee satisfaction and how well-planned outreach with universities, schools and ex-forces personnel is nurturing talent pipelines."
        },
        {
            "text": "Indeed, sustaining the campus’ success long into the future is something its senior civil servant cohort pays special attention to. "
        },
        {
            "text": "Beth Russell is HM Treasury’s Second Permanent Secretary and Head of the Darlington Economic Campus. She said: “I am very proud that this campus is an exemplar for the Civil Service on a lot of things, from how you build a truly collaborative campus rooted in a place, to how you bring diversity of thought into the Civil Service through opening up opportunities outside of London, and build meaningful relationships with local government, businesses, universities, and colleges”."
        },
        {
            "heading": 3,
            "text": "Leaders together"
        },
        {
            "text": "Both HM Treasury and the Department for Business and Trade have given the Darlington Campus special status as their second HQ and invested in leadership with relocated directors and directors general coming together as a Head of Campus team."
        },
        {
            "text": "Jo Crellin, Department for Business and Trade’s Director General sponsor for Darlington, moved to the north east following life as a HM Trade Commissioner in Latin America and the Caribbean. She’s seen the Darlington Campus evolve from feeling almost like a start-up, known fondly as ‘Team Darlo’, to a truly outward-facing campus that is really rooted in the local and regional community. "
        },
        {
            "text": "Thanks to connections with local policy networks Jo and Beth recently led a cross-Government visit and roundtable at the University of York on regional growth – something that just would not have happened had the Darlington Economic Campus and our collective focus on connecting with communities and having different sorts of conversations, not existed."
        },
        {
            "text": "Jo said: “The key feedback I took from the university was ‘this is the first time we’ve had this many Government departments in one room here’. "
        },
        {
            "text": "“Among the academics and experts present there was a desire to do things differently. I think this campus enables us to do just that. It’s helped form new ways of working that are better for us, and our communities.”"
        },
        {
            "heading": 3,
            "text": "Growth Mission Board and Mayoral Roundtable"
        },
        {
            "text": "The government’s Plan for Change to drive economic growth and improve living standards for working people was put into action in December at Darlington Economic Campus, as Chancellor Rachel Reeves chaired the Growth Mission Board in the north east for the first time. "
        },
        {
            "text": "The Board also discussed progress on delivering the government’s commitment to build 1.5 million houses, how to make the most of the opportunities for growth in our city regions and plans to further support devolution in England."
        },
        {
            "text": "Mayors from across the country then joined the Chancellor for a Mayoral Roundtable, where she set out how regional growth would be hardwired into the government’s work. "
        },
        {
            "text": "Hosting both of these events at Darlington Economic Campus was a clear statement that the campus is the place to make policy and do business together."
        },
        {
            "heading": 3,
            "text": "Building cross-government collaboration"
        },
        {
            "text": "Efforts to break down silos between departments and build both Civil Service community and outreach opportunities were recognised in the Darlington Economic Campus’ win at this year’s Government Property Agency’s Smarter Working Live Awards, in the ‘Building Collaborative Communities’ category."
        },
        {
            "text": "This year’s EconFest, a riff on the ‘economic’ in the campus’ title, and a week-long symposium on everything from growth to gross domestic product, characterises such collaboration. "
        },
        {
            "text": "The festival was backed by regional policy and analyst communities and an unrivalled chance for experts across the Darlington Economic Campus’ departments to examine innovative theory, network and learn together. Having secured dial-ins from across 20 countries, plans are already under way for a growth-themed EconFest in 2025."
        },
        {
            "heading": 6,
            "text": "Credit: Alex Holland, University of York."
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "The One Big Thing exercise at the campus unearthed ideas to explore from further honing outreach opportunities to making it easier to find out who’s who across departments and work together."
        },
        {
            "text": "As cross government colleagues team up to work on pitches they’re finding other issues to tackle in practice, from which digital tools are best to collaborate with, to how we share space."
        },
        {
            "text": "It’s all part of the spirit of learning that defines Darlington Economic Campus and will ensure we continue to grow in 2025 and influence Hubs across the UK. "
        },
        {
            "heading": 3,
            "text": "Opportunities at Darlington Economic Campus"
        },
        {
            "text": "Visit the Darlington Economic Campus page to learn more. Want to work at the Darlington Campus? Search ‘Darlington’ on Civil Service Jobs or follow us on LinkedIn @Darlington Economic Campus."
        }
    ]
}