{
    "url": "https://deframedia.blog.gov.uk/2024/12/20/coverage-following-ofwats-final-determinations-on-water-bills/",
    "title": "Coverage following Ofwat's final determinations on water bills",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water",
        "Weekly stories"
    ],
    "pub_date": "2024-12-20T17:37:50+00:00",
    "content": [
        {
            "text": "There has been widespread coverage following the publication of Ofwat's final determinations yesterday as part of the 2024 price review."
        },
        {
            "text": "Ofwat, the independent economic regulator of the water sector, has announced bill rises which equate to around £3 additional per month on average. This will pay to fix crumbling infrastructure, which will dramatically reduce sewage spills and lead to cleaner rivers, lakes and seas. "
        },
        {
            "text": "It is the responsibility of Ofwat to review water company plans to ensure they meet legal requirements and government targets to give customers the best value for their money.  The government is clear that bills must remain affordable, and customers cannot be expected to pay the price for years of underperformance in the past.   "
        },
        {
            "text": "The government also expects water companies to put robust support in place for customers that are struggling to pay their bills. "
        },
        {
            "text": "The final settlement for the water sector will now unlock around £104bn of spending by water companies between 2025 and 2030.  In the next five years, the increase in bills is expected to pay for: "
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“After years of failure, we are left with record sewage spills and crumbling water infrastructure. For too long, customers’ money has been spent on unjustified bonuses and shareholder payouts, rather than investing on upgrades. "
        },
        {
            "text": "“The Government will ringfence money earmarked for investment so it can only be spent on infrastructure upgrades, not bonuses and shareholder payouts. "
        },
        {
            "text": "“We will clean up our rivers, lakes and seas and build the reservoirs needed to unlock the new homes set out in our Plan for Change.”"
        }
    ]
}