{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/12/20/enhancing-digital-trust-through-trust-services/",
    "title": "Enhancing digital trust through trust services",
    "authors": [
        "Michael Animashaun"
    ],
    "categories": [
        "Digital identity",
        "International"
    ],
    "pub_date": "2024-12-20T09:00:00+00:00",
    "content": [
        {
            "text": "For the digital economy to run smoothly, trust and security need to be built in at every level. Trustworthy digital identities are one example of a tool that offers both security and convenience for those operating in the digital world.  "
        },
        {
            "text": "There is a separate set of digital tools, known collectively as 'trust services’, which can help.  Trust services sit under a piece of UK law called the eIDAS Regulations and they make electronic transactions faster, simpler, and more secure.  In this blogpost, we talk about what OfDIA is doing with regard to trust services.  "
        },
        {
            "heading": 2,
            "text": "What are trust services? "
        },
        {
            "text": "There are several trust services covered by the UK eIDAS Regulation including: "
        },
        {
            "text": "“Qualified trust services” are the most reliable form of trust service which meets specific requirements set out in the Regulation. These services ensure a higher degree of security and stricter methods of authentication and validation which can only be offered by qualified trust service providers. They also have greater legal reliability and benefit from the presumption of integrity and the accuracy of their data."
        },
        {
            "heading": 2,
            "text": "Changes Under the Data (Use and Access) Bill"
        },
        {
            "text": "To ensure the UK trust services legal framework continues to function effectively into the future, the Data (Use and Access) bill is seeking to make some adjustments to the eIDAS Regulation.  The main changes are outlined below:"
        },
        {
            "heading": 2,
            "text": "How can trust services help build trust in the digital economy?"
        },
        {
            "text": "eIDAS-compliant or qualified trust services provide legal certainty and a high level of technical security which can help support the growing demand for secure and trusted electronic transactions by smoothing frictions, reducing costs and increasing confidence"
        },
        {
            "text": "Here at OfDIA we are exploring how the wider take up of UK qualified trust services across the economy might complement the evolving UK digital identity ecosystem.  For example, HM Land Registry is already looking at how qualified electronic signatures, along with digital identity and machine-readable data can enable secure and convenient digital land and property transactions. "
        }
    ]
}