{
    "url": "https://prisonjobs.blog.gov.uk/2024/12/20/michaels-journey-from-osg-to-account-manager-in-the-prison-service-part-two/",
    "title": "Michael's Journey: From OSG to Account Manager in the Prison Service (Part two)",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "OSG",
        "Personal stories"
    ],
    "pub_date": "2024-12-20T17:33:45+00:00",
    "content": [
        {
            "text": "In this continuation of Michael's story, we delve deeper into his 21-year journey with the Prison Service, which began at HMP Rochester as an operational support grade (OSG). Rising through roles like prison officer and custodial manager, he now works to improve performance at some of the most challenging prison sites. "
        },
        {
            "text": "Could you share your experiences with prisoner contact and how you maintained safety and professionalism in those interactions? "
        },
        {
            "text": "Maintaining safety and professionalism in interactions with prisoners is crucial. Most prisoners are ordinary people who have made some poor decisions, and our role is to help them make positive changes. We're all just one bad decision away from being on the other side of the door. Treating people with respect and empathy is essential in this line of work. "
        },
        {
            "text": "As an OSG, most of your work won’t involve direct contact with prisoners. There will be small amounts of it and walking around a prison there are other prisoners walking around. If you don't want to engage with prisoners in any capacity, working in a prison is not for you. "
        },
        {
            "text": "Can you recall any memorable experiences where you felt you made a significant difference in the prison environment? "
        },
        {
            "text": "One memorable experience was at HMP Maidstone, where I worked in correspondence. I intercepted substances in the mail that could have destabilized the prison. This action significantly improved the overall safety of the prison, highlighting the indirect but fundamental contributions of OSGs.   "
        },
        {
            "text": "What advice would you give to someone looking to progress from an OSG role to other positions within HMPPS, based on your experience? "
        },
        {
            "text": "Explore both operational and non-operational career paths within HMPPS. Learn from others and emulate positive behaviors. Don't just assume that you have to be an officer. There are governors who were OSGs, and we’ll always need prison officers. But there are also opportunities in the non-operational space. "
        },
        {
            "text": "Looking back on your OSG role, is there anything you wish you had known before starting? "
        },
        {
            "text": "I wish I had known the phonetic alphabet before starting my OSG role. It is essential for radio communication, and I encourage new OSGs to learn it as soon as possible. "
        },
        {
            "text": "What would you say to someone considering applying for an OSG role but unsure about the challenges, based on your experience? "
        },
        {
            "text": "Talk to someone who's done the job, not necessarily an OSG job, but someone who has worked in the prison environment as they will give an honest appraisal of what goes on in a prison. We want people who want to make society safer and if you are one of those people and you genuinely want to contribute to that, being an OSG is a good starting point. "
        },
        {
            "text": "Michael’s journey demonstrates the important function OSGs have in ensuring smooth and safe prison operations and highlights the career development opportunities within the Prison Service and HMPPS."
        },
        {
            "text": "If Michael’s journey has inspired you, why not explore the opportunities available in the Prison Service? If you want a varied role, working with a diverse and supportive team, start your journey today and see where it could take you."
        }
    ]
}