{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/12/20/trust-at-a-distance-how-can-digital-identities-help/",
    "title": "Trust at a distance: how can digital identities help?",
    "authors": [
        "Caroline Copley",
        "Sarah Lee"
    ],
    "categories": [
        "Digital identity",
        "International"
    ],
    "pub_date": "2024-12-20T09:00:00+00:00",
    "content": [
        {
            "text": "Whether the goal is trade, new knowledge, diplomacy or making friends, there is a long history of people needing – and finding ways – to trust each other at a distance. In today’s global digital environment, making sure people can trust who they are connecting with has never been more important."
        },
        {
            "text": "The UK Government is committed to promoting a global digital environment which is open but also safe. We believe that secure, privacy-enhancing digital identities that work across national boundaries can enable that objective; supporting trade and economic growth, and the pursuit of individual freedoms and liberties."
        },
        {
            "heading": 2,
            "text": "Benefits of making digital identities work across international borders"
        },
        {
            "text": "The UK government is convinced of the potential and value of digital identities domestically, but enabling digital identities to work internationally could unlock wider benefits like:"
        },
        {
            "heading": 2,
            "text": "Encouraging interoperability to support the digital economy"
        },
        {
            "text": "As digital transformation of the global economy accelerates, it is clear that national governments will need to consider how digital identity systems might develop to be interoperable."
        },
        {
            "text": "The potential for digital identity systems to cross national borders cannot override the need for digital identities to be secure, privacy-preserving and inclusive for all those who want to use them.  Privacy, security, transparency, inclusivity, proportionality and good governance are at the heart of the UK’s approach to digital identity; as well as interoperability. "
        },
        {
            "heading": 2,
            "text": "Sharing what works"
        },
        {
            "text": "Different approaches to digital identity are taking shape around the world.  For example, the EU is developing a Digital Identity Wallet that will be recognised across all 27 member countries. India has rolled out its Aadhaar Card to all Indian residents.  And some US states are developing mobile driving licences.  OfDIA talks to other countries bilaterally, and participates in many international fora – such as the G7, the G20 and the OECD (Organisation for Economic Cooperation and Development) – to help inform the approach we take domestically, and to lend the UK’s weight to the development of global best practice. "
        },
        {
            "text": "A recent example is our work with the US, Canada, France, Germany, Italy, and Japan to create a shared view of the different digital identity frameworks being developed across the G7. This is the first time a comparison like this has been undertaken."
        },
        {
            "text": "The report reveals some common ground when it comes to definitions, and similarities in how G7 countries approach the business of assigning levels of confidence to digital identity checking processes. It also shows how – with the exception of France, Germany, and Italy which are all advancing digital identity systems under the EU Wallet initiative – each G7 country has so far chosen to base its framework on different international standards."
        },
        {
            "text": "The G7 is an intergovernmental organisation that collaborates to encourage economic growth and stability; so it is significant that they are now allocating time to digital identity. This report can serve as a foundation for further dialogue and cooperation at governmental level."
        },
        {
            "heading": 2,
            "text": "Taking a principles-based approach to digital identity"
        },
        {
            "text": "A digital identity service is only useful if you can use it. We’re taking a principles-based approach to how digital identity evolves in the UK. We’re sharing that approach internationally and learning from what works elsewhere to strengthen the opportunities for digital identity to make people’s lives better."
        },
        {
            "text": "We’ll be talking more about what we’re doing with other governments on this blog, as our work develops."
        }
    ]
}