{
    "url": "https://space.blog.gov.uk/2024/12/20/watch-out-space-trash-signs-is-about/",
    "title": "Watch out - Space Trash Signs is About!",
    "authors": [
        "Astroscale"
    ],
    "categories": [
        "Space sustainability"
    ],
    "pub_date": "2024-12-20T15:32:32+00:00",
    "content": [
        {
            "text": "As industries and companies grow, so does the amount of trash and rubbish they produce. This is the same in the space industry, and with the quick rate of growth in the space sector across the UK and globally, the issue of space debris needs to be addressed."
        },
        {
            "text": "Over 130 million pieces of human-made debris are now in Earth's orbit. Travelling at 15 kilometres per second, even a tiny piece can cause significant damage when moving faster than the speed of a bullet. Numbers from ESA Space Debris by the numbers."
        },
        {
            "text": "Unchecked, space debris threatens to destroy the modern world we know today. As a result, there is a growth in companies and initiatives focusing on ensuring a sustainable space environment for the future.  But how would it affect you if nothing is done to stop the problem?"
        },
        {
            "text": "Highlighting ten consequences, impacting 8 billion people, The Space Trash Signs initiative aims to increase public awareness of space pollution."
        },
        {
            "text": "Launched with the support of aerospace companies, including Astroscale, space agencies, scientists, and universities, as well as activists, museums, and media from around the world, the initiative reveals new, proposed astronomical constellations - made of real space debris in orbit today. Each \"space trash sign\" highlights a different impact of space pollution and debris."
        },
        {
            "heading": 2,
            "text": "The Constellations"
        },
        {
            "text": "The Broken Compass: Impact 6.5 billion people "
        },
        {
            "text": "Over 6 billion people rely on Global Satellite Navigation Systems, and key sectors such as aviation and maritime need this application to keep the global economy moving. Disruption in this area would affect the world's trade economy."
        },
        {
            "text": "The Great 404: Impact 43 million people"
        },
        {
            "text": "Life without the internet today seems unimaginable, but this could be at risk for many. Satellite internet is especially crucial in providing connectivity in remote and rural areas for education, telemedicine, banking and more. Currently, 43 million people rely on satellite systems for internet access, but by 2029, that number is predicted to be at 110 million.  "
        },
        {
            "text": "The Unavailable Forecast: Impact 6.5 billion people "
        },
        {
            "text": "Loss of accurate weather forecasts using satellite-derived meteorological data disrupts over 80% of the global population, with significant consequences for areas prone to extreme weather."
        },
        {
            "text": "The Lost Harvest: Impact 509.6 million km2 "
        },
        {
            "text": "Satellites provide a wide variety of data to help us monitor our planet. They can look at and process data for agriculture, natural disasters, climate change, glacial retreats and more. Without this data from satellites, we would be left in the dark about the planet's health."
        },
        {
            "text": "The Big Crash: Impact USD 19.3 billion "
        },
        {
            "text": "Financial institutions from national and multinational banks rely on satellites for secure transmissions, fraud detection, and risk and collateral evaluation. In rural areas, people can depend on satellites to access their banking services."
        },
        {
            "text": "Rest In Space: Impact 10 people "
        },
        {
            "text": "Whilst satellites are at risk of space debris, so are our astronauts. Manoeuvring the International Space Station (ISS) has started to become routine with the increase of space debris in orbit. The ISS has also been hit by debris, luckily so far not causing long lasting damage. But with the rise in space tourism there could soon be larger groups of untrained civilians in space trying to avoid speeding space trash.  "
        },
        {
            "text": "The Mission Parcel: Impact 205 billion parcels "
        },
        {
            "text": "International logistics rely on a very complex system, which isn't surprising when over 436 million parcels are sent around the world every day. Satellite components make up a crucial part of that system, and if this is disturbed, it could affect the entire world's global supply chain of parcels, food distribution, medical supplies and more."
        },
        {
            "text": "The Last SOS: Impact 3.4 billion people"
        },
        {
            "text": "Satellites provide a primary source of communication and the possibility to geolocate people. This application is vital for assisting and coordinating rescue efforts when disaster strikes people and communities. Groups such as the International Disaster Charter play a pivotal role in these efforts, but our satellites must be safe to help us down on Earth."
        },
        {
            "text": "The Bars of No Service: Impact 6.5 billion people "
        },
        {
            "text": "Today, an estimated 85% of the planet's population owns a smartphone, which means if communication services were lost, there would inevitably be a global standstill—no signal, calls, texts, or data!"
        },
        {
            "text": "The End of Discovery: Impact 8.1 billion people "
        },
        {
            "text": "If further collisions in space occur, this could create a barrier of debris around Earth that rockets cannot get through, stopping all future space missions for decades until we clear our orbits."
        },
        {
            "heading": 2,
            "text": "What can we do to stop the danger of debris? "
        },
        {
            "text": "Here at Astroscale, we are leading the way in sustainable space. We're working on missions to remove satellites, old and new, extend their lives, and de-orbit massive rocket bodies. Changing the mindset of the norm can be challenging, but we need to take action now to make sure our orbits stay safe and secure. Let's remove the rubbish we produce and ensure everyone across the globe has access to space for now and future generations - keeping the modern and connected world we all know and rely on today."
        },
        {
            "text": "Find out more about what Astroscale is up to, including their missions with the UK Space Agency, ELSA-M and COSMIC: Astroscale, Securing Space Sustainability"
        },
        {
            "text": "Check out the ‘Space Trash Signs’ project: https://spacetrashsigns.org/"
        }
    ]
}