{
    "url": "https://nationalscreening.blog.gov.uk/2025/02/21/attending-masters-level-module-has-expanded-and-deepened-my-understanding-of-screening/",
    "title": "Attending master’s level module has expanded and deepened my understanding of screening",
    "authors": [
        "Hope Walters"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-02-21T08:50:12+00:00",
    "content": [
        {
            "text": "As a Strategic Evidence Manager at Cancer Research UK, one of my responsibilities is to monitor and collate cancer screening evidence with the aim of influencing evidence-based policy and practice."
        },
        {
            "text": "The nature of my work means I had a good baseline knowledge of how screening works, but I was keen to expand that and deepen my understanding of the complexities of health screening."
        },
        {
            "text": "I was drawn to the Health Screening master’s level course knowing it is delivered with a unique, expert-driven perspective, as a collaboration between Warwick Medical School and the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "My highlights from the course included learning more about the history of screening policy, UK NSC’s robust evidence review processes, and the ethical considerations in screening. As a strong advocator of informed choice, I found the discussions and debates on ethics insightful. I enjoyed learning about how the principles of medical ethics apply to screening and gaining a greater understanding of what can contribute to informed decisions."
        },
        {
            "text": "The screening landscape is rapidly evolving as research progresses. During the week at Warwick, I gained valuable insights into the technical considerations involved in developing or adapting screening programmes."
        },
        {
            "text": "This experience has strengthened my expertise and interest in considering how the cancer screening community assesses and adopts innovation. For example, this includes the need to know that new screening tests are not just accurate but also that they can be feasibly and effectively embedded into a screening programme, considering the impact across the whole pathway. This has enabled me to contribute further to our thought leadership activities at CRUK relating to multi-cancer tests and surrogate endpoints."
        },
        {
            "text": "I was also grateful for the opportunity to network with colleagues from all walks of the screening world. The face-to-face format of the course promoted interactive learning through discussions with academic staff and peers."
        },
        {
            "text": "I’d like to thank everyone involved in delivering this course and would encourage anyone working in health screening to participate – it’s a fantastic opportunity."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}