{
    "url": "https://educationhub.blog.gov.uk/2025/02/how-to-claim-15-hours-free-childcare-code/",
    "title": "Hundreds of thousands of parents can now access 15 hours funded childcare for 9-month-olds – how to apply",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare"
    ],
    "pub_date": "2025-02-21T00:01:00+00:00",
    "content": [
        {
            "text": "Hundreds of thousands of eligible working parents can now access 15 hours government-funded early education for children aged 9-months-old and older after new rules kicked in from 1 September 2024."
        },
        {
            "text": "Those who are eligible to take advantage of the scheme this term should have already received their code and secured a childcare place."
        },
        {
            "text": "Eligible working parents who plan to take up a funded place from April 2025 can apply for a code by 31 March. If they’re starting a new job or returning from parental leave this may affect when they’re eligible - more information on this below’"
        },
        {
            "text": "It's worth noting that some providers may charge for extra services, such as providing lunch and nappies, or optional extras such as trips, in addition to the government funded childcare. Visit childcarechoices.gov.uk for further information."
        },
        {
            "heading": 3,
            "text": "When can I apply and how do I get my code? "
        },
        {
            "text": "Applications are open for eligible working parents whose children will be aged at least 9-months-old on or before 31 March 2025."
        },
        {
            "text": "This can be combined with the universal 15 hours to make 30 hours childcare when your child turns 3 or 4."
        },
        {
            "text": "When you apply, you’ll receive a code to give to your childcare provider."
        },
        {
            "text": "It’s important to remember that codes need to be renewed every three months. To do this, you’ll need to remember to login to your childcare account to check when your reconfirmation dates are, so that you can renew your code on time. If you don’t renew it on time, you will need to reapply."
        },
        {
            "text": "You can claim your place the term after your child turns the relevant age. This gives local authorities and childcare providers enough time to prepare."
        },
        {
            "text": "There is no limit on the number of codes available. However, if you’re applying for childcare to start in April 2025, we recommend that you reach out to your preferred provider as soon as possible to check when they will need your code."
        },
        {
            "text": "We know that it may be difficult at this stage to secure your first-place provider. If you are struggling to find a place you should contact your local authority, who will be able to help source a local provider offering the entitlements."
        },
        {
            "heading": 3,
            "text": "How do I apply?  "
        },
        {
            "text": "You apply online here on gov.uk once you have checked our eligibility criteria."
        },
        {
            "text": "You’ll need to make sure you have the following information to hand before starting the application:"
        },
        {
            "text": "You may find out if you’re eligible straight away, but it can take up to 7 days."
        },
        {
            "text": "Once your application has been approved, you’ll get a code to give to your childcare provider."
        },
        {
            "text": "Eligible parents are also able to access tax-free childcare through the same application system. You can apply for tax-free childcare at any time."
        },
        {
            "text": "However, you don't need to apply for tax-free childcare to be eligible to apply for the 15 hours childcare scheme."
        },
        {
            "heading": 3,
            "text": "Can I apply for government-funded childcare if I’m on parental leave?"
        },
        {
            "text": "Yes, you can."
        },
        {
            "text": "If you’re applying for childcare for an older child, who is not the reason for your parental leave, you can continue to apply in the usual way."
        },
        {
            "text": "For parents applying for funded childcare for the child who is the reason for your parental leave, you can apply for a childcare code at the same time as everyone else as long as you plan to return to work from parental leave or start a new job by the end of April 2025."
        },
        {
            "text": "Parents on parental leave will need to apply online. They may be told their application is ‘pending’ if it is more than 31 days before they return to work, but they will still receive a letter in the post within 1 to 2 weeks so they can access their childcare entitlement."
        },
        {
            "text": "Parents starting new work before 30 April can call HMRC on 0300 123 4097 to receive a code."
        },
        {
            "heading": 3,
            "text": "What if I’m on parental leave and returning to work after 1 May 2025? "
        },
        {
            "text": "If they’re starting a new job or returning from parental leave this may affect when they’re eligible."
        },
        {
            "text": "For the purposes of accessing the entitlement, taking annual leave after the end of your parental leave counts as having returned to work."
        },
        {
            "text": "It is important to remember that if you are applying for childcare for an older child who is not the reason for your parental leave, you can apply regardless of your return-to-work date."
        },
        {
            "heading": 3,
            "text": "What happens once I receive my code? "
        },
        {
            "text": "Once you receive your code, you’ll need to take it to your childcare provider, along with your National Insurance number and your child’s date of birth."
        },
        {
            "text": "Your childcare provider will process the code to provide your place."
        },
        {
            "text": "Your local authority can provide support for finding a government-funded place in your area. You can find out who your local authority is here."
        },
        {
            "heading": 3,
            "text": "If I receive a code in a letter from HMRC, does this make my code on my Childcare Account invalid? "
        },
        {
            "text": "No. Both codes will be valid."
        },
        {
            "text": "If you have two codes, one from your letter beginning with 11 and one from the website beginning with 50, please give your provider the code from the website, as this is the permanent digital code for your child."
        },
        {
            "text": "If you only have one code (beginning with 11) then you can use this code to start using your government-funded hours."
        },
        {
            "text": "Please remember that once your reconfirmation window opens, you will still need to reconfirm your eligibility through your Childcare Account and share the digital code you receive with your provider."
        },
        {
            "heading": 3,
            "text": "Do I need to wait for my reconfirmation window to add another child to my account? "
        },
        {
            "text": "A parent who is already using the childcare service for another child can add a new child to their account at any time."
        },
        {
            "text": "Your reconfirmation cycle for your current Tax-Free Childcare won’t affect this."
        },
        {
            "heading": 3,
            "text": "What happens if I’m using an entitlement for my 2-year-old when they become 3?"
        },
        {
            "text": "Parents are able to access the universal 15 hours childcare support from the term after the child’s third birthday through to when they start school."
        },
        {
            "text": "If your child is accessing the 15 hours entitlement for 2-year-olds and you remain eligible, your child will automatically be moved onto 30 hours (universal 15 hours + 15 hours for working parents) from the term after your child turns 3."
        },
        {
            "text": "You will just need to keep reconfirming your code as normal, and it will become usable to claim 30 hours."
        },
        {
            "text": "You should also speak to your provider to let them know you intend to take up 30 hours."
        },
        {
            "text": "If you are accessing disadvantaged entitlement childcare for, you will also able to access the universal entitlement from the term after your child turns 3."
        },
        {
            "heading": 3,
            "text": "What changes are you making on charging?"
        },
        {
            "text": "We have recently updated guidance to make sure we’re protecting parents from reported instances of expensive additional charges or ‘top-up fees’ on top of the 15 or 30 hours that you’re entitled to, ensuring the funded hours remain accessible and affordable for families."
        },
        {
            "text": "This updated guidance directed at local authorities will make things clearer for parents, making sure they know upfront about extra costs and this will be published on childcare provider websites or local authority council websites."
        },
        {
            "text": "Childcare providers will also have to break down their invoices so parents can clearly see where any extra charges are coming from. We’ve also made clear what items are included as ‘consumables’ including things the government funding doesn’t cover like nappies, sun cream and lunch."
        },
        {
            "text": "We want to make sure that the 15 or 30 hours are accessible to parents. You may be charged for some extras, but these charges must not be mandatory, or a condition of accessing a funded place and you can speak to your provider about what alternative options they may have."
        }
    ]
}