{
    "url": "https://educationhub.blog.gov.uk/2025/02/need-know-secondary-school-offer-day/",
    "title": "What you need to know about secondary school offer day",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School places",
        "Schools"
    ],
    "pub_date": "2025-02-21T17:23:52+00:00",
    "content": [
        {
            "text": "On March 3, Year 6 pupils across the country will find out which secondary school has offered them a place for September 2025. "
        },
        {
            "text": "The vast majority of pupils will be offered a place at one of their preferred schools – most will be offered their top choice. "
        },
        {
            "text": "Last year, 94.6% of applicants for a secondary school place received an offer from one of their top three choices, while 82.9% were offered their first-choice secondary school."
        },
        {
            "text": "We will not publish the preference data until June but the data from last showed that: "
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "heading": 3,
            "text": "What happens once I receive an offer of a school place? "
        },
        {
            "text": "In England, the offer letter or email will explain what you need to do next. You may need to accept the place by a given deadline – if you miss that, the offer could be withdrawn and the place given to someone else. "
        },
        {
            "heading": 3,
            "text": "Can I appeal a school placement decision? "
        },
        {
            "text": "Parents or carers who want to appeal a decision should first contact the school’s admission authority, which is responsible for organising the appeal panel. Parents and carers can find their school’s admission authority by visiting their local council website: Find your local council - GOV.UK (www.gov.uk). "
        },
        {
            "text": "The panel is independent and will look at the case presented by both the admission authority and the parent before making a decision on whether the school should admit the child. "
        },
        {
            "text": "The decision of the appeal panel is binding – if the appeal is upheld, the admission authority must offer the child a place at the school. "
        },
        {
            "text": "Admission authorities and appeal panels must comply with the statutory School Admission Appeals Code, which is available here. Guidance for parents on the admission appeals process can also be found here. "
        },
        {
            "heading": 3,
            "text": "Why has my child not been offered a place at one of their preferred schools? "
        },
        {
            "text": "Some schools will receive more applications than it has places available and unfortunately not every parent will be successful. Priority must be given to those who most closely meet the school’s published admission arrangements. "
        },
        {
            "text": "If the local authority is unable to offer a place at one of the parents’ preferred schools, it must offer a place at another school where it has a place available. "
        },
        {
            "text": "In the unlikely event that a parent does not receive an offer of a place on March 3, parents should contact their local authority for further advice. "
        },
        {
            "heading": 3,
            "text": "What can I expect from an admissions appeal? "
        },
        {
            "text": "Your appeal may take place in person, remotely by video call, or via a hybrid of the two. "
        },
        {
            "text": "Whatever the format, admission authorities must make sure that all appeals are conducted in a fair and transparent way so that everyone can present their cases fully. "
        },
        {
            "text": "The full guidance on appeals for parents and carers is available here. "
        },
        {
            "heading": 3,
            "text": "What are you doing to make sure there are enough school places? "
        },
        {
            "text": "We’ve announced £195 million to provide both primary and secondary places for 2025, and £520 million for places in 2026, to make sure there are enough  school places. "
        }
    ]
}