{
    "url": "https://medregs.blog.gov.uk/2025/02/21/new-leadership-and-a-focus-on-software/",
    "title": "New Leadership and a focus on Software",
    "authors": [
        "Rob Reid"
    ],
    "categories": [
        "Innovation",
        "Med Tech Regulations"
    ],
    "pub_date": "2025-02-21T13:00:10+00:00",
    "content": [
        {
            "text": "I’m delighted to be picking up the pen to keep you all informed about the progress of our MedTech regulatory reform programme, and other priorities in the MHRA Innovative Devices team, with this February MedRegs blog."
        },
        {
            "text": "Laura Squire’s departure at the end of January has seen a change in structure and leadership, with the Innovative Devices team joining the Agency’s Innovation and Compliance group, led by Interim Executive Director James Pound. This is a great fit that brings greater synergies in innovation-led initiatives and integrated advice. Our ongoing MedTech regulatory reform, advice, and guidance initiatives to support safe access to new technologies are well aligned to Innovation and Compliance’s agenda, which already includes the Innovative Devices Access Pathway and Clinical Investigations. James will provide senior leadership and a wealth of experience in driving innovation and regulatory excellence, ensuring that medical devices continue to be championed at the Executive and Board level. Support and experience from myself and a growing team will ensure the continued delivery of our ambitious regulatory reform programme."
        },
        {
            "text": "And speaking of a growing team, regular readers may remember in a previous blog that we were recruiting a new Head of Software and AI medical devices. We had a really good response to the campaign and were able to select from a field of strong candidates. This is unsurprising given the profile of the role and opportunity to shape how the regulation of software as a medical device evolves to enable innovation. I am delighted to say that earlier this month Marinos Ioannides joined my team as our new Head of Software and AI medical devices. Marinos was formerly Head of Data Science at the Cabinet Office and has a career background spanning medicine and public service, as well as data science. He brings a wealth of relevant experience and expertise to the MHRA."
        },
        {
            "text": "On the subject of AI, we had an exciting start to the year with the Department for Science, Innovation and Technology launching the Government’s AI Opportunities Action plan setting challenges for regulators to really understand AI before we regulate it and ensure that regulations are proportionate and based on science. AI that is a medical device is already within our regulatory framework and I’m pleased to say that our AI Airlock pilot is now well underway. This sandbox approach is allowing us to work with real products to better understand how we can balance appropriate oversight to protect patient safety with the agility needed to respond to the particular challenges presented by these products. We look forward to sharing the learnings from this pilot project as it progresses."
        },
        {
            "text": "Guidance is an essential tool to give innovators and manufacturers clarity about how regulations apply to them including whether a product is within our scope. Earlier this month we added to our growing suite of software guidance with a new publication on Digital Mental Health Technologies – covering device characterisation, regulatory qualification and classification. This new guidance is a product of some fantastic work led by Holly Coole who you may have heard on a recent Digital Health Unplugged Podcast. Holly and her colleague Francesca Edelmann have taken a more user-centred approach to developing our guidance in this project and it’s been great to see a positive response from developers and clinicians. It was also good to see the positive feedback from the AI and digital mental health technologies workshop that Holly and Francesca organised this month, as part of this important Wellcome-funded project led by MHRA and in partnership with the National Institute for Health and Care Excellence (NICE).  The team intend to summarise the event as a paper in the coming months."
        },
        {
            "text": "With agreement from Parliament, the MHRA is pleased to see the new Post-Market Surveillance (PMS) legislation signed, and in January we published new PMS guidance on how to interpret those new regulations ahead of its implementation. The regulations will come into force in June 2025, and we are welcoming feedback on the guidance to ensure it is as clear and as supportive as possible ahead of that date. On 28 January, we also held our first Guidance Working Group. This is a new stakeholder group that will support the drafting of medical devices regulatory guidance documents for all the new regulations."
        },
        {
            "text": "I wanted to thank everyone who has helped us in our ongoing work to refine those regulations by responding to the consultation we ran at the end of last year, considering IVD Classification, International Recognition, UKCA marking requirements and retained EU Law. The consultation closed in early January, and we received nearly 300 responses. We are analysing the responses now and using them to refine our draft regulations, to stay on track with our Roadmap and notify the new regulations to the World Trade Organization this Spring."
        },
        {
            "text": "The team and I look forward to sharing future updates on these, and other priorities, through regular MedTech blogs over the coming year. It’s a pleasure to continue the work that Laura Squire has driven forward with such tenacity during her time at the MHRA, drawing on the strength and expertise of colleagues in the Innovative Devices and across the MHRA."
        },
        {
            "text": "We have a packed agenda ahead of us both in delivering current reforms as set out above, but also in identifying the future enhancements we can make to our regulatory framework. Technology does not stand still, and nor should our regulatory approach. Ensuring that we fully understand the opportunities and barriers faced by innovators and users of medical technologies will be key to making sure these future changes deliver on our ambitions for the UK, and I look forward to leading the team to deliver this engagement."
        }
    ]
}