{
    "url": "https://environmentagency.blog.gov.uk/2025/02/21/the-environment-agencys-decarbonisation-technology-accelerator-programme-a-fast-track-to-the-adoption-of-low-carbon-solutions/",
    "title": "The Environment Agency’s Decarbonisation Technology Accelerator programme – a fast track to the adoption of low-carbon solutions",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Sustainability"
    ],
    "pub_date": "2025-02-21T12:53:58+00:00",
    "content": [
        {
            "text": "For the Environment Agency, achieving our Net Zero ambition remains a key overarching priority and one of the ways we are delivering on our target is through the Decarbonisation Technology Accelerator (DTA) programme."
        },
        {
            "text": "Led by Tony Andryszewski, the programme seeks to accelerate decarbonisation across the organisation’s vast infrastructure project portfolio. The DTA is accelerating the development and deployment of tried and tested lower carbon materials and processes in the supply chain which are currently not yet widely available or commonly used."
        },
        {
            "text": "These opportunities if fully embedded into our projects will significantly decarbonise the whole life management and operation of EA assets."
        },
        {
            "text": "Working together with key EA delivery partners, including VolkerStevin, JBA, Arup, AtkinsRéalis, Kier, BAM Nuttall, Jacksons, and Jacobs, the DTA is investigating 37 solutions across six key themes. Crucially, it is supporting lower carbon materials and processes until they are being used as standard, replacing the higher carbon options."
        },
        {
            "text": "The six key themes of the DTA programme are:"
        },
        {
            "text": "‘Low-carbon’ steel"
        },
        {
            "text": "Steel is vital to many flood and coastal erosion risk management projects, with significant use across the EA’s national project portfolio. Most steel used across the EA’s national portfolio is for sheet piles."
        },
        {
            "text": "DTA provides an opportunity to investigate whether a solution (or solutions) that reduces, reuses or eliminates steel could lower the carbon footprint of traditionally steel-built assets like sheet piles, whilst being cost and programme efficient."
        },
        {
            "text": "Other materials are also used for sheet piles, and life extension techniques for these materials are also being reviewed as part of a general innovation programme."
        },
        {
            "text": "Steel producers can reduce the embodied carbon of their products, creating ‘low carbon’ produced steel through methods like energy-efficiency and using more scrap metal. However, there is currently no agreed definition of 'low carbon' produced steel."
        },
        {
            "text": "Breaking from tradition"
        },
        {
            "text": "The DTA’s steel team, working closely with the EA’s regional hubs, identified the Littleborough Flood Risk Management project in the North West hub as a Host Project – to gather vital information about low-carbon steel sheet piles."
        },
        {
            "text": "The Littleborough project seeks to manage and mitigate a flood storage basin with challenging ground conditions affecting the technical solution and delivery strategy. It requires a sheet pile cut-off wall and earth embankment, as well as extensive temporary works for a cofferdam (an enclosure from which water can be pumped to enable construction)."
        },
        {
            "text": "The project therefore posed an ideal opportunity to trial ArcelorMittal’s EcoSheetPile™ Plus, made from 100% recycled steel using renewable energy as part of the DTA programme, a material which is new to the market and not widely used across the EA."
        },
        {
            "text": "Delivery success"
        },
        {
            "text": "The benefits of the project’s involvement in the DTA programme are clear: by using this product on the project, Littleborough should cut their capital carbon emissions by 2,315tCO2e – 16% of the project’s total carbon budget."
        },
        {
            "text": "Moreover, the team is already reporting that drivability is identical to conventional piles for the same section. The piles were procured from ArcelorMittal with no additional lead time or cost. The EcoSheetPile™ Plus piles were delivered to site with no delays occurring."
        },
        {
            "text": "The consensus was that there were no differences whatsoever in using the low-carbon option. Kris Beadle (VGE Foreman) added: “To be honest, I didn’t even realise that they were different to the piles we have installed elsewhere on previous jobs. They look and perform exactly the same. The only thing I will say I had noticed is that they seem to cut better with less sparks, which is surely a benefit in terms of health and safety”."
        },
        {
            "text": "Building on success"
        },
        {
            "text": "Sharing lessons and experiences from projects like Littleborough within the EA and across the industry is fundamental to the success of the DTA programme.   "
        },
        {
            "text": "The DTA’s steel team will continue to review the trial results from Littleborough. If the results continue to be positive, they will use the evidence to make the lower carbon steel sheet piles standard use across the EA."
        },
        {
            "text": "To find out more, please contact the DTA team at ea_dta@environment-agency.gov.uk"
        }
    ]
}