{
    "url": "https://kingsawards.blog.gov.uk/2025/02/21/the-bio-d-company-receives-the-kings-award-for-enterprise-for-sustainable-development/",
    "title": "The Bio-D Company receives the King’s Award for Enterprise for Sustainable Development",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-02-21T13:54:53+00:00",
    "content": [
        {
            "text": "Bio-D manufactures a wide range of environmentally friendly, vegan cleaning products using 100% plant-based and naturally derived ingredients."
        },
        {
            "text": "Heather Nixon, sustainability, NPD and regulatory manager at Bio-D, said:"
        },
        {
            "text": "“Applying for a King’s Award has always been on our bucket list; it’s one of the most prominent business awards in the country and to have your business personally approved by both the Prime Minister and His Majesty the King is a huge honour. What could be better?"
        },
        {
            "text": "“We also wanted to prove to our customers and consumers that we are truly sustainable. Greenwashing is prevalent, especially in the household cleaning category, so securing a King’s Award for Sustainable Development would demonstrate our eco-credentials."
        },
        {
            "text": "“We knew it would be a detailed award to enter, but to us this meant it would be even more meaningful to receive an award after putting the time and effort into the submission. With an award like The King’s Award, if you win, you know it’s because you genuinely deserve it.”"
        },
        {
            "text": "Heather continued: “Sustainability is in our DNA, it is why Bio-D was founded in 1989, and everything we do has the environment at its heart. It’s something we consider across all areas of the business, so it was only natural to apply for the Sustainable Development category."
        },
        {
            "text": "“It is also something we can verify. We publish a report each year detailing progress made, along with the next year’s priorities and how we can further improve our eco-credentials. These reports demonstrate the substantial amount of progress we’ve made over the past five years alone.”"
        },
        {
            "text": "Heather said: “The process to apply for a King’s Award was – understandably – rigorous; it is not something you can breeze your way through. Completing the application takes a lot of thought and consideration."
        },
        {
            "text": "“However, it is worth it if you are passionate about your business and the difference you’re making. In a way, completing the submission also helps you to understand if you stand a chance of being successful – you need to have enough relevant examples of work and statistics to include."
        },
        {
            "text": "“The time needed to complete your application, in my opinion, proves just how meaningful the award is. Those who succeed need to tick every single box and back it up with evidence.”"
        },
        {
            "text": "Heather said: “We were absolutely over the moon when we found out we had won a King’s Award for Sustainable Development. Just hearing we had been shortlisted was brilliant in itself, so the day we found out we had won was a very special day."
        },
        {
            "text": "“Without a doubt, The King’s Award is the most meaningful award we have won to date, and that has been reflected in our feeling of achievement."
        },
        {
            "text": "“What was best about the win, was that it was a real group effort and gave the whole team a massive sense of achievement. Because it is the work that goes on day-to-day across all departments that helped us to secure the award. Sometimes it feels like the small things don’t make much of a difference – for example charging reusable batteries rather than using disposables, or organising recycling waste – but all of the little things contribute toward a bigger goal."
        },
        {
            "text": "“Staff buy-in has been one benefit of winning a King’s Award. Our suppliers have also really got on board – winning has helped to deepen our relationships with stockists and suppliers."
        },
        {
            "text": "“Being able to give evidence of our sustainability credentials has also been a massive benefit. The King’s Award truly proves that we put sustainability first, and demonstrates this fact to our customers and consumers.”"
        },
        {
            "heading": 2,
            "text": "Top Tips for Applicants"
        },
        {
            "text": "www.biod.co.uk"
        },
        {
            "text": "Facebook: The Bio-D Company"
        },
        {
            "text": "Instagram: @thebiodcompany"
        },
        {
            "text": "LinkedIn: The Bio-D Company Ltd | B Corp"
        },
        {
            "text": "TikTok: @thebiodcompany"
        }
    ]
}