{
    "url": "https://gfie.blog.gov.uk/2025/02/21/there-is-a-unique-skillset-that-comes-with-having-diverse-experiences-and-each-person-can-add-so-much-value/",
    "title": "There is a unique skillset that comes with having diverse experiences and each person can add so much value",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Care Day 2025",
        "Care Experienced",
        "Care Leavers",
        "Life Chances"
    ],
    "pub_date": "2025-02-21T10:00:00+00:00",
    "content": [
        {
            "text": "Care Day (Friday 21st February 2025) is the world’s biggest celebration of children and young people with care experience!"
        },
        {
            "text": "To Celebrate Care Day 2025, we would like to share with you a personal experience from an individual who has come into the Civil Service via the GFiE Department for Education Care Leavers Internship Scheme, and the impact that having this opportunity has had on them. "
        },
        {
            "heading": 3,
            "text": "What is the GFiE Department for Education Care Leavers Internship Scheme?"
        },
        {
            "heading": 3,
            "text": "What do Interns think about their time in the Civil Service"
        },
        {
            "heading": 3,
            "text": "GFiE Care leavers / Care Experienced Schemes for individuals"
        },
        {
            "text": "There are currently three GFIE Pathways specifically focused at supporting care experienced individuals - the Department for Education Care Leaver Internship Scheme,  Cabinet Office Life Chance Scheme for Care Leavers and the Welsh Government Support for Care Leavers Scheme.   Working with Departments across the Civil Service, the schemes aim to offer opportunities to people who may not otherwise have considered a career in the Civil Service."
        },
        {
            "text": "We often hear from candidates, including those with experience of care, that they are not sure what a career in the Civil Service looks like or whether it would be for them. By working in partnership with Local Authorities and organisations supporting care experienced individuals, we aim to show that the Civil Service welcomes the perspectives they can bring, both as colleagues but also as shapers of future public services and policy."
        },
        {
            "text": "We have seen the impact that care experienced individuals can have and want to build on this brilliant work."
        }
    ]
}