{
    "url": "https://ipo.blog.gov.uk/2025/03/01/weaving-a-web-how-corryn-biotechnologies-spun-into-healthcare-innovation/",
    "title": "Weaving a web: how Corryn Biotechnologies spun into healthcare innovation",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "Innovation",
        "IP insurance",
        "Patents"
    ],
    "pub_date": "2025-03-01T09:51:08+00:00",
    "content": [
        {
            "text": "Today, Welsh people around the world will be celebrating the Patron Saint of Wales on St David’s Day. "
        },
        {
            "text": "With the Welsh Government’s Innovation Strategy, the aspirations for the Welsh economy are very much in focus; today we’re showcasing an innovative Welsh business making waves in healthcare technology. "
        },
        {
            "text": "I recently had the opportunity to speak with Luke Burke, founder of Corryn Biotechnologies, manufacturer of biocompatible and biodegradable wound dressings, about the business and its intellectual property (IP).  Where does Corryn’s story begin? Luke's journey to founding Corryn began when he was working at a Paris-based start-up, focused on haemodialysis grafts – a way of making it easy for nurses to access veins regularly for dialysis treatment.  "
        },
        {
            "text": "While visiting a haemodialysis ward, he observed something that would change the course of his career - a nurse checking wound infections by smell.  "
        },
        {
            "text": "As a diabetic himself, Luke understood the critical need for better wound care technology in patients with similar underlying health conditions, which can often prevent wounds from healing properly. "
        },
        {
            "text": "Luke explained how his experience during his PhD at Swansea University had formed the foundation for Corryn's technology. "
        },
        {
            "text": "\"I'd worked with a technique called electrospinning, which is a way to make very fine fibres that can work as a scaffold material for cells to grow over and through,\" he told me. \"Using a polymer and a very high voltage, you basically stretch the fluid out into these little fibres, something like candy floss.\" "
        },
        {
            "text": "Luke explained how this technique isn't new to medical applications - it's been used in heart valves and haemodialysis grafts and even other wound dressings because the materials can be absorbed by the body over time and replaced with healthy cells. However, he saw an opportunity to create an innovative change to the way these materials are manufactured and delivered.  "
        },
        {
            "text": "\"My idea was, what if we could miniaturise the manufacturing equipment down into a handheld device, so we can actually manufacture these materials right there at the point of care, directly onto the patient. This is instead of the traditional process, where a material is manufactured, cut to size, packaged, shipped, sterilised and then applied to the patient. What if we could create fibres directly from a fluid, precisely where they are needed on the patient? \" "
        },
        {
            "text": "How critical has your IP been in attracting investment?Luke explained how patents are fundamental to Corryn's success, serving as both protection and a foundation for growth.  "
        },
        {
            "text": "Safeguarding Trade Secrets The Corryn team maintains strict control over their trade secrets, particularly regarding their fluid formulation technology. Their approach includes comprehensive NDAs, non-compete agreements, and a trade secret register. They've even developed an innovative coding system for materials: "
        },
        {
            "text": "\"Rather than calling the polymer by its scientific name like 'polycaprolactone 3', which anyone could easily look up on Google, we call them by pseudonyms such as 'Corry Polymer O2',\" Luke explained. This attention to detail helps prevent accidental information disclosure while protecting competitive advantage.  "
        },
        {
            "text": "‘IP insurance is brilliant’ On the recommendation of its investors, Corryn invested in IP insurance - a decision Luke strongly endorses.  "
        },
        {
            "text": " While acknowledging it isn't free, Luke believes it adds significant value: “If I was investing, I'd definitely prefer a company that had a patent and IP insurance over a company that just had the patent.” "
        },
        {
            "text": "What is your advice for businesses in your position? Luke’s advice for other businesses is clear: don't underestimate the complexity of IP protection.  "
        },
        {
            "text": "\"I think I was under this impression that if you had a good idea, you could patent it, and I discovered that's not the case,\" Luke shared. \"Knowing that you're doing the right thing and doing it as efficiently as possible is critical. And it's a very complicated field, so you need an expert.\" "
        },
        {
            "text": "Luke emphasises the importance of seeking professional IP advice early:  \"If I hadn't had Agor IP available, I would have had to seek out some support of one kind or another because IP protection is simply not my expertise,\" he told me.  "
        },
        {
            "text": "Corryn was also successful in applying for support through the IPO’s IP Audit and IP Access financial support schemes, delivered through Welsh Government.  IP Audit provided funding towards the cost of an audit of Corryn’s IP assets, conducted by an IP professional, which helped Luke to better understand the IP held within the business and provided recommendations on a way forward.  "
        },
        {
            "text": "Our free Guidance on ‘Seeking intellectual property advice’ can help you to find the right advice and advisor to help protect your invention or business. "
        },
        {
            "text": "So, what’s next for Corryn and its IP?  “Our next big step is fundraising our Series A round. This will allow us to bring the technology through our first in-human trials and our pivotal clinical trials to allow us to achieve regulatory approval and bring our innovation to market in Europe. We can then begin treating patients with chronic and complex wounds.” "
        },
        {
            "text": "Want to explore more fascinating IP stories from innovative businesses like Corryn Biotechnologies? Subscribe to our blog for regular insights into how businesses protect and leverage their IP delivered straight to your inbox.  "
        }
    ]
}