{
    "url": "https://civilservice.blog.gov.uk/2023/01/23/around-the-world-in-28-days-for-active-wellbeing/",
    "title": "Around the world in 28 days for Active Wellbeing ",
    "authors": [
        "Max Bazeley"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-01-23T09:34:44+00:00",
    "content": [
        {
            "heading": 3,
            "text": "New Year, but could it be a whole new you? Matt Bazeley says it’s time to kickstart Active Wellbeing Month to get moving and recapture your mojo!"
        },
        {
            "text": "Active Wellbeing is back for its fifth year, helping civil servants make positive lifestyle changes and get active.  For the first time the Active Wellbeing campaign runs for a whole month to give everyone the time to create a really positive change to how they get moving. "
        },
        {
            "text": "I am Matt Bazeley and as the Chief Executive of Civil Service Sports Council (CSSC) and we’re delighted to once again be working with CSHR to deliver this year’s Active Wellbeing campaign, encouraging everyone across the civil service and public sector to improve your  health, happiness, energy and work-life balance. "
        },
        {
            "text": "I know that I feel energised, more positive and more focused if I am regularly exercising. But it’s also true that exercise can provide that few minutes to step away from work pressures, connect with friends and family and invest in “you”.  "
        },
        {
            "text": "The start of a new year is an opportunity to reset and form healthier wellbeing habits. We know that physical activity plays such an important part in our overall wellbeing and so this year for the first time ever, Active Wellbeing will run for a full month, from 1-28 February to create as much of a positive impact as possible for as many people as we can."
        },
        {
            "text": "Participants can now sign up for the Around-the-World 28-day challenge, where they’ll virtually travel around the globe through six continents, 70 countries and more than  90,000 kilometres in teams. Making a positive commitment to a challenge like this with colleagues and friends is a great way to collaborate with friends and colleagues as you seek to stick to your goals and every step you take, sport you play or activity you do will count towards your team total. "
        },
        {
            "text": "Active Wellbeing has run every year since 2018, with the main goal being to get the Civil Service more physically active and improve their wellbeing.  The campaign has proved a great way to have fun with your colleagues and motivate each other to implement a healthy balanced lifestyle. "
        },
        {
            "text": "Even If you don’t have a team, you can still get involved and join one of the ready-made teams as you and they travel around the globe, with the chance to pick up prizes along the way including smart watches, experience vouchers and sports equipment."
        },
        {
            "text": "This year we have something for everyone. With so many working remotely or distributed across offices around the country, it can be hard to feel connected with others, but we hope that Active Wellbeing brings people together in a positive and proactive way."
        },
        {
            "text": "CSSC is here to support your active wellbeing journey, with lots of tools and resources to suit your individual needs. From step by step guides, expert advice, and new ideas to help you get active, get connected and get you around the world.  You can find a full list of resources available here: https://activewellbeing.me.uk/ "
        },
        {
            "text": "About CSSC:"
        },
        {
            "text": "CSSC is an exclusive not-for-profit membership organisation inspiring over 140,000 civil servants and public sector workers from across the UK to explore new ways to be active and healthy through - everyday savings, offers to get active and amazing days out."
        }
    ]
}