{
    "url": "https://deframedia.blog.gov.uk/2023/01/23/coverage-of-plans-to-introduce-a-deposit-return-scheme/",
    "title": "Coverage of plans to introduce a Deposit Return Scheme",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "plastic"
    ],
    "pub_date": "2023-01-23T11:21:31+00:00",
    "content": [
        {
            "text": "There has been widespread coverage including The Times, BBC Online, the Financial Times, the Guardian, the Independent, I News, the Daily Mirror, the Daily Mail, and the Daily Express of our plans to introduce a Deposit Return Scheme for drinks containers in England, Wales and Northern Ireland from October 2025."
        },
        {
            "text": "Our announcement on Friday confirmed the next stages of the scheme’s introduction – including the implementation timeline, the sizes of drinks containers covered by DRS, and the materials in scope."
        },
        {
            "text": "Times Radio, LBC and Bauer Media all ran interviews with Environment Minister Rebecca Pow on the scheme, as well as the Government’s wider ambitions to tackle pollution and increase recycling under our Collection and Packaging reforms."
        },
        {
            "text": "Every year UK consumers go through an estimated around 14 billion plastic drinks bottles and nine billion drinks cans, many of which are littered or condemned to landfill."
        },
        {
            "text": "The new scheme, covering England, Wales and Northern Ireland, is set to be introduced in 2025, following extensive work with industry to prepare for the necessary changes – including setting up infrastructure and amending labelling. It aims to ensure 85% fewer drinks containers are discarded as litter after three years of its launch."
        },
        {
            "text": "These plans build on efforts to eliminate avoidable plastic waste. Last week the UK government announced that a ban on single-use plastic plates, trays, bowls, cutlery, balloon sticks, expanded and extruded polystyrene food and drinks containers, including cups, will be introduced in England from October 2023."
        },
        {
            "text": "Environment Minister Rebecca Pow said: "
        }
    ]
}