{
    "url": "https://educationhub.blog.gov.uk/2023/01/23/lifesaving-defibrillator-deliveries-begin-for-all-schools-that-need-one/",
    "title": "Lifesaving defibrillator deliveries begin for all schools that need one",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-01-23T14:25:02+00:00",
    "content": [
        {
            "text": "Oliver King died aged just 12 years old when he suffered a cardiac arrest while taking part in a swimming race in 2012."
        },
        {
            "text": "There is clear evidence showing that defibrillators drastically increase the chance of survival from a cardiac arrest – meaning if a defibrillator had been available then, Oliver could have survived."
        },
        {
            "text": "Since then Mark King, Oliver’s dad, has campaigned for defibrillators to be made more widely available. Last year, following a meeting with Mark we committed to looking at how every school could have a defibrillator."
        },
        {
            "text": "Defibrillators have the potential to save the lives of pupils, staff and visitors in schools, with research showing that accessing these devices within 3-5 minutes of a cardiac arrest increases the chance of survival by over 40%."
        },
        {
            "text": "It’s particularly important that they are available close to sports halls and playing fields that children, young people, and the wider community use daily."
        },
        {
            "text": "The first defibrillators were issued to schools on 20 January marking the start of a roll out of over 20,000 devices to almost 18,000 state-funded schools in England. The rollout is expected to be complete by the end of the academic year."
        },
        {
            "text": "Garden Suburb Junior School in Barnet was one of the first schools to receive a defibrillator, which coincided with Year 6 pupils learning about the heart and the circulatory system in science. As part of the lesson, one of the questions pupils are asked to consider is ‘what happens if the heart stops’. The teachers at the school discussed with the children that all schools would now be getting a defibrillator and they were shown where the defibrillator is located at their school."
        },
        {
            "text": "Eileen Bhavsar, headteacher at Garden Suburb Junior School commented:"
        },
        {
            "text": "“As defibrillators are becoming more visible and available, it is important that we are all educated about them and how they could save a life."
        },
        {
            "text": "“Moving forward we will continue to incorporate a discussion about defibrillators into the children’s learning about science and first aid."
        },
        {
            "text": "“This knowledge will hopefully contribute to saving a life in the future.”"
        },
        {
            "text": "This is the largest defibrillator programme in England to date and will ensure that pupils and staff have access to this lifesaving first aid equipment, it will also help to produce a generation of young people who feel able and confident to use this life saving equipment."
        },
        {
            "text": "Mark King, founder of the Oliver King Foundation, said:"
        },
        {
            "text": "\"This is a landmark moment and will be welcomed by pupils, parents and teachers up and down the country."
        },
        {
            "text": "“It is a proud day for us because we've campaigned for schools to have access to defibrillators for over a decade. It is a major victory for the Oliver King Foundation."
        },
        {
            "text": "“Defibrillators save lives and I have no doubt that lives will now be saved so that families do not have to suffer the heartbreak of unnecessarily losing a child. This is for our Ollie.\""
        },
        {
            "text": "Since meeting Mark, we’ve also worked with the Oliver King Foundation and other leading charities, including the British Heart Foundation, Resuscitation Council UK and St John Ambulance, to update our defibrillator guidance, which will give schools the tools and knowledge they need to use their new defibrillators."
        },
        {
            "text": "The updated guidance can be found at https://www.gov.uk/government/publications/automated-external-defibrillators-aeds-in-schools"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}