{
    "url": "https://lifeathmrc.blog.gov.uk/2023/01/23/my-journey-as-an-international-working-at-hmrc/",
    "title": "My journey as an international working at HMRC",
    "authors": [
        "Prerna"
    ],
    "categories": [
        "General",
        "Guest blog",
        "Recruitment"
    ],
    "pub_date": "2023-01-23T14:06:37+00:00",
    "content": [
        {
            "heading": 2,
            "text": "About me "
        },
        {
            "text": "Hi, I’m Prerna - I would like to share my experiences as an international working for HMRC.  "
        },
        {
            "text": "I moved to the UK from India in 2017 with my husband. In India, I worked as an Interior Designer for more than a decade, but I really struggled to find a job in interior design in the UK. I had no other choice but to look for work in hospitality or retail to earn money, as during that time, my husband was studying for his master's degree. "
        },
        {
            "heading": 2,
            "text": "Applying for a role at HMRC "
        },
        {
            "text": "I worked in a restaurant for almost 2 years until one day a friend informed me that I was eligible to work in the Civil Service because I come from India, a Commonwealth country.  "
        },
        {
            "text": "Without any delay, I started looking for opportunities and found an opening at HMRC. The entire recruitment process took less than a month and I was offered a position as a Customer Service Advisor.  "
        },
        {
            "text": "I have been a Civil Servant for over 3 years and am currently working as a Recruitment Officer at HMRC. It is a job I am proud of and offers an excellent working environment where I can grow and develop my career. I am grateful that my efforts are valued by colleagues at HMRC. "
        },
        {
            "heading": 2,
            "text": "Come and join our team "
        },
        {
            "text": "The motivation for writing this blog is to bring awareness amongst people like me who come from UK Commonwealth countries and are unaware that they are eligible to work as a civil servant. I have helped many internationals from my community and beyond apply for Civil Service jobs, and I am pleased that some of those people have secured positions at HMRC. "
        },
        {
            "text": "I want to encourage people to come and join this wonderful, multicultural, and inclusive work culture and build their career. For me, HMRC has shown a deliberate act of welcoming and valuing diversity and equality. I feel accepted and motivated to work more productively and openly. HMRC encourages me to be myself at work and every day I feel so proud to work here.  "
        },
        {
            "text": "If you would like to discover what vacancies we currently have on offer, please visit our website.  "
        }
    ]
}