{
    "url": "https://defrafarming.blog.gov.uk/2023/01/23/slurry-infrastructure-grant-time-to-apply/",
    "title": "Slurry Infrastructure grant: time to apply",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-01-23T10:29:00+00:00",
    "content": [
        {
            "text": "At the end of this month, the first round of the Slurry Infrastructure grant will close for applications. So, if you haven’t yet applied, now is the time to. "
        },
        {
            "text": "In this post, I’ll give you a recap of the grant and the process to apply before 31 January. "
        },
        {
            "heading": 2,
            "text": "The Slurry Infrastructure grant "
        },
        {
            "text": "The Slurry Infrastructure grant is designed to help you improve or expand your slurry storage capacity to 6 months and improve the use of organic nutrients on your farm. "
        },
        {
            "text": "You can use the grant to pay for: "
        },
        {
            "text": "You can use the grant to replace stores that are no longer fit-for-purpose, build additional storage or expand an existing store."
        },
        {
            "text": " The grant will also contribute towards the costs of impermeable covers and supporting equipment. "
        },
        {
            "text": "The minimum grant you can apply for is £25,000. The maximum grant is £250,000 for each applicant business."
        },
        {
            "heading": 2,
            "text": "Applying for a Slurry Infrastructure grant "
        },
        {
            "heading": 3,
            "text": "Step 1: Take a look at the guidance"
        },
        {
            "text": "The full Slurry Infrastructure grant guidance can be found on GOV.UK."
        },
        {
            "text": " It sets out:"
        },
        {
            "text": "Last month, we held a webinar to discuss the grant. I'll embed the view below."
        },
        {
            "text": "I’ve also blogged about the grant before. If you click on my name at the top of this page, you’ll see my previous posts."
        },
        {
            "heading": 3,
            "text": "Step 2: Use the online checker "
        },
        {
            "text": "The first part of the application process is an online checker. You’ll find it on the Slurry Infrastructure grant page on GOV.UK. "
        },
        {
            "text": "It's important to be accurate about your slurry storage needs and project plans. "
        },
        {
            "text": "The Rural Payments Agency (RPA) and the Environment Agency created guidance to help you plan your slurry storage. "
        },
        {
            "heading": 3,
            "text": "Step 3: Assessment "
        },
        {
            "text": "Once the online checker closes, the RPA will look at how many projects can be funded. "
        },
        {
            "text": "If the scheme is oversubscribed, the RPA will identify the applications with a higher environmental benefit. This will be based on the priority areas shown in MAGIC. "
        },
        {
            "text": "This will be based on location and proximity to areas where action is most needed to reduce pollution from agriculture."
        },
        {
            "text": "You can read about how we’ll do this in detail. "
        },
        {
            "heading": 3,
            "text": "Step 4: Full application"
        },
        {
            "text": "If you are invited to make a full application, you will be asked further questions about your project. "
        },
        {
            "text": "It's important that you don’t start your project until your grant funding agreement is in place."
        },
        {
            "text": "You can certainly get quotes and apply for planning permission, but you cannot pay for any eligible items or start construction. "
        },
        {
            "heading": 2,
            "text": "Coming up"
        },
        {
            "text": "I'll explain how we completed the shortlisting after the checker closes, so do subscribe to the blog. "
        }
    ]
}