{
    "url": "https://defradigital.blog.gov.uk/2021/06/25/applying-for-content-design-roles-at-defra/",
    "title": "Applying for content design roles at Defra",
    "authors": [
        "Jeni Street"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "Defra services",
        "Digital transformation"
    ],
    "pub_date": "2021-06-25T09:28:37+01:00",
    "content": [
        {
            "text": "I wanted to share a few things I’ve learned about applying for content design roles over the years. I’ve been lucky that I’ve worked with people who have shared these hints and tips with me along the way. They should not be secret, though."
        },
        {
            "text": "We’re in the process of hiring more content designers at Defra. We need our content community to be more diverse, because diverse teams are successful teams. We need the people working on our content to reflect the users we’re designing for and the society we’re serving. "
        },
        {
            "text": "I hope this helps you and encourages you to press that final ‘Apply’ button. And if you know all of this already, what tips, tricks and techniques could you share with others?"
        },
        {
            "heading": 2,
            "text": "Is content design for me?"
        },
        {
            "text": "But first, what is content design? Content designers help people get the information they need, in the way they need it. They make sure it’s easy to find, and easy to use and understand. "
        },
        {
            "text": "Colleagues at Government Digital Service have written a great blog post on moving into content design. You can also:"
        },
        {
            "text": "I found my way into content design by accident really. I was working in a contact centre and knew some people were calling us because they could not find what they needed or could not make sense of online guidance. "
        },
        {
            "text": "I was editing internal guidance for contact centre colleagues to read and use while talking to people - it had to be concise and quick to scan. Why wasn’t the website just as simple? I wanted to be a part of making it better for the people who used it."
        },
        {
            "text": "One of the things I love most about content design is the community. They have genuine passion for designing for the people who need it most and a willingness to share what they’ve learned. Everything I know about content design I’ve learned from others along the way. "
        },
        {
            "heading": 2,
            "text": "Get past your imposter syndrome"
        },
        {
            "text": "For some, the first hurdle will be thinking you’re good enough and not feeling like an imposter. Personally, it takes all my will not to persuade myself out of doing an application each time I write one."
        },
        {
            "text": "I want to echo the words of Janet Hughes, one of Defra’s Programme Directors, when tweeting about other Defra roles:"
        },
        {
            "text": "“If you know deep down that you are in fact qualified to do these roles, but are reading any of the application packs and are not sure if you meet the criteria, then I implore you: send your imposter syndrome to sit outside and think about its behaviour. We'd love you to apply.”"
        },
        {
            "text": "If you read a role description and really want the job, I urge you to apply - even if you only have half the skills and experience. We're looking for people with enthusiasm and a passion for user needs, not someone who necessarily ticks all the boxes."
        },
        {
            "heading": 2,
            "text": "Write for your recruiter’s needs"
        },
        {
            "text": "The first time I sat on the other side of the fence and sifted job applications, I realised how much less time people spend reading an application compared with the amount of time I would spend crafting it.  Quite crushing really."
        },
        {
            "text": "It made me change my approach. I’m now much more methodical in writing job applications and think of the recruiter’s needs:"
        },
        {
            "text": "If an application needs a statement, before I write anything I:"
        },
        {
            "text": "This process helps me to frame my examples around what people are looking for."
        },
        {
            "heading": 2,
            "text": "Getting started with the STAR method"
        },
        {
            "text": "Earlier in my career a colleague told me about using the STAR method. I had assumed it was well-known but I chatted with a colleague recently who hadn’t heard of it. It dawned on me that it’s one of those things you only know if someone tells you. STAR stands for:"
        },
        {
            "text": "The STAR method is a great way to structure examples in your application and answers to interview questions. It will help you to highlight how you put your skills and experience to use. "
        },
        {
            "text": "The job advert will say how we’ll assess your application. We use success profiles to make sure our recruitment is fair and inclusive. "
        },
        {
            "heading": 2,
            "text": "Spell out the context: ‘So what?’"
        },
        {
            "text": "A mentor once said ‘so what’ to me when reading some of my examples.  Ouch."
        },
        {
            "text": "Their point was that the person reading the application will not have the same context that you do in your head. "
        },
        {
            "text": "You’ll need to spell out why what you did was kind of a big deal! Explain the situation and show the importance of the task. Spell out what you did and why the outcome was so good to highlight how your approach made all the difference."
        },
        {
            "heading": 2,
            "text": "Get your friends to help"
        },
        {
            "text": "As a content designer, I’m used to sharing what I’ve written with people for them to review and check, and testing to see what works. You cannot be precious about this - you’re not your users."
        },
        {
            "text": "However, I confess to submitting applications close to 23:59 on the day of the deadline without a single soul looking at it. Not recommended."
        },
        {
            "text": "When you start writing, book in a slot with a trusted friend or colleague who you know will be honest (brutal) with their feedback. It will also help give you a deadline for finishing the first draft way before that looming, midnight deadline."
        },
        {
            "text": "And, tedious as it is, the more times you read it with a fresh pair of eyes the more you’ll spot where you can improve. Sometimes we get applications with spelling mistakes and grammatical errors. It can be hard to ignore those as a content designer!"
        },
        {
            "heading": 2,
            "text": "Defra is great"
        },
        {
            "text": "I remember being out in the countryside with my son when I received an email about getting an interview at Defra. "
        },
        {
            "text": "Past the first hurdle, but no time to feel relieved. Now to worry about the interview (maybe that’s another blog post)."
        },
        {
            "text": "I joined in December and have really enjoyed being part of the supportive content community. Everyone’s ideas are welcomed and we work together to solve problems. And the content we work on is so varied and interesting, one day could be working on technical guidance on regulations on the restriction of hazardous substances and another on visiting green spaces while there are coronavirus (COVID:19) restrictions."
        },
        {
            "text": "Remember you do not need to have all of the skills and experience listed to put in an application. If you think you have what we’re looking for, we’d love to hear from you. "
        },
        {
            "heading": 2,
            "text": "Look out for content design roles"
        },
        {
            "text": "We’re recruiting for Content Designers now. Why not come and join us.  "
        }
    ]
}