{
    "url": "https://ukhsa.blog.gov.uk/2021/06/25/breastfeeding-celebration-week-supporting-mothers-who-breastfeed/",
    "title": "Breastfeeding Celebration Week – supporting mothers who breastfeed",
    "authors": [
        "Wendy Nicholson",
        "Greta Hayward"
    ],
    "categories": [
        "Giving children and young people the best start in life",
        "Nursing"
    ],
    "pub_date": "2021-06-25T10:21:35+01:00",
    "content": [
        {
            "text": "This week is Breastfeeding Celebration Week, and this year we’re focusing on how partners and the wider family can support new mothers to breastfeed. The emotional and practical help can make a huge difference to the breastfeeding experience and opportunity to bond with the new baby."
        },
        {
            "text": "We know breastfeeding delivers health, nutritional and emotional benefits to both the child and mother. The World Health Organisation (WHO) recognises that breastfeeding is a natural process, however it is not always easy and the support to new mothers; family and friends can make a huge difference.  We hope Breastfeeding celebration week provides an opportunity for mothers, partners, families and healthcare professionals to come together to share what works to support breastfeeding."
        },
        {
            "text": "Breast milk is the ideal food for newborns and infants, supplying all the nutrients they need for healthy development. It contains antibodies that help protect infants from common childhood illnesses, such as chickenpox and supports a healthy weight in children. The WHO recognise that children and adolescents who were breastfed as babies are less likely to be overweight or obese. Additionally, children who are breastfed generally engage more with education. There are numerous benefits for women who breastfeed, for example a reduced risk of breast and ovarian cancers."
        },
        {
            "text": "Despite the well documented benefits of breastfeeding and a national ambition to increase breastfeeding rates, within the UK we still have some of the lowest breastfeeding rates in the world. Eight out of ten women in the UK stop breastfeeding before they want to. If we as health care professionals, and as a society, are serious about improving breastfeeding rates and supporting women to do so we need to understand why this is the case."
        },
        {
            "text": "Evidence indicates:"
        },
        {
            "text": "The COVID-19 pandemic has brought forward many challenges for parents, but it shouldn’t get in the way of a women’s decision to breastfeed if that’s what they choose. The Joint Committee on Vaccination and Immunisation (JCVI) advise that there are no specific safety concerns identified with any COVID-19 vaccines in relation to pregnancy, but there is a preference that pregnant women have the Pfizer or Moderna vaccines as there is more data on them from the US. The latest Government advice is that pregnant women should be offered COVID-19 vaccines at the same time as people of the same age or risk group, and there’s no requirement to stop breastfeeding in order to be vaccinated against COVID-19. The JCVI has recommended that the COVID-19 vaccines can be received whilst breastfeeding."
        },
        {
            "heading": 2,
            "text": "Supporting breastfeeding mothers "
        },
        {
            "text": "Caring for a newborn baby can be exciting and rewarding but also can be challenging. Partners and the wider family can provide practical help and support to new mothers who are breastfeeding. This might include providing emotional support including encouraging the breastfeeding mother, which can help to build their confidence."
        },
        {
            "heading": 2,
            "text": "What can Healthcare Professionals do?"
        },
        {
            "text": "Midwives and health visitors are skilled practitioners who provide a valuable role in supporting new mothers as they with breastfeed, for example by assisting breastfeeding mothers to position and attach their baby comfortably at the breast. They are effective at enabling new mothers to start and continue breastfeeding and can support them to make informed feeding choices. They are also skilled at including partners and making sure they are involved in the baby’s care giving. Information for healthcare professionals can be accessed on the High Impact Areas website for early years, and the interactive Breastfeeding Townscape. Peer support and helplines are also available, such as the National Breastfeeding Helpline."
        },
        {
            "text": "Healthcare professionals have a vital role in promoting and signposting parents to information and support, empowering them to make choices which promote their child’s health and wellbeing. Start for Life provides parents and parents-to-be with trusted NHS advice on pregnancy, early years and breastfeeding, which health professionals can signpost to new mothers."
        },
        {
            "text": "Health professionals and the wider system including peer supporters or local support do an excellent job of caring for new mothers, but are not available 24 hours a day. PHE’s Breastfeeding Friend (BFF) from Start4Life is designed to help. This tool, together with the range of support materials from Start4Life, can provide breastfeeding information at any time of night or day and support mothers, their partners and families through the challenges they may face."
        },
        {
            "text": "We do hope you will join us during the week and help to celebrate breast feeding on Twitter using #CelebrateBreastfeeding, and share our resources."
        }
    ]
}