{
    "url": "https://gdsgeospatial.blog.gov.uk/2021/06/25/byte-ing-back-better-introducing-a-q-fair-approach-to-geospatial-data-improvement/",
    "title": "“Byte-ing Back Better” - Introducing a Q-FAIR approach to Geospatial Data Improvement",
    "authors": [
        "Callum Irving, Senior Data and Standards Advisor, Geospatial Commission"
    ],
    "categories": [
        "Data",
        "Data Standards"
    ],
    "pub_date": "2021-06-25T13:00:13+01:00",
    "content": [
        {
            "text": "Callum Irving, Senior Data and Standards Advisor, shares the Geospatial Commission’s ambitions to improve access to better location data by making it Q-FAIR - Findable, Accessible, Interoperable, Reusable and of the right Quality that is fit for purpose. Building on the work of the geospatial Data Improvement Programme, the Commission is now launching its Q-FAIR benchmarking process that will drive and track progress across the public sector to make better location data available to more people. This blog is the first in a series that sets out the successes and lessons of the Data Improvement Programme, which the Commission has run in conjunction with its six Partner Bodies, and its Q-FAIR ambitions for the future.   "
        },
        {
            "text": "As I begin to write this blog I am on a train going 125mph hurtling through the great British countryside. Through the wonders of data and technology, I can communicate with colleagues, check my location, and estimate my time of arrival. This allows me to know how much, blog writing time I have before arrival at my destination, and answer the crucial question of whether I have time for another coffee….I do.  "
        },
        {
            "text": "This simple use of geospatial data helped me plan my day, but location data is used to support much wider decisions about our environment, our world. One of the most important questions decision-makers will always ask is where? "
        },
        {
            "text": "The UK’s geospatial data and our geospatial capabilities are first class. We have long known the importance of location data to the public, as was aptly demonstrated in 1854 from Cholera and John Snow’s infamous water pump map, through to today as we have seen similar foundational techniques used to navigate the tricky geo-scape of COVID 19, in conjunction with cutting edge technology, data analytics and expert practitioners. "
        },
        {
            "text": "The UK public sector holds and uses vast quantities of valuable geospatial data that shapes and improves our lives, in often unseen ways.  The Geospatial Commission was set up to ensure that the UK realises the potential economic, social and environmental value of this data. Our six Partner Bodies - British Geological Survey, Coal Authority, HM Land Registry, Ordnance Survey, UK Hydrographic Office and Valuation Office Agency - have location data at their core, and this allows them to innovate and plan for the future of that data.  "
        },
        {
            "heading": 2,
            "text": "Our future is Q-FAIR "
        },
        {
            "text": "Working closely with our Partner Bodies and Defra, the Commission funded a Data Improvement Programme that sought to tackle some of the shared data challenges faced by each of the organisations. The term ‘data improvement’ is very broad, so we adopted the FAIR principles to help structure and communicate our aims; to understand what is needed to make the data more Findable, Accessible, Interoperable and Reusable (FAIR). Using this approach also emphasised the importance of, before you do anything else, ensuring the data is of appropriate Quality and is fit for purpose. In short, improvements to data must be Q-FAIR. "
        },
        {
            "text": "In our Data Improvement Programme, we went beyond the Q-FAIR acronym to establish requirements and recommendations associated with the Q-FAIR principles which we called the Q-FAIR Framework.  This helped us to establish a holistic view of improved data supply from the perspectives of the data itself, the organization creating the data and the organizations as collective suppliers to the UK. "
        },
        {
            "text": "Applying the Q-FAIR Framework in our Data Improvement Programme, therefore, gave us a benchmark of our public sector geospatial supply and enabled us to deliver some significant improvements to the foundations of geospatial data held by our Partners. This has included: "
        },
        {
            "text": "We will be publishing more on each of these initiatives in the coming weeks along with our initial Q-FAIR benchmark of the state of data supply. "
        },
        {
            "text": "Through the data improvement programme, we saw the clear benefits of using the Q-FAIR Framework as a common language between the Geo6, the Geospatial Commission and our wider stakeholders.  It helped to map (if you excuse the pun) the context for data improvements to the identification and realization of the specific actions to bring improvements about. "
        },
        {
            "heading": 2,
            "text": "Building the ambition"
        },
        {
            "text": "We now intend to expand the scope of our ambitions for improved UK public sector geospatial data. Based on the learnings from the DIP we are developing our Q-FAIR Framework through a new programme of work. This programme aims to develop a systemic and sustained approach that will advance the supply of the geospatial data managed by the public sector now and in the future.  This will be achieved through an objective benchmarking against Q-FAIR principles linked to business plans, standards and the regulatory framework to bring improvements about.  We will start with our six Partner Bodies and build-out across the public sector. "
        },
        {
            "text": "This work will not only help us to set our priorities for the future, but it will also enable us to track our collective progress, aligned to national and international initiatives such as the UNs Sustainable Development Goals and Integrated Geospatial Information Framework (IGIF)"
        },
        {
            "text": "The right improvements, to the right data sets, at the right time, and with the right connections to other data, has so much potential.  It will allow us to make the right decisions that will create economic value, enabling the levelling up agenda and serving the country's needs in an intelligent and data-informed way. Resulting in more services that are better informed by location and are tailored for the public across the country wherever you are.  We are looking forward to going on that journey with you!"
        },
        {
            "text": "Sign up to this blog to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}