{
    "url": "https://healthmedia.blog.gov.uk/2021/06/25/covid-19-vaccines-frequently-asked-questions/",
    "title": "Covid-19 vaccines - Frequently asked questions",
    "authors": [
        "emumford"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-25T16:58:36+01:00",
    "content": [
        {
            "text": "Covid-19 vaccines - Frequently asked questions - Updated"
        },
        {
            "text": "Frequently asked questions answered by Deputy Chief Medical Officer, Professor Jonathan Van-Tam"
        },
        {
            "text": "Professor Jonathan Van-Tam (‘JVT’) was appointed Deputy Chief Medical Officer in October 2017. He leads on health protection."
        },
        {
            "text": " "
        },
        {
            "text": "What vaccines are available?"
        },
        {
            "text": "Vaccines protect you and those around you from Covid-19 and make you less likely to pass it on to others. The latest research shows that Covid-19 vaccines are helping us beat covid. They reduce hospitalisations and deaths from Covid-19 and help stop people passing on the virus. Over time, and as the vaccine programme extends, they will help us get back to normal."
        },
        {
            "text": "Following extensive clinical trials and authorisation for use by the independent medicines regulator, the MHRA, safe and effective Covid-19 vaccines are available free to all those aged 18 and over in the UK, following the order of priority advised by the Joint Committee on Vaccination and immunisation (JCVI)."
        },
        {
            "text": "The AstraZeneca (Oxford) vaccine, the BioNTech/Pfizer vaccine and the Moderna vaccine are now available across the UK. Other vaccines are expected to follow later this year. The Johnson and Johnson (Janssen) single-shot vaccine has now been authorised in the UK but supplies won’t be available for several more months. The BioNTech/Pfizer vaccine is now authorised in the UK for children aged 12-15 years but no decision has yet been made about widescale use in this age group."
        },
        {
            "text": " "
        },
        {
            "text": "Professor Jonathan Van-Tam (JVT) adds: “Covid vaccines are made at different speeds by different manufacturers. It is not possible for vaccination centres to choose the stock they are allocated nor is it possible for individuals to choose a vaccine. The vaccines we are using are all approved by the MHRA and they are all good choices. The JCVI does not generally recommend specific vaccines for specific patient groups, apart from adults under 40 where they have said it may be preferable to offer an alternative to the AstraZeneca (Oxford) vaccine, and pregnant women where they have expressed a preference for Pfizer or Moderna because we have data from the US rollout on these vaccines being used for pregnant women. "
        },
        {
            "text": "The results from clinical trials are all different and each company measured slightly different outcomes. But what we are now finding in real life practice is that the vaccines we are using are very effective in preventing admission to hospital with Covid. "
        },
        {
            "text": " "
        },
        {
            "text": "How many people have been vaccinated?"
        },
        {
            "text": "Vaccination numbers are published daily: https://coronavirus.data.gov.uk/details/healthcare"
        },
        {
            "text": " "
        },
        {
            "text": "Who can get the Covid-19 vaccination?"
        },
        {
            "text": "Five groups have already been offered the vaccine and can still come forward if they have yet to receive their jab:"
        },
        {
            "text": " "
        },
        {
            "text": "Tens of millions of people have received their first dose so far and Public Health England estimate more than 14,000 lives have been saved."
        },
        {
            "text": "The NHS is now offering the Covid-19 vaccine to people aged 18 years and over, in line with the advice of the Joint Committee on Vaccination and Immunisation (JCVI)."
        },
        {
            "text": " "
        },
        {
            "text": "How will I know it’s my turn to get a vaccine?"
        },
        {
            "text": "All adults in the UK aged 18 or over are now able to book a vaccination appointment online, or if you cannot access the online booking service, you can call 119."
        },
        {
            "text": "Sometimes the NHS will contact you at short notice if a vaccination slot becomes available, because one of our major priorities is never to waste doses. You will need your ten-digit NHS number, it will be on the letter sent to you. You can also find it on your prescriptions or through your GP online service. If you cannot go to one of the large vaccination centres, you can choose to have your vaccination at your GP surgery when it’s available there, or a pharmacy."
        },
        {
            "text": " "
        },
        {
            "text": "What do I need to bring with me to the vaccination centre?"
        },
        {
            "text": "If you are taking medication, it is really important that you bring a list of these with you to the vaccination centre. Do not bring the medicines themselves. If the doctors and nurses running the clinic can’t be sure what medicines you are on, they may not be able to give you your vaccine."
        },
        {
            "text": "If you are taking a blood thinner called 'warfarin' you will also be going for regular blood tests at the GP or hospital to monitor the thickness of your blood using a test called INR. The INR test result is a number (a common example figure would be 2.5 for someone with thinned blood). Please make sure you know your latest INR reading and when that was last checked; the staff in the vaccine clinics often can’t check this with the GP or hospital at the time."
        },
        {
            "text": "If you don't know this, you can get if from your GP surgery. If you are taking warfarin but we don't know your INR reading it can sometimes mean your vaccination cannot go ahead. The vaccination computers at the centre do not link back to your medical records so we can't look up your result on the day."
        },
        {
            "text": " "
        },
        {
            "text": "Are there any side effects?"
        },
        {
            "text": "Like all medicines, vaccines can cause side effects. Most of these are mild and short-term, lasting no longer than a week (but usually a lot less), and not everyone gets them."
        },
        {
            "text": "These may include:"
        },
        {
            "text": "The MHRA is monitoring the temporal link between blood clots and the AstraZeneca (Oxford) vaccine, with slightly more cases in younger adults. The MHRA concluded that these are extremely rare."
        },
        {
            "text": "As a precaution, if you have any of the below symptoms four days or more after vaccination, you should seek medical advice:"
        },
        {
            "text": "The benefits of vaccination continue to outweigh any risks and they are still the best way to protect people from Covid-19. Everyone should continue to get their vaccination when asked to do so unless specifically advised otherwise."
        },
        {
            "text": " "
        },
        {
            "text": "I have heard it can make people infertile – is this true?"
        },
        {
            "text": "No vaccine has ever affected fertility, and women who are considering starting a family can safely receive the vaccine when they are invited to do so. The theory that immunity to the spike protein could lead to fertility problems is not supported by any scientific evidence. Most people who contract Covid-19 will develop antibody to the spike and there is no evidence of fertility problems after Covid-19 disease. It‘s important to reassure women about the safety of the vaccines. We know that they reduce the risk of serious illness and death from the virus. Covid-19 poses a real risk to health and vaccines are the best way to protect us all from this virus."
        },
        {
            "text": " "
        },
        {
            "text": "JVT adds: “The idea that the vaccine could do this, is a nasty scare story designed to frighten people. It is simply untrue and there is no shred of credible evidence to support the idea. The British Fertility Society (BFS) and Association of Reproductive and Clinical Scientists (ARCS) say there is absolutely no evidence, and no theoretical reason, that any of the vaccines can affect the fertility of women or men. More information on fertility, pregnancy, IVF, and miscarriages can be found here.”"
        },
        {
            "text": " "
        },
        {
            "text": "Covid19 Vaccines FAQs.pdf (britishfertilitysociety.org.uk)"
        },
        {
            "text": " "
        },
        {
            "text": "Can pregnant women have the Pfizer/BioNTech or AstraZeneca (Oxford) vaccines?"
        },
        {
            "text": "The latest advice, from the Joint Committee on Vaccination and Immunisation (JCVI) is that pregnant women should be offered the Covid-19 vaccine at the same time as the rest of the population, based on their age and clinical risk group."
        },
        {
            "text": "It is preferable for pregnant women to be offered the Pfizer-BioNTech or Moderna vaccines where available. This is because data in the US shows that around 90,000 pregnant women have been vaccinated, mainly with mRNA vaccines including Pfizer-BioNTech and Moderna, without any safety concerns being raised."
        },
        {
            "text": "There is no evidence, however, to suggest that other Covid-19 vaccines are unsafe for pregnant women. Women who are planning pregnancy, are in the immediate postnatal period, or are breastfeeding can be vaccinated with any vaccine, depending on their age and clinical risk group."
        },
        {
            "text": "The JCVI has recommended that the vaccines can be received whilst breastfeeding. This is in line with recommendations from the US and the World Health Organization."
        },
        {
            "text": " "
        },
        {
            "text": "Covid-19 vaccination: a guide for all women of childbearing age, pregnant or breastfeeding - GOV.UK (www.gov.uk)"
        },
        {
            "text": " "
        },
        {
            "text": "Why did you change the interval between the first and second dose?"
        },
        {
            "text": "One dose of either vaccine provides a high level of protection from Covid-19."
        },
        {
            "text": "The decision, made in January, to update the dosing interval was based on advice from the JCVI and the UK’s Chief Medical Officers."
        },
        {
            "text": "Having studied evidence the JCVI advised that we should prioritise giving as many people in at-risk groups their first dose, rather than providing two doses in a shorter time."
        },
        {
            "text": "A statement, made in January, about the 12 week dosing interval from the JCVI is available here."
        },
        {
            "text": "Second doses complete the dose and maximise the protection provided."
        },
        {
            "text": "With the Delta variant (first identified in India) becoming increasingly dominant in the UK JCVI has recommended prioritising anyone over 50 who has not yet been vaccinated. Next, it recommends that everyone receives their second dose within eight weeks. This is a clinically approved approach to help save lives. The JCVI is constantly reviewing their advice to ensure we schedule vaccine doses to maximise protection to those most at risk."
        },
        {
            "text": " "
        },
        {
            "text": "JVT adds: “The Delta variant has changed the environment for vaccines in the UK. In the absence of any growing variant the UK would have stuck to its plans to vaccinate with a 12-week interval between doses as recommended by JCVI in January 2021. However, we now know that two doses of vaccine are very much better than one dose for protection against infection with the Delta variant. We now find ourselves in a straight race between finishing the vaccination programme and how quickly the Delta variant will continue to grow. That is why JCVI has now shortened the dosing interval back to 8 weeks as a response to an ever-changing situation."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "I am worried that the extended interval between the first and second doses will mean supplies have run out before I am called back, or I will have to have a ‘mix and match’ alternative vaccine."
        },
        {
            "text": "It is current UK policy that you will get the same type of vaccine for your first and second doses. The NHS keeps a very careful track of the type of vaccine you got the first time in the National Immunisation Management System (NIMS).  When people are called back for their second dose the NIMS tells staff what vaccine to give. The NHS and PHE are managing stock levels very carefully so that the right vaccines are available locally for second doses."
        },
        {
            "text": "However, following the MHRA’s advice about rare cases of blood clotting and the AstraZeneca vaccine (Oxford), anyone who experienced these clots after their first vaccine dose of Covid-19 vaccine AstraZeneca should have a different type of vaccine for their second dose."
        },
        {
            "text": " "
        },
        {
            "text": "JVT adds: “Please don’t worry about getting the right vaccine on your second visit. The NHS has very tight control of this and the JCVI does not currently advise mixing and matching. However, it is true that we are currently performing mix and match research studies. You are not in one of these studies unless you have volunteered and given written consent. But these studies are important and may give us greater flexibility in the long run.”"
        },
        {
            "text": " "
        },
        {
            "text": "Can I do what I want after I have been vaccinated?"
        },
        {
            "text": "It is essential that everyone continues to follow Covid-19 restrictions whether they have had the vaccine or not. It's tough, but really important for now."
        },
        {
            "text": "This means it is important to:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Is protection instant after I've been vaccinated?"
        },
        {
            "text": "Definitely not. Protection from any vaccine takes time to build up. In general, the older you are the longer it takes. It will take at least two weeks in younger people and at least three weeks in older people before you can expect to have a good antibody response. Even then, you must return when called for your second dose. Vaccines offer important protection to reduce risk, but they do not make you invincible. No vaccine offers 100% protection against any disease."
        },
        {
            "text": " "
        },
        {
            "text": "JVT adds: “Having that first vaccine gives people real hope, and it is genuinely uplifting to the spirits and a sign that we can beat this virus. But walking out of the vaccination centre feeling ‘instantly invincible’ is a very serious mistake. Adding to that we now know you need two doses of vaccine for maximum protection against infection with the Delta variant, so it’s vital that you get the all-important second dose”"
        },
        {
            "text": " "
        },
        {
            "text": "How were the vaccines developed so quickly?"
        },
        {
            "text": "The vaccines that are authorised have been through three stages of clinical trials and have been tested on tens of thousands of people around the world. A Phase 3 Covid vaccine trial typically involves 30,000 to 40,000 patients."
        },
        {
            "text": "The trial phases were organised to overlap, speeding up the overall time of vaccine production, but without cutting any corners on trialling the vaccine and ensuring it meets strict standards of safety and effectiveness."
        },
        {
            "text": " "
        },
        {
            "text": "Time has also been gained because:"
        },
        {
            "text": "The University of Oxford, has created a video about 'How to make a vaccine in record time'"
        },
        {
            "text": " "
        },
        {
            "text": "Are there animal products in the vaccine?"
        },
        {
            "text": "No. The MHRA has confirmed that the Covid-19 Vaccine AstraZeneca, Pfizer/BioNTech Covid-19 vaccine and Moderna vaccine do not contain any components of animal origin."
        },
        {
            "text": " "
        },
        {
            "text": "How do I know it has been widely tested on people like me?"
        },
        {
            "text": "Each of the vaccines are tested on tens of thousands of people across the world. They are tested on both men and women, on people from different ethnic backgrounds, and of all ages between 18*-84."
        },
        {
            "text": "(some companies have data down to 16 years of age)*"
        },
        {
            "text": "Pfizer/BioNTech clinical trials took place in the US, Europe, Turkey, South Africa and South America. Approximately 42% of global participants and 30% of US participants had racially and ethnically diverse backgrounds"
        },
        {
            "text": "AstraZeneca trials took place in the UK, Brazil and South Africa. The non-white demographic in the UK trial was 7.1%. In the Brazil trial it was 31.4% and in South Africa it was 87%."
        },
        {
            "text": " "
        },
        {
            "text": "JVT adds: “This virus does not care how old you are, what ethnicity you are or where you live. It is a danger to the whole of society. The trials included many people from non-white ethnic backgrounds and there is no evidence at all that the vaccines work differently or are more or less safe in different ethnicities.”"
        },
        {
            "text": " "
        },
        {
            "text": "How do we know the vaccines protect people from Covid-19?"
        },
        {
            "text": "The Pfizer / BioNTech, Moderna and AstraZeneca (Oxford) vaccines have been shown to provide a high level of protection from symptomatic Covid-19."
        },
        {
            "text": "The latest research shows that Covid-19 vaccines are helping us beat covid. They reduce hospitalisations and deaths from Covid-19 and help stop people passing on the virus."
        },
        {
            "text": "As vaccination programmes roll out globally, our understanding of the effectiveness of each vaccine on disease, serious disease, death and transmission will increase, and these data will be used to develop advice on the next phase of the programme."
        },
        {
            "text": "As of June data shows:"
        },
        {
            "text": " "
        },
        {
            "text": "Imperial College London and Ipsos MORI showed in the REACT-1 study (8 April) that fewer infections may have led to fewer deaths since the start of the government’s vaccination programme with infections falling by 60% between February and March"
        },
        {
            "text": "There is evidence from the SIREN study in healthcare workers that the Pfizer vaccine is approximately 70% effective at protecting against both symptomatic and asymptomatic infections combined, out to 35 days after the first dose and that two doses increase effectiveness to 85%"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Every single vaccine authorised for use in the UK has been authorised by the MHRA and the three parts of any authorisation are a safety assessment, an effectiveness assessment and a manufacturing quality assessment."
        },
        {
            "text": " "
        },
        {
            "text": "JVT adds: “We can now be much more confident in saying the effects of vaccination are quite startling and could lead us to a much more normal way of life again. That is only going to work if vaccine uptake remains high so it’s vital that when you are called you come forward for your first and then your second dose. Please keep to the appointment time you are given because often these vaccines cannot go back into the fridge for the next session. They are so precious; every single one matters, so we cannot afford to waste them. And if you are on regular medications, bring a list of these along (or a note on your phone); the duty medical supervisor may need to check them before your vaccination can go ahead.”"
        },
        {
            "text": " "
        },
        {
            "text": "What is the government doing to stop vaccine fraud?"
        },
        {
            "text": "The vaccine is only available free from the NHS. At no point will a patient be asked to pay. Do not accept offers for ‘private, chargeable’ vaccines from private providers as UK, MHRA authorised vaccines are only obtainable via the NHS."
        },
        {
            "text": "Advice from Action Fraud:"
        },
        {
            "text": "25 June 2021"
        },
        {
            "text": " "
        }
    ]
}