{
    "url": "https://socialcare.blog.gov.uk/2021/06/25/giving-assurances/",
    "title": "Giving assurances",
    "authors": [
        "Suzanne Elwick"
    ],
    "categories": [
        "Care and support",
        "coronavirus"
    ],
    "pub_date": "2021-06-25T12:54:24+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Meet the Regional Assurance Team"
        },
        {
            "text": "In the midst of an ongoing public health crisis, it would be trite to speak of silver linings, but if the coronavirus pandemic has proven anything, it’s the ability of individuals and organisations to come together in new, positive ways."
        },
        {
            "text": "I am a social worker by background, on secondment to the Department of Health and Social Care (DHSC)’s regional assurance team. The team was initially set up to support the delivery of the Adult Social Care Winter Plan and staffed by people on secondments or short term contracts."
        },
        {
            "text": "Everyone in the team comes from an adult social care background. It includes Care Quality Commission (CQC) colleagues, care providers, ex directors of adult social care, care and health improvement advisors and senior nurses. There is a regional assurance lead in every English region."
        },
        {
            "text": "If you’ve not met us already, we act as a conduit between DHSC and local areas. We use our experience and knowledge of the adult social care sector to provide informed assessments to the Department and the Minister for Social Care. We also provide opportunities for the sector to influence and inform DHSC about the way current policies are working at local level."
        },
        {
            "text": "Team members have recently been recruited to further 12-month secondments, allowing the team to continue to provide support around COVID-19, the social care reform agenda, and the development of an assessment framework for adult social care."
        },
        {
            "heading": 2,
            "text": "From the regions to the centre"
        },
        {
            "text": "I’ve come from the London Borough of Waltham Forest, where I am Head of Strategic Partnerships, leading on the safeguarding children and adults board, the community safety partnership and the health and wellbeing board. I was really keen to use my extensive experience and knowledge of the sector to help local areas like mine and DHSC work together more effectively."
        },
        {
            "text": "The work is varied – from providing assessment and analysis of the extensive work underway to support vaccine uptake among care colleagues, to talking to providers about how they are using the infection control fund to support their workforce. We also collect data on managing care home outbreaks and the effectiveness of the action plan in supporting care teams to mitigate them."
        },
        {
            "text": "Looking back over the last couple of months, there has been two particular times when my breath has been taken, for very different reasons."
        },
        {
            "text": "The first was a few months ago in a multi-agency health and social care meeting. We were reviewing data presented by Public Health England, showing rates of COVID-19 infection."
        },
        {
            "text": "As we looked at the data, we realised, for the first time, it was showing a decrease in infection rates for people aged over 80 years, as a result of vaccination. This was exciting and really moving, especially as everyone had been working together for more than a year to protect and support people. This felt like a real turning point in the fight against coronavirus."
        },
        {
            "text": "The second was when a similar group of people were reviewing data for London, down to borough level, on positivity rates and variants of concern. The partnership’s approach is always to look for different ways to tackle an issue and evolve the response. This has led to the development of a new process where any positive tests are treated as variants of concern. All positives are sent off to labs for genome sequencing."
        },
        {
            "heading": 2,
            "text": "Focused local collaboration"
        },
        {
            "text": "This ‘hyper local’ approach involves multi-agency collaboration between local authorities, Public Health England, and health services to provide a wraparound response to areas reporting high levels of positive tests."
        },
        {
            "text": "In this way, provision can be made for enhanced track and trace, easier access to self-isolation funds, additional support to increase vaccine uptake and, in some boroughs, hotels to support households needing to separate into positive and negative groups."
        },
        {
            "text": "This approach is now underway in many areas in London and across the country, directly delivering thousands of vaccines across the generations, which is fantastic."
        },
        {
            "text": "While our regional presence is helping to join the dots between Whitehall and local action during a very particular public health crisis, I hope the good relationships we’ve formed now will grow in strength in a post-pandemic world."
        }
    ]
}