{
    "url": "https://mojdigital.blog.gov.uk/2021/06/25/introducing-the-service-design-playbook/",
    "title": "Introducing the service design playbook",
    "authors": [
        "Mahnaz Yusaf"
    ],
    "categories": [
        "service design"
    ],
    "pub_date": "2021-06-25T12:02:42+01:00",
    "content": [
        {
            "heading": 3,
            "text": "The service design playbook is a resource to help designers and digital teams navigate designing public services."
        },
        {
            "text": "The goal of the service design playbook is to help designers that are new to service design in government understand how to apply service design thinking at each stage of product delivery and how to work with others in a multi-disciplinary team. It's the collective knowledge and experience of many of the service designers at the Ministry of Justice brought together to support other designers across the organisation."
        },
        {
            "heading": 2,
            "text": "Aligning the design approach across MoJ"
        },
        {
            "text": "We’ve scaled. Fast. In the last 18months, we have grown by 500% to a community of nearly 100 designers. We needed to standardise best practice and develop consistency in approach across our rapidly growing portfolio of work."
        },
        {
            "text": "One of my favourite descriptions of service design is working with users and delivering services, and there are many frameworks and processes that exist in helping us achieve this.  The double-diamond method and the Stanford school design thinking process are just a couple of the ones out there."
        },
        {
            "text": "The playbook doesn’t recreate existing tools, but embeds them and supports designers to know how and when to apply them. While, as designers, we might not follow a set procedure in government, we have the frameworks in the GOV.UK Service Manual and the Service Standard that acts as a great starting point in understanding the mechanics of creating and running good public services. "
        },
        {
            "text": "The Service Design Playbook builds on the theory shared in these resources and provides additional practical approaches to designers as they navigate the service stages (discovery, alpha and beta)."
        },
        {
            "heading": 2,
            "text": "What if our services are non-traditional?"
        },
        {
            "text": "During my year at the Ministry of Justice, I've recognised the complexity in designing digital prison and probation services and the particular challenges our teams overcome. "
        },
        {
            "text": "Our services are not always public-facing and are often created to solve challenges for staff that work in highly pressured environments. "
        },
        {
            "text": "We have numerous prisons that all run slightly differently, and the complexity of technical constraints feels very real. We’re reminded on a daily basis that design is always political. Prisoners and people on probation serve a sentence rather than choose to use a service. Between their needs and those of the general public, our staff and our members of parliament - it’s not always easy to know which user lays at the heart of our designs and who the service is really for.  "
        },
        {
            "text": "Our service users are diverse, yet a thread ties them. They are affected by, care for, or are responsible for people who, in turn, are experiencing a vulnerable and distressing period in their lives. "
        },
        {
            "text": "I designed the playbook with all of this in mind. How do we approach the design of complex services that range from web pages to monolith legacy systems? How do we navigate the creation of services that impact people and staff across various prisons? "
        },
        {
            "text": "I collaborated with designers across the Ministry of Justice through a series of workshops and gathered our collective experiences to form the guidance shared in the playbook. The playbook prompts designers at each stage of the delivery process, from exploration to beta, to think about how they can collaborate with teams and stakeholders to deliver a service. "
        },
        {
            "text": "Whether it's looking at problem space and service users, exploring the policy space, to thinking about accessibility - there are tried and tested ideas and methods available to use at each step of every design phase. They include directions of when to use them and why. "
        },
        {
            "heading": 2,
            "text": "How do we describe our work to our teams?"
        },
        {
            "text": "I joined the Ministry of Justice from a mainly non-government background. It took a little time to navigate my role and understand the cross-overs of my responsibilities with others in a multidisciplinary team."
        },
        {
            "text": "Whilst the  Digital, Data and Technology capability framework is a helpful introduction to all the professions and disciplines, I recognised the gap in guidance of how these disciplines worked best together to design the service end-to-end. There are seven roles within the user-centred design family and most designers often wear many (multi-disciplined) hats. So, where did the role of a service designer fit amongst all of our wonderful disciplines? Furthermore, how do we describe our part to our team members? "
        },
        {
            "text": "It’s a critical and challenging part of our role. Our work hinges on the collaboration of many disciplines. To offer the most value, we need to articulate our methods and build trust amongst the team. Only by convincing the team to spend time and energy in the process, do we encourage them to take it with us."
        },
        {
            "text": "The ‘ introduction to the team’ section of the playbook aims to help service designers articulate our work and give multidisciplinary teams (and us) a better understanding of our role in government. This section shares the outcome of our work, how we achieve the outcomes, and the people we collaborate within the process."
        },
        {
            "heading": 2,
            "text": "Please help us improve the service design playbook."
        },
        {
            "text": "What we have in the playbook is just the start. We will continue to develop it as we learn."
        },
        {
            "text": "We would welcome feedback on the playbook, which you can share via email, or through comments on the playbook via Miro. We have lots of ideas on developing this further, and if you'd like to be part of that journey - we'd love to hear from you. "
        }
    ]
}