{
    "url": "https://space.blog.gov.uk/2021/06/25/strengthening-space-ties-between-the-uk-and-japan/",
    "title": "Strengthening space ties between the UK and Japan",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Business",
        "International"
    ],
    "pub_date": "2021-06-25T17:09:31+01:00",
    "content": [
        {
            "text": "Today, the UK Space Agency signed a Memorandum of Cooperation with the Japanese Aerospace Exploration Agency (JAXA), taking a new step in space cooperation between the UK and Japan."
        },
        {
            "text": "Dr Graham Turnock (CEO of the UK Space Agency) and President Yamakawa (JAXA) attended the signing ceremony, from the Embassy of Japan in London and the Embassy of the United Kingdom in Tokyo, respectively, alongside the Ambassadors of both nations: H.E. Ms Julia Longbottom and H.E Mr Hayashi Hajime."
        },
        {
            "text": "Almost a decade after the first Memorandum of Cooperation on space activities was signed between Japan and the UK, this new commitment renews and strengthens the relationship between both countries, in areas such as research and development, exploration, and the safe and sustainable use of space. Following the recent G7 commitments from both Japan and the UK on the same theme, this cooperation between our two nations feels particularly timely."
        },
        {
            "heading": 3,
            "text": "UK and Japan in space"
        },
        {
            "text": "The UK and Japan have a proud shared history of collaboration in space, where our partnership has driven new exploration and innovation."
        },
        {
            "heading": 3,
            "text": "A collaborative future"
        },
        {
            "text": "Today’s signing of the Memorandum of Cooperation will build on these achievements, further boost space relations between the UK and Japan, and allow our space industries and experts to collaborate ever closer to push boundaries and benefit our planet and its people."
        },
        {
            "text": "The signing of the Implementing Arrangement today between JAXA and the UK’s Defence Science and Technology Laboratory (DSTL) is testament to the collaborative research on space situational awareness between our two countries, and we hope this collaboration will be the first of many for the UK and Japan. In the context of today’s challenges, from COVID-19 to climate change, the use of space to deliver real change for our planet and its people matters more than ever."
        },
        {
            "text": " "
        }
    ]
}