{
    "url": "https://civilservice.blog.gov.uk/2021/11/08/civil-service-blog-surpasses-4000-subscribers/",
    "title": "Civil Service Blog surpasses 4,000 subscribers",
    "authors": [
        "Lorraine McBride"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-08T13:54:59+00:00",
    "content": [
        {
            "heading": 3,
            "text": "As the Civil Service Blog breaks a new milestone, here’s how you too can get current, high-quality blog posts straight to your inbox."
        },
        {
            "text": "Since last summer, the Civil Service Blog has quietly undergone a transformation, and it’s paying off! Latest figures reveal we’ve notched up over 4,300 loyal subscribers to date and growing by hundreds of new followers every month."
        },
        {
            "text": "We’ve commissioned more bloggers, doubled the number of posts and trebled the number of eye-catching images for extra oomph. You can also find updates on our posts via the Civil Service LinkedIn, Instagram and Facebook pages. "
        },
        {
            "text": "What’s on the CS Blog?"
        },
        {
            "text": "Our blog posts cover a wealth of topics from leadership lessons, Civil Service Reform, careers, training, apprenticeships and global warming to wellbeing, the Civil Service awards and much more. We help bloggers across the Civil Service share stories, information, and statistics and offer insight, opinions and ideas."
        },
        {
            "text": "As well as our so-called normal blog posts, our Inside Policy series explores Civil Service policies and programmes, shedding light on key issues, challenges, actions and successes, highlighting our work to help us learn from each other."
        },
        {
            "text": "The Civil Service Blog is a valuable channel for sharing projects and policies that solved a complex problem, rolled out a programme or improved a service. "
        },
        {
            "text": "A Modern Civil Service"
        },
        {
            "text": "The Civil Service is undergoing significant reform. We continue to showcase A Modern Civil Service and are always on the lookout for writers who can pick apart the essential information for our audience on what a Skilled, Innovative and Ambitious Civil Service means for the future organisation and staff. For example, how it’s investing in skills, reflecting the country we serve, creating opportunities around the UK, seizing the power of data - and how it shakes down to serve citizens better. "
        },
        {
            "text": "Thankyou"
        },
        {
            "text": "Finally, we’d like to send big thanks for your continued support. It’s great that civil servants (and the public) are liking what we do, but we never take that for granted. We’re always on the hunt for talented bloggers, so if you’re a civil servant with  a story worth sharing, please contact the editor: lorraine.mcbride@cabinetoffice.gov.uk."
        }
    ]
}