{
    "url": "https://deframedia.blog.gov.uk/2021/11/08/coverage-of-cop26-nature-and-land-use-day/",
    "title": "Coverage of COP26 Nature and Land-Use Day",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-11-08T11:57:08+00:00",
    "content": [
        {
            "text": "As the first week of the climate change summit COP26 came to a close, coverage focused on key announcements from Nature and Land-Use day. 45 governments, as well as farmers and businesses, committed to urgent action to protect our land and to make our agriculture and food systems more sustainable for the future."
        },
        {
            "text": "Led by the UK, Nature and Land-Use Day saw pledges of urgent action and investment to protect nature and shift to more sustainable ways of farming, including a £500m boost to protect over five million hectares of tropical rainforests and create thousands of green jobs across Africa, Asia and Latin America."
        },
        {
            "text": "The announcement was covered on broadcast by BBC Radio 4’s the Today Programme and BBC Breakfast, and by national outlets including a splash on The Observer front page, BBC Online, Independent, The I (p10), The Times, and Reuters."
        },
        {
            "text": "Also announced was a commitment from nearly 100 companies, who pledged to work towards halting and reversing the decline of nature by 2030. This was covered positively by the Independent, PA, BBC Online, Sky News Online and BusinessGreen."
        },
        {
            "text": "There were also several interviews with Defra ministers – Minister Pow was interviewed by Talk Radio and Times Radio and the Environment Secretary was interviewed for the evening news by Channel 4."
        },
        {
            "text": "Environment Secretary George Eustice said: "
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}