{
    "url": "https://extremismcommission.blog.gov.uk/2021/11/08/robin-simcox-interim-term-extended-for-6-months/",
    "title": "Robin Simcox interim term extended for 6 months",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Commissioner opinion",
        "Latest news"
    ],
    "pub_date": "2021-11-08T10:35:23+00:00",
    "content": [
        {
            "text": "Interim Commissioner Robin Simcox has had his term extended for a further 6 months, to March 2022. During this time, the recruitment process for a permanent Commissioner will be launched by the Home Office."
        },
        {
            "text": "Robin reflects on his role so far and looks ahead to the next six months."
        },
        {
            "text": "Events over the past six months have only served as reminder of why countering extremism matters so much. We have, unfortunately, seen the horrifying consequences of extremism time and time again. I was appalled by the murder of Sir David Amess MP. While an investigation is currently underway, it has been publicly reported that this incident was allegedly motivated by Islamist ideology. There is a clear need to address the issue of Islamist extremism."
        },
        {
            "text": "Extremists in the UK have been emboldened by events in Afghanistan, where the Taliban are once again back in control. We must remain vigilant of the impact that threats emanating from Afghanistan will have on our own security. Yet we must also be aware that Afghan refugees in the UK are being intimidated by far-right groups inspired by the white nationalist Great Replacement conspiracy theory."
        },
        {
            "text": "Afghanistan was not the only time events overseas impacted communities here in the UK. I was alarmed by what I saw following heightened military activity in Gaza back in May. As with the murder of Sir David Amess MP, there are legal limits to what can be said about this at present, as incendiary rhetoric alleged to have been voiced in north London since led to charges of using threatening, abusive or insulting words or behaviour, with intent, likely to stir up racial hatred; and, in a separate case, suspected religiously-aggravated assault. Suffice to say, there can be no place for antisemitism in this country."
        },
        {
            "text": "The same must be said about anti-Muslim hatred. Tell Mama reported on an increase in such incidents following an escalation of the situation in Gaza. I am acutely aware of the need for constant vigilance around this issue. I have also been concerned by what I have heard around intra-faith tension, especially with regards to persecution of the Ahmadiyya community."
        },
        {
            "text": "It will be no surprise to hear, then, that my time as Interim Commissioner has only reinforced my belief in the importance of counter-extremism work and the need for a robust response to extremism in all its forms from Government."
        },
        {
            "text": "Over the past six months, I have been engaging widely across government, regulatory bodies, law enforcement, and intelligence agencies. I wanted a clear understanding of the issues they face while addressing extremism - whether that is online, in schools, prisons, charities, or elsewhere – and to look at the knowledge base on extremism, including with those who have front-line operational roles. I have also met with the Home Secretary and Baroness Williams of Trafford to discuss issues of concern."
        },
        {
            "text": "Since I started my role, what I have heard is that there is both the need and significant enthusiasm for a permanent Commissioner-led body that can provide independent advice and expertise to government. The recommendations that I made to the Home Secretary on the future of the CCE have reflected this."
        },
        {
            "text": "Coming from a think-tank background, I recognise the importance of external expertise. I have therefore consulted with trusted external partners while also considering how government can further harness innovative thinking around counter-extremism within the academic and think-tank sector. The CCE’s Academic Practitioner Counter Extremism Network (APCEN), set up last October, connects practitioners with leading academics specialising in the study of extremism. The forum gives them the opportunity to share information as well as identify knowledge gaps and I will be considering how to utilise APCEN further to better understand extremism."
        },
        {
            "text": "For the remainder of my time as Interim Commissioner, I will build on the work of the past six months, engaging widely while raising awareness and providing advice on how best to counter and disrupt extremism."
        },
        {
            "text": "The extremism landscape is dynamic but the challenges it presents are consistent. It is time they were comprehensively addressed."
        }
    ]
}