{
    "url": "https://healthcareleaders.blog.gov.uk/2021/11/08/tackling-the-nhs-backlog-and-giving-colleagues-what-they-need/",
    "title": "Tackling the NHS backlog and giving colleagues what they need",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Supporting NHS staff"
    ],
    "pub_date": "2021-11-08T15:55:25+00:00",
    "content": [
        {
            "text": "We’ve made huge strides in fighting the pandemic, thanks to your hard work and the work of your colleagues. Now, we must apply the same energy, and determination, to tackling the problems that the pandemic has brought with it."
        },
        {
            "text": "Winter is approaching, and I’m determined to make sure you have what you need to deliver the best possible care at this challenging time for our health service, and also give you the support you need to clear the backlog from the pandemic."
        },
        {
            "text": "Last month, the Chancellor announced a raft of new measures to support the UK’s health and social care system. The £5.9 billion set out in this year’s Autumn Budget and Spending Review will go a huge way towards tackling the backlog and providing much-need support to NHS staff and patients."
        },
        {
            "text": "£2.3 billion of that funding will go toward transforming diagnostic services through the creation of at least 100 community diagnostic centres across England."
        },
        {
            "text": "These centres are a brilliant example of how the health and care system has responded to the challenges of the pandemic. They will begin delivering services over the next 6 months, providing a one stop shop for checks, scans and tests in the heart of local communities, bringing services closer to those who need them most."
        },
        {
            "text": "Over the next 3 years, we’ll also be providing £1.5 billion for new surgical hubs, increased bed capacity and equipment to help elective services recover. As well as this, £2.1 billion will go towards supporting innovative use of digital technology within hospitals and other care organisations. This will mean you having access to new and improved IT kit and software, including faster broadband and more accessible digital patient records, freeing up your valuable time and providing the best care for patients."
        },
        {
            "text": "Together, this funding will support NHS colleagues in tackling waiting lists, recovering services and delivering the treatment needed as quickly as possible."
        },
        {
            "text": "But I know that these investments are fruitless without having the right people in place to deliver the care, so we’re committed to getting more top talent into our NHS, as we pledged in our Manifesto."
        },
        {
            "text": "I was heartened to see that there are now record numbers of doctors and nurses working in the NHS, as well as record numbers overall of professionally qualified clinical staff. These figures demonstrate the status and importance of the NHS, and it’s crucial that we continue to invest in and grow our workforce."
        },
        {
            "text": "We also need to support staff who have worked so hard over the past two years. Earlier in the year, I wrote about the extra funding available to Trusts through the £1 billion Elective Recovery Fund. It was really important to us that, in order to access the fund, Trusts have to demonstrate what they are doing to support their staff’s health and wellbeing."
        },
        {
            "text": "To strengthen the commitments made in the latest NHS People Plan, the NHS has also set up a People Recovery Task Force. This will focus on delivering a set of interventions to ensure that all NHS staff – including students and trainees – are kept safe and are able to recover."
        },
        {
            "text": "Earlier this year, the NHS launched 40 dedicated mental health support hubs to help staff get rapid access to assessment and mental health support. I’m delighted to see that the NHS has confirmed a further £37 million for 2021/22 to strengthen and continue this important programme."
        },
        {
            "text": "Because you’ve done so much to support us throughout this pandemic, we’ll do whatever it takes to support you, through this winter and beyond."
        }
    ]
}