{
    "url": "https://defrafarming.blog.gov.uk/2025/04/14/adopt-fund-guidance-now-available-for-innovation-funding/",
    "title": "ADOPT Fund: guidance now available for innovation funding  ",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2025-04-14T16:28:21+01:00",
    "content": [
        {
            "text": "The agri-tech sector and embracing new technologies are central to farmers meeting future challenges while enhancing their business resilience.  "
        },
        {
            "text": "One part of this is the ADOPT Fund, which will commit up to £20.6 million of funding in 25/26, and supports the introduction of innovative technologies aimed at improving productivity, resilience, and sustainability. "
        },
        {
            "text": "The first step ahead of the ADOPT Fund opening is the publication of guidance, which provides the information they need to access funding and trial innovative solutions on their farms.  "
        },
        {
            "text": "We’re pleased to say this guidance is now available for: "
        },
        {
            "text": "From 28 April 2025, you will be able to apply for both. They will be delivered through our partner, Innovate UK.   "
        },
        {
            "text": "We will update this post with the link for you to apply when the fund opens.  "
        },
        {
            "text": "In this post, we will give an overview of the fund and share details of support for applicants, including a support hub and webinar.  "
        },
        {
            "heading": 2,
            "text": "About ADOPT "
        },
        {
            "text": "The Accelerating Development of Practices and Technologies Fund (ADOPT) provides collaborative farmer-led, innovation grants to farmers and farm businesses trialling new technology and practices on their farm. "
        },
        {
            "text": "It aims to speed up the development and use of new technologies, allowing more farmers to implement them faster. "
        },
        {
            "text": "The funding is designed to support long-term adoption and impact, rather than short-term trials or experiments.  "
        },
        {
            "text": "The projects funded through ADOPT will focus on finding solutions that address on-farm challenges, enhance productivity, and contribute to environmental outcomes. The fund also seeks to improve resilience in the face of global food security challenges. "
        },
        {
            "text": "Projects must focus on improving one or more of the following areas: "
        },
        {
            "text": "Projects may include, for example: "
        },
        {
            "text": "In addition to the main funding, Support Grants of £2,500 are available to help applicants engage an external Project Facilitator to assist with the application process, which we expand on below.  "
        },
        {
            "heading": 2,
            "text": "Preparing to apply "
        },
        {
            "heading": 3,
            "text": "Support hub "
        },
        {
            "text": "A Support Hub has been set up to help farmers and growers access the ADOPT Fund and make the most of the insights generated by successful projects.  "
        },
        {
            "text": "The Support Hub features project ideas, ongoing initiatives and other resources. "
        },
        {
            "text": "Led by ADAS, with support from the UK Agri-Tech Centre and the Soil Association, the hub will connect farmers with potential project partners and provide additional support, including access to Project Facilitators.  "
        },
        {
            "text": "Project Facilitators could be involved in project management, reporting, and ensuring overall success, adapting to project needs and budget. "
        },
        {
            "text": "You can apply to be included in the directory of potential Project Facilitators, through Innovate UK Business Connect. "
        },
        {
            "text": "All facilitators will be listed on a directory, and this can be accessed by applicants to the main grant or the Support Grant. "
        },
        {
            "text": "This collaborative approach aims to help farmers learn from each other’s experience, pick up insights and get more out of their projects. "
        },
        {
            "heading": 3,
            "text": "Webinar "
        },
        {
            "text": "A webinar will be held on 30 April for those interested in applying. This is an opportunity to put questions to the team and gain further guidance on the application process. Register to attend the webinar. "
        },
        {
            "heading": 2,
            "text": "Further competitions"
        },
        {
            "text": "In May, a further 2 competitions will open under the Farming Innovation Programme (FIP), bringing the combined commitment for FIP thematic competitions and the ADOPT Fund to £45.6 million in the 2025/26 financial year. "
        },
        {
            "text": "We will post again when the competition texts are published. An in-person consortium-building and briefing event for precision breeding is currently open for registrations at: Farming Futures R&D - precision breeding consortium building - Innovate UK Business Connect  "
        },
        {
            "text": "We'll share progress and opportunities here, so subscribe to the Farming blog for the latest updates. "
        },
        {
            "text": "If you have any questions, do make use of the Support Hub or attend the webinar. For questions about the policy behind ADOPT or the development of the offer, please leave a comment below. "
        }
    ]
}