{
    "url": "https://naturalengland.blog.gov.uk/2025/04/14/conclusion-of-hen-harrier-brood-management-trial/",
    "title": "Conclusion of Hen Harrier Brood Management Trial (updated)",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Hen Harriers",
        "Licensing",
        "Monitoring",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Protected sites and species",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-04-14T10:00:00+01:00",
    "content": [
        {
            "text": "The experimental trial of hen harrier ‘brood management’ has ended, concluding that this activity has contributed to increased numbers of nesting hen harriers on some grouse moors. However, illegal killing of hen harriers has continued, and a range of approaches may continue to be required to maintain and build on the progress we have seen in recent years.  "
        },
        {
            "text": "Hen harriers are rare birds of prey, and their numbers have long been suppressed by illegal killing and nest disturbance associated with grouse moor management. Investigation and enforcement of wildlife crime is the responsibility of the police, and Natural England works closely with the police and the National Wildlife Crime Unit to support their investigations. However, law enforcement alone has, to date, failed to stop the illegal killing of hen harriers, and ways of encouraging coexistence of hen harriers and grouse shooting interests have been explored, in partnership with game shooting organisations.  "
        },
        {
            "text": "One way of promoting coexistence, brood management, involves maintaining the density of hen harrier nests on grouse moors at a set level, by removing the eggs and/or chicks from hen harrier nests under licence, rearing the birds in captivity, and releasing them back into the wild at a suitable location once able to fly and disperse. This was predicted to increase the confidence of moorland managers that the predation and disturbance of grouse by nesting hen harriers could be legally managed at levels compatible with grouse shooting, and in turn lead to changes in attitudes and reduced illegal killing of hen harriers. "
        },
        {
            "text": "A plan to experimentally trial brood management was set out in the 2016 Hen Harrier Action Plan. Research licences to carry out brood management of hen harriers were issued from 2018 to 2024, with brood management carried out during 2019 to 2023 by a partnership of the Moorland Association, the International Centre for Birds of Prey, the Game and Wildlife Conservation Trust, the Hawk and Owl Trust and Natural England. Over that period, 15 broods were taken from the wild, with the young birds later released, many carrying satellite tags. Records were kept of numbers and habitat of nesting hen harriers in England, survival rates of tagged birds (both wild and brood managed), and incidents of illegal killing. Two social science studies and a population modelling analysis were carried out. "
        },
        {
            "text": "Key results from the trial were: "
        },
        {
            "text": "A Natural England-led evaluation of the evidence has concluded that it is likely that the availability of brood management has led to more hen harriers successfully breeding on grouse moors. The social science research suggests that this is unlikely to be due solely to an increase in moorland managers’ confidence that the impacts of hen harriers on grouse can be effectively managed. Instead, motivations to increase hen harrier numbers could be attributed to moorland managers’ desire to demonstrate a commitment to wildlife conservation and to grouse shooting as a sport more widely, despite a cost to business, with brood management working as a ‘safety net’ to allay concerns about hen harrier numbers increasing to levels at which grouse shooting would be uneconomical.  "
        },
        {
            "text": "While it appears likely that illegal killing and disturbance of nesting hen harriers has reduced in some areas, resulting in increased nesting success on some grouse moors, these increases have been seen alongside unacceptable ongoing illegal killing. It is likely that these observations reflect substantial variation in attitudes and behaviours across different shooting estates.  "
        },
        {
            "text": "It follows that a range of approaches may be required to reduce illegal killing on grouse moors and increase hen harrier numbers in future, potentially ranging from co-operative approaches to mitigate the impacts of hen harriers on grouse and support responsible grouse moor management, to monitoring and enforcement activities designed to tackle illegal killing and disturbance, depending on location and situation.   "
        },
        {
            "text": "The commissioned reports and evaluation were reviewed by the trial’s Scientific Advisory Group and Natural England’s Science Advisory Committee. These groups agreed that brood management, during the trial, is likely to have contributed to an increase in the hen harrier population, but noted uncertainty over the underlying mechanism, and commented on the role of the active surveillance of hen harriers that happened at the same time. "
        },
        {
            "text": "The results and conclusions summarised above are detailed in four research reports, covering population modelling, social science, and evaluation. These are in the process of publication, and this blog will be updated with links to the full documents when they are published. "
        },
        {
            "text": "This evidence will be available to inform decisions on whether to issue any future licences for brood management of hen harriers. At time of publication, no decisions have been made on any future licences.  "
        },
        {
            "text": "Update: Outcome of recent licence application"
        },
        {
            "text": "While we saw some promising results from the brood management trial, all brood management licence applications are assessed based on their individual merits, considering all available evidence."
        },
        {
            "text": "After the detailed assessment of this specific application, and taking into account the results of the trial, Natural England has made the decision not to issue a licence in this instance."
        },
        {
            "text": "We remain committed to working with partners and stakeholders on a range of approaches to support the recovery of hen harrier populations alongside responsible grouse moor management."
        },
        {
            "text": "Acknowledgements "
        },
        {
            "text": "The Brood Management Trial was a partnership project between the Moorland Association, the International Centre for Birds of Prey, Natural England, the Game and Wildlife Conservation Trust and the Hawk and Owl Trust. With the conclusion of the trial, this partnership has now closed. We thank the members of the trial’s Scientific Advisory Group and we are grateful to the partners, organisations, landowners and land managers who have worked closely with us throughout the trial, supported our social and ornithological research, welcomed our fieldwork and monitoring staff, and demonstrated commitment to the goal of hen harrier conservation and human-wildlife coexistence. "
        }
    ]
}