{
    "url": "https://ukhsa.blog.gov.uk/2023/12/11/11-things-to-know-about-the-health-effects-of-climate-change-report/",
    "title": "11 things to know about the Health Effects of Climate Change report",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Climate",
        "Health in a changing climate"
    ],
    "pub_date": "2023-12-11T12:53:57+01:00",
    "content": [
        {
            "text": "Climate change poses a dual threat to lives and livelihoods in the UK, impacting both the environment and our health. Its consequences manifest on multiple levels, from direct effects on temperature and flooding, to impacts on air quality, food and water availability; with the most vulnerable populations likely to be worst affected both domestically and worldwide."
        },
        {
            "text": "Addressing the impacts of climate change is a central priority in health protection, informing our response to current and future health risks as well as emerging challenges, such as wildfires, droughts, antimicrobial resistance, and future pandemics."
        },
        {
            "text": "The recently released Health Effects of Climate Change in the UK (HECC) report, compiled by the UK Health Security Agency (UKHSA), highlights the important intersections between climate change and health, setting out the most up-to-date evidence on risks to health from climate change in the UK."
        },
        {
            "text": "Since the last evidence summary in 2012, there has been substantial growth in evidence, and a significant escalation in these health risks."
        },
        {
            "text": "Here are 11 key takeaways from the HECC report:"
        },
        {
            "text": "The weather in the UK has changed over the past few decades, becoming warmer, wetter, and sunnier. This change is linked to the overall increase in global temperatures, which affects the UK's climate and leads to alterations in weather patterns."
        },
        {
            "text": "The UK is experiencing higher temperatures, more frequent heatwaves, and shifts in rainfall patterns, including heavier rain at times. Additionally, the rise in global temperatures contributes to a rise in sea levels, impacting the UK's coastlines."
        },
        {
            "text": "As climate change progresses, negative impacts to health are expected to become worse with progressive warming."
        },
        {
            "text": "Rising temperatures, coupled with more frequent and intense heatwaves, will increase heat-related health risks. Under a high-warming scenario with no further climate adaptation, we could see as many as tens of thousands more heat-related deaths each year by the 2070s."
        },
        {
            "text": "In the 2030s, the UK may see a 166% rise to a figure of 4,266 deaths per year, reaching a 580% increase (10,889 per year) in the 2050s and a 1,244% rise (21,544 per year) by the 2070s. Despite the warming climate, deaths from cold will remain a key risk and are also expected to go up over the next few decades, mainly because of an aging population."
        },
        {
            "text": "Climate change is making more people vulnerable to flooding, including those in areas that were not previously at risk. Flooding not only threatens lives but has further negative impacts on health, well-being, the economy, and the environment. Importantly, it can lead to long-term and severe effects on mental health and could also increase the risk of infectious disease outbreaks and disrupt access to health and care services."
        },
        {
            "text": "Poor air quality is one of the greatest environmental risks to health with negative impacts such as cardiovascular and respiratory diseases, and increased risk of mortality. The main causes of poor air quality in the UK are currently emissions from domestic activity, industrial activity, power generation, transport and agriculture."
        },
        {
            "text": "Climate change can also affect air pollution by altering weather patterns in ways that change dispersal of pollution, which could increase or decrease air pollution episodes, as well as heatwaves that can worsen summer air pollution episodes."
        },
        {
            "text": "As controls on air pollutant emissions take effect, the dominant sources of pollution may change – monitoring this transition will be important for understanding future health impacts."
        },
        {
            "text": "We can expect more intense birch pollen seasons with higher pollen concentrations, as well as longer pollen seasons for oak. Additionally, fungal spore seasons for allergy-inducing species are likely to become longer. However, for grass pollen, which is the most common trigger of hay fever, it’s less clear what impact climate change will have, due in part to the wide variety of grass species. These changes may worsen the health impact of seasonal allergies, making them more burdensome for people who are sensitive to these allergens."
        },
        {
            "text": "As temperatures rise and weather patterns continue to change, infections caused by food-borne and water-borne bacteria like Salmonella, Campylobacter and Vibrio spp. could increase."
        },
        {
            "text": "Climate change could lead to favourable environments for the spread of diseases. This may affect where diseases are found in the UK and how long they persist throughout the year. However, the interaction between weather and infectious diseases is very complex, with many factors like human behaviour also playing a role."
        },
        {
            "text": "Our warming climate could expand the range and survival of ticks and biting mosquitoes that transmit vector-borne diseases. For example, warmer winters may help ticks to survive and to become active earlier in spring and later in winter, increasing the risk of transmitting diseases like Lyme and tick-borne encephalitis."
        },
        {
            "text": "A warming climate, coupled with global travel and trade, is also increasing the risk of new species of biting mosquitoes that transmit diseases establishing in the UK. Eggs of the non-native mosquito species Aedes albopictus, which can transmit Dengue fever, Chikungunya and Zika, have already been found in the UK. Modelling suggests that London is currently suitable for their survival, with broader areas at risk of becoming suitable in the coming decades. If temperatures exceed 20°C for extended periods, the threshold for Chikungunya outbreaks could potentially be reached in the future, particularly in London."
        },
        {
            "text": "Increased biting from mosquitoes coupled with warming temperatures could also lead to outbreaks of diseases like West Nile virus in the future."
        },
        {
            "text": "Climate change projections indicate that we are likely to experience increased wildfire risks due to hotter and drier summers. While this may not necessarily mean more fires, the ones that do occur are anticipated to be larger, more severe, and have a greater impact. If global temperatures increase by 2°C, the Met Office projects a doubling of days with a high risk of fires in the UK and an extension of the wildfire season into late summer and autumn."
        },
        {
            "text": "With climate change, we're expecting more frequent and severe droughts due to patterns of low rainfall and higher temperatures. This could negatively impact agriculture, causing disruptions in food chains, affecting production, leading to price increases, shortages, and contributing to food insecurity."
        },
        {
            "text": "The emissions pathway that we follow will affect how severe the impacts of climate change become, and thus the level of adaptation that we need to protect public health."
        },
        {
            "text": "Many of the actions to mitigate climate change can also benefit health, such as improving air quality from reducing fossil fuel use for energy and transport, keeping homes warmer in winter by making buildings more energy efficient, increasing physical activity and improving wellbeing by shifting to active travel, and moving to more sustainable healthy diets."
        },
        {
            "text": "Some mitigation actions need to be carefully designed and implemented to ensure that any potential health risks are minimised, and co-benefits for health are maximised. It is important to understand the wider effects on our health of climate action and where key opportunities for health lie, to ensure equitable benefits to our health are achieved."
        },
        {
            "text": "We spend about 90% of our time indoors, so this is an important environment that we are exposed to. Making homes more energy-efficient is therefore vital for mitigating the impacts of climate change and as a means of promoting healthy indoor environmental quality. However, these improvements must be implemented carefully, avoiding poor indoor air quality, building overheating, noise and lighting issues, and ensuring adequate ventilation, to minimise potential health risks and maximise co-benefits."
        },
        {
            "text": "Poor indoor environmental quality is associated with adverse respiratory and cardiovascular conditions, symptoms including heat exhaustion and heatstroke, as well as mental illness and even death in extreme cases. Therefore, a holistic approach is key when enhancing efficiency: one that considers the interplay between sustainability, affordability, health and comfort."
        },
        {
            "text": "The HECC report highlights the urgency of mitigating and adapting to climate change to avoid severe health impacts. While everyone is at risk, the most vulnerable individuals will bear a disproportionate burden of some impacts, such as those with certain pre-existing health conditions, older people, and people living in more deprived neighbourhoods. The impacts of climate change will not be distributed equally across generations and the decisions we take now will impact the severity of impacts felt by today’s younger people and their children."
        },
        {
            "text": "Although we are already seeing the impacts of climate change on health, many anticipated adverse health effects are still preventable through adaptation measures. Swift action is essential to avoid severe potential scenarios outlined in the report. Actions to mitigate climate change present an opportunity to realise additional health co-benefits from such measures."
        },
        {
            "text": "The UKHSA remains committed to addressing the health challenges posed by climate change and leading preparedness efforts to secure a healthier future for all."
        }
    ]
}