{
    "url": "https://naturalengland.blog.gov.uk/2023/12/11/30-by-30-a-boost-for-nature-recovery/",
    "title": "30 by 30: a boost for nature recovery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Climate change",
        "Environment Act",
        "Green Infrastructure",
        "Landscapes",
        "Landscapes and access",
        "Mapping",
        "Marine Net Gain",
        "Monitoring",
        "National Nature Reserve",
        "Natural Capital",
        "Natural England",
        "Nature Recovery Network",
        "Parks, trails and nature reserves",
        "Protected sites and species",
        "Science and evidence",
        "Site of Special Scientific Interest",
        "Special Protection Area",
        "Species recovery",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2023-12-11T12:09:11+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Written by James Markwick Principal Adviser, Biodiversity Policy "
        },
        {
            "text": "After a year of extreme weather events in which many climate records were broken, world leaders met in Dubai to discuss tackling climate change at COP28, with the hope of keeping alive the goal of limiting long-term global temperature rises to 1.5C. Central to our work in Natural England is the role of nature in helping tackle climate change, and how nature can become more resilient and adapt to its impacts. "
        },
        {
            "text": "This time last year at the UN Biodiversity Conference, the UK formally made a commitment to protect and conserve a minimum of 30% of land and sea for biodiversity by 2030, known as 30x30. This target will be a key driver in reversing the decline of nature in the UK, by expanding and improving our protected areas and creating new areas for wildlife, allowing nature to spill over into the wider landscape. "
        },
        {
            "text": "These wildlife-rich areas also have benefits for people, by providing clean air and water, healthy soils, beautiful places to visit both within the town and wider countryside; and bolstering our resilience to climate change. "
        },
        {
            "text": "To coincide with Nature Day at the COP (9 December), Defra’s Secretary of State announced a raft of nature measures, including the publication of a map and criteria setting out what should count towards the 30x30 target. This fires the starting gun for assessing what further land might contribute as we head toward 2030 and beyond. "
        },
        {
            "text": "Initially 30x30 will be delivered through our Natura 2000 sites, Sites of Special Scientific Interest (SSSIs), National Nature Reserves (NNRs) and areas of managed broadleaved and mixed woodland, which qualify as Other Effective Area Based Conservation Measures (OECMs). OECMs are voluntary areas, which must primarily be managed and protected for the long term for biodiversity, as laid out in Defra’s criteria. "
        },
        {
            "text": "But that will only take us so far, with only 8.5% of England mapped and the need to evaluate and bring more areas that can contribute to the target as OECMs. We also know at sea that our network of Marine Protected Areas will count towards the target. This should be seen as the start of a process to optimise the network, and as an opportunity to achieve meaningful and long-term recovery of our wider seas. "
        },
        {
            "text": "We cannot underestimate how important 30x30 is if we are to achieve the ambitions of the Environmental Improvement Plan, particularly reversing species decline by 2030, creating and restoring large areas of new habitat and ensuring people have access to greenspace. 30x30 will also be essential in helping to build the Nature Recovery Network, a national network of wildlife-rich places to restore, enhance, increase and connect nature, and enable people to connect with nature.  "
        },
        {
            "text": "We also need to ensure that 30x30 delivery is integral to the important new mechanisms for nature recovery that can help us to identify and establish OECMs. These mechanisms include Biodiversity Net Gain, a requirement for developers to provide 10% more or better-quality natural habitat than there was before development; Environmental Land Management schemes that reward farmers for managing their land for nature; and Conservation Covenants securing long term protection. Above this new Local Nature Recovery Strategies, typically led by Local Authorities, will set out local plans for how this nature recovery will be done. All of these will need to work together to deliver for nature. These new measures will work alongside more established conservation tools such as SSSIs and National Nature Reserves, of which we are creating 25 more as part of the “Kings Series”  "
        },
        {
            "text": "Key to this will be partnership working to help identify OECMs and support areas in working to meet 30x30 criteria. This is what we refer to as the pipeline. We will continue to work with Defra and our partners to ensure the OECM evaluation process is up and running as quickly as possible. This will enable our partners such as environmental charities, farmers, woodland owners, developers delivering biodiversity net gain and other major landowners such as government departments, water companies and Crown Estates, to name but a few, to help us achieve 30x30.  "
        },
        {
            "text": "Above all, our National Parks and National Landscapes (previously known as Areas of Outstanding National Beauty), will be a major focus, strengthened by their revised remit to deliver more for nature recovery. A number of our Protected Landscapes are already pledging towards England’s habitat and 30x30 targets. "
        },
        {
            "text": "The target of 2030 is not that far away (just 72 months), and we will need to work at pace and in as agile a way as possible. But in doing this, we must ensure that the key tenets of 30x30 are not diluted. We need to ensure that this is not just a counting exercise and that we have a plan in place to ensure that there is a legacy after 2030 as the world looks to a 50x50 target. There will be the need for robust assessment criteria for protected areas and OECMs that provide confidence that they deliver long term for nature’s recovery and deliver functional ecosystems.  "
        },
        {
            "text": "If we are successful, 30x30 will not only help deliver our species and habitats targets. It will also increase and improve the condition of our protected sites (SSSIs, NNRs, MPAs) – driving positive biodiversity management in Protected Landscapes and beyond. And it will give all of us more opportunities to enjoy nature for our health and wellbeing, as well as contributing to climate resilience and mitigation. If we can get the pipeline starting to flow with quality proposals that can become OECMs it will be a huge achievement. The next few years will be key."
        }
    ]
}