{
    "url": "https://defrafarming.blog.gov.uk/2023/12/11/apply-now-for-neirf-grant/",
    "title": "Apply now for grant to support private investment in nature",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to support private investment"
    ],
    "pub_date": "2023-12-11T12:49:20+00:00",
    "content": [
        {
            "text": "At the end of November, we shared details of a grant designed to help farmers attract private investment into nature. "
        },
        {
            "text": "We said we’d blog again when it was time to apply and we’re pleased to say that from today, you can.  "
        },
        {
            "text": "Through the Natural Environment Investment Readiness Fund (NEIRF) individual grants of between £10,000 and £100,000 are available to farmers and farm groups. If you are not a farmer or part of a farming group, you will need to clearly demonstrate how your project will help farmers to attract private investment into nature markets. The total amount available through the fund is £5 million. "
        },
        {
            "text": "We want to support innovative projects that align with the Environmental Improvement Plan, assist farmers to trial new ways of earning from ecosystem services, attract investment and create a scalable investment model for wider adoption by farmers.   "
        },
        {
            "text": "The process to apply for a NEIRF grant is competitive. "
        },
        {
            "text": "The fund supports activities in England. That said, we may fund activities to prepare projects where benefits apply across borders with Wales or Scotland. This will be based on the environmental benefits to England. "
        },
        {
            "text": "The official guidance and application form for the grant can be found on GOV.UK. It includes details on eligibility, how your project will be assessed and examples of how to meet the assessment criteria. "
        },
        {
            "text": "We’re hosting a webinar for you to learn more about the grant and ask questions on 10 January at 11am. Register to attend."
        },
        {
            "text": "As mentioned, the application form can be found on the same page as the guidance. Once you have filled in the form and signed the declaration and sent it to the Environment Agency (the organisation administering the grant), you will be notified of the outcome. If successful, you’ll be sent a grant agreement to consider.   "
        },
        {
            "text": "The deadline to apply is midday, 16 February 2024. "
        },
        {
            "text": "Good luck to all who apply!  "
        },
        {
            "heading": 2,
            "text": "Further reading"
        },
        {
            "text": "If you’d like to learn more about government’s wider plans to ensure farmers can access payments from both the public and private sector for the environmental benefits they produce, do take a look at the Nature Markets Framework and the new Green Finance Strategy. "
        }
    ]
}