{
    "url": "https://deframedia.blog.gov.uk/2023/12/11/cop28-government-confirms-supermarket-essentials-will-no-longer-be-linked-to-illegal-deforestation/",
    "title": "COP28: Government confirms Supermarket essentials will no longer be linked to illegal deforestation",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-12-11T16:55:49+00:00",
    "content": [
        {
            "text": "There has been national coverage of ‘Nature Day’ at COP28 in Dubai, at which Environment Secretary Steve Barclay set out his priorities for forests, food and nature."
        },
        {
            "text": "This included further action to secure the future of the world’s forests – by making sure that supermarket essentials including palm oil, soy and cocoa have no link illegal deforestation. This was covered by The Telegraph, Bloomberg and the Sunday Express."
        },
        {
            "text": "Environment Secretary Steve Barclay said:\n"
        },
        {
            "heading": 3,
            "text": "Tanya Steele, CEO of the WWF said:\n"
        },
        {
            "heading": 3,
            "text": "Andrew Opie, Director of Food and Sustainability at the British Retail Consortium, said:\n"
        },
        {
            "text": "The government also published a new map to show what areas could count in the delivery of “30by30” – the commitment to protect 30% of land for nature by 2030. It shows that 8.5% of land in England – including Sites of Special Scientific Interest and National Nature Reserves – already count toward the target, with a further 26.8% of land having the potential to contribute in the future, including Protected Landscapes.The commitments set out by the government strengthens the UK’s leadership to address nature loss and tackle climate change, ensuring that the environment is protected for future generations."
        }
    ]
}