{
    "url": "https://mhrainspectorate.blog.gov.uk/2023/12/11/gmp-gdp-certificates-validity-period-extended/",
    "title": "GMP & GDP Certificates: Validity Period Extended",
    "authors": [
        "Ian Jackson"
    ],
    "categories": [
        "Good distribution practice",
        "Good manufacturing practice"
    ],
    "pub_date": "2023-12-11T11:23:06+00:00",
    "content": [
        {
            "text": "Following the end of the COVID-19 public health emergency declared by WHO in May 2023[1], on-site GMP and GDP inspections were restarted after being postponed or carried out remotely during the pandemic.  A number of postponed inspections still need to be carried out and we are working at pace to complete these inspections as soon as possible. The validity of GMP and GDP certificates has currently been extended until the end of 2023.  The MHRA (in consultation with our international partners) has decided to continue the extension of the validity date until 2024[2] or until the conclusion of the next inspection, whichever comes first, except where clarifying remarks in the certificate state otherwise."
        },
        {
            "text": "In the meantime, we reserve the right to perform risk-based supervision of sites by either on-site  or remote inspections  and, based on the outcome, may continue to issue, withdraw or restrict GMP and GDP certificates as appropriate."
        },
        {
            "text": "Inspections will continue to be prioritised based on risk so that the highest priority manufacturers and wholesale distributors are inspected first. In addition, inspections will be prioritised if the GMP or GDP certificate is already five years or older."
        },
        {
            "text": "It is incumbent upon manufacturers, importers and distributors to continue complying with GMP and GDP as appropriate."
        },
        {
            "text": "Inspections  may be carried out at any time, and in case of serious non-compliance, appropriate regulatory actions will be taken"
        },
        {
            "heading": 2,
            "text": "Inspection Reliance; the manufacturer, MAH, MIA Holder & the QP "
        },
        {
            "text": "The inspection information from Mutual Recognition Agreement (MRA) partners and/or Pharmaceutical Inspection Co-operation Scheme (PIC/S) participating authorities should be submitted to support the ongoing verification of the GMP status of manufacturing sites based in third countries."
        },
        {
            "text": "This information will be utilised in line with the principles of Inspection Reliance to determine the current state of compliance and support the risk-based supervision of sites; https://picscheme.org/docview/2475"
        },
        {
            "text": "The information should be shared between the manufacturing site, QP, MIA holder & MA holder. Responsibility for submitting the information, in a timely manner, to the MHRA should be assigned.  To convey the information please complete and submit an Interim Compliance Report: https://www.gov.uk/guidance/good-manufacturing-practice-and-good-distribution-practice along with the relevant Inspection Report(s)."
        },
        {
            "text": "Previous related messages:"
        },
        {
            "text": "https://mhrainspectorate.blog.gov.uk/2022/11/08/return-to-international-gmp-inspections/"
        },
        {
            "text": "https://mhrainspectorate.blog.gov.uk/2017/10/19/international-regulators-inspecting-in-the-uk/"
        },
        {
            "text": " "
        },
        {
            "text": "[1] https://www.who.int/news/item/05-05-2023-statement-on-the-fifteenth-meeting-of-the-international-health-regulations-(2005)-emergency-committee-regarding-the-coronavirus-disease-(covid-19)-pandemic"
        },
        {
            "text": "[2] An explanatory footer has also been introduced in MHRA GMDP database."
        }
    ]
}