{
    "url": "https://naturalengland.blog.gov.uk/2023/12/11/government-takes-a-step-forward-for-marine-nature-recovery/",
    "title": "Government takes a step forward for marine nature recovery",
    "authors": [
        "Jonathan Burney"
    ],
    "categories": [
        "Marine environment",
        "Marine Net Gain",
        "Natural England"
    ],
    "pub_date": "2023-12-11T09:57:05+00:00",
    "content": [
        {
            "text": "By Jonathan Burney, Director of Marine Strategy and Government Advice"
        },
        {
            "text": "The Government have released their response to the public consultation on the principles of Marine Net Gain (MNG). This exciting, emerging area of marine policy offers opportunity to accelerate marine nature recovery in English waters.   "
        },
        {
            "text": "Net Gain is the concept of leaving the environment in a measurably better state than prior to a development. Launched in June 2022, the consultation sought views on the high-level principles of MNG. It proposed how best to introduce a Net Gain policy for the marine environment and in March 2023, participants responses were released. They showed broad support for MNG as well as a range of recommendations around what MNG could cover, how it could be applied to developments within it and which Net Gain interventions would be most appropriate at sea.  "
        },
        {
            "text": "The Government’s response reflects the feedback they have received from participants and stakeholders, and underscores the main principles of MNG. It builds on the Government’s progress with Biodiversity Net Gain (BNG), which applies to terrestrial areas and down to the mean low water mark. It confirms their wish to ensure that MNG has biodiversity at its core but also allows for inclusion of wider environmental benefits.   "
        },
        {
            "text": "Natural England very much welcomes the Government’s response and their intent to embed the principles into a practical approach that can be applied in the marine environment. We support the need to look strategically at MNG delivery and to explore how the more complex aspects of the marine environment such as mobile species and wider environmental issues can be incorporated.  "
        },
        {
            "text": "This new policy area offers a real opportunity to deliver marine nature recovery through industry involvement and we are pleased to see that MNG will incentivise both active interventions and appropriate pressure reduction measures to achieve this recovery. It will be a key tool in delivering commitments set out in the 25 Year Plan and Environmental Improvement Plan. "
        },
        {
            "text": "Our view is that MNG represents a huge opportunity for delivering nature recovery at sea. To support the Government with its policy development, we are kicking off the next phase of evidence building work around MNG. "
        },
        {
            "text": "First, investigating which habitats and species have the most potential for restoration, recovery and enhancement, through our Marine Restoration Potential and enhancement project (MaRePo+). Second, we are mapping where our most Marine Irreplaceable Habitats (MIH) occur, and third, to explore possible ways to measure and compare marine development impacts, offsets and ensure marine environmental gains can be delivered. "
        },
        {
            "text": "On each of these projects we are working collaboratively with partners and with cross-cutting work in our wider NE teams. We also continue to engage with industry and stakeholders, inviting opinion and transparency throughout this evidence building process for MNG.     "
        }
    ]
}