{
    "url": "https://ukhsa.blog.gov.uk/2023/12/11/health-effects-of-climate-change-the-health-threat-from-vector-borne-diseases/",
    "title": "Health Effects of Climate Change: the health threat from vector-borne diseases",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-12-11T14:05:53+01:00",
    "content": [
        {
            "text": "Vector-borne diseases – illnesses that can be transmitted to humans by other living organisms such as mosquitoes and ticks – account for more than 17% of all infectious disease and cause more than 700,000 deaths globally each year. They include West Nile virus, malaria, dengue and yellow fever."
        },
        {
            "text": "As outlined in our Health Effects of Climate Change (HECC) report, the health risks posed by mosquitoes and ticks in the UK, whether from established or invasive species, are directly impacted by climate change and warming temperatures."
        },
        {
            "text": "At UKHSA, our dedicated teams of medical entomologists monitor and assess the incursion of new species and diseases which could cause harm to human health, playing a vital role in coordinating efforts to minimise emerging vector-borne threats."
        },
        {
            "text": "In this blog post, we take a look at the current status of vector-borne diseases in the UK, as well as the vital work being carried out by our specialist entomology team to assess, understand and address the health threats that mosquitoes and ticks pose."
        },
        {
            "heading": 2,
            "text": "What are disease vectors?"
        },
        {
            "text": "Vectors, such as ticks and mosquitoes, are living organisms that can transmit infectious pathogens between humans, or from animals to humans. In the UK the threat from vector-borne diseases is on the rise, due to factors like growing global travel and trade, changes in land use and climate change."
        },
        {
            "text": "Mosquitoes with the potential to transmit infectious disease can make their way to our shores in a number of ways, such as hitching a ride in cars and lorries, crossing the border into the UK. They may also be transported through trade channels through goods such as tyres, which are shipped internationally."
        },
        {
            "text": "Similarly, ticks not commonly found in the UK can attach themselves to pets migratory birds and holidaymakers in search of a blood meal and be imported into the UK."
        },
        {
            "text": "As temperatures warm, tick and mosquito species not currently native to the UK will begin to find the UK’s climate more bearable making it easier for them to survive, reproduce and establish a local population."
        },
        {
            "heading": 2,
            "text": "What is UKHSA doing about vector-borne disease?"
        },
        {
            "text": "Our Medical Entomology and Zoonoses Ecology (MEZE) team assess the emerging risk posed by ticks, mosquitoes and other arthropods that can carry and transmit bacteria, viruses and parasites. An important part of their remit is to advise the government on the risk to public health from vector-borne disease in the UK."
        },
        {
            "text": "Our entomologists also work with local authorities to monitor and manage risks, and to put in place strategies to minimise the opportunity for invasive species to become established in our towns and countryside."
        },
        {
            "heading": 2,
            "text": "Mosquitoes: where are they found in the UK?"
        },
        {
            "text": "The following locations are known to have active mosquito populations:"
        },
        {
            "heading": 2,
            "text": "The coastal marshes of Southeast England"
        },
        {
            "text": "Characterised by their wetlands, bodies of water and marshy habitats, the North Kent Marshes are an ideal breeding ground for mosquitoes and have been for decades, if not centuries."
        },
        {
            "text": "In these Marshes and at similar sites across the country, our teams have been conducting surveillance over the last decade using a range of mosquito traps and dip for larvae in water sources, to assess the presence or absence of a species locally, their seasonality and collect specimens for viral analysis."
        },
        {
            "text": "Ensuring our awareness of and preparedness for diseases such as West Nile virus (WNV) risk involves conducting these types of surveillance for mosquitoes at key parts of the year to identify presence of key mosquito species as vectors of future disease risk."
        },
        {
            "text": "Culex modestus, a species of mosquito and a primary carrier of WNV in countries where the disease is common, is known to occur in the North Kent Marshes and other coastal marshes in Southeast England could in future be one such disease risk. At present WNV is yet to make a foothold in these areas, but in recent years areas of Europe, including France, have experienced several outbreaks in the summer and early autumn months."
        },
        {
            "heading": 2,
            "text": "Motorway service stations "
        },
        {
            "text": "Transport hubs, such as motorway service stations and truck stops, are ideal sites at which in-depth data can be gathered on the detection of invasive mosquito species brought into the country in lorries and other vehicles."
        },
        {
            "text": "If imported goods or vehicles carrying mosquitoes reach the UK, they could establish a local population. Motorway service stations, showing evidence of eggs or larvae, could be the first sign of a potentially established population in the UK."
        },
        {
            "text": "Monitoring whether vehicles are bringing in invasive mosquitoes at these types of transport hubs is therefore important, as we can detect and eradicate them before they are disseminated more widely."
        },
        {
            "text": "The most common mosquito species found in the UK, Culex pipiens, is adept at surviving in urban and suburban areas - breeding in various types of water sources, including artificial containers and stagnant water."
        },
        {
            "text": "Collaborating with local authorities, mosquito traps targeting invasive species are run at high-risk sites across England. Left unchecked the consequences of not controlling these species can lead to the establishment of this invasive vector and therefore potential for new diseases that we have not seen in the UK."
        },
        {
            "text": "Coordinated by our teams, local authorities and communities are being encouraged to step into action in these instances and clear out sources of standing and stagnant water such as blocked gutters and drains, and ensure rainwater in litter, tarpaulin, open buckets, bins and discarded items are cleared away or arranged in a way that they drain away."
        },
        {
            "text": "When surveillance systems identify an invasive species aggressive interventions are put in place to eradicate any health threat. These mosquito control efforts may include reducing mosquito breeding sites, using insecticides, and promoting personal protective measures like wearing long-sleeved clothing, using mosquito repellents to the public and alerting local healthcare settings to the signs of illness to look out for."
        },
        {
            "heading": 2,
            "text": "Ticks"
        },
        {
            "text": "Ticks live in many different outdoor environments, but they are particularly common in grassy and wooded areas. To better understand the threat they pose to public health, our team is studying tick populations in several locations, including:"
        },
        {
            "heading": 2,
            "text": "Woodland sites"
        },
        {
            "text": "The UK has over 20 recorded tick species, and our teams undertake tick sampling at a number of sites across the country in order to study local species diversity, distribution patterns, host preferences, factors determining population abundance and whether any vector-borne pathogens are present in local populations."
        },
        {
            "text": "Learning more about our local tick populations helps our teams and local authorities to develop strategies to mitigate the risks associated with tick-borne diseases, understand the disease profile of local ticks and potentially manage exposure of humans to tick populations."
        },
        {
            "text": "The survival of our current species, and of those potentially invasive to the UK is determined by microclimate, habitat and available hosts, all of which can be impacted by climate change. These determinates can also increase cases of diseases like tick-borne encephalitis and babesiosis which are rare in humans in the UK, but common elsewhere in Europe."
        },
        {
            "text": "Through a process known as flagging, where a cloth sheet is pulled through grass catching ticks questing for blood, our teams collect samples to take back to the lab for analysis."
        },
        {
            "text": "Through learning more about the distribution and abundance of ticks in these areas we can work with local authorities to better place control measures and tick awareness which will reduce the risk of tick-borne diseases."
        },
        {
            "heading": 2,
            "text": "Tick surveillance"
        },
        {
            "text": "Assessing risk of ticks to UK public health through national surveillance schemes is integral to the team’s ability to coordinate research which looks at ecological drivers of pathogens which cause the spread of diseases like Lyme disease or tick-borne encephalitis. Through enhanced surveillance, our Rare and Imported Pathogens Laboratory (RIPL) collect data on recent positive cases of Lyme, looking at where and when a person may have picked up an infection."
        },
        {
            "text": "During April, May and June the MEZE team receive submissions to the tick surveillance scheme, receiving thousands of samples from the public, vets, GP surgeries and wildlife charities. These submissions provide valuable data on the distribution and activity of ticks across the country."
        },
        {
            "text": "These submissions peak in June, at the height of tick season when the climate is most favourable and gives the team a real sense on any seasonal changes – improving our ability to detect any invasive species, update risk assessments on outbreaks, and prepare responses such as habitat management or targeted human or animal surveillance."
        },
        {
            "heading": 2,
            "text": "Porton Down"
        },
        {
            "text": "Back at our Porton lab the team get up-close and personal with the ticks and mosquitoes they’ve collected, or ticks submitted through surveillance schemes, under the microscope."
        },
        {
            "text": "Here the team will confirm the species, where they are at in terms of the different stages of their life-cycle and look for any species which are not native to the UK."
        },
        {
            "text": "Combined datasets for ticks have been collected since 2005, and they provide the best assessment of where ticks are causing human and animal biting in the UK. This information has allowed us to map changes over nearly two decades."
        },
        {
            "text": "Through studying the lifecycle and development of ticks and mosquitoes in relation to our weather and climate, the MEZE team can work with modellers to create projections of scenarios for potential seasonal changes to tick and mosquito populations. These studies will help to understand when shifts in breeding and feeding patterns might occur, potential increases of incidence of diseases such as Lyme disease and estimate changes in geographical distribution."
        },
        {
            "heading": 2,
            "text": "The impact of climate change"
        },
        {
            "text": "The HECC report demonstrates substantial and growing evidence of the effects of climate change on health in the UK."
        },
        {
            "text": "The impact that climate change could have on vector-borne diseases and our society, if we do not take decisive action, could have major impacts on physical and mental health."
        },
        {
            "text": "Considering and monitoring the impact of climate and other environmental change in relation to vector-borne diseases through our surveillance systems is vital to our countries ability to safeguard future generations from the increasing threat from diseases such as tick-borne encephalitis, or chikungunya from invasive mosquitoes."
        }
    ]
}