{
    "url": "https://deframedia.blog.gov.uk/2023/12/11/unlimited-financial-penalties-for-environmental-offences-will-mean-polluters-always-pay/",
    "title": "Unlimited financial penalties for environmental offences will mean “polluters always pay.”",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-12-11T15:16:36+00:00",
    "content": [
        {
            "text": "There has been national and regional coverage on our proactive announcement about changes to Variable Monetary Penalties (VMPs). These are civil sanctions issued by the Environment Agency to companies and individuals who breach their permits and pollute the environment."
        },
        {
            "text": "The previous £250,000 cap on the penalties has been scrapped and the range of offences they cover has been expanded. Firms now face unlimited financial penalties for a breach with the move designed to offer a more rapid form of punishment, compared to prosecution. The EA expects to now deliver more penalties to hold polluters, including water companies, to account."
        },
        {
            "text": "The expanded range of offences that can be covered with a VMP now include:"
        },
        {
            "text": "The changes, which follow a consultation in Spring 2023, affect all firms that have environmental permits, including water and waste companies as well as the agricultural sector and process industries. Penalties issued will be proportionate to the size of the company and the nature of the offence, in line with Sentencing Council guidelines. The most serious breaches of the law will continue to be subject to criminal proceedings."
        },
        {
            "text": "The funds raised from water company penalties will be reinvested in a new Water Restoration Fund, designed to provide direct local investment to improve our rivers, lakes and streams."
        },
        {
            "text": "Environment Secretary Steve Barclay said:"
        },
        {
            "text": "Environment Agency Executive Director John Leyland said: "
        },
        {
            "text": "As well as changes to the VMP system, the Government has recently taken other measures to hold polluters accountable for environmental damage. We have given Ofwat increased powers to ensure water company dividends are linked to environmental performance while the regulator has also tightened the rules on bonus payments. For 2022-23, no water company bosses in England are paying a CEO bonus out of customer money."
        }
    ]
}