{
    "url": "https://defraenvironment.blog.gov.uk/2024/12/16/75th-anniversary-of-the-national-parks-act-new-legislation-to-ensure-protected-landscapes-are-fit-for-the-future/",
    "title": "75th Anniversary of the National Parks Act: New legislation to ensure Protected Landscapes are fit for the future",
    "authors": [
        "Amber Inman"
    ],
    "categories": [
        "30by30",
        "Access and engagement",
        "Nature",
        "Protected Landscapes",
        "Wildlife"
    ],
    "pub_date": "2024-12-16T14:27:42+00:00",
    "content": [
        {
            "text": "Today is the 75th anniversary of the 1949 National Parks and Access to the Countryside Act."
        },
        {
            "text": "The groundbreaking Act built the foundations for modern nature conservation, enshrining in law protections for our wild spaces. It paved the way for our iconic network of National Landscapes, Parks and Trails (collectively known as Protected Landscapes)."
        },
        {
            "text": "To mark the occasion, government has announced that it will work with partners to develop new legislation to empower our National Parks and National Landscapes. This will celebrate the original bold intent of the 1949 Act, while unleashing the full potential of these incredible places for the next 75 years and beyond."
        },
        {
            "text": "From Northumberland to the Jurassic Coast in Dorset, Protected Landscapes welcome almost 270 million visitors a year and are home to internationally important habitats and our most iconic species."
        },
        {
            "text": "Together, they contain half of England’s priority habits and Sites of Special Scientific Interest, 60% of deep peat and around 88% of heather and acid grassland habitats. This makes them vital to our mission to restore nature and boost the nation’s health through access to nature."
        },
        {
            "text": "If that wasn’t enough, these landscapes inspire and uplift us."
        },
        {
            "text": "Personally, a childhood trip to the Yorkshire Dales awakened a love of nature for me. As the 1949 Act recognised, everyone has the right to benefit from what these places have to offer and, as living landscapes, people have always been part of the fabric of what makes them so special."
        },
        {
            "text": "However, many of these landscapes are in a poor condition, with the wildlife that lives within their boundaries in steep decline and their waterways polluted. Less than 40% of rivers in National Parks are in good ecological status."
        },
        {
            "text": "We will develop the new legislation with a broad range of partners but intend to strengthen Protected Landscape’s mandate to recover nature. Through this recovery, Protected Landscapes will fight climate change, foster a thriving green economy and connect communities with nature while protecting them from flooding."
        },
        {
            "text": "We will also revamp governance to ensure it creates the conditions for success, innovation and collaboration. Finally, we intend to provide National Park Authorities with a general power of competence – which will clarify their legal framework and remove barriers to integrated delivery."
        },
        {
            "text": "We will also develop new regulations, and have today published new guidance to ensure public bodies operating in these areas, including water companies, deliver better environmental outcomes working together with Protected Landscape organisations."
        },
        {
            "text": "This announcement represents our first steps towards greener, wilder and more accessible Protected Landscapes, helping the recovery of nature across the country."
        },
        {
            "text": "It will make important contributions to our nature targets, including halting the decline of species and protecting 30% of the UK’s land and sea for nature by 2030, as part of the government's Plan for Change."
        },
        {
            "text": "We look forward to working with a broad range of partners to develop the legislation, alongside a wider package of measures to support Protected Landscapes."
        },
        {
            "text": "We will keep you updated on the Environment blog as the Protected Landscapes legislation progresses."
        },
        {
            "text": "Please subscribe to the blog to receive an email notification whenever we publish a new post."
        }
    ]
}