{
    "url": "https://environmentagency.blog.gov.uk/2024/12/16/big-data-tiny-microbes-environmental-dna-in-action/",
    "title": "Big data, tiny microbes: environmental DNA in action",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity",
        "Invasive species",
        "Nature",
        "Rivers",
        "Water"
    ],
    "pub_date": "2024-12-16T09:38:54+00:00",
    "content": [
        {
            "text": "All living things, from bacteria to blue whales, have DNA in their cells. DNA provides the blueprint for life, directing how organisms grow, reproduce, and live. Since DNA gives a unique genetic code for every species on Earth, we can use it to identify and track what’s in the environment."
        },
        {
            "text": "For over a decade, Environment Agency scientists have been pioneering the development and use of DNA-based technologies for ecological monitoring in England. These approaches are transforming the way we understand the environment and how it works. We have added to this body of research with three new reports published today."
        },
        {
            "text": "“This is the beginning of an exciting new era of understanding river ecosystems,” said Dr Robert Bradburne, Environment Agency Chief Scientist. “Knowing which microbes are there and what they do is already providing fascinating new ecological insights. I’m sure we’ll find out much more over the coming years, with a real prospect of seeing problems earlier and finding better solutions.”"
        },
        {
            "heading": 3,
            "text": "Early days of eDNA  "
        },
        {
            "text": "Environmental DNA, or eDNA, is the DNA found in environmental samples. A river or lake water sample can contain thousands of genetic traces, ranging from the eDNA in living cells to the urine, faeces, and skin creatures leave behind. Different environmental conditions favour different species, so knowing which species are present can help us understand the state of our water environments."
        },
        {
            "text": "The Environment Agency was an early adopter of eDNA technology, using it to see what’s living in our lakes and rivers. Through a large-scale study in 2014, we established the use of eDNA techniques for assessing diatoms, a type of microscopic algae. The technique, called metabarcoding, identifies multiple species of diatoms in a single sample. This approach processes water samples with remarkable speed and accuracy – reducing months of analysis into just a few weeks."
        },
        {
            "text": "In 2016, the Environment Agency developed a novel eDNA method to detect fish species in lakes. This laid the foundation for working with regulators in Scotland and Wales to develop an eDNA-based tool for classifying the ecological status of lake fish in Britain."
        },
        {
            "heading": 3,
            "text": "Innovation in invasive species management"
        },
        {
            "text": "eDNA is also proving helpful for tracking down invasive species, which thrive at the expense of native organisms. A prime example is the invasive signal crayfish. These elusive creatures are most active during summer, leaving a narrow window for conventional surveying each year."
        },
        {
            "text": "Environment Agency scientists recently tested and optimised a new eDNA monitoring approach to identify where signal crayfish, and their native counterparts, the white-clawed crayfish, were hiding. eDNA was proven to be a reliable, consistent, and year-round alternative to seasonal surveys. It can even detect invasive populations before they become established.  This new approach can also help spot at an early stage crayfish plague – a disease carried by signal crayfish that is fatal to endangered native white-clawed crayfish. By analysing eDNA from water samples, scientists testing the approach quickly caught a crayfish plague outbreak in the Meanwood Beck in January 2023, allowing native crayfish to be relocated to support population recovery. "
        },
        {
            "heading": 3,
            "text": "DNA data sheds light on ecosystem health"
        },
        {
            "text": "DNA and molecular-based methods help spot the species that slip through the cracks in ecological surveys. This makes eDNA useful for studying something we can’t see with the naked eye: microbes."
        },
        {
            "text": "Microbes – which include bacteria, fungi, algae, and other single-celled organisms – make up the majority of life on Earth. These tiny but mighty organisms play important roles in ecosystems, from cycling nutrients like nitrogen and carbon to breaking down harmful pollutants. Given their potential to provide detailed information about ecosystem health and function, microbes are currently the focus of the Environment Agency’s DNA research."
        },
        {
            "text": "\"It’s an exciting time to lead a research programme exploring river microbiomes,” said Dr Kerry Walsh, DNA Senior Specialist at the Environment Agency. “These hidden microbial communities are vital indicators of ecosystem health, and understanding their roles could transform how we monitor and manage our environment.”"
        },
        {
            "text": "Kerry and her team in the Environment Agency’s Chief Scientist’s Group are exploring microbial DNA in river biofilms – the slimy microbial communities that coat submerged rocks, plants, and other moist surfaces. Teeming with microbial life, biofilms offer detailed, local, and long-term insights into environmental change."
        },
        {
            "text": "The Environment Agency recently developed a large-scale, DNA-based dataset that captures genetic information from microbial biofilm communities in rivers. The dataset collates vast amounts of microbial data from 700 sites across England."
        },
        {
            "text": "Initial analysis identified more unique microbe species than previously surveyed, alongside insights into their roles. Scientists can build on this information to explore which species are responsible for important ecosystem functions. This evidence can help predict which places are changing fastest – allowing us to target interventions to improve an ecosystem’s resilience to change and keep our rivers healthy. "
        },
        {
            "text": "Environment Agency scientists are also exploring new ways to use microbial DNA. Through the pathways of chemicals into freshwaters and their ecological impacts (PACIFIC) project, we’re working in partnership with the UK Centre for Ecology & Hydrology and others to understand how chemical pollution affects freshwater microbes."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "With our ambitious DNA dataset complete, the Chief Scientist’s Group is now looking at how to get the most from this data. For example, we undertook an expert review on the use of ecological network science – an emerging scientific approach that considers the complex interactions between organisms in an environment."
        },
        {
            "text": "This innovative work is changing the way we monitor and extract information from the environment. By unveiling what was once invisible to the naked eye, DNA and molecular science can help us prepare for environmental change and find ways to protect the environment for generations to come.  "
        },
        {
            "text": "For more information, please contact research@environment-agency.gov.uk."
        }
    ]
}