{
    "url": "https://mhclgdigital.blog.gov.uk/2024/12/16/homes-for-ukraine-applying-digital-principles-and-innovation-to-respond-to-a-crisis-rapidly-at-scale/",
    "title": "Homes for Ukraine: applying digital principles and innovation to respond to a crisis rapidly at scale",
    "authors": [
        "Coco Chan, Head of Product"
    ],
    "categories": [
        "Homes for Ukraine",
        "Strategy"
    ],
    "pub_date": "2024-12-16T09:51:53+00:00",
    "content": [
        {
            "text": "Hello, my name is Coco. I’ve worked in the Ministry of Housing, Communities and Local Government (MHCLG) for 4 years in a variety of roles and have recently rejoined the Homes for Ukraine digital team as their Head of Product. "
        },
        {
            "text": "I returned to this team after a year away because I believe in the importance of our mission – to help provide sanctuary for vulnerable people fleeing war.  "
        },
        {
            "heading": 2,
            "text": "The Homes for Ukraine Sponsorship Scheme and its mission  "
        },
        {
            "text": "In response to the invasion of Ukraine, our task in spring 2022 was to develop a resettlement service that enabled Ukrainians to enter the UK and find suitable accommodation and support. "
        },
        {
            "text": "The Homes for Ukraine Sponsorship Scheme supports Ukrainians and their immediate family members to apply for permission to come to the UK. The scheme enables individuals to volunteer accommodation and provide a route to temporary sanctuary for Ukrainians.  "
        },
        {
            "text": "In this blog post, you will read about the work MHCLG has done to launch the scheme and what has been achieved so far.   "
        },
        {
            "text": "This piece forms part of a series of case studies bringing to life MHCLG Digital’s objectives and guiding principles. These examples demonstrate how digital ways of working, collaboration and innovation support the delivery of our departmental objectives and outcomes, offering better, faster and more efficient services to citizens. "
        },
        {
            "heading": 2,
            "text": "How does digital enable Homes for Ukraine? "
        },
        {
            "text": "One of the first things we did in March 2022 was to set up an expression of interest site to allow the British public to volunteer their support. Starting from scratch, we created a new live service in a week, working with one of our digital suppliers to boost our site capacity, but I don’t think any of us anticipated quite how much traffic we would receive.  "
        },
        {
            "text": "I will never forget the day we launched and received 100,000 sign-ups in less than 24 hours – an extraordinary display of public generosity, and nervous moments for us, as we tried to stop the site from crashing! "
        },
        {
            "heading": 3,
            "text": "Data integration for informed decision-making "
        },
        {
            "text": "We commissioned a supplier to work with us to set up a data platform at pace that would link up MHCLG, the Home Office, local authorities and the devolved administrations. Sharing data across partners at scale is key to our service delivery – without this information, our local delivery partners would not be able to carry out the safeguarding checks necessary to responsibly house Ukrainians in private homes, nor would we be able to assure ourselves that public money spent on ‘thank you’ payments to hosts and through local authority tariffs was going to the right places. "
        },
        {
            "heading": 3,
            "text": "Embedding digital into policy, and better user insights "
        },
        {
            "text": "In addition to enabling delivery through technology, we also support our policy and operational colleagues with user-centred design skills. We have conducted user research with Ukrainian guests and their sponsors, local authorities, devolved administrations, charities and other partners, to understand their experiences and needs, and have made amendments to our service in response to their feedback.  "
        },
        {
            "text": "We have also supported colleagues developing new initiatives – for example, we ran a design sprint for the Afghan Policy team to rapidly test a range of policy ideas for the Communities for Afghans programme. "
        },
        {
            "heading": 3,
            "text": "Boosting collaboration "
        },
        {
            "text": "We are proud to work alongside colleagues from other disciplines on this vitally important work. Digital colleagues have been instrumental from the outset of the programme. We have built strong relationships with policy and operational colleagues, learnt from their expertise, and built our own domain knowledge that allows us to respond quickly to support teams across a wide range of initiatives. This embedding of digital teams in policy is a great example of the work digital teams are doing within the department to boost collaboration and facilitate progress throughout MHCLG. "
        },
        {
            "heading": 2,
            "text": "Actions and outcomes "
        },
        {
            "text": "The programme has made a significant impact, including: "
        },
        {
            "text": "You can find the most recent data, which is updated on a regular basis, on GOV.UK."
        },
        {
            "text": "Our work on the scheme has not only provided immediate relief but it has also laid a solid foundation for a more efficient, empathetic and responsive support system for Ukrainians seeking safety and stability in the UK.  "
        },
        {
            "heading": 2,
            "text": "What does the future hold? "
        },
        {
            "text": "Our work will always be dependent on the international context and ever-shifting geopolitics. Whilst horizon scanning and forward planning can help, we cannot fully predict the demands that will be placed on us in the months and years to come. "
        },
        {
            "text": "However, whatever happens, we will continue to follow our core principles of starting with user needs, adapting to our environment and seeking out feedback, and sharing our work with a broad audience. We know from experience that these working practices give us the best chance to build services that work for our users and are sustainable. "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "You can learn more about our work by subscribing to the MHCLG Digital blog. "
        },
        {
            "text": "Read more about MHCLG Digital's objectives and guiding principles and the work digital teams are doing to improve outcomes across MHCLG. "
        }
    ]
}