{
    "url": "https://mhclgmedia.blog.gov.uk/2024/12/16/permitted-development-rights/",
    "title": "Permitted development rights",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Planning",
        "Uncategorized"
    ],
    "pub_date": "2024-12-16T17:14:59+00:00",
    "content": [
        {
            "text": "There has been some press coverage over the weekend relating to permitted development rights. "
        },
        {
            "text": "There is a suggestion in an article that PDRs could have been banned in the recent update to the National Planning Policy Framework (NPPF) last week. This is incorrect. "
        },
        {
            "text": "There are longstanding nationally set PDRs which allow for the change of use from a range of commercial buildings such as offices and shops to residential use. Changing them requires secondary legislation and is not a matter for the NPPF. This was not made clear in the article. "
        },
        {
            "text": "We are aware of the criticism of some PDR conversions in terms of their quality and would welcome evidence of  recent conversions which are a cause of concern. New homes that are constructed as a result of a Material Change of Use are required to meet relevant current building regulations, including in relation to fire safety, irrespective of whether they are approved through a planning application or permitted development."
        },
        {
            "text": "The government will of course look at cases where we have been notified about development that may have fallen below these standards. "
        },
        {
            "text": "The government is keeping PDRs under review and has not yet made any final decisions. "
        },
        {
            "text": "An MHCLG spokesperson said: "
        },
        {
            "text": "“Our plan to build 1.5 million homes is clear all homes must be well designed and provide the safety and security people need. "
        },
        {
            "text": "“The government is aware of concerns and is committed to keeping permitted development rights under review.”  "
        }
    ]
}