{
    "url": "https://marinescience.blog.gov.uk/2024/12/16/seascapes-project-reports-mncea/",
    "title": "Seascapes project: New Year 1 reports published as part of Marine Natural Capital and Ecosystem Assessment Programme",
    "authors": [
        "Frances Mynott",
        "Clement Garcia"
    ],
    "categories": [
        "mNCEA",
        "natural capital"
    ],
    "pub_date": "2024-12-16T13:21:27+00:00",
    "content": [
        {
            "text": "By Frances Mynott and Clement Garcia, Cefas leads for the mNCEA programme."
        },
        {
            "text": "Our understanding of the benefits that our marine and coastal environments provide are improving through the  Marine Natural Capital and Ecosystem Assessment (mNCEA) programme. Started in 2022, mNCEA is a 3-year Defra funded programme which aims to deliver the evidence, tools and guidance needed to help policymakers integrate natural capital approaches into policy and decision making for marine and coastal environments. "
        },
        {
            "text": "The Cefas-led Seascapes project aims to help policymakers understand the different uses and values of marine natural capital for people and society, as well as the competing uses and pressures facing marine resources. It also aims to provide more holistic understanding of the benefits and complex trade-offs involved in managing our marine environment, with the aim of supporting the sustainable use of coastal and marine environments."
        },
        {
            "text": "Taking into account the whole marine system, Cefas works alongside its partners the Environment Agency, Joint Nature Conservation Committee, Marine Management Organisation, and Natural England to deliver these projects and outcomes."
        },
        {
            "text": "New publications"
        },
        {
            "text": "We are pleased to announce that six of the reports Cefas produced during Year 1of the Seascapes project have been published (all reports can be found on Defra’s Science Search Portal)."
        },
        {
            "text": "We are currently undertaking delivery of Seascapes Part II project in Year 3 of the mNCEA programme. Please stay tuned for further news of report publications in 2025."
        }
    ]
}