{
    "url": "https://environmentagency.blog.gov.uk/2024/12/16/take-part-in-a-consultation-on-guidance-used-by-the-water-companies-when-they-draft-their-new-drought-plans/",
    "title": "Take part in a consultation on guidance used by the water companies when they draft their new drought plans",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2024-12-16T10:33:51+00:00",
    "content": [
        {
            "text": "Our changing climate means we could see more frequent and severe weather events, including droughts, in the coming years. We cannot predict when, or how severe, the next drought will be, but we can ensure we learn from previous drought events and prepare and plan to improve our resilience to it. "
        },
        {
            "text": "The last drought in 2022 tested water company drought plans and, while they worked, there was a lot to learn. The Environment Agency and water companies have reflected on the lessons from the 2022 drought, and we have made changes to our guidance. We expect water companies to use this guidance and continue to improve their drought plans ensuring they are better prepared and more resilient to the droughts of the future."
        },
        {
            "text": "The Environment Agency has launched a public consultation on ‘Water company drought plan guideline’, that water companies in England must follow when they prepare and publish their drought plans in 2027."
        },
        {
            "text": "Statutory drought management plans show what companies plan will do to maintain water supplies for their customers and protect the environment through the actions they take during a drought."
        },
        {
            "text": "What is the consultation about? "
        },
        {
            "text": "The ‘Water company drought plan guideline’ describes what water companies in England must and should do and include in their operational drought management plans."
        },
        {
            "text": "In this consultation, we would like to hear: "
        },
        {
            "text": "Your comments will help us to improve the final document."
        },
        {
            "text": "Get involved "
        },
        {
            "text": "The six-week consultation opens on 16 December 2024, and closes on 26 January 2025.  Responses to the consultation can be input on Citizen Space, the Environment Agency’s consultation hub.  The consultation can be accessed here:  https://consult.environment-agency.gov.uk/engagement/proposed-changes-to-the-water-company-drought-plan"
        }
    ]
}