{
    "url": "https://hmlandregistry.blog.gov.uk/2021/06/11/an-employer-that-cares-for-its-carers-is-one-i-care-about/",
    "title": "An employer that cares for its carers is one I care about",
    "authors": [
        "Gian Paolo Ansaloni, Chief Economist"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2021-06-11T11:08:16+01:00",
    "content": [
        {
            "text": "Did you know that every day in the UK another 6,000 people take on a caring responsibility? That’s equal to more than 2 million people each year. According to Carers UK, 1.3 million people provide more than 50 hours of care per week and during the COVID-19 pandemic around 13.6 million people provided care for relatives, friends and neighbours on an unpaid basis."
        },
        {
            "text": "I’m Gian Paolo Ansaloni, HM Land Registry’s Chief Economist, and I’m a carer."
        },
        {
            "text": "My dad Adriano was a cycle enthusiast. I remember his stories about cycling around Lake Garda in northern Italy, with no money for food or a place to stay, carrying huge parcels for my mum – she’d made sweaters which my dad would take to the factory, 30 miles each way, twice a day."
        },
        {
            "text": "My family and I do not know exactly when my father’s symptoms began, but by 2015 my dad had started behaving erratically, being a danger behind the wheel (or handlebars) and becoming easily irritable. Sadly, he was formally diagnosed with Alzheimer’s Disease later that year."
        },
        {
            "text": "Now, several years on, I am my dad’s second carer and it is very hard. He, my mum and sister live in Mantua in Italy and we are lucky enough to afford a live-in carer to help my mum. My sister visits several times a week, and a few times a year I go back to Italy and take over when the carer is unwell or on leave."
        },
        {
            "text": "Alzheimer’s Disease is a cruel disease and having caring responsibilities is never easy: it imposes an extraordinary mental burden, and a physical one too. Watching the person you love get replaced by an empty shell of themselves is a pain that never ceases, no matter how much time passes."
        },
        {
            "text": "Luckily, HM Land Registry is an extraordinary employer, very flexible about trying to meet carers’ needs. I feel so blessed. Quality of life is not (just) about the money, but the ability to be with the ones you love the most, when they need you the most."
        },
        {
            "text": "This week is National Carers Week, and what better time to launch formally our carers' network at HM Land Registry?"
        },
        {
            "text": "The network, which is run for our people, by our people, works closely with other staff networks, Human Resources and managers to support those with caring responsibilities to:"
        },
        {
            "text": "HM Land Registry offers other support for our carers too in the form of:"
        },
        {
            "text": "To honour my dad and his love of cycling, I have set myself the challenge of cycling 250 miles in 30 days. I’ve already been challenged to reach 300, but one step at a time!"
        },
        {
            "text": "Find out more about the benefits of working at HM Land Registry and view our current vacancies."
        }
    ]
}