{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/11/engineering-better-policy-royal-academy-of-engineering-policy-fellowships/",
    "title": "Engineering Better Policy : Royal Academy of Engineering Policy Fellowships",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2021-06-11T12:00:24+01:00",
    "content": [
        {
            "text": "The Royal Academy of Engineering (RAEng) has recently announced the September Engineering Policy Fellowship cohort is open for applications, until the 5th of July 2021. The policy fellowships represent a key opportunity for Senior Civil Servants (SCS) and Public Servants with responsibility for policy or service design in any sector, to develop their policy making skills and better utilise engineering perspectives within their policymaking."
        },
        {
            "text": "As a national academy, the RAEng provides progressive leadership for engineering and technology, and independent expert advice to government in the UK and beyond. The Policy Fellowship Programme, offered by the RAEng, provides an intensive professional development programme that supports better evidence-based policymaking. Additionally, it aims to develop a fellow’s policymaking skills using engineering perspectives and systems-thinking approaches."
        },
        {
            "text": "Three times a year the RAEng selects exceptional policymakers to become Policy Fellows for each of the three cohorts, starting in January, May, and September each year. The RAEng invites applications from policymakers who have a variety of insights, expertise, and backgrounds from across the engineering-policy community."
        },
        {
            "text": "A brief overview of the core and alumni programmes of study is provided below, to give you a clearer overview of the scheme and how it is run. Information on who should apply, how to apply and key dates have been provided at the end of this post. Due to the Covid-19 pandemic, the programme has been adapted by the RAEng to be deliverable online, without compromising on the quality of engineering input or expertise."
        },
        {
            "heading": 3,
            "text": "Who should apply?"
        },
        {
            "text": "Usually, successful Policy Fellow applicants are senior civil servants or public servants with responsibility for policy or service design in any sector, particularly those that would benefit from the use of engineering-based approaches in policymaking. The RAEng is committed to diversity and inclusion, and welcomes applications from a range of academic or policy backgrounds, including : economics, politics, sociology, planning, digital, science or engineering."
        },
        {
            "text": "The RAEng recommends that successful Policy Fellow applicants will have:"
        },
        {
            "text": "To illustrate the diversity of profiles and policy challenges who benefitted from the programme, case studies from five Policy Fellows alumni are available in the programme’s Insights Report Engineering better policy."
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": "The RAEng selects Policy Fellows using a competitive selection process which assesses applicants on the strength and merits of their application. If there are substantially more well-qualified candidates than can be offered places on this cohort, they may offer deferred places (entry onto a later running-scheme) on the programme to ensure every accepted candidate can access this scheme"
        },
        {
            "text": "For further information, a trailer video, and how to apply please click here. To express interest or support to shape an application, please email Marine Shah."
        },
        {
            "heading": 3,
            "text": "Key dates"
        },
        {
            "text": "The RAEng runs three Policy Fellow cohorts each year, typically starting in January, May and September. Key dates and fee for the next confirmed Policy Fellowship cohort:"
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}