{
    "url": "https://marinedevelopments.blog.gov.uk/2021/06/11/mmo-harbour-orders-and-the-g7-world-leaders-summit/",
    "title": "MMO Harbour Orders and the G7 World Leaders Summit",
    "authors": [
        "Claire Turner, MMO Digital Manager"
    ],
    "categories": [
        "Harbour orders"
    ],
    "pub_date": "2021-06-11T11:20:50+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) have been involved in the preparation for the 47th G7 Summit, which is being held between 11 – 13 June at the Carbis Bay Hotel, near St Ives, Cornwall."
        },
        {
            "text": "The G7 is made up of the United Kingdom, Canada, France, Germany, Italy, Japan and the USA, with the EU participating in discussions. This summit marks the first official foreign visit of US President Joe Biden and will be of particular importance as world leaders focus attention on the ongoing challenges posed by Covid-19 pandemic and climate change."
        },
        {
            "text": "The MMO is responsible for processing applications for Harbour Orders in England and for certain ports and harbours in Wales. Last month the MMO Harbour Orders team made The St Ives (G7 2021 Summit) Harbour Order which came into force, ahead of the G7 Summit."
        },
        {
            "text": "Harbour Orders are a form of local legislation which either amend existing or introduce new harbour legislation. They are made as a statutory instrument under the Harbours Act 1964 and confer powers on the Statutory Harbour Authority (SHA) for the purpose of improving, maintaining or managing a harbour."
        },
        {
            "text": "When considering whether a Harbour Order should be made, the MMO must consider whether the application secures the improvement, maintenance or management of the harbour in an efficient and economical manner or of facilitating the efficient and economic transport of goods or passengers by sea. The MMO however is not responsible for the regulation of the day to day functioning and activities of port and harbour authorities."
        },
        {
            "text": "Cornwall Council (as SHA for St Ives Harbour) required the Harbour Order to extend the harbour limits of St Ives for a temporary period to enable the safe management of harbour activities in St Ives bay during the G7 period. The Harbour Order also enables a restricted zone to be established under the Aviation and Maritime Security Act 1990. The restricted zone would temporarily limit access to the waters adjoining the area around where the G7 Summit is to be held in order to provide additional security to the attending world leaders."
        },
        {
            "text": "As police assistance will be required to manage the St Ives Bay area during the G7 Summit period, the Order also permits existing police officers to be appointed by a Justice of the Peace to act as constables over the extended harbour area before and during the G7 Summit period."
        },
        {
            "text": "The St Ives Order is the 9th Harbour Order which the MMO has made as law this year. For further information about Harbour Orders made by the MMO and other applications that we are processing, please see our Harbour Orders public register "
        },
        {
            "text": "If you’d like more information on Harbour Orders please email the MMO team harbourorders@marinemanagement.org.uk"
        },
        {
            "text": "Information is also available online Harbour Orders - GOV.UK"
        },
        {
            "text": "The MMO Harbour Orders team are:\nDaniel Jose, Case Officer\nMelissa Gaskell-Burnup, Case Manager\nCraig Loughlin, Senior Case Manager"
        }
    ]
}