{
    "url": "https://socialcare.blog.gov.uk/2021/06/11/new-toolkit-offers-a-fresh-look-at-infection-prevention/",
    "title": "New toolkit offers a fresh look at infection prevention",
    "authors": [
        "Rian Gleave"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Information sharing",
        "Workforce"
    ],
    "pub_date": "2021-06-11T11:15:56+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Getting the message through"
        },
        {
            "text": "My mum used to constantly nag, “Have you washed your hands”?  It always irritated me, having to walk all the way upstairs and wash my hands. As I got older, I just answered “yes” regardless of whether this was the case."
        },
        {
            "text": "My husband deploys similar tactics in response to my leaving dirty socks on the bathroom floor, dirty plates next to the dishwasher, or rubbish on top of a full bin. I am a joy to live with! So, if I agree (which I do) that clean hands and appropriate laundry and waste management are good things, why do I need to be nagged and why hasn’t nagging worked?"
        },
        {
            "text": "As a nurse working in social care with a background in the control of infectious diseases (my hygiene behaviours at work are thankfully better than those at home) I am interested in methods of improving infection control practices. The recently launched Every Action Counts Toolkit provides some ideas for us to keep messages fresh and promote good practice."
        },
        {
            "heading": 2,
            "text": "Infection control is nothing new"
        },
        {
            "text": "The concept of ‘isolation’ has been around since the 14th century, when ships were quarantined to reduce the risk of plague. The 19th century is really where it all happened."
        },
        {
            "text": "Dr Ignaz Semmelweis introduced a handwashing policy for doctors. Florence Nightingale pioneered a range of measures including handwashing, cleaning and ventilation. And Dr John Snow (not from Game of Thrones) removed the handle of the Broad Street water pump, stopping the onward transmission of cholera and furthering our understanding of contact tracing."
        },
        {
            "text": "So, no, infection control practices are not new. The implementation toolkit provides some ideas to enthuse and reiterate the messages without them becoming as stale as a miasma!"
        },
        {
            "heading": 2,
            "text": "How do we build a safety culture?"
        },
        {
            "text": "Everyone working in social care takes measures to prevent infections every working day. It’s just difficult to count the number of infections we prevent. To build our culture we need a shared understanding of how infections are spread, acknowledge the infection risks of our work and be determined to work safely."
        },
        {
            "text": "We need a culture of mutual trust and create an environment where raising concerns regarding infection control practice or challenging sub-optimal practice is encouraged, respected and expected. We need to see pointing out that a colleague’s face mask isn’t covering their nose and mouth in the same way as we view pointing out their shoelace is undone."
        },
        {
            "text": "In social care we are rarely working in purpose-built environments which have considered infection control in their design. We are working in people’s homes and converted properties and have all the difficulties inherent with these.  We need to involve everyone in seeking solutions to infection control challenges and provide the resources to enable these challenges to be met so we can have confidence in our preventative measures."
        },
        {
            "heading": 2,
            "text": "The toolkit"
        },
        {
            "text": "Developed by our colleagues in the NHS and then adapted for use in social care, the Every Action Counts Toolkit utilises the skills and knowledge of care providers and professionals to support social care with infection prevention and control. It can be used to start a conversation and start your thinking of how you can continue your excellence journey and ask the question, ‘What can I do better?’"
        },
        {
            "text": "We can challenge and question infection control practices without nagging - Florence, Ignaz and John managed it! We can find multiple ways of enthusing and reiterating infection prevention messages and not just repeat ourselves to the groan of others. We can involve everyone and respect their ability to explore solutions to infection control problems in their own work. You never know, I may even place my socks in the laundry basket without being asked!"
        }
    ]
}