{
    "url": "https://civilservice.blog.gov.uk/2021/06/11/preview-of-civil-service-live/",
    "title": "Preview of Civil Service Live",
    "authors": [
        "Brian Stanislas MBE"
    ],
    "categories": [
        "Diversity and inclusion"
    ],
    "pub_date": "2021-06-11T10:22:44+00:00",
    "content": [
        {
            "text": "Over the past 12 months, the majority of civil servants have worked from home, but the world of work is fast changing with hybrid working on the way, reports Brian Stanislas."
        },
        {
            "text": "The ‘Moving Forwards Towards Hybrid Working’ session being delivered on Wednesday 16 June at Civil Service Live 2021 will explore the potential opportunities and challenges of a, mixed working model, retaining the flexibility of working from home, while capitalising on the benefits of returning to the office.  "
        },
        {
            "text": "As part of the ‘An Innovative Civil Service’ modernisation and reform theme, and in my role of Co-Chair of the Cross Government Flexible Working Network, I will lead the discussion on the importance and benefits of Hybrid Working. This will support colleagues who are embarking on their journeys (both physical and mental) of different approaches to working. "
        },
        {
            "text": "The session will feature a panel discussion with Cross Government Staff Network Chairs who will discuss the importance of Hybrid Working for their members. "
        },
        {
            "text": "The discussion panel will include Cilla Christmas, Co-Chair of the Civil Service Carers Network; Edwina Osborne, Chair of the Civil Service Parents Network, and Sue Reeves, Chair of the Civil Service Disability Network. "
        },
        {
            "text": "Delegates will also benefit by hearing from Jenny Baynes, Cabinet Office Smarter Working Business Change Lead, who will explain how using Smarter Working with more familiar Flexible Working practices can help to make Hybrid Working beneficial for all colleagues."
        },
        {
            "text": "In addition to these agenda items I will also be sharing some ‘Breaking News!’ updates including topics relating to the Civil Service Job Share Finder and Civil Service Careers Website."
        },
        {
            "text": "And finally, to keep momentum of the Hybrid Working ‘Big Conversation’ flowing we have created the Moving Forwards Towards Hybrid Working Survey (Civil Service Live 2021) - https://www.smartsurvey.co.uk/s/MFTHWCSLIVE2021/ "
        },
        {
            "text": "You can fill in the survey now, and it will remain open for three months after Civil Service Live finishes."
        }
    ]
}