{
    "url": "https://securityprofession.blog.gov.uk/2021/06/11/think-before-you-link-to-the-civil-service-and-beyond/",
    "title": "Think Before You Link - To The Civil Service And Beyond!",
    "authors": [
        "Centre for the Protection of National Infrastructure (CPNI)"
    ],
    "categories": [
        "Government Security",
        "Hot security topics"
    ],
    "pub_date": "2021-06-11T12:17:29+01:00",
    "content": [
        {
            "text": "From The Insider Research Threat Centre at the Centre for the Protection Of National Infrastructure (CNPI)."
        },
        {
            "text": "The ‘Think Before You Link’ (TBYL) campaign was launched in April across the Civil Service by Dominic Fortescue, the Chief Security Officer. The campaign was designed by security and behavioural science experts in the Centre for Protection National Infrastructure (CPNI). The campaign aims to protect the UK and our allies from hostile state actors who use malicious profiles on social networking sites to target individuals who may have access to classified, sensitive or otherwise privileged information."
        },
        {
            "text": "Reaching further afield \nThe campaign has been running within the Civil Service over the last few weeks, reaching over 450,000 Civil Servants across the Civil Service and potentially millions more across the respective arm’s length bodies. However, we wanted to take the opportunity to showcase some of the wider efforts CPNI has made to reach even more people who may be at risk from this surreptitious threat. This includes ex members of staff, those working in businesses or organisations with valuable intellectual property and the general public."
        },
        {
            "text": "Press reporting \nOne of the best ways to amplify a campaign of this nature is via the press. Using the Civil Service launch as a ‘hook’ we successfully engaged with a number of national media organisations."
        },
        {
            "text": "This resulted in significant reporting on TBYL across platforms such as BBC, Financial Times, The Times, Telegraph, Daily Mail and the Independent. We even managed to gain coverage as far afield as the US, Europe and the Middle East. Further still, LinkedIn released a press statement in response which effectively endorsed the campaign. This resulted in a record 3,630% increase in the number of visitors to the ‘Think Before You Link’ CPNI public website from a month ago and over 1,100 downloads of the videos on the day after press coverage. However, for the CPNI team the pinnacle of this coverage was when it got assassinated by Paul Merton and Co. on ‘Have I Got News for You’ on Friday 17 April! The ultimate accolade…!!"
        },
        {
            "text": "Other ways of reaching more people \nWe have also engaged with trade press such as Civil Service World, ClearanceJobs and other relevant online outlets who have also published details of TBYL with news of the threat posed by malicious profiles. There will be further articles appearing in Defence and Security trade press and other professional standards organisations. In the coming weeks we will see further social media posts by Her Majesty’s Government on the TBYL campaign. We have also experimented with paid-for advertising. For a relatively small investment we had over 85,000 views on a short LinkedIn advertising run aimed at those working in the public sector. This resulted in just under a quarter of a million impressions (times the advert was shown to the user)."
        },
        {
            "text": "New ways of delivering our advice \nWe have been working over the last year on developing a ‘Think Before You Link’ app. Due for release and trialling in the autumn, this will result in a more dynamic way for CPNI to provide TBYL advice and guidance. The app will provide TBYL at the point where it is needed, on phones and tablets where people do most of their social media engagement. The app will also enable us to keep the stories, advice and content continually refreshed. Watch this space!"
        },
        {
            "text": "And finally, a huge thank you \nThe launch across the Civil Service, and the subsequent media coverage, was the biggest launch we’ve ever done as CPNI for one of our campaigns. This was only possible due to the passionate help and support and amazing partnership working with the Government Security Function."
        }
    ]
}