{
    "url": "https://apprenticeships.blog.gov.uk/2021/06/11/update-on-the-engineering-and-manufacturing-route-review/",
    "title": "Update on the engineering and manufacturing route review",
    "authors": [
        "Jill Nicholls"
    ],
    "categories": [
        "Apprenticeship standards",
        "Employers",
        "Route Panel"
    ],
    "pub_date": "2021-06-11T10:56:58+01:00",
    "content": [
        {
            "text": "I’m delighted to be able to provide an update on how we are moving forward with our engineering and manufacturing route review."
        },
        {
            "text": "58 occupational standards, which set out the key knowledge, skills and behaviours employers expect to be covered by apprenticeships and wider technical education, are being looked at."
        },
        {
            "text": "Recommendations to help ensure the first 34 of these stay relevant and up to date have now been sent by the Institute to our employer-led trailblazer groups, who can begin work on implementing them straight away."
        },
        {
            "text": "Over 300 individuals and organisation representatives have now provided consultation responses supporting this review, which we paused last year to allow employers to focus on challenges posed by COVID-19 and resulting lockdowns."
        },
        {
            "text": "Work is now moving on well and the Institute is working towards delivering recommendations on the remaining 24 occupational standards. We will run webinars to supports employer with the required work on updating their standards."
        },
        {
            "text": "A full report on the engineering and manufacturing route review, detailing our recommendations, will be published in the autumn."
        },
        {
            "text": "I would like to thank everyone who has fed back on what is working and what can be done better to serve these vital sectors."
        },
        {
            "text": "Your support will help ensure apprenticeships and wider technical education serves engineering and manufacturing beyond the pandemic and for many years to come."
        },
        {
            "text": "The 34 standards covered by the first wave of recommendations are:"
        },
        {
            "text": "The previous four route reviews carried out by the Institute covered the digital; hair and beauty; creative and design; agriculture, environmental and animal care sectors."
        }
    ]
}