{
    "url": "https://phescreening.blog.gov.uk/2021/07/09/a-big-thank-you-to-nhs-screening-services/",
    "title": "A big thank you to NHS screening services",
    "authors": [
        "Anne Stevenson"
    ],
    "categories": [
        "NHS Abdominal Aortic Aneurysm Screening Programme",
        "NHS Bowel Cancer Screening Programme",
        "NHS Breast Screening Programme",
        "NHS Cervical Screening Programme",
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2021-07-09T16:20:35+01:00",
    "content": [
        {
            "text": "The COVID-19 pandemic has tested us all in ways we could not have imagined 18 months ago. This is as true of our NHS screening services as it is of so much else we once took for granted."
        },
        {
            "text": "There have been huge challenges for all staff delivering NHS screening programmes. But we’ve constantly been heartened (and hugely impressed) at the dedication and commitment shown."
        },
        {
            "text": "You may have spotted our recent blog thanking staff who deliver and support the antenatal and newborn (ANNB) NHS screening programmes. In this article, we focus on the NHS abdominal aortic aneurysm (AAA) screening, bowel cancer screening, breast screening, cervical screening and diabetic eye screening programmes."
        },
        {
            "text": "While the challenges faced by the 5 young person and adult (YPA) NHS screening programmes (as we collectively refer to them) have been quite different, the commitment and dedication shown by the people on the frontline who deliver them has been just as absolute."
        },
        {
            "heading": 2,
            "text": "A tremendous achievement"
        },
        {
            "text": "Anne Mackie, Director of PHE Screening, said:"
        },
        {
            "text": "Deborah Tomalin, Director of Public Health Commissioning and Operations in NHS England and NHS Improvement, said:"
        },
        {
            "heading": 2,
            "text": "Some of the challenges"
        },
        {
            "text": "As you all know, nothing stays still in NHS screening. While you are all working tremendously hard in continuing to restore services, you have also been keeping up to date with the latest guidance and developments. Services have:"
        },
        {
            "text": "We also know that you (to name just a few):"
        },
        {
            "heading": 2,
            "text": "Interim QA visit process"
        },
        {
            "text": "Thanks also to all the providers who have engaged with PHE’s interim quality assurance (QA) visit process. We’ve had lots of positive feedback over the last 12 months and there’s still chance to have your say. So please get in touch with your QA contact if you have any thoughts you wish to pass on about the process."
        },
        {
            "heading": 2,
            "text": "Stay up to date"
        },
        {
            "text": "There is not enough space here to cover all the tremendous work you’ve all done, but we can assure you that you are all greatly appreciated and valued."
        },
        {
            "text": "Finally, a quick reminder to stay subscribed to the blog to remain up to speed with screening developments (details below) as we all hope for a return to more normal times."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        }
    ]
}