{
    "url": "https://deframedia.blog.gov.uk/2021/07/09/environment-bill-and-heritage-attractions/",
    "title": "Environment Bill and heritage attractions",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-07-09T12:02:36+01:00",
    "content": [
        {
            "text": "There is coverage in BBC News Online and the Telegraph about concerns that provisions in the Environment Bill could threaten heritage attractions."
        },
        {
            "text": "The Government understands and appreciates the important contribution that the heritage sector, including steam railways, makes to our national culture. The smoke emission measures in the Environment Bill will not apply to emissions from steam trains."
        },
        {
            "text": "The Environment Bill will make it easier for local councils to enforce the Clean Air Act 1993, which regulates smoke emissions from the chimneys of buildings. The Clean Air Act 1993 does not apply to smoke from steam traction, and this will not change, and nor will the Bill’s vehicle recall measures apply to steam trains. It is therefore incorrect, inaccurate and misleading to suggest that the Environment Bill “may lead to a ban on burning coal”, particularly in respect of steam traction."
        },
        {
            "text": "The Government has shaped the Environment Bill, and other legislation, in a way which accommodates heritage. For example, legislation came into force in May phasing out the sale of the most polluting fuels used for domestic burning, including traditional house coal. This legislation included an exemption for freeminers in the Forest of Dean so they can continue to extract coal and supply their domestic market. This exemption recognises that the freemining tradition is unique to the Forest of Dean."
        },
        {
            "text": "Speaking from the despatch box, Baroness Bloomfield of Hinton Waldrist said of steam trains, \"An exemption is just not needed because these are not caught within the scope of the Bill”."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}