{
    "url": "https://dwpdigital.blog.gov.uk/2021/07/09/taking-on-imposter-syndrome-and-challenging-ourselves-our-new-digital-voices-start-their-journey/",
    "title": "Taking on imposter syndrome and challenging ourselves: our new Digital Voices start their journey",
    "authors": [
        "DWP Digital team"
    ],
    "categories": [
        "Digital Voices"
    ],
    "pub_date": "2021-07-09T11:56:33+01:00",
    "content": [
        {
            "text": "Digital Voices is our award-winning programme for women in DWP Digital, offering those that take part the opportunity to learn new digital skills and build their confidence."
        },
        {
            "text": "Since the first cohort came together in 2018, Digital Voices has traditionally launched with an event where those involved can share what they hope to achieve from the programme. Lockdown meant that our latest group of Voices were unable to meet up in person, but a recent online event offered those involved the opportunity to introduce themselves and share why they decided to apply for the programme."
        },
        {
            "text": "Here’s what some of the new Digital Voices had to say:"
        },
        {
            "heading": 2,
            "text": "Aliyah Ashraf, associate digital project manager"
        },
        {
            "text": "I’m hoping that Digital Voices will give me the confidence to be me, to articulate my voice and to be more vocal. I’m fairly new to DWP Digital, having started during lockdown. I’ve only met my colleagues once and before then I really struggled to create a rapport. I’m naturally an introvert, and I find it difficult to unmute during meetings and make my voice heard. Sometimes my thoughts are going at 90 miles an hour and my voice can’t keep up with it. So I’m hoping to work on removing those barriers."
        },
        {
            "heading": 2,
            "text": "Andrea McDonnell, senior digital project manager"
        },
        {
            "text": "I am a senior project manager, and I do feel confident in my job, but I’ve always struggled with imposter syndrome. What I’m looking forward to is working with the Digital Voices group, I do still have that monster on my shoulder and it’s something I want to work on. I’m really interested in mindfulness and also the gender balance in our line of work, and I want to develop the skills to speak with others about that. Digital Voices is all about making relationships and supporting each other."
        },
        {
            "heading": 2,
            "text": "Kafui Mbrou, security risk manager"
        },
        {
            "text": "I applied for Digital Voices because I wanted the opportunity to challenge myself and gain confidence, particularly with speaking to people from outside of my area of the business. If I can find my voice, I can then help to bring other people up alongside me as I’ll have been through the process. I’m very nervous but I’m excited about the challenge and sharing my growth."
        },
        {
            "heading": 2,
            "text": "Hannah Dell’Armi, senior agile delivery manager"
        },
        {
            "text": "I do networking and social media already, I’d describe myself as a high-functioning introvert - it doesn’t come naturally. I joined Digital Voices as the thing I really struggle with is public speaking. I always think, do people want to hear my opinion? I’m not always confident about putting myself out there, and I’m hoping this will help me to start."
        },
        {
            "text": "The group has already started their Digital Voices journey with a series of workshops on developing themselves across a range of areas. They’ve also been aligned with friends and mentors from the department who will help them to develop a personal plan based on the particular areas they’re looking to improve."
        }
    ]
}