{
    "url": "https://ukhsa.blog.gov.uk/2021/07/09/understanding-disparities-in-reproductive-health/",
    "title": "Understanding disparities in reproductive health",
    "authors": [
        "Lydia Leon",
        "Faye Callaghan"
    ],
    "categories": [
        "Health Improvement"
    ],
    "pub_date": "2021-07-09T10:03:04+01:00",
    "content": [
        {
            "text": "In 2018 Public Health England (PHE) asked the public about their experiences with reproductive health issues and over 7,500 women and people with female reproductive needs responded."
        },
        {
            "text": "Many told us of their desire for reproductive health problems to be normalised, destigmatised and openly discussed. When they need help, they want to know when and how to seek appropriate care, and to have confidence the care they receive will be managed and communicated well."
        },
        {
            "text": "This feedback led directly to PHE’s work to improve how we measure progress in reproductive health, how we communicate about it and how we support the health system to work better."
        },
        {
            "text": "But while we heard a lot of voices, the people responding didn’t fully represent all parts of our society. Compared to the general population, we didn’t get a representative number of responses from women who identified as Black or South Asian, those living in the most deprived areas and those over the age of 45."
        },
        {
            "text": "That’s why throughout July we’re running a new survey on reproductive health experiences with the London School of Hygiene and Tropical Medicine, and we want to make sure everyone gets their say."
        },
        {
            "heading": 2,
            "text": "Making sure everyone is represented"
        },
        {
            "text": "The recent Commission on Race and Ethnic Disparities report highlighted the mistrust many people from ethnic minority backgrounds have in government services, including healthcare."
        },
        {
            "text": "We know that not all people have the same experiences when it comes to their reproductive health and wellbeing. These variations are normal in any group of people. But what’s not right is that women from certain demographic groups experience far worse outcomes in early pregnancy, infertility, maternity and gynaecological conditions."
        },
        {
            "text": "A recent study in the Lancet showed the risk of miscarriage for Black women is 43% higher than for White women. The most recent report on maternal death showed that rates were almost four times higher for women from Black ethnic backgrounds and almost two times higher for women from Asian ethnic backgrounds, compared to White women."
        },
        {
            "text": "People from ethnic minority backgrounds are also less likely to have a baby following fertility treatment. According to the Human Fertilisation and Embryology Authority, Black patients aged 30-34 have an average birth rate of 23%, compared to 30% for Mixed and White patients. While there are no definitive explanations for these differences, we know that Black patients start IVF almost two years later than the average patient. Why this is the case requires more research, but it could be due to barriers in accessing IVF services"
        },
        {
            "text": "Living in the most disadvantaged parts of the country is also associated with  , higher admissions for conditions such as pelvic inflammatory disease and ectopic pregnancy, higher rates of teenage pregnancy, and a higher abortion rates, potentially indicating difficulties in accessing contraception in these areas."
        },
        {
            "text": "Among lesbian and bisexual women, teenage pregnancy is higher than the national rate and cervical screening rates are also lower. There may be structural or social barriers that need to be addressed to ensure all people feel confident to access the care they need or choose."
        },
        {
            "text": "We also see differences among age groups, for example older women tend to have higher levels of unmet need for contraception and may not seek support for their changing contraceptive needs as they progress through peri-menopause into menopause. We know the pandemic has led to delays in access to reproductive healthcare for some people."
        },
        {
            "text": "But many of these disparities existed before and have been exacerbated over the past year. The root causes are still not well understood despite being visible for some years.  To help us find solutions we need to better understand women’s experiences by asking them directly."
        },
        {
            "heading": 2,
            "text": "Respond to the survey now"
        },
        {
            "text": "So what can you do? Firstly, if you’re a woman or have female reproductive needs, fill in the survey! It’s open until 29th July and takes around 10 minutes. If you use social media, why not make a post about the survey to encourage your networks to fill it in too."
        },
        {
            "text": "Secondly, if you have any links with groups working with women of colour, social disadvantage, older people or youth, we’d love you to contact them to see how they might be able to encourage others to tell us about their experiences through the survey."
        },
        {
            "text": "Reproductive health affects over half the population for most of our lives; let’s get all of us talking about it more so we can improve the experiences we have."
        },
        {
            "text": "To find out more about the survey visit the survey website."
        },
        {
            "text": "Interested in reading more about public health issues? Subscribe to our blog to get updates on new posts."
        }
    ]
}