{
    "url": "https://phescreening.blog.gov.uk/2021/09/30/august-september-2021/",
    "title": "What we blogged about in August and September 2021",
    "authors": [
        "Jonny Fertray"
    ],
    "categories": [
        "General information"
    ],
    "pub_date": "2021-09-30T13:31:06+01:00",
    "content": [
        {
            "text": "Here is a round-up of each and every Public Health England (PHE) screening blog post published in August and September 2021. There were 33 in total."
        },
        {
            "heading": 2,
            "text": "General information"
        },
        {
            "text": "Pinging in the changes – update on text messaging in screening"
        },
        {
            "text": "Text messaging has become an increasingly important tool to communicate and connect with patients."
        },
        {
            "text": "Fourth quarterly KPI data for 2020 to 2021 published"
        },
        {
            "text": "We published the fourth set of quarterly 2020 to 2021 key performance indicator (KPI) data for the NHS screening programmes."
        },
        {
            "text": "Find the screening information you need on GOV.UK"
        },
        {
            "text": "Some handy tips for finding the information you need on GOV.UK."
        },
        {
            "text": "Report published marking 25 years of UK National Screening Committee"
        },
        {
            "text": "We published a report summarising the work of the UK National Screening Committee over the past 25 years."
        },
        {
            "text": "New guidance to help NHS antenatal and newborn screening providers tackle inequalities"
        },
        {
            "text": "New national guidance published to support antenatal and newborn (ANNB) screening providers in addressing inequalities throughout the screening pathway."
        },
        {
            "text": "Your chance to suggest a new NHS screening programme"
        },
        {
            "text": "The 6th annual UK National Screening Committee call for new screening ‘topics’ (conditions) is now open."
        },
        {
            "heading": 2,
            "text": "Breast screening"
        },
        {
            "text": "New guidance to help NHS breast screening providers and commissioners tackle inequalities"
        },
        {
            "text": "New national guidance published to support providers in addressing inequalities throughout the breast screening programme pathway."
        },
        {
            "heading": 2,
            "text": "Bowel cancer screening"
        },
        {
            "text": "NHS bowel cancer screening pathologists lead the way virtually"
        },
        {
            "text": "Read about how the bowel cancer screening pathology study days were held virtually and what's coming next."
        },
        {
            "heading": 2,
            "text": "Cervical screening"
        },
        {
            "text": "Cervical Screening Saves Lives – evaluating the national campaign"
        },
        {
            "text": "The first national ‘Cervical Screening Saves Lives’ campaign ran from 5 March 2019 to 30 April 2019 in England, as part of the wider Be Clear on Cancer initiative."
        },
        {
            "text": "HPValidate sites go live"
        },
        {
            "text": "We have selected 32 sites to take part in the HPValidate study."
        },
        {
            "heading": 2,
            "text": "Diabetic eye screening (DES)"
        },
        {
            "text": "Guidance on managing the NHS diabetic eye screening register updated"
        },
        {
            "text": "We updated guidance on how to manage 'missed individuals' on the DES screening register."
        },
        {
            "text": "Short film helps reassure people about Covid safety of NHS diabetic eye screening clinics"
        },
        {
            "text": "Short film helps reassure people about the measures in place to keep them safe at diabetic eye screening appointments."
        },
        {
            "text": "NHS diabetic eye screening services and the National Diabetes Audit join forces to evaluate diabetes care"
        },
        {
            "text": "All 57 diabetic eye screening providers successfully submitted data to this year’s National Diabetes Audit which now includes a complete picture of the diabetic eye screening care process nationally."
        },
        {
            "heading": 2,
            "text": "Fetal anomaly screening (FASP)"
        },
        {
            "text": "Updated national FASP screening standards published"
        },
        {
            "text": "This is the first major review of the FASP screening standards since they were introduced in 2016."
        },
        {
            "text": "DQASS reporting website goes live"
        },
        {
            "text": "The Down’s syndrome screening quality assurance support service (DQASS) monitors and supports the quality and effectiveness of Down’s syndrome (T21), Edwards’ syndrome (T18) and Patau’s syndrome (T13) screening in England."
        },
        {
            "text": "You said, we did – NIPT result templates"
        },
        {
            "text": "You told us you wanted result templates to provide lower chance results to women following non-invasive prenatal testing (NIPT) screening."
        },
        {
            "heading": 2,
            "text": "Infectious diseases in pregnancy (IDPS) screening"
        },
        {
            "text": "WHO highlights role of screening and vaccination in reaching hepatitis B control targets"
        },
        {
            "text": "The PHE IDPS programme and PHE immunisation team are celebrating after a commendation for the UK in achieving regional hepatitis B control targets."
        },
        {
            "text": "Tell us what you think about the draft IDPS laboratory handbook"
        },
        {
            "text": "The PHE infectious diseases in pregnancy screening (IDPS) programme national team is seeking feedback on a draft version of the updated laboratory handbook."
        },
        {
            "heading": 2,
            "text": "Newborn blood spot (NBS) screening"
        },
        {
            "text": "New resources to help improve quality of samples taken in NHS newborn blood spot screening"
        },
        {
            "text": "When carrying out NHS newborn blood spot (NBS) screening, good quality samples are vital to make sure babies with rare but serious conditions are identified and treated early."
        },
        {
            "text": "When blood spot sample takers need to begin offering SCID screening"
        },
        {
            "text": "Read about the dates blood spot takers need to start offering parents and carers severe combined immunodeficiency (SCID) screening as part of an evaluation in England."
        },
        {
            "text": "Launch of new NHS SCID screening resources for parents and professionals"
        },
        {
            "text": "An evaluation into screening babies for severe combined immunodeficiency (SCID) in England starts on 6 September 2021. This article describes some of the new resources for parents and professionals that have been developed for the evaluation and points you towards where you can find them."
        },
        {
            "text": "SCID e-learning resource launches"
        },
        {
            "text": "We’re really pleased to launch our new SCID screening e-learning resource."
        },
        {
            "text": "Valuable feedback from newborn blood spot failsafe solution (NBSFS) survey"
        },
        {
            "text": "The PHE newborn blood spot (NBS) screening team has analysed results from its evaluation survey of the newborn blood spot failsafe solution."
        },
        {
            "text": "Evaluation launches of newborn screening for SCID in the NHS"
        },
        {
            "text": "An evaluation of newborn blood spot screening for severe combined immunodeficiency (SCID) launches today in some parts of England."
        },
        {
            "text": "The story of Sheila Jones and unlocking the treatment for phenylketonuria"
        },
        {
            "text": "Find out about the first child in the world to receive dietary treatment for phenylketonuria (PKU)."
        },
        {
            "heading": 2,
            "text": "Newborn hearing screening programme"
        },
        {
            "text": "100th candidate completes NHS newborn hearing screening competency assessment"
        },
        {
            "text": "The 100th candidate successfully completed the external competency assessment (ECA) in September 2021."
        },
        {
            "text": "NHSP standards consultation responses and supporting data report published"
        },
        {
            "text": "We have published a summary of the responses received, as well as a data report to provide evidence for the proposed changes in response to comments received."
        },
        {
            "text": "NHS newborn hearing screening: 11 million babies and counting"
        },
        {
            "text": "The NHS Newborn Hearing Screening Programme has played a major role in identifying moderate to profound hearing loss in newborn babies in England and has reached another major milestone, having now screened 11 million babies."
        },
        {
            "heading": 2,
            "text": "Newborn and infant physical examination (NIPE) screening"
        },
        {
            "text": "NIPE screening team celebrates full roll out of SMaRT4NIPE (S4N) IT system and national standards"
        },
        {
            "text": "Read about the full roll out of S4N across England and other recent PHE NIPE screening team achievements."
        },
        {
            "heading": 2,
            "text": "Sickle cell and thalassaemia (SCT) screening"
        },
        {
            "text": "SCT screening support service available for expert advice"
        },
        {
            "text": "The Sickle Cell and Thalassaemia Screening Support Service in Oxford provides expert technical and scientific support to screening services."
        },
        {
            "text": "Time to embed the newborn outcomes solution into clinical practice"
        },
        {
            "text": "Read about the newborn outcomes (NBO) solution, a web-based system for referring newborn babies who screen positive for sickle cell disease (SCD) and thalassaemia."
        },
        {
            "text": "New date for specialist sickle cell and thalassaemia counsellor update course"
        },
        {
            "text": "The team is pleased to announce a new date for the very popular specialist counsellor update course – 8 December 2021."
        },
        {
            "text": "New development in the newborn outcomes solution"
        },
        {
            "text": "Changes to the newborn outcomes solution reflect feedback from users and include improvements for laboratory users and changes to data entry pages for laboratory and clinical (nurse/medical) users."
        },
        {
            "heading": 2,
            "text": "Other new and updated publications"
        },
        {
            "text": "Other new publications we published in August and September included:"
        },
        {
            "text": "Other existing publications we updated in August and September included:"
        }
    ]
}