{
    "url": "https://defradigital.blog.gov.uk/2021/09/30/celebrating-libraries-week-with-the-defra-library-team/",
    "title": "Celebrating Libraries Week with the Defra library team",
    "authors": [
        "Kimberley Stansfield",
        "Laura Graydon"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra services",
        "Open data"
    ],
    "pub_date": "2021-09-30T10:00:48+01:00",
    "content": [
        {
            "text": "We both joined the Defra library team at around the same time earlier this year, having previously worked in public, academic and independent (paid membership) libraries. In a nutshell, the Defra library team provides essential services and resources to enable colleagues to access the information they need for their work. It’s that simple. Well, almost……"
        },
        {
            "text": "Our library is part of the wider Data and Information Access team which sits within the Digital, Data and Technology Services (DDTS) function – the bit of Defra that processes all the IT services and equipment. Although we sit within DDTS, we provide a range of information resources and specialist library services to colleagues across many areas of the department including some of our Arm’s Length Bodies such as the Animal and Plant Health Agency (APHA) and Natural England (NE)."
        },
        {
            "heading": 2,
            "text": "Libraries – supporting all sorts of communities"
        },
        {
            "text": "We thought Libraries Week would be a good opportunity to share our love of libraries and library work. Libraries Week is an annual showcase and celebration of the best that libraries have to offer, with a focus in 2021 on celebrating the role of libraries in supporting active and engaged communities. Although the event is largely focused on the ever-important public libraries, libraries are everywhere, including workplaces, universities, and government departments such as Defra!\n"
        },
        {
            "text": "Like all library officers we pride ourselves on delivering an excellent service. We are a team made up of qualified career librarians and information professionals, with a wide range of experience drawn from a variety of roles in different kinds of libraries."
        },
        {
            "text": "Within our library we have a large electronic collection including e-journals, reference databases and access to e-books. Colleagues need to register if they want to access many of these resources."
        },
        {
            "text": "We also provide access to several specialist alerts so colleagues can get the latest, and most relevant, headline news, delivered straight to their inbox, in the form of in-house produced bulletins and publisher alerts from resources we subscribe to."
        },
        {
            "text": "Through our document delivery service, we can supply a copy of just about any article from other libraries or institutions. That means we can fulfil most requests, no matter how obscure."
        },
        {
            "text": "If colleagues don’t know exactly which resources they’re looking for, we can help by carrying out a literature search to show them what’s available. We also assist with publishing papers in a variety of journals and advise on copyright issues."
        },
        {
            "heading": 2,
            "text": "The early bird, asks the Library team...\n"
        },
        {
            "text": "We do get the occasional, unusual request too. A couple of years ago we had a colleague that really needed to know what was discussed every morning on Farming Today on BBC4 but didn't want to get up at 5.30 to listen. They contacted us to see if we could help. We managed to get hold of the PDFs of the transcripts and added these to the catalogue. They became really popular; as it turned out, there were quite a few people in Defra that had an interest but usually missed the early morning radio programme."
        },
        {
            "text": "Not all of our work is online either. We do have a collection based at the APHA site in Weybridge, for those colleagues who prefer to look through the physical resources themselves. The Weybridge library collection has recently been expanded to include books from Natural England's collection, formerly based at Peterborough and now accessible to staff across Defra."
        },
        {
            "text": "As the bestselling author Neil Gaiman once said, “Google can bring you back 100,000 answers, a librarian can bring you back the right one.” That feels like a fitting message to anyone who’s interested in learning more. After all, that’s what life is about."
        }
    ]
}