{
    "url": "https://nationalscreening.blog.gov.uk/2021/09/30/changes-ahead-for-the-national-screening-system/",
    "title": "Changes ahead for the national screening system",
    "authors": [
        "Nick Johnstone-Waddell"
    ],
    "categories": [
        "General",
        "NHS Abdominal Aortic Aneurysm Screening Programme",
        "NHS Bowel Cancer Screening Programme",
        "NHS Breast Screening Programme",
        "NHS Cervical Screening Programme",
        "NHS Diabetic Eye Screening Programme",
        "NHS Fetal Anomaly Screening Programme",
        "NHS Infectious Diseases in Pregnancy Screening Programme",
        "NHS Newborn and Infant Physical Examination",
        "NHS Newborn Blood Spot Screening Programme",
        "NHS Newborn Hearing Screening Programme",
        "NHS Sickle Cell and Thalassaemia Screening Programme",
        "UK National Screening Committee"
    ],
    "pub_date": "2021-09-30T14:00:09+01:00",
    "content": [
        {
            "text": "Many of us have heard the quote from the Greek philosopher Heraclitus that “there is nothing permanent except change”. I'm sure this could be applied to all our lives in all sorts of different ways but at the moment the big change for many of us is that after 8 years, Public Health England (PHE) will cease to exist from midnight tonight. Whilst that signals a period of change for many of us in public health, it also opens up a number of opportunities for screening."
        },
        {
            "text": "From 1 October, national screening colleagues will be either based in NHS England and Improvement (NHSEI), or the Department of Health and Social Care (DHSC)."
        },
        {
            "heading": 2,
            "text": "NHS England and Improvement"
        },
        {
            "text": "The vast majority of PHE screening colleagues will now be moving into NHSEI."
        },
        {
            "text": "The NHSEI central public health commissioning and operations (PHCO) team is already responsible for the oversight of the commissioning and operational delivery of our NHS screening services. It does this by working with NHSEI regional public health commissioning teams who manage the provider services to meet the service specifications."
        },
        {
            "text": "The national PHE screening programme teams and some cross-programme colleagues (supporting functions such as education and training, and the helpdesk) are moving into the central PHCO team. SQAS colleagues will be moving into the NHSEI medical directorate."
        },
        {
            "heading": 2,
            "text": "Department of Health and Social Care"
        },
        {
            "text": "A small group of colleagues will be moving to DHSC to become part of the new Office for Health Improvement and Disparities (OHID), set up as a home for those PHE functions which will not be moving to the UK Health Security Agency (UKHSA)."
        },
        {
            "text": "The screening team in OHID will include the secretariat for the UK National Screening Committee (UK NSC), and will focus on the evidence base for screening and supporting the NHS to translate the evidence into the best possible screening programmes."
        },
        {
            "heading": 2,
            "text": "Same but different"
        },
        {
            "text": "To borrow a phrase we used when we first became part of PHE in 2013, from tomorrow things will be “the same but different”. We’re all very much focussed on maintaining business as usual, though inevitably people in new organisations and potentially whose roles have changed slightly will need a little time to settle in."
        },
        {
            "text": "We will still be working hard on all our joint priorities and hope that the new system will make it even easier to deliver those significant programme improvements – like the NHS bowel screening age extension and antenatal screening SCID and NIPT evaluations – that keep our NHS screening programmes at the international cutting edge."
        },
        {
            "text": "The screening teams in NHSEI and DHSC will be looking carefully over the next few months at the best ways to keep in touch moving forward and will be publicising any new communications channels in due course. As ever, if you have any ideas of what you'd find useful please let us know."
        },
        {
            "heading": 2,
            "text": "Finally"
        },
        {
            "text": "Whilst change inevitably brings challenges, everyone involved in screening at national, regional and local level remains passionate about supporting our screening services across England to be the very best they can possibly be."
        },
        {
            "text": "So to all of you who work in screening providers or commissioners, or are involved in the research that informs the UK NSC recommendations and that continually makes the programmes better, and to anyone else with an interest or commitment to screening – I'd like to thank you for engaging with us over the last 8 years."
        },
        {
            "text": "All of us, in NHSEI and in DHSC, look forward to carrying on working with you just as effectively in the new system."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "It would be impossible not to mention the success of the PHE Screening blog over the last 6 years. I know that some people were a bit wary when we first set up the blog to replace the old screening newsletters. But you've all taken it to heart and I understand that we've now published almost 1,000 blog articles, have well over 10,000 subscribers and that over 750,000 different people have read the blog since it started back on 24 June 2015 with a look at our new content on GOV.UK."
        },
        {
            "text": "But all good things come to an end and the current blog and Twitter account will be closing (though they'll remain accessible as historical archives)."
        }
    ]
}