{
    "url": "https://deframedia.blog.gov.uk/2021/09/30/defra-responds-to-coverage-of-uk-decision-on-eu-fishing-licensing-applications/",
    "title": "Defra responds to coverage of UK decision on EU fishing licensing applications",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-09-30T11:51:59+01:00",
    "content": [
        {
            "text": "On Tuesday 28th September 2021, the UK government announced the outcome of EU fishing licence applications. This gained broad coverage across national and trade titles, including a front page splash in the Telegraph. Coverage included outlets such as The Times, Financial Times, BBC, the Daily Mail, the Sun, the Daily Express and the Guardian."
        },
        {
            "text": "Further reports of reaction from the French government has been reported on today (30th September 2021) by the Times, Daily Mirror, Daily Mail and Daily Express."
        },
        {
            "text": "Almost 1,700 EU vessels licences have now been licensed to fish in UK waters. Of these, 117 licences have been issued for EU vessels to fish in the 6-12 nautical mile zone."
        },
        {
            "text": "Of 47 applications made for vessels under 12m in length to fish in the UK’s 6-12 nautical mile zone, 12 were granted licences based on the evidence available. Our approach has been reasonable and fully in line with our commitments in the Trade and Cooperation Agreement (TCA)."
        },
        {
            "text": "A UK Government spokesperson said:"
        },
        {
            "text": "The Trade and Cooperation Agreement brought in changes to fishing arrangements between the UK and the EU. The UK is required to grant access to vessels which fished in the relevant parts of the UK’s 6-12 nautical mile zone in four out of five years between 2012 and 2016."
        },
        {
            "text": "The UK requires reasonable evidence to assess applications against the requirements:"
        },
        {
            "text": "The UK has left the EU and as an independent coastal state is committed to sustainable fisheries management. Defra continues to work with counterparts in the Commission and with French authorities."
        },
        {
            "text": "We welcome any further evidence from the EU, using our published methodology, to assess other existing licensing applications from EU vessels. Full licensing criteria is available on the UK Single Issuing Authority’s website."
        }
    ]
}