{
    "url": "https://environmentagency.blog.gov.uk/2021/09/30/environment-agency-takes-to-the-air/",
    "title": "Environment Agency takes to the air",
    "authors": [
        "James Bevan"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2021-09-30T09:48:26+00:00",
    "content": [
        {
            "text": "As organised crime groups get slicker in conducting their criminals operations, so we are finding smarter ways to prevent, disrupt and stop them."
        },
        {
            "text": "Over recent years we have added drones to our crime-fighting armoury as they provide numerous benefits to our regulatory capability. Drones assist our regulatory, compliance and enforcement inspection work, allowing us to take quicker, tougher action. They give us visuals of areas we would not otherwise be able to see safely, reducing the health and safety risk to our officers. They help us offer advice to site operators about how to make their sites more energy-efficient and less impactful on local communities. Drone footage strengthens our court cases, allowing us to demonstrate the scale and impact illegal waste sites have on the environment and communities. And drones improve our incident resilience and operational capability."
        },
        {
            "text": "We have drone pilots across England, coordinated by our National Environment Agency Geomatics Team. All our drone pilots are trained to fly to Civil Aviation standards and we are regularly training up more officers."
        },
        {
            "text": "For example, last year three officers from our Enforcement and Installations teams in the Lincolnshire and Northamptonshire Area were trained to operate a drone. The drone was purchased using money from a Proceeds of Crime order after a successful waste prosecution returned money to the Environment Agency. After seeing the benefits the drone provided, the Area purchased another drone this year with greater capability - a zoom lens and an infrared camera - and trained a further three officers. Since then the team has gone from strength to strength, flying in earnest over thirty times to assess illegal and permitted waste sites and supporting other teams’ work. Surveys and images from the drones greatly assist the Area’s regulatory compliance and enforcement inspection work, capturing the full extent and scale of large sites, showing areas of permitted sites we cannot see from the ground, and quickly demonstrating unacceptable activities to operators. For instance, last year images captured on our drone played a part in assessing the extent and scale of an illegal waste site the size of a football pitch."
        },
        {
            "text": "Our Yorkshire Area have also been using their drone to show the scale and impact of illegal waste sites for investigation purposes, working with partners, including the police. Their drone was first deployed in September 2020 and has flown twelve times so far. Equipped with a thermal imaging camera, it can detect heat emitting from waste and show hotspots which may pose a fire risk. The drone gives a unique perspective of a site, allowing officers to see inaccessible areas, often revealing hidden quantities of waste which may be of higher risk and to check compliance with notices we issue to remove waste. Drones also allow us access to areas which pose dangers to our officers due to unstable ground, mud, roofs or infrastructure which can’t clearly be seen from the ground."
        },
        {
            "text": "After reports of an illegal waste site with complaints of burning, a site in Barnby Dun in South Yorkshire was visited as part of a multi-agency operation tackling metal theft. Although the site turned out to be a low-level risk with a small number of waste vehicles and scrap metal, off the back of our drone footage, the operator cleared the waste within two weeks. A great result for the environment that shows how evidence we collect from our drones can positively influence the behaviour of waste site operators."
        },
        {
            "text": "As well as helping us fight waste crimes, drones are helping us to work with regulated site owners and to demonstrate our work to communities. Infrared cameras on the drones allow our officers to improve their assessments of heat and emission points at regulated sites, help operators improve energy efficiency, and reduce amenity impacts on neighbouring communities. More comprehensive regulatory inspections can be undertaken with drones too, for example assessing roofs, pipework and infrastructure above ground level which are not clearly visible to officers. Drone flights at large, permitted sites mean our officers can achieve regulatory compliance at sites quicker by demonstrating unacceptable excessive waste storage and non-compliance with fire prevention plans, leading to reduced risks should there be an incident."
        },
        {
            "text": "Overall drones are enabling us to work in a smarter, quicker way that is delivering results for the environment and communities, and our fantastic Environment Agency staff are demonstrating increasing innovation and knowledge in how to use drones in the most effective way. As ever, our work is intelligence-led, so the support of legitimate businesses and CIWM members remains important in our fight to eliminate criminals from the waste industry, improve the environment, and support a green economy."
        },
        {
            "text": "Remember you can report any suspicious waste activities anonymously to Crimestoppers: 0800 555 111."
        },
        {
            "text": "First published in the September/October issue of Circular: www.circularonline.co.uk"
        }
    ]
}