{
    "url": "https://ofqual.blog.gov.uk/2021/09/30/exams-and-assessments-2022-fairness-and-clarity/",
    "title": "Exams and Assessments 2022 – fairness and clarity",
    "authors": [
        "Dr Jo Saxton"
    ],
    "categories": [
        "A levels and GCSEs",
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-09-30T06:00:00+01:00",
    "content": [
        {
            "text": "The pandemic has been really tough for students but, despite the challenges, you have shown admirable resilience in the face of the disruption caused to education. "
        },
        {
            "text": "Now, we’re able to look forward to getting back to a greater sense of normality and that applies to next year’s exams and assessments as well. I want to make sure that we all have the clarity and planning in place so that you can concentrate on what really matters, and that’s studying and revising as you prepare to get the best qualifications you can. "
        },
        {
            "text": "As the person who oversees the exam boards delivering exams in England, my commitment to you is to put you first, and to make sure that whatever you are studying – be that GCSE maths, A level art or a diploma in travel and tourism – the end result will be a genuine reflection of your work. "
        },
        {
            "text": "For the past two years, summer exams haven’t been able to take place and, instead, grades have been decided by teachers. "
        },
        {
            "text": "This was the right thing to do during the pandemic as there really was no alternative. "
        },
        {
            "text": "It’s now important for everyone that we start to get back to normality, and that we do so in a fair and sensible way.  "
        },
        {
            "text": "That means getting back to exams, which are set, marked and graded by examiners, with everyone taking the same assessments at the same time, in the same way so that you have a fair chance to show what you know, understand and can do. "
        },
        {
            "text": "It’s also incredibly important that we make sure that for everyone – whether you are studying academic or vocational qualifications – the qualifications you end up with set you up for your future in the best possible way. "
        },
        {
            "text": "We want to get back quickly to how grading was before the pandemic, but we fully understand that students taking exams in 2022 have experienced disruption, so we won't do it in one jump. Instead, 2022 will be a transition year to reflect that we are in a pandemic recovery period. We will aim, therefore, to reflect a point midway between 2021 and 2019 when it comes to grading. Then in 2023 we want to return to results that are in line with those before the pandemic began. "
        },
        {
            "text": "This approach essentially provides a safety net – it recognises the disruption that has been caused and will help those of you who might otherwise just miss out on a higher grade.  "
        },
        {
            "text": "Grading is monitored by the experts every step of the way. As usual, we will review results for each subject before you get them.  "
        },
        {
            "text": "Alongside this, additional measures are being put in place for those of you taking exams and assessments in 2022 to level the playing field, such as some content choice in certain GCSE subjects. In many subjects, exam boards will give you advance information of the focus of some questions to aid your revision, and on other exam papers study aids like formula sheets will be allowed. "
        },
        {
            "text": "We want to make sure that you do as well as you can and we'll be working with examiners to make that happen. "
        },
        {
            "text": "Wishing all of you the very best."
        },
        {
            "text": "Jo Saxton PhD\nChief Regulator"
        }
    ]
}