{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/09/30/fond-farewell-to-fran-leddra/",
    "title": "Fond farewell to Fran Leddra",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Viewpoint"
    ],
    "pub_date": "2021-09-30T11:14:44+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Fran-tastic"
        },
        {
            "text": "I'd like to take this opportunity to say a big thanks to Fran Leddra, who comes to the end of her secondment as joint Chief Social Worker (CSW) for Adults."
        },
        {
            "text": "Fran joined the Department of Health and Social Care in October 2019, from her role as Head of Service at Thurrock Council, alongside Mark Harvey, Director of Disabilities at Hertfordshire Council, to cover the CSW role, as I returned to Australia on special leave to care for my ailing mother."
        },
        {
            "text": "When I returned in May this year, Fran agreed to stay on for another six months, job sharing with me, which has really helped my reintegration back into life here and into the role. I am very grateful for the help and support she has given me and for the amazing work she has done whilst in post."
        },
        {
            "text": "From the word go, Fran made her presence felt and picked up many essential tasks and actions. She went on to make a significant impact in many areas. Fran has successfully helped to shape and influence policy making in the department, which has positively impacted on supporting adults and carers we are here to serve."
        },
        {
            "heading": 2,
            "text": "Engagement on the big issues"
        },
        {
            "text": "She also deepened our engagement with the sector and made sure equalities, diversity, inclusion, mental health and safeguarding have been the big issues on every agenda. Highlights of her time with us include:"
        },
        {
            "text": "And much much more!"
        },
        {
            "heading": 2,
            "text": "Back to the future"
        },
        {
            "text": "Fran is heading back to her full time job as Principal Social Worker (PSW) and Head of Service for Thurrock Council and I know I will continue to rely on her for advice and support."
        },
        {
            "text": "So a big thanks for all she has led on and achieved over the two years in the CSW role. Fran always puts people, families and communities at the centre of care and support. Her commitment to working with people's strengths, helping them achieve the outcomes that matter to them, is underpinned by the principles of human rights and social justice. In this way, she demonstrates the best that social workers can be."
        },
        {
            "text": "Now that I am returning full time, I will continue to build on the great work Fran and Mark have achieved over the last two years."
        }
    ]
}