{
    "url": "https://civilservice.blog.gov.uk/2021/09/30/hacking-the-future/",
    "title": "Hacking the Future",
    "authors": [
        "Paul Morrison, Director of Planning, MHCLG",
        "Alexander Vince, Engagement Lead for the Modernisation and Reform Champions, Cabinet Office"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-09-30T08:47:55+00:00",
    "content": [
        {
            "heading": 3,
            "text": "How the Modernisation and Reform Champions are using new ways to build the future of the Civil Service together"
        },
        {
            "text": "The Civil Service Modernisation and Reform Programme recently launched with the publishing of the Declaration on Government Reform."
        },
        {
            "text": "Cooperation and collaboration are the name of the game, with the Declaration setting out that we must pursue “a willingness to challenge each other candidly, co-operate intensively and be open-minded about what needs to change.” High aspirations - but what does this approach mean in reality?"
        },
        {
            "text": "The Modernisation and Reform Champions - the cross-government network of civil servants who are passionate about change - took this problem away, and came back with the concept of a hack."
        },
        {
            "text": "A HACK? Like, with computers?"
        },
        {
            "text": "No. Well, kind of - the term hack is short for hackathon which originated in the geeky world of software development. It’s an event where participants come together to explore solutions to a knotty problem and team up to produce a working prototype. This can then be built on with more traditional project management. Our Champions applied this idea to the Civil Service."
        },
        {
            "text": "If you want to explore a process, does breaking it down into the biggest stumbling blocks give participants a better ability to understand and adapt it? Returning to live in-person events can help create a buzz, inspire new perspectives and approaches, make new connections and break down barriers."
        },
        {
            "text": "So without further ado, let’s tell you about July’s One Service Hack."
        },
        {
            "text": "What were we seeking to achieve?"
        },
        {
            "text": "Paul Morrison is one of our Modernisation and Reform Champions."
        },
        {
            "text": "A civil servant for 26 years, working across areas as diverse as resettling refugees from war zones, countering radicalisation, and currently on housing and planning, Paul's idea was that our greatest challenges touched all sectors of society. The most effective responses involved these sectors working together, collaboratively tackling challenges using their different approaches, resources and experiences. In short: action beyond simply pondering policy from your desk in Whitehall."
        },
        {
            "text": "What happened?"
        },
        {
            "text": "We designed the hack alongside Yvonne Rees, Chief Executive of Oxfordshire County Council. We invited participants from a range of private, public, higher education and charity organisations, and let them talk to civil servants from across our Champions network. We then set the group the challenge of what it would take to improve collaboration across boundaries - one of the objectives of the Declaration on Government Reform."
        },
        {
            "text": "And off they went! CEOs talked to EOs, NHS leaders chatted to colleagues from Defra, those that spent their life working down south were soon swapping ideas with veteran civil servants from up north."
        },
        {
            "text": "What did we discover?"
        },
        {
            "text": "Our first task was for our groups to prioritise the challenges we faced. We heard that changing culture and behaviours, building trust, and making it easier to find each other were the greatest blockers to collaboration. Some were practical issues around how we are organised, while others were more ethereal, such as challenges around the cultural divides that needed to be resolved."
        },
        {
            "text": "In our second task, we asked the groups which areas of work benefitted most from collaboration. ‘Wicked’, complex problems that transcend organisational boundaries popped up. Issues like tackling childhood obesity, net zero or rehabilitating offenders required multiple organisations with different perspectives and capabilities to come together - highlighting the huge potential to do good if we got this right."
        },
        {
            "text": "What do we want to see?"
        },
        {
            "text": "Firstly, a focus on the micro. We explored creating new spaces to collaborate, to be open to reaching out to each other and to be more curious about the views and contributions of our counterparts."
        },
        {
            "text": "Secondly, a focus on the macro. There was a worry that collaboration couldn’t happen organically. Larger action needed to be taken: developing potential platforms for us to find the right people to collaborate with across organisations; being clearer about our collective purposes and adjusting how we work to encourage collaboration to flourish."
        },
        {
            "text": "What next?"
        },
        {
            "text": "Attendees reported great increases in enthusiasm before and after the event with clearer plans for collaboration (46% before vs 72% after), a better idea of the actions needed to collaborate more effectively (63% before vs 85% after), and a stronger connection with colleagues across public service (49% before vs 80% after)."
        },
        {
            "text": "A great start - but only a start for now. We gained a wealth of data to feed into our own policy teams and built the start of a coalition of delivery. Over the autumn, we will build on this with a range of partners across government and beyond."
        },
        {
            "text": "Thanks to the Whitehall and Industry Group and the National Leadership Centre for their support and wisdom as we pulled this together. Want to find out more? If you’re a civil servant, you can sign up to be a Modernisation and Reform Champion here using your Gov.UK email address."
        }
    ]
}