{
    "url": "https://educationhub.blog.gov.uk/2021/09/how-can-i-train-to-become-an-hgv-driver-your-questions-answered/",
    "title": "How can I train to become an HGV driver? Your questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Adult learning"
    ],
    "pub_date": "2021-09-30T07:00:35+01:00",
    "content": [
        {
            "text": "In September 2021, we announced our investment in new Skills Bootcamps to help people become HGV drivers."
        },
        {
            "text": "To ensure more people can sign up, we’ve boosted capacity to create up to  11,000 HGV driver training places for people that are new, returning to or looking to upskill as a HGV driver. This capacity increase is backed by £34 million in funding, up from £17 million."
        },
        {
            "text": "The free training courses are now underway. They help adults train to be HGV drivers (and gain a Cat C or Cat C&E licence) or help qualified HGV drivers to upskill or return to the industry."
        },
        {
            "text": "To sign up for a Skills Bootcamp in HGV driving, you must be aged 19 or over, employed, self-employed, have recently become unemployed (in the past 12 months) or are returning to work after a break. You will also need to have a full UK driving licence."
        },
        {
            "text": "Courses are available in locations across England and those interested can find out more here: List of Skills Bootcamps - GOV.UK (www.gov.uk)."
        },
        {
            "text": "In addition, people can train through courses accessed locally and funded by the government’s adult education budget."
        },
        {
            "text": "The move will help tackle skills shortages and support more people to launch new careers within the logistics sector."
        },
        {
            "text": "Here we answer your questions on the initiative and what it may mean for you."
        },
        {
            "heading": 3,
            "text": "What Skills Bootcamps are available?"
        },
        {
            "text": "Skills Bootcamps are free, flexible courses that last up to 16 weeks. Participants that are looking for a new job, and successfully complete the course, are also guaranteed a job interview with a local employer."
        },
        {
            "text": "The free, short, intensive HGV courses will train drivers to be road ready, including to gain the relevant licenses and certification, helping to tackle the current HGV driver shortage."
        },
        {
            "text": "You can find out more about Skills Bootcamps here: Free courses for jobs - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Am I eligible to apply for a Skills Bootcamp in HGV driving?"
        },
        {
            "text": "You’re eligible to apply for a Skills Bootcamp in HGV driving if you’re aged 19 or over and are employed, self-employed, have recently become unemployed (in the past 12 months) or are returning to work after a break. You will also need to have a full UK driving licence."
        },
        {
            "text": "Some Skills Bootcamps have additional eligibility criteria, so check with your local Skills Bootcamp provider."
        },
        {
            "text": "There will be a range of courses on offer to suit varying levels of experience, so you may be interested in applying for a Skills Bootcamp in HGV driving if you:"
        },
        {
            "heading": 3,
            "text": "How do I apply to be on a Skills Bootcamp to be an HGV driver?"
        },
        {
            "text": "Information is available here: List of Skills Bootcamps - GOV.UK (www.gov.uk)."
        },
        {
            "text": "You can contact the National Careers Service for advice on these and other options open to you: nationalcareers.service.gov.uk/contact-us."
        },
        {
            "heading": 3,
            "text": "Will I have to pay to do a Skills Bootcamp? "
        },
        {
            "text": "No, Skills Bootcamps training is free of charge to eligible learners."
        },
        {
            "heading": 3,
            "text": "How long will Skills Bootcamps in HGV driving take?"
        },
        {
            "text": "Skills Bootcamps in HGV driving are short, intensive training courses of up to 16 weeks. It may take longer to gain your licence, as this will vary depending on the tests required."
        },
        {
            "heading": 2,
            "text": "Other routes available:"
        },
        {
            "heading": 3,
            "text": "Are there other routes available to help me become an HGV driver? "
        },
        {
            "text": "Yes, there are currently five Level 2 certificates in driving goods vehicles which are available to take now:"
        },
        {
            "text": "If your local provider is offering these courses then you may be able to get funding for both your medical and HGV licences, as part of the government’s adult education budget (AEB). This offer is available between 1 August 2021 and 31 July 2022 and subject to your providers availability."
        },
        {
            "text": "Previously, any adult who took these qualifications had to pay for their own licences."
        },
        {
            "heading": 3,
            "text": "What does the funding cover and am I eligible?"
        },
        {
            "text": "AEB funding will cover a maximum of one test per person and it applies only to the cost of an HGV and medical licence, not the cost of the qualification itself. Taking a course is also subject to availability at your local provider."
        },
        {
            "text": "These existing qualifications are either fully funded by government or co-funded depending on your personal circumstances, such as your age, income, or qualifications you have previously gained."
        },
        {
            "text": "If you fall into one of the following groups, you could also be eligible to have the cost of a Level 2 qualification in HGV driving funded:"
        },
        {
            "text": "Please contact your provider to find out more about the courses on offer and eligibility."
        },
        {
            "heading": 3,
            "text": "What will I learn on the course?"
        },
        {
            "text": "The course will cover all the testing, training and support required to take someone with experience of only driving a car right through to being a road ready HGV driver. The course will equip learners with the skills and knowledge to operate as an HGV driver."
        },
        {
            "text": "AEB qualifications in HGV driving consist of around 150 guided learning hours. The length of time taken to complete the qualifications will depend on the providers who deliver the qualification and the individual circumstances and prior experience of the learner."
        },
        {
            "heading": 3,
            "text": "What steps should I take to access these courses and AEB funding?"
        },
        {
            "text": "If you’re interested in applying for this training, you can find out more by:"
        },
        {
            "text": "Individuals should contact their training provider if they have any questions about the cost of their HGV and medical licences."
        },
        {
            "text": "If you’ve taken one of the courses listed above between 1 August and today, then please contact your provider to find out if your medical and license costs could be backdated and funded by the AEB. This is subject to your providers availability."
        },
        {
            "heading": 3,
            "text": "What skills will be helpful if I want to become an HGV driver? "
        },
        {
            "text": "There are a few skills you will need to possess in order to become an HGV Driver, these include:"
        },
        {
            "heading": 3,
            "text": "Where can I find more information and advice?"
        },
        {
            "text": "For more information on training to become a HGV driver, please visit the Department for Transport’s GOV.UK pages: gov.uk/training-hgv."
        },
        {
            "text": "To discover more free courses and qualifications that could help boost your skills and get ahead in work, read our free courses for jobs guidance: gov.uk/free-courses-for-jobs."
        },
        {
            "text": "If you claim Universal Credit, you can apply for one of these free courses, provided it will improve your chances of securing work. Many Universal Credit claimants can currently take full-time training up to 12 weeks, and up to 16 weeks for a full-time Skills Bootcamp in England. Your local Jobcentre Plus can offer further guidance about this and help to identify the learning that works for you."
        },
        {
            "text": "You can contact the National Careers Service for free, impartial advice and guidance and get help to make informed decisions about learning, training and work."
        },
        {
            "text": "You can also speak to a qualified careers adviser about HGV Driving or other opportunities in your area by visiting: nationalcareers.service.gov.uk/contact-us."
        }
    ]
}