{
    "url": "https://phescreening.blog.gov.uk/2021/09/30/new-resources-to-help-improve-quality-of-samples-taken-in-nhs-newborn-blood-spot-screening/",
    "title": "New resources to help improve quality of samples taken in NHS newborn blood spot screening",
    "authors": [
        "Amy Headley",
        "Michele Seddon",
        "Jane McFarlane"
    ],
    "categories": [
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2021-09-30T11:33:54+01:00",
    "content": [
        {
            "text": "When carrying out NHS newborn blood spot (NBS) screening, good quality samples are vital to make sure babies with rare but serious conditions are identified and treated early."
        },
        {
            "text": "A good quality blood spot sample is one that:"
        },
        {
            "text": "Good quality samples should be obtained first time to prevent the need for avoidable repeats. Avoidable repeat samples can cause anxiety for parents, distress to babies and delays in the screening process. They are also a waste of resources."
        },
        {
            "text": "The NHS NBS Screening Programme monitors the number of avoidable repeats through a screening standard (NBS-S06) and key performance indicator (KPI) (NB2). Meeting the acceptable threshold (≤2% of samples requiring an avoidable repeat) remains a challenge for many maternity providers."
        },
        {
            "heading": 2,
            "text": "How we developed new resources"
        },
        {
            "text": "In January 2020, we published a document to share learning from the best performing maternity units. This was a great start, but we wanted to go further."
        },
        {
            "text": "We knew that some local services had developed their own resources which, in some cases, had helped to reduce their avoidable repeat rates. In order to further share learning, colleagues from the Screening Quality Assurance Service took part in a working group to collate and develop these resources so we could publish them nationally."
        },
        {
            "text": "Providers were asked to share any locally-produced documents they had found helpful. The working group reviewed and amended them so they could be shared more widely. These amended resources were then approved by a national task and finish group."
        },
        {
            "text": "The final resources include:"
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "Thanks go to the following organisations who kindly agreed to share their resources with us:"
        }
    ]
}