{
    "url": "https://teaching.blog.gov.uk/2021/09/30/our-journey-with-the-national-tutoring-programme-ntp/",
    "title": "Our journey with the National Tutoring Programme (NTP)",
    "authors": [
        "David Benson"
    ],
    "categories": [
        "COVID-19 support",
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2021-09-30T14:27:37+01:00",
    "content": [
        {
            "text": "David Benson is Principal of Kensington Aldridge Academy, a large inner London school with 1,300 pupils in years 7 to 13. David shares how his school has encouraged participation in the NTP by working with students and parents over the past year and why it’s important for them to continue to use the NTP to reach more pupils this academic year."
        },
        {
            "heading": 3,
            "text": "Looking back at our first year with the NTP"
        },
        {
            "text": "When we first found out about the NTP we were keen to understand how to make the most of it. We had worked with tutors in a limited way before the pandemic, so we know that 1-2-1 and small group tutoring can make a big difference as pupils receive more feedback, are more engaged and receive work more tailored to their specific needs."
        },
        {
            "text": "Over the last school year, we used Tuition Partners from the NTP service, and overall, it has been successful. We have used tutoring where we felt it will make the most difference, which tends to be students from disadvantaged backgrounds, who for various reasons will really benefit from having a tutor. That could be a high-potential Year 13 student who struggled with remote learning in the lockdowns and needs extra support to achieve their university offer, or a Year 11 student who risks underachieving in English and Maths GCSE because of behaviour and attendance issues."
        },
        {
            "text": "Students have felt better supported after working with NTP tutors and valued the encouragement they provided. They particularly benefited from the chance to ask questions and complete exam practice, with a tutor there to guide them. Some of our NTP pupils from last year are now starting university courses in Medicine or at Oxbridge."
        },
        {
            "text": "Although our experience has been positive, as with most new programmes, there have been some practical issues which we worked with NTP to resolve. We needed to access tutors in specialist subjects and to proactively engage students and parents. Over time we learned to better coordinate with the NTP providers around supply, and better motivate and monitor students. Overall, the NTP is making a big difference to the vast majority of those who have engaged with it."
        },
        {
            "heading": 3,
            "text": "Looking ahead to our second year with the NTP"
        },
        {
            "text": "Based on school feedback, we are pleased to hear that from September 2021 we will be able to use a special grant fund payment to pay our own staff and local resource to tutor our students. This will help complement the existing supply of NTP tutors available and ensure that we can meet the needs of as many of our pupils as possible."
        },
        {
            "text": "As the NTP continues, this will play a key part in achieving our aim that, long term, no student’s education should be adversely impacted because of the COVID-19 pandemic. It means those students who need it most, and stand to benefit most, can be provided with quality 1-2-1 academic support to address any gaps. With new systems this year at the academy, such as a simplified application form for parents or students to request tutoring, and direct marketing in assemblies, form time and parent events, we are confident that we will reach significantly more students this year than last."
        },
        {
            "text": "Register your school via the NTP website"
        }
    ]
}