{
    "url": "https://phescreening.blog.gov.uk/2021/09/30/pinging-in-the-changes-update-on-text-messaging-in-screening/",
    "title": "Pinging in the changes – update on text messaging in screening",
    "authors": [
        "Amish Acharya"
    ],
    "categories": [
        "General information"
    ],
    "pub_date": "2021-09-30T10:58:40+01:00",
    "content": [
        {
            "text": "Text messaging has become an increasingly important tool to communicate and connect with patients."
        },
        {
            "text": "Whether it is to provide a GP’s endorsement or to remind people of an upcoming appointment, texts are a versatile and low-cost way of helping people to navigate screening."
        },
        {
            "text": "Text messages have also been shown to help break down barriers – in some circumstances they have helped increase screening attendance rates by as much as 5%."
        },
        {
            "heading": 2,
            "text": "Challenges for screening"
        },
        {
            "text": "Screening, however, can present unique challenges when it comes to text messages."
        },
        {
            "text": "Unlike outpatient or GP appointments, where a patient may be expecting to be contacted, people may not necessarily have had any experience with screening services sending them messages."
        },
        {
            "text": "In addition, programmes must send messages to thousands of people, each with differing communication, health, and accessibility needs."
        },
        {
            "text": "Making these messages universally acceptable and non-coercive is crucial, but can be difficult."
        },
        {
            "heading": 2,
            "text": "Establishing the principles"
        },
        {
            "text": "This work used the available evidence to provide initial recommendations on how screening services could implement text messaging. The original principles focused on 5 main areas: content, timing, security and governance, evaluation and delivery."
        },
        {
            "heading": 2,
            "text": "Taking things forward"
        },
        {
            "text": "However, mobile technology and messaging continues to evolve. Therefore, the Institute of Global Health Innovation at Imperial College London and Public Health England (PHE) Screening looked to:"
        },
        {
            "heading": 3,
            "text": "User research"
        },
        {
            "text": "There were a lot of things to consider when we embarked upon the next stage of research into text messaging in screening. For example, the fact that each local screening service will have its own needs and specifications."
        },
        {
            "text": "To address this in the latest study, we used a modified Delphi design – which is where is where you recruit experts and get them to repeatedly vote on things until you reach consensus."
        },
        {
            "text": "Despite the COVID-19 pandemic, we managed to recruit more than 30 experts with a broad range of experience in different programmes from across England. We presented experts with open-ended prompts to gain a better understanding of the issues involved in messaging in screening."
        },
        {
            "text": "We also invited a large public group to give us their opinions online on various messaging topics."
        },
        {
            "heading": 3,
            "text": "Updating the 5 principles"
        },
        {
            "text": "Using the results from both information gathering rounds, as well as the evidence synthesis, we then developed potential recommendations for screening text messaging – expanding on the original principles."
        },
        {
            "text": "More than 100 potential recommendations were presented to the experts, and they were asked to vote on how important an item was to screening services and how feasible it would be to introduce the recommendation."
        },
        {
            "text": "This process was repeated over 2 cycles with previous anonymous expert ratings, public comments, and the guidance of specialist departments (for example, the National Cyber Security Centre), to see how the voting changed."
        },
        {
            "text": "Despite busy schedules and tackling the pandemic, we were amazed and grateful to find all of those recruited responded."
        },
        {
            "heading": 3,
            "text": "Fine tuning"
        },
        {
            "text": "The findings were then discussed in a structured meeting, so that experts had a further opportunity to raise any potential issues they foresaw."
        },
        {
            "text": "From our work we have managed to put together a list of core recommendations on screening text messaging that experts and the public feel are important and feasible to follow."
        },
        {
            "text": "We have also managed to find areas that are considered important, but not yet easily implemented into screening mobile messaging. As technology and capabilities evolve, these desired areas maybe potentially of use, and could be further explored in the future."
        },
        {
            "heading": 2,
            "text": "Publication and next steps"
        },
        {
            "text": "We are now looking to make our findings widely available to all stakeholders and are working with PHE colleagues to update the current text messaging principles on the GOV.UK website. We will also be publishing our work in an academic journal."
        },
        {
            "text": "The next steps for this project would be to see how these core and desired items differ across healthcare systems internationally. This will help us compare and learn from international experiences."
        }
    ]
}