{
    "url": "https://naturalengland.blog.gov.uk/2021/09/30/the-story-of-the-cotswold-water-park-sssi/",
    "title": "The Story of the Cotswold Water Park SSSI",
    "authors": [
        "Claire Minett"
    ],
    "categories": [
        "Biodiversity",
        "Protected sites and species",
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2021-09-30T14:54:32+01:00",
    "content": [
        {
            "text": "The Cotswold Water Park was created and continues to expand as a result of mineral mining activity across Gloucestershire, Wiltshire and Oxfordshire. It comprises of over 170 lakes, and is an incredibly important place for biodiversity, recreation, continued mineral operations and education. The mixture of all these activities side by side really does make Cotswold Water Park a very special and unique place. "
        },
        {
            "text": " Just 10 out of more than 150 lakes were designated as a Site of Scientific Special Interest (SSSI) back in 1984, but since then, and with more lakes being created, the bird and aquatic plant populations have continued to grow. It now holds over 35,000 wintering waterbirds and significant numbers of breeding birds including little ringed plover, little egret and nightingale. The scrub and reedbed are full of breeding warblers including reed, sedge and Cetti’s warblers, blackcaps and willow warblers. The Park is also nationally important for four species of stonewort including the lovely pointed stonewort. This makes it nationally significant and therefore Natural England have expanded the designation to include 177 lakes.  "
        },
        {
            "text": "The Cotswold Water Park is a very dynamic place, with ongoing mineral and significant recreation activities. The wildlife has thrived alongside these activities, and in many cases, it is these activities that have supported the wildlife by creating the different mosaics of habitats required by different species. Examples of this include sailing clubs regularly pollarding trees and angling clubs maintaining scrub around their angling lakes. Many owners actively manage the lakes and surrounding habitat for the benefit of wildlife, and some lakes are specifically kept for conservation. All of this has contributed to the wildlife we see today, with birds being able to move to different lakes at different times, and therefore are able to thrive alongside recreation. "
        },
        {
            "text": "So why does the Cotswold water Park need an expanded SSSI designation? "
        },
        {
            "text": "The quantity and quality of the wildlife is now nationally important, and it is Natural England statutory duty to recognise this. In addition without a wider designation future development proposal on the existing lakes could really begin to have an impact on bird and plant communities. Rather than the increases we had been seeing over the last 10 years, the scenario that we would begin to see declines was a very real threat. "
        },
        {
            "text": "  "
        },
        {
            "text": "This expanded designation means that the wildlife can now be considered as part of all future developments to ensure all needs are balanced and wildlife can continue to thrive. It will not significantly impact on current activities but will ensure that for future developments wildlife is considered. "
        },
        {
            "text": "Partnership working is key in the Cotswold Water Park. The Cotswold Lakes Trust is a charity dedicated to the conservation and enhancement of the Cotswold Water Park for the benefit of wildlife and people and aims to bring all stakeholders together and Natural England works very closely with them along with the owners and occupiers across the Cotswold Water Park. "
        },
        {
            "text": "A further unique aspect to the Cotswold Water Park is that RAF Fairford operates here. It is of course paramount that RAF Fairford are able to operate safely and effectively and therefore we have worked closely with them to ensure that they can continue to carry out the necessary management plans that are essential for their operations.  "
        },
        {
            "text": "The designation is the culmination of seven years of work by Natural England staff to assess the evidence for SSSI status and work with local people who have an interest in the site, including businesses, landowners and the Ministry of Defence. We are committed to maintaining these important relationships and meeting the future needs of stakeholders, including a framework so that bird hazard management, which is essential to air safety, can continue to take place in a setting which is also of high value for nature on a landscape scale. "
        },
        {
            "text": "As a large and evolving SSSI, Cotswold Water Park can play a vital role as we develop the Nature Recovery Network. Both new and existing SSSIs play a central role in this network. Natural England looks forward to continuing to work with all stakeholders across the Cotswold Water Park to ensure that it remains a fantastic example of how people and wildlife can thrive hand in hand."
        }
    ]
}