{
    "url": "https://companieshouse.blog.gov.uk/2021/09/30/understanding-how-to-measure-business-health-as-a-company-director/",
    "title": "Understanding how to measure business health as a company director",
    "authors": [
        "Keith Tully - Partner at Real Business Rescue"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-09-30T12:09:07+01:00",
    "content": [
        {
            "text": "As the director of a limited company, it’s your responsibility to act in the best interests of the company and safeguard the financial health of your business."
        },
        {
            "text": "You’ll need to plan to make sure your business can stay viable in the event of trading uncertainty and unprecedented market conditions."
        },
        {
            "text": "Your business can also deteriorate if you do not keep a watchful eye on the financial performance of your business."
        },
        {
            "text": "Understanding how to measure business health can increase your chances of survival and reduce the likelihood of experiencing long-term financial distress. Without this knowledge, your business could experience irreversible damage and face legal action from unhappy creditors."
        },
        {
            "text": "Here, we run through your responsibilities as a company director concerning the financial health of your business."
        },
        {
            "heading": 2,
            "text": "Director responsibilities when running a limited company"
        },
        {
            "text": "As a company director, it’s your duty to promote the success of the business and support business relationships with key stakeholders, such as:"
        },
        {
            "text": "In the event of financial difficulty, you’ll need to act in the best interests of creditors. Creditors are any party that are owed money."
        },
        {
            "text": "If your company is unable to maintain financial commitments and settle outstanding debts due to restricted cash flow, you’re likely to come under serious pressure from creditors. You also may face threats of legal action, in the form of a winding up petition."
        },
        {
            "text": "It’s your responsibility to take appropriate action to mitigate the potential collapse of your company. You can do this by seeking professional support from a licensed insolvency practitioner."
        },
        {
            "text": "If you fail to seek specialist guidance, you could expose your business to serious financial and reputational damage, and this could lead to company liquidation."
        },
        {
            "text": "The cash flow and balance sheet tests for insolvency are checks that you can perform to track where your business ranks on the scale of financial distress."
        },
        {
            "heading": 2,
            "text": "Cash flow test for insolvency"
        },
        {
            "text": "A cash flow test for insolvency is a straightforward analysis of company cash flow to check if your company is contingently insolvent. To understand a cash flow test for insolvency, company directors need to recognise the use of company cash flow."
        },
        {
            "text": "Cash flow is used to carry out day-to-day company operations and make essential payments to keep the business ticking, such as:"
        },
        {
            "text": "If company cash flow falls short, the company could quickly gather debts and run out of cash. As the bottom line, if the business cannot afford to make these payments when they’re due, the business may be insolvent."
        },
        {
            "heading": 2,
            "text": "Balance sheet test for insolvency"
        },
        {
            "text": "A balance sheet test for insolvency tracks company assets and company liabilities. If the money you owe to creditors outweighs the value of your company assets, this may suggest balance sheet insolvency."
        },
        {
            "text": "Company assets can be classed as anything the company owns that holds value, such as property, machinery, equipment, or stock, which if liquidated, could raise money to wipe off the debts of the business. When calculating company assets, you should take note of the existing market value of company assets and leave out bad debts."
        },
        {
            "text": "As well as the cash flow and balance sheet test for insolvency, analysing the way creditors are treating you can paint an accurate image of how serious the situation is."
        },
        {
            "heading": 2,
            "text": "Creditor pressure and business debts"
        },
        {
            "text": "If your relationship with creditors is strained because of overdue payments, interactions are likely to be tense and this can result in urgent payment reminders and final notices."
        },
        {
            "text": "This may suggest that creditors are thinking about legal action. If creditors cannot recover funds after using standard routes to chase payments, their final resort may be to launch a winding up petition against your company - if the amount owed is £750 or more."
        },
        {
            "text": "A winding up petition can result in company liquidation if a winding up order is granted by the court. By respecting your director responsibilities and turning to a licensed insolvency practitioner, you can stop the forced closure of your business. A formal insolvency procedure to rescue your business will be pursued."
        },
        {
            "text": "If your company enters company liquidation or administration, you must put creditor interests at the forefront of your agenda. Breaching director responsibilities -such as trading while insolvent -can result in serious consequences, including the end of your role as company director."
        },
        {
            "text": "Seek professional advice from a licensed insolvency practitioner at the first sign of financial difficulty to minimise the impact on the company and creditors."
        }
    ]
}