{
    "url": "https://phescreening.blog.gov.uk/2021/09/30/updated-national-fasp-screening-standards-published/",
    "title": "Updated national FASP screening standards published",
    "authors": [
        "Rebecca Al-Ausi",
        "Siobhan Alt"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme"
    ],
    "pub_date": "2021-09-30T10:07:16+01:00",
    "content": [
        {
            "text": "We are pleased to publish the updated NHS Fetal Anomaly Screening Programme (FASP) screening standards. This is the first major review of the FASP screening standards since they were introduced in 2016."
        },
        {
            "text": "We have updated these standards in line with our national approach to setting screening standards and they will be valid for data collected from 1 April 2022. Hopefully this gives you lots of time to look at the standards and prepare for any changes before data collection starts."
        },
        {
            "text": "Standards provide reliable and timely information about the quality of screening services at local, regional and national levels. Local providers should aim to meet performance thresholds for each national standard to make sure screening services are safe and effective."
        },
        {
            "text": "We would like to thank the various members of the task and finish group who led the revision and to all of you who provided feedback during the 8-week public consultation."
        },
        {
            "heading": 2,
            "text": "Summary of changes"
        },
        {
            "text": "We highlight some changes here but the full list of changes can be found in the supporting information."
        },
        {
            "text": "In terms of general changes we have:"
        },
        {
            "heading": 2,
            "text": "Specific changes"
        },
        {
            "text": "We would also like to highlight some specific changes to the following standards."
        },
        {
            "text": "In both FASP-S01 (coverage: T21/T18/T13 screening) and FASP-S02 (coverage: 20-week screening scan) we have made changes to the exclusion category."
        },
        {
            "text": "In both standards, the exclusion ‘women who choose to have private screening and do not wish to have NHS screening’ was moved to the subset of declines. This is because women who have had private screening are still eligible for, and should be offered, NHS FASP screening."
        },
        {
            "text": "In FASP-S02, the exclusion ‘women who are offered an appointment within the optimum time but choose to attend at a different time for personal reasons’ was moved to the subset of women left to follow up. This is because evidence shows this is masking inequalities in some services. The removal of this exclusion will have minimal impact on performance at an England level."
        },
        {
            "heading": 3,
            "text": "FASP-S03: diagnosis/intervention: test turnaround time quantitative fluorescent-polymerase chain reaction (QF-PCR)"
        },
        {
            "text": "This is one of the standards we had to renumber but you will remember it as the old FASP-S09. This revised standard will look at test turnaround times for QF-PCR testing only."
        },
        {
            "text": "The National Congenital Anomaly and Rare Disease Registration Service (NCARDRS) will collect data on this standard."
        },
        {
            "heading": 3,
            "text": "FASP-S04: test: 20-week screening scan"
        },
        {
            "text": "We added 2 new conditions. These are:"
        },
        {
            "text": "These conditions were added to FASP-S04 to drive improvements in detection rates."
        },
        {
            "text": "NCARDRS data shows that coarctation of the aorta has the highest number of diagnoses of all cardiac conditions not currently part of FASP-S04. There are no changes to the ultrasound requirements and practitioners should continue to use the 3 vessel and trachea (3VT) view as part of the existing fetal cardiac protocol."
        },
        {
            "text": "We recommend ultrasound practitioners performing the 20-week screening scan should complete the fetal cardiac e-learning resource every 24 months."
        },
        {
            "text": "Congenital diaphragmatic hernia (CDH) was added because NCARDRS data shows regional variations in detection rates. Antenatal diagnosis of CDH also leads to significantly improved health outcomes. This condition can be assessed using the existing base menu."
        },
        {
            "text": "Revised performance thresholds are:"
        },
        {
            "heading": 3,
            "text": "FASP-S06: test: inadequate samples for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome"
        },
        {
            "text": "This standard was implemented in April 2020 and is collected quarterly as the KPI FA4. During the first year of collection we validated the data to resolve any issues and improve data quality. We also analysed the data at maternity service level in order to set performance thresholds from 2021 to 2022 . These are:"
        },
        {
            "text": "We have not set thresholds for the achievable levels yet. We’ll keep the data under review and look to set achievable thresholds in the future."
        },
        {
            "heading": 3,
            "text": "FASP-S07: referral: timeliness to information and support (T21/T18/T13)"
        },
        {
            "text": "The definition now refers to timeliness of attendance at an appointment either virtual or face to face. This was changed from ‘offer of appointment’ due to data quality issues."
        },
        {
            "heading": 3,
            "text": "FASP-S08: referral: timeliness to intervention (20-week screening scan)"
        },
        {
            "text": "NCARDRS will now report on this standard to improve data completeness and quality."
        },
        {
            "text": "Revised performance thresholds are:"
        },
        {
            "text": "Please report all unexpected findings at 20 week screening scan and following referral scans to NCARDRS in as close to real time as possible."
        }
    ]
}