{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/29/carers-rights-day/",
    "title": "Carers Rights Day",
    "authors": [
        "Vicki Chalker"
    ],
    "categories": [
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-11-29T20:41:13+00:00",
    "content": [
        {
            "text": "Blog for carer’s rights day (November 25 2021)"
        },
        {
            "text": "Carers Rights Day - Carers UK"
        },
        {
            "text": "Caring for Mum with Dementia, Christine Maggs, Joint Nature Conservation Committee. Chair Government Science and Engineering Diversity and Inclusion Action Womens Group"
        },
        {
            "text": "Yesterday, following cremation at Kensal Green, we had a celebratory memorial service in the afternoon for my mum.  She was 95 years old, a true original.  Following wartime evacuation to the US, she studied medicine at the Royal Free Medical School, graduating in 1951. After an internship in Jamaica, she worked in the family practice in north-west London.  She married and had four children while working full-time and contributing to our dad’s small family company.  She was indomitable, loved to win, and cared for all around her."
        },
        {
            "text": "My family’s experience follows the typical caring cycle – we end up caring for those who cared for us."
        },
        {
            "text": "We grew up in London knowing that mum was there to help and support us.  She fostered our individual interests and careers – and we benefitted enormously from her experience."
        },
        {
            "text": "One day when visiting I noticed that plant pots in the garden were labelled, but the labels were from other unrelated plants. My sister who lived in London and was helping mum, found labels on the fruit in the fruit bowl. Mum’s judgement was slipping in many areas (though she never lost her ability to navigate!).  It became clear that mum knew she had dementia, and it gradually progressed. Her own mother had died aged 89 with dementia; mum was 87 when my father died."
        },
        {
            "text": "Our family discussed her future care.  Her car was given away – I grieved the end of her autonomy but of course it was the right decision.  My sister came in daily, and often found mum on the ground in the garden after falling - her personal alarm was never used.  Following a job change, when mum was 90, I moved into her house – I had a long commute to Peterborough. As a working scientist in the Joint Nature Conservation Committee, my employer was very supportive, providing me with the critical flexibility I needed to care for my mum and help to establish a system of care for the longer term.  Mum wouldn’t eat unless I ate with her, so I had to race back for dinner at 6.30.  Initially we were supported by untrained helpers but this didn’t work at all as her behaviour was often challenging.  It was quickly clear that we needed professional carers for dementia sufferers.  When the agency carers moved in, each for one week, I usually tried to keep out of their way.  The washing machine was always on."
        },
        {
            "text": "During this period of co-habitation I understood how hard the job is for a professional carer, with an impossible act balancing the needs of the client for dignity, legality, nutrition, cleanliness and social company, while maintaining reasonable working hours and living conditions for the carer.  I had followed dementia research in my previous job at Bournemouth University, so I used what I had learned to try to amuse mum, particularly at the weekends.  I bought her glittery jewelled frogs from Malaysia, and pop-up children’s books, which she loved at first.  Soon we needed night-time carers too, and this quickly led to residential care, where the staff were amazingly kind and caring – but then had their activities restricted by Covid which badly affected the care home."
        },
        {
            "text": "For many families, hiring paid carers system is not an option.  Being an unpaid family carer is usually socially isolating, and often extremely so.  Covid has had devastating consequences for carers, exacerbating isolation.  The campaign for carers rights is really important to address financial and social problems.  So often, the carer is so busy caring that he or she has no access to financial or social support.  Awareness raising is essential, as is making resources widely available."
        },
        {
            "text": "Caring is the greatest gift we can offer to those around us. Carers are needed to help so many people in society, of all ages. I cared for my own mum as she had and recovered from a stroke, and now care for my two teenagers who each have difficulties. The majority of people we work with will have a caring role and a caring need at some point in their lives. The stress of caring and the isolation can be huge and being able to work and maintain that aspect of yourself is very important. As colleagues, managers and fellow human beings it is important we offer compassion and understanding to those in caring roles, enabling them space and support to offer the care they need to give their loved ones dignity. I would like to thank Christine for offering her support for all carers, especially at a time of such loss."
        },
        {
            "text": "For more information on carers rights please check your organisational carers policy and this website Carers Rights Day - Carers UK"
        },
        {
            "text": "Carers have the right to."
        },
        {
            "text": "Vicki Chalker\nHead of Science and Engineering Profession UK Health Security Agency, Chair Government Science and Engineering Diversity and Inclusion Action Group"
        }
    ]
}