{
    "url": "https://defrafarming.blog.gov.uk/2021/11/29/how-farmers-in-protected-landscapes-are-using-their-funding/",
    "title": "How farmers in protected landscapes are using their funding",
    "authors": [
        "Kate Corfield"
    ],
    "categories": [
        "Payments to support parks, AONBs and Broads"
    ],
    "pub_date": "2021-11-29T12:33:09+00:00",
    "content": [
        {
            "text": "You might remember that the Farming in Protected Landscapes programme opened for applications in July.  "
        },
        {
            "text": "In August, we shared a video made by some of our Protected Landscape colleagues about the sorts of projects that were eligible for funding.  "
        },
        {
            "text": "In this post, I’d like to share some examples of the things land managers and farmers are doing with their funding.  "
        },
        {
            "heading": 2,
            "text": "The New Forest National Park "
        },
        {
            "text": "The New Forest National Park is supporting a project on an area of farmland used as back up grazing by commoners. The project will improve the landscape character of that part of the park which is next to the New Forest Site of Special Scientific Interest (SSSI)."
        },
        {
            "text": "Improvements will include: "
        },
        {
            "text": "The project will also help to protect and enhance a rare fen habitat on the land by managing scrub and pollarding invading willows.  "
        },
        {
            "heading": 2,
            "text": "The North Pennines Area of Outstanding Natural Beauty "
        },
        {
            "text": "The North Pennines AONB Partnership supported a local farmer to work with Eden Rivers Trust, to ‘re-wiggle’ a 230m long section of a beck in east Cumbria.  "
        },
        {
            "text": "The beck had been historically straightened and partly culverted, but the restoration project re-aligns it on a meandering route and restores lost habitat features which will greatly boost nature recovery. "
        },
        {
            "heading": 2,
            "text": "Dorset Area of Outstanding Natural Beauty "
        },
        {
            "text": "With funding, a dairy farmer in the Dorset Area of Outstanding Natural Beauty is going to be able to protect the habitat of a recently discovered breeding colony of the Duke of Burgundy butterfly.  "
        },
        {
            "text": "The Duke of Burgundy butterfly has conservation status. They’ll be able to use the funding to fence off the habitat to enable exclusion of cattle during the most sensitive periods of the butterfly lifecycle.  "
        },
        {
            "heading": 2,
            "text": "The Broads National Park "
        },
        {
            "text": "In the Broads National Park, an arable farmer will build a storage reservoir with surrounding landscaping.  "
        },
        {
            "text": "This will be a place for the farmer to store rainwater for summer irrigation. It will also create and connect wildlife habitats. This is important in this dry part of the country. "
        },
        {
            "text": "Funding will also help to improve the Ant Broads and the Marshes - a Site of Special Scientific Interest (SSSI). It will also help to retain jobs.  "
        },
        {
            "heading": 2,
            "text": "Find out more  "
        },
        {
            "text": "We know there are lots of other exciting ideas in the pipeline and we would continue to encourage farmers and land managers to get in touch with their local Protected Landscapes to see how the programme could work for you.  "
        },
        {
            "text": "For more information about the programme and to find out whether you could be eligible to receive funding, please visit the Farming in Protected Landscapes page on GOV.UK.  "
        },
        {
            "text": "The projects I’ve mentioned in this post are just getting started. We look forward to finding out more about how they get on. We’ll update you on the progress of projects across the programme as things develop. In the meantime, if you have any questions about our work, leave a comment below. "
        }
    ]
}