{
    "url": "https://hodigital.blog.gov.uk/2021/11/29/how-inclusive-services-help-us-to-deliver-effectively/",
    "title": "How inclusive services help us to deliver effectively",
    "authors": [
        "David Caldwell, Head of Accessibility and Digital Inclusion"
    ],
    "categories": [
        "Accessibility",
        "DDaT Strategy"
    ],
    "pub_date": "2021-11-29T14:19:25+00:00",
    "content": [
        {
            "text": "Recently, we published our new Digital, Data and Technology (DDaT) Strategy for the Home Office. The strategy includes our commitment on accessibility because we know that to deliver effectively, we need to deliver services that work for everyone:"
        },
        {
            "text": "Building services that can be used by everyone has always been an important part of how we digitise government services. We’re now ensuring we build accessible services in a consistent and scalable way."
        },
        {
            "text": "To ensure our commitment to accessibility is consistent, we’re working on an action plan using four principles:"
        },
        {
            "text": "We wanted to share some our thoughts on these principles to bring them to life."
        },
        {
            "heading": 2,
            "text": "Focusing on users over minimum compliance"
        },
        {
            "text": "As a public sector body, we have a legal responsibility to ensure that our services meet a minimum level of accessibility – the Web Content Accessibility Guidelines (WCAG) 2.1 level AA. But that doesn’t mean that’s where we should stop. We know that a fully compliant service doesn’t necessarily mean it’s going to be fully accessible."
        },
        {
            "text": "That’s why we want to take a user-centred approach to accessibility and go beyond the minimum expectations of WCAG and the Public Sector Bodies (Website and Mobile Application) Accessibility Regulations (PSBAR)."
        },
        {
            "text": "Being product-centric is a key aspect of the DDaT Strategy and to do this we need multi-skilled teams and a clear focus on what users need.  This means including User Researchers who can work with disabled users to understand their needs and help us to go beyond the minimum levels expected for making our services accessible."
        },
        {
            "heading": 2,
            "text": "Factoring accessibility into the entire product development lifecycle"
        },
        {
            "text": "For most services, accessibility should not be a once and done activity or one we only consider right at the end. By ensuring that we embed accessibility in our delivery from the start, we keep the costs of delivering accessible services to a minimum while building services that work for the widest range of people possible."
        },
        {
            "text": "We’ll do this by encouraging our teams to embed accessibility as part of the acceptance criteria and definitions of done for delivery."
        },
        {
            "text": "We’ll ensure that we make evidence-based decisions about how accessible our services are. That means we’ll have to prove our services are accessible throughout their lifecycle and carry out assurance activity to monitor this regularly."
        },
        {
            "text": "When we work with other organisations we’ll ensure they understand our accessibility requirements and check that they’re able to meet them."
        },
        {
            "heading": 2,
            "text": "Treating accessibility as a team sport"
        },
        {
            "text": "We believe that every team member is jointly responsible for ensuring the product they create is inclusive and accessible."
        },
        {
            "text": "It’s why we talk about accessibility being a team sport. To make this possible, we need to have a shared understanding of what different people in product teams should be doing in relation to accessibility."
        },
        {
            "text": "We’re taking inspiration from our colleagues in the Department for Work and Pensions (DWP) who have written about what the different roles in a team should be concentrating on. The most important aspect of this is ensuring everyone is aware of their role and that everyone works collectively to deliver an accessible product."
        },
        {
            "text": "This team approach doesn’t do away with accessibility specialists. They continue to play a vital role in supporting teams to better understand their responsibilities, provide guidance and training as well as carrying out assurance activity."
        },
        {
            "heading": 2,
            "text": "Investing in building accessibility knowledge and skills"
        },
        {
            "text": "We recognise that without investing in developing our people, we can’t embed accessibility across everything we do."
        },
        {
            "text": "We are investing time, energy and resources in our accessibility training across the DDaT profession to ensure that everyone has the knowledge and skills to deliver a consistently accessible experience for our users."
        },
        {
            "text": "We are ensuring that we have guidance and support available to help us remove some of the ambiguity that exists within some elements of accessibility standards."
        },
        {
            "text": "We’re creating a guidance hub for accessibility that provides a ‘single voice’ on accessibility for the Home Office in order to ensure a consistent and reliable source of guidance for our teams. Our aim is that this hub becomes our one stop shop for everything accessible – removing challenges around access to internal systems and being open about our work."
        },
        {
            "heading": 2,
            "text": "Developing a shared action plan to embed accessibility"
        },
        {
            "text": "We’re continuing to work across the department to embed accessibility across teams and to develop more detailed action and delivery plans to bring these principles to life."
        },
        {
            "text": "We’ve started a working group of leaders from across our portfolios and functional areas as well as subject matter experts from areas like user research, governance and assurance in order to co-create a shared action plan for the department."
        }
    ]
}