{
    "url": "https://deframedia.blog.gov.uk/2021/11/29/national-tree-week-launch-media-coverage/",
    "title": "National Tree Week launch media coverage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-11-29T12:23:55+00:00",
    "content": [
        {
            "text": "There has been positive coverage of our announcement that we are launching a new coastal community forest in Cumbria, on the first day of National Tree Week (Monday 29 November – Sunday 5 December) in the Daily Mail, News and Star, the North-West Evening Mail, Forestry Journal, Horticulture Week and Cumbria Crack.. Coverage notes how 370 acres of trees, woodlands and forests will be planted over the next five years, expanding to over 12,000 acres in the next 25 years."
        },
        {
            "text": "The Daily Mail carries a supportive quote from Paul Nolan, Chairman of England’s Community Forests organisation and quotes from Lord Goldsmith are carried in the Horticulture Week, Forestry Journal and News and Star coverage."
        },
        {
            "text": "Forestry Commission chair Sir William Worsley was interviewed by BBC Look North (NE & Cumbria), Heart Radio (North Lancashire and Cumbria)/Smooth Radio (Lake District), CFM and BBC Radio Cumbria. He discussed the economic and social reasons why Cumbria was chosen, and how this community forest will factor into wider Government net zero ambitions."
        },
        {
            "text": "There is also positive regional coverage of our second National Tree Week announcement about projects receiving funding to plant hundreds of thousands more trees through various funds in the Evening Standard, Yorkshire Post (p. 2) and the Gazette. Over £12 million will be allocated to the successful applicants to four funds supporting tree planting efforts for future generations: 260,000 trees will be planted outside of woodlands as a result of this funding announcement"
        },
        {
            "text": "Forestry Minister, Lord Goldsmith, said:"
        },
        {
            "text": "Forestry Commission Chair, Sir William Worsley said:"
        },
        {
            "text": "Defra and the Forestry Commission have a variety of flexible grants which offer strong financial incentives for planting trees where they are most needed. The grants cover different areas – from support to plan new woodlands, making urban areas greener, developing carbon markets, and to increase domestic planting stock – and are targeted at different audiences – including farmers and landowners, communities, eNGOs, local authorities, and individuals."
        },
        {
            "text": "A summary of all Defra and Forestry Commission grants and support available for tree planting can be found here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}