{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/29/the-importance-of-the-workplace-adjustment-passport-for-civil-service-employees/",
    "title": "The importance of the Workplace Adjustment Passport for Civil Service employees",
    "authors": [
        "Misty Gilbert"
    ],
    "categories": [
        "Diversity & Inclusion"
    ],
    "pub_date": "2021-11-29T21:58:45+00:00",
    "content": [
        {
            "text": "The importance of the Workplace Adjustment Passport for Civil Service employees"
        },
        {
            "text": "What is a Workplace Adjustment Passport?"
        },
        {
            "text": "The Workplace Adjustment Passport is a very helpful tool to support employees with a disability, health condition or those who are undergoing gender reassignment in the workplace."
        },
        {
            "text": "Knowledge and uptake of these passports can be scarce as lots of employees are unaware of their existence, but this blog aims to highlight how important and useful they can be."
        },
        {
            "text": "What are the main functions of the passports?"
        },
        {
            "text": "Passports have many functions including:"
        },
        {
            "text": "What would I need to do?"
        },
        {
            "text": "Completion of the passport is voluntary. You have control over the content and who it is shared with. Complete your personal details in the boxes provided, include as much detail as you feel is appropriate. Share a copy of your passport with your line manager and discuss the details so that they can understand how to support you."
        },
        {
            "text": "My experience"
        },
        {
            "text": "I have a mobility disability and require adjustments in place to support me at work. I have found the passport to be very useful, particularly when I have had a new line manager or when I have changed government departments. The key is the term “passport” – the document goes wherever I do in my career journey! For me, the passport has also been a useful prompt to re-assess any current adjustments that are in place and assess whether they are still sufficient or whether changes/additions are required."
        },
        {
            "text": "The exchange of information that the passport allows has been so beneficial to me in terms of ensuring that I have all the tools, tailored support and appropriate workplace adjustments in place, that I need to thrive in the workplace. I would encourage anyone to give them a try."
        },
        {
            "text": "The Workplace Adjustment Passport is such a sensible and simple intervention that makes such a difference to an individual when they join a new team, or their line manager changes. However, its use is, at best, patchy with many staff unaware of its existence and in the case of managers, many lack training on what to do when presented with one. Whilst I am heartened to see recent promotion of this tool in some areas of government, knowledge of such basic support needs to become the norm rather than the exception."
        },
        {
            "text": "David Kenyon Chair of GSE Disability work stream and Head of Diagnostics, Wildlife & Molecular Biology, Scottish Government Agriculture and Rural Economy Directorate"
        }
    ]
}