{
    "url": "https://forestrycommission.blog.gov.uk/2021/11/29/tree-production-innovation-fund-success-stories/",
    "title": "Tree Production Innovation Fund Success Stories",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2021-11-29T08:00:16+00:00",
    "content": [
        {
            "text": "Earlier this year the Tree Production Innovation Fund (TPIF) was launched to support innovative projects that will enhance the quantity, quality and diversity of tree planting stock available for planting in England."
        },
        {
            "text": "The Forestry Commission have had a fantastic response to the fund, receiving a total of 31 applications including collaborations between researchers, nurseries, seed suppliers and industry. Through the TPIF, over £1million will be made available to support 16 successful projects between October 2021 and March 2022."
        },
        {
            "text": "Projects will develop innovative technologies and ways of working to overcome current barriers to tree production, addressing one or more of the following three TPIF Challenges:"
        },
        {
            "heading": 2,
            "text": "Challenge 1"
        },
        {
            "text": "How can we make better use of available seed and vegetative planting material to maximise the quantity, quality and diversity of trees produced?"
        },
        {
            "heading": 2,
            "text": "Challenge 2"
        },
        {
            "text": "How can we develop growing systems to enhance their efficiency and resilience to change, whilst delivering improved quality and diversity of product? This challenge can include activities to promote biosecurity."
        },
        {
            "heading": 2,
            "text": "Challenge 3"
        },
        {
            "text": "How can innovative environmentally sustainable weed control solutions be used to reduce reliance on herbicides?"
        },
        {
            "heading": 2,
            "text": "The successful projects"
        },
        {
            "text": "Mark Appleton, Managing Director at Maelor:"
        },
        {
            "text": "David Farquhar, CEO of IGS:"
        }
    ]
}