{
    "url": "https://civilservice.blog.gov.uk/2021/11/29/virtual-reality-job-inductions-in-the-pandemic-and-beyond/",
    "title": "Virtual reality: job inductions in the pandemic and beyond ",
    "authors": [
        "Carrie Griffin"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2021-11-29T10:10:14+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Carrie Griffin from the Government Skills and Curriculum Unit shares how the new cross-Civil Service online induction course is shaping up."
        },
        {
            "text": "“Like so many others, I joined [the Civil Service] during the pandemic. My colleagues were very welcoming, but it isn't the same as meeting in person. I'm hoping this induction will help me develop a sense of belonging to the Civil Service, and the stories on this page have begun to do that.”"
        },
        {
            "text": "This is just one new starter’s view in the new online Induction to the Civil Service course piloted many times this year, as part of the Government Campus. The bulk of the 1,700 participants in the early pilots joined the Civil Service during the pandemic. Few had met their colleagues face-to-face, or even seen inside their new workplace."
        },
        {
            "text": "Stories are a great way to promote learning. The induction course has benefited from including individual and team stories, generated by the Civil Service Awards and Operational Delivery Profession, and through case studies provided by colleagues from the Department for Work and Pensions. ‘Learning with a human face’ has gained even greater value during this period of enforced isolation away from colleagues."
        },
        {
            "text": "As well as using real-life stories and scenarios to convey crucial information, the course is experimenting using a digital platform: FutureLearn. This is designed to promote ‘social learning’ via a prominent comments section accompanying every article, poll, and activity."
        },
        {
            "text": "This invites participants to share their personal stories, examples and opinions. It is incredibly useful to point out gaps and inconsistencies in the learning material and to suggest ways of improving the course. The design tries hard to bring ‘peer learning’ to life. Feedback from participants regarding Futurelearn and its accessibility have been hugely positive."
        },
        {
            "text": "Why focus on induction?"
        },
        {
            "text": "Around 40,000 people join the Civil Service every year. They might be school leavers who’ve never worked in an office, or they may be experienced professionals from another sector. Either way, we want to provide them with a superb, professional induction which equips them for their job and career, as part of A Modern Civil Service."
        },
        {
            "text": "We need to motivate our new colleagues, to ensure they’re aware from the very start of the responsibilities and opportunities that come with being a civil servant. And then we want to introduce them to the bigger picture of government."
        },
        {
            "text": "The bulk of induction is carried out by departments, agencies and professions - by their learning and development teams, business units and line managers. "
        },
        {
            "text": "We’ve taken early steps to build a network of induction leads across the Civil Service. GSCU will support this network to grow an active community, sharing evidence, good practice and resources. The network already has more than 200 members."
        },
        {
            "text": "The Declaration on Government Reform commits to a mandatory induction package. There is also a strong demand from departments for a central induction to the Civil Service, to complement their own programmes which inspired the pilot of the Induction to the Civil Service course. "
        },
        {
            "text": "Mindset, not a moment"
        },
        {
            "text": "Induction is incredibly valuable, but can also be fragile - how many people ever reach the end of their induction checklist before being overtaken by the pressures of the day job? "
        },
        {
            "text": "This is why we need induction to be a mindset, not a moment. Otherwise, the moment can easily be lost - and we’ve already lost millions of informal moments of workplace induction during the pandemic. "
        },
        {
            "text": "There’s also an issue of fairness. A recent report by the Social Mobility Commission revealed that lacking the right skills, mentors and confidence to ‘navigate the labyrinth’ can hold people back from progression across the Civil Service, especially for colleagues from lower socio-economic backgrounds."
        },
        {
            "text": "Given this need to navigate unwritten codes and ‘grey zones’, helping to demystify the Civil Service and making a start on building informal networks should help. "
        },
        {
            "text": "The induction teams across the Civil Service will do their best to get people off to a good start. Then it’s over to you - as a line manager, team member, mentor or buddy - to help your new colleagues build their knowledge, skills and networks, and truly flourish in a Civil Service career."
        },
        {
            "text": "Sign up to the Induction to the Civil Service course:"
        },
        {
            "text": "If you have any other questions relating to the CS Induction, please email the GSCU induction team. Visit www.gov.uk/gscu to find out more about the cross-Civil Service induction programme and the Government Campus."
        }
    ]
}