{
    "url": "https://insidehmcts.blog.gov.uk/2021/11/29/working-together-in-wales-to-respond-to-the-pandemic/",
    "title": "Working together in Wales to respond to the pandemic",
    "authors": [
        "Luigi Strinati"
    ],
    "categories": [
        "COVID-19",
        "Working at HMCTS"
    ],
    "pub_date": "2021-11-29T14:15:59+00:00",
    "content": [
        {
            "text": "As Delivery Director in Wales, I’ve seen first-hand over the last 18 months how challenging times bring people together to work towards a common goal. In Wales, we already have a close network of colleagues across the criminal justice system, but the pandemic tested and strengthened those relationships. We all focused our efforts on keeping the wheels of justice turning for those most in need."
        },
        {
            "text": "The first lockdown in March 2020 placed an enormous pressure on the court system, as social distancing and safety measures limited the number of trials that could be heard in our buildings. Recognising the impact this would have on those waiting for their day in court, we established a Criminal Justice in Wales (CJiW) Recovery Group. The group – made up of Police and Crime Commissioners (PCCs), Chief Police Officers, the Crown Prosecution Service, Youth Justice Service and Probation and Prison Service in Wales – worked together to make necessary changes and ensure we moved forward quickly in response to the pandemic."
        },
        {
            "text": "A collaborative effort for a speedy response and robust recovery"
        },
        {
            "text": "With a shared ambition and joint approach to hearing the voices of all those relying on the criminal justice system in Wales, we’ve created a positive and constructive team from across the criminal justice system. This team supported our agile response as we strove to understand the changing external environment, put safety measures in place and keep our courts and tribunals operating safely and effectively."
        },
        {
            "text": "We’re now seeing the effects of this 18 months of hard work – not least to increase capacity across Wales – and there are encouraging signs that we are well on the road to recovery. In fact, in the Magistrates Courts the delays caused by the pandemic have been dealt with and work is listed on receipt.  In our Crown Courts, West and North Wales can only be described as a success story, whilst in South Wales, we continue to move at pace and are making steady inroads into the backlog."
        },
        {
            "text": "And this is thanks to everyone's willingness to work together. From day one, CJiW partners worked together to minimise the impact of the pandemic on victims, witnesses, defendants, professionals and court users involved in active cases. No organisation could have done this without the other. The co-operation and speed of our recovery is a real testament to the CJiW partnership in Wales."
        },
        {
            "text": "Together, we worked to:"
        },
        {
            "text": "Positive feedback for HMCTS"
        },
        {
            "text": "Regular dialogue between Welsh Government, Public Health Wales, and the operational arms of the Ministry of Justice have been critical in keeping our staff, court users and judiciary safe. Balancing strategic, operational and political input alongside trusted relationships proved invaluable in working together to resolve some of the complex challenges presented by the pandemic."
        },
        {
            "text": "Alun Michael, the PCC for South Wales, wrote to me in March this year and said the following;"
        },
        {
            "text": "And Dafydd Llywelyn, PCC for Dyfed Powys also recognised our joint working:"
        },
        {
            "text": "Andy Dunbobbin, the PCC for North Wales said:"
        },
        {
            "text": "I’m incredibly proud to receive such feedback from people who’ve worked with us through one of the most challenging times we’ve ever faced. And I'm grateful to all of my team, and our colleagues outside HMCTS, who work so hard to make sure justice is being delivered in a timely and effective manner across Wales."
        },
        {
            "text": "The recovery group was extremely helpful to everyone – not just to court recovery – so we have turned it into a permanent steering group. We still meet regularly so that this joint working ethos continues to deliver justice for all across Wales."
        }
    ]
}