{
    "url": "https://deframedia.blog.gov.uk/2021/08/25/beaver-consultation-launch-media-coverage/",
    "title": "Beaver consultation launch media coverage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-08-25T11:26:53+01:00",
    "content": [
        {
            "text": "Consultation launched to seek views on the cautious release and management of beavers into the wild"
        },
        {
            "text": "There has been coverage of our consultation to release beavers into the wild in England in PA, the Times, BBC News, Sky News, the Guardian, The Daily Mail, The Independent, The Daily Express (print coverage), GB News, The Mirror, Devon Live, and more."
        },
        {
            "text": "Natural England Chair Tony Juniper was interviewed by Farming Today, Times Radio, LBC and Sky News. He discussed the multiple benefits to nature recovery that beavers can bring, including positive effects on water quality and in some catchments the smoothing out of flood peaks reducing danger downstream. Beaver meadows can also catch organic material containing carbon."
        },
        {
            "text": "The consultation follows a successful reintroduction in Devon – the River Otter beavers reintroduction trial – which over five-years brought a wealth of benefits to the local area and ecology, including enhancing the environment at a local wildlife site, creating wetland habitat, and reducing flood risk for housing downstream."
        },
        {
            "text": "Secretary of State George Eustice said:"
        },
        {
            "text": "We are committed to providing opportunities to reintroduce formerly native species, such as beavers, where the benefits for the environment, people and the economy are clear."
        },
        {
            "text": "Today marks a significant milestone for the reintroduction of beavers in the wild, with the launch of the Government’s consultation on our national approach and management of beavers in England."
        },
        {
            "text": "But we also understand that there are implications for landowners, so we are taking a cautious approach to ensure that all potential impacts are carefully considered."
        },
        {
            "text": "Beavers can play a hugely significant role in helping to restore nature to England. Widely referred to as ‘ecosystem engineers’, they create dams from trees, mud and rocks, which raise water levels, creating pools and wetland habitats which support the recovery of a wide range of native species."
        },
        {
            "text": "Chair of Natural England, Tony Juniper, said:"
        },
        {
            "text": "The launch of Defra’s consultation today marks an important and positive moment for the future of these wonderful animals in England. Beavers are not only fascinating creatures in their own right, but are also ecosystem engineers that will play a key role in restoring and linking habitats, in the process bringing many environmental benefits, like we have seen in the highly successful River Otter trial in Devon – hugely positive transformations, including the creation of wetland habitat, improving water quality and smoothing flood peaks."
        },
        {
            "text": "I encourage everyone to respond, so that the way we shape the future of wild Beavers reflects as many perspectives as possible."
        },
        {
            "text": "Harry Barton, Chief Executive, Devon Wildlife Trust, said:"
        },
        {
            "text": "\"Beavers are the most amazing animals, capable of transforming our rivers and wetlands for the better. Our work on the River Otter Beaver Trial, and the work of The Wildlife Trusts elsewhere, has shown that these natural engineers can provide an impressive range of services from storing climate-changing carbon to flood alleviation. We believe it’s a top priority for nature’s recovery to see their return to rivers across England.\""
        },
        {
            "text": "Responses to the consultation will be used to inform decisions on the approach to further releases of beavers into the wild in England. A summary of responses will be published in early 2022."
        },
        {
            "text": "The consultation will be live on gov.uk at 9:30am, Wednesday 25 August."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}