{
    "url": "https://marinescience.blog.gov.uk/2021/08/25/cefas-bequeathed-priceless-biological-reference-collection/",
    "title": "Cefas bequeathed priceless biological reference collection",
    "authors": [
        "Rachell Hartnell"
    ],
    "categories": [
        "Aquaculture",
        "Seafood Hazards"
    ],
    "pub_date": "2021-08-25T09:00:46+01:00",
    "content": [
        {
            "text": "Safe and sustainable seafood is the core focus of research teams in Cefas’ Weymouth lab, investigating a range of hazards including bacteria, viruses and naturally occurring toxins that impact either human or animal health. Recently Cefas was bequeathed an entire bacterial sample collection that will contribute to future developments in the research of one such hazard Vibrio parahaemolyticus (Vp), a naturally occurring Gram-negative bacterium frequently present in marine and estuarine habitats."
        },
        {
            "text": "Globally, human pathogenic subtypes of Vp cause hundreds of thousands of infections every year often following consumption of raw, lightly cooked, or incorrectly processed or stored molluscs, crustacea and other seafoods. In the environment Vp distribution and abundance is strongly associated with warming seawater and decreasing salinity, with greater prevalence in warmer, low salinity waters – thus as a seafood hazard Vp is intimately linked to impacts of climate change on our seas and aquatic food supply chains. In Cefas our work on Vp stretches across the organisation and reaches into our microbiology, genomics, bioinformatics, Geographic Information Systems (GIS), epidemiology, predictive modelling, and data visualisation toolboxes. Our work is truly collaborative, multidisciplinary, and international with strong links through academia, with the World Health Organisation (WHO) and the UN’s Food and Agriculture Organisation (FAO), and through our networks of experts around the world. One such expert with a longstanding affiliation with us, was the eminent Cefas Emeritus Associate, Professor Mitsuaki Nishibuchi, from University of Kyoto, Japan.  "
        },
        {
            "text": "In June 2019, after a long battle with Parkinson’s disease, Prof. Nishibuchi (Buchi-san) very sadly passed away leaving a huge space in the global Vp research community. In an extraordinary act of generosity, and a testament to our longstanding relationship, Buchi-san bequeathed his entire Vp strain collection to Cefas. Cefas colleagues and their counterparts at the University of Kyoto, cooperated so that earlier this year we signed a Memorandum of Understanding (MOU) covering the transfer and future use of the collection. We received the first batch of isolates in 2021 and have been busy checking that the strains survived their 6,000-mile journey. Over the next few months, the food safety microbiology team will be characterising these novel and geographically diverse isolates which comprise pathotypes spanning almost half a century, including the earliest Vp isolates implicated in human disease. Once complete we will add this unique biological resource to our open access linked databases of Vp strains via the FAO Reference Centre for Bivalve Mollusc Sanitation online-tool, enabling researchers in Cefas, and from around the world to access information supporting studies on comparative virulence mechanisms, method development, pathogen evolution, food safety risk assessment, impacts of environmental change  and much more."
        },
        {
            "text": "We are so proud to be the new custodians of Buchi-san’s priceless Vp collection, enabling his legacy to continue the development of new science and scientists in this fascinating and important area – we hope that he would be too."
        }
    ]
}