{
    "url": "https://marinescience.blog.gov.uk/2021/08/25/cefas-evidence-supports-successful-prosecution-in-the-environment-agency-verses-southern-water-wastewater-permit-breaches-case/",
    "title": "Cefas evidence supports successful prosecution in the Environment Agency versus Southern Water wastewater permit breaches case",
    "authors": [
        "Simon Kershaw"
    ],
    "categories": [
        "Aquaculture",
        "Seafood Hazards"
    ],
    "pub_date": "2021-08-25T13:00:20+01:00",
    "content": [
        {
            "text": "Southern Water have recently been fined a record £90m for deliberately pouring sewage into sea. The Environment Agency also highlighted their response to the case which saw 6,971 unpermitted sewage discharges taking place in Kent, Hampshire and Sussex between 2010 and 2015. Cefas’ involvement in this successful prosecution is a tangible example of how our water quality research makes a real difference to supporting production of safe seafood."
        },
        {
            "text": "Cefas was called upon to provide scientific support for the Environment Agency’s prosecution case regarding Southern Water causing major environmental harm to shellfish waters. These pollution events negatively impacted businesses and community groups, with discharges into designated shellfish waters causing a long-term deterioration in the shellfish flesh quality, leaving some areas unsuitable for harvesting shellfish for human consumption and resulting in lost business for shellfish producers."
        },
        {
            "text": "What advice has Cefas provided in support of this case?"
        },
        {
            "text": "Cefas supported the Environment Agency in providing scientific assessment and expert witness representation.  In 2017, under contract to the Environment Agency (EA), Cefas produced a report on 'Overflows and Environmental Impact' to inform the EA's Operation Garden investigation, the largest criminal investigation in the EA’s 25-year history. This report focused on the impact and potential impact of unpermitted sewage discharges affecting commercially important bivalve mollusc (e.g. oyster and mussels) shellfish beds and the shellfish protected areas of The Swale, North Kent."
        },
        {
            "text": "The Cefas report concluded that in relation to human health risk, the frequency and duration of sewage spills in The Swale during the period 2010–2015 were likely to present the potential for an elevated risk to human health from consumption of contaminated shellfish. Work undertaken predicted that levels of norovirus in shellfish for the period of the un-permitted discharges exceeded the average levels obtained in shellfish samples from elsewhere, that have been linked to cases of norovirus illness."
        },
        {
            "text": "Further to this Simon Kershaw, Principal Scientist and water quality advisor in our Food Safety Group, gave evidence as an expert witness on behalf of the Environment Agency at Canterbury Combined Court. Simon's expert opinion concluded that unpermitted overflows of untreated or partially treated sewage represent an increased risk to public health. "
        },
        {
            "text": "Simon shared his thoughts, “It was good to see Cefas’ scientific expertise and all the water quality work the Food Safety teams have been involved with to protect shellfish waters, being put to effective use. Recognising the environmental and economic damage that sewer overflow spills cause is vital to ensure that water companies are held to account and going forward that the environment is better protected.”"
        },
        {
            "text": "Additional evidence provided by Cefas included a report, Sanitary Survey Report - Swale and Thames shellfish harvesting areas dated 2013.  Sanitary surveys provide a detailed qualitative assessment of pollution sources potentially impacting on commercial bivalve mollusc shellfish beds in an area and make recommendations for an appropriate sampling plan for ongoing shellfish hygiene monitoring. Between 2007 and 2015 Cefas produced similar reports for all shellfish harvesting areas in England and Wales on behalf of the Food Standards Agency, includes of Kent and the Solent."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}