{
    "url": "https://environmentagency.blog.gov.uk/2021/08/25/every-days-a-school-day-enhancing-our-sustainability-knowledge/",
    "title": "Every day’s a school day – enhancing our sustainability knowledge",
    "authors": [
        "Simon Dawes"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-08-25T11:36:38+00:00",
    "content": [
        {
            "text": "Every day is a school day, so they say. Well it can be if we want it to be – and now all of our staff, suppliers and even our Defra colleagues have access to almost 3,000 new online resources to learn more about sustainability."
        },
        {
            "text": "That’s because we’ve just joined the Supply Chain Sustainability School (SCSS) – a network of members with similar commitments to ours, who want to share learning and accelerate the transition to a low carbon, sustainable, built environment. All members can access a library of thousands of bits of training, online learning, events and networking opportunities, for free."
        },
        {
            "text": "We’re one of the first government organisations to join the school, and that’s indicative of our ambition to lead the way in terms of sustainability. But we also know we don’t have all the answers. We want to learn, share, grow, explore, and influence where we can."
        },
        {
            "text": "As head of sustainable business strategy for the Environment Agency, and part of a small yet agile team helping to deliver that strategy, I’ve led on our work to set out our net zero strategy. Earlier this year, we revealed our roadmap for reaching net zero by 2030, in which we’ve committed to cutting our emissions by at least 45% by 2030 and then offsetting the rest."
        },
        {
            "text": "That includes not just our own direct emissions, but our scope 3 emissions, too – emissions from our supply chain."
        },
        {
            "text": "84% of our total carbon footprint comes from our supply chain. That shows just how important our work with them will be. How we interact with our supply chain – including what we ask them to deliver and how – will have a huge impact on not just our progress against our net zero goals, but also on our resource consumption, what social value we can deliver through our supply chain, and how we protect and enhance nature."
        },
        {
            "text": "We’re introducing a new supplier charter outlining our values. We’re asking our suppliers to report back to us on their emissions and reduce their footprint, and we’re tracking their progress."
        },
        {
            "text": "But first, we’re making sure everyone has the right knowledge and tools."
        },
        {
            "text": "The SCSS offers a wealth of those. Our people will be able to dive in and choose courses for their individual learning plans, and we’ll be encouraging our suppliers and customers to explore what it can offer for them, too. There’s great learning in there and I’ve signed up and enhanced my knowledge."
        },
        {
            "text": "We’d encourage all our partners to have a look too – you can register for free here. With COP 26 on the horizon, and on the back of the recent IPCC report on climate change, there’s never been a better time to boost your knowledge and arm ourselves for the changes we know we need to make happen."
        },
        {
            "text": "And if you have thoughts, questions or feedback about our net zero commitments, we’d love to hear from you – get in touch at EANetZero@environment-agency.gov.uk."
        }
    ]
}