{
    "url": "https://rpc.blog.gov.uk/2021/08/25/independent-scrutiny-and-the-better-regulation-framework/",
    "title": "Independent scrutiny and the Better Regulation Framework",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-08-25T18:58:14+01:00",
    "content": [
        {
            "text": "The government proposes dozens of regulations every year, many of which introduce significant new costs for businesses and civil society organisations (CSOs)."
        },
        {
            "text": "The UK’s better regulation system has been developed by successive governments over the past 2 decades and aims to ensure that an evidence-based approach is taken to decisions on regulation, and that the potential costs and benefits are taken into account when regulations are introduced."
        },
        {
            "text": "We the RPC exist to provide independent scrutiny at key stages of this process. Independent challenge and support of the sort we provide is highly regarded internationally and helps to improve the evidence and analysis informing the government’s decisions and the transparency of the process."
        },
        {
            "text": "The government is currently consulting on reforming the better regulation process. We welcome this. It is a timely opportunity to build on what is good about the current system and improve it in a number of important areas."
        },
        {
            "text": "We set out below why we think independent scrutiny should remain a key component of the system and our views on how it can contribute most effectively."
        },
        {
            "heading": 2,
            "text": "The value of independent scrutiny"
        },
        {
            "text": "Independent scrutiny helps government to regulate in a way that reflects the needs and concerns of business and civil society stakeholders."
        },
        {
            "text": "It brings an independent analytical perspective to the decision-making process. The pressures that government faces can result in a tendency to focus on the issues that matter to those making the decision and lose sight of the impacts on those affected by them – including unintended consequences. Independent expert input can help to ensure that these impacts are properly factored in and that the evidence and analysis underpinning the proposals are robust."
        },
        {
            "text": "It delivers accountability and transparency to external stakeholders. It strikes a balance between offering confidential input and publishing opinions and other material that are used by ministers in finalising proposals, and Parliament in its democratic scrutiny role."
        },
        {
            "text": "It facilitates the sharing of best practice across government. The RPC works alongside the government analytical community to provide training, best-practice case studies and support and to ensure that previous lessons are fed back into the system."
        },
        {
            "text": "An independent advisory panel like the RPC provides external expert scrutiny in a way that is both efficient and sensitive to the necessary internal processes that are required in policy development. At the same time, the transparency it involves provides reassurance to Parliament and external stakeholders that decision-makers are properly considering impacts on those being regulated (or allows them to challenge them where they have concerns)."
        },
        {
            "heading": 2,
            "text": "What would make the UK system even better?"
        },
        {
            "text": "We currently consider impact assessments (IAs) at what is called ‘final stage’ – we produce an opinion on the IA that is signed off by ministers and then presented to Parliament. These opinions rate the costs presented in the IA as ‘green’ (fit-for-purpose) or ‘red’ (not fit-for-purpose)."
        },
        {
            "text": "We have argued previously that we could add more value if involved earlier in the process of developing regulatory proposals and that this would help to streamline the process."
        },
        {
            "text": "We think that independent scrutiny can be most effective if used at 3 stages of the process."
        },
        {
            "heading": 3,
            "text": "1. Scrutiny in advance of consultation – to assess policy options and see if regulation is needed at all"
        },
        {
            "text": "Best practice policy-making involves assessing a range of different options for achieving the policy objective and then identifying a preferred option that best meets the objectives by maximising the net benefits (net of costs). Some of the policy options may not involve government regulation at all (for example self-regulatory approaches may be more effective at achieving the objectives; or the measure may introduce costs or unintended consequences that outweigh the benefits)."
        },
        {
            "text": "In the current system, the RPC is often only able to comment on options after the alternatives to regulation have been considered and discarded, and we cannot ‘red rate’ on this aspect of an IA. We support the early gateway proposed in the consultation document, so that independent input can ensure a rigorous approach to considering alternative policy options at an early stage of policy development."
        },
        {
            "text": "Our earlier blog post makes the case for scrutiny of IAs ahead of consulting on regulatory proposals. Independent scrutiny at this stage would both allow a more timely consideration of options and offer external input to ensure that the consultation takes the opportunity to solicit the best evidence on impacts."
        },
        {
            "text": "An early requirement for scrutiny would also allow a more streamlined approach later in the policy development process. Where non-regulatory approaches are adopted these would not need further IAs, while for regulatory proposals that are taken forward, the rationale and options may not need to be described for a second time. This should enable the ‘final stage’ IA to focus on the evidence and analysis relevant to support final decision-making."
        },
        {
            "heading": 3,
            "text": "2. Scrutiny before parliamentary approval - to confirm the estimate of costs and plan for monitoring and evaluation"
        },
        {
            "text": "One of the key roles the RPC currently undertakes at ‘final stage’ (to support Parliamentary scrutiny) is verification of the estimates of the costs set out in IAs . We can ‘red-rate’ the IA if this assessment of costs is not fit for purpose. We believe that this role should be continued and supplemented with transparency about the actual costs of the measure using data that would be collected and published at the post-implementation stage."
        },
        {
            "text": "We also currently comment on, but cannot ‘red rate’ on, how the effectiveness and impact of a regulation will be monitored and evaluated after it is introduced. In order for post-implementation reviews (PIRs) to be effective at recommending changes to measures in the light of the actual operation of those measures, it is important to agree in advance what data and evidence is to be collected so that an effective review is possible at that later stage. Therefore, the ability to ‘red rate’ monitoring and evaluation plans before implementation is key to ensuring that policies can be effectively reviewed after implementation."
        },
        {
            "heading": 3,
            "text": "3. Scrutiny post-implementation – to validate the impacts and the decisions on whether the regulation is working well or should be changed"
        },
        {
            "text": "Monitoring and evaluation of policy after implementation is important to decide whether the regulation should be removed, reformed or retained; and for learning lessons for future policy making. An 'evaluate first' approach is a key component of many international better regulation systems."
        },
        {
            "text": "Although there is currently a requirement for departments to complete PIRs 4 to 5 years after regulations are introduced, this is often an afterthought. Between 2016 and 2018, 72% of required PIRs had been completed on time, but this has dropped to below 40% in the last 2 years (partly due to the pressures of coronavirus (COVID-19)) and they rarely lead to modifications of the regulations being reviewed."
        },
        {
            "text": "In an effective better regulation system, the actual impacts of regulation should be evaluated after they have been in place and consideration given to whether the regulations should be retained, amended or removed (if they are not working as intended)."
        },
        {
            "text": "We would support a system that increased the focus on the timely production of PIRs, ensured that these were comprehensive, and ensured that ministerial attention was focused on their conclusions. This might be the best point in the process for the calculation and independent verification of impacts and for independent confirmation that decisions on retention, amendment or removal are robust."
        },
        {
            "heading": 2,
            "text": "Ensuring the system is as effective as possible"
        },
        {
            "text": "We support the aim to have the regulatory process as 'streamlined' as possible, with a focus at each stage on the information necessary to the decisions at that stage. This should ensure that independent scrutiny retains the benefits of transparency and external challenge and improves outcomes for government, for Parliament and for external stakeholders in the business and CSO community. This doesn’t require radical reform of a system that is already highly regarded, but some change could make it significantly more effective and support the government’s objectives."
        },
        {
            "text": "We would encourage anyone with an interest in these issues to respond to the consultation on reforming the Better Regulation Framework."
        },
        {
            "text": "The deadline for responses is 1 October 2021."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}