{
    "url": "https://environmentagency.blog.gov.uk/2021/08/25/liquid-history-a-personal-view-of-the-tidal-river-thames/",
    "title": "Liquid History – a personal view of the tidal River Thames",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Other areas of our work",
        "Water"
    ],
    "pub_date": "2021-08-25T10:06:45+00:00",
    "content": [
        {
            "text": "By Neil Dunlop, Water Quality Technical Specialist, Tidal Thames"
        },
        {
            "text": "When you next visit London, stand on one of the bridges and look around. Many people see ‘history – both old and new’, while others may notice what they think is a dirty brown river."
        },
        {
            "text": "I have spent my career involved with, in my view, one of the most fascinating and best-monitored estuaries in the world, and I feel very privileged to have taken on the mantle of understanding and protecting it, from those who have gone before me."
        },
        {
            "text": "Since the population of London began to grow in the 1800s, successive generations have imposed differing and increasing pressures on Old Father Thames, and it began to suffer. But forward thinkers like Dr John Snow – whose findings, including the link between cholera and water, led to fundamental changes in the management of water, and Sir Joseph Bazalgette - who built London’s sewers, sewage works and the river embankments, led the change and understanding needed to cope with an expanding population and the effects of that on the quality of the river."
        },
        {
            "text": "Over decades, improvements to sewage treatment and regulation of discharges enabled the river to support a wide range of fish and aquatic flora and fauna. But there are still many challenges, not least ‘urbanisation’ - that means more of us living in towns and cities. The associated increase in population needs clean water for drinking. Much of this comes from the freshwater Thames."
        },
        {
            "text": "One of the consequences of urbanisation is more buildings and fewer porous surfaces. Thunderstorms and heavy rain, which we are seeing more frequently because of climate change, can cause flash flooding and storm overflows to operate."
        },
        {
            "text": "Understanding the city’s sewerage system, and how many of the lost rivers of London became combined sewer overflows, has been fascinating. And, in case you were wondering, the reason why the river is cloudy and brown is due to natural silt, not pollution."
        },
        {
            "text": "When spills from storm overflows occur, millions of tonnes of diluted sewage can enter the river causing a drop in dissolved oxygen levels, and impacting fish and other wildlife.  Part of my job is to keep an eye on these events using our real-time monitoring network and take action if we predict that levels might drop too low.  That action comes in the form of two boats owned by Thames Water; The Vitality and The Bubbler, which can each inject 30 tonnes of oxygen into the river per day. I monitor water quality and coordinate the mitigation response by deploying the Bubblers or dosing with peroxide. I am proud to call myself one of five “Bubbler Controllers”."
        },
        {
            "text": "Understanding the many and complex interactions between river and development is a crucial part of my job in minimising the impacts on the water environment from not only increased urbanisation, but a growing population and climate change. But there’s a much more fundamental, and large-scale programme of work under way to address the issue of sewage treatment and storm overflows discharging into the River Thames."
        },
        {
            "text": "The London Tideway Improvements is a multi-billion pound programme of work bringing London’s drainage up to modern-day standards. There are several stages to the work; the first was the extension of Thames Water’s sewage works along the Thames which was completed in 2013. It has made a huge difference to water quality, making the river more resilient to storm overflow discharges. The second was the Lee Tunnel, capturing spills from the largest of the storm overflows at Abbey Mills and transferring them to the recently-enlarged Beckton Sewage Treatment Works. This has enabled the recovery of the Channelsea River and tidal River Lee, where the resident seal dubbed ‘ChannelSealy’ feeds on the fish."
        },
        {
            "text": "The final stage of the improvements is the Thames Tideway Tunnel which is currently under construction and is often known as the ‘Super Sewer’. This massive feat of engineering is currently visible in the form of tunnelling and connection shafts along the Thames in London. A tunnel with an eight metre diameter will stretch 25 kilometres from Acton and Hammersmith to Abbey Mills where it will connect with the Lee Tunnel."
        },
        {
            "text": "The resulting London Tideway Tunnels system will divert millions of tonnes of storm sewage away from the river, carrying it by gravity to Beckton in east London where it will be pumped up 80 metres from the deepest shaft in London for treatment."
        },
        {
            "text": "I’m really proud to have been a part of this project from the start, and will see it through to completion. But even with these improvements, the Thames and other rivers will still feel the impacts of climate change and urbanisation. Pollution events will still occur, but we can all do our bit to prevent them."
        },
        {
            "text": "Individual actions count"
        },
        {
            "text": "You will have heard of fatbergs, which are large tangled masses of wet wipes and sanitary products held together with fats, oils and greases. None of these things should be in the sewers in the first place, as they are not built to deal with anything other than pee, poo and toilet paper."
        },
        {
            "text": "Everyone can take action to stop a fatberg – just remember these small steps to become a #WaterWarrior and take care of the water environment:"
        },
        {
            "text": "*The top photo shows the former Battersea Power Station which formerly polluted the air and the water, giving way to development of over 10,000 homes and offices around Battersea and Vauxhall. On the left you see a barge taking spoil from the Thames Tideway Tunnel site at Kirtling Street, part of the modern-day solution of river pollution. The pressures on the environment will always exist and we will have to find ways of coping with them. This gives a glimpse into the multi-faceted way in which the public and organisations have come together to find sophisticated solutions to some of our capital’s problems."
        },
        {
            "text": "For more information about the London Tideway Tunnel project, visit https://www.tideway.london/"
        },
        {
            "text": "Follow the Environment Agency on Twitter. Be a #WaterWarrior and #DontFeedAFatberg."
        }
    ]
}