{
    "url": "https://phescreening.blog.gov.uk/2021/08/25/nhs-bowel-cancer-screening-pathologists-lead-the-way-virtually/",
    "title": "NHS bowel cancer screening pathologists lead the way virtually",
    "authors": [
        "Natalie Hill",
        "Bev Tingle",
        "Kathryne Bradley"
    ],
    "categories": [
        "NHS Bowel Cancer Screening Programme",
        "Screening Quality Assurance Service"
    ],
    "pub_date": "2021-08-25T09:18:02+01:00",
    "content": [
        {
            "text": "Professional network meetings are an important forum for the Screening Quality Assurance Service (SQAS) to share information relating to new standards, guidance and programme developments with the relevant professionals. These meetings are valuable to those working within local screening services, as they provide the opportunity to share issues, identify solutions and develop professional networks."
        },
        {
            "text": "Due to the COVID-19 pandemic, these meetings were postponed or cancelled. A year later, the uptake of Microsoft Teams meant that SQAS was able to host virtually a cancelled event, the NHS Bowel Cancer Screening Programme (BCSP) pathology meeting. They invited BCSP pathologists from across the country."
        },
        {
            "heading": 2,
            "text": "Talks and discussions"
        },
        {
            "text": "There were presentations on a wide range of subjects relating to histopathology and national guidance within the NHS bowel cancer screening programme, and below are some of the main messages from the event. We discussed:"
        },
        {
            "text": "Attendees were able to submit questions prior to and throughout the event. Most questions were responded to on the day, either at the end of each presentation or during the expert panel Q&A session."
        },
        {
            "heading": 2,
            "text": "It was a success!"
        },
        {
            "text": "In total, more than 220 pathologists attended, from 50 NHS bowel cancer screening services in England. We have compiled our feedback and are delighted that 97% of pathologists who attended rated it as excellent or good."
        },
        {
            "text": "The other standout feedback on the event was that:"
        },
        {
            "text": "Dr Michael Osborn, President of the Royal College of Pathologists, said, “Good talks, good meeting”."
        },
        {
            "text": "Thank you to the meeting chair, Dr Tim Andrews, Consultant Histopathologist at Liverpool University Hospitals and the other contributors, including:"
        },
        {
            "heading": 2,
            "text": "Future sessions"
        },
        {
            "text": "Attendees provided lots of useful suggestions for future events. These included sessions on:"
        },
        {
            "heading": 2,
            "text": "Running your own Teams Live event"
        },
        {
            "text": "The Bowel SQAS North team can share, on request, their learning from hosting this event using Microsoft Teams Live."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}