{
    "url": "https://dfedigital.blog.gov.uk/2021/08/25/podcast-s1-e2/",
    "title": "Podcast - Think digital, act human: Black voices in digital and technology",
    "authors": [
        "Adaobi Ifeachor, Product Manager"
    ],
    "categories": [
        "culture",
        "podcast",
        "race",
        "Service design",
        "user research",
        "User-centred design"
    ],
    "pub_date": "2021-08-25T11:29:58+01:00",
    "content": [
        {
            "text": "Here is the second episode of our – 'Think digital, act human' – podcast series which shines a light on the stories of the people behind our digital and technology projects."
        },
        {
            "text": "Hosted by Product Manager, Adaobi Ifeachor, in this episode we’re celebrating the work of 3 Black digital and technology experts in DfE."
        },
        {
            "text": "Keisha Herbert, Virginia Brown and Courtney Allen explain the critical part they play in designing, building and running services."
        },
        {
            "text": "You’ll learn why they chose to join DfE, what work they’re currently up to, and how employers can show support and solidarity for Black colleagues during difficult times (#euphemism)."
        },
        {
            "text": "Listen and let us know what you think."
        },
        {
            "text": "If you’re short on time, fast forward to where our guests:"
        },
        {
            "heading": 2,
            "text": "Trigger warning and glossary"
        },
        {
            "text": "There's a discussion about personal experiences of racism, starting at 25:50"
        },
        {
            "text": "DDaT refers to the Digital Data and Technology community"
        },
        {
            "text": "Diaspora refers to a community of people spread across the world."
        },
        {
            "text": "KPIs are key performance indicators. We use these to measure how effective our work is."
        }
    ]
}