{
    "url": "https://companieshouse.blog.gov.uk/2021/08/25/your-personal-details-on-the-companies-house-register/",
    "title": "Your personal details on the Companies House register",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-08-25T12:40:24+01:00",
    "content": [
        {
            "text": "The Companies House register is inspected thousands of times a day by people wanting to do business with your company. For this reason, the information you provide when setting up your company, any subsequent changes and your annual filings are made publicly available for anyone to inspect. To benefit from limited liability, your company details must be open and transparent."
        },
        {
            "text": "One of the most frequent requests we receive from directors is to remove their personal address from the register."
        },
        {
            "heading": 2,
            "text": "Registered office address"
        },
        {
            "text": "Every company on the register needs to supply a registered office address. This must be a physical address and not a PO Box. You can only use a PO Box address if you also provide the full address of the physical building, including post code."
        },
        {
            "text": "Your company’s registered office address must be in the same part of the UK that the company was incorporated – England and Wales, Scotland or Northern Ireland."
        },
        {
            "text": "If you’ve used your home address as your registered office address it will appear on the public register. We do not have the legal power to remove a home address that’s been used as a company’s registered office."
        },
        {
            "text": "You can change your registered office address, but any previous addresses you’ve used as a registered office will remain on the public register for the lifetime of the company and 20 years after the company has been dissolved."
        },
        {
            "heading": 2,
            "text": "Correspondence and home addresses"
        },
        {
            "text": "As a director of a company, you need to supply 2 addresses, one where we can send correspondence (a correspondence address) and the second, your home address (or usual residential address)."
        },
        {
            "text": "Your correspondence address appears on the public register, for all to see. Your usual residential address is kept on a private register that’s only available to certain public authorities such as the police."
        },
        {
            "text": "If you’ve given the same address for both purposes then your private, home address will appear on the public register."
        },
        {
            "text": "If you do not want your home address to be available on the register, you have a few options."
        },
        {
            "text": "You can simply supply a different address, this could be:"
        },
        {
            "text": "You must have permission to use the address, and the company must be contactable at the address given. Alternatively, there are many companies who will provide you with a director correspondence address for a fee."
        },
        {
            "text": "If you’re thinking, “My home address is showing as the correspondence address on my director’s listing, can I change it?” The answer is yes."
        },
        {
            "text": "Your home address might still appear on other documents on your company’s filing history."
        },
        {
            "heading": 2,
            "text": "Other documents"
        },
        {
            "text": "If your home address appears on other documents, such as a form to appoint a director, then you can apply to remove your home address. There’s a fee of £32 to remove an address from each document. You’ll need to know which documents contain your home address. You can do this by looking through your company details on the Companies House register."
        },
        {
            "heading": 2,
            "text": "Other information and other officers"
        },
        {
            "text": "As a director you’ll also need to supply other information such as your:"
        },
        {
            "text": "These details appear on the register. For directors appointed after 10 October 2015, only the month and year from the date of birth is made publicly available."
        },
        {
            "text": "Other people who take up positions in a company will also need to supply a correspondence address. These include:"
        },
        {
            "text": "The same consideration needs to be made when providing their correspondence address."
        },
        {
            "text": "If you do not want your private address to appear on the register, use an alternative as your correspondence address and your registered office address."
        },
        {
            "heading": 2,
            "text": "Scam emails"
        },
        {
            "text": "We’ll never contact you by email or telephone to find out who your officers are, or to ask for secure information such as addresses or authentication codes. Let us know if you receive an email or call claiming to be from Companies House."
        }
    ]
}