{
    "url": "https://aphascience.blog.gov.uk/2021/11/18/antimicrobial-stewardship/",
    "title": "Know your enemy: the contribution of veterinary laboratories to antimicrobial stewardship",
    "authors": [
        "Chris Teale"
    ],
    "categories": [
        "Antimicrobial Resistance"
    ],
    "pub_date": "2021-11-18T09:14:19+00:00",
    "content": [
        {
            "text": "APHA has been testing the susceptibility of bacteria to antimicrobials (drugs used to treat infections) for decades and plays a key role with other medical and veterinary diagnostic laboratories in monitoring resistance of antimicrobials to protect their future effectiveness."
        },
        {
            "text": "In this blog Chris Teale, APHA’s Head of Antimicrobial Resistance, talks about antimicrobial resistance in bacterial pathogens causing infections of farm animals used for food production."
        },
        {
            "text": "I work closely with staff in the Veterinary Medicines Directorate (VMD), which is the government agency responsible for assuring the safety, quality and effectiveness of veterinary medicines. Working with colleagues at VMD, APHA recently proposed a scheme for the monitoring of antimicrobial resistance in those veterinary bacterial pathogens causing infections of farm animals used for food production. The scheme was published in the Veterinary Record earlier this year. It provides detailed recommendations on suggested methodology, as well as the bacteria and antimicrobials which should be tested."
        },
        {
            "text": "The scheme was developed with the aim of maximising the information which can be gathered from a gold standard method of susceptibility testing and has been implemented by APHA as part of veterinary scanning surveillance in England and Wales. Results of the monitoring of the common respiratory bacterial pathogens of farm animals were recently published in the UK Veterinary Antimicrobial Resistance and Sales Surveillance (UK-VARSS) report for 2020. The output generated includes information relevant to antimicrobial stewardship and the scheme was deliberately designed keeping this objective in mind."
        },
        {
            "heading": 3,
            "text": "Monitoring antimicrobial resistance"
        },
        {
            "text": "Full details and underlying reasoning are described in the Veterinary Record paper. However, for the purpose of this blog, let us consider a single class of antimicrobials, the tetracyclines, to illustrate some of the principles applied."
        },
        {
            "text": "Tetracyclines are a class of broad-spectrum antibiotics that work by stopping the growth of bacteria. Life then immediately becomes complicated because there are four compounds in the class tetracyclines which are authorised for veterinary use in food animals in the UK (tetracycline, chlortetracycline, oxytetracycline and doxycycline) - which of these compounds should be tested?"
        },
        {
            "text": "The problem is, in the laboratory is that we have one 96-well microtitre plate which is a flat plate with multiple wells used as small test tubes. Ideally, we would like to fit all of the antimicrobials we want to test onto one plate. However, each antimicrobial being tested usually takes up several wells.  Filling the plate with antimicrobials belonging only to the tetracyclines class would not be appropriate, before we have even started to consider any other relevant compounds!"
        },
        {
            "text": "I know you must be thinking why do we not just use more than one 96-well plate? Multiple 96-well plates could be used, but that would have resource implications. Fortunately, it is possible to reduce and prioritise."
        },
        {
            "text": "It is important to know that tetracycline, chlortetracycline and oxytetracycline are all equivalent for the purpose of susceptibility testing meaning we can test to see if bacteria are resistant to them. That allows us to include only one of these compounds - in fact, tetracycline is included in most monitoring programmes. However, there are resistance genes providing resistance to tetracycline which do not provide resistance to doxycycline, so inclusion of both of these compounds is useful. There are also resistance genes which have been described conferring resistance to both tetracyclines and doxycycline."
        },
        {
            "text": "Through monitoring respiratory bacterial veterinary pathogens in 2020, we found that where tetracycline resistance was detected, doxycycline resistance was, in many cases, not detected. This showed us that doxycycline probably remains a good treatment option in a significant number of cases of tetracycline resistance in the bacterial respiratory pathogens of animals."
        },
        {
            "text": "I would like to briefly mention the ovine (sheep) pathogen Bibersteinia trehalosi, which causes septicaemia primarily in what might be referred to as “teenage” sheep."
        },
        {
            "text": "We found no resistance to any of the antimicrobials tested in any of the B. trehalosi isolates (N=55) tested from sheep in 2020. This is invaluable information with important implications. Resistance was not detected, so all first-line treatment options such as the tetracyclines are likely to remain fully effective."
        },
        {
            "text": "First-line antimicrobials generally include those which are considered of lesser importance for public health, limiting collateral damage if other bacteria carried by the animals (for example Salmonella or Campylobacter) are incidentally exposed to the antimicrobial agent."
        },
        {
            "text": "Let us look at an example to help explain this. We might be targeting the lung in a case of pneumonia, but the antimicrobial could be excreted by the animal in bile produced by the liver. This would mean that the bacteria in the intestine will also be exposed to the antimicrobial. If there is no resistance to first-line antimicrobials then second or third-line antimicrobials, which would have greater importance in public health, need not be used."
        },
        {
            "text": "In general, the results of our monitoring showed that multiple alternative medicinal options remain for antibiotic treatment of the main bacterial respiratory pathogens of cattle, sheep and pigs."
        },
        {
            "text": "Although tetracycline is not currently used so much in human medicine, at least in the UK, resistance to it is still important from both the animal and public health perspective. This is because tetracycline resistance is one of the extremely common components of multi-drug resistance mobile genetic elements. This means that groups of several different resistance genes which are linked (adjacent or close together) on mobile bacterial DNA, very frequently include tetracycline resistance genes."
        },
        {
            "text": "The result is that, if you use tetracycline, you select not only for tetracycline resistance but also for all those linked resistances which are adjacent to the tetracycline resistance gene. This reinforces the fact that it is very important to use all antimicrobials only where strictly necessary."
        },
        {
            "text": "I have touched on some of the issues concerning tetracyclines in this blog. Other antimicrobial classes are often more complex to consider. The macrolides are a case in point with multiple macrolide compounds available and where a number of different resistance genes have been described, providing resistance to a few or several of the macrolide compounds."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "If reading about tetracyclines has stimulated your interest, then the discussion of macrolides and other antimicrobial classes in the Veterinary Record paper provides further information. If this blog has given you a headache, perhaps of the type encountered when a school orchestra repeatedly attempts a tricky allegro final movement, I would strongly advise you to avoid further consideration of the macrolides!"
        },
        {
            "text": "You might also be interested in reading our other blogs on antimicrobial resistance."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}