{
    "url": "https://marinedevelopments.blog.gov.uk/2021/11/18/blue-belt-programme-overseas-territories-playing-their-part-in-tackling-climate-change/",
    "title": "Blue Belt Programme Overseas Territories playing their part in tackling Climate change",
    "authors": [
        "Karen Leech, Blue Belt Programme"
    ],
    "categories": [
        "Blue Belt",
        "marine conservation"
    ],
    "pub_date": "2021-11-18T08:45:47+00:00",
    "content": [
        {
            "text": "Throughout COP26 (October 31st – November 12th) we have shared with you the potential impacts of climate change being faced by the Blue Belt overseas territories. But we have also shown you the work that is being planned and undertaken to monitor impacts and to identify solutions and mitigations."
        },
        {
            "text": "The Blue Belt Programme is the largest marine conservation initiative of its kind in the world. Driven by UN Sustainable Development Goals and the Convention on Biological Diversity, the Programme also underpins the 25 Year Action Plan and the global ambition for 30% of the world’s oceans to be protected by 2030. It is central to the UK Government’s ambition of leading global action against illegal fishing, climate change and species conservation."
        },
        {
            "text": "From preventing illegal, unreported, and unregulated fishing through new technology in the British Indian Ocean Territory to South Georgia and South Sandwich Islands whose Marine Protected Area (MPA) is safeguarding species, like krill, from overfishing to help promote genetic diversity, providing resilience to climate change."
        },
        {
            "text": " "
        },
        {
            "text": "Marine Protected Areas (MPA)"
        },
        {
            "text": "There is little doubt that by designating vulnerable waters as MPAs, overseas territories are making a clear statement of intent to the threat of climate change. By using nature-based solutions in the management of their climate smart MPAs, they are helping to protect against biodiversity loss and increase resilience to the changes in our climate."
        },
        {
            "text": "One way this is happening is in the protection of blue carbon habitats, which help to capture atmospheric carbon dioxide and store it for future use. For example, Tristan da Cunha’s MPZ’s fishing ban, which includes ‘bottom-trawling’, prevents fishing gear from disturbing habitat sediments and releasing carbon."
        },
        {
            "text": "Increased knowledge of the potential impacts of climate change is also essential and Blue Belt overseas territories are also strengthening their own knowledge, alongside contributing to global understanding. And the Baited Remote Underwater Video Systems (BRUVS) project – which is being rolled out across many of the Blue Belt overseas territories - is informing that knowledge as well as being instrumental in monitoring and protecting coastal habitats to help them capture and store carbon."
        },
        {
            "text": "These initiatives go alongside the Discovery Surveys, including the recent one to the Pitcairn Islands, where there is hope that the findings will include more information on the potential for the Ducie Island coral reefs to be more resilient to climate change."
        },
        {
            "text": "Future plans"
        },
        {
            "text": "Territories, like Ascension Island, have modelled climate change impacts on tuna distribution to build knowledge of fish stocks and by the end of this year they will have produced an MPA Climate Change Resilience Strategy which will consider local management actions to combat climate change impacts. St. Helena has recently deployed inshore and seamount acoustic listening stations to monitor fish movements and promote future fish stocks. The data collected is contributing to the International Commission for the Conservation of Atlantic Tuna (ICCAT) stock assessments. Further monitoring of climate change impacts is planned to better understand and predict change as well as identify potential mitigating actions."
        },
        {
            "text": "And BRUVS will also help territories like the British Antarctic Territory to monitor potential impacts. In BAT, where the duration of winter sea ice cover has shortened due to the warming of the oceans, BRUVS will help to better monitor the impact on animals living in the surface waters and those on the seafloor."
        },
        {
            "text": "Importantly Blue Belt Discovery Surveys such as the forthcoming survey to Ascension Islands and St. Helena could provide valuable data for scientists on the challenges that face our oceans, including climate change."
        },
        {
            "text": "There is no doubt that the impact of climate change is a challenge we all face and must play our part in tackling. Importantly, Blue Belt overseas territories are doing just that. And the work that they are undertaking will not only help to protect their own fantastic biodiversity but will hopefully provide a greater insight into climate change for the wider, global community."
        }
    ]
}