{
    "url": "https://mojdigital.blog.gov.uk/2021/11/18/content-and-interaction-how-to-become-design-bffs/",
    "title": "Content and interaction –How to become design BFFs",
    "authors": [
        "Rob King",
        "Sheida Heidari"
    ],
    "categories": [
        "collaboration",
        "Content",
        "Content design",
        "Interaction Designer"
    ],
    "pub_date": "2021-11-18T12:54:52+01:00",
    "content": [
        {
            "text": "Content design is a collaborative discipline, so when you’re the only content designer in your digital team, it can be lonely. You don’t have that content buddy to bounce ideas off, get a second pair of eyes on your work and have someone to back you up with content decisions. "
        },
        {
            "text": "You need to rely on your digital teammates who happen to be usability experts – and there’s none better than the interaction designer."
        },
        {
            "text": "Agree on how you’ll collaborate"
        },
        {
            "text": "Sheida: From the start, there needs to be an agreement on the problem we’re trying to solve, the approach we’re going to use that will solve this problem, and a plan of action. Setting up a ‘ways of working’ session is a great way to decide how you’re going to collaborate as a team and who’s involved at each stage. The key here is to collaborate early and often."
        },
        {
            "text": "Rob: It’s important in both content and interaction design to have moments where you are able to think through a problem. You sketch out ideas and contemplate how you might design a suitable solution – or stare at a problem statement for an hour or two. Add both design professions into the mixing pot, whether that’s in a collaborative workshop session or in a joint Miro or Figma board, and that’s when you really see designs come to life."
        },
        {
            "text": "Understand how the team works and each other’s responsibilities"
        },
        {
            "text": "Sheida: Although our disciplines are different, our work can be seamless. We should be open and truthful about how we like to work and who’s doing what. I like to get interaction designers involved in the writing process so it encourages collaboration and allows them to see the workload involved in content design – hoping they’ll do the same for me."
        },
        {
            "text": "Rob: I don’t think there is ever a day working in a multidisciplinary team that I’m not in contact with the content designer on my team. Knowing each other’s boundaries and working habits allows us to solve problems in these challenging times of remote working and juggling life commitments. "
        },
        {
            "text": "It’s also important to understand the extent of each designer’s knowledge when co-designing. I wouldn’t always expect a content designer to know how to write code, but that should never be an assumption of mine that they don’t. It's important to ensure that you are using the most appropriate application that you and your BFF design fellow can work most efficiently in."
        },
        {
            "text": "Pairwork makes the team work"
        },
        {
            "text": "Sheida: As a content designer, you want to avoid a round of ‘copy Tetris’ where the designs have already been built and you have to try and fit the content at the end. We make prototypes as a team. There will be moments where you’ll need to split off and work independently, but always give a full debrief of what you’ve been working on so there’s complete transparency and understanding of your decisions. "
        },
        {
            "text": "Rob: One of the absolute joys working with my content BFF on the Refer and monitor an intervention service when it comes to pairwork is that there are no egos. The nature of our work always ensures that we are designing as much as possible with the voice of the user. I feel comfortable enough to question content design decisions and I feel that my content BFF can do the same with interaction design decisions."
        },
        {
            "text": "Be open and honest"
        },
        {
            "text": "Sheida: Always give feedback that’s constructive and kind. I found that talking every day instead of sitting on a question allows you to develop a deeper relationship more quickly. Consider weekly user centered design catch-ups to be kept in the loop with all design thinking and a safe space to give each other feedback."
        },
        {
            "text": "Rob: It’s so important every design discipline has a seat at the delivery table. Whether it’s working on a small component, a larger complex flow or getting the language of a button or link right – designers aren’t always needed at every single stage of a design process. It doesn’t mean that they shouldn’t be included. It’s that inclusion that makes us better collaborators. "
        },
        {
            "text": "The relationships you build with your multidisciplinary teammates is crucial to the success of your project. When we respect each other’s area of expertise and make an effort to collaborate, we’re on our way to creating the best experience possible for our users. Dream team, assemble!"
        },
        {
            "text": "Shoutout to Senior Interaction Designer at GDS, Vicky Teinaki for the blog title idea! "
        }
    ]
}