{
    "url": "https://teaching.blog.gov.uk/2021/11/18/developing-my-career-and-improving-my-practice-with-a-specialist-npq/",
    "title": "Developing my career and improving my practice with a specialist NPQ",
    "authors": [
        "Hassnain Mahay"
    ],
    "categories": [
        "Professional Development"
    ],
    "pub_date": "2021-11-18T14:41:28+00:00",
    "content": [
        {
            "text": "Hassnain Mahay is a biology teacher and Associate Deputy Head of Year at Greenford High School. He's starting a National Professional Qualification in Leading Behaviour and Culture (NPQLBC) in November and shares what motivated him to enrol."
        },
        {
            "text": "Teaching Background"
        },
        {
            "text": "Throughout school, friends often suggested that I would make a great teacher, and whilst studying my degree in Biology I started to believe this myself. I was passionate about creating positive change, helping others and sharing my passion for the subject. I decided to complete a PGCE course to share my passion and knowledge of science with young people."
        },
        {
            "text": "I began my teaching career at a local school in my borough. After several years, I wanted a greater challenge, new responsibilities and a change of scenery. I managed to secure a position at my old secondary school where I have maintained my love of teaching and supporting children’s education."
        },
        {
            "text": "Why the NPQLBC?"
        },
        {
            "text": "I have chosen to take an NPQ in Leading Behaviour & Culture as I believe having an ethos in which all members of the school community are invested, is essential to achieving a whole school vision and securing positive outcomes for young people."
        },
        {
            "text": " The NPQLBC will allow me to access world-class training, advice and guidance which is rooted in the best available research evidence from across the sector, to deepen my understanding of effective learning behaviour and school culture. It will also provide me with essential experience of managing competing commitments and priorities across a breadth of areas within schools, so that I am empowered to support pupils. The network of peers, school leaders and subject matter experts who support and deliver the course will also help me develop new skills which are school-focused and relevant to my setting."
        },
        {
            "text": "I’m excited to explore how the NPQLBC will directly impact my day-to-day practice. Discovering new strategies to combat truancy, low-level disruption, backchatting or even aggressive behaviour are always welcome in the classroom. That these strategies are backed by a broad evidence base will empower me further: I can have confidence in addressing these problem behaviours with the solid foundation my NPQ will have provided."
        },
        {
            "text": "My current aspirations are to become a Head of Year and the NPQLBC will provide opportunities to work with a range of influential stakeholders including my senior leadership team, colleagues, and different groups of students with diverse needs. However, I feel it is important to highlight that the NPQLBC is not just about my career progression. I’m excited to see the immediate benefits in my practice – this classroom-based experience, rooted in evidence based research, can make an impact straight away, irrespective of my career path."
        },
        {
            "text": "Why now?\n\nI am currently an Associate Deputy Head of Year for a challenging year group. Many challenges have arisen due to the pandemic which has unsettled the journey our young people take through the years, in addition to the transition between primary and secondary school. We have students who attend our schools from disadvantaged backgrounds, children in care, those with EAL needs as well as SEND students. Quite simply, many of these children need support to get them back on track and to close some of the attainment gaps which developed over the course of the pandemic. To create a culture in which we support all of our pupils to strive to achieve their best, as well as model to them the correct behaviours and link this to the school being a safe environment, is crucial to develop our pastoral performance – with a view that this will, in turn, promote success inside and outside of the classroom."
        },
        {
            "text": "The NPQLBC will support me and others across the country to develop existing behaviour management and pastoral skills to support these learners and promote success for the children in our care."
        },
        {
            "text": "Future aspirations"
        },
        {
            "text": "To support my aim of becoming a Head of Year, along with my longer-term aspirations of becoming a headteacher, the reformed suite of NPQs offers a range of opportunities to develop my skills and expertise in different areas, enabling me to do what really matters – supporting students through their education."
        },
        {
            "text": " "
        },
        {
            "text": "The next cohort of teachers and leaders on these reformed NPQs will begin their qualifications in February 2021. To find out more about how an NPQ can help you take the next step in your career, and the providers offering these qualifications, go to GOV.UK."
        }
    ]
}