{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/11/18/mastery-the-scientific-method-and-policy-design/",
    "title": "Mastery, the scientific method, and policy design",
    "authors": [
        "Jonny Mallinson"
    ],
    "categories": [
        "Case study",
        "Thought leadership"
    ],
    "pub_date": "2021-11-18T12:00:18+00:00",
    "content": [
        {
            "text": "On the BBC radio programme, ‘The Life Scientific’ in early October, Sir Patrick Vallance argued for the application of the scientific method to policymaking. This wasn’t just about employing more STEM grads. It was an argument for a broader shift in the way that governments solve problems. When developing policy, governments at every level - including my own - should rigorously test their assumptions and hypotheses using empirical observation and inductive reasoning wherever possible."
        },
        {
            "text": "Listening to the life scientific made me wonder whether Patrick Vallance would recognise policy design as part of this transition. It also made me wonder how many policy design practitioners would recognise themselves as being part of a movement for greater scientific rigour in policymaking. Our experience in the London Borough of Barking & Dagenham suggests that this is a missed opportunity."
        },
        {
            "heading": 2,
            "text": "The scientific heritage of policy design"
        },
        {
            "text": "Whilst policy design as an umbrella term is comparatively new, the disciplines associated with it have long and proud intellectual traditions. Each of these disciplines has its roots in a different branch of science and – in its own way – represents an application of the scientific method to policymaking. To take a few examples:"
        },
        {
            "text": "Embracing these traditions would help the movement for policy design generate both traction and credibility. But it would also challenge the community to practice these disciplines with the same level of precision that you would expect from any scientist. Any policymaker can – and should – make use of personas, user journeys, and prototypes, but the best results are achieved when these tools are applied with deep knowledge, expertise, and experience."
        },
        {
            "heading": 2,
            "text": "Develop T-shaped mastery"
        },
        {
            "text": "Mastery matters in part because it enables genuine multi-disciplinarity. IDEO have long pioneered the idea of the T-shaped professional, with deep expertise in one area and the ability to collaborate through engaging seriously with the disciplines of others. In Barking & Dagenham, we are fortunate enough to employ a group of ‘policy design’ practitioners – both within the Council’s Insight Hub but also across other corporate services - with deep expertise in one or more of the disciplines already mentioned. Through working together on real world problems, this group are becoming increasingly T-shaped."
        },
        {
            "heading": 2,
            "text": "Use science to improve the lives of citizens"
        },
        {
            "text": "I have been part of workshops in which frameworks from behavioural science have been applied alongside insights gained from ethnographic observation, and tools drawn from service design, to come up with new ways of minimising waste and maximising rates of recycling. And I have watched the same group develop a series of prototypes – informed by the practice of identifying control samples - to test the ideas that emerged from these workshops."
        },
        {
            "text": "I have seen our data scientists develop models to identify who is at greatest risk of missing a payment to the Council, drawing together data sets that include levels of debt, frequency of contact with social care, and prior experience of homelessness. And I have watched them work with our behavioural scientists to pilot assertive outreach models that make use of these insights to ensure residents on the edge get the support they need - before debt turns into homelessness or any other form of crisis."
        },
        {
            "text": "Together they are transforming the efficiency of the Council’s debt collection efforts. We are now much better at distinguishing between those residents that can afford to pay – with limited impact on their life and circumstances - and those for whom a repayment would tip them over the edge. We generate more revenue whilst providing the right kind of help to those that need it. But don’t just take it from me…"
        },
        {
            "heading": 2,
            "text": "The next frontier for multidisciplinary working"
        },
        {
            "text": "These results have come from allowing expert service designers, behavioural scientists, and data scientists to practice their craft, working alongside those with deep expertise in policy and/or service delivery. Our next frontier is to make the tools, frameworks, and mindsets that come from these disciplines available to the rest of the organisation – we have a way to go to develop a deeper culture of policy design. But we will be careful to do so in a way that continues to respect the scientific traditions of the disciplines themselves, and that manages expectations about what can be achieved without mastery."
        }
    ]
}