{
    "url": "https://defrafarming.blog.gov.uk/2021/11/18/more-opportunities-to-put-your-questions-to-us/",
    "title": "Putting your questions to us",
    "authors": [
        "Janet Hughes"
    ],
    "categories": [
        "Conversations we're having",
        "Future Farming and Countryside Programme",
        "Q&A"
    ],
    "pub_date": "2021-11-18T14:36:13+00:00",
    "content": [
        {
            "text": "Here in the Future Farming and Countryside Programme, we’re always looking for ways to connect with farmers, answer questions and hear their concerns.  "
        },
        {
            "text": "This is really important to us, because it helps us understand how we can make sure what we’re doing will really work for farmers. "
        },
        {
            "text": "We hope it also helps more farmers understand what we’re doing and what it means for them, and have the opportunity to ask us questions and give us feedback about the things that matter to them. "
        },
        {
            "text": "In this post, I'll share our approach to Q&As and the upcoming themes and dates of future sessions."
        },
        {
            "heading": 3,
            "text": "What we did"
        },
        {
            "text": "On 20 September 2021, I took part in a Q&A session on the Farming Forum. "
        },
        {
            "text": "Farmers were invited to ask me anything about the work we’re doing in our programme. "
        },
        {
            "text": "The thread opened for people to type their questions and submit them a few hours before I set about answering them, and I (supported by some of my much more expert colleagues!) answered the most popular questions, as voted by forum members. "
        },
        {
            "text": "We then answered the rest of the questions over the following few days. "
        },
        {
            "text": "Although I and my team talk to farmers and land managers regularly (through membership organisations, through co-design and formal engagement, on visits, through social media and at events), and we’ve done some recorded videos for the forum before, it was a first for us to hold a Q&A session on the forum in this way. "
        },
        {
            "text": "It was encouraging to see how many people got involved, and I really enjoyed engaging in the questions and discussion."
        },
        {
            "text": "128 comments were posted and the thread was viewed more than 20,000 times. "
        },
        {
            "text": "You’ll see these were a mixture of questions and general discussion and we covered a lot of ground in quite a short space of time. "
        },
        {
            "heading": 3,
            "text": "Here’s what we’re doing next "
        },
        {
            "text": "We’re going to do a monthly Q&A session on The Farming Forum, but having learned from our first go at this, we’re going to try some slightly different approaches and see how they work. "
        },
        {
            "text": "An hour-long Q&A felt too short, so we’ve built that into our plans and we’re extending future ones to 90 minutes.  "
        },
        {
            "text": "To give more people time to pose questions and vote on the ones they care about most, the discussion thread will be opened a day beforehand.  "
        },
        {
            "text": "You do have to be a member of the Farming Forum to submit a question, but anyone can view the questions and answers.  "
        },
        {
            "text": "From now on, each session will be themed. This will help me make sure I can answer the questions with support from the right expert colleagues, and hopefully make for a bit more of an in-depth discussion each time, rather than us trying to cover absolutely everything each time."
        },
        {
            "text": "We’ll then run a live Q&A, keeping with the previous format. I’ll answer the questions with the most votes for 90 minutes.  "
        },
        {
            "text": "Future Farming and Countryside Programme team members will then answer the rest of the questions the following day.  "
        },
        {
            "text": "We’ll add in the links to each board in the table below when the events finish, so do bookmark this page.  "
        },
        {
            "heading": 3,
            "text": "Catch up"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}