{
    "url": "https://userresearch.blog.gov.uk/2021/11/18/the-cross-government-user-research-blog-is-back/",
    "title": "The cross-government user research blog is back",
    "authors": [
        "Natalie Baron",
        "Nichole Browne - Senior User Researcher, DVSA",
        "Louise Petre"
    ],
    "categories": [
        "User research"
    ],
    "pub_date": "2021-11-18T15:01:18+00:00",
    "content": [
        {
            "text": "We’re excited to relaunch this month with our vision of who and what this blog site is for. We’d like this to be a space where we share ideas and approaches that will inspire user researchers in government."
        },
        {
            "text": "We’ll aim to publish posts that will help all the members of our community - from someone who’s just started out to those with more experience - assess and extend the scope, scale and impact of their research."
        },
        {
            "heading": 2,
            "text": "How can you help?"
        },
        {
            "text": "We’re looking for posts about tools, methods, processes, challenges and successes. We are open to suggestions for topics that will engage us as we build our careers and move forwards on our research journeys."
        },
        {
            "text": "We will also welcome occasional case studies that show how research works in different settings and with different user groups."
        },
        {
            "heading": 2,
            "text": "How does the process of publishing a blog work?"
        },
        {
            "text": "The blog is managed by an editorial panel. The role of the panel is to encourage blog posts from across the government research community, and to guide submissions through the publishing process onto the blog site. We are very happy to talk with prospective authors about ideas for blog posts, and coach less experienced writers through developing a post."
        },
        {
            "text": "In brief, the submission process is:"
        },
        {
            "text": "When your blog post is ready for publication, you’ll need internal sign-off from your communications team, as well as from the editorial panel, so it might be worth sharing your idea with them at the same time as contacting us."
        },
        {
            "heading": 2,
            "text": "Who is on the new editorial panel?"
        },
        {
            "text": "Louise Petre is the lead user researcher in the Central Digital and Data Office (CDDO). She moved into user research after working as a designer and developer for many years. Louise is particularly interested in using mixed methods in user research practice. Her favourite blog posts are: Why we care more about effectiveness than efficiency or satisfaction and 10 tips for working with your user researcher."
        },
        {
            "text": "Nichole Browne is a senior user researcher at the Driver and Vehicle Standards Agency (DVSA) in Nottingham. Before joining the Civil Service, she worked in the not-for-profit sector, researching with disengaged and hard to reach users. Nichole is particularly interested in maximising the impact of research within an organisation and has launched a research insight library at DVSA. One of her go-to blog posts is about the eight pillars of user research"
        },
        {
            "text": "Natalie Baron is a lead user researcher in the Government Digital Service (GDS). She started off her research career as a community researcher in local government. Natalie is particularly interested in participatory approaches in research. One of her favourite blog posts is about doing user research with colleagues."
        },
        {
            "text": "We have some excellent posts planned for the upcoming months, so please subscribe to the user research in government blog. And of course, do get in touch with any ideas you have for future posts by filling in this short survey."
        }
    ]
}