{
    "url": "https://planninginspectorate.blog.gov.uk/2021/11/18/why-we-need-to-prioritise-equality-diversity-and-inclusion/",
    "title": "Why we need to prioritise equality, diversity and inclusion",
    "authors": [
        "Gail Larkin"
    ],
    "categories": [
        "Equality Diversity and Inclusion",
        "People"
    ],
    "pub_date": "2021-11-18T11:19:20+00:00",
    "content": [
        {
            "text": "Gail Larkin, Lead HR Business Partner and lead on equality, diversity and inclusion for employees at the Planning Inspectorate reflects on the reasons behind the release of Inspectorate diversity statistics this week.  "
        },
        {
            "text": "Why is Equality, Diversity and Inclusion (ED&I) important to the Planning Inspectorate?  There is a clear business case: if you look at the McKinsey report ‘Diversity Wins’, their research demonstrates organisations that focus on diversity and inclusion outperform those that don’t – it’s that simple. "
        },
        {
            "text": "The Civil Service is committed to becoming an inclusive employer and recognises this is important to produce a more accountable, trusted public service which makes better decisions.  Read more about the Civil Service Diversity and Inclusion strategy. "
        },
        {
            "heading": 3,
            "text": "Supporting and championing diversity"
        },
        {
            "text": "We want to be sure we are representing our customers in the best way and we feel that to do that we need to have diversity of thought and approach.   "
        },
        {
            "text": "In simple terms, the best way to understand how to support customers and employees is to talk to people who experience barriers and difficulties in everyday life due to thought not being given to their needs. "
        },
        {
            "heading": 3,
            "text": "Creating a culture of inclusion"
        },
        {
            "text": "Diversity is only part of the picture; we also need to ensure we have a culture of inclusion.  We want our employees to be able to bring their whole selves to work and provide an environment where people thrive and want to stay.   "
        },
        {
            "text": "To do this we need to create a work environment whereby we have inclusive leadership and accountability among managers, equality and fairness of opportunity, and openness and freedom from bias and discrimination. "
        },
        {
            "text": "We also have obligations under the Public Sector Equality Duty.  "
        },
        {
            "text": "With this in mind we have developed the following priorities with accompanying targets to improve diversity and inclusion for our employees and we are working on our Public sector equality duty objectives for our customers. "
        },
        {
            "text": "Our ED&I priorities 2020 to 2025: "
        },
        {
            "text": " Our annual diversity statistical release, published today (18 November 2021) gives the information about where we are now. "
        },
        {
            "heading": 3,
            "text": "What have we done so far to progress our ED&I priorities?"
        },
        {
            "heading": 3,
            "text": "What’s planned for the future?"
        }
    ]
}