{
    "url": "https://kingsawards.blog.gov.uk/2024/06/26/scottish-business-load-monitoring-systems-lms-recognised-with-kings-award-for-enterprise/",
    "title": "Scottish business Load Monitoring Systems (LMS) recognised with King's Award for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Recipients",
        "Scotland"
    ],
    "pub_date": "2024-06-26T13:07:04+01:00",
    "content": [
        {
            "text": "At just seven years old, being honoured with the UK’s most prestigious business award in recognition of success in international trade is a monumental achievement and, for LMS, the timing coincides with another important landmark in our corporate journey writes Kirk Anderson, Managing Director of Load Monitoring Systems (LMS). "
        },
        {
            "text": "By the end of 2023, the level of our business coming from within the UK will fall below 50% of our overall revenues meaning that, for the first time, we will trade more overseas than in the UK. It is something of a watershed moment in our story and one we are very proud to have reached in the year we have received this accolade. "
        },
        {
            "text": "The LMS team has worked hard to successfully expand our international business operations and we are now active in more than 45 countries with the list growing all the time. Mostly recently, we have enjoyed notable growth in Europe (particularly in the Netherlands and Germany), and in Singapore.  "
        },
        {
            "text": "Our adoption of a broad, global vision has provided an important springboard for sustained and tangible growth, yielding an average of 9-10 new customers each month, of which 20% are international. We are very proud of all that we have done and receiving The King’s Award is important endorsement of our efforts, providing a motivational springboard to continue moving forward. "
        },
        {
            "text": "Our global vision has been augmented by looking across sectors and diversifying into other industries which include the likes of entertainment, aquaculture, construction and renewables as well as traditional spheres such as oil and gas and subsea.  This has fostered sustainability and solid foundations from which we continue to expand our corporate horizons, at home and abroad. "
        },
        {
            "text": "Another key to maintaining an ongoing and steep upward trajectory was the creation of a strategic partnership with leading Austrian chain manufacturer, pewag.  In early 2022, LMS worked hard to bring global investment to Aberdeen and secured this fellow market leader and the two organisations were able to join forces.  "
        },
        {
            "text": "Entering The King’s Award for Enterprise provided an important opportunity for us to refocus our attention on plans for our international business aspirations, and the self-reflective nature of the process allowed us to recap and recalibrate both our motivators and our expectations. "
        },
        {
            "text": "To be rewarded in a way which is so widely recognised, and held in such high esteem, reminds us just what is possible when a good team works in unison, and buoys us for the future which we now anticipate with confidence and optimism. "
        },
        {
            "text": "Aberdeen , Scotland, Tuesday, 4 July 2023\nLMS_Kings_Award\nPicture by Euan Duff/AbermediaLMS specialises in the design, manufacturing, sales, rental, and calibration of intelligent lifting equipment and load monitoring products and services, including load cells, line tension units, winch monitoring, air moving products, digital pad eye systems, data logging and crane safety instrumentation.  LMS provides support in over 45 countries and to a wide range of industry sectors, including energy, subsea, decommissioning, renewables, entertainment, aquaculture and construction.  To find out more, visit www.LoadMonitoringSystems.com "
        }
    ]
}