{
    "url": "https://mojdigital.blog.gov.uk/2024/08/21/meet-the-unsung-heroes-of-the-networks-infrastructure-team/",
    "title": "Meet the Unsung Heroes of the Networks Infrastructure Team",
    "authors": [
        "Niruja Thevathasan",
        "Jenny Casanova",
        "James Balfe"
    ],
    "categories": [
        "A day in the life",
        "a great place to work",
        "Our Culture"
    ],
    "pub_date": "2024-08-21T15:08:34+01:00",
    "content": [
        {
            "text": "Networks infrastructure is part of the Digital Infrastructure and Security Operations team (DISO), which is responsible for the Network, Cloud, Cyber Security and Voice and Video Services across the Ministry of Justice (MOJ) estate. "
        },
        {
            "text": "In this blog, three members of our Network Infrastructure Team share their personal journeys, reflecting on career transitions, challenges, and the rewarding experiences that shape their work in transforming digital infrastructure across the MoJ."
        },
        {
            "heading": 3,
            "text": "Jenny Casanova – Networks Infrastructure – Associate Product Manager "
        },
        {
            "text": "I am an Associate Product Manager working within the Digital Infrastructure and Security Operations (DISO) Team at Justice Digital. As part of my role, I have had the opportunity to be involved in many different areas across the Ministry of Justice (MoJ) estate. My current position has allowed me to meet and collaborate with many talented people who are at the top of their field."
        },
        {
            "text": "I have worked at the MoJ for 33 years, with 30 of those years spent at HM Courts and Tribunals  in Civil and Family Courts. Although the name has changed, the service we deliver has remained consistent. I even met my husband through the MoJ, as we worked in the same office for a time. He later transitioned to working for Digital Technology Services, which sparked my interest in pursuing a career change."
        },
        {
            "text": "I applied for a temporary promotion to work as a Product Owner in the Reform programme and found that I loved the role. Two years ago, I moved into a permanent position as an Associate Product Manager within Digital Infrastructure and Security Operations, and I have never looked back."
        },
        {
            "text": "The most rewarding part of this transition has been moving from an environment where I was very experienced and confident, having done it all before, to a new role where I was doing many things for the first time. Once I realised that all the skills I had acquired over the years could be applied in this new role, I stopped feeling out of my depth and began to regain my sense of control."
        },
        {
            "text": "I am very proud of the knowledge I have gained in such a short time and of the fact that I am making a difference in both my own team and the wider MoJ."
        },
        {
            "text": "The biggest challenge for me—and I believe for the entire DISO team—is balancing the breadth of initiatives we want to pursue with the need to prioritise work based on where it is most required. We always keep the needs of our users at the heart of what we do, which always helps to guide us in the right direction."
        },
        {
            "heading": 3,
            "text": "James Balfe – Networks Infrastructure – Associate Delivery Manager "
        },
        {
            "text": "I am an Associate Delivery Manager. What’s unique about my role - or at least interesting - is the amount of time I get to interact with people across the MoJ. I’ve met colleagues from HMCTS, Probation, Prisons, Estates, Data Analysis, and more. Everyone is kind, respectful, and very helpful—it’s a real breath of fresh air."
        },
        {
            "text": "I previously worked in the private sector, in operations and technology, for companies that built interesting products. I thought it would be great to do this kind of work but on behalf of the country. I am truly motivated by the idea of building innovative products and services that can make our country a better place to live."
        },
        {
            "text": "The most rewarding aspect of my role is working with a group of like-minded, motivated people who care about doing a good job."
        },
        {
            "heading": 3,
            "text": "Niruja Thevathasan – Networks Infrastructure – Operations Manager "
        },
        {
            "text": "I am an Operations Manager within the DISO team at Justice Digital. In my role, I have the privilege of engaging with various areas of the business, meaning I learn something new about the MoJ estate every single day. I also have the opportunity to collaborate with colleagues and leaders from across teams on different projects, this encourages me to think outside the box and strive for great results in whatever projects or tasks I’m involved in."
        },
        {
            "text": "I began my career in the private sector, working in various business operations and tech companies while finishing my final year at university. When I became a mother, especially during the pandemic, I sought a flexible organisation where I could grow and develop both professionally and personally. I have always been passionate about community activities and charities, which fueled my interest in working for the government. My father was a public servant in my hometown, and his dedication inspired me to pursue a role in public service. I wanted to contribute to society and make a real difference through my work."
        },
        {
            "text": "The transition from the private to the public sector was initially challenging for me. However, the most rewarding aspect of my work has been how quickly I was able to adapt to the culture, learn about the MoJ estate, and understand how we operate our day-to-day functions. The knowledge I’ve gained from senior colleagues and the way we operate has been incredibly fulfilling."
        },
        {
            "text": "The biggest challenge for me has been joining the Wider Area Networks (WAN) Team and recently transitioning to the Network Infrastructure Team, which is a new team with many areas to develop from scratch. This transition has been a significant challenge since joining the MoJ, as it required adapting to new responsibilities and continuing existing projects within a very short timeframe. "
        },
        {
            "text": "To overcome these challenges, my colleagues and I rely on teamwork and daily engagement. The key has been supporting each other, sharing knowledge, and guiding one another to ensure we all meet our team goals in the most efficient way possible."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Are you interested in joining our team?"
        },
        {
            "text": "Explore our Careers Site to learn about life at Justice Digital and discover how you can join our team today!"
        }
    ]
}