{
    "url": "https://ruralpayments.blog.gov.uk/2024/08/21/rpa-grants-service-team-at-shows-and-events/",
    "title": "RPA Grants Service team at shows and events",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement",
        "Grants"
    ],
    "pub_date": "2024-08-21T11:04:39+01:00",
    "content": [
        {
            "text": "RPA’s Grants Service team have been attending numerous shows across the country this year, with more to come. They are encouraging farmers and businesses to meet them at the RPA stand to get advice on the grants available. In this blog, two members of the Grants Service team write about their experience attending shows. "
        },
        {
            "text": "Sal Drew who works on the Farming Transformation Fund (FTF) said that for RPA staff, shows are a great way of interacting with farmers, agents and stakeholders. She said:"
        },
        {
            "text": "“Personally, I enjoy getting out there meeting people face to face, helping and guiding. But it’s not just farmers and agents - networking is a big part of being on the RPA stand. We mainly share the stand with Defra when we attend shows and it’s good listening to them, as I’ve learnt so much. At some shows we also share the stand with Catchment Sensitive Farming (CSF) and the Animal and Plant Health Agency (APHA) which brings more opportunity to network and learn."
        },
        {
            "text": "It’s great meeting with farmers or agents face to face; as it gives them the opportunity to ask questions, give us feedback or even have a little moan. Most of the time they want know what’s going on with their application, when a new scheme is coming out or when they’ll be getting paid. That’s what we’re there for - to help and guide. What’s really lovely is when people visit the stand to just sit and have a chat."
        },
        {
            "text": "We share as much information as we can on the day. Before a show there’s always a briefing call, then we are sent all the up-to-date information that’s relevant at the time. Everyone working the stand is always friendly and helpful."
        },
        {
            "text": "The shows also give us the opportunity to be able to look around and see the different types of machinery we fund, getting to know a bit more about them and how they help farmers. A number of shows we attend have plenty of farm animals - from highland cows, Valais Blacknose sheep and sheep dog pups. Seeing and learning about the different types of breeds shows how farmers are diversifying from just having a dairy herd to also breeding a rare breed of cattle, sheep or even alpacas.”"
        },
        {
            "text": "Georgina Ling, who works on the Farming Equipment and Transformation Fund (FETF) attended both the Great Yorkshire Show and the Three Counties Show in Worcestershire. She went along with the RPA Communications Team to help produce informative videos for our social media channels later this year. She said:"
        },
        {
            "text": "“Attending a show is a great way to meet farmers and the customers we deal with and be able to better understand their issues and priorities."
        },
        {
            "text": "The shows are all very different and there are new things to do and see at each one. While I was there, in between filming and being on the stand, we managed to find time to look at a variety of different animals and crafts, and it was interesting to see how much is out there."
        },
        {
            "text": "A great plus is that everyone on the stand is so nice and friendly, and they create a truly welcoming environment. I’ve found that representing RPA at shows has helped me to really understand how the work we do has an impact on grant applicants, and it’s also a great way to better understand farmers and their needs, as well as the issues they face.”"
        },
        {
            "text": "Visiting our stand at an event is often the only face-to-face contact people have with RPA, and for us, being able to meet farmers and agents provides unique feedback which influences the way we write guidance and design processes. It’s also a chance for us to gain some early insight into how you feel about our existing and future schemes, so If you’re attending any shows and events, during the rest of the year come and have a conversation with us."
        }
    ]
}