{
    "url": "https://mojdigital.blog.gov.uk/2022/12/13/a-bold-idea-and-a-blank-sheet-of-paper-reflections-of-the-digital-innovation-campaign/",
    "title": "A bold idea and a blank sheet of paper- Reflections of the Digital Innovation Campaign",
    "authors": [
        "George Armstrong"
    ],
    "categories": [
        "Digital Innovation"
    ],
    "pub_date": "2022-12-13T14:47:39+01:00",
    "content": [
        {
            "text": "The bold idea had been set out by Gina Gill, the MoJ’s Chief Digital and Information Officer - a Digital Innovation day… which became a week…which became a month, created for all staff across the MoJ to get involved in. "
        },
        {
            "text": "We need a dream team to pull this off! "
        },
        {
            "text": "I started a secondment working on the Digital Innovation Campaign at the end of September, temporarily moving from my usual role as a Senior Business Relationship Manager in the Technology Services team. I was paired up with Jaie Samson, also on this secondment with the usual role as a Lead Delivery Manager in the team who create digital services for the Office of the Public Guardian. Jaie and I had different, but complimentary skills for the mammoth task. Combined with Ros-Mari Mitova, Gina Gill’s Chief of Staff, and Jamie Not, Gina Gill’s Business Manager, we had the ‘dream team’ forming."
        },
        {
            "text": "We were presented with some high-level themes that became the structure of the campaign:"
        },
        {
            "text": "Full of enthusiasm and with November set as the month of the Digital Innovation Campaign, we got started in turning the (figurative) blank sheet of paper into one full of events."
        },
        {
            "text": "Quick and dirty user research"
        },
        {
            "text": "Although we were building this campaign at pace, we still attempted to embrace a user-centred approach. Making the most of the contacts I have built up with teams from across the MoJ in my substantive role, I carried out a series of focused discussions with business areas to understand what they would want out of a Digital Innovation Campaign – I named this “Quick and dirty user research”. What types of events would pique people’s interests? What subject matters do people engage with most? What are no-go areas? Essentially, I was trying to define effective vehicles to promote the themes set out above."
        },
        {
            "text": "I saw some trends in these discussions: People want to hear a unique perspective on the subjects we cover; they want to be inspired to innovate; and they don’t want to have their time wasted. I was surprised at how different areas of the MoJ saw innovation in different ways. One discussion with an operational colleague in the Prison space shared their version of innovation as encouraging people to make the most of the basic services already available to them. A discussion with a colleague in the People Group shared their version of innovation as a route to solve broader problems."
        },
        {
            "text": "Engagement with colleagues across Justice Digital, suppliers, cross-government stakeholders and governments internationally built up an ambitious roster of events across November – one that our internal Engagement team gulped at when we showed them! Thankfully for them, we refined the list of events slightly."
        },
        {
            "text": "Let’s slap a QR code on the robot dog"
        },
        {
            "text": "November came along and we opened with a bang – we live streamed Gina’s speaking slot at the GovTech summit in The Hague to MoJ colleagues and we focused the first week’s efforts in promoting the month of events we’d arranged. The kind people at Reply UK loaned us a robot dog which danced around the lobby of the MoJ’s central HQ building, catching lots of people’s attention, including the MoJ’s Permanent Secretary and Second Permanent Secretary. We also had a VR (Virtual Reality) headset experience on display of a Prison setting created by the Reply UK team in 48 hours – if this can be created in 48 hours, what opportunities are available with more time?"
        },
        {
            "text": "This is where another saying came along – “Let’s slap a QR code on the robot dog”. We used the attention of the robot dog and the VR headset as an opportunity to push the events, to get the word out there and encourage people to sign up. I was surprised and encouraged at how many people got their phone out and scanned the QR code on the back of the robot dog, even if it was hesitant as it hopped around."
        },
        {
            "text": "Over the next few weeks, we hosted a string of brilliant events – a culmination of events run by internal teams, suppliers and a range of cross-government and international stakeholders. Here’s a flavour of the types of events we ran:"
        },
        {
            "text": "8-12 weeks progress in one day"
        },
        {
            "text": "The events I am most proud of arranging are the ‘Rapid Discovery’ sessions – my colleagues are probably sick of hearing me talk about them! Operational colleagues in Prison and Probation identified internal problems they wanted to try and make progress on. I held a series of kick-off calls with a team of digital colleagues over the two weeks prior to the events to brief them, prepare a consistent agenda and plan the events as best as possible. We then proceeded to visit Manchester Probation Office and HMP Liverpool to use Justice Digital’s discovery techniques in a heavily compressed time period. "
        },
        {
            "text": "In the ‘Rapid Discovery’ session at Manchester Probation Office, we progressed in one day to a point that would usually take 8-12 weeks. Now, we didn’t validate every statement with users and didn’t manage to explore every element in as much depth as we usually would, but that’s the nature of working in this way. It was a very unique and focused way of working that we rarely get the opportunity to do."
        },
        {
            "text": "I’m exceptionally pleased with how these events went. We got the Prison and Probation teams closer to an outcome on the problems they identified and have opened the opportunity to reshape how we approach product and service discovery going forward."
        },
        {
            "text": "The emotional closure"
        },
        {
            "text": "The media-savvy Kim and Madonna in the Technology Adoption Group put together a video reflecting on the highlights of the month’s events for one of the final events that we named “It’s only the beginning”. When I saw this video for the first time, I had goosebumps. It was sad to see the end of a campaign which had so much effort put into it and had such positive outcomes."
        },
        {
            "text": "The events aligned with the initial structure we put together and had a well-balanced collection of events with consistently high attendance. The campaign was also a positive demonstration of effective teamwork between me, Jaie, Ros-Mari and Jamie, the Engagement team and beyond – we supported one another effectively and on the odd occasion when things didn’t go to plan, we acted quickly."
        },
        {
            "text": "Across the Ministry of Justice this campaign started a conversation about innovation, inspired people to think outside the box and has created a buzz around Justice Digital."
        },
        {
            "text": "For me personally, it has been an extremely fulfilling experience with significant exposure to different ways of working. Event Management is far different from Relationship Management – the pace, the intensity and the pressure. I’ve had the chance to liaise with senior stakeholders and colleagues in a way that I never usually get the opportunity to and that is rewarding in every way. I’m exceptionally pleased to have done my part in building MoJ staff’s understanding of Justice Digital, showing the art of the possible across the digital industry, plus helping to fix some of the bigger and smaller problems staff might be facing."
        },
        {
            "text": "So… another Digital Innovation Campaign next year?"
        }
    ]
}