{
    "url": "https://defrafarming.blog.gov.uk/2022/12/13/funding-available-for-robotics-and-automation-in-farming/",
    "title": "Funding available for robotics and automation in farming",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation",
        "Things we're doing"
    ],
    "pub_date": "2022-12-13T12:33:35+00:00",
    "content": [
        {
            "text": "From 9 January 2023, farmers, growers and agritech businesses in England will be able to apply for funding to develop innovative ideas in the areas of robotics and automation."
        },
        {
            "text": "In this post, I’ll give an overview of the competition, dates for your diary and links for you to find out more."
        },
        {
            "heading": 2,
            "text": "The robotics and automation competition"
        },
        {
            "text": "The £12.5 million robotics and automation competition is part of the Farming Innovation Programme. "
        },
        {
            "text": "The £270 million programme funds ambitious research and development projects to overcome barriers and create a more productive and sustainable sector. "
        },
        {
            "text": "The robotics and automation competition follows the climate smart farming competition and the sustainable farm-based proteins competition which we ran earlier this year."
        },
        {
            "text": "This competition focuses specifically on robotics and automation in agriculture and horticultural production. "
        },
        {
            "text": "The competition is structured to fund 2 types of projects: "
        },
        {
            "text": "As you can see, projects must be collaborative. This is a business-led competition and we encourage farmers and growers to be part of the project-teams."
        },
        {
            "text": "By investing in robotics and automation, we hope to improve productivity on farms, encourage sustainable farming practices, and use data to improve animal welfare and food quality. "
        },
        {
            "text": "In the long term, we hope that investment in this area will help to reduce input costs. Automation and robotics were also identified in the National Food Strategy for their potential to promote growth in the sector."
        },
        {
            "heading": 2,
            "text": "The scope  "
        },
        {
            "text": "Horticultural and arable crop production and all livestock are in scope. Controlled environment and vertical farming systems are also in scope. "
        },
        {
            "text": "As with previous competitions, projects should demonstrate the benefits to farmers and growers in England."
        },
        {
            "text": "The project should address challenges where automation and robotic solutions will benefit food production systems through greater efficiency and resilience. "
        },
        {
            "text": "Example projects could include robotics to move fruit from picker to packing station; robotic feeding and cleaning mechanisms for livestock; monitoring livestock welfare; and automatic monitoring of soil, plant health and crop yields."
        },
        {
            "text": "The competition will not cover funding for ornamental, non-food crops or wild-caught fisheries. "
        },
        {
            "heading": 2,
            "text": "Assessing applications"
        },
        {
            "text": "Assessors, who are picked for their expertise, will score the responses on the application form. "
        },
        {
            "text": "This video explains how the applications will be selected: "
        },
        {
            "text": "The competition brief will explain what applicants must cover in their submissions. "
        },
        {
            "heading": 2,
            "text": "Next steps, links and dates for your diary"
        },
        {
            "text": "UKRI will open the competition on 9 January 2023 and close on 15 March 2023. "
        },
        {
            "text": "Using the following links you'll be able to apply for industrial research projects and apply for experimental development projects."
        },
        {
            "text": "As I mentioned, we’re encouraging farmers and growers to be involved in the project teams. They can help make sure the projects are viable on farm."
        },
        {
            "text": "UKRI and Innovate UK KTN will hold consortia building events starting on 18 January 2023. Farmers and growers are very welcome, so do register to attend. "
        },
        {
            "heading": 2,
            "text": "Coming up in 2023"
        },
        {
            "text": "In early 2023, we will launch further rounds of the Research Starter and Large R&D Partnership competitions."
        },
        {
            "text": "More details on these will be released here on the blog and the Farming Innovation Programme website. "
        },
        {
            "text": "Subscribe to the Future Farming blog for the latest."
        }
    ]
}