{
    "url": "https://actuaries.blog.gov.uk/2022/12/13/gad-engages-at-giro/",
    "title": "GAD engages at GIRO",
    "authors": [
        "Tejas Dholakia - Actuary"
    ],
    "categories": [
        "Actuary",
        "Insurance",
        "Risk management"
    ],
    "pub_date": "2022-12-13T10:56:15+00:00",
    "content": [
        {
            "text": "I was really pleased to be part of this important and impactful major actuarial conference. As a junior actuary I was one of a number of speakers from the Government Actuary’s Department (GAD) who shared expertise at the GIRO conference."
        },
        {
            "text": "Topics discussed included issues and new research across the general insurance sector, such as:"
        },
        {
            "text": "Around 1,000 people attended GIRO, which was held in Liverpool. This was the first time in 3 years that it had been held as an in-person event."
        },
        {
            "text": "Actuaries from GAD gave talks on different types of topics."
        },
        {
            "heading": 2,
            "text": "GAD talks about the PIDR"
        },
        {
            "text": "Together with the Deputy Government Actuary Matt Gurden, I was one of the speakers about the Personal Injury Discount Rate (PIDR) to a room of around 120 delegates."
        },
        {
            "text": "The PIDR relates to when damages are awarded to claimants who have endured life-changing events which have led to serious and long-term injuries. The lump sum payments are intended to provide victims with full and fair financial compensation for all the expected losses and costs caused by their injuries."
        },
        {
            "text": "So, where a claim for future losses is settled as a single cash amount, the assessment of future losses and costs is converted into a lump sum allowing for the:"
        },
        {
            "text": "This assumed investment return is the PIDR. The Government Actuary has responsibilities in relation to setting the rates across the UK jurisdictions."
        },
        {
            "text": "At GAD’s PIDR session, we spoke about how the historical rate has changed from 2010 and especially about the changes over the last 5 years. We also spoke about the fact there are different rates for England and Wales, for Scotland and for Northern Ireland."
        },
        {
            "text": "These are due to a variety of factors including, for example, being undertaken at different times of the year. Attendees also heard how markets have already moved from the time of the Northern Ireland review earlier this year to now. This illustrates the difficulty of predicting the outcome of the next review for England and Wales scheduled for 2024. The next step is to bring the Northern Ireland PIDR cycle in sync."
        },
        {
            "heading": 2,
            "text": "GAD engages on a range of other topics"
        },
        {
            "text": "GAD actuaries play an active role in the work of the profession, for example by volunteering and contributing to working parties. One of my colleagues, GAD actuary Jacqui Draper, is co-chair of the Third Party Working Party, and gave an update from that working group."
        },
        {
            "text": "This provided a comprehensive overview of claims trends for private car comprehensive insurance cover, including the impacts of inflation, recovery from the pandemic and early insights into whiplash reforms."
        },
        {
            "text": "Overall, the GIRO conference had a wide range of seminars for people to choose from such as:"
        },
        {
            "text": "These sessions help me (and other colleagues) to keep up to date on the latest developments in actuarial thinking and relevant topics from the market. In turn, this helps us to keep our clients informed with the best possible advice."
        },
        {
            "text": "In all, it was a valuable experience to be part of this prestigious event. I enjoyed networking with other actuaries and learned a lot. Most of all, it was both a challenge and a privilege to be on the speaking team."
        }
    ]
}