{
    "url": "https://naturalengland.blog.gov.uk/2022/12/13/the-paludiculture-exploration-fund-invites-you-to-explore-the-future-of-wet-farming-on-peat-soils/",
    "title": "The Paludiculture Exploration Fund invites you to explore the future of wet farming on peat soils",
    "authors": [
        "Jim Milner"
    ],
    "categories": [
        "Climate change",
        "Farming",
        "Peat"
    ],
    "pub_date": "2022-12-13T10:30:36+00:00",
    "content": [
        {
            "text": "By Jim Milner - PEF Project Manager, Natural England and Jordan Champ - Senior Policy Advisor, Lowland Peat, Defra"
        },
        {
            "text": "In our first blog post in September, we introduced paludiculture, a system of farming on rewetted peat soils. Paludiculture offers an opportunity to continue profitable agriculture on our lowland peatlands while also managing the land in a way that benefits the environment and supports our Net Zero ambitions. We are now looking forward to the new Paludiculture Exploration Fund (PEF) opening for applications in the new year."
        },
        {
            "text": "The PEF is a new grant scheme managed and delivered by Natural England. It will be open to projects focused on tackling the barriers to developing commercially viable paludiculture on lowland peat soils in England. Applications could come from individual farmers, businesses, charities, local authorities, landowners or a collaborative partnership or group."
        },
        {
            "text": "The PEF will support projects to explore how water levels might be raised and managed at a field scale or larger, how crop production might be increased or new products and markets developed from paludiculture crops. Projects will work to investigate how we can reduce peat wastage and greenhouse gas emissions, while understanding barriers and kickstarting paludiculture towards becoming a commercially viable farming practice."
        },
        {
            "text": "Maintaining water levels just below the surface of peat soil keeps emissions to a minimum and offers opportunities for growing new crops suited to wetter soils. Over 80 crops have been identified as potentially suitable for a wet farming system in this report. In this way, paludiculture has the potential to significantly reduce greenhouse gas emissions from lowland peat soils and the PEF can help to explore the most promising of these paludiculture crops."
        },
        {
            "text": "Farming on rewetted peatland will also require the development of practical sowing, growing and harvesting equipment, as well as processing tools and methods to manufacture a desirable product. The PEF will fund projects to adapt and develop machinery that enables productive farming in wet conditions."
        },
        {
            "text": "There are a number of trials already underway in England investigating the potential of sphagnum moss, used as a replacement for peat compost in horticulture. The PEF can support trials such as these to expand, as well as supporting new trials and pilots investigating new wetland crops."
        },
        {
            "text": "Innovators in the UK and across Europe are paving the way for new products that use paludiculture crops, such as the use of typha (bulrush) to make building materials as well as insultation for clothing. The PEF can support innovators to develop such products and investigate new uses and markets for them. You might recall from the September blog post that we import 95% of our thatching reed. Is there an opportunity through the PEF to help develop the domestic supply of reed?"
        },
        {
            "text": "Agriculture in England has a rich history of innovation and adaption to new challenges and opportunities. It is early days for paludiculture in England, but the PEF is designed to drive this new farming system towards becoming a reality."
        },
        {
            "text": "We are excited to welcome applications in the new year from anyone who feels they can help move our knowledge forward. For more information, please contact peatlandscheme@naturalengland.org.uk and to register your interest in applying, please go to Atamis Portal"
        }
    ]
}