{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/12/13/the-subsidy-advice-unit-ready-for-business/",
    "title": "The Subsidy Advice Unit – ready for business",
    "authors": [
        "Rachel Merelie"
    ],
    "categories": [
        "Subsidy Advice Unit"
    ],
    "pub_date": "2022-12-13T13:38:02+00:00",
    "content": [
        {
            "text": "The Subsidy Advice Unit (SAU), part of the Competition and Markets Authority (CMA), will begin its work as part of the new UK subsidy control regime on January 4, 2023."
        },
        {
            "text": "Unlike under the previous EU State Aid regime, the SAU’s reports on subsidies referred to it are advisory in nature – we do not have the power to block or approve subsidies."
        },
        {
            "heading": 3,
            "text": "Our role"
        },
        {
            "text": "The SAU is the independent body for the UK’s subsidy control regime - referred to in the EU-UK Trade and Cooperation Agreement (TCA)."
        },
        {
            "text": "We’ll play a specific role in the regime by looking at the highest value and/or most potentially distortive subsidies put forward by public authorities (criteria for referrals have been defined in regulations by BEIS)."
        },
        {
            "text": "This will involve evaluating and reporting on the public authority’s assessment of compliance against the subsidy control requirements set out in legislation."
        },
        {
            "text": "We’ll also monitor and report on the operation of the UK subsidy control regime to help ensure it is working effectively."
        },
        {
            "text": "Find out more about the SAU’s role."
        },
        {
            "heading": 3,
            "text": "SAU team"
        },
        {
            "text": "Over the past few months, we’ve been setting up our multi-disciplinary team based in our London, Belfast, Edinburgh and Cardiff offices. This includes professionals across policy and project management, legal, economics and finance and business analysis."
        },
        {
            "text": "Most of the team have been working together since April - completing a range of training activities on the new subsidy control regime and our new functions."
        },
        {
            "text": "We’ve also been engaging with public authorities across the UK – including governments in all 4 nations – and other interested parties to raise awareness of our role."
        },
        {
            "text": "Preparing for launch"
        },
        {
            "text": "As well as raising awareness, we’ve been keen to understand how different public authorities approach subsidy control so we can support them as best we can once we launch."
        },
        {
            "text": "Once the new subsidy control regime begins on 4 January 2023, we will start accepting referrals of subsidies through our Public Authority Portal (PAP). We’ve been working hard on the digital front to get this set up, ahead of time."
        },
        {
            "text": "We’ve also been busy preparing for launch on the process side. Last month, we published our guidance on how the SAU will operate which sets out how we’ll carry out our functions, including:"
        },
        {
            "text": "·     associated timescales and procedures"
        },
        {
            "text": "·     some of the technical concepts and analytical approaches involved; and"
        },
        {
            "text": "·     our approach to prioritising cases"
        },
        {
            "text": "We will have 5 working days to accept or reject a referral, followed by 30 working days to produce our report."
        },
        {
            "text": "Our guidance includes the processes for pre-referral discussions and making a referral, so we’d encourage any public authorities who think they may need to make an SAU referral to look at this."
        },
        {
            "text": "You can find out more about the overall subsidy control regime – including statutory guidance – from the Department for Business, Energy & Industrial Strategy."
        }
    ]
}