{
    "url": "https://nationalscreening.blog.gov.uk/2022/12/13/uk-nsc-public-engagement-on-genome-sequencing-wins-prestigious-award/",
    "title": "UK NSC public engagement on genome sequencing wins prestigious award",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-12-13T10:07:15+00:00",
    "content": [
        {
            "text": "An in-depth public discussion commissioned by the UK National Screening Committee (UK NSC), Genomics England, and UK Research and Innovation’s Sciencewise programme has won a prestigious national award."
        },
        {
            "text": "The public dialogue on the implications of whole genome sequencing (WGS) for newborn screening won the 2022 Market Research Society (MRS) award for public policy/social research."
        },
        {
            "text": "The work, by social research specialists Hopkins van Mil, brought together 133 members of the public to carefully consider the complex ethical and societal implications of using WGS technology in newborn babies."
        },
        {
            "text": "Overall, participants were broadly supportive of the potential use of WGS for newborn screening, but only if:"
        },
        {
            "text": "Professor Anne Mackie, UK NSC Director of Programmes, said:"
        },
        {
            "text": "In praising the public engagement work delivered by Hopkins van Mil, the MRS awards judges said:"
        },
        {
            "text": "Hopkins Van Mil director Henrietta Hopkins said:"
        },
        {
            "text": "See full list of award winners and pictures from the awards ceremony."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}