{
    "url": "https://socialcare.blog.gov.uk/2022/06/08/carers-week-celebrating-and-supporting-unpaid-carers/",
    "title": "Carers Week: celebrating and supporting unpaid carers",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Events",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2022-06-08T13:39:42+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Visible, valued and supported"
        },
        {
            "text": "In our modern era of awareness raising and the championing of marginalised or underrepresented communities, it seems hardly a day, week or month goes by without worthwhile recognition being shone on another deserving cause. This week is no different as we celebrate the incredible contribution unpaid carers make to the health and wellbeing of society."
        },
        {
            "text": "Carers Week has always been about increasing visibility and support for those who give their time, energy and commitment to care for family, friends and loved ones. Which is why, as we emerge from the privations of the pandemic, this year’s theme of making carers more ‘visible, valued and supported’ has never been more relevant."
        },
        {
            "text": "Even in normal times, carers too often drop off the radar, missing out on services and resources which could help them sustain their own health and wellbeing, just as they seek to sustain others. Sometimes, it’s due to lack of access or provision, other times it’s because carers themselves don’t identify as such and therefore don’t ask for the support they need and deserve."
        },
        {
            "text": "We can all do something about that."
        },
        {
            "text": "While it is true much of my role involves supporting, empowering and celebrating our care workforce, our health and care system would barely function without the network of unpaid or informal carers who are there for their loved ones in the times and spaces we can’t occupy."
        },
        {
            "text": "Not only should we be more proactive as a sector in our support, as individuals we must be more alert to those who may be feeling the strain and point them towards advice, resources and services which can better support them. Paid or unpaid, everyone deserves a fulfilled, healthy and happy life alongside caring."
        },
        {
            "heading": 2,
            "text": "The intensity of caring"
        },
        {
            "text": "Caring responsibilities are often intense at times. I know this from my own experience within my family, which is why we need to do more to provide respite care and, in particular, encourage educators and employers to proactively recognise their staff’s caring obligations outside work. For those of us working in or with the care sector, we must be more alert to those who need the space to care."
        },
        {
            "text": "Quite rightly, unpaid carers feature prominently in the Government’s adult social care reform white paper, ‘People at the heart of care’ and up to £25 million will be invested in the sector to kick-start a change in the services provided to support them. This might include respite and carers’ breaks, enhanced peer group networks and boosted community support."
        },
        {
            "text": "It shouldn’t need spelling out, but ‘choice, control, and independence’, as referenced in the white paper, are not concepts limited to those who draw on services. Social care reform is about giving everyone the agency to care – or be cared for – in a way which reflects their needs and aspirations."
        },
        {
            "text": "There is therefore an obligation on all of us to better understand the rich diversity of our communities and empower them with the information and advice they need to make informed decisions which reflect the lives they want to lead."
        },
        {
            "text": "For my part, I will continue to encourage and promote the upskilling and registration of our professional care workforce so they can provide even better support to unpaid carers and their families. No one should ever bear the burden of caring alone, no matter how willingly offered. If we care for the carers, not just the cared for, we care for society as a whole. It is an honour and a privilege to be part of such a grand enterprise. Happy Carers Week!"
        }
    ]
}