{
    "url": "https://deframedia.blog.gov.uk/2022/06/08/environment-agency-launches-flooding-roadmap-as-it-warns-of-inevitable-impacts-of-a-rising-sea-level/",
    "title": "Environment Agency launches flooding roadmap as it warns of “inevitable impacts of a rising sea level”",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2022-06-08T13:50:10+01:00",
    "content": [
        {
            "text": "There has been widespread coverage on Environment Agency chief executive Sir James Bevan’s warnings that some coastal communities will have to be moved away from danger caused by the “inevitable impacts of a rising sea level”."
        },
        {
            "text": "Sir James made the comments at the Flood and Coast conference in Telford, Shropshire on Monday (June 7), where he warned that “there is no coming back for land that coastal erosion has taken away or which a rising sea level has put permanently or frequently under water.”"
        },
        {
            "text": "National publications including The Daily Mail, The Mirror, ITV News, The Daily Telegraph carried his comments. While regional publications including the Yorkshire Post, Eastern Daily Press and Dorset Live also highlighted his warnings."
        },
        {
            "text": "They came as the Environment Agency launched its new FCERM Strategy Roadmap which sets out the practical actions the Environment Agency and partners will take to tackle the growing threat of flooding from rivers, the sea, and surface water as well as coastal erosion. Publications including Business Green and Agriland covered the roadmap."
        },
        {
            "text": "Actions include producing a new national assessment of flood risk, an updated national coastal erosion risk map and new long term investment scenarios, to better inform future investment decisions."
        },
        {
            "text": "Launching the roadmap, Sir James Bevan, Chief Executive of the Environment Agency, said:"
        },
        {
            "text": "Alongside a record £5.2 billion investment in some 2,000 new projects to better protect communities by 2027, £150 million is being invested through the Flood & Coastal Resilience Innovation Programme to support 25 pioneering projects to tackle the threat of flood and coastal change in innovative ways, and earlier this year the Coastal Transition Accelerator Programme was launched, providing up to £36 million in funding to communities in North Norfolk and the East Riding of Yorkshire to help them prepare and adapt to coastal change."
        },
        {
            "text": "Action taken by the Environment Agency, government, and partners has delivered significant progress over recent years. £2.6 billion was invested between 2015-2021 to better protected more than 314,000 homes – a programme delivered on time, on budget, and above target – and despite heavier rainfall and more frequent storms in recent years, proportionately fewer properties have flooded."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}