{
    "url": "https://environmentagency.blog.gov.uk/2022/06/08/how-wiltshire-farmers-are-helping-to-clean-up-water-in-the-kennet-catchment/",
    "title": "How Wiltshire farmers are helping to 'clean up' water in the Kennet catchment",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Fisheries and biodiversity",
        "Water"
    ],
    "pub_date": "2022-06-08T15:27:01+00:00",
    "content": [
        {
            "text": "Charlotte Hitchmough and Rupert Kelton from Action for the River Kennet talk about a project to improve river water quality and create new wetland habitat in a sub-catchment of the Kennet in Wiltshire. The Sparkling Streams project has repurposed an old slurry lagoon into a sediment pond and created a series of new wetlands at Freewarren Farm, a 60-acre grassland farm bordering Wilton Water."
        },
        {
            "text": "The project has taken a few years to come to fruition and is an example of the benefits of working with catchment partnerships: building relationships with landowners, developing a good understanding of the issues, jointly creating solutions and finding funding to make them possible."
        },
        {
            "text": "The Wilton Water reservoir in Wiltshire is in the Upper Dun Waterbody and provides flow to both the Kennet and Avon Canal and the River Dun, which in turn flows into the River Kennet at Hungerford. The Dun and the Kennet are both chalk streams."
        },
        {
            "text": "Much of the land around Wilton Water falls within a farm cluster group known as the Southern Streams Farmer Group. The cluster covers 25,000 acres, and after working with their Catchment Sensitive Farming advisor and Action for the River Kennet for many years, one of the main aims of the farm cluster was to focus on improving water quality, particularly reducing sediment and nutrient entering Wilton Water."
        },
        {
            "text": "By including the wetland in the Sparkling Streams project, Action for the River Kennet were able to translate the farm cluster’s ambition into action on the ground at Freewarren Farm, East Grafton. Historically, large quantities of sediment have been entering the Suddene Stream - which is upstream of Wilton Water - via a road ditch off Dark Lane. The sediment affects the water quality of the River Dun and the Kennet & Avon Canal, which both connect to the River Kennet Site of Special Scientific Interest (SSSI). Currently this SSSI is at risk of failing statutory water quality standards due to sediment and phosphates."
        },
        {
            "text": "Although the farm itself poses little risk of soil erosion or run-off into Wilton Water, it is in a good position to help ‘clean up’ Wilton Water. The sediment pond will channel the water running off Dark Lane and enable sediment to settle out before entering the Suddene Stream, where the newly created system of constructed farm wetland areas will further filter the water before it flows into the reservoir. The landowner was happy to diversify the habitat in this area of the farm and recognised the wider benefit to the catchment."
        },
        {
            "text": "The work at Freewarren Farm is part of a wider effort by the Southern Streams Farmer Group and the Sparkling Streams project to assess and implement interventions across the catchment, including tree and hedge planting, leaky dams, cover crops and more wetland creation. It is feasible that all the streams that feed into Wilton Water and their catchments could have measures installed that will reduce their sediment loading. The cumulative effect from this catchment scale approach would substantially improve the quality of the water feeding into Wilton Water, with subsequent benefits to the water quality of the River Dun and the River Kennet."
        },
        {
            "text": "Sparkling Streams is a partnership between Action for the River Kennet, the Southern Streams Farmer Group and the Town & Manor of Hungerford and was administered by the North Wessex Downs AONB. The project was funded through the government’s Green Recovery Fund, which is being delivered by The National Lottery Heritage Fund in partnership with Natural England and the Environment Agency.  The work on Freewarren Farm is a joint effort between the farm owner, ARK, the Environment Agency and Natural England."
        },
        {
            "text": "This is the first project that we have run on a sub-catchment scale and we completed a huge amount of work within a twelve month window. We are looking forward to seeing the benefits to the river as well as watching the development of the wetland as the plants get established this spring."
        }
    ]
}