{
    "url": "https://ofsi.blog.gov.uk/2022/06/08/new-enforcement-powers-a-message-from-giles-thomson-director-of-ofsi/",
    "title": "New enforcement powers - a message from Giles Thomson, Director of OFSI",
    "authors": [
        "Giles Thomson"
    ],
    "categories": [
        "enforcement",
        "Financial sanctions",
        "Implementation",
        "UK"
    ],
    "pub_date": "2022-06-08T11:13:08+01:00",
    "content": [
        {
            "text": "Some important changes to OFSI’s enforcement powers come into force next week. I would therefore like to take this opportunity to explain how we have recently updated OFSI’s Monetary Penalty guidance, as well as our ongoing enforcement approach, in light of these recent changes."
        },
        {
            "text": "Following the Russian invasion of Ukraine, the government brought forward the Economic Crime (Transparency and Enforcement) Act 2022 which included important changes to OFSI’s powers that will enable us to remain a world leader in sanctions enforcement and continue to respond robustly to breaches of financial sanctions. These measures will commence on 15 June 2022, and we have today published updated guidance to reflect these changes."
        },
        {
            "text": "Firstly, for breaches of financial sanctions that are committed after 15 June 2022, OFSI will be able to impose civil monetary penalties on a strict civil liability basis. This means the previous requirement for OFSI to prove that a person had knowledge or reasonable cause to suspect that they were in breach of financial sanctions will be removed, but we will still bear the burden of proof to establish that there was a breach of financial sanctions prohibitions. This brings this aspect of UK financial sanctions legislation more in line with the legal test used for the import and export of arms, and the model used for US financial sanctions. There is no equivalent change to the financial sanctions criminal legal test or threshold."
        },
        {
            "text": "This change will strengthen OFSI’s ability to take appropriate enforcement action against persons (including both natural and legal persons) that fail to ensure they are not dealing with sanctioned entities or adhere to their financial sanctions obligations. It does not mean that OFSI will impose a monetary penalty in every case we find there to be a breach of financial sanctions. OFSI imposes monetary penalties where it is appropriate, proportionate and in the public interest to do so, and this will continue to be the case from 15 June 2022."
        },
        {
            "text": "Our updated monetary penalty guidance does not represent a change to OFSI’s overall enforcement approach and continues to emphasise the importance of self-disclosure as a potential mitigating factor. To ensure OFSI’s enforcement is proportionate, OFSI will continue to assess how severe the overall breach is as well as the conduct of the persons involved. This includes consideration of whether the person committing the breach knew or suspected that their conduct amounted to a breach of financial sanctions, as well as expected knowledge of the person and their exposure to financial sanctions risk. Whilst we do not prescribe what due diligence should be undertaken to prevent breaches of financial sanctions, we will continue to take into account efforts to prevent such breaches when deciding on any enforcement action."
        },
        {
            "text": "We’ve also gained the power to publicise details of financial sanctions breaches committed after 15 June 2022 where a monetary penalty has not been imposed by OFSI. These will include a summary of the case and the persons that committed the breach. This addition to our enforcement toolkit will help to raise awareness of financial sanctions, how OFSI approaches and implements them, and to deter future non-compliance. The power only applies where there is found to be a breach of financial sanctions, and publication will be considered on a case-by-case basis - including whether the case involves important compliance lessons for industry. OFSI will notify persons prior to publication to provide an opportunity to make representations."
        },
        {
            "text": "Lastly, we’ve introduced flexibility in the review process for monetary penalties. Reviews requested after 15 June 2022 may now be undertaken by someone other than a minister, which will allow HMT to more effectively manage the resourcing implications of this work. Those found to have breached financial sanctions will still have the same right to obtain a review of monetary penalties issued. This change does not in any way change or weaken the ability to further challenge OFSI’s monetary penalties at the Upper Tribunal."
        },
        {
            "text": "I hope you will find updates in our guidance covering these changes to be useful. However, OFSI’s guidance is not static. We will continue to review it and our enforcement policy to ensure they best deliver and reflect our objectives."
        },
        {
            "text": "We remain open and keen to engage with what business and stakeholders consider to be areas where OFSI’s guidance could go further in detail, or explaining how we make decisions. Do contact us through existing industry channels and our email address below. I would also point to our monetary penalty decision cases which provide detailed explanations of where and why OFSI decides to impose monetary penalties."
        },
        {
            "text": "OFSI will continue to robustly but fairly and proportionately use the enforcement tools available to us, including but not limited to imposing monetary penalties, to effectively enforce financial sanctions in the UK. The importance of financial sanctions to the UK government’s foreign policy has been further demonstrated by the UK’s response to the Russian invasion of Ukraine. Compliance with UK financial sanctions is crucial to them remaining as effective as possible, and we thank those working across industry for playing their part."
        },
        {
            "text": "If you have any questions about this blog, please email ofsi@hmtreasury.gov.uk."
        },
        {
            "text": " "
        }
    ]
}