{
    "url": "https://gds.blog.gov.uk/2022/06/08/the-gds-fast-a-thon-how-our-muslim-community-shared-ramadan/",
    "title": "The GDS Fast-a-thon: how our Muslim community shared Ramadan",
    "authors": [
        "Iqbal Ahmed - Senior Frontend Developer, Government Digital Service"
    ],
    "categories": [
        "GDS team",
        "People and skills"
    ],
    "pub_date": "2022-06-08T09:00:26+01:00",
    "content": [
        {
            "text": "The Muslim Community at GDS hosted its third annual Ramadan Fast-a-thon. The Fast-a-thon started 3 years ago as an opportunity for people around GDS to experience and appreciate what Muslims do during the month of Ramadan and build a sense of unity."
        },
        {
            "text": "Ramadan is the month in which Muslims fast from dawn to sunset and spend time on more religious activities. Ramadan is something that Muslims look forward to and use as a time to reflect. It is usually a very social period when people come together to break their fast."
        },
        {
            "heading": 2,
            "text": "Taking part in the Fast-a-thon"
        },
        {
            "text": "To try and include as many people as possible, the Fast-a-thon provided different ways for people to take part. We were mindful that not everyone would have the ability to fast for the whole day.  Colleagues were invited to participate in a number of ways including:"
        },
        {
            "text": "This was really important and participants really appreciated that there were different ways to join in."
        },
        {
            "heading": 2,
            "text": "Beginning the day"
        },
        {
            "text": "As is traditional during Ramadan, for those that were able to fast, they would wake up before dawn (usually around an hour and half before sunrise) to eat their final bits of food before the fasting started."
        },
        {
            "text": "Some participants reflected how it was amazing to think that millions of people around the world are doing the same thing, which gave them a sense of connection."
        },
        {
            "heading": 2,
            "text": "Support throughout the day"
        },
        {
            "text": "We hosted a Slack channel for all the participants, where they could share how they were doing throughout the day and send messages of support to others. People really enjoyed being able to share this experience together."
        },
        {
            "text": "Whenever someone struggled, there was always lots of support and encouragement to keep people going."
        },
        {
            "heading": 2,
            "text": "Breaking fast together"
        },
        {
            "text": "This year, we also broke fast together, which is known as Iftar. This was done virtually. This was a really fun experience where we congratulated each other for completing the Fast-a-thon."
        },
        {
            "text": "Many participants said how the fasting prompted them to appreciate the food in front of them and think of those who are less fortunate. There were also lots of comments about how good the food tasted after not eating during the day."
        },
        {
            "text": "A big part of the Ramadan experience is getting together and seeing friends and family. So it was great to share that experience with GDS colleagues."
        },
        {
            "heading": 2,
            "text": "Reflections after a week"
        },
        {
            "text": "We also had a session after a week to share some thoughts and reflections."
        },
        {
            "text": "A common theme was the feeling of togetherness and support in going through this experience together."
        },
        {
            "heading": 3,
            "text": "Reflections from Muslim colleagues"
        },
        {
            "text": "The Muslims at GDS really appreciated non-Muslim colleagues joining in. They enjoyed getting to know new people they hadn’t interacted with before and sharing their experience together."
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "The Fast-a-thon was a great opportunity to share the spirit of Ramadan and show different aspects of Islam. We also enjoyed the togetherness of the Fast-a-thon and the chance to get to know colleagues from different teams who we would not usually interact with."
        },
        {
            "text": "We would like to also thank everyone for taking part in the Fast-a-thon with great commitment and enthusiasm. We hope to continue the Fast-a-thon next year and have more colleagues join in."
        }
    ]
}