{
    "url": "https://videosurveillance.blog.gov.uk/2022/06/08/trusted-partnership-with-trusted-private-sector-partners/",
    "title": "Trusted partnership with trusted private sector partners",
    "authors": [
        "frasersampson"
    ],
    "categories": [
        "Biometrics",
        "Biometrics and Surveillance Camera Commissioner",
        "Ethics",
        "Local authorities",
        "Partnerships",
        "Policing",
        "Surveillance cameras",
        "Technology"
    ],
    "pub_date": "2022-06-08T13:55:22+01:00",
    "content": [
        {
            "text": "Big Brother Watch are holding a parliamentary event today on 8th June, launching their report 'Who’s Watching You? The dominance of Chinese state-owned surveillance in the UK' and the pledge from MPs and rights groups for Hikvision and Dahua to be banned in the UK, along with a nationwide review of the ethics and capabilities of CCTV in the UK."
        },
        {
            "text": "From my perspective as Biometrics and Surveillance Camera Commissioner the issue is very simple. The use of biometric surveillance by the state is a matter of increasing sensitivity and significant public concern - not just here but globally."
        },
        {
            "text": "As almost all of the technological capability for biometric surveillance is privately owned, the only way we will be able to harness the legitimate uses of that technology in the future is in trusted partnership with trusted private sector partners."
        },
        {
            "text": "The people we trust - the police, fire and rescue, local authorities, the government itself - need to be able to trust their technology partners, both in terms of security and our ethical and professional values."
        },
        {
            "text": "And the publicly available evidence tells me that some of these companies - notably Hikvision and Dahua - simply cannot be trusted, partly because of concerns about the role they and their technology are believed to have played in perpetuating the appalling treatment we’ve heard about here and also because of those companies’ absolute refusal to engage with even the most cursory level of public accountability in response to those concerns."
        },
        {
            "text": "This is not about interfering in another country’s domestic affairs; this is about the legitimate expectations in ours."
        },
        {
            "text": "If the people we trust can’t trust these companies, we have no business giving them public money and no defence to the obvious risks we’re creating by doing so. For those public bodies that have entered into surveillance contracts with these companies I’m very interested to understand how they conducted their due diligence and on what evidence they believe they have created a partnership that can be trusted by the communities they serve."
        },
        {
            "text": "In his final report as HM Chief Inspector of Constabulary Fire and Rescue Services Sir Tom Winsor says “What is needed is a material intensification of a partnership with the private sector that is soundly and enduringly based on trust and common interest.” Nowhere is that truer than in the context of biometric surveillance”."
        }
    ]
}