{
    "url": "https://ruralpayments.blog.gov.uk/2022/06/08/updating-your-details-and-permissions-in-the-rural-payments-service/",
    "title": "Updating your details and permissions in the Rural Payments service",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2022-06-08T13:30:03+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Getting information out to farmers, land managers and agents is critical throughout the year. The Rural Payments Agency (RPA) uses the data held in the Rural Payments service to send out prompts, reminders, and other helpful material. So, it is vital that farming business keep their details up to date so we can make contacting them quicker and more effective."
        },
        {
            "text": "An example of this has been the recent announcement made to issue BPS advances. We contacted around 86,000 farmers and agents but a number of the emails we issued were never received as the email address held by us were incorrect. In some cases, businesses haven’t entered an email address which means we need to send them a paper copy, which always takes more time."
        },
        {
            "text": "Permissions are also really important as they allow a person to act on behalf of your business, if you decide that works best for you, giving you time to focus on the important work of farming. This can include submitting claims and applications on your behalf or amending your details to save you time."
        },
        {
            "text": "We know it’s a busy time for many with lots of factors impacting on how people are running their businesses, but we want to make sure we are able to give farmers our full support by making the process of submitting applications and claims and sending and receiving correspondence as easy as possible."
        },
        {
            "text": "To help support you when using the Rural Payments service, we have put together a guide to making sure you have the right permission levels set for the people in your business, and your personal and business details are up to date. Checking your details and getting everything in place now will save you time when you next need to contact us."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Signing into the Rural Payments service"
        },
        {
            "text": "It’s important to sign into the Rural Payments service regularly. RPA uses ‘pop up’ alerts to share important information with you, such as any upcoming downtime to help us improve the service as well as application and claim reminders."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Permissions"
        },
        {
            "text": "The Rural Payments service allows you to add people to your business. Once a person has been added to your business, you can allocate them ‘permissions’, which will allow them to take certain actions on behalf of you and your business. Using permissions can give you greater flexibility which you may find helpful at busy times"
        },
        {
            "text": "Each permission level affects what you, and people associated with your business within the Rural Payments service, can do. It’s important to check you have the right permissions set up in your account, because this can affect who can apply for payments, submit applications and make claims on behalf of you and your business."
        },
        {
            "text": "You can check and confirm permissions by going to the ‘Business overview’ section of the Rural Payments service and clicking on ‘Give access to this business’."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Business Permissions"
        },
        {
            "text": "Business Permissions allow a person to act on behalf of your business. You can adjust the level of Business Permissions you give, and the higher the permission allocated, the more actions they can take on your behalf."
        },
        {
            "text": "For example, providing a person with ‘Make Legal Changes’ permissions will allow them to change business contact details, confirm business details, and to change bank account details."
        },
        {
            "text": "A person with ‘Full’ Business Permissions can act on behalf of a business in its entirety, including adding people to, and removing people from, that business and allocating permissions."
        },
        {
            "text": "In the Rural Payments service, you can find full details about what each Business Permission will allow a person to do before you allocate them."
        },
        {
            "heading": 3,
            "text": "Scheme Permissions"
        },
        {
            "text": "Other permissions are split into the relevant schemes such as the Basic Payment Scheme or Countryside Stewardship, for example."
        },
        {
            "text": "Underneath each permission level in the Rural Payments service, there are details of what a person with that authority can do."
        },
        {
            "text": "It’s important to allocate the relevant level of permission to the people within your business to ensure each person has access to the relevant screens and information."
        },
        {
            "text": "There aren’t any specific Environmental Stewardship scheme permissions in the Rural Payments service. Instead, we use the ‘business level permissions’ to determine if someone has been permitted to talk to us on your behalf about Environmental Stewardship. If you want to allow somebody to talk to us on your behalf about this scheme, you need to link them to the business and set them to ‘Make Legal Changes’ or ‘Full’ business permissions."
        },
        {
            "text": "Alternatively, a person with full business permissions can send us a completed es21: Agent authorisation form to inform us who will be managing Environmental Stewardship agreements and claims for your business."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Checking Your Contact Details"
        },
        {
            "text": "It’s important to make sure that your personal and business contact details are up to date in the Rural Payment service so the RPA can reach you with any important information and updates."
        },
        {
            "text": "Check that all of the following are correct for you and your business:"
        },
        {
            "text": "You can check this information in the Rural Payments service by going to ‘Your business’ and clicking on ‘View and amend personal details’."
        },
        {
            "text": "Confirming that we have all the right information for you will help us contact you quickly when we need to send you important information"
        },
        {
            "heading": 2,
            "text": "Emailing RPA"
        },
        {
            "text": "If you need to send us an email, remember to put the relevant title in the subject header. This will help us make sure your email reaches the right department."
        },
        {
            "text": "Please reply to the original request from us when emailing documents."
        },
        {
            "text": "If you can’t respond to the original request, please make sure you include the name of the scheme and what the email is about in the subject line. You should also put your name and your Single Business Identifier (SBI) in the body of the email."
        },
        {
            "text": "You can follow us on social media for the latest updates and information on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}