{
    "url": "https://defradigital.blog.gov.uk/2022/06/08/why-im-supporting-pride-month-hannahs-story/",
    "title": "Why I’m supporting Pride month: Hannah’s story",
    "authors": [
        "Hannah Radley"
    ],
    "categories": [
        "Digital transformation"
    ],
    "pub_date": "2022-06-08T12:00:49+01:00",
    "content": [
        {
            "text": "In ‘Pride’ month, Enterprise Architect Hannah Radley shares her experience of coming out, of dealing with abuse, and explains why she continues to campaign for gay rights. "
        },
        {
            "text": "I have heard many people’s ‘coming out’ stories from the 80s, 90s and even the early 2000s and I am very lucky to say that mine was not as difficult as many others. I’m privileged to not have experienced much overt homophobia, and I came out at a time when it was widely accepted. That is not to say, however, that it wasn’t personally confusing and difficult."
        },
        {
            "text": "I had always been a tomboy, growing up as the only girl with two older brothers, and was very much ‘one of the lads’ when with friends. I tried to be more stereotypically girly in my teens with long hair and dresses, but it never felt quite right."
        },
        {
            "text": "Between the ages of 14 and 16, I found new friends who I thought were wonderful, but they slowly became increasingly emotionally, physically, and sexually abusive. At the time, I didn’t think anything was wrong, I didn’t notice the warning signs."
        },
        {
            "heading": 2,
            "text": "Rebuilding my confidence took time"
        },
        {
            "text": "As a result, I lost all my confidence, and my mental health became increasingly poor. I’m not sure how, but I slowly moved away from these people, and I found solace in a new male friend, who later became my boyfriend. He was nice, kind, gentle and understanding, which were traits I hadn’t really been very exposed to before."
        },
        {
            "text": "I wanted to go to university and obtained a place at the University of Nottingham to study Psychology. I was quite dependent on my boyfriend, and I felt too anxious to go into halls."
        },
        {
            "text": "So, we decided to move to Nottingham together from Cambridgeshire and get a house. My mental health was still poor, and I struggled to socialise and integrate with others, so I didn’t have the typical ‘Freshers’ experience that most do when joining University."
        },
        {
            "heading": 2,
            "text": "Noticing the signs gradually helped me to find my identity"
        },
        {
            "text": "Over the three years of my undergraduate degree, I joined the Disability Network (I also suffer from hearing loss and wear hearing aids), and I found friends. I began to find myself and develop my own identity."
        },
        {
            "text": "When ‘Orange is the New Black’ came out on Netflix, I watched it with my friends and found myself sharing a lot of the same sentiments as one of my openly gay female friends. I couldn’t work out if I wanted to look like, or was attracted to, some of the characters."
        },
        {
            "text": "I shared these feelings with my friend who introduced me to ‘The L Word’ – another LGBTQ+ drama series. This did nothing but emphasise my confused feelings."
        },
        {
            "text": "I knew that I had enjoyed kissing girls when I was a teenager, but it was just something we did when drunk and those friends weren’t now gay. I loved my boyfriend but couldn’t reconcile that with the feelings I was having about women."
        },
        {
            "heading": 2,
            "text": "Confusion and a changing personality actually increased my confidence"
        },
        {
            "text": "I couldn’t explore the possibility I could be attracted to women without cheating on my boyfriend, which I wasn’t willing to do. Alongside this confusion, I was growing up and my personality was changing. I was becoming more confident, more outgoing, more extroverted. My boyfriend was none of these things and just wanted to stay in and play video games; so, after much discussion and deliberation, we broke up."
        },
        {
            "text": "I moved into private student halls and went on holiday to Ireland with my gay friend. We went to a gay bar, and I could finally explore my sexuality and it was there that I determined I was definitely at least bisexual."
        },
        {
            "text": "I started a Masters Degree at the University of Nottingham and joined the LGBTQ+ Society. I finally had the Freshers year I missed out on during my undergraduate. I cut my hair short and started wearing clothes I felt comfortable in – shirts and jeans being a staple!"
        },
        {
            "text": "The more I spent time with people and went to clubs, the more I realised I had no interest in men and was most definitely a lesbian. This realisation was pivotal for me, it felt right and felt like I’d found the missing part of me."
        },
        {
            "text": "I joined online dating sites and eventually met my current girlfriend – we have now been together for nearly six years, and I couldn’t be happier."
        },
        {
            "heading": 2,
            "text": "Taking the positives from being discriminated against"
        },
        {
            "text": "However, I have been called a ‘dyke’; I’ve had many lewd comments from men, which aren’t appropriate to include here. I’ve had people ask the ‘reason I turned gay’. I’ve also had people presume my partner and I are related, rather than a couple."
        },
        {
            "text": "I’m lucky that I have the life I have, being able to have the rights I have in work, and in my personal life. I have never experienced any homophobia here in Defra – I am not afraid or anxious to openly mention my girlfriend or discuss our life together. That is a beautiful thing."
        },
        {
            "text": "I don’t have to hide who I am, and I'm not at any disadvantage because of my sexuality. I'm very lucky that this is the case for my generation, as others won’t have been in such a good place. There are networks to join that are specifically for LGBTQ+, demonstrating Defra’s commitment to inclusion and diversity."
        },
        {
            "text": "All of this only happened because people stood up for those rights through Pride. We still must campaign for these rights."
        },
        {
            "heading": 2,
            "text": "We’ve come a long way but there’s plenty still to do"
        },
        {
            "text": "There are still many acts of homophobia and discrimination happening today when they shouldn’t. If I want to carry children of my own, I have to pay for the privilege. If gay women want fertility treatment to have children, they need to prove their infertility though six self-funded rounds of artificial insemination through an NHS-approved clinic which costs around £1500 per round."
        },
        {
            "text": "This is why I support Pride. We have come so very far in terms of LGBTQ+ rights. But we have a long way to go. I’d really love to hear about your experiences of being gay, or of coming out so do please leave me a comment here."
        }
    ]
}