{
    "url": "https://mhclgdigital.blog.gov.uk/2022/06/08/women-working-in-digital-data-and-technology-part-2-leadership/",
    "title": "Women working in digital, data and technology, part 2: leadership",
    "authors": [
        "Sarah Clive",
        "Alice Whitehead",
        "Annie Crabtree"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2022-06-08T15:43:24+01:00",
    "content": [
        {
            "text": "There’s no set path to working in digital, data and technology (DDAT). Women working in these professions here at the Department for Levelling Up, Housing and Communities (DLUHC) have come from many different backgrounds. Here are some of their stories."
        },
        {
            "heading": 2,
            "text": "Trusting people to make good decisions"
        },
        {
            "text": "I spent six years in publishing before I decided to apply for the Civil Service Fast Stream. I was unsuccessful but the Home Office hired me into their Digital team in 2013. It was a very exciting time to join. The Government Digital Service (GDS) was only a few years old. Having delivered GOV.UK, they encouraged departments like the Home Office to build transactional digital services that met user needs. This was called the Exemplar programme."
        },
        {
            "text": "I felt like I knew nothing about any of this. However, my time in publishing had taught me to multitask, self teach, ask questions and motivate a group of people to meet a deadline."
        },
        {
            "text": "After a few months, I started working as an agile delivery manager on the Registered Traveller ‘Exemplar’ service. Government digital was expanding over this period (and still is!) I was good at getting things done. I was quickly promoted both in the Home Office and then in other departments."
        },
        {
            "text": "In my role at DLUHC, I lead many teams who build and run digital services, or apply agile and user centred methods to policy and processes"
        },
        {
            "text": "I’ve been in this role more than three years because I love both what I do and the people I work with. We have a strong culture of empowerment and product thinking. Our lack of legacy technology means we can take advantage of existing Government as a Platform products to get services into live quickly, and learn from other more mature departments. These things make my job much easier. We can reuse what’s worked before and can (and do!) trust the people we’ve hired to make good decisions."
        },
        {
            "heading": 2,
            "text": "How design and digital are changing policy making"
        },
        {
            "text": "I started out on the policy Fast Stream in 2015, and I did a couple of typical postings. I thought working on international policy would match my interests as I had studied history and French. I did have some doubts about joining a big bureaucratic organisation, though."
        },
        {
            "text": "My GDS posting opened my eyes to a new way of doing things. Researching what people actually needed and building internationally acclaimed digital services. Challenging bureaucracy and process was an added bonus."
        },
        {
            "text": "I considered being a user researcher, as I enjoyed sharing research outputs in a way that changed people's minds about what to do. I volunteered as a user researcher on a project as part of my corporate objective. The civil service is great for letting you build your skills that way. Later, within my policy team I acted as a service owner for a website and convened another multidisciplinary team to do a small piece of content work. That's how I became more interested in the product and strategy side of DDAT."
        },
        {
            "text": "I took my knowledge of how design and digital can change policy making into my first proper digital role at the Ministry for Housing, Communities and Local Government (MHCLG), now DLUHC, in 2019. In September 2021 I moved into the role of service owner for our Apply for funding service to develop my skills running digital projects. I use my experience of working in a policy team every day, to understand and empathise with my colleagues."
        },
        {
            "text": "What do I love about my job? Even though I don’t research, design or code myself, I get a massive buzz when the team shows me user research, new designs, neat architecture or simplified processes!"
        },
        {
            "heading": 2,
            "text": "The shared goal to make things better"
        },
        {
            "text": "I did a law degree which had a ‘new technology and the law’ element. I did a placement at IBM replacing the Sea King helicopter, which got me into technology. I finished my degree, got into law school and realised I didn’t want to do law any more. I wanted to do information technology (IT), so I went and worked for Fujitsu."
        },
        {
            "text": "I moved to a technology company called RM Education. We sold and managed technology services for local authorities. From there, I worked in a few different sectors including retail and utilities before moving to DLUHC."
        },
        {
            "text": "When I was working on digital transformation at United Utilities, I read a lot of great GOV.UK blogs. I was impressed at how committed the government was to driving the digital agenda. The degree and scale of the commitment was exciting."
        },
        {
            "text": "I came into this job with a deep love of digital and technology. I love the people I work with – the intelligence, the passion, the shared goal to make things better, coupled with a lack of ego is a joy.  I love the fact that what we do has a positive impact, whether it’s the hardware, software, or services we build and run. We make a difference."
        }
    ]
}