{
    "url": "https://naturalengland.blog.gov.uk/2022/06/08/world-ocean-day-natural-englands-action-for-the-ocean/",
    "title": "World Ocean Day - Natural England's Action for the Ocean",
    "authors": [
        "Michelle Stiles"
    ],
    "categories": [
        "Biodiversity",
        "Marine environment",
        "Natural England"
    ],
    "pub_date": "2022-06-08T08:00:04+01:00",
    "content": [
        {
            "text": "World Ocean Day is a global awareness event celebrated on the 8th June to highlight the vital role the Ocean has in our everyday life and to provide information about the different ways we can protect the Ocean. This year’s theme is Revitalization: Collective Action for the Ocean."
        },
        {
            "text": "The Ocean is an integral part of our history, economy, and way of life. All life is dependent on the ocean and , by harming the ocean, we harm ourselves. Humans, the ocean, biodiversity, and climate are inextricably linked. The Ocean absorbs over a quarter of the carbon dioxide we produce and plays a vital role in the water cycle and climate system. Covering more than 70% of the Earth’s surface the ocean has absorbed 90% of the heat that has occurred in recent decades due to increasing greenhouse gases, with the top few metres of ocean storing as much heat as the Earth’s entire atmosphere."
        },
        {
            "text": "The Ocean is critical for biodiversity, geodiversity with endless ecosystem services. Our Ocean supports our economy with crucial jobs, seafood, and raw materials with the UK home to the widest range of sea life of any European coastal nation. Our Ocean provides a wide range of services that contribute to the wellbeing of people and our planet. Despite this our Ocean, and the life it supports, is increasingly at risk. Although there are still areas of great richness and beauty, the overwhelming weight of evidence shows that our Ocean and Seas have been in decline for decades. Ocean and climate action must be undertaken together; and reversing ocean change needs action now."
        },
        {
            "text": "We wanted to highlight some of the key elements of Natural England’s marine work and how as an organisation we are taking collective action to protect the ocean and ourselves."
        },
        {
            "text": " "
        },
        {
            "text": "Thriving, resilient coasts and seas for people and planet"
        },
        {
            "text": "Natural England has a substantial statutory and regulatory role in the marine environment. This is due to the coherent network of marine protected areas (MPAs) that now cover 40% of our seas in England.  We are supporting the UK Government objective which is “Clean, safe, productive, biologically diverse ocean and seas” by building partnerships and reducing pressures that drive marine nature recovery at scale, from source to sea."
        },
        {
            "text": "Listed below are some of the recent areas of work contributing to achieving our objectives:"
        },
        {
            "text": " "
        },
        {
            "text": "Collective action for the Ocean"
        },
        {
            "text": "Why not use this day to take action for our Ocean, you can follow our social channels for updates on some of Natural England’s Marine work, plan a beach clean or take a trip to the coast. One of the best methods to drive change is for people to feel connected to our amazing seas, ultimately, this is the best tool to protect our Ocean."
        },
        {
            "text": "Marine work cuts across all-Natural England’s work where we are led by the latest Science and Evidence. We are building partnerships and reducing pressures to drive marine nature recovery at scale. Recovering all nature across all of England – From mountain top to seabed; From Scafell Pike to Dogger Bank; From source to sea."
        },
        {
            "text": "For further information on any events and activities happening near you look at the World Ocean Day site."
        }
    ]
}