{
    "url": "https://food.blog.gov.uk/2024/03/13/chief-executives-stakeholder-message-addressing-the-vet-workforce-challenges/",
    "title": "Chief executive's stakeholder message - Addressing the vet workforce challenges",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2024-03-13T15:12:23+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "This week I gave evidence to the Environment Food and Rural Affairs Committee (EFRA) about the implications of vet shortages in the UK. "
        },
        {
            "text": "This includes Official Veterinarians (OVs) who carry out vital checks in FSA-approved abattoirs. Our OVs and Meat Hygiene Inspectors work together to protect the public and ensure compliance with animal welfare regulations across the meat industry."
        },
        {
            "text": "Between 2019 and 2021, the Royal College of Veterinary Surgeons’ (RCVS) figures showed that the number of vets entering the profession fell by a quarter (27%) while demands on the profession have only increased. This shortfall has been felt particularly acutely by vets working in the meat sector, where the vast majority of posts are currently held by overseas professionals."
        },
        {
            "text": "At the FSA, we have concerns about the risk of vet shortages which are shared by our colleagues at Food Standards Scotland (FSS). We made these known in our last annual report on food standards, published last November. It is critical that we have a steady pipeline of vets to work in these critical public health roles."
        },
        {
            "text": "We’ve taken steps to address this, like raising pay for vets last year within our spending constraints, redesigning job roles to provide greater variety, and targeting recruitment of overseas vets to work on a “Meat Hygiene Inspector (Vet Track)” scheme. These measures are showing early results, but they are not enough on their own. There are also structural issues that need attention that are not in the FSA’s gift. We need legislative change, financial backing, a supportive immigration policy, and a joined-up approach with partners across the profession, in industry and in government, to deliver rewarding veterinary careers."
        },
        {
            "text": "If you would like to know more about the FSA’s views on these matters, please do read the written evidence we submitted to the EFRA select committee ahead of the hearing. You can also watch me giving evidence alongside Dr Christine Middlemiss, Chief Veterinary Officer at Government Veterinary Services; Professor Stuart Reid, Principal at Royal Veterinary College; and Malcolm Morley, Senior Vice President at British Veterinary Association, who were witnesses."
        },
        {
            "text": "Our skilled Official Veterinarian workforce is essential to ensure that food is safe, animal health and welfare standards are maintained, and businesses can continue to export their products. If the FSA is unable maintain its service delivery, the consequences will be felt by both consumers and businesses."
        },
        {
            "text": "If you have any questions or comments raised in this blog please let us know your thoughts in the comments section below."
        },
        {
            "heading": 1,
            "text": "Mynd i’r afael â heriau o ran y gweithlu milfeddygol"
        },
        {
            "text": "Yr wythnos hon, gwnes i gyflwyno tystiolaeth i Bwyllgor yr Amgylchedd, Bwyd a Materion Gwledig (EFRA) ar oblygiadau prinder milfeddygon yn y DU. "
        },
        {
            "text": "Mae hyn yn cynnwys milfeddygon swyddogol sy’n cynnal gwiriadau hanfodol mewn lladd-dai a gymeradwyir gan yr ASB. Mae ein milfeddygon swyddogol a’n harolygwyr hylendid cig yn cydweithio i ddiogelu’r cyhoedd a sicrhau cydymffurfiaeth â rheoliadau lles anifeiliaid ar draws y diwydiant cig."
        },
        {
            "text": "Rhwng 2019 a 2021, dangosodd ffigurau gan Goleg Brenhinol y Milfeddygon (RCVS) fod nifer y milfeddygon sy’n ymuno â’r proffesiwn wedi gostwng 27%, tra bo’r pwysau ar y proffesiwn wedi cynyddu. Mae’r diffyg hwn wedi effeithio’n arbennig ar filfeddygon sy’n gweithio yn y sector cig, lle mae mwyafrif helaeth y swyddi milfeddygol yn cael eu gwneud gan gweithwyr proffesiynol o dramor ar hyn o bryd."
        },
        {
            "text": "Mae gan yr ASB, a’n cydweithwyr yn Safonau Bwyd yr Alban (FSS), bryderon am y risg a berir gan brinder milfeddygon. Gwnaethom dynnu sylw at hyn yn ein hadroddiad blynyddol ar safonau bwyd, a gyhoeddwyd fis Tachwedd diwethaf. Mae’n hanfodol bod gennym gyflenwad cyson o filfeddygon i weithio yn y rolau iechyd cyhoeddus hollbwysig hyn."
        },
        {
            "text": "Rydym wedi cymryd camau i fynd i’r afael â hyn, fel codi cyflogau ar gyfer milfeddygon y llynedd o fewn ein cyfyngiadau gwariant, ailgynllunio swyddi i ddarparu mwy o amrywiaeth, a recriwtio milfeddygon o dramor i weithio ar gynllun Arolygydd Hylendid Cig (Llwybr Milfeddyg). Mae canlyniadau cynnar y mesurau hyn yn addawol, ond dydyn nhw ddim yn ddigon ar eu pen eu hunain."
        },
        {
            "text": "Mae angen rhoi sylw i faterion strwythurol hefyd nad ydynt o fewn pwerau’r ASB. Mae angen newid deddfwriaethol, cefnogaeth ariannol, polisi mewnfudo cefnogol, a dull gweithredu cydgysylltiedig gyda phartneriaid ar draws y proffesiwn, yn y diwydiant a’r llywodraeth, i gynnig gyrfaoedd milfeddygol gwerth chweil."
        },
        {
            "text": "Os hoffech wybod mwy am safbwyntiau’r ASB ar y materion hyn, darllenwch ein tystiolaeth ysgrifenedig a gyflwynwyd i bwyllgor dethol EFRA cyn y gwrandawiad. Gallwch hefyd wylio fideo ohonof yn cyflwyno tystiolaeth ar y cyd â thystion eraill, Dr Christine Middlemiss, Prif Swyddog Milfeddygol Gwasanaethau Milfeddygol y Llywodraeth; yr Athro Stuart Reid, Pennaeth Coleg Brenhinol y Milfeddygon; a Malcolm Morley, Uwch Is-lywydd Cymdeithas Filfeddygol Prydain."
        },
        {
            "text": "Mae ein gweithlu o filfeddygon swyddogol medrus yn hanfodol i sicrhau bod bwyd yn ddiogel, bod safonau iechyd a lles anifeiliaid yn cael eu cynnal, a bod busnesau yn gallu parhau i allforio eu cynhyrchion. Os na all yr ASB gynnal ei gwasanaethau, bydd y canlyniadau’n effeithio ar ddefnyddwyr a busnesau."
        },
        {
            "text": "Os oes gennych unrhyw gwestiynau neu sylwadau am y materion a drafodir yn y blog hwn, rhowch wybod yn yr adran sylwadau isod."
        }
    ]
}