{
    "url": "https://ruralpayments.blog.gov.uk/2024/03/13/come-and-talk-to-rpa-about-fetf-and-ftf-grants-at-shows-during-2024/",
    "title": "Come and talk to RPA about FETF and FTF grants at shows during 2024",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement",
        "Grants"
    ],
    "pub_date": "2024-03-13T16:55:55+00:00",
    "content": [
        {
            "text": "RPA’s Grants Service team will be attending shows across the country this year and are encouraging farmers and businesses to meet them on the stand to get advice on the Farming Equipment and Technology Fund (FETF) and Farming Technology Fund (FTF) grants available."
        },
        {
            "text": "The team will be able to give advice on the applications process and the application window dates. Further advice will be available on the appraisal and claims processes."
        },
        {
            "text": "Sue Strachan from the Grants Service team said: “We’ll be on the RPA stand at many of the larger shows this year to answer face-to-face queries relating to what grants are available, how the grants work and the time frames. We want as many people as possible to come and talk to us to get advice or ask questions, which hopefully we’ll be able to answer on the day, but if we can’t, we’ll take your details and get back to you with the correct information after the event."
        },
        {
            "text": "“We’ll be sharing a stand at some of the shows with RPA’s shows and events team as well as the Farming and Countryside Team, offering a one stop shop for Defra.”"
        },
        {
            "text": "Paul Shek from the Grants Service team recently attended Farm Expo representing RPA on the stand. He added: “It was great to have that face-to-face contact with farmers which adds another layer of body language that’s missing in phone calls. There was a wide range of farmers attending, from small holdings to large farming businesses. Mostly farmers and external stakeholders came with questions on funding and also queries about their current applications in RPA payment schemes. We also had leaflets and cards to hand out which were of great use to signpost farmers to various gov.uk sites.”"
        },
        {
            "heading": 2,
            "text": "RPA’s Grants Service team will be attending the following shows"
        },
        {
            "text": " "
        }
    ]
}