{
    "url": "https://openpolicy.blog.gov.uk/2024/03/13/launching-the-lived-experience-in-policymaking-guide-reflections-on-the-principles-behaviours-and-mindsets-that-underpin-lived-experience-work/",
    "title": "Launching the Lived Experience in Policymaking Guide: Reflections on the principles, behaviours, and mindsets that underpin lived experience work",
    "authors": [
        "vanessalefton",
        "alexfleming"
    ],
    "categories": [
        "Policy Lab",
        "Thought Pieces"
    ],
    "pub_date": "2024-03-13T13:30:28+01:00",
    "content": [
        {
            "text": "Lived experience refers to knowledge acquired through direct, first-hand and personal experience. In policymaking this usually involves people who experience a particular policy or issue in their daily lives.   "
        },
        {
            "text": "Today, we are launching a short 'Lived Experience in Policymaking Guide’. The guide is not another toolkit. Instead, it aims to make explicit some of the underlying principles policymakers might consider in order to carry out effective and empathetic lived experience work. What does it take for policymakers to do good lived experience work? Why is it so important? What are some of the behaviours and mindsets that underpin it?  "
        },
        {
            "text": "This is our fourth blog based on our project for the pioneering Changing Futures programme in the Department for Levelling Up, Housing and Communities (DLUHC). Lived experience involvement is a core principle of the wider Changing Futures initiative and is integrated into Changing Futures service delivery. Our project for this programme focussed on addressing the following challenge question: How can we ensure that central government enables flexible and person-centred frontline delivery models on an ongoing basis for people facing multiple disadvantage?   "
        },
        {
            "text": "The Changing Futures programme defines people facing multiple disadvantage as those experiencing combinations of homelessness, substance misuse, mental health issues, domestic abuse and contact with the criminal justice system. They are likely to interact with multiple services and professionals at the same time. Changing Futures partnered with Policy Lab to co-design interventions for improving multiple disadvantage services. You can read more about the wider Policy Lab project in the first blog of this series. "
        },
        {
            "text": "Our new 'Lived Experience in Policymaking Guide’ is based on Policy Lab’s work for the Changing Futures programme and our wider work. You can download the guide as a PDF here."
        },
        {
            "heading": 2,
            "text": "What is lived experience and why is it important in policymaking? "
        },
        {
            "text": "In Policy Lab, we generate lived experience insights through a wide range of methods including film ethnography, co-design, and serious games. Over the past 10 years, we have seen that lived experience can improve policy development in numerous ways, including by:   "
        },
        {
            "heading": 2,
            "text": "Creating the guide: Reflections from lived experience work "
        },
        {
            "text": "Reflections in our lived experience guide come from Policy Lab’s 10-year history undertaking lived experience work in partnership with policy teams across government. We also take specific lessons from the Changing Futures project, particularly our work with the National Expert Citizen Group (NECG), a group of people with lived experience of multiple disadvantage from across England. You can also read more about the NECG here.  "
        },
        {
            "text": "This lived experience group played a vital role in our work on behalf of the Changing Futures programme, adding their personal insights to our policy development work. Their involvement was facilitated by charity Revolving Doors, who have over 30 years' experience improving systems for people experiencing crisis. "
        },
        {
            "text": "You can listen to audio clips in this blog and in the guide, to hear from members of Revolving Doors and our lived experience group directly. "
        },
        {
            "text": "Listen to Sean, Involvement Manager at Revolving Doors charity, talk about the value of lived experience (Opening the link in a new tab works best)"
        },
        {
            "text": "While lived experience is a core component of Policy Lab’s projects, our work for the Changing Futures Programme provided the opportunity to work very deeply with people with lived experience. During our Changing Futures work, Policy Lab worked with around 10 people with lived experience from the NECG. They joined co-design workshops and met regularly with Policy Lab to shape the ethnography and systems change work we did. This process meant our understanding of the current system, and our ideas for change, were rooted in real life experiences and needs. Over 9 months, we invited the group ‘behind the scenes’ to help us shape our sessions and project thinking, rather than only interacting through workshops.  "
        },
        {
            "text": "The involvement of the lived experience group was reported as one of the greatest strengths of the work we carried out for Changing Futures. In project evaluations, many policymakers cited the importance of including people with lived experience in the room, and how this shifted their understanding of the problems and possible solutions. One Changing Futures policymaker reflects, \"I particularly appreciated the sense of contributions in the room... It feels like this should be the business-as-usual policy development process.\" As individuals, we felt a deeper empathy, connection and a powerful motivation, for the challenges that we worked on together. The approach, including being involved in decision-making, was also valued by those with lived experience."
        },
        {
            "text": "- Participant with lived experience  "
        },
        {
            "text": "- Participant with lived experience  "
        },
        {
            "text": "Listen to Robin, an NECG member, describe shared decision-making (Opening the link in a new tab works best)"
        },
        {
            "heading": 2,
            "text": "Conclusion: It’s not just what we do, but how we do it "
        },
        {
            "text": "Including people with lived experience is important to make policy that serves people’s needs. Despite this, policymakers face certain barriers to carrying out lived experience work in government. "
        },
        {
            "text": "Our ‘Lived Experience in Policymaking Guide’ aims to make explicit some of the invisible principles and behaviours that characterised our work with people with lived experience in the Changing Futures programme. We’ve combined reflections from this specific initiative alongside Policy Lab’s wider experience running lived experience work with policymakers across government. The guide acknowledges that it is not just what we do, but how we do it, that shapes the quality of our lived experience work and the potential benefits for everyone taking part.  "
        },
        {
            "text": "We hope that the reflections we share in the guide will continue helping us as a policymaking community to work with people outside of government. We know that there are also many other civil servants and policy teams carrying out this work, and we’d love to hear any stories of how you’ve found doing this work as part of your policymaking processes.  "
        },
        {
            "text": "To get in touch, or commission our work please contact: team@policylab.gov.uk "
        }
    ]
}