{
    "url": "https://nationalscreening.blog.gov.uk/2024/03/13/sma-ise-clinical-pathway-expert-sub-group-meets-for-first-time/",
    "title": "SMA ISE clinical pathway expert sub-group meets for first time",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-03-13T14:06:33+00:00",
    "content": [
        {
            "text": "Regular readers of this blog will know that the UK National Screening Committee (UK NSC) is reviewing the case for newborn screening for spinal muscular atrophy (SMA)."
        },
        {
            "text": "This work has 2 main strands:"
        },
        {
            "text": "The SMA ISE is being overseen by a partnership board. Three expert sub-groups report to that board: a clinical pathway group, a data and methodology group and a laboratory group."
        },
        {
            "text": "The clinical pathway group includes a broad range of clinical expertise covering genetics, paediatrics, public health, paediatric neurology, midwifery, academia, patient and parent interest groups, Genomics England, NHS England, devolved governments, genetic laboratories and newborn blood spot and metabolic screening."
        },
        {
            "text": "Paediatrician David Elliman, a clinical advisor to the UK NSC, chaired the first meeting of this group."
        },
        {
            "text": "Members were reminded of the UK NSC’s guidance on declaring any actual, potential or perceived conflicts of interest and the need for full disclosure to ensure transparency and enable appropriate mitigation measures to be agreed. The UK NSC secretariat will store but not publish the declarations."
        },
        {
            "text": "The group’s terms of reference, which focus on the clinical pathway for newborn screening for SMA, were agreed. Although the group will not specifically address the laboratory pathway, its work will align closely with that of the laboratory group and some members will sit on both groups."
        },
        {
            "text": "Dr Elliman presented a draft clinical pathway flowchart for SMA newborn screening which was the focus for this meeting. The UK SMA Newborn Screening Alliance kindly offered to share its existing screening and treatment clinical pathway documents to support further discussions and resource development."
        },
        {
            "text": "The meeting then received an insight into the national SMA newborn screening programmes of Sweden and the Netherlands with each country outlining a different screening pathway for the reporting of SMN1 deletion and SMN2 copy numbers, and the subsequent referral pathways. The different pathways reflect the available treatment options for asymptomatic individuals in Sweden and the Netherlands."
        },
        {
            "text": "Professor Jim Bonham, who chairs the SMA ISE expert laboratory sub-group, will collaborate with international colleagues to look in more detail at different laboratory pathways and techniques and to share practice."
        },
        {
            "text": "As part of the ISE, the clinical pathway expert sub-group will also be responsible for developing, or overseeing the development, of public-facing information, education and training resources."
        },
        {
            "text": "Members discussed the importance of developing this public-facing information and involving parents in this process. The group underlined the need to raise awareness with professionals and the public to support the whole screening and diagnostic pathway."
        },
        {
            "text": "Members also discussed the importance of listening to, and actively involving, parents and people with SMA when making decisions related to giving results and the referral pathway. The group will explore this further at future meetings."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}