{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/13/stem-outreach-intellectual-property-office/",
    "title": "STEM outreach: Intellectual Property Office",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Collaborating & Networking",
        "Outreach"
    ],
    "pub_date": "2024-03-13T12:36:34+00:00",
    "content": [
        {
            "text": "It’s British Science Week so we wanted to tell you about some of the great science outreach work we are doing at the Intellectual Property Office (IPO) and share details for our exciting new video going live this week. The IPO not only serves as the official UK government body overseeing intellectual property rights, encompassing patents, designs, trademarks, and copyright, but also actively engages with schools and universities to showcase this work.  "
        },
        {
            "text": "Aligned with the GSE Strategy, IPO initiated a STEM outreach program to help with this aim. This initiative mobilised a passionate team of volunteers, primarily consisting of patent examiners who hold degrees focused on STEM disciplines. This outreach team focused on encouraging an interest in STEM disciplines in young people.  To do this work, the Outreach team provided a varied range of activities aimed at young people which included: "
        },
        {
            "text": "Being situated in Newport, South Wales, the IPO takes pride in having Welsh-speaking volunteers who collaborate with a local high school. In their latest session, they devised a new feature for the standard Bunsen burner, connecting it with the flame test component of the school's science curriculum. "
        },
        {
            "text": "While our in-person outreach efforts prove immensely rewarding for both our staff and the students, we also produce an 'Inside STEM' video series and educational resources tailored for 11–14-year-olds. These animated videos and supporting resources delve into pivotal STEM topics that will shape the future, intertwining them with the realm of inventions and patents. The most recent instalment spotlights the remarkable material graphene, showcasing its extraordinary strength, flexibility, and lightweight properties that have propelled it into numerous recent innovations. Titled 'Inside STEM - Graphene,' it’s the third video of the series and is set to launch during British Science Week 2024 (8-17 March) You can watch the Inside STEM video series online via our IPO Education YouTube channel.  "
        },
        {
            "text": "Coming up: The IPO are thrilled to announce that work has commenced on the upcoming episodes for the 'Inside STEM' series, which will encompass five videos covering the Government's five key technologies. "
        },
        {
            "text": "Follow the IPO channels to keep up to date with their latest activities: "
        },
        {
            "text": "IPO Education X"
        },
        {
            "text": "IPO Education Facebook"
        },
        {
            "text": "IPO Education LinkedIn"
        },
        {
            "text": "IPO Education YouTube"
        },
        {
            "text": "Cracking Ideas Website"
        }
    ]
}