{
    "url": "https://ukhsa.blog.gov.uk/2024/03/13/stis-through-the-centuries/",
    "title": "STIs through the centuries",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Sexual health",
        "Uncategorized"
    ],
    "pub_date": "2024-03-13T18:45:05+01:00",
    "content": [
        {
            "text": "In England, data produced by the UKHSA shows that year after year new diagnoses of sexually transmitted infections STIs remain high and, between 2021 and 2022, diagnoses of gonorrhoea and infectious syphilis increased by 50% and 15% respectively."
        },
        {
            "text": "In this blog post we will explore the rising tide of STIs across the eons, how ancient Greeks feared the killer “scorpions and serpents” in semen, and how goat's milk was thought to be a curative for sexual ailments."
        },
        {
            "heading": 2,
            "text": "The ancient world"
        },
        {
            "text": "The Greek and Roman Period (5th century BCE - 4th century CE):"
        },
        {
            "text": "Over 2,400 years ago the ancient Greeks and Romans were documenting their complex sexual networks and their sexual health."
        },
        {
            "text": "Love and relationships in the time of The Minotaur and Medusa were not without their dangers. It is recorded that Pasiphae, the wife of King Minos of Crete, used a goat’s bladder as a condom as the King’s semen was said to contain “scorpions and serpents” that killed his mistresses."
        },
        {
            "text": "And thanks to the ancient Greek physician Hippocrates, referred to as the Father of Medicine, we have some insights into the prevalence of diseases resembling STIs through his descriptions of clinical cases."
        },
        {
            "text": "Writings from the Hippocratic corpus describe what might be acute gonorrhoea as “strangury”, which is thought to be caused by indulgences in the pleasures of Venus."
        },
        {
            "text": "The name gonorrhoea is as ancient as its descriptions, being coined by another Greek doctor before 200 CE, Galen refers to gonorrhoea as “an unwanted discharge of semen”."
        },
        {
            "heading": 2,
            "text": "Medieval Era"
        },
        {
            "text": "The Islamic Golden Age (8th - 14th centuries): "
        },
        {
            "text": "The Persian Rhazes (865-925 CE), a doctor and director of hospitals of what would become Baghdad, describes genital ulcers and what is thought to be gonorrhoea in his text ‘Continens’ with the treatment at the time being the slow introduction of goat's or breast milk to the infection."
        },
        {
            "text": "These early writings included the transmission of diseases through sexual contact, laying the foundation for future understanding from other Persian doctors such as Aly Abbas who would diagnose and record infections from urethral discharge, burning sensations while urinating and thick discoloured discharge."
        },
        {
            "text": "European Middle Ages (4th – 14th centuries): STIs in the Middle Ages were often linked to moral judgements. The term \"venereal diseases\" emerged in the Middle English period between 1150 and 1500, named after Venus, the goddess of love, the term venereal disease nods back to Hippocrates and, while misogynistic in origin, emphasises the connection of infections to sexual activity."
        },
        {
            "heading": 2,
            "text": "Renaissance and Early Modern Period"
        },
        {
            "text": "The Renaissance (14th - 17th centuries): The Renaissance promoted the rediscovery of classical philosophy, literature and art but is also believed to have coincided with either the introduction or discovery of syphilis in Europe."
        },
        {
            "text": "The origin of syphilis in Europe is highly debated by academics,  some argue that evidence from combined paleopathology and molecular analyses suggests the increased movement of people across the continent, and between this and other continents encouraged the spread."
        },
        {
            "heading": 2,
            "text": "19th Century"
        },
        {
            "text": "The Germ Theory: Advances in microscopy allowed for the identification of specific pathogens and in the 19th century was a turning point in which microorganisms such as bacteria, viruses, fungi and parasites were accepted as the cause of disease, illness and infection."
        },
        {
            "text": "Germ theory saw the beginning of an era with a more scientific approach to understanding and treating infections, including STIs."
        },
        {
            "text": "Germ theory allowed for a better understanding of transmission routes from person to person and the development of treatments and the discovery of antibiotics, such as penicillin in the mid-20th century, revolutionised the treatment of STIs, including syphilis and gonorrhoea."
        },
        {
            "heading": 2,
            "text": "Resurgence"
        },
        {
            "text": "In 2022, gonorrhoea diagnoses were the highest they have been since records began in 1918, and syphilis diagnoses were the highest they have been since 1948."
        },
        {
            "text": "The increase in diagnoses will in part be due to the success of an increase in testing and detection of more infections, but the scale of the increase in diagnoses in recent years strongly suggests that there is more transmission of STIs within the population driven by various factors such as decreasing condom use."
        },
        {
            "text": "UKHSA, and other public health bodies charged with monitoring and charting rises and falls in STIs have been doing so in the UK since 1918."
        },
        {
            "text": "Syphilis"
        },
        {
            "text": "Gonorrhoea"
        },
        {
            "heading": 2,
            "text": "The future of sexual health"
        },
        {
            "text": "Sexually transmitted infections have been around for eons, but that doesn’t mean they’re here to stay. Discoveries and innovations such as Pre-Exposure Prophylaxis (PrEP) have been used to dramatically reduce the risk of getting HIV (human immunodeficiency virus), and effective HIV treatment now means that those who adhere to their medication cannot pass on the virus, known as Undetectable = Untransmittible (U=U)."
        },
        {
            "text": "In the UK, the British Association for Sexual Health and HIV is working with UKHSA on new guidance to inform the prescribing of doxycycline post exposure prophylaxis (Doxy-PEP) for the prevention of bacterial STIs such as syphilis."
        },
        {
            "text": "And in the UK, the Joint Committee on Vaccination and Immunisation have recently advised the government on the targeted use of the 4CMenB vaccine for the prevention of gonorrhoea."
        }
    ]
}