{
    "url": "https://stratcommand.blog.gov.uk/2024/03/13/the-fascinating-realm-of-defence-science-and-technology/",
    "title": "The fascinating realm of Defence Science and Technology",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-13T08:00:44+00:00",
    "content": [
        {
            "text": "Louise Davies shares how her role helps enhance capabilities across Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you introduce yourself and tell us about your role?"
        },
        {
            "text": "Louise: I am Louise Davies, currently serving as the Deputy Head Scientific Advisor within Strategic Command."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does your role impact Strategic Command?"
        },
        {
            "text": "Louise: A big part of my role involves sharing evidence-based scientific advice. I act as a bridge between scientific knowledge and the specific capability needs of the Ministry of Defence (MOD)."
        },
        {
            "text": "The primary goal is to enhance Strategic Command's understanding of Science and Technology (S&T) and develop collaborations between MOD and the Defence Science and Technology Laboratory (Dstl)."
        },
        {
            "text": "I also actively showcase emerging capabilities and facilitate access to relevant expertise."
        },
        {
            "text": "As a Scientific Advisor, I also challenge existing practices to ensure S&T is actively used to exploit opportunities and integrate cutting-edge technologies effectively."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What do you find most rewarding about your role?"
        },
        {
            "text": "Louise: For me, a key part of my role lies in connecting with people and providing evidence-based scientific advice."
        },
        {
            "text": "The most rewarding part is seeing my advice translated into actions that enhance Defence. The ultimate reward is knowing that the guidance I offer has played a pivotal role in leading to effective solutions for the benefit of Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interview: What inspired you to pursue a career in STEM?"
        },
        {
            "text": "Louise: In my earlier years, I was a real techie. During my time at university, I pursued a mathematics degree with the clear intention of finding my path in the technology sector."
        },
        {
            "text": "Upon graduating, I swiftly joined the Defence Science Technology Laboratory (Dstl) through their graduate scientist scheme. My initial work focused on submarine detection programmes. Fast forward 22 years, and I’m the Deputy Head Scientific Advisor and still deeply engaged in the fascinating realm of Defence Science and Technology."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: British Science Week is upon us; can you share why you feel this week is so important? "
        },
        {
            "text": "Louise: It's about awareness. When I chose to study mathematics during my A Levels, some teachers doubted its value, thinking only of teaching as an option. They didn't grasp the diverse opportunities a mathematics degree offers."
        },
        {
            "text": "It’s because of this that events like British Science Week are crucial. They help people see the many possibilities, especially in fields like apprenticeships, and make sure people are well-informed about the paths they can take in their careers."
        }
    ]
}