{
    "url": "https://accessibility.blog.gov.uk/2024/03/13/wcag-2-2-detective-skills/",
    "title": "WCAG 2.2 Detective Skills",
    "authors": [
        "David Cox - Senior Accessibility Specialist",
        "GOV.UK Design System Team"
    ],
    "categories": [
        "Accessibility",
        "Accessibility Monitoring",
        "Accessibility Regulations"
    ],
    "pub_date": "2024-03-13T11:02:08+00:00",
    "content": [
        {
            "text": "Whispers of a new ‘WCAG 2.2’ web accessibility standard flutter between coworkers, within and across the UK government. For teams working on services, the message carries an element of mystery. In any given service, how can areas that need Web Content Accessibility Guidelines (WCAG) 2.2 improvements be identified?"
        },
        {
            "text": "Accessibility is a serious topic, but it doesn’t need to be daunting. It’s possible to sharpen accessible design skills and have some fun at the same time."
        },
        {
            "text": "So, welcome to the WCAG 2.2 Detective Agency! Let’s get you trained up."
        },
        {
            "text": "This article – or rather, this detective training course – includes a series of ‘if statement’ clues, a handy magnifying glass and a nifty deerstalker hat (hat and magnifying glass sold separately). The clues can help pinpoint areas of a service that deserve a closer look when making changes to meet WCAG 2.2."
        },
        {
            "heading": 2,
            "text": "What WCAG 2.2 brings overall"
        },
        {
            "text": "Officially released in October 2023, version 2.2 of the Web Content Accessibility Guidelines (WCAG) adds 9 new ‘success criteria’ for improving web accessibility. 6 of the new WCAG 2.2 criteria are graded at the A and AA level, meaning that they’re considered a requirement for websites and mobile apps in UK government. You can learn more about WCAG 2.2 from the W3C Web Accessibility Initiative (WAI)."
        },
        {
            "text": "Each criterion also comes with an ‘understanding’ document, which offers helpful information on how to understand and interpret the criterion."
        },
        {
            "text": "A standard like WCAG should not be used as a replacement for exploring the lived experiences of disabled people, but WCAG can be a great tool to nudge teams towards building more accessible web services."
        },
        {
            "text": "Ready to begin the training?"
        },
        {
            "heading": 2,
            "text": "Helpful clues for WCAG sleuths"
        },
        {
            "text": "There are 7 types of new guidance in WCAG 2.2, spread across 9 new criteria. Pretty much every website and service will benefit from exploring and applying these 7 guidance types."
        },
        {
            "text": "The challenge lies in identifying where each criterion applies, especially across vast web journeys, sites and services."
        },
        {
            "text": "Let’s gather 7 ‘clues’ which together form a detective toolkit. These ‘component-level’ and ‘service-level’ clues can help pinpoint areas that deserve attention, allowing teams to more efficiently target effort when working to improve a service."
        },
        {
            "heading": 2,
            "text": "Component-level clues"
        },
        {
            "text": "Let’s start by examining the individual elements that make up a service, often called components and patterns."
        },
        {
            "text": "4 of the new WCAG 2.2 criteria can be explored by examining how individual elements behave and interact with each other."
        },
        {
            "heading": 3,
            "text": "Target size"
        },
        {
            "text": "If an element on the page is:"
        },
        {
            "text": "…That’s a clue! It’s worth examining further."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 2.5.8: Target size (minimum)."
        },
        {
            "heading": 3,
            "text": "Dragging movements"
        },
        {
            "text": "If an element on the page:"
        },
        {
            "text": "…That’s a clue! It may be worth taking a closer look."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 2.5.7: Dragging movements."
        },
        {
            "heading": 3,
            "text": "Focus appearance"
        },
        {
            "text": "If an element on the page has a focus indicator that:"
        },
        {
            "text": "…That’s a clue! It may be worth taking a closer look."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 2.4.13 Focus appearance."
        },
        {
            "heading": 3,
            "text": "Focus not obscured"
        },
        {
            "text": "If an element on the page either:"
        },
        {
            "text": "…Those are clues! It may be worth taking a closer look."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 2.4.11: Focus not obscured (minimum)."
        },
        {
            "heading": 2,
            "text": "Service-level clues"
        },
        {
            "text": "Now, let’s step back from individual elements and examine the service as a whole. Not all WCAG 2.2 criteria can be investigated by looking at individual components. Sometimes it requires looking at the bigger picture."
        },
        {
            "text": "These next 3 clues cover new WCAG 2.2 criteria that relate to how the service is designed."
        },
        {
            "heading": 3,
            "text": "Accessible authentication"
        },
        {
            "text": "If there’s a login process with any of the following:"
        },
        {
            "text": "…Those are clues! It may be worth taking a closer look."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 3.3.8: Accessible authentication (minimum)."
        },
        {
            "heading": 3,
            "text": "Consistent help"
        },
        {
            "text": "If there’s a series of pages across a service that all include some form of:"
        },
        {
            "text": "…That’s a clue! It may be worth taking a closer look."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 3.2.6: Consistent help."
        },
        {
            "heading": 3,
            "text": "Redundant entry"
        },
        {
            "text": "If a single online journey requires a user to enter the same info more than once…"
        },
        {
            "text": "…That’s a clue! It may be worth taking a closer look."
        },
        {
            "text": "You can continue the investigation by using the WCAG ‘understanding’ document for WCAG 3.3.7: Redundant entry."
        },
        {
            "heading": 2,
            "text": "A more forensic approach to WCAG 2.2"
        },
        {
            "text": "Hot on the trail of a WCAG 2.2 mystery and looking for more info?"
        },
        {
            "text": "The GOV.UK Design System team ran 3 workshops, to inspect specific WCAG 2.2 criteria where testing is more complex."
        },
        {
            "heading": 3,
            "text": "Inspecting ‘Focus not obscured’"
        },
        {
            "heading": 3,
            "text": "Inspecting ‘Target size’"
        },
        {
            "heading": 3,
            "text": "Inspecting ‘Accessible authentication’"
        }
    ]
}