{
    "url": "https://civilservice.blog.gov.uk/2024/03/13/young-carers-action-day/",
    "title": "Young Carers’ Action Day",
    "authors": [
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "Health & Wellbeing"
    ],
    "pub_date": "2024-03-13T12:25:45+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Young Carers’ Action Day – 13 March 2024"
        },
        {
            "text": "Rebecca Sudworth, Deputy Civil Service Carers’ Lead, talks about the experiences of Civil Service young carers."
        },
        {
            "text": "13 March 2024 is Young Carers Action Day and this year's theme is fair futures for young carers. "
        },
        {
            "text": "I am sure many of us have an image of what a carer looks like. Does it look like someone in their twenties balancing work and caring for a parent or disabled sibling? Yet that is the reality for some young people in the Civil Service. Nearly 4000 civil servants under the age of 30 are carers."
        },
        {
            "text": "We encourage all our carers to complete a carer’s passport with the help of their line manager. They may find this on their departmental intranet but we have also put it here on GOV.UK. There is also a conversation map to guide them through the process."
        },
        {
            "text": "Young people may be carers long before they start work. They may experience barriers to accessing and fully participating in education and training because of their caring roles and this can translate into barriers to employment. We are keen to break down these barriers which is why we have included young carers in our Going Forward into Employment (GFiE) programme."
        },
        {
            "text": "The carers’GFiE scheme is run in partnership with the Carers Trust. It is available across the civil service, year-round and nationwide.  It opens up opportunities in the civil service directly to carers, offering 12-24 month fixed term appointments with the potential for permanency in some cases. Alongside the job, the scheme offers support to candidates and their line managers."
        },
        {
            "text": "One young GFiE participant has shared her story with us:"
        },
        {
            "text": "I'm a carer for both my parents. I first heard about GFiE through the carer centre in Tower Hamlets."
        },
        {
            "text": "The GFiE scheme has offered me a chance. For me, this \"chance\" is what I really needed. Being a carer is busy most days and can be extremely tiring. Looking for jobs on my own was proving very difficult while juggling my day-to-day caring responsibilities at home."
        },
        {
            "text": "GFiE offered me the chance to work in a great department and this has helped boost my confidence. I have been able to travel outside my home town and meet great people, all because of the chance I was given. It's helped me realise my potential."
        },
        {
            "text": "My job role has many tasks and each day is different. I am able to work both at home and in the office while keeping my hours flexible if need be. Even though I am fully trained, I'm still learning new things every day and I love this."
        },
        {
            "text": "Our team is very large and is scattered throughout the UK. Some of my colleagues are from Scotland, while others are from Wales. We all work together."
        },
        {
            "text": "My advice to anyone thinking of applying for a GFiE vacancy is, ‘Go for it! You have nothing to lose.’ "
        }
    ]
}