{
    "url": "https://defrafarming.blog.gov.uk/2023/08/23/annual-health-and-welfare-review-making-it-easier-to-apply-comply-and-export/",
    "title": "Annual Health and Welfare Review: making it easier to apply, comply and export",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2023-08-23T11:49:45+01:00",
    "content": [
        {
            "text": "In February, we launched the Annual Health and Welfare Review. "
        },
        {
            "text": "The Review, a funded annual vet visit, allows farmers to concentrate on the specific health and welfare priorities of their animals. "
        },
        {
            "text": "It is first step on the Animal Health and Welfare Pathway.  "
        },
        {
            "text": "When we launched the Review, we said that we would continue to improve it over time with feedback from farmers and vets. "
        },
        {
            "text": "In this post, we’d like to give you a short update on some of that work which includes: "
        },
        {
            "text": "We recently spent some time in Cumbria with farmer Chris Mallinson and his regular vet Matt Duggan. Matt carried out a Review of Chris’ dairy herd. We’ll include their thoughts on the Review in the post and a video too. "
        },
        {
            "heading": 2,
            "text": "Simplifying the application process "
        },
        {
            "text": "Making the Review as straightforward as possible is important to farmers, vets and our team. "
        },
        {
            "text": "Previously farmers started the application process by completing a short form to express their interest in having a Review. They were then sent an email inviting them to complete the application process.  "
        },
        {
            "text": "While we have had positive feedback on how this has worked, we are keen to streamline the process further. So, we have removed the need to complete an expression of interest. "
        },
        {
            "text": "That means if you want to apply for a Review, all you’ll need now is your Customer Reference Number (CRN) and your password. "
        },
        {
            "text": "To learn more the full guidance can be found on GOV.UK."
        },
        {
            "text": "We’ve also prepared a ‘how to’ video for the full process."
        },
        {
            "text": "We will continue to improve the application process with feedback from those who use it, and the next step will be to offer the Review to non-BPS receiving applicants. "
        },
        {
            "heading": 2,
            "text": "Changes to the Review’s BVD testing requirements for cattle "
        },
        {
            "text": "Through co-design, we agreed to provide sufficient funding for a minimum of 6 BVD tests. We specified that those 6 tests should be completed before funding was released. "
        },
        {
            "text": "However, from speaking with vets and farmers and observing what happens on-farm, we saw that it is common for vets to carry out 5 tests for BVD.  "
        },
        {
            "text": "It’s a well-established practice across the industry because it is a requirement of the BVD Free and CHECs schemes. It’s a testament to the impact of these schemes that this practice has become so well established. "
        },
        {
            "text": "To avoid any confusion for vets and farmers, we’ve decided to lower the minimum number of tests for a Review from 6 to 5. "
        },
        {
            "text": "Farmers who have already applied for a Review have already been contacted by the Rural Payments Agency (RPA) who will update their terms and conditions to reflect this. "
        },
        {
            "text": "To support BVD elements in the Review, we are pleased to report that work on our new voluntary endemic disease eradication and control programmes is progressing well with a view to launching it next year.  "
        },
        {
            "text": "This is really important as BVD costs the cattle industry at least £10 million every year.  "
        },
        {
            "text": "The impact of diseases isn’t just felt by the cattle sector. Porcine reproductive and respiratory syndrome (PRRS) costs the pig industry over £50 million. Endemic diseases cost the sheep industry more than £80 million each year. "
        },
        {
            "heading": 2,
            "text": "Using the Review to help you export to the EU  "
        },
        {
            "text": "Simply put, under the EU’s Animal Health regulation, if you want to export products of animal origin (POAO) to the EU, you must prove that the animals have come from a farm that has received a yearly vet visit.  "
        },
        {
            "text": "This is called the ‘vet declaration’.   "
        },
        {
            "text": "The Review fulfils this requirement, as long as the vet fills in the summary that a farmer receives at the end of the visit as evidence."
        },
        {
            "text": "Just note that if you want to use the summary as a Vet Declaration for the purposes of meeting the requirements for export to the EU, your vet will need to include a ‘Vet Declaration Unique Reference Number’. The full guidance can be found on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "A review of the Review "
        },
        {
            "text": "As mentioned, Chris and Matt took part in a Review. The two spoke on the phone before the visit and together they went through the areas they’d look into. "
        },
        {
            "text": "During the visit, they discussed antibiotic use and how it could be improved. They also talked through other health and welfare issues specifically to Chris's farm with a view to improving its productivity. Matt also undertook the compulsory BVD testing during the visit.  "
        },
        {
            "text": "Matt said: “It won’t take me that long to write the review, and we’re here today to go through some of the things we've already discussed on the phone.” "
        },
        {
            "text": "They kindly shared their thoughts and reflections on the process in the video produced by the RPA below."
        },
        {
            "text": " "
        },
        {
            "text": "Thanks to Chris and Matt for taking part.  "
        }
    ]
}