{
    "url": "https://deframedia.blog.gov.uk/2023/08/23/coverage-on-funding-for-the-canal-and-river-trust/",
    "title": "Coverage on funding for the Canal and River Trust",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-08-23T16:49:31+01:00",
    "content": [
        {
            "text": "There have been a number of reports in the media about funding for the Canal and River Trust."
        },
        {
            "text": "The Canal and River Trust (C&RT) is a charity established in 2012 to manage 2,000 miles of inland waterways by capitalising on broader commercial and charitable income opportunities and volunteering."
        },
        {
            "text": "When it was first set up the Government agreed to provide around £740m through a 15-year grant as the charity established itself. At the time the Government and the Trust agreed in a Memorandum of Understanding on 28 June 2012 that C&RT would progressively reduce reliance on Government grant funding."
        },
        {
            "text": "The Government recently agreed to provide C&RT with a further £400m grant over ten years from 2027, while encouraging them to increase income from alternative sources and reduce their reliance on taxpayer funding as an independent charity. This is consistent with the original strategic intent for the Trust."
        },
        {
            "text": "There have been incorrect claims made that Defra is planning a £300m cut to the Trust’s funding. As outlined above, the long-term reduction in government funding was made clear from the outset. It was also set out in the grant agreement with the Trust that no inflationary increase would be applied."
        },
        {
            "text": "A Defra spokesperson said: "
        },
        {
            "text": "“We support canals across the country and recognise the benefits they bring to local communities."
        },
        {
            "text": "“When the Trust was established in 2012 it agreed to increasingly move towards alternative sources of funding. In line with that agreement we have awarded the Trust a significant £550 million in funding and are supporting them with a further £590 million between now and 2037."
        },
        {
            "text": "“We have been discussing this with the charity for some time and have been offering support on how it can increase income from other sources, as per the original objective of the grant funding.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}