{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/08/23/gse-at-civil-service-live/",
    "title": "GSE at Civil Service Live",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Talent & Leadership"
    ],
    "pub_date": "2023-08-23T10:24:21+01:00",
    "content": [
        {
            "text": "Civil Service Live is an annual series of events held across multiple locations, designed to signpost information, share best practice, promote innovation and drive collaboration across government. This year the six events were held across five locations, Newcastle, Glasgow, Manchester, Cardiff and London and the Government Science and Engineering (GSE) Profession team attended all of them.  "
        },
        {
            "heading": 3,
            "text": "GSE hub "
        },
        {
            "text": "The GSE Profession had a hub in the main exhibition area. Here, we spoke with conference delegates, heard about their careers and shared our GSE profession offer. We were also joined on the hub by Government Chief Scientific Adviser and Head of GSE Profession, Professor Dame Angela McLean and one of our members, Cabinet Secretary Simon Case. The Cabinet Secretary visited the hub in Newcastle and London, and it was great to meet one of our high-profile members. The hub was a fantastic opportunity to reach out and connect with so many GSE members in person."
        },
        {
            "heading": 3,
            "text": "Panel sessions"
        },
        {
            "text": "At each location, the GSE profession team ran panel sessions on navigating a career in science and engineering in government called ‘Navigating the Career Crossroads: How to take your career on a science and engineering route’. The panels were comprised of members of the GSE Profession from a mix of grades and experiences to demonstrate the breadth and diversity of GSE careers within government. These sessions generated interesting career conversations with a variety of civil servants so thank you to all who attended."
        },
        {
            "text": "For the penultimate panel session, we were joined by Professor Dame Angela McLean (Government Chief Scientific Adviser and Head of GSE Profession), Liz Ainsbury (UKHSA) and Rachael Dale-Kemp (Rural Payments Agency). The session was facilitated by Beth Hogben, Deputy Director for Systems & Capability, Government Office for Science. This session was well attended, and several areas of discussions came through the audience Q&A. These were broadly focused around three main questions."
        },
        {
            "text": "Our audiences were keen to know more about the opportunities available to them. The GSE profession sessions have included 36 speakers covering 16 government departments and 1 Arms Length Body (ALB) but the advice all boiled down to the same key points. Look at the networks you already have, and if you don’t know where to start – identify someone you can ask for advice. Looking into secondment opportunities to begin to diversify your career portfolio was also strongly recommended, second only to mentoring. And the advice for getting started with either of these things? As Liz Ainsbury put it, ‘just ask, they can only say no!’. The GSE Profession’s biannual mentoring program was highlighted as a way to support its members in this endeavour."
        },
        {
            "text": "The speakers in this series of panel discussions had a variety of backgrounds, some with very technical science and engineering experience and others that were more generalist, as well as a whole host of other career journeys in between the two. The value in industry experience was highlighted, with the importance of understanding how industry works. Having some experience in industry means you can combine this knowledge with networks Government can utilise."
        },
        {
            "text": "Several of those speaking on our panels did hold a further education qualification such as a master's degrees or a PhD, as do many civil servants working in government S&E. For those roles which are very technical, having a deep specialist knowledge might be essential criteria. However, universally our panellists agreed that it is not an essential criterion to progressing in government for most roles. There are many examples of civil servants who hold senior positions who were recruited at lower levels and have worked their way up."
        },
        {
            "text": "We want to support GSE members gaining work experience in different science and engineering areas across government, industry and academia. As set out in the GSE strategy, we want to enable knowledge sharing across our members by building GSE technical communities and enabling more networking opportunities."
        },
        {
            "text": "By and large, the most frequent question centred around feelings of imposter syndrome at work, particularly when considering making a change in your career. The important thing to remember is, almost everyone feels this way. This was exemplified in the experiences shared by our panellists across the eight sessions who ranged from HEO to Deputy Director level, most of whom said they had experienced or do experience imposter syndrome."
        },
        {
            "text": "But knowing that everyone experiences it, doesn’t necessarily make it easier to overcome. Our speakers asked the audience to consider ‘What do you want from your career?’. By focusing on what fulfils you and makes you happy as opposed to the route you feel you should be on - will help guide the choices you make."
        },
        {
            "text": "As an antidote to imposter syndrome, Angela McLean suggested reframing your mindset. So, when someone encourages you pursue a role or change to do something different or ‘more difficult’, to stop for a moment and ask yourself one question ‘do I respect the person who thinks I should do that’. If the answer is yes, then trust the advice and believe your own ability – people don’t tend to say those things just for the sake of it."
        },
        {
            "heading": 3,
            "text": "Wrapping up Civil Service Live 2023"
        },
        {
            "text": "With the conference now wrapped up for another year, we welcome almost 850 new GSE profession members and look forward to supporting them in taking the next step in their career. The full GSE offer can be viewed here and if you’re interested in registering you can sign up here or contact gse@go-science.gov.uk."
        },
        {
            "text": "Civil Service Live is open to all civil servants to attend and will return in 2024. You can find more information, updates on next year’s conference and details on how to get involved here."
        }
    ]
}