{
    "url": "https://nda.blog.gov.uk/the-strategy-series-laying-the-foundation-for-safer-future/",
    "title": "The Strategy Series: Laying the foundation for safer future",
    "authors": [
        "Loren Redmond, NWS"
    ],
    "categories": [
        "Waste management"
    ],
    "pub_date": "2023-08-23T15:25:07+01:00",
    "content": [
        {
            "text": "Welcome to the Strategy Series – the place where we dissect our new Corporate Strategy with the help of our Nuclear Waste Service (NWS) experts."
        },
        {
            "text": "Our Corporate Strategy will help us to move forward in new, innovative ways with a refreshed focus on value and safety. With a newly integrated approach, we are in an even better position to protect our planet now and make radioactive waste permanently safe, sooner."
        },
        {
            "text": "Every month for the next three months, we will explore one of our strategic priorities: planning and preparation, treatment and packaging, and disposal. First up it’s planning and preparation! And who better to explore this vital part of NWS than Loren Redmond, Head of Programme, IWMP."
        },
        {
            "text": "What does “planning and preparation” actually mean?"
        },
        {
            "text": "Exactly what it says on the tin! We focus on informed planning and preparation for our key projects and programmes. This includes building a geological disposal facility (GDF), establishing and maintaining our relationships with waste producers, managing existing waste storage and more."
        },
        {
            "text": "We are also highly skilled coordinators. We organise and manage everything we do as a company that ensures the right waste is in the right packaging and stored in the right way."
        },
        {
            "text": "Our Integrated Waste Management Programme plays an integral part in planning and preparing for now and the future. It lays the foundation for successful waste management and is an ongoing process throughout the waste lifecycle stages."
        },
        {
            "text": "How does it work?"
        },
        {
            "text": "Very simply, I think of it like this. If you want to build a house, you need to know the requirements and the specs before you start laying the bricks. Planning and preparing means you understand the requirements before you invest in any decisions."
        },
        {
            "text": "Nuclear waste management is the same. To plan and prepare for waste disposal safely, we need an in-depth understanding of where the waste is coming from and what type of waste it is. That means we always apply the nuclear waste management hierarchy from the very start.  We can make an informed and proactive decision about whether that waste should and could be minimised, re-used, recycled or disposed. This process fundamentally embeds the waste management hierarchy and preferred approaches into our mindset."
        },
        {
            "text": "Effectively characterising waste is the most exciting part of this process. It creates fantastic opportunities to lower cost in the long term, improve our sustainability and environmental focus and divert waste in the best way possible."
        },
        {
            "text": "But that’s not all! Inventory management is another pivotal part of planning and preparation, predicting waste flows and being able to plan ahead. Additionally, while we are receiving new waste, we also have old waste that needs ongoing management. Once we’ve established where it has come from, what form it is in and how long it has been stored for, we can predict its behaviour and have constant and informed oversight throughout its lifecycle."
        },
        {
            "text": "Who is involved?"
        },
        {
            "text": "We couldn’t do this alone. As part of the Nuclear Decommissioning Authority (NDA) group, we work closely with Sellafield Ltd, Magnox Ltd, DRSL and Nuclear Transport Solutions. Working together enables us to improve our value on behalf of the public and helps us achieve our objectives ensuring the right waste form, is in the right place, following the industry wide waste disposal hierarchy."
        },
        {
            "text": "In this sector especially, it’s important we fully collaborate with an integrated approach to waste management. The relationships we have built with the NDA estate and other operating companies make this possible. Together, we can share learnings and innovations, the waste management cycle is more efficient, and it saves money for the UK taxpayer. We are also more likely to come up with new and innovative solutions. And, of course, we couldn’t do this without the support from our supply chain."
        },
        {
            "text": "Our work will help to facilitate the integrated management of waste across the NDA estate by identifying opportunities, dependencies and synergies, and scope for collaboration across the NDA estate and the wider nuclear sector."
        },
        {
            "text": "An integrated waste implementation plan will ensure that there is a clear thread through NDA and site waste strategies, to the implementation of site waste management plans."
        },
        {
            "text": "What opportunities does this create?"
        },
        {
            "text": "Our work relies on so many people with a huge range of skills and specialisms. From scientists and engineers, to project managers and communications experts – we need a diverse range of skill sets to help us push our strategy forward. The planning and preparation stage creates new jobs and chances to learn new, future-proof skills. From my perspective, a key skill needed is building and maintaining key relationships. We need great communicators to help us work with the NDA and waste producers in the most collaborative and efficient way we can. We also really need technical skills, specifically great radiochemists, to help us work out what is in the waste."
        },
        {
            "text": "The planning and preparation stage also creates a great opportunity to work sustainably. In the past, we assumed waste would be stored in containers suitable for a particular facility. Now, we can ask if that particular form of waste from that particular producer could be reduced, treated or disposed of in other ways. This development is so exciting. With investment in upfront understanding, we can make better choices for a safer and more sustainable future."
        },
        {
            "text": "What’s the next step towards a better, safer future?"
        },
        {
            "text": "Planning and preparing is a pivotal part of the waste management lifecycle. We build the foundation everything else depends on."
        },
        {
            "text": "With investment in this early stage, a skilled and diverse team and our strategic and integrated approach to planning and preparation, the rest of the waste management lifecycle can make informed and successful decisions. We can even save money for the UK taxpayer along the way."
        },
        {
            "text": "To see this in action, read the next instalment of the Strategy Series with Craig Ashton, Head of Waste Services as we dive into treatment and packaging!"
        }
    ]
}