{
    "url": "https://actuaries.blog.gov.uk/2023/11/27/data-and-the-pensions-administration-journey/",
    "title": "Data and the pensions administration journey",
    "authors": [
        "Taylor Brightwell-Smith - Pensions Consultant"
    ],
    "categories": [
        "Analysis",
        "Data science",
        "Pensions"
    ],
    "pub_date": "2023-11-27T15:07:55+00:00",
    "content": [
        {
            "text": "A few years ago, I came to an earth-shattering personal realisation. I hate hiking."
        },
        {
            "text": "I had just completed a walk with what the guidebook described as, an ‘easy to moderate’ incline. I was left physically and emotionally drained. This was during my honeymoon in the Lake District, so we weren’t off to the best start."
        },
        {
            "text": "Now you might be thinking, hope everything’s okay at home, but what’s this got to do with anything?"
        },
        {
            "text": "Well, I was recently reflecting on the pensions administration journey. A journey that has us working towards some summit far off the distance."
        },
        {
            "text": "Pension schemes in their nature are a very long-term thing. They exist to ensure benefits are paid out to the last surviving beneficiary. So that summit for many is far, far, far off in the distance. Much closer are the inclines and occasional valleys that lay on route to that summit."
        },
        {
            "text": "The valleys represent periods of stability and business as usual. Periods of little to no change. These periods feel less common, especially in recent memory."
        },
        {
            "text": "The inclines are reflective of periods of transformation. Major projects, changes in legislation or operational unease. Right now, it feels that the industry is well embarked upon a sheer incline. The need to deliver major projects (Transitional Protection Remedy for public service schemes, GMP Equalisation, Pensions Dashboards) alongside existing day-to-day services, weighing heavy."
        },
        {
            "text": "That’s the question I set out to answer. How do we achieve operational sustainability? How do we solve the administration dilemma? How do we make the journey easier?"
        },
        {
            "text": "To start, you can’t change the journey. You will continue to come across those inclines. Sometimes you’ll see them in plenty of time to plan and at other times they’ll seem to come out of nowhere."
        },
        {
            "text": "You could build some all singing, all dancing solution. In our analogy, some sort of lift or cable car to make the journey easier. But that's a major long-term project and as such comes with the costs associated."
        },
        {
            "text": "So, the best option in most instances is to:"
        },
        {
            "text": "You can prepare your people through strong recruitment, training, and retention policies. You can give them the right tools through digital development and system innovation. And finally, you can lighten their load by making sure that our data is right and fit for purpose. Because bad data is a heavy burden to carry."
        },
        {
            "text": "I’m going to spend some time now focussing on that last point, Data. Firstly, because supporting clients with their data is a core pillar of our work at GAD. Secondly, because good data makes retaining staff  and enhancing your digital offering easier."
        },
        {
            "text": "At GAD we’re often engaged in conversations with clients around data and data strategies."
        },
        {
            "text": "A data strategy is the framework for the tools, processes, and rules that define how to manage, analyse, and act upon your data. Here we’re not just talking about member data like names and salary information but also scheme data, for example benefit specifications."
        },
        {
            "text": "A robust data strategy must recognise the impact of your existing and future data on your operational delivery."
        },
        {
            "text": "For existing data, you should consider the inter-reliance or impact across different work streams. Are the same data items required for different projects? Is there a stronger case for action when looking at the total impact, rather than in the silo of a single problem? This can help with any decisions on competing priorities. Make sure you’re feeding all horizon scanning activities into your data strategy."
        },
        {
            "text": "New data can often be an afterthought. Without consideration schemes can undertake major projects to cleanse data, often at considerable cost, but in a years’ time you'll be back to square one. You must  ensure that you tackle the cause and process, not just the problem."
        },
        {
            "text": "Having a robust data strategy in place is the only way to ensure good data. Good data means you can increase levels of automation, allow members to do more digitally and use your experienced staff in better ways."
        },
        {
            "text": "So, how do we get there? As a start I’d suggest the following 3 actions:"
        },
        {
            "text": "Assess your data strategy – do you know the current quality, not just completeness of your data? Do you know what interactions are improving or degrading your data quality? Do you know how planned data activities fit into your long-term objectives? How often do you review your data strategy?"
        },
        {
            "text": "Engage with key-stakeholders – what is the benefit of cleansing one set of data items over another? What impact does that have on staffing requirements or member experience? What do your administrators need to make these improvements?"
        },
        {
            "text": "Finally, the easiest to remember but often most difficult to achieve. Act. Take action to improve your data. Come and speak to us at GAD about what other schemes are doing and how we can help. Lighten the load on the administration journey."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}