{
    "url": "https://food.blog.gov.uk/2023/11/27/instagram-cafes-food-hygiene-rating-shows-they-have-both-substance-and-style/",
    "title": "Instagram café’s food hygiene rating shows they have both substance and style",
    "authors": [
        "FHRS10"
    ],
    "categories": [
        "Food Hygiene Ratings",
        "People"
    ],
    "pub_date": "2023-11-27T07:00:14+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Ryan Rowe from Cardiff café, LetThemSeeCake. This blog is part of our celebration campaign marking 10 years of mandatory display of Food Hygiene Ratings in Wales."
        },
        {
            "text": "Dynamic couple Gareth Davies and Ryan Rowe run bakery and café, LetThemSeeCake, located on one of Cardiff’s shopping streets in the residential Victoria Park area. They opened their shop in 2020, during a time when contact was limited, to give people the opportunity to send a treat to their friends and family when they couldn’t see them in person. This summer they expanded their business to offer brunch 5 days a week."
        },
        {
            "text": "Talking about starting the business Ryan said, “It was super important for us to get a top rating. We’ve always been non-negotiable with having high standards. We’ve put a lot of effort into our products and how the shop looks, and we wanted to carry that through all the work we do.”"
        },
        {
            "heading": 2,
            "text": "“It was super important for us to get a top hygiene rating”"
        },
        {
            "text": "Ryan and his partner check the ratings of other businesses when they go out. Gareth’s bakery and chef background means he has had experience of food safety and hygiene all his career. This was new for Ryan, as his career had been in property until they decided to open the shop. Ryan completed online training and his level 2 food hygiene course so that he could lead the front-of-house team, as well as looking after all the admin side of the business."
        },
        {
            "text": "This summer they decided to introduce brunch as they could see an opportunity to increase their footfall during quieter periods of the day. This meant that they needed to change the way they worked and handled food, as they’d be handling higher-risk foods and raw meat. They reached out to the environmental health team at their local authority, Cardiff Council, and they were able to get advice on what they’d need to do to minimise these risks."
        },
        {
            "text": "They moved their celebration cake baking to a separate unit and changed the layout of their shop to create more seating and a kitchen that is dedicated to their brunch service. Their food hygiene officer advised them to use plastic aprons for the brunch chefs to avoid cross-contamination with baking."
        },
        {
            "text": "They worked with their team to create their brunch menu and have a dedicated brunch chef - Kirbie. She and Gareth run the kitchen and they have adapted to the culture shock of busy Friday, Saturday and Sunday mornings. It’s led to earlier starts to get all their food preparation done, but both owners are pleased with how it has benefited their business."
        },
        {
            "text": "LetThemSeeCake has recently been inspected and maintained their 5 rating. Ryan said they were “nervous, especially with this most recent inspection, as we really wanted to get it right. All the team were feeling the pressure. The officer who visited was very friendly and she gave us pointers on what else we could do to improve how we do things.”"
        },
        {
            "heading": 2,
            "text": "“There is substance, not just style”"
        },
        {
            "text": "Ryan and the team are looking forward to sharing the news on their social media channels about their latest inspection. He said, “I think it gives people confidence that as well as looking aesthetically nice, there is substance behind this, with all the processes behind the business. Having a 5 rating is another string to our bow. It’s something else we can use to promote the business and we can say to people that you know you’re safe with us.”"
        },
        {
            "text": "Find out more about how the food hygiene rating scheme affects your business and get in touch with your local authority who  may provide or recommend food hygiene courses. Check the rating of your favourite eatery on food.gov.uk."
        },
        {
            "heading": 1,
            "text": "Mae sgôr hylendid bwyd caffi Instagram yn profi bod ganddyn nhw sylwedd a steil"
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n hymgyrch i ddathlu 10 mlynedd ers iddi ddod yn ofyniad cyfreithiol i arddangos Sgoriau Hylendid Bwyd yng Nghymru. Buom yn siarad â Ryan Rowe o gaffi LetThemSeeCake yng Nghaerdydd."
        },
        {
            "text": "Gareth Davies a Ryan Rowe yw’r cwpl dynamig sy’n rhedeg LetThemSeeCake, becws a chaffi sydd wedi’i leoli ar stryd siopa brysur yn ardal Parc Fictoria. Agorwyd y siop yn 2020, yn ystod y cyfnod clo, er mwyn i bobl allu anfon danteithion at eu ffrindiau a’u teulu pan nad oedd modd cwrdd wyneb yn wyneb. Yn ystod yr haf eleni, ehangwyd y busnes i gynnig brecinio (brunch) 5 diwrnod yr wythnos."
        },
        {
            "text": "Wrth siarad am ddechrau’r busnes, dywedodd Ryan ei bod yn “hynod bwysig i ni gael y sgôr uchaf”. Mae cynnal safonau uchel yn fater o raid i ni. Rydym wedi gweithio’n galed ar ein cynhyrchion a sut mae’r siop yn edrych ac roedden ni eisiau cadw'r un safon ym mhob elfen o'r busnes.”"
        },
        {
            "heading": 2,
            "text": "“Roedd yn hynod bwysig i ni gael y sgôr hylendid uchaf”"
        },
        {
            "text": "Mae Ryan a’i bartner yn gwirio sgoriau busnesau eraill pan fyddant yn mynd am fwyd. Mae cefndir Gareth fel pobydd a chogydd yn golygu ei fod wedi cael profiad o ddiogelwch a hylendid bwyd ar hyd ei yrfa. Roedd hyn yn newydd i Ryan, a oedd yn gweithio yn y maes eiddo cyn iddyn nhw benderfynu agor y siop. Cwblhaodd Ryan hyfforddiant ar-lein a chwrs hylendid bwyd lefel 2 fel y gallai arwain y tîm blaen tŷ, yn ogystal â gofalu am ochr weinyddol y busnes."
        },
        {
            "text": "Yn ystod yr haf, penderfynon nhw gyflwyno brecinio er mwyn cynyddu nifer y cwsmeriaid yn ystod cyfnodau tawelach y dydd. Roedd hyn yn golygu bod angen iddyn nhw newid y ffordd yr oeddent yn gweithio ac yn trin bwyd, gan y byddent yn trin bwydydd risg uwch a chig amrwd. Gwnaethant gysylltu â thîm iechyd yr amgylchedd eu hawdurdod lleol, Cyngor Caerdydd, a chael cyngor ar yr hyn y byddai angen iddynt ei wneud i leihau’r risgiau hyn."
        },
        {
            "text": "Penderfynon nhw ddefnyddio uned ar wahân i bobi’r cacennau dathlu a newid cynllun eu siop fel bod ganddyn nhw gegin yn benodol ar gyfer gweini’r brecinio a mwy o le i bobl eistedd. Cynghorodd eu swyddog hylendid bwyd y dylai’r staff sy’n coginio’r brecinio wisgo ffedogau plastig er mwyn osgoi croeshalogi â’r offer pobi."
        },
        {
            "text": "Aeth y tîm ati i greu’r fwydlen newydd, ac mae ganddynt gogydd yn benodol ar gyfer brecinio – Kirbie. Mae Kirbie a Gareth yn rhedeg y gegin ac maen nhw wedi addasu i brysurdeb boreau Gwener, Sadwrn a Sul. Maent bellach yn gorfod dechrau’r gwaith yn gynt er mwyn paratoi’r holl fwyd, ond mae’r ddau berchennog yn falch o’r manteision i’r busnes."
        },
        {
            "text": "Cafodd LetThemSeeCake ei arolygu yn ddiweddar, gan gynnal eu sgôr o 5. Dywedodd Ryan eu bod yn “nerfus, yn enwedig gyda’r arolygiad diweddaraf hwn, gan ein bod ni wir eisiau gwneud pethau’n iawn. Roedd y tîm i gyd yn teimlo’r pwysau. Roedd y swyddog arolygu’n gyfeillgar iawn, gan awgrymu ffyrdd o wella ein prosesau fwy fyth.”"
        },
        {
            "heading": 2,
            "text": "“Mae sylwedd, yn ogystal â steil, yn bwysig”"
        },
        {
            "text": "Mae Ryan a’r tîm yn edrych ymlaen at rannu’r newyddion am eu harolygiad diweddaraf ar eu sianeli cyfryngau cymdeithasol. Dywedodd “Yn ogystal ag edrych yn dda yn y ffenest, rwy’n meddwl bod y sgôr yn rhoi hyder i bobl yn yr holl brosesau y tu ôl i’r llenni, a gallant weld fod gennym ni sylweddol yn ogystal â steil. Mae cael sgôr o 5 yn bluen arall yn ein het. Mae’n rhywbeth arall y gallwn ei ddefnyddio i hyrwyddo’r busnes, gan roi sicrwydd i gwsmeriaid eu bod mewn dwylo diogel.”"
        },
        {
            "text": "Dysgwch fwy am sut mae’r cynllun sgorio hylendid bwyd yn effeithio ar eich busnes a chysylltwch â’ch awdurdod lleol a all ddarparu neu argymell cyrsiau hylendid bwyd. Gwiriwch sgôr eich hoff fwyty ar food.gov.uk."
        }
    ]
}