{
    "url": "https://environmentagency.blog.gov.uk/2023/11/27/internships-with-the-regulated-industry-team-sankaris-story/",
    "title": "Internships with the Regulated Industry team – Sankari’s story.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-27T10:51:24+00:00",
    "content": [
        {
            "text": "My name is Sankari Kalapurakkal, and I have a background in electrical and electronics engineering. I am a master’s student at Sheffield Hallam University. I have previously worked in the power generation, transmission and distribution department of my state back in India. Even though my professional route isn’t the field of environmental conservation, I have always aimed to make sure my work is sustainable. We tend to take care of the things we appreciate more, and I am someone who appreciates nature."
        },
        {
            "text": "Why the EA?"
        },
        {
            "text": "The EA Intern Programme caught my attention like a beacon of opportunity. With this programme, I can continue to protect nature and its precious flora and fauna, as well as get the chance to venture into uncharted territories. It seemed like the perfect opportunity to let me shift my career in another direction without deviating far from my core interests."
        },
        {
            "text": "My motivation for being part of this was simple yet strong – I wanted to do my part in protecting the environment like everybody else working in the EA. I have always held onto the saying 'be the change you wish to see in the world' and saw this internship as a step towards achieving that change."
        },
        {
            "text": "What have you been up to?"
        },
        {
            "text": "I have had the privilege of participating in an engagement day that provided insights into the diverse teams and departments working tirelessly to ensure environmental protection. Each department plays a crucial role in safeguarding our planet. The hydrometry and telemetry team, Environment and Business waste tracking teams, and Food Risk and Coastal Management teams are among those that caught my attention."
        },
        {
            "text": "I also had the chance to take part in some site visits, one of which was a waste recycling plant which had numerous odour complaints from local residents."
        },
        {
            "text": "It was like stepping into a detective’s shoes, piecing together clues to uncover the mystery behind the odorous conundrum. I also had the opportunity to shadow my office buddy while they were on their duty desk hours which opened a new dimension of learning for me."
        },
        {
            "text": "Being part of the regulated industries sector has been an eye-opening experience. Guided by my line manager, Emma, I understood the symbiotic relationship between industrial growth and environmental well-being. The regulated industry team ensures that industry follows sustainable practices by offering guidance and support, assisting them in adhering to waste regulations. But also take appropriate measures for punishing the law breakers."
        },
        {
            "text": "How was your experience?"
        },
        {
            "text": "My journey in the EA Intern Program has been nothing short of transformative. It has armed me with the knowledge, perspective, and determination to work towards a world that thrives without harming the environment.  Through site visits, interactions with different teams, and the guidance from my mentor, Michelle, I've gained invaluable insights into the works done by the EA in protecting the environment. This program has seamlessly fused my passions with the opportunity to contribute to environmental conservation."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "Looking forward, I have a big goal: to help our planet be more sustainable. I'm committed to achieving net-zero carbon emissions – a huge step towards a healthier environment. With all my being, I would like to help achieve this enormous aim. I agree with Greta Thunberg's call to action and believe that every person's effort, no matter how small, may tip the balance in favour of a greener future. I hope to make a difference and be a change-maker in creating a sustainable future for our planet."
        },
        {
            "text": "What advice would you give to anyone considering an internship with the EA?"
        },
        {
            "text": "My word of advice for the future interns would be to meet and talk to new people and most importantly, network!"
        },
        {
            "text": "I was someone who was shy around new people especially after moving to a new country. But I wanted to change that, and EA provided me with the very best opportunity to do that.  My other advice would be to try and explore out of your comfort zone and see where it leads you.  You might like what you find."
        },
        {
            "text": "As someone once said, you might just be one conversation away from your next big opportunity."
        },
        {
            "text": "Are you interested on an internship at the EA? "
        },
        {
            "text": "Find out more information about the early career opportunities, including internships, industry placements and apprenticeship opportunities at the Environment Agency by visiting Early careers - Environment Agency (environmentagencycareers.co.uk)"
        }
    ]
}