{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/11/27/lets-give-social-work-with-older-people-the-recognition-it-deserves/",
    "title": "Let’s give social work with older people the recognition it deserves",
    "authors": [
        "Lyn Romeo",
        "Gerry Nosowska"
    ],
    "categories": [
        "Ageing",
        "Care and support",
        "Knowledge and skills",
        "Research"
    ],
    "pub_date": "2023-11-27T10:14:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A growing and valued demographic"
        },
        {
            "text": "Older people represent the largest group of people accessing social care services. However, most who need social care support will never see a social worker. For every referral into adult services there are five times fewer social workers than for children’s services. And, although many services have specialist teams for adults with learning disabilities or mental health problems, there are fewer dedicated teams for older people."
        },
        {
            "text": "When I was at university 20 years ago, I was one of the few people in my social work cohort who actively wanted to work with older people. For some reason, probably to do with the incredible life stories of my Nan, and my English, Polish and Irish great aunts, I was drawn to working with people in later life."
        },
        {
            "text": "I never regretted getting into that area of social work and now we have the Social Work with Older People research findings to demonstrate comprehensively the fascination, importance and beauty of social work with older people."
        },
        {
            "text": "I use the word 'beauty' because the research does show the beauty of human relationships in times of struggle. It reveals the way the human touch, backed up by expertise and ethics, can support someone to transform their experience and future."
        },
        {
            "text": "Albert, one of the older carers in the study, put it perfectly when he talked about his social worker:"
        },
        {
            "heading": 2,
            "text": "Building connections and trust"
        },
        {
            "text": "The research looked in-depth at 17 situations where ten different social workers supported older people, carers and families. Over a six month period, researchers observed and interviewed social workers, older people and their families, and other professionals involved."
        },
        {
            "text": "The results showed social workers were using specialist knowledge related to later life, expert personal skills and a commitment to upholding rights and dignity. Their capabilities directly led to improved wellbeing, including appropriate care, support for carers and access to financial help."
        },
        {
            "text": "However, they also provided direct therapeutic support to older people and their families by the way they worked. The relationships and trust they established reduced emotional distress and provided reassurance. This was despite the research happening during an exceptionally hard winter for adult social care and the NHS."
        },
        {
            "text": "Social workers were hampered by lack of staff, lack of social care resources, clunky processes and frustrating systems. However, they remained, as one said ‘that hopeful person.’ They supported each other and received sound professional back-up from their managers. Above all, they loved their work."
        },
        {
            "text": "The research identified what older people and carers valued: trust, continuity, knowledge and can-do attitudes – and how social workers can be enabled to offer this. We have produced a policy briefing and will be holding a webinar for Principal Social Workers and other leaders to talk through the implications for deploying and supporting social workers."
        },
        {
            "heading": 2,
            "text": "A rewarding area of practice"
        },
        {
            "text": "We are also creating resources for social work education programmes and continuing professional development that showcase the skill and impact of social work with older people."
        },
        {
            "text": "As our population continues to grow and live longer there will be many more older people with rich histories and complex lives. They deserve to have access to a social worker when they need them most. And so we want to encourage them to go into this endlessly fascinating area of practice."
        },
        {
            "text": "As Maria says of social work with older people:"
        },
        {
            "text": "Let’s do all we can to make sure social work with older people receives the recognition it deserves."
        }
    ]
}