{
    "url": "https://naturalengland.blog.gov.uk/2023/11/27/life-in-the-ravines-planting-for-the-future/",
    "title": "LIFE in the Ravines: planting for the future",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Landscapes",
        "Landscapes and access",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery Network",
        "Nature Returns",
        "Parks, trails and nature reserves",
        "Protected sites and species",
        "Special Protection Area",
        "Species recovery",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2023-11-27T10:32:22+00:00",
    "content": [
        {
            "text": "It is no easy feat, hefting heavy gear across rugged terrain, with young, tender saplings in tow. But that’s exactly the task of our amazing woodland restoration teams as they set about tree planting in the autumn and winter seasons. Cutting back and clearing space for new growth and the young trees, a high level of mental and physical stamina is required to carry out the task - come rain, shine, or even snow!"
        },
        {
            "text": "The five-year LIFE in the Ravines project is an exciting partnership undertaking, centred within the ravine woodlands of the Peak District Dales Special Area of Conservation (SAC). This project received funding from the European Union’s LIFE Programme, to restore these ravine woodlands and mitigate the effects of ash dieback. Led by Natural England, the project partnership comprises of Chatsworth Estate, Derbyshire Wildlife Trust, Staffordshire Wildlife Trust and the National Trust."
        },
        {
            "text": "The project is also working with the Peak District National Park, Derbyshire Dales District Council, the Forestry Commission and the Woodland Trust."
        },
        {
            "text": "So far, the project has planted over 31,000 trees across the Peak District Dales, restoring nearly 60 acres of ravine woodlands in areas including the iconic five dales of the Derbyshire Dales National Nature Reserve, such as the well-visited Lathkill."
        },
        {
            "text": "A large part of the project involves replacing trees lost to ash dieback, a disease caused by Hymenoscyphus fraxineus, which is a type of fungus. A fast spreader, it releases spores which can travel for miles spreading the disease across countries. Since the disease first appeared in Europe over 30 years ago, it spread to the UK where our only native ash species was unprepared and unprotected."
        },
        {
            "text": "In Europe and the UK, thousands of ash trees have been and continue to be infected, usually resulting in their eventual death. In our case, in 2016 the disease had been initially detected in low levels within the Peak District Dales SAC woodlands. Yet, by 2020 an estimated 99% of ash trees in these areas were in fact infected."
        },
        {
            "text": "A Day in the Ravine Woodlands"
        },
        {
            "text": "On cold, early mornings at base, our restoration team are already at work, preparing their equipment before they head out for the day. Working in remote parts of the Peak District Dales requires a lot of forward planning. All risk assessments, hazard maps, cutting and planting equipment are organised and packed up in trucks, ready for the day ahead."
        },
        {
            "text": "Getting to the site to begin work is a tough trek, with almost no footpaths to use and multiple obstacles to climb over. On most days, the team walk over 20 minutes to get to their work location, carrying everything they need with them, including food and drinks, clothing, safety gear, first aid kits and shelters. Adding to that load are the heavy planting hammers, chainsaws, cutting supplies, and hundreds of delicate saplings."
        },
        {
            "text": "In the Peak District Dales, the woodlands are steep, craggy, and limestone based. Moving around can be challenging enough without the difficulties of carrying out the restoration work itself. The team climb up and down these steep, slippery slopes all day, whether planting, cutting, or moving materials."
        },
        {
            "text": "In the autumn and winter, our team also focuses on clearing some of the infected ash trees, to make room for the healthy planted saplings to grow. Work to safeguard our native ash species is vital for maintaining many ecosystems, and the species that live and thrive on and around them. With roughly 1-5% of ash trees showing signs of tolerance to the disease, our team are keeping an eye out for potentially resistant trees that can be sampled for further testing."
        },
        {
            "text": "Chainsaw cutting is required on these tricky slopes to tackle the dead and decaying ash trees. The team selects ash trees for thinning out according to, size, condition, and how much planting space can be gained. Selected ash trees of all sizes are retained, particularly mature specimens, to maintain the structural diversity of the woodland.  All cut material is stacked as brash piles, while felled stems are left secure on the woodland floor to provide a deadwood habitat which becomes invaluable to wildlife including insects and fungi."
        },
        {
            "text": "The key to restoring our ravine woodlands is to replant a variety of suitable trees. The team carefully select which species to plant and where, to have the highest chance of surviving. Trees suitable for ravine woodland conditions are chosen with a focus on the foundation species, which alongside ash, include small-leaved lime, large-leaved lime, and wych elm."
        },
        {
            "text": "When a site has been thinned, and before planting can begin, stakes are knocked into the ground to hold the protective tree tubes in place. These tubes prevent grazing by livestock and deer which would cause severe damage to the young trees. Driving stakes into the cold, rocky limestone is challenging work. So much so, that our team even created bespoke tools to speed up the process."
        },
        {
            "text": "In addition to access issues, difficult terrain, and challenging site work, cold and wet weather conditions can make it hard to stay warm. Especially on the ravines that are facing north."
        },
        {
            "text": "After a full day of restoration work is done, the team heads back to base, where equipment is cleaned and prepared for the next day."
        },
        {
            "text": "It's a tough and exhausting job, but the team loves spending time in these secret woodlands of the National Park. In those quiet and hidden places, it’s possible to witness some of the rarer species that dwell within, and the notion that one day, the saplings they have planted will stand as strong, lofty trees is something to be proud of."
        },
        {
            "text": "Here at Natural England, we are committed to the restoration and recovery of our habitats, and the species that thrive within them. Projects such as this demonstrate the importance of managing sites carefully, with the right tree planted in the right place."
        },
        {
            "text": "This National Tree Week, we celebrate the dedication of our teams who carry out this challenging, yet highly rewarding work. Their efforts are ensuring the beauty of our woodlands are preserved for future generations to come."
        },
        {
            "text": "If you are interested in finding out more about the LIFE in the Ravines project:"
        }
    ]
}