{
    "url": "https://food.blog.gov.uk/2023/11/27/melin-llynon-not-your-run-of-the-mill-food-business/",
    "title": "Melin Llynon - Not your run of the mill food business",
    "authors": [
        "FHRS10"
    ],
    "categories": [
        "Food Hygiene Ratings",
        "People"
    ],
    "pub_date": "2023-11-27T07:00:37+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Richard from Melin Llynon, a pastry chef and chocolatier bringing new life to the last surviving windmill in Wales. He told us all about his relationship with his Environmental Health Officer from Isle of Anglesey County Council and how it’s helped him to achieve and maintain a top food hygiene rating."
        },
        {
            "text": "This blog is part of our celebration campaign marking 10 years of mandatory display of Food Hygiene Ratings in Wales."
        },
        {
            "text": "After several years working as a pastry chef in some of London’s top restaurants, Anglesey native Richard Holt was looking for a new challenge. When he spotted a decommissioned windmill up for tender in 2019, it was the perfect opportunity to move back home and start his own food business at Melin Llynon."
        },
        {
            "text": "Best known for their Mônuts (a doughnut named after ‘Ynys Môn’, the Welsh name for Anglesey), Melin Llynon also produce chocolate bars for wholesale and a range of gins made using botanicals grown on site. But as Anglesey Council work to restore the windmill to working order, Richard is getting ready to make his ultimate dream a reality – as he hopes to start milling his own Anglesey flour."
        },
        {
            "heading": 2,
            "text": "“My EHO is an encyclopaedia of knowledge. They’re so passionate about what they do”"
        },
        {
            "text": "Thanks to his catering background, Richard was no stranger to the Food Hygiene Rating Scheme when he started his business. However, that hasn’t stopped him from reaching out to his local Environmental Health Officer (EHO) at Anglesey Council for guidance and advice."
        },
        {
            "text": "Speaking about his experience with the local authority food safety team, Richard told us that he’s proactive in his approach to their relationship. He reaches out to his EHO for support and advice on a vast range of topics – from developing his Hazard Analysis and Critical Control Point (HACCP) system, to the cocoa levels in his chocolate, and even on the packaging for his wholesale products."
        },
        {
            "text": "He maintains a regular dialogue with his EHO and wants to encourage other food business owners to do the same. Richard explained, “They really are subject experts and can be such a valuable resource for any food business looking to meet the highest food safety standards and achieve or maintain that top rating.”"
        },
        {
            "heading": 2,
            "text": "“Their mission is to work with you to make anything possible”"
        },
        {
            "text": "Once the renovation work of the mill has been completed, Richard is eager to start producing his own flour. Initially, he worried about how to get such an old building to meet today’s standards of food production, but after reaching out to his local authority, they have been an invaluable source of guidance."
        },
        {
            "text": "The EHOs have already visited the site to review the renovation progress and have provided advice during the key development phases. “My EHOs have such a positive and constructive approach. They tell you what you need to do to make it happen.”"
        },
        {
            "text": "Although renovations are still underway and the flour business isn’t yet operational, Richard is grateful to his local authority team for their help and is confident that when production does start, he will maintain his top food hygiene rating."
        },
        {
            "heading": 2,
            "text": "“I’m very proud of the 5 in my window”"
        },
        {
            "text": "In Richard’s experience, chefs really do pride themselves on the rating they get, but he says a good rating goes beyond that - “My employees are equally as invested. To me, a top rating reflects the value my team and I place on meeting the highest food safety and hygiene standards possible.”"
        },
        {
            "text": "Find out more about how the food hygiene rating scheme affects your business and get in touch with your local authority who may provide or recommend food hygiene courses. Check the rating of your favourite eatery on food.gov.uk. "
        },
        {
            "heading": 1,
            "text": "Melin Llynon – Mae rhywbeth yn y gwynt"
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n hymgyrch i ddathlu 10 mlynedd ers iddi ddod yn ofyniad cyfreithiol i arddangos Sgoriau Hylendid Bwyd yng Nghymru."
        },
        {
            "text": "Cawsom sgwrs â Richard o Felin Llynon, cogydd cynhyrchion crwst a siocled, sy’n ailfywiogi melin wynt olaf Cymru. Disgrifiodd ei berthynas â’i Swyddog Iechyd yr Amgylchedd yng Nghyngor Sir Ynys Môn, a sut y mae’r berthynas hon wedi ei helpu i ennill y sgôr hylendid bwyd uchaf, a’i chynnal dros amser."
        },
        {
            "text": "Ar ôl sawl blwyddyn yn gweithio fel cogydd crwst yn rhai o fwytai gorau Llundain, roedd Richard Holt, brodor o Ynys Môn, yn chwilio am her newydd. Pan welodd wahoddiad i dendro am felin wynt wedi’i dadgomisiynu yn 2019, gwelodd gyfle perffaith i symud yn ôl adref a dechrau ei fusnes bwyd ei hun ym Melin Llynon."
        },
        {
            "text": "Er bod Melin Llynon yn fwyaf adnabyddus am ei Mônuts – sef  toesenni wedi’u henwi ar ôl yr ynys – mae hefyd yn cynhyrchu bariau siocled ar gyfer cyfanwerthu ac arlwy o jiniau o wahanol flas wedi’u gwneud o blanhigion sy’n cael eu tyfu ar y safle. Wrth i Gyngor Môn weithio i adfer y felin wynt i’w gogoniant blaenorol, mae Richard yn gobeithio gwireddu breuddwyd – sef dechrau melino ei flawd ei hun ar yr ynys."
        },
        {
            "heading": 2,
            "text": "“Mae fy EHO yn ffynhonnell ddi-ben-draw o wybodaeth. Mae mor angerddol am yr hyn y mae’n ei wneud”"
        },
        {
            "text": "Oherwydd ei gefndir ym maes arlwyo, roedd Richard yn hen gyfarwydd â’r Cynllun Sgorio Hylendid Bwyd pan ddechreuodd ei fusnes. Fodd bynnag, nid yw hynny wedi ei atal rhag troi at ei Swyddog Iechyd yr Amgylchedd lleol yng Nghyngor Môn i gael arweiniad a chyngor."
        },
        {
            "text": "Wrth siarad am ei brofiad gyda thîm diogelwch bwyd yr awdurdod lleol, dywedodd Richard wrthym ei fod yn chwarae rhan weithredol yn y berthynas. Bydd yn cysylltu â’r Swyddog Iechyd yr Amgylchedd yn aml i ofyn am gymorth a chyngor ar ystod eang o bynciau – o ddatblygu ei system Dadansoddi Peryglon a Phwynt Rheoli Critigol (HACCP), i’r lefelau coco yn ei siocled, a hyd yn oed y deunydd pecynnu ar gyfer ei gynhyrchion cyfanwerthu."
        },
        {
            "text": "Mae’n siarad yn rheolaidd â’i Swyddog Iechyd yr Amgylchedd ac mae am annog perchnogion busnesau bwyd eraill i wneud yr un peth. Esboniodd Richard, “Nhw yw’r arbenigwyr pwnc ac maen nhw’n adnodd gwerthfawr iawn i unrhyw fusnes bwyd sydd am gyrraedd y safonau diogelwch bwyd uchaf a chyflawni neu gynnal y sgôr uchel honno.”"
        },
        {
            "heading": 2,
            "text": "“Eu nod nhw yw gweithio gyda chi i wneud unrhyw beth yn bosib”"
        },
        {
            "text": "Unwaith y bydd y gwaith adnewyddu ar y felin wedi’i gwblhau, mae Richard yn awyddus i ddechrau melino ei flawd ei hun. I ddechrau, roedd yn poeni sut i gael adeilad mor hen i fodloni safonau cynhyrchu bwyd cyfoes, ond ar ôl iddo gysylltu â’i awdurdod lleol, mae’r awdurdod wedi rhoi cyngor ac arweiniad amhrisiadwy iddo."
        },
        {
            "text": "Mae Swyddogion Iechyd yr Amgylchedd eisoes wedi ymweld â’r safle i adolygu’r cynnydd gyda’r gwaith adnewyddu ac wedi rhoi cyngor yn ystod y cyfnodau datblygu allweddol. “Mae agwedd fy Swyddogion Iechyd yr Amgylchedd yn gadarnhaol ac adeiladol. Maen nhw’n dweud beth sydd angen i chi ei wneud er mwyn sicrhau bod pethau’n digwydd.”"
        },
        {
            "text": "Er bod y gwaith adnewyddu’n dal i fynd rhagddo ac nad yw’r busnes blawd yn weithredol eto, mae Richard yn ddiolchgar am gymorth y tîm yn ei awdurdod lleol, ac mae’n hyderus y bydd yn cadw ei sgôr hylendid bwyd uchel pan fydd y gwaith cynhyrchu’n dechrau."
        },
        {
            "heading": 2,
            "text": "“Rwy’n falch iawn o’r 5 yn fy ffenest”"
        },
        {
            "text": "Mae Richard yn gwybod o brofiad fod cogyddion wir yn ymfalchïo yn y sgôr y maen nhw’n ei chael, ond dywed hefyd fod sgôr dda yn mynd y tu hwnt i hynny – “Mae fy ngweithwyr yr un mor falch. I mi, mae ennill y sgôr uchaf yn adlewyrchu’r gwerth y mae fy nhîm a finnau’n ei roi ar gyrraedd y safonau diogelwch a hylendid bwyd uchaf posib.”"
        },
        {
            "text": "Dysgwch fwy am sut mae’r cynllun sgorio hylendid bwyd yn effeithio ar eich busnes a chysylltwch â’ch awdurdod lleol a all ddarparu neu argymell cyrsiau hylendid bwyd. Gwiriwch sgôr eich hoff fwyty ar food.gov.uk."
        }
    ]
}