{
    "url": "https://dragonsden.blog.gov.uk/2023/03/09/dragons-den-episode-10-series-20/",
    "title": "Dragons’ Den, Episode 10 Series 20",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "IP",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2023-03-09T21:05:27+00:00",
    "content": [
        {
            "text": "Brave pitches, innovative ideas and fierce questioning - a staple of any Dragons’ Den episode, but particularly clear this week. As we reach episode ten of this series, I was excited to sit down and see which brave entrepreneurs would dare enter the Den."
        },
        {
            "heading": 3,
            "text": "Wheeling in investment or reversing out of the Den?"
        },
        {
            "text": "Offering micro-campers and car conversions, entrepreneur Jason Gledhill was looking for a £100K investment for 10% of his business, Redcote Leisure Limited. The innovative convertors could turn any van into a motor home with removable camper conversion kits- at a fraction of the price of a typical motor home."
        },
        {
            "text": "Peter Jones was first to give the micro-camper a go, trying out the bed for size- which showed it could comfortably fit a person of any height. The Dragons were equally as impressed by the sales Jason had made in the last 12 months. The van conversion also caught the eye of craft queen and mum, Sara Davies, sharing how her dad recently built her a campervan!"
        },
        {
            "text": "Despite enthusiasm across the board, the Dragons weren’t sure about Jason’s branding. This made me think about what makes a good brand, and in turn a good trade mark."
        },
        {
            "heading": 3,
            "text": "Branding that makes a move"
        },
        {
            "text": "As Jason shared, a brand should be unique- as should a trade mark. Branding should also be consistent, eye-catching and speak to the customer. It’s also worth considering whether anyone else is doing something similar in your field of work, as this can make it harder to register a trade mark."
        },
        {
            "text": "When you apply for a trade mark, it’s important to search the trade mark register for similar trade marks in your area of work. You can then see if any other businesses already have a similar trade mark, and may be likely to oppose yours, giving you the best shot at a successful application."
        },
        {
            "text": "Back to the show and Jason was weighing up two fantastic offers, from Sara Davies and Touker Suleyman. Considering both options of a 15% stake for all the full £100K, Jason opted for the Sara’s offer, which included the support of her motorhome-loving dad."
        },
        {
            "heading": 3,
            "text": "Next man up!"
        },
        {
            "text": "Another pitch that caught my eye was father and son duo, Shaye and Raj Sharma, with their match-winning board game, Football Billionaire. The 15-year-old Shaye adeptly explained the concept of the game:  as you move around the board you compete to become the most successful football club owner."
        },
        {
            "text": "I was in awe at Shaye’s nerve and confidence, pitching to the Dragons with ease and relaying the all-important figures. But it was over to dad Raj to face the Dragons’ fierce grilling. Raj explained how Shaye admirably wanted to make it on his own in the business world and was seeking support from the Dragons to help guide him through the board game market."
        },
        {
            "text": "The Dragons were clearly impressed by the confident pitch and their sales so far. One of the key selling points for me was their success in securing licensing from several high-profile football clubs. From West Ham and Chelsea, stretching over the pond to the US NFL, the duo held an impressive array of licences."
        },
        {
            "heading": 3,
            "text": "A winning licence"
        },
        {
            "text": "Obtaining a licence to the franchise of these clubs allows Shaye and Raj to use their branding legitimately within their business. IP can be “licensed-in” and you can “license-out” to another company in return for a fee. This is a great way to expand your business into different markets and collaborate with others to develop new products and services. For Football Billionaire, this means the board games can include the IP of each football club and gain consumer interest from football fans."
        },
        {
            "text": "It’s worth remembering that licences are all different and can cover different areas of IP and territories. As Raj mentioned, his licences currently only cover the UK and Europe, but he was looking to expand this to the US too. Find out more about licensing and franchising in our video."
        },
        {
            "text": "In the Den, the Dragons began to discuss investments. Deborah and Sara were concerned that there wasn’t a dedicated leader of the business. However, Touker and Peter were prepared to help guide the duo to success."
        },
        {
            "text": "With two potential collaborations on offer, Raj thought carefully about his next move. Peter’s background in board games was the deal maker in this case and got Raj’s green card."
        }
    ]
}