{
    "url": "https://educationhub.blog.gov.uk/2023/03/09/how-ensuring-boys-girls-have-same-opportunities-school-sport/",
    "title": "How we are ensuring boys and girls have the same opportunities for school sport",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-03-09T11:11:26+00:00",
    "content": [
        {
            "text": "Being active can have a hugely positive impact on children’s physical and mental health."
        },
        {
            "text": "That’s why we’re setting out how important it is for all pupils to have access to at least two hours of PE and school sport per week. Announced on International Women’s Day, our plans also make it clear that girls and boys should be able access the same sports."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "How will the school sport announcement help girls play more sport?"
        },
        {
            "text": "Building on our commitments made to the Lionesses following their historic Euros 2022 victory, schools will now be expected to offer all sports equally to girls and boys."
        },
        {
            "text": "From September 2023, schools that successfully deliver equal sporting opportunities for girls and boys will be rewarded through the updated School Games Mark, to recognise their commitment to the development of sports competition across their school and in the community."
        },
        {
            "text": "Selected schools around England will be able to keep their sport facilities open for activities outside school hours through Government funding worth £57 million. This will especially benefit girls, disadvantaged children and those with special educational needs."
        },
        {
            "heading": 3,
            "text": "How are you increasing participation in sport in general?"
        },
        {
            "text": "Schools are asked to offer a minimum of two hours curriculum PE time. We will provide support to schools on how to do this through the upcoming refresh of the school sport and activity action plan."
        },
        {
            "text": "Alongside this work, Ofsted will be publishing a report into PE in the coming months, which is expected to set out what high quality PE looks like, including equal access to sports."
        },
        {
            "heading": 3,
            "text": "What is the PE and sport premium? "
        },
        {
            "text": "We have also pledged a total of over £600 million in funding across the next two years for the PE and Sport Premium."
        },
        {
            "text": "Designed to help children get an active start in life, the PE and Sport Premium gives more children access to high quality PE lessons and sporting opportunities."
        },
        {
            "text": "Headteachers can choose how best to spend the money. For example, funds could be used for teacher training, offering more opportunities for pupils to take part in competition, and expanding the range of sports on offer."
        }
    ]
}