{
    "url": "https://lifeathmrc.blog.gov.uk/2023/03/09/how-to-start-your-career-at-hmrc/",
    "title": "How to start your career at HMRC",
    "authors": [
        "Pat"
    ],
    "categories": [
        "General",
        "Guest blog",
        "Recruitment"
    ],
    "pub_date": "2023-03-09T10:44:02+00:00",
    "content": [
        {
            "text": "I work in the Recruitment Marketing team at HM Revenue and Customs (HMRC). You’ve probably heard of HMRC, but have you thought about working here? "
        },
        {
            "text": "You might know us as ‘the tax people’. When you get paid, some of your money goes to the government. It’s a part of life. But that money you pay in taxes pays for our healthcare, schools, roads, fire brigades, national security and more! "
        },
        {
            "text": "We’re one of the largest government departments, with over 66,000 employees. We have offices in major cities across the UK including Manchester, Liverpool, Edinburgh, Glasgow, Belfast, Newcastle, Nottingham, London, Birmingham, Portsmouth, Cardiff and Bristol. "
        },
        {
            "text": "There are so many career opportunities available here, it’s not all about tax. However, if you do want to work in tax you don’t need any previous knowledge. Below are just some examples of jobs we recruit for that would be open at entry level. "
        },
        {
            "text": "Customer Service Advisors "
        },
        {
            "text": "The first point of contact for people who have questions about their tax. These are mostly phone-based jobs, but you’ll also use email and webchat. "
        },
        {
            "text": "Compliance Caseworkers "
        },
        {
            "text": "Investigating taxpayer records to make sure that the correct amount of tax is collected. You’ll learn everything you need during an 18-month training programme. "
        },
        {
            "text": "Surge and Rapid Response Team "
        },
        {
            "text": "A special team which takes on different assignments to help out multiple government departments in times of need. In the past this has included supporting passport control during busy periods and urgent recruitment during the pandemic. Your work could take you across the UK and abroad. "
        },
        {
            "text": "Tax Specialist Programme "
        },
        {
            "text": "This one is for university graduates, where you’ll train over 3 to 4 years to become an expert in tax. Once you complete the programme you’ll be promoted and earn a salary of at least £52,000. Applications open each year in the autumn. "
        },
        {
            "text": "Industrial placements "
        },
        {
            "text": "We have industrial placements in our digital team, which you can complete while studying for a tech-related degree. "
        },
        {
            "text": "And that’s not all… "
        },
        {
            "text": "Other entry-level jobs we offer include Junior Business Analysts, Digital Forensics Officers and Trainee Internal Auditors. As we continue our mission to become the world’s most advanced tax authority, more opportunities will become available so keep an eye out! "
        },
        {
            "text": "Career pathways "
        },
        {
            "text": "No matter how you join us, you can build a career here. You might want to stay in the same business area, working your way up by developing your skills and applying for promotions. Or you might take those skills and use them elsewhere. I work in the Talent Acquisition team and some of my colleagues have previously worked in customer service or compliance for years before moving over. "
        },
        {
            "text": "Would you like to find out more? "
        },
        {
            "text": "There’s more information about what it’s like to work at HMRC on our Civil Service Careers page. "
        },
        {
            "text": "If you want to keep up-to-date with the latest HMRC vacancies, you can sign up to job alerts. Choose what kind of job, location and salary you are looking for, and you’ll get the latest jobs emailed to you every day. Create an account on Civil Service Jobs to find out how to set these up. "
        }
    ]
}