{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/03/09/policy-designs-big-year/",
    "title": "Policy design’s big year",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "PublicPolicyDesign"
    ],
    "pub_date": "2023-03-09T12:00:52+00:00",
    "content": [
        {
            "text": "It’s the end of our year and time for our school report!"
        },
        {
            "text": "Our plan for 2022-23 was to ‘build gravity’. We wanted to embed ourselves within the machinery of government, and both connect policy design people all across UK Government and build our intellectual clout. We have undeniably achieved that."
        },
        {
            "text": "Over the past 10 years since Policy Lab was established, the policy design model has spread across government and most large departments of state now have their own sector-specific labs. But the extent of policy design’s reach was largely unknown, even to practitioners in the community. With just a small investment from Policy Profession we have uncovered an iceberg of interest in policy design, we have rapidly grown to hundreds of members in 75 public sector organisations and developed a university-based network with hundreds of members from academia, public practice and private practice."
        },
        {
            "text": "We now need to capitalise on this astonishing progress. In 2023-24, Policy Profession will continue their sponsorship of our work as a community of expert practitioners and will support us to develop a formal career pathway for policy design."
        },
        {
            "text": "If we had a theme for next year, it would be ‘make it unaffordable not to do design’. We are reprioritising our work to make a landmark ‘case for policy design’ and to seek significant leadership and investment."
        },
        {
            "heading": 2,
            "text": "Institute for Government’s view on our work"
        },
        {
            "text": "IfG’s 2023 Whitehall Monitor reports “It is important for the civil service to continue to experiment with different models for making policy, spreading and embedding those found to be effective. Examples include the use of multidisciplinary teams and ‘red teams’ to stress test proposals, and using deliberative methods to involve the public in policy design and decision making... These methods are sometimes used in government already… for example, Policy Lab [founder member of the policy design community]. Concrete plans are required for how these methods will be mainstreamed into regular departmental practices, and robustly upheld as indispensable elements of policy work. So to continue to improve the quality of its policy advice to ministers, the civil service should focus in 2023 on building on good practice highlighted by the likes of Policy Lab and the policy profession …High-level political and official advocacy will be essential if positive examples are to be built upon.”"
        },
        {
            "heading": 2,
            "text": "HM Government’s investment in policy design"
        },
        {
            "text": "The 2022-23 financial year was the first time that the community has been sponsored by Policy Profession. The investment made by Policy Profession comprised: payment of salary for a head of community role, plus a small amount of back office support for social media marketing, minus about 0.2FTE return support for Policy Profession (like developing and leading Policy Professions CS Live conference events). All other activity was funded through voluntary contribution of community members alongside their existing work commitments."
        },
        {
            "heading": 2,
            "text": "What we delivered in 2022-23"
        },
        {
            "text": "In March 2022, the community agreed a strategy for the year. Its aim was to: embed design into government’s normal way of working; and create a thriving community for technical experts in policy design teams by giving them networks, patterns, infrastructure, and support."
        },
        {
            "text": "The community launched a quarterly delivery board to oversee delivery. The board members are people who lead the community’s work, plus its strategic stakeholders in universities, local government and government professions."
        },
        {
            "text": "This is what the community delivered over the year against its planned activity (in bold):"
        },
        {
            "heading": 4,
            "text": "ADVOCACY & EMBEDDING DESIGN"
        },
        {
            "heading": 4,
            "text": "DESIGN COMMUNITY & EVENTS"
        },
        {
            "heading": 4,
            "text": "DESIGN TRAINING"
        },
        {
            "heading": 4,
            "text": "FUTURE DESIGN WORKFORCE"
        },
        {
            "heading": 4,
            "text": "FUTURE DESIGN PRACTICE"
        },
        {
            "heading": 2,
            "text": "Our plans for 2023-24"
        },
        {
            "text": "Our delivery board has been looking forward to next year and has agreed a plan of action. Our headline priority for 2023-24 is to make a landmark ‘case for policy design’ and to seek significant leadership and investment. We will then work with Policy Profession to establish a career pathway for policy design."
        },
        {
            "heading": 4,
            "text": "OUR COMMUNITY"
        },
        {
            "text": "We are a multidisciplinary community of practice for experts on policy design in the UK’s central and local government organisations. Find out more about what we do and our value to government in our blog posts: The value of public design and Are you making a bid for design?"
        },
        {
            "heading": 4,
            "text": "INTENDED OUTCOMES OF OUR WORK ON POLICY DESIGN"
        },
        {
            "heading": 4,
            "text": "OUR AIMS"
        },
        {
            "heading": 4,
            "text": "OUR GOVERNANCE"
        },
        {
            "text": "We will publish our strategy and publish regular updates on progress. A policy design community leader will lead each workstream, and they will all meet quarterly as a delivery board to manage the work."
        },
        {
            "heading": 4,
            "text": "SEQUENCING OF PRIORITES OVER THE YEAR"
        },
        {
            "text": "Our year will broadly split into 2 parts. In the first two quarters we will prioritise making the ‘case the policy design’. In the final two quarters we will turn to seeking more substantial investment from wider government and developing a career pathway for policy design."
        },
        {
            "text": "Critical work on making the ‘case for policy design’ includes: advocacy and embedding design, and design leadership."
        },
        {
            "text": "Work in last year’s strands on design training and future workforce will be joined-up in a new design education workstream, but this work will be sequenced for the second half of the year."
        },
        {
            "text": "Work will carry on throughout the year on providing design community and events, plus future design practice (due to popular interest of community members)."
        },
        {
            "text": "Our workstreams for next year are:"
        },
        {
            "heading": 4,
            "text": "ADVOCACY & EMBEDDING DESIGN"
        },
        {
            "heading": 4,
            "text": "DESIGN LEADERSHIP"
        },
        {
            "heading": 4,
            "text": "DESIGN COMMUNITY & EVENTS"
        },
        {
            "heading": 4,
            "text": "DESIGN EDUCATION"
        },
        {
            "heading": 4,
            "text": "FUTURE DESIGN PRACTICE"
        },
        {
            "heading": 2,
            "text": "It’s time for you to take action"
        },
        {
            "text": "As the policy design community matures into its teenage years, there are plenty of exciting opportunities for all policy designers whether in public practice, private practice or academia. If we are to continue to grow in a meaningful way and achieve our goal of making design core business for governments, then we need to work together. If you can help, then get in touch at policy.design@policyprofession.gov.uk"
        }
    ]
}