{
    "url": "https://onsdigital.blog.gov.uk/2023/03/09/six-months-in-the-life-of-head-of-product-at-the-office-for-national-statistics/",
    "title": "Six months in the life of Head of Product at the Office for National Statistics",
    "authors": [
        "Sarah Brazier"
    ],
    "categories": [
        "ONS digital people",
        "People and skills",
        "Product Management",
        "Recruitment"
    ],
    "pub_date": "2023-03-09T11:22:48+00:00",
    "content": [
        {
            "text": "The Digital, Data and Technology (DDaT) Capability Framework on gov.uk describes the Head of Product role as one that provides support to all product managers in the organisation, covering a wide range of responsibilities."
        },
        {
            "heading": 2,
            "text": "Representing product people and focussing on things that matter"
        },
        {
            "text": "Stepping into the role on an interim basis meant I needed to prioritise the things I could deliver in a relatively short period."
        },
        {
            "text": "There were things I knew needed to be done but I also wanted to focus on the things that mattered most to product teams. Collaboration was a key success factor in this leadership role."
        },
        {
            "heading": 2,
            "text": "Improving diversity and inclusion within the community"
        },
        {
            "text": "It is incredibly important we are thinking about diversity and inclusion. The Civil Service Diversity and Inclusion Strategy: 2022 to 2025 states that \"a person’s background must never be seen as a limiting factor in the Civil Service, rather an asset that can be drawn upon to improve the work that we do\"."
        },
        {
            "text": "This is especially important for product management because it is our responsibility to ensure our products and services meet the needs of all our users, each of whom has their own characteristics, experiences, and expectations."
        },
        {
            "text": "I worked with a product manager who was instrumental in developing practical ways we can improve diversity and inclusion within the community. This involved setting up a small working group and creating objectives, initiatives and actions such as:"
        },
        {
            "text": "Improving the diversity of our workforce was an important outcome of sharing our job advert within the REACH community. I want to take measures to ensure we not only employ a diverse workforce, but also retain one. I am also running a session with the female PMs this month to understand if there are any barriers they face in reaching their potential."
        },
        {
            "heading": 2,
            "text": "Improving our recruitment process had real results"
        },
        {
            "text": "At ONS we have a growing product community as a result of taking a “product-centric” approach whilst also working on new programmes and projects such as the Integrated Data Service and the Covid Infection Survey."
        },
        {
            "text": "Filling product vacancies quickly ensures we continue to meet this growing demand and so my first step was to meet with the PMs who supported the previous campaign to understand how we could improve recruitment success."
        },
        {
            "text": "Feedback suggested our adverts were too long and were somewhat generic. They did not reflect what we needed from the role. The adverts were rewritten, and an interview and question bank was created to improve the speed to publication. The next recruitment campaign was successful, appointing four vacancies with 14 others on our reserve list."
        },
        {
            "text": "To ensure we are in the best position to welcome our new starters, we are refreshing the new starter toolkit and updating learning pathways. We are also updating our learning and development resources and making new plans for training to ensure we are developing the capability of others and attracting the next generation of product managers at the ONS."
        },
        {
            "heading": 2,
            "text": "Creating the product catalogue"
        },
        {
            "text": "Our product landscape is one that is constantly evolving. With a growing community of 22 PMs on a wide range of products in various divisions, it can be difficult to keep track of what the available products are and what they can offer."
        },
        {
            "text": "We also have inconsistencies in the product information we keep from product to product, so it proved useful to run sessions to share the available product documentation, explain how roadmaps are used and understand what good looks like."
        },
        {
            "text": "A high-level map of the organisation proved to be good start for all PMs to link to their individual product information. It also helped me to see where the gaps and vacancies were so I could prioritise the placement of PMs."
        },
        {
            "heading": 2,
            "text": "Encouraging the right climate, mindset, and behaviours"
        },
        {
            "text": "Throughout my career I have found that if individuals can be themselves in the workplace and feel they can share their thoughts, opinions and ideas freely without judgement, they are more likely to be engaged and creative. This can inspire a more inclusive and productive workforce and improve the well-being and retention of people."
        },
        {
            "text": "Most people now work from home during the majority of their working week so we miss the ad hoc office chats which are essential to getting to know each other and building trust. The PMs find that dedicating some time for an informal ‘coffee chat’ is a simple and worthwhile thing to do, and makes them feel they can reach out to each other for help and support if needed."
        },
        {
            "text": "We have also been running ‘cultural identity’ sessions to our community of practice. These are 10 minute presentations about an individuals background, upbringing and life experiences."
        },
        {
            "text": "I volunteered to do the first one, going into some detail about my own background and explaining how this has shaped the person I am today. It is another simple and worthwhile activity that I think further encourages people to be their authentic selves in the workplace."
        },
        {
            "heading": 2,
            "text": "Learning from others"
        },
        {
            "text": "I am passionate about mentoring and shadowing, and I believe watching how others operate can be extremely useful. Particularly for those who are new to the role. We currently have a shadowing and mentoring network in practice where PMs are paired depending on their experience. I am also in the process of establishing external connections with other product leads to allow me to run this across wider government."
        },
        {
            "text": "During out meet ups, we discuss all things product, including how priorities are set within teams, the flow of information, and how roles complement each other without duplicating effort."
        },
        {
            "text": "My most recent connections were with the Head of Product from the Department of International Trade and Lead Product Manager at Government Digital Service. A piece of advice I found particularly valuable, and reassuring was that there is no such thing as over-communication. A culture of no surprises is one that allows PMs to plan effectively for the future."
        },
        {
            "heading": 2,
            "text": "Growing our own"
        },
        {
            "text": "Product management is a profession that can be difficult to break into and there are various routes, including business analysis or user research. However, we want a way of ‘growing our own’ - taking those with potential already working at the ONS and developing them. Aside from the financial benefits, it means we can provide opportunities for people and give them the skills and experience they need to succeed."
        },
        {
            "text": "We are currently recruiting five associate product managers who will each spend 18 months working alongside experienced PMs on three different products."
        },
        {
            "text": "We have also been working with various organisations to contribute to a new product apprenticeship. The view is that the associate PMs will complete this as part of the scheme."
        },
        {
            "heading": 2,
            "text": "What is next?"
        },
        {
            "text": "I am working with other ONS Community Leads, such as the Head of Business Analysis and the Head of User Centred Design, to share successes so we can further improve the work we do and how we interact with each other within delivery teams."
        },
        {
            "text": "I have been working with the PMs for them to identify topics they feel it will be worthwhile to work collaboratively on. One thing they highlighted was they wanted a better understanding what others across the organisation are working on so we can learn from one another and promote success."
        },
        {
            "text": "To encourage further collaboration and sharing across government, I am also working with other product leads from external organisations and there are plans formulating for a PM conference in June. I am looking forward to sharing the upcoming dates with PMs once finalised."
        },
        {
            "text": "My role in the Head of Product has been one that's been incredible positive, and it has been a privilege to represent such a hardworking, passionate team. I am looking forward to continuing our work to make ONS ‘product centric’, a key ambition by the Central Digital and Data Office (CDDO) and continue to build great products and services for our users."
        }
    ]
}