{
    "url": "https://naturalengland.blog.gov.uk/2023/03/09/what-you-need-to-know-about-the-species-recovery-programme-capital-grant-scheme/",
    "title": "What you need to know about the Species Recovery Programme Capital Grant scheme",
    "authors": [
        "Species Recovery and Reintroductions Team"
    ],
    "categories": [
        "Species re-introductions"
    ],
    "pub_date": "2023-03-09T17:18:14+00:00",
    "content": [
        {
            "text": "What is the Species Recovery Programme?"
        },
        {
            "text": "Natural England (NE) has been delivering its flagship Species Recovery Programme (SRP) for over 30 years focussing on bespoke conservation action to reverse the fortunes of our most threatened native species."
        },
        {
            "text": "How does the Species Recovery Programme operate?"
        },
        {
            "text": "The Species Recovery Programme comprises three components:"
        },
        {
            "text": "1) Memorandums of Agreement (MoAs) between NE and partners setting out a formal way of working together to deliver shared project objectives;"
        },
        {
            "text": "2) a new third-party external grants scheme;"
        },
        {
            "text": "3) monitoring and evaluation of the outcomes and effectiveness of the SRP. Capital research and development is funded through contracts and MoAs between Natural England and partner organisations; whilst capital interventions for targeted species through transfer payments to third parties are funded by the external SRPCGS."
        },
        {
            "text": "How do MoAs and Grants differ?"
        },
        {
            "text": "Capital Research and Development (R&D) is funded through MoAs (and contracts) between Natural England and partner organisations, whilst capital interventions for priority and threatened species will be delivered through a competed grants scheme shortly to open for external applications."
        },
        {
            "text": "Capital Grant Scheme Purpose"
        },
        {
            "text": "What is the Species Recovery Programme Capital Grant Scheme?"
        },
        {
            "text": "Natural England is launching a new capital grant scheme - the Species Recovery Programme Capital Grant Scheme (SRPCGS) which complements and builds upon the existing Species Recovery Programme. The grant scheme will run over two financial years (23/24 and 24/25) and funding is entirely capital. All works, reporting and claims will need to be completed by March 2025. To be eligible for capital grant funding, projects need to include the enhancement or creation of heritage assets (i.e. an area of land supporting wildlife habitats) which benefit species recovery; and/or conservation translocations of target species that enhance habitats to enable them to function effectively."
        },
        {
            "text": "Species eligibility "
        },
        {
            "text": "Which species are eligible?"
        },
        {
            "text": "Priority species – those species named in Section 41 of the NERC Act 2006 (as revised); species classified as Extinct in the Wild, Regionally Extinct, Threatened (critically endangered, endangered or vulnerable) or Near Threatened on IUCN Red Lists at England scale, GB scale or International scale (if there are no England/GB scale assessments). A full list of eligible species will be provided when the application window opens."
        },
        {
            "text": "Application process"
        },
        {
            "text": "Who can apply?"
        },
        {
            "text": "Partnerships, individual organisations and business who are formally constituted; and who are readily able to deliver species recovery objectives. Those not registered may work in partnership with a lead organisation that is registered or formally constituted. The grant is not available for central government departments, their executive agencies; non-departmental public bodies or unregistered organisations. Government bodies may, however, contribute to projects if a third-party grant recipient leads the work and has formal ‘management control’ agreed. Private individuals cannot apply; however, an individual as a consultant could be a partner (or sub-contractor) in a bid led by an eligible body."
        },
        {
            "text": "What scope is there for multiple organisations/partners to try to initiate collaborative projects?"
        },
        {
            "text": "We welcome collaborative projects and expect applicants to explore collaboration with other parties that can add value and reduce duplication of applications. Applications from partnerships will need to identify the lead partner in the application."
        },
        {
            "text": " What are the criteria for assessing applications?"
        },
        {
            "text": "It is also desirable to deliver added value by undertaking action for multiple species (recovery assemblages / integrated package of actions) in an ecologically coherent or themed way, as well as promoting stakeholder engagement with species recovery."
        },
        {
            "text": " When will the applications open? And for how long?"
        },
        {
            "text": "We intend to open the two-year grant scheme for applications on 3rd April 2023, for a period of six weeks. The first two weeks will include a clarification period where prospective applicants can ask further questions. All questions and answers will be made available to all prospective applicants via the grant application platform called Atamis."
        },
        {
            "text": "Will there be a second application window?"
        },
        {
            "text": "No, we are not planning to have a second round of applications, but we may need to if we are under-subscribed."
        },
        {
            "text": " Can more than one application be submitted?"
        },
        {
            "text": "Yes, an organisation can submit more than one application themselves or be involved in a partnership with others, provided they have capacity to manage the proposed projects, if successful.  We welcome collaborative projects and expect applicants to explore collaboration with other parties that can add value and reduce duplication of applications."
        },
        {
            "text": " Is match funding an essential part of the bid? "
        },
        {
            "text": "Match funding (cash and/or in-kind) is a desirable and favoured element, in particular to support non-capital elements such as public engagement, but is not essential. Note that value for money is one of the grant criteria, this will include overall costs, appropriateness of costings and match contributions."
        },
        {
            "text": " Is there a minimum and maximum grant award per project?"
        },
        {
            "text": "We are seeking grant requests of between £50,000 and £500,000 over two financial years."
        },
        {
            "text": " How will payments be made?"
        },
        {
            "text": "NE will make grant payments quarterly in arrears for eligible expenditure against agreed objectives, as set out in the recipients grant funding agreement which references the grant application. Claims must be submitted quarterly."
        },
        {
            "text": "Activity eligibility"
        },
        {
            "text": "To qualify for a grant under the Species Recovery Programme Capital Grant Scheme, the project must include the enhancement or creation of a capital asset. It is a requirement of the grant that only those costs which are directly attributable to bringing capital asset(s) into a useable (functioning) state or condition can be funded."
        },
        {
            "text": " What type of activities ARE in scope for capital funding?"
        },
        {
            "text": "The following is a non-exhaustive list of the type of activities which may be included:"
        },
        {
            "text": " What is Research and Development (R&D)?"
        },
        {
            "text": "Research refers to original and planned investigations undertaken with the prospect of gaining new scientific or technical knowledge and understanding. Development refers to the application of research findings or other knowledge to a plan or design for the production of new or substantially improved materials, products, processes, systems/methodology."
        },
        {
            "text": "The proposed activity must have elements of all five of these criteria to be eligible:"
        },
        {
            "text": " What type of activities ARE NOT in scope for capital funding?"
        },
        {
            "text": "The following is a non-exhaustive list of the type of activities which should NOT be included:"
        },
        {
            "text": "The above activities can be included in a project proposal if they are funded by the grant applicant or by another source of funding, and this contributory funding is welcomed."
        },
        {
            "text": " Are conservation translocations eligible for grant funding?"
        },
        {
            "text": "Conservation translocations, which include species reintroduction, reinforcement and assisted colonisation will be eligible as long as the following conditions are met:"
        },
        {
            "text": " Are beaver reintroductions eligible?"
        },
        {
            "text": "No, we won’t be accepting reintroduction projects for beavers as wild releases are not currently permitted."
        },
        {
            "text": " Can the scheme fund management and maintenance activities, i.e., ongoing management of capital assets?"
        },
        {
            "text": "Capital only funding cannot pay for management and maintenance, applicants would need to build alternative legacy funding into their projects to ensure the investment is maintained beyond the funding period. "
        },
        {
            "text": "Land eligibility"
        },
        {
            "text": "Is work eligible on privately owned land and/or government owned land?"
        },
        {
            "text": "The scheme can fund eligible works on privately or publicly owned land for which the grant recipient has “management control” i.e. ownership or a formal agreement in place with the owner. Government land, including NNRs, is also eligible for capital works, but Government bodies are not eligible to apply for grants."
        },
        {
            "text": " Do I need to have all necessary consents and landowner/partner permissions secured prior to applying to the grant scheme?"
        },
        {
            "text": "No this is not essential beforehand, but you will need to identify what is going to be required as part of your project planning, and the actions you will take to obtain these in a timely manner"
        },
        {
            "text": " Can applicants buy land on which to deliver species recovery?"
        },
        {
            "text": "Land purchase is only possible in exceptional circumstances, where it can be shown that this is the best solution for the recovery of a target species and offers good value for money. Land purchase would require the involvement of conveyancers, detailed evidence of market-value costs and a covenant or agreement which stipulates that the land would be continually managed for wildlife."
        },
        {
            "text": " Is land within an agri-environment scheme eligible?"
        },
        {
            "text": "Grants from the SRPCGS can be active on the same land as Countryside Stewardship (CS) and Environmental Stewardship (ES) agreements provided the work is not: a commitment under the ES or CS agreement; claimed under the ES or CS agreement; needed due to a failure to deliver the ES or CS agreement; at odds with the aims of the ES or CS agreement; included in an ELM Landscape Recovery project."
        }
    ]
}