{
    "url": "https://forestrycommission.blog.gov.uk/2023/03/09/women-in-forestry-mean-business/",
    "title": "Women in forestry mean business",
    "authors": [
        "Jemima Cooper"
    ],
    "categories": [
        "Careers",
        "Woodland management"
    ],
    "pub_date": "2023-03-09T10:02:07+00:00",
    "content": [
        {
            "text": "When I joined the Institute of Chartered Foresters in 2019 I had very little idea what forestry was. I knew being out in nature felt good, but I didn’t give any thought to the thousands of wood products that surround us in the houses we live in, that keep us warm, that make up our clothing and even toothpaste – let alone where it all came from and the huge range of thriving businesses that support its production."
        },
        {
            "text": "Now it is well recognised that trees are vital assets in the fight against climate change and our route to sustainable businesses and communities. Nowhere else is this as clear as in farming, where land managers are realising the opportunities of integrating trees on farms for their businesses, as well as for the environment (as we’ll explore in April at our conference Connecting Trees, Farmers and Foresters)."
        },
        {
            "text": "Last year I was lucky enough to be selected for the Emerging Leaders programme, alongside 35 other people from across the tree sector. There is no one better to shape this conversation than these women leaders-in-the-making on this programme who work tirelessly to plan, grow, plant, establish, manage, harvest, process and research the timber society needs. They also showcase the diverse range of fantastic careers that working with trees and woodlands can offer."
        },
        {
            "text": "Lea Brandes, Container-grown Operations Manager, Forestry England\nWith increased focus on growing more and better woods, it is an exciting time to work in the forest nursery where future woodlands begin. Planting high quality seedlings well-adapted to their environment is vital to generate thriving woodlands, that benefit both nature and the production of sustainable timber."
        },
        {
            "text": "Miriam Jones-Walters MICFor, Natural Resources Wales\nMy job is to create new woodlands, so timber and other wood products are a long way off. However, it’s no less important to think about how new woodlands will contribute to wood culture than it is for mature woodlands. I feel incredibly lucky to be doing this job now, and I hope that future generations are able to realise the thriving wood culture we can picture as we plant tiny saplings today."
        },
        {
            "text": "Shona Smyth MICFor, Institute of Chartered Foresters\nHow we manage our woodlands and forests going forward will be key to shaping the rural economy and our relationship with farming and the wider environment. It’s the wider thinking and understanding of the rural economy that will drive the industry forward. Working in the forestry sector is always a school day. Everyone brings their own perspective and ideas and this has never been more vital than now, with a skills crisis and the climate emergency."
        },
        {
            "text": "Claire Wightman MICFor, TreeStory\nI have a particular passion for abolishing the distinction between native woodlands and productive woodlands. There is no fundamental reason why our native woodland types should not be capable of generating a sustainable income stream, both directly from wood products and indirectly through biodiversity benefits and tourism."
        },
        {
            "text": "Elaine Harrison MICFor, Natural Resources Wales\nThe Welsh Government Woodland Estate is around 40% of the Welsh forest resource, making us the largest land manager in Wales, so we deliver an important range of goods and services. NRW harvests around 850,000 tonnes of timber each year with my team contributing to this. Our forests are a mix of conifer plantations and amenity broadleaved woodlands, so we manage for timber production as well as recreation and biodiversity."
        },
        {
            "text": "Jemima Letts MICFor, The Chatsworth Settlement Trustees\nWorking in forestry has afforded me the privilege of helping to manage some stunning woodlands and landscapes, helping to produce timber in a sustainable way, whilst also maintaining habitats for wildlife and places for people to enjoy."
        },
        {
            "text": "Ros Wardman MICFor, Scottish Forestry\nThere is a catch all line in my job description that states ‘supporting any activity linked to trees, timber and the woodland setting’ which highlights how flexible a woodland can be at producing numerous revenue streams. Through my role I support and promote the Scottish hardwood sector which is a valuable commodity within the timber industry with locally grown and milled wood becoming beautiful furniture, a sustainable construction material or an energy source for example."
        },
        {
            "text": "Dr Eleanor Tew MICFor, Forestry England\nI love working with forests because they have huge potential to provide benefits for both society and nature. From timber production and carbon sequestration to recreation and heritage value, healthy forests underpin a healthy society. And when managed well, they’re also crucial habitats for biodiversity. In my role, I work at the interface between science and practice, leading on embedding concepts around natural capital and forest resilience into practical delivery. It can be challenging but always rewarding, and a privilege to be able to influence how we manage our amazing forests."
        },
        {
            "text": "There is no doubt that farmers and land managers face significant challenges – accessing practical advice that will support your business, dealing with the uncertainty of funding opportunities, attracting new and diverse talent to the workforce, and overcoming the barriers to increasing our wood resource. But with so many reasons to diversify, working together with people like this we can meet the needs of businesses, the rural economy, the environment and society."
        },
        {
            "text": "For more advice on woodland creation and information on grants and available support, visit: https://www.gov.uk/guidance/tree-planting-and-woodland-creation-overview"
        }
    ]
}