{
    "url": "https://teaching.blog.gov.uk/2023/09/18/a-360-overview-of-our-pupil-premium-strategy/",
    "title": "A 360 overview of our Pupil Premium Strategy",
    "authors": [
        "Jane Elsworth"
    ],
    "categories": [
        "Alternative provision",
        "Inspiring teachers",
        "School funding",
        "Teachers' reflections",
        "Uncategorized"
    ],
    "pub_date": "2023-09-18T11:43:17+01:00",
    "content": [
        {
            "text": "Jane Elsworth, the director and deputy headteacher of Huntington Research School, along with her colleague Julie Kettlewell, the assistant director and assistant headteacher, give us a full breakdown of their Pupil Premium strategy from start to finish."
        },
        {
            "text": "Our ways of working "
        },
        {
            "text": "Our intention is that every student at Huntington School, irrespective of their background or challenges, will achieve great outcomes in progress and attainment. As a school leadership team, we spend a significant amount of time considering the school’s application of Pupil Premium funding to ensure we are utilising the offer and improving the attainment of our disadvantaged pupils in the most effective way."
        },
        {
            "text": "The introduction of both the new template and EEF resources have helped our leaders to focus on the best available evidence for this work and support both our school and other schools work out how they can implement their Pupil Strategy. Writing the Pupil Premium strategy is just the first step in the process."
        },
        {
            "text": "We are informed by the EEF’s ‘Putting evidence to work: A schools guide to implementation’ guidance report and think carefully about how to put our Pupil Premium strategy in place and include as many stakeholders as possible in this process."
        },
        {
            "text": "There is a significant crossover between the Pupil Premium strategy and the school development plan and we take time as a senior leadership team (SLT) to consider how the changes will be managed and what steps are needed to maximise the chances of success."
        },
        {
            "text": "Our implementation plan"
        },
        {
            "text": "We complete an implementation plan for each of the key elements. Alongside these plans we complete timelines showing who, why, where, when, and how the aspect of the strategy will be implemented. This avoids it being seen as an ‘add on’ task expected to be tackled on top of the day-to-day work."
        },
        {
            "text": "We take time to consider factors such as potential barriers and other work streams that are already underway. We undertake this work in smaller groups before coming together to share our approach. We think this is essential to create a shared understanding of what we plan to implement and to ensure that all aspects of the strategy complement each other rather than competing for time and resources."
        },
        {
            "text": "Our carefully planned timeline enables the relevant senior leader to monitor and review the strategy. The implementation activities that will take place are identified above the timeline, monitoring activities are shown below. This includes:"
        },
        {
            "text": "An update is scheduled every half term at SLT meetings for this to be reviewed. The relevant senior leader outlines what has taken place, any amendments and adaptations that have taken place and what further support is needed. There is then an opportunity for wider questioning and critique."
        },
        {
            "text": "A further opportunity to review the strategy is provided by our governing body. We provide a termly update, which is another chance for questions to be asked and for us to reflect on whether our strategy is being implemented as planned. The overall impact of the three year Pupil Premium Strategy is reviewed annually by the governing body with a final evaluation at the end."
        },
        {
            "text": "Personal development "
        },
        {
            "text": "Our Pupil Premium strategy is also aligned with the school’s professional development system, so it is fully integrated and a coordinated part of school improvement. Everyone has a target related to disadvantaged students for their professional development, so they recognise their responsibility in supporting these students and the role they play in achieving the strategy. The quality assurance that we have in place also has a focus on the impact this has on our disadvantaged students."
        },
        {
            "text": "Find out more about Pupil Premium."
        }
    ]
}