{
    "url": "https://defrafarming.blog.gov.uk/2023/09/18/feasibility-studies-competition-now-open/",
    "title": "Feasibility Studies competition now open",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-09-18T13:32:44+01:00",
    "content": [
        {
            "text": "Last month, I shared details about the Feasibility Studies competition.  "
        },
        {
            "text": "Through this competition, grant funding is available to support projects investigating new solutions that address major on-farm or immediate post farmgate challenges or opportunities. A share of up to £4.5 million is available to businesses registered in the UK. "
        },
        {
            "text": "I said I’d blog again when the competition opened. I’m pleased to say it’s now open! "
        },
        {
            "text": "The guidance for the Feasibility Studies competition includes everything you need to know about the grant, including who can apply and how the application process works.  "
        },
        {
            "text": "Please read the guidance before starting your application. You’ll be able to do this on the same page. "
        },
        {
            "text": "On 20 September, we’ll host a webinar on the competition. We’ll cover the scope of the competition, eligibility and the application process. You’ll be able to put questions to the team and meet potential partners to collaborate with. Please register to attend. "
        },
        {
            "heading": 2,
            "text": "Dates to note "
        },
        {
            "text": "This funding is offered through the Industry-led R&D Partnerships Fund. This is, in turn, part of the Farming Innovation Programme, a partnership with the Transforming Food Production Challenge, delivered by Innovate UK. "
        },
        {
            "text": "Good luck to applicants."
        }
    ]
}