{
    "url": "https://medregs.blog.gov.uk/2023/09/18/how-nurses-can-support-patient-safety-through-reporting-adverse-incidents/",
    "title": "How nurses can support patient safety through reporting adverse incidents",
    "authors": [
        "Holly Coole"
    ],
    "categories": [
        "Patient involvement",
        "WHO",
        "World Patient Safety Day"
    ],
    "pub_date": "2023-09-18T15:55:37+01:00",
    "content": [
        {
            "text": "On World Patient Safety Day, Holly Coole, registered mental health nurse and senior manager for digital mental health at the MHRA, discusses how the safety of medical products is monitored and how all nurses can help ensure potential issues are picked up fast through the UK’s Yellow Card scheme."
        },
        {
            "text": "As a nurse, I always endeavoured to keep myself informed about the medicines and devices I used with patients but understood very little about the process that put them in front of me or monitored their safety once they were on the market.  I trusted they were safe and effective but never thought about how this was ensured or how I could help."
        },
        {
            "text": "I’ve spent the last few years working as a benefit risk assessor at the Medicines and Healthcare products Regulatory Agency, the body that regulates medicines, medical devices and healthcare products in the UK, initially reviewing the post-market surveillance for medical devices and more recently leading a project on digital mental health regulation.  This turn in my career has allowed me to learn exactly how patient safety is supported in the UK."
        },
        {
            "text": "All medicines and medical devices have to go through a robust safety assessment before they are approved for use in the UK, with manufacturers having to provide not just clinical trial and safety studies to support their claims for safety and efficacy but also open for inspections of their manufacturing facilities and distribution networks, to ensure that every single step of the supply chain is protected for patients."
        },
        {
            "text": "Once products are on the market, though, this work doesn’t stop as ongoing monitoring is crucial in ensuring they remain safe.  There are many factors that can impact this. Manufacturing processes can change, long-term effects on both patient health and product resilience can become evident, and effects on under-represented demographic populations in safety studies can be seen once the product reaches a wider population, amongst others."
        },
        {
            "text": "At the MHRA, we conduct extensive post-market surveillance which brings information in from a wide range of sources so that we can identify potential safety signals with medicines and devices, evaluate the benefit risk impact and then develop risk minimisation measures, preferably in collaboration with manufacturers and market authorisation holders, to maintain the safe use of healthcare products."
        },
        {
            "text": "Manufacturers are required to maintain a continuous feedback loop on safety and efficacy evidence once their product is licensed in the UK, and they have to report this data to the MHRA if safety concerns become evident.  We can also use information from other sources such as new post-market safety studies, other regulatory bodies, anonymised data from electronic healthcare records, whistle-blowers and, most importantly, reports from our Yellow Card scheme."
        },
        {
            "text": "The Yellow Card scheme is the MHRA’s flagship system for collecting information on safety concerns, including suspected side effects or adverse incidents involving medicines, vaccines and medical devices.  Set up in 1964, it forms a critical part of the well-established systems and procedures in place for vigilance in the UK."
        },
        {
            "text": "The scheme relies on voluntary reporting from patients and healthcare professionals like you, receiving and processing almost 100k reports relating to medicines and devices a year.  This is crucial in helping to provide an early warning that the safety of a healthcare product may require further investigation.  In turn, this helps us to identify potential signals that were previously unknown before being reported."
        },
        {
            "text": "Every single Yellow Card report submitted to us is analysed by experts, including doctors, pharmacists, scientists, medical device specialists and nurses, like myself.  When we combine them with all the other sources of data, like those above, it helps us to determine what events may be a potential signal and what may have occurred anyway, in the absence of the medical intervention."
        },
        {
            "text": "This is significant because to report a Yellow Card, you only need to suspect a potential link between the product and the event, but sometimes further investigation shows that the issue being reported is not due to the medicine or medical device in question."
        },
        {
            "text": "This is why it is so important to report.  I know from experience that nurses are in a fantastic position to advocate for the safety and efficacy of medicines and medical devices as you are most likely to be administering medications, using medical devices and monitoring for side effects."
        },
        {
            "text": "While I know that nursing comes with a heavy load of mandatory reports, should an adverse event or reaction occur, it’s really important that the information is shared with us, so we can build a picture of emerging trends that can then be pro-actively managed.   By doing so, you are directly helping to keep your patients safe."
        },
        {
            "text": "To make things smoother, you could add the Yellow Card app or website into your incident reporting tools on the wards, so it becomes part of the process you use each time."
        },
        {
            "text": "Patient and healthcare professional insight really does make a huge difference to our assessments and they can influence our regulatory decisions."
        },
        {
            "text": "Whether you work on a ward or in the community, by promoting the Yellow Card scheme to your colleagues and patients, you’ll also help us to raise awareness of how to report safety concerns and strengthen our vigilance systems that support safety for all patients."
        },
        {
            "heading": 2,
            "text": "Your reports have a direct impact on public health"
        },
        {
            "text": "Reports from healthcare professionals help us to monitor the safety of healthcare products once they are on the market and have already helped us to identify numerous safety issues."
        },
        {
            "text": "A potential link between ranitidine and breast conditions such as gynaecomastia and galactorrhoea was uncovered following Yellow Card reports from two clinicians.  Following an extensive investigation and analysis of the evidence, this ultimately led to strengthened warnings and new side effects listed in the Patient Information Leaflet."
        },
        {
            "text": "It’s therefore vitally important to flag any potential side-effects that patients report to you."
        },
        {
            "text": "You can do this quickly and easily through any EMIS, SystmOne or Vision system or use the Yellow Card app or website."
        },
        {
            "text": "Without accurate, timely data, our monitoring is always going to be less effective.  Every time you make a report or support your patient to make one, you are directly helping to improve the safety of these products for everyone."
        },
        {
            "text": "We are here to support you in this.  There is more information and many resources such as accredited e-learning modules (developed in partnership with Nursing Times and worth 2 hours CPD!) as well as materials like posters and patient information cards available on the Yellow Card website and through the regional Yellow Card centres."
        },
        {
            "text": "We’d encourage you to sign up to receive our Drug Safety Updates, or download the Yellow Card app from the Google Play Store or Apple App Store to get them directly to your phone so you can stay up to date with the latest in medicines and devices safety information, as well as quickly and easily make a report, see if there are any other reports about that drug or device and track your report through the assessment system."
        },
        {
            "text": "If you want to know more about the Yellow Card scheme and how to get involved, we’ll be exhibiting at the HSJ Patient Safety Congress in Manchester (18-19 September 2023).  If you’re attending, come and see us to find out more about our plans for the future of the system and feedback your experience with it."
        },
        {
            "text": " "
        }
    ]
}