{
    "url": "https://educationhub.blog.gov.uk/2023/09/18/how-were-reducing-teacher-workload/",
    "title": "How we're reducing teacher workload",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Teacher workload"
    ],
    "pub_date": "2023-09-18T16:06:06+01:00",
    "content": [
        {
            "text": "We want to make sure that teaching is an attractive career choice, which is why we’re committed to tackling unnecessary workload for teachers and leaders. Our ambition is to reduce working hours by five hours per week within three years and to support this, we’ve launched the Workload Reduction Taskforce.  "
        },
        {
            "text": "The Taskforce will make recommendations to help teachers focus on activities that provide the biggest impact on pupil outcomes. It’s launch comes after a 6.5% pay award for teachers and leaders for the academic year 2023/24. "
        },
        {
            "text": "Here, we explain everything you need to know.  "
        },
        {
            "heading": 3,
            "text": "What is the Workload Reduction Taskforce and what will it do? "
        },
        {
            "text": "The Taskforce is made up of education experts, from those working in our classrooms, to those in management positions. It includes representatives from all four teaching unions (NEU, NAHT, NASUWT and ASCL), as well as teachers, leaders and academics. "
        },
        {
            "text": "Drawing on insight and experience from across the education sector, the group will develop a series of recommendations to support the reduction of unnecessary teacher and leader workload. "
        },
        {
            "heading": 3,
            "text": "Are you also supporting schools to introduce flexible working? "
        },
        {
            "text": "School leaders are also receiving support to introduce flexible working in their schools.  "
        },
        {
            "text": "A new toolkit is set to be launched later this month with practical resources to help them introduce practices such as job shares, part-time working and ad-hoc flexibility, and the occasional personal day. "
        },
        {
            "text": "As part of this, a further five new Flexible Working Ambassador Multi-Academy Trusts and Schools (FWAMS) have been announced, on top of the seven announced in June this year.  The FWAMS will champion flexible working and offer practical advice to school leaders."
        },
        {
            "heading": 3,
            "text": "What else are you doing to improve recruitment and retention of teachers? "
        },
        {
            "text": "Since 2010, we have recruited 27,000 more teachers in England.  "
        },
        {
            "text": "Earlier in the year, the government accepted the independent pay review body’s recommendations for the 2023/24 teacher pay award. School teachers in England will receive a pay award of 6.5% – the highest pay award for teachers in over 30 years. On top of this, we’ve boosted starting salaries for new teachers to at least £30,000 across the country. "
        },
        {
            "text": "To make sure we’re attracting the best and brightest educators, in some key subjects we offer tax free bursaries worth up to £27,000 and scholarships worth up to £29,000. We provide funding for programmes to boost subject knowledge, and we are developing a new physics Initial Teacher Training course for engineers. "
        },
        {
            "text": "We’re also encouraging former teachers to rejoin the profession through the Return to Teaching Advisory service – read more about this initiative here. "
        },
        {
            "text": "Since our launch of the Teacher Recruitment and Retention Strategy nearly five years ago, we’ve worked to develop access high-quality training and support for teachers at every stage of their career. "
        },
        {
            "text": "This winter, we will publish a strategy update that builds upon a commitment to give every child a world class education delivered by great teachers. This will set out priorities for the coming years and provide an update on progress made so far. "
        }
    ]
}