{
    "url": "https://food.blog.gov.uk/2023/09/18/iid3-why-research-into-infectious-intestinal-disease-matters/",
    "title": "IID3 - why research into infectious intestinal disease matters",
    "authors": [
        "Dr. Erica Kintz, Senior Microbiological Risk Assessor"
    ],
    "categories": [
        "Foodborne disease",
        "Science"
    ],
    "pub_date": "2023-09-18T09:50:29+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "One of the Food Standards Agency's ongoing commitments to food safety is surveillance. As part of this, we actively monitor the levels of infectious intestinal disease (IID) in the UK."
        },
        {
            "text": "While we regularly review the number of confirmed IID cases, not all cases that occur in the UK population will be recorded by public health systems. This affects the data that goes into our research estimating the total burden of foodborne disease and the cost of illness to society."
        },
        {
            "text": "Work by the FSA in 2018 estimated the total burden of foodborne disease in the UK per year was 2.4 million cases, costing the economy £9.1 billion pounds from days off work or school and associated medical costs."
        },
        {
            "heading": 2,
            "text": "What is IID?"
        },
        {
            "text": "IID usually presents as diarrhoea and vomiting. In the UK, IID usually goes away on its own and has no long-term effects. Despite this, it has a high cost associated with it in terms of the number of people made ill and the consequences of them being off work or receiving treatment. In some cases, IID can lead to death for high-risk individuals."
        },
        {
            "text": "IID is caused by a range of microorganisms, including:"
        },
        {
            "text": "Transmission of IID can occur through a variety of pathways, for example via foods and person-to-person transmission. That's why good personal hygiene is important to avoid getting ill."
        },
        {
            "heading": 3,
            "text": "Understanding IID"
        },
        {
            "text": "To understand the true number of cases of foodborne disease in the UK we need to understand the proportion of cases of IID that are recorded by public health agencies in national surveillance. This is known as the underreporting rate."
        },
        {
            "text": "There are many reasons for this underreporting, including:"
        },
        {
            "text": "There have already been two Intestinal Infectious Disease studies, IID1 (1993-1996), and IID2 (2007-2009)."
        },
        {
            "text": "Since the IID2 study collected data in 2009, it may no longer reflect the current situation with foodborne illness in the UK. There are many things that might have changed and have an effect on these ‘underreporting rates’ which we outline below."
        },
        {
            "heading": 3,
            "text": "Changes in health services"
        },
        {
            "text": "Since IID2, the health system has become more digital and this may have affected the ability of GPs to report. The research team for IID3 has created an electronic system for recruitment and data sharing that closely mimics those currently used by GP practices; they hope that by making participation easy and similar to current practice, they can increase the number of GP practices and participants that are willing to be involved."
        },
        {
            "text": "Another impact of this digital move is that patients are being seen in-person less often and are relying on replacement services like NHS 111, the NHS app, and online platforms like Patient Access and AskMyGP. We do not know how this change affects whether or not patients will seek advice or treatment for their IID symptoms. Continued pressures on health services mean some people may have stopped trying to get appointments with their GP when in the past they would have sought medical help."
        },
        {
            "heading": 3,
            "text": "Increase in the use of molecular methods for microbiological testing"
        },
        {
            "text": "One advantage that IID3 has over the methods used in IID2 is the improvement in molecular diagnostic methods, like polymerase chain reaction (PCR) tests, compared to traditional culture methods for pathogens. This means that samples can be screened more quickly. This time saving is allowing researchers to include 21 different pathogens in the IID3 study, whereas only 13 were included in IID2."
        },
        {
            "text": "These new methods are also more sensitive, so we’re hoping to attribute pathogens to a greater number of samples in IID3. In IID2, a pathogen could not be identified in nearly 60% of the samples submitted! These new molecular methods will also increase the ability to detect co-infections, where two different pathogens are present."
        },
        {
            "text": "IID3 will also include whole genome sequencing, allowing us to find out more information about these pathogens, including how easily they can spread and how ill they could make people. Comparing these sequences to those maintained by UKHSA may also identify potential sources for the bacteria or link cases to outbreaks."
        },
        {
            "heading": 2,
            "text": "IID3 – Why now?"
        },
        {
            "text": "We use the underreporting rates produced from our IID studies in our models to generate our foodborne disease statistics. As the underreporting rate we are using is almost 15 years old and the underreporting rate is likely to have changed, our estimates might not be quite right!"
        },
        {
            "text": "To combat this, the FSA is now funding a third iteration of the IID projects, IID3, so future foodborne disease work in the FSA can be based on the most current and robust evidence available. There have been several changes in the UK health services and in diagnostic testing, discussed above, which may mean the data from IID2 is no longer fit for purpose."
        },
        {
            "text": "In addition, by using the previous studies as a baseline, we can monitor changes in the likely risks of IID, examine whether our interventions are working, and identify new areas of concern."
        },
        {
            "text": "The IID3 project has recently completed a successful three-month pilot study to test the electronic systems developed by the research team. The main study data collection period began on 1 September 2023 and will run for two years, followed by a data analysis and publication stage. The data set and final report for the project are expected by 2027. During the study, you can stay updated on GP recruitment and sample analysis by visiting the IID3 Dashboard."
        },
        {
            "text": "To learn more about the IID3 study, please see the IID3 research project page on our website. "
        },
        {
            "heading": 1,
            "text": "IID3 - pwysigrwydd ymchwil i glefydau perfeddol heintus"
        },
        {
            "text": "Un o ymrwymiadau parhaus yr Asiantaeth Safonau Bwyd (ASB) wrth sicrhau diogelwch bwyd yw gwyliadwriaeth. Fel rhan o hyn rydym yn monitro lefelau clefydau perfeddol heintus (IID) yn y DU."
        },
        {
            "text": "Er ein bod yn adolygu nifer yr achosion o IID a gadarnhawyd yn rheolaidd, ni fydd pob achos ymhlith poblogaeth y DU yn cael ei gofnodi gan systemau iechyd cyhoeddus. Mae hyn yn effeithio ar y data sy’n sail i’n hymchwil sy’n amcangyfrif cyfanswm baich clefydau a gludir gan fwyd a chost salwch i gymdeithas."
        },
        {
            "text": "Roedd gwaith a wnaed gan yr ASB yn 2018 wedi amcangyfrif baich clefydau a gludir gan fwyd yn y DU bob blwyddyn. Y cyfanswm oedd 2.4 miliwn o achosion, sy’n costio £9.1 biliwn i’r economi, drwy ddiwrnodau i ffwrdd o’r gwaith neu’r ysgol a chostau meddygol cysylltiedig."
        },
        {
            "heading": 2,
            "text": "Beth yw IID?"
        },
        {
            "text": "Mae IID fel arfer yn amlygu’i hun drwy ddolur rhydd a chwydu. Yn y DU, mae IID fel arfer yn diflannu ar ei ben ei hun ac nid yw’n cael unrhyw effeithiau hirdymor. Ac eto, mae’r costau cysylltiedig yn fawr, o ran nifer y bobl sy’n sâl a chanlyniadau bod i ffwrdd o’r gwaith neu gael triniaeth. Mewn rhai achosion, gall IID arwain at farwolaeth i unigolion risg uchel."
        },
        {
            "text": "Caiff IID ei achosi gan amrywiaeth o ficro-organebau, gan gynnwys:"
        },
        {
            "text": "Gall IID gael ei drosglwyddo mewn sawl ffordd, er enghraifft trwy fwydydd a throsglwyddo o berson i berson. Dyna pam mae hylendid personol da yn bwysig er mwyn osgoi mynd yn sâl."
        },
        {
            "heading": 3,
            "text": "Deall IID"
        },
        {
            "text": "Er mwyn deall gwir nifer yr achosion o glefydau a gludir gan fwyd yn y DU, mae angen i ni ddeall cyfran yr achosion o IID a gofnodir gan asiantaethau iechyd cyhoeddus fel rhan o brosesau gwyliadwriaeth cenedlaethol. Yr enw ar hyn yw’r gyfradd tangofnodi."
        },
        {
            "text": "Mae llawer o resymau dros dangofnodi, gan gynnwys:"
        },
        {
            "text": "Mae dwy astudiaeth eisoes wedi’u cynnal ar glefydau perfeddol heintus, IID1 (1993-1996), ac IID2 (2007-2009)."
        },
        {
            "text": "Gan fod astudiaeth IID2 wedi casglu data yn 2009, mae’n bosib nad yw bellach yn adlewyrchu’r sefyllfa bresennol o ran salwch a gludir gan fwyd yn y DU. Mae llawer o bethau a allai fod wedi newid ac wedi effeithio ar y ’cyfraddau tangofnodi’ rydym yn eu hamlinellu isod."
        },
        {
            "heading": 3,
            "text": "Newidiadau yn y gwasanaethau iechyd"
        },
        {
            "text": "Ers IID2, mae’r system iechyd wedi dod yn fwy digidol a gallai hyn fod wedi effeithio ar allu meddygon teulu i gofnodi achosion. Mae’r tîm ymchwil ar gyfer IID3 wedi creu system electronig ar gyfer recriwtio a rhannu data sy’n debyg iawn i’r systemau a ddefnyddir ar hyn o bryd gan bractisau meddygon teulu. Y gobaith yw, os bydd yn hawdd a bod y broses yn debyg i’w harferion cofnodi presennol, y bydd mwy o bractisau meddygon teulu a chyfranogwyr yn fodlon cymryd rhan."
        },
        {
            "text": "Effaith arall y digideiddio hwn yw bod cleifion yn cael eu gweld wyneb yn wyneb yn llai aml, ac yn dibynnu mwy ar wasanaethau amgen fel GIG 111, ap y GIG, a llwyfannau ar-lein fel Patient Access ac AskMyGP. Dydyn ni ddim yn gwybod sut mae’r newid hwn yn effeithio ar bederfyniadau cleifion i geisio cyngor neu driniaeth ar gyfer symptomau IID. Mae pwysau parhaus ar wasanaethau iechyd yn golygu efallai nad yw rhai pobl yn trafferthu ceisio cael apwyntiadau gyda’u meddyg teulu rhagor, a hynny dan amgylchiadau pan fyddent wedi ceisio cymorth meddygol yn y gorffennol."
        },
        {
            "heading": 3,
            "text": "Cynnydd yn y defnydd o ddulliau moleciwlaidd ar gyfer profion microbiolegol"
        },
        {
            "text": "Un fantais sydd gan IID3 dros y dulliau a ddefnyddiwyd yn IID2 yw’r gwelliant mewn dulliau diagnostig moleciwlaidd, fel profion adwaith cadwynol polymeras (PCR), o gymharu â dulliau meithrin traddodiadol ar gyfer pathogenau. Mae hyn yn golygu y gellir sgrinio samplau yn gyflymach. Mae’r arbedion amser hyn yn ei gwneud yn bosib i ymchwilwyr gynnwys 21 o bathogenau gwahanol yn yr astudiaeth IID3, o gymharu â dim ond 13 yn IID2."
        },
        {
            "text": "Mae’r dulliau newydd hyn hefyd yn fwy sensitif, felly rydym yn gobeithio nodi pathogenau mewn mwy o samplau yn IID3. Yn IID2, ni lwyddwyd i nodi pathogenau mewn bron i 60% o’r samplau a gyflwynwyd! Bydd y dulliau moleciwlaidd newydd hyn hefyd yn gwella’r gallu i ddod o hyd i heintiau lle bydd dau bathogen gwahanol yn bresennol."
        },
        {
            "text": "Bydd IID3 hefyd yn manteisio ar ddilyniannu genom cyfan, a fydd yn ein galluogi i ddarganfod mwy o wybodaeth am y pathogenau hyn, gan gynnwys pa mor hawdd y gallant ledaenu a graddau’r salwch y gallent eu hachosi. Gallai cymharu’r dilyniannau hyn â’r rhai a gynhelir gan UKHSA hefyd nodi ffynonellau posib ar gyfer y bacteria neu gysylltu achosion â brigiadau o achosion eraill."
        },
        {
            "heading": 2,
            "text": "IID3 – Pam nawr?"
        },
        {
            "text": "Rydym yn defnyddio’r cyfraddau tangofnodi a nodwyd yn ein hastudiaethau IID yn ein modelau i gynhyrchu ein hystadegau ar glefydau a gludir gan fwyd. Gan fod y gyfradd tangofnodi yr ydym yn ei defnyddio bron yn 15 oed a bod y gyfradd tangofnodi yn debygol o fod wedi newid, efallai nad yw ein hamcangyfrifon yn hollol gywir!"
        },
        {
            "text": "Er mwyn mynd i’r afael â hyn, mae’r ASB bellach yn ariannu trydydd prosiect IID, sef IID3, fel y gellir sicrhau bod gwaith yr ASB ar glefydau a gludir gan fwyd yn y dyfodol yn seiliedig ar y dystiolaeth fwyaf cyfredol a chadarn sydd ar gael. Bu nifer o newidiadau yng ngwasanaethau iechyd y DU ac mewn profion diagnostig, fel y trafodwyd uchod, a allai olygu nad yw’r data o IID2 bellach yn addas i’r diben."
        },
        {
            "text": "Yn ogystal, drwy ddefnyddio’r astudiaethau blaenorol fel llinell sylfaen, gallwn fonitro newidiadau yn y risgiau tebygol o IID, archwilio a yw ein hymyriadau yn gweithio, a nodi meysydd newydd sy’n peri pryder."
        },
        {
            "text": "Yn ddiweddar, mae prosiect IID3 wedi cwblhau astudiaeth beilot lwyddiannus o dri mis i brofi’r systemau electronig a ddatblygwyd gan y tîm ymchwil. Dechreuodd cyfnod casglu data’r brif astudiaeth ar 1 Medi 2023 a bydd yn para am ddwy flynedd, ac yna’r daw’r cam dadansoddi data a chyhoeddi. Disgwylir set ddata a’r adroddiad terfynol ar gyfer y prosiect erbyn 2027. Yn ystod yr astudiaeth, gallwch gael yr wybodaeth ddiweddaraf am recriwtio meddygon teulu a dadansoddi samplau trwy ymweld â Dangosfwrdd IID3."
        },
        {
            "text": "I ddysgu mwy am astudiaeth IID3, ewch i dudalen prosiect ymchwil IID3 ar ein gwefan. "
        }
    ]
}