{
    "url": "https://forestrycommission.blog.gov.uk/2023/09/18/the-forestry-commissions-new-approach-to-consultation-on-forestry-applications/",
    "title": "The Forestry Commission’s new approach to consultation on forestry applications",
    "authors": [
        "Katy Moseley"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-09-18T11:00:29+01:00",
    "content": [
        {
            "text": "In a move to modernise and deliver efficient and effective decision making and accelerate tree planting rates, the Forestry Commission asked the Secretary of State for the Department for Environment Food and Rural Affairs (Defra) to withdraw the 1984 Ministerial Direction on consultation of forestry applications and associated Ministerial Statements. The Secretary of State has agreed to our request to make these changes."
        },
        {
            "text": "These changes are designed to simplify evidence gathering for forestry proposals and to remove duplication in consultation requirements, while still adhering to other environmental legislation and the requirements and good practice guidelines set out in the UK Forestry Standard. This will help reduce the complexity and length of time it takes to apply for and get approval to plant and fell trees."
        },
        {
            "text": "In detail, on 21 July 2023 the Secretary of State for Defra withdrew the 1984 Ministerial Direction on consultation of forestry applications and the associated 1996, 1988, and 2021 Ministerial Statements. These outlined requirements for the Forestry Commission to undertake consultation on applications for woodland creation grants and felling licences, including via the Consultation Public Register."
        },
        {
            "text": "The Ministerial Direction and associated statements have been superseded by other areas of environmental legislation including the Environmental Impact Assessment Forestry Regulations and by the requirements of UK Forestry Standard so were no longer necessary."
        },
        {
            "text": "Consultation remains an important part of assessing some forestry proposals, and in making decisions about land use or land use change."
        },
        {
            "text": "The future approach to consultation has been outlined in a statement from the Forestry Commissioners on 18 September 2023. These changes will be implemented using a phased approach."
        },
        {
            "heading": 2,
            "text": "What does this mean for woodland creation and felling applications?"
        },
        {
            "text": "There is no change to the underlying protections, constraints, and interests across England, or to any of the organisations responsible for them. Known features and the advice and information available to protect them will still be taken into account."
        },
        {
            "text": "When developing applications, proposers should make use of the mapping tools available to highlight any constraints and should then seek any relevant available information or advice to protect identified features of interest. This will help to ensure a faster decision on applications by the Forestry Commission in their role as regulator and grant giver."
        },
        {
            "text": "For those sites or features where there is a statutory requirement to consult, the Forestry Commission will still do so, in line with relevant legislation."
        },
        {
            "text": "For other interests or protections, the Forestry Commission will use a more flexible approach to seeking advice or information."
        },
        {
            "text": "The future approach to consultation will follow a simple set of principles. The Forestry Commission will:"
        },
        {
            "heading": 2,
            "text": "What does this mean for organisations the Forestry Commission currently undertake consultation with?"
        },
        {
            "text": "For most organisations the Forestry Commission engage with, initially they will see limited change. However, as the Forestry Commission introduce these changes over the coming months, some organisations will start to see a reduction in the number of times the Forestry Commission seek advice or information from them."
        },
        {
            "text": "The application and supporting evidence, alongside other available information and data and the Forestry Commission’s own in-house expertise will be used to decide if the Forestry Commission need to seek further information or advice from organisations."
        },
        {
            "text": "This revised approach will reduce the resource burden on organisations that the Forestry Commission seeks advice and information from and will allow them to focus on applications which require greater scrutiny and collaboration."
        },
        {
            "text": "Where the Forestry Commission do seek advice or information, they will expect a response within 28 calendar days."
        },
        {
            "text": "Where an organisation who the Forestry Commission seek advice or information from raises an objection to an application, the Forestry Commission may trigger the dispute resolution process to manage this."
        },
        {
            "heading": 2,
            "text": "What does this mean for applicants?"
        },
        {
            "text": "The applicant plays a key role in establishing what their objectives are and how they intend to deliver them, and the Forestry Commission will increasingly expect them to evidence more clearly that their proposal will benefit the environment and how they intend to mitigate any harmful effects."
        },
        {
            "text": "As part of submitting a UK Forestry Standard compliant application, the Forestry Commission already expect applicants to undertake appropriate land use searches to identify protections and constraints, to walk their sites and identify other unrecorded features, and to engage relevant stakeholders as part of the pre-application process. The Forestry Commission will continue to require this and may return applications and request evidence if this is not clearly demonstrated."
        },
        {
            "heading": 2,
            "text": "When will these changes be introduced?"
        },
        {
            "text": "The changes outlined in the Commissioner’s statement affect a number of activities and will require upskilling and training for Forestry Commission staff, applicants, and for the organisations the Forestry Commission seek advice and information from."
        },
        {
            "text": "The Forestry Commission will roll out these changes in a gradual and structured way, at a pace that ensures that Forestry Commission staff, proposers, and the organisations the Forestry Commission seek advice from, are confident in the new processes."
        },
        {
            "text": "Further announcements will be made over the coming months as these changes are introduced."
        },
        {
            "text": "The ambitions for implementing these changes over the coming months are as follows:"
        }
    ]
}