{
    "url": "https://mhclgdigital.blog.gov.uk/2025/07/28/introducing-ucd-ops-at-mhclg-bringing-researchops-and-designops-together/",
    "title": "Introducing UCD Ops at MHCLG: Bringing ResearchOps and DesignOps together ",
    "authors": [
        "Yana Blake-Walker, UCD Operations Manager",
        "Cathryn Innocent, UCD Operations Manager"
    ],
    "categories": [
        "Design",
        "Ways of working"
    ],
    "pub_date": "2025-07-28T09:26:55+01:00",
    "content": [
        {
            "text": "User-centred design (UCD) at the Ministry of Housing, Communities and Local Government (MHCLG) is growing, and we’re building the systems, structures and communities it needs to scale efficiently. Across government, specialist Research Operations (ReOps) and Design Operations (DesOps) roles are emerging to help designers and researchers work more efficiently. At MHCLG, we’ve taken a blended approach: introducing UCD Operations (UCD Ops) to support both disciplines in one function. "
        },
        {
            "text": "In this blog, we share our experiences as UCD Ops Managers, explaining the unique role of UCD Ops, the challenges we’ve faced in blending two disciplines, the impact we’ve made so far, and our plans for the future. "
        },
        {
            "heading": 2,
            "text": "About us "
        },
        {
            "text": "We are both UCD Operations Managers in MHCLG. Our backgrounds span service improvement, HR and user research in the NHS, central and Welsh government (Yana), and ReOps and participant recruitment in the private sector and the Civil Service (Cathryn). "
        },
        {
            "heading": 2,
            "text": "What UCD Ops is and why it matters "
        },
        {
            "text": "Ops roles are essential for creating the right conditions for teams to do their best work. In the context of user-centred design, Ops set up the systems, structures and support that enable researchers and designers to focus on solving user problems, not navigating administrative or bureaucratic hurdles. "
        },
        {
            "text": "Ops is not just about managing day-to-day tasks – it’s a strategic function. It ensures that teams have the right processes in place to work efficiently, fostering long-term sustainability and scalability. As UCD teams grow, so do their challenges. Without dedicated operational support, researchers and designers end up spending time solving internal problems like managing processes or sourcing tools, which slows progress and introduces risks. "
        },
        {
            "text": "Ops addresses these challenges by streamlining workflows, reducing duplication and ensuring compliance with critical standards like the General Data Protection Regulation (GDPR). This strategic support allows teams to focus on delivering high-quality UCD work while maintaining safe, sustainable practices that align with broader digital strategy goals. "
        },
        {
            "text": "While ReOps and DesOps are well established in government departments like the HMRC, the Department for Education (DfE) and the NHS, they often function separately. At MHCLG, we’ve taken a different approach by merging ReOps and DesOps into a single function – UCD Ops. This ensures consistency, reduces duplication, and fosters stronger collaboration across research and design teams. This unified approach provides a consistent strategy, holistic support and greater flexibility, making it more efficient and scalable. UCD Ops helps streamline operations while aligning both disciplines under one shared vision. "
        },
        {
            "text": "We focus on: "
        },
        {
            "heading": 2,
            "text": "How we got started and what we’ve done "
        },
        {
            "text": "UCD practice at MHCLG is decentralised, with practitioners embedded across multiple directorates, under different management and recruitment processes. Our UCD community of practice helps build connections and is working towards more consistent ways of working. "
        },
        {
            "text": "We’re not tied to one team or discipline, which gives us a bird’s eye view of what’s working, what’s missing, and where improvements can have the biggest impact.  "
        },
        {
            "text": "One of our early challenges was figuring out where to start, so we used the insights from our listening tour with UCD professionals to the create a roadmap to help us think strategically and focus on the areas with the greatest opportunities to reduce risk, connect people and improve consistency.  "
        },
        {
            "text": "In our first few months, we’ve: "
        },
        {
            "heading": 2,
            "text": "What we’ve learned "
        },
        {
            "text": "Since starting, we’ve learned a lot about the unique challenges and opportunities that come with building UCD Ops.  "
        },
        {
            "heading": 2,
            "text": "What’s next for UCD Ops at MHCLG "
        },
        {
            "text": "We’ve built strong momentum but we’re still at the start of our journey. Next, we’re focusing on areas that will strengthen our foundations and better support our growing UCD community. "
        },
        {
            "text": "In the coming months, we’ll be: "
        },
        {
            "text": "We also have aspirations to build an insights library in the future. We know that this is a big task and will start with looking at how we can create consistent terms and categories for research. The aim here is to reduce duplication and make it easier for teams to organise, share and access research insights. "
        },
        {
            "text": "We’re excited to keep building on what we’ve started. "
        },
        {
            "heading": 2,
            "text": "A final note "
        },
        {
            "text": "We are so grateful for the support of more mature Ops teams from other government departments and the cross-government ReOps community. Their experiences and guidance have been invaluable in helping us shape our approach to UCD Ops here at MHCLG. We’re excited to continue building on these lessons as we scale the future of UCD in our department. "
        },
        {
            "text": "We’re also keen to keep learning from others. If you’re working in UCD Ops, ReOps or DesOps in your department or organisation, we’d love to connect. Reach out to us at ucd.operations@communities.gov.uk."
        }
    ]
}