{
    "url": "https://mattersoftesting.blog.gov.uk/the-communications-challenge/",
    "title": "The Communications Challenge ",
    "authors": [
        "Chris Price"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2025-07-28T10:31:14+01:00",
    "content": [
        {
            "text": "We’ve all felt the sinking feeling when our car starts making an unusual noise the week before an MOT is due. Car maintenance can be stressful and knowing when to seek professional help is crucial.  "
        },
        {
            "text": "It’s no surprise that drivers want to work with a garage they can trust to explain the issue clearly, assess its severity and determine potential future impacts. Having open dialogue with customers helps establish long-term trust – calming nerves and helping explain the technical side of vehicle maintenance. It’s only right that we celebrate the garages that get it right.  "
        },
        {
            "text": "We recently found this in our feedback from a key survey – more on that later. But for now, we want to spotlight a garage that has been getting it right for a while. "
        },
        {
            "heading": 2,
            "text": "Trust in action  "
        },
        {
            "text": "Every year, the Independent Garage Association runs the British Independent Garage (BIG) Awards, celebrating the best in the industry across the country.  "
        },
        {
            "text": "Holmer Green wins at the BIG Awards 2024 "
        },
        {
            "text": "Last year, High Wycombe garage, Holmer Green, took home the Customer Choice award. Sponsored by DVSA, this award recognises excellence in communication and customer service. "
        },
        {
            "text": "The garage was founded by two local business partners 41 years ago. Today, they service cars from around Buckinghamshire, offering MOTs, diagnostics, and everyday fixes on gearboxes, brakes and conditioning. "
        },
        {
            "text": "“We're getting more and more work from outside, but we've got such a strong customer base that we're kind of struggling to take anything else on – which is a good thing!” "
        },
        {
            "text": "We spoke to Shane Ferguson, Holmer Green’s Position Director and Service Manager, to reflect on last year’s win – and how things had changed since. "
        },
        {
            "text": "“Winning last year was a huge vote of confidence from our customers – and it was amazing to be recognised by the industry with the award,” he told us. "
        },
        {
            "text": "“People's perceptions have changed a lot over the years - but people come to us because we have an honest, trustworthy relationship with all our customers and pride ourselves on serving the local community. "
        },
        {
            "text": "“We just want to continue to give the customer the best service that we can.” "
        },
        {
            "heading": 2,
            "text": "Industry feedback "
        },
        {
            "text": "Garage technicians have challenging conversations every day. Whether it’s delivering news of an MOT failure or discussing costly repairs with a concerned customer, these moments can make or break relationships.  "
        },
        {
            "text": "Shane’s experience reflects broader trends we’re seeing across the industry, which recent research has helped us understand better. We asked 1050 people who’d had an MOT in the past six months about their experience and what could be improved in out 2025 MOT Citizens Annual Relationship Survey.   "
        },
        {
            "text": "Unsurprisingly, people getting an MOT reported a range of concerns before their test. In addition to the costs of vehicle ownership, our survey revealed that 25% reported nervousness about interacting with garage staff, while 23% worried that their lack of technical knowledge held them back from understanding the results. "
        },
        {
            "text": "“Working with customers means having honest conversations,” Shane told us. “If a car needs repairs, we can work with them on what needs fixing now and what can be sorted later.” "
        },
        {
            "text": "This aligns with what we’ve heard from customers and garages across the UK. Interestingly, most of the people surveyed reported that they trusted their garage more following their car's MOT, with 48% more aware of what was checked during the test. "
        },
        {
            "text": "Even better – we were pleased to see that the majority said they’d choose to go back to the same garage. "
        },
        {
            "heading": 2,
            "text": "How can you get involved? "
        },
        {
            "text": "This alignment between what customers want and what the best garages deliver is exactly what the industry celebrates each year. "
        },
        {
            "text": "“I firmly believe the standout garages let their beliefs and work ethic shine through,” said Shane, reflecting on their success. “It’s so important to establish long-term trust with your customers.”  "
        },
        {
            "text": "It was encouraging to see Holmer Green doing excellently since their win – and we’re excited to see who’ll win this year. "
        },
        {
            "text": "The 2025 Consumer Choice Award nominees are: "
        },
        {
            "text": "The BIG Awards take place on 12 September in Birmingham. We hope to see some of you there – and we can, together, celebrate the best examples of customer service in the industry.  "
        },
        {
            "text": "As for all our services, we are always keen to hear from the end users – the motorists. This gives us information on how we can improve the services. When we have feedback from the next motorist survey we’ll let you know what we are hearing."
        },
        {
            "text": "Check out the BIG Awards here and let us know if you’ll be joining: IGA | The BIG Awards | IGA  "
        }
    ]
}