{
    "url": "https://ipo.blog.gov.uk/2021/04/27/its-all-about-you-the-one-ipo-transformation/",
    "title": "All about you - the One IPO Transformation programme",
    "authors": [
        "Debbie Cooke"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Design",
        "Design right",
        "IPO",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-04-27T15:45:20+01:00",
    "content": [
        {
            "text": "Today, the Intellectual Property Office (IPO) has launched its five-year One IPO Transformation - a five-year programme that will transform Intellectual Property (IP) services and enhance the value that the IPO adds to the UK economy."
        },
        {
            "text": "To mark the occasion, Debbie Cooke, Head of the IPO’s Business Change Team, outlines how developing a world leading IP system can make the UK a more attractive place to invest and drive economic growth."
        },
        {
            "text": "In the 21st century, every organisation seems to be going through a transformation - the pace and scale of change in modern society demands it. Common reactions to transformation I've observed are \"oh another transformation\", a sigh and an eyeroll. I get it, we've been there before, we know the ropes."
        },
        {
            "text": "I’m here to tell you why our One IPO Transformation programme is different, and why I believe it can make a real difference, not just to the IPO and its customers, but to the prosperity of the UK. To understand why, first let’s look at the big picture."
        },
        {
            "heading": 3,
            "text": "Why is the IPO transforming?"
        },
        {
            "text": "Intellectual Property (IP) is essential to making the UK the most innovative and creative country in the world. It is fuel to unleash innovation and creativity; to help British businesses build back better and build back greener following the pandemic. The UK already has a world leading IP environment, but a service for innovators must itself innovate."
        },
        {
            "text": "By not just digitising what we currently do but by completely transforming the 'how' and 'what' we do, we will remove barriers to innovation and make IP rights more accessible and useful to innovators, entrepreneurs and creators."
        },
        {
            "text": "By providing businesses and citizens with the tools they need to harness the power of IP, we can incentivise investment and enable knowledge sharing. Through improved use of IP, we will enable UK economic growth and give the UK a competitive advantage.\n"
        },
        {
            "heading": 3,
            "text": "Why does IP matter?"
        },
        {
            "text": "IP matters. It’s increasingly relevant in a world where content, ideas and brands are king. Industries with an above average use of IP account for over 40% of UK GDP, 15.5% (4.5 million) of total UK employment and 52.1% (£159.7 billion) of goods exported. Needless to say, that’s a lot of money and a lot of jobs!"
        },
        {
            "text": "Aside from the hard numbers, we see the value that businesses and investors place in IP all around us. Why did Disney acquire Fox? It wasn’t for their brick-and-mortar assets; it was for their IP. Closer to home, what is one of the first questions that investors ask on Dragon’s Den? \"Do you have a patent for that?\". Today, the real bulk of a business’s value is in its IP."
        },
        {
            "text": "So, IP being important for businesses, means it is important for the UK economy. In a post-Brexit world, the UK has to carve out new opportunities to have a competitive edge in the face of fierce global competition. Having a truly world-leading IP environment can help set the UK apart and attract investors. If the UK provides unique support to businesses to not only register and protect their IP, but to use, monetise and innovate through IP, the UK will gain a competitive edge. That’s where the IPO comes in."
        },
        {
            "heading": 3,
            "text": "How are we transforming?"
        },
        {
            "text": "When we first started thinking about how the IPO should transform, and how we would take it forward, we were clear that the expectations of our customers had changed. It’s not enough just to say we’ll ‘digitise’ what we’re already doing. When Apple launched the iPhone in 2007, they weren’t trying to make a better iPod, they were trying to make a new type of device that made the most out of mobile internet services. Similarly, we want to make the most of modern technology to redefine what our services can be in the future."
        },
        {
            "text": "Over the next 5 years, we don’t want to just modernise and recreate our current processes, systems and services. We want to completely transform what we do, the way we do it and the value we contribute to the UK economy."
        },
        {
            "text": "In the short to medium term, that means creating a one stop shop for IP. Right now, if somebody wants to get a patent they have to use a completely different system from the one they would for, say, a trade mark. This makes simple tasks unnecessarily difficult for our customers. For example, at the moment if somebody wants to change their business address, they have to tell us that information for each separate patent, trade mark or design they have registered. In future they will be able to change this information themselves, one time in one place. We want to bring all our core services under one roof, and that includes empowering researchers to make better use of our IP data."
        },
        {
            "text": "Longer term, moving on from ageing technology and processes will free up our resources and our people. It will allow us to focus on those bigger picture objectives around helping businesses make better use of their IP. That’s where we feel we can really enable and accelerate UK innovation and be global IP leaders."
        },
        {
            "heading": 3,
            "text": "How can I find out more?"
        },
        {
            "text": "I believe the work we’re doing to transform the IPO really matters and can make a big difference to innovation and investment in the UK. If I’ve convinced you that our One IPO Transformation programme matters you can find out more about our transformation plans by taking a look at our new One IPO Transformation prospectus."
        },
        {
            "heading": 3,
            "text": "Interested in becoming a user tester?"
        },
        {
            "text": "We will be running a series of user testing sessions to get feedback from customers throughout the programme. If you would like to take part in these sessions, you can express your interest by contacting usertesting@ipo.gov.uk."
        },
        {
            "text": " "
        }
    ]
}