{
    "url": "https://deframedia.blog.gov.uk/2022/01/20/bathing-water-classifications-2021/",
    "title": "Bathing water classifications 2021",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-01-20T13:11:05+00:00",
    "content": [
        {
            "text": "There has been coverage today including in The Independent and ENDS Report on the bathing water classifications for 2021."
        },
        {
            "text": "The results show that 99% of bathing waters in England have passed water quality standards following testing by the Environment Agency at over 400 designated sites. Of these, 94.7% of beaches and inland waters gained an ‘Excellent’ or ‘Good’ rating while 4.3% achieved the minimum ‘Sufficient’ rating. This compares with 98.3% passing the required standards in 2019, and is the highest number since new standards were introduced in 2015."
        },
        {
            "text": "Bathing waters are monitored for sources of pollution known to be a risk to bathers’ health, with up to 20 samples taken from each site during the bathing season. Each sample is tested for bacteria, specifically E coli and intestinal enterococci."
        },
        {
            "text": "The EA has been monitoring bathing water sites since the 1990s, and in this time there have been significant improvements. In the early 1990s, for example, just 28% of bathing waters met the highest standards in force at that time."
        },
        {
            "text": "There is still more to be done, and the EA is taking robust action to support regulators, businesses, farmers and councils to ensure cleaner and healthier waters for all."
        },
        {
            "text": "Environment Agency chair Emma Howard Boyd said:"
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "This is also the first year that part of the River Wharfe in Ilkley, West Yorkshire, has been given an official classification. While a designation is an important first step towards water quality improvements, we have always been clear that it will take significant time, investment and co-operation to see real change. Yorkshire Water yesterday announced new investment of up to £13 million for the Wharfe, including extra disinfection measures."
        },
        {
            "text": "The EA’s Swimfo website provides detailed information on each of the 400+ bathing waters in England, and notifies bathers when Pollution Risk Warnings have been issued."
        }
    ]
}