{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/01/20/data-and-design-driven-diplomacy/",
    "title": "Data and design-driven diplomacy",
    "authors": [
        "Anna Whicher"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2022-01-20T12:00:55+00:00",
    "content": [
        {
            "text": "The Foreign, Commonwealth and Development Office (FCDO) has a worldwide network of over 280 embassies and consulates. FCDO is responsible for foreign and development policy – safeguarding the UK’s national security by countering terrorism and working to reduce conflict; building the UK’s prosperity by increasing exports, investment and sustainable growth; and supporting British nationals around the world through digital and efficient consular services."
        },
        {
            "text": "There is a major drive in FCDO towards ‘data-driven diplomacy’ and enhancing the use of data for strategic decision-making. Of course, data comes in many forms. There is a preponderance that data-driven diplomacy means empirical evidence. In addition to statistical evidence, FCDO Labs is seeking to complement this type of evidence with user insights. User insights, derived from user-centred design, is only beginning to be recognised as evidence by policy, strategy and diplomatic teams. The Information and Digital Directorate is seeking to introduce more digital, agile and user-centred ways of working across FCDO. And FCDO Labs is very much part of this. FCDO Labs is working on a portfolio of projects bringing strategy and delivery together."
        },
        {
            "text": "FCDO Labs is a design and innovation team bringing agile, user-centred and iterative approaches to FCDO ways of working. The team was established in 2017 and a few years on, seeks to build a global network of good practices with a footprint across a growing number of overseas locations."
        },
        {
            "text": "The Information and Digital Directorate’s Business Plan for 2021-2022 sets the ambition for:"
        },
        {
            "text": "A central component of this is transforming the FCDO into a digitally mature organisation ensuring that colleagues have the skills, tools and mindset they need to deliver impact. This will require enhancing our DDaT capability and raising the bar among wider FCDO on future DDaT skills particularly data and design-driven diplomacy. As such, FCDO Labs is undertaking a number of interventions to extend digital, data and design skills among colleagues and to co-create a series of enabling factors to achieve the above ambition over the coming years."
        },
        {
            "text": "One of the ways in which Labs is contributing to this is ‘learning by doing’ since user-centred design is best embedded as an experiential process. Using design methods, Labs is introducing experimentation, iteration and co-creation to a variety of teams across the FCDO network. For example, Labs has been working on iteratively building an accurate and user-friendly UK Sanctions List. Prior to Brexit, the UK subscribed to the EU Sanctions List but now has the power to enforce its own list in line with its own foreign policy decisions. FCDO Labs has worked with the Sanctions Team in 2020 and 2021 to produce a number of iterations of the UK Sanctions List in response to various user needs. The main users of the list are UK financial institutions, HM Treasury and Border Force. They need user-friendly data, optimised for automation, to screen for people, entities and ships who are designated under the Sanctions and Anti-Money Laundering Act in order to impose sanctions such as asset-freezes, travel bans or other measures. There are more than 2,000 entries on the UK Sanctions List."
        },
        {
            "text": "With greater control over our sanctions list, there was an opportunity to ensure that the usability of the list better responded to user needs. Labs has conducted a series of Discoveries on various iterations of the UK Sanctions List using design techniques probably very familiar to many but which were new for the Sanctions Team including stakeholder mapping, user interviews, user journey mapping, challenge framing,  ideation and prototyping. What these techniques all have in common is exploring the user perspective of the experience in order to align it with business and legal requirements. By building layer upon layer of evidence from user insight, Labs and the Sanctions Team have uncovered latent and unknown user needs and begun to build capacity for these user-centred approaches within the Sanctions Team. The impact for the Sanctions Team has been a much stronger, more transparent and collaborative relationship with key users and stakeholders with anticipated future impact being fewer clarification enquiries and fewer legal challenges as the list continues to evolve."
        },
        {
            "text": "For more information on FCDO foreign and development policy visit FCDO blogs."
        }
    ]
}