{
    "url": "https://dragonsden.blog.gov.uk/2022/01/20/dragons-den-episode-3-series-19/",
    "title": "Dragons' Den, Episode 3, Series 19",
    "authors": [
        "Amy Price"
    ],
    "categories": [
        "Copyright",
        "Designs",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-01-20T21:21:49+00:00",
    "content": [
        {
            "text": "There was a strong food-based theme cooking in the Den this week...but which inventions whetted the Dragons’ appetites for investment?"
        },
        {
            "text": "It’s episode 3 in this series of Dragons’ Den and it’s my turn to blog again…three years to the week since I wrote my very first one!"
        },
        {
            "text": "I was new to working at the Intellectual Property Office back then. I remember calling upon colleagues to check my facts, as I explored the intellectual property (IP) within each of the Dragons’ Den pitches."
        },
        {
            "text": "Since 2019, I’ve spoken to thousands of entrepreneurs about their businesses, brands and products, whether face to face or (more usual these days) virtually. Helping people to understand and maximise the IP within their business will always be something I find interesting and worthwhile."
        },
        {
            "text": "On our screens tonight were five pairs of enthusiastic entrepreneurs, each with a passion for what they do – but did they understand how to protect their assets?"
        },
        {
            "text": "Doorstep deliveries get personal"
        },
        {
            "text": "Looking for £50,000 in return for 8% of their business, Zak & Aaron presented their on-demand delivery app, ‘Delivr Me’."
        },
        {
            "text": "With the ever-growing call for doorstep deliveries, the Birmingham-based pair claimed that their pre-paid payment card set them aside from their competitors. But there was no mention of IP protection for their personal shopper app. This is a commonly asked question and although you can’t protect your concept or idea, it is possible to protect elements of your online business:"
        },
        {
            "text": "Copyright – Your app/website content is automatically protected by UK law. Source code, images, text…they’re all yours if you created them and can’t legally be copied or used without your permission."
        },
        {
            "text": "Trade Marks – Every business owns IP and if your business has a name (I’m guessing that’s likely!) then you have a Trade Mark. If you choose to register it with us, you could have the monopoly over that name, within your chosen categories of goods or services. We call these classifications."
        },
        {
            "text": "Patents – If your business includes an invention of something new or novel, you may wish to patent that. For apps like ‘Delivr Me’, if there is originality within the functionality of the application, it could be patentable. This can all get very technical and so seeking the advice of an IP attorney is always a good idea if you’re thinking to apply for patent protection."
        },
        {
            "text": "Back in the Den…none of the Dragons chose to invest in the delivery app duo. While Peter worried about the business model, the others offered some friendly advice as they declared themselves out."
        },
        {
            "text": "A recipe for success"
        },
        {
            "text": "Last through the iconic elevator doors were Karen and Andy. Or should I say ‘Kandy’. Partners in life and business, the husband-and-wife team launched ‘Kandy Kitchen Creations LTD’ in 2017. Offering a variety of twenty soups, stews and risottos in what Peter referred to as ‘food tubes’, the couple wanted £50,000 for a 20% stake."
        },
        {
            "text": "Peter made a proposition – if another Dragon were to join him, he’d offer half of the money for 16.75% equity to become equal shareholders."
        },
        {
            "text": "Sara was first to declare out, followed by new Dragon Steven Bartlett who was worried about how the product looked. He felt that the packaging could easily be replicated."
        },
        {
            "text": "One way to protect the aesthetics of your product and, potentially, stop others using its look, is to register your design."
        },
        {
            "text": "Some design protection is automatic here in the UK though. As with any form of intellectual property, a design is a valuable asset which can be bought, sold and licenced."
        },
        {
            "text": "Deborah agreed to go halves with Peter, but Touker went one better and offered to split three ways for 11% each…and the three Dragons sealed the deal on the ready-made meal kits."
        },
        {
            "text": "If you own a business and you don’t have an IP strategy, have a look at our free resources or speak to your local business adviser. Why not come along, whether in person or virtually, to one of our events to find out more?"
        },
        {
            "text": "Meanwhile, we wish all of tonight’s entrepreneurs and Dragons every success in their exciting ventures!"
        }
    ]
}