{
    "url": "https://educationhub.blog.gov.uk/2022/01/20/how-an-apprenticeship-can-help-you-become-a-nurse-or-midwife-without-needing-to-go-to-university/",
    "title": "How an apprenticeship can help you become a nurse or midwife",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2022-01-20T10:41:36+00:00",
    "content": [
        {
            "text": "The Education Secretary Nadhim Zahawi explains how an apprenticeship can help people become a nurse or midwife without needing to go to university."
        },
        {
            "text": "Last year this government rolled out a programme of mass-vaccination the like of which has never been seen before. It was my immense privilege to see this from the front line as Vaccines Minister."
        },
        {
            "text": "90% of students have received at least a first dose and, as we continue to roll out the booster programme, I urge any of those waiting to book in your next jab now."
        },
        {
            "text": "It was thanks to those coming forwards as well as the incredible scientists, our world-class vaccines taskforce and the wonderful people who work and volunteer for the NHS that we were able to pull this off."
        },
        {
            "text": "The NHS has responded magnificently to the pressures it has faced throughout the pandemic, with staff showing selfless compassion and dedication."
        },
        {
            "text": "Their example has inspired a whole generation. The report today from UCAS and Heath Education England has found that the pandemic inspired 69% of nursing applicants in 2021, with 1 in 10 of the next generation of nurses stating this was the most important factor for them."
        },
        {
            "text": "As Education Secretary it gives me enormous personal pride to see that young people are now applying to do nursing degrees in record numbers. We set a target of 50,000 more nurses by the end of this parliament – the biggest recruitment drive in decades and thanks to young people we’re well on the way to meeting our goals."
        },
        {
            "text": "Last year alone the number of applications for nursing and midwifery courses in England increased by 24%, with 30,000 students successful and accepted to places on undergraduate nursing and midwifery courses in England. That figure is the highest total ever since records began."
        },
        {
            "text": "But degrees are not the only option for those who want to take up a career in the health service. We are transforming the ways that people get trained or upskilled throughout their lives in the biggest skills reboot in a generation. Aspiring nurses and midwives now have a number of other high-quality routes into the profession including a degree apprenticeship in nursing or a nursing associate apprenticeship offering a good career and also the chance to progress further."
        },
        {
            "text": "For nursing associates who are already experienced, trying to get a degree or learn new skills has, in the past, been too hard. For these professionals who bridge the gap between health and care assistants and registered nurses it would have meant a drop in salary or trying to fit studying around a demanding full-time job."
        },
        {
            "text": "Our nursing apprenticeships offer the chance to stay in work, while learning new skills that will count towards full qualification. Apprenticeships are flexible and take into account skills that people may already have."
        },
        {
            "text": "We have also worked with colleges and employers to develop the first-ever occupational traineeships for health and science, and other sectors where there is a high demand for skilled workers. These will help even more people prepare for a worthwhile career."
        },
        {
            "text": "Anyone over the age of 24 who has no A levels can still apply for a free course on our courses for jobs scheme. There are over 400 free courses including health and social care to help more adults gain the skills they need to boost their career prospects. From April this offer will be open to any adult, whatever their academic qualifications, if they are earning less than the National Living Wage or are unemployed."
        },
        {
            "text": "For eligible students who want to take a degree there’s a new, non-repayable, training grant of at least £5,000 per academic year. And for those with children or who want to study a specialism where there are shortages, there’s a further top up of up to £3,000."
        },
        {
            "text": "For those that are considering studying for a nursing degree this year, the UCAS deadline for undergraduate courses for is on Wednesday the 26 January."
        },
        {
            "text": "I know there will be so many more people who have been inspired by the incredible work of the doctors and nurses who have been caring for us all throughout the pandemic. Let us use their example to inspire the next generation."
        }
    ]
}