{
    "url": "https://insidedio.blog.gov.uk/2022/01/20/storm-arwen-from-devastation-to-woodland-regeneration/",
    "title": "Storm Arwen: from devastation to woodland regeneration",
    "authors": [
        "Judith Peachey"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Forestry"
    ],
    "pub_date": "2022-01-20T15:59:20+00:00",
    "content": [
        {
            "text": "Hello, I’m Judith Peachey, Forestry Harvesting and Arboriculture Manager at Landmarc Support Services. We work with DIO to manage land and facilities across the MOD’s 190,000 hectares of UK training estate, and my job has a focus on long term forestry management, biosecurity and plant health across the range of woodlands this encompasses."
        },
        {
            "text": "A major challenge we are faced with currently is dealing with the devastation caused to areas of the Defence Training Estate (DTE) by Storm Arwen at the end of 2021. The north east was worst affected, with gales of up to 100mph causing widespread damage and the most severe disruption to power supplies since 2005. Sadly, large areas of woodlands on the DTE were badly hit, with Otternburn Training Area in Northumberland suffering from around 20,000 windblown trees.  "
        },
        {
            "text": "I recently spent a week with Landmarc and DIO’s forestry teams in the north to assess the damage and plot our course of action to regenerate the woodlands affected.  "
        },
        {
            "heading": 2,
            "text": "The impact of Storm Arwen "
        },
        {
            "text": "Storm Arwen’s extreme winds caused a devastating loss of trees across several plantations on northern military training areas.  "
        },
        {
            "text": "On my visit to Otterburn, I saw first-hand how woodlands there have experienced the biggest loss, with an estimated 20,000 windblown trees – this equates to some 25,000 tonnes of timber that will take at least a year to clear. The damage was spread across all the training area’s ranges, some of which had to be made out of bounds to protect the health and safety of users. Thankfully, though, Landmarc and DIO teams were able to ensure that other areas remained safe and open for military training. "
        },
        {
            "text": "The scale of work to clear windblown and fallen trees is considerable, covering an area of 6,000 hectares. We are working with the DIO forestry team on a rolling clearance programme, with priority given to the safe clearance of dangerously leaning trees which pose a threat to nearby properties."
        },
        {
            "text": "In addition, the access track to the radio mast within Carshope plantation, on Otterburn Training Area, was cleared as a priority to ensure that vital military and emergency services communications could continue. Our contractor, A & R Brownlie Ltd, completed this work before commencing the large scale clearance across the plantations. "
        },
        {
            "heading": 2,
            "text": "The importance of clearing windblown trees "
        },
        {
            "text": "Windblown trees are especially hazardous because as well as being unstable, they could contain suspended debris or be tangled up in other trees. There is also an added danger that power lines, phone cables, water and gas mains could have been affected by fallen or damaged trees.  "
        },
        {
            "text": "We are fortunate to have skilled and experienced rural teams who have already done an amazing job to get tracks, fence lines and access routes cleared as quickly as possible to minimise disruption to military training at locations including Otterburn, Warcop and Wathgill. This work will continue over the course of the year to ensure that all remaining areas of windblown trees are safely cleared while military training continues. Once cleared, we should be able to recover a large percentage of the fallen timber to dispatch to local sawmills for processing.  "
        },
        {
            "heading": 2,
            "text": "Re-generating the woodlands "
        },
        {
            "text": "While the immediate impact of Storm Arwen has been devastating, from a longer-term forestry perspective we have been given an opportunity to re-structure the affected woodlands. This will allow us to make them more resilient, not only to climate change but also pests and diseases, which are a real threat at present. In addition, we’ll be able to adapt and re-design the woodland layouts to make them more flexible to military training needs. "
        },
        {
            "text": "By changing the mix of tree species during planting and using a larger number of species that are more resilient, the threat posed by future catastrophic weather events will be lessened. Pests and diseases will always represent a threat, increased by warmer temperatures brought about by climate change, but by planting a mix of species we’ll reduce the risk of losing whole planted areas. "
        },
        {
            "text": "We will begin this replanting over the winter of 2022/2023 in the areas which we are clearing over the course of this year. I look forward to the challenge ahead, which will see us working together with the military and DIO forestry teams on new plantation designs to give our northern woodlands the most resilient future possible."
        }
    ]
}