{
    "url": "https://educationhub.blog.gov.uk/2022/01/why-its-important-for-eligible-parents-and-families-of-primary-age-pupils-to-get-boosted-now/",
    "title": "Why it’s important for eligible parents and families of primary age pupils to Get Boosted Now ",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2022-01-20T16:59:09+00:00",
    "content": [
        {
            "text": "Protecting face to face education and minimising disruption in schools due to COVID-19 and its variants is our number one priority."
        },
        {
            "text": "The single most effective measure we have to minimise the spread of the virus and therefore the disruption it causes is vaccination."
        },
        {
            "text": "Making sure you are vaccinated and have had your booster if you’re eligible is vitally important as vaccinated people are far less likely to get symptomatic COVID-19 and even more unlikely to experience serious symptoms to be admitted to hospital, or to die from it.  There is also evidence that those who are vaccinated are less likely to pass the virus on to others."
        },
        {
            "text": "This is especially important for parents and families of children under 12 years old who aren’t eligible for vaccination themselves because if we are able to reduce the spread of the virus among those that under 12s are close to, we reduce the risk of them catching the virus and bringing it into school."
        },
        {
            "text": "UK Health Security Agency data shows that your protection against symptomatic infection from the Omicron variant of COVID-19 increases by as much as 70% within 14 days of a booster vaccination. "
        },
        {
            "text": "It is vital that people who haven’t already had or booked their booster jabs arrange to Get Boosted Now in order to protect themselves from the virus and to help minimise disruption in schools, colleges and early years providers."
        }
    ]
}