{
    "url": "https://defrafarming.blog.gov.uk/2025/12/15/adopt-first-projects-selected-as-next-round-opens/",
    "title": "ADOPT: first projects selected as next round opens",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2025-12-15T10:52:39+00:00",
    "content": [
        {
            "text": "In April, we launched the first round of the Accelerating Development of Practices and Technologies (ADOPT) fund.  "
        },
        {
            "text": "Grants offered through ADOPT support farmer-led on-farm trials to develop and test new solutions to farming challenges. The results of these trials will be shared so you can see if any of the solutions can work on your farm. "
        },
        {
            "text": "The fund is part of the Farming Innovation Programme, and delivered in partnership with Innovate UK. "
        },
        {
            "text": "With the next round (the fifth) now open, we share a recap of the funding available and shine a light on some projects from the first round to inspire you to apply. "
        },
        {
            "heading": 2,
            "text": "About the fund"
        },
        {
            "text": "Through ADOPT, two grants are available. "
        },
        {
            "heading": 3,
            "text": "The Full ADOPT Grant "
        },
        {
            "text": "If you have an idea for an on-farm trial, you can apply for funding to support on-farm trial and demonstration projects to improve adoption of new ideas or solutions in the agricultural sector.  "
        },
        {
            "text": "Your project’s total costs must be between £50,000 and £100,000.   "
        },
        {
            "heading": 3,
            "text": "The Facilitator Grant "
        },
        {
            "text": "Facilitator grants are for applicants who are new to the grants process. "
        },
        {
            "text": "They provide up to £2,500 for a farmer, grower, or forester in England to hire an external project facilitator. "
        },
        {
            "text": "These project facilitators will help prepare an application for the full ADOPT Grant."
        },
        {
            "text": "You do not need to apply for a Facilitator Grant to apply for a Full Grant. "
        },
        {
            "heading": 2,
            "text": "Support Hub "
        },
        {
            "text": "The ADOPT Support Hub is designed to support farmers to get the most out of this grant by:  "
        },
        {
            "text": "It's delivered by ADAS, UK Agri-Tech Centre and The Soil Association. If you have further questions, whether you are exploring an idea, preparing to apply or running a funded project, do make use of the hub. "
        },
        {
            "text": "Learn more about the support hub and how to apply. "
        },
        {
            "heading": 2,
            "text": "Farmer-led innovation"
        },
        {
            "text": "Over the past year, through 5 rounds, we’ve seen some fascinating ideas come forward. The first are now beginning to take shape and are being tested on farms across England. "
        },
        {
            "text": "By supporting trials on working farms, these projects will help demonstrate to all farmers the best ways to boost their own productivity, helping to make farms more resilient and profitable. "
        },
        {
            "heading": 3,
            "text": "Exploring a brighter future for carrots with UV-C light"
        },
        {
            "text": "Carrot growers face major challenges from foliar diseases like Alternaria leaf blight, as well as significant post-harvest losses during storage. "
        },
        {
            "text": "These pressures result in heavy use of chemical fungicides which, in turn, come with crop quality and safety concerns, and contribute to rising input costs."
        },
        {
            "text": "The main trial is hosted by Huntapac Produce Ltd, one of the UK’s largest carrot and parsnip producers, farming 1,500 hectares across vertically integrated operations. Trial work will run at their Yorkshire base and across their wider cropping areas. "
        },
        {
            "text": "They are joined by R & A Molyneux Ltd, a collaborative farming partner running parallel large-scale trials to compare how UV-C performs under different agronomic conditions. "
        },
        {
            "text": "They will test UV-C light as a sustainable, non-chemical way to protect crops by killing fungal spores and triggering natural plant defences. Both growers will test the UV-C equipment within their own commercial production systems, ensuring results reflect real farming pressures and market requirements. "
        },
        {
            "text": "By comparing UV-C treatments with standard fungicides, they will see how well they control disease, improve root quality and work in practice, all with the aim of reducing pesticide use.  "
        },
        {
            "text": "Other project partners include Autonomous Agri Solutions (AAS), which is supplying the autonomous tractor and robotic platforms used to deliver the UV-C treatments, as well as providing engineering support, data collection, and operational expertise. "
        },
        {
            "text": "SRH Agribusiness Ltd is acting as the agronomy and advisory partner, helping to consolidate and interpret data and support wider dissemination. The project facilitator is Harry Parsons of SRH Agribusiness. "
        },
        {
            "text": "Learn more about this project."
        },
        {
            "heading": 3,
            "text": "Mastitis detection: rapid detection to slow antibiotic use"
        },
        {
            "text": "Mastitis remains one of the most costly and challenging diseases facing UK dairy farmers."
        },
        {
            "text": "Beyond reducing milk yield and quality, it leads to financial losses through lower productivity, penalties from processors, higher veterinary and treatment bills, and discarded milk during withdrawal periods. "
        },
        {
            "text": "Repeated or severe cases can also cause lasting udder damage, compromise cow welfare, push up culling and replacement rates—all adding to labour and management pressures. "
        },
        {
            "text": "Conventional diagnostics typically take around two days to return results, leaving farmers to rely on broad-spectrum antimicrobials as a precaution. While understandable, this approach is not always the most efficient or effective and contributes to broader antimicrobial resistance (AMR) concerns. "
        },
        {
            "text": "RapiPath is a next-generation on-farm diagnostic tool designed to identify mastitis-causing bacteria within 2 hours. This rapid turnaround has the potential to transform mastitis management by enabling targeted treatments, reducing unnecessary antibiotic use and supporting better outcomes for both cows and farmers. "
        },
        {
            "text": "RapiPath will be tested across real farm and veterinary settings to ensure the tool responds effectively to day-to-day pressures, from herd size and workflow to seasonal variation and milk quality demands.  "
        },
        {
            "text": "The trial is taking place on a farm in the North East. By comparing rapid diagnostics with current mastitis treatment approaches, the project will assess how well the technology supports disease control, improves decision-making and enhances sustainable milk production. "
        },
        {
            "text": "Learn more about this project."
        },
        {
            "heading": 3,
            "text": "AI-powered bird deterrent system"
        },
        {
            "text": "Bird damage, particularly from pigeons, is a major challenge for UK brassica and salad growers, causing significant crop losses, contamination, and increased costs for mitigation.  "
        },
        {
            "text": "A Lincolnshire-based brassica grower, T.H. Clements & Son Ltd, will lead this project. They are joined by Vitacress Salads Ltd who manage 300 hectares of salad crops and 20 hectares of watercress farms across Dorset, Hampshire, Wiltshire and Kent.  "
        },
        {
            "text": "They will both partner with B-Hive Innovations Ltd who have expertise in AI, computer vision, and hardware/software development for field applications. "
        },
        {
            "text": "Together they will test a new AI-powered bird deterrent system - S.C.A.R.E (Sensory Countermeasures for Avians using Repellents and Emissions).  "
        },
        {
            "text": "S.C.A.R.E combines computer vision detection with adaptive countermeasures (lasers, predator calls, and randomized white noise). It’s solar powered, remotely accessible, and designed to scare birds away without them getting used to it and without disturbing other wildlife.  "
        },
        {
            "text": "To monitor the effectiveness of S.C.A.R.E, the sites will use drone imagery for crop damage assessments and cameras for continuous observations. "
        },
        {
            "text": "The project will produce a final report with recommendations for commercial rollout. By reducing bird damage, the system should help farmers use less fertiliser, rely less on imports, and could increase yields by around 5–10% for brassicas and 20–25% for salad crops.   "
        },
        {
            "text": "Learn more about this project."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "For more case studies, visit the Support Hub."
        },
        {
            "text": "To stay up to date with the latest from the Farming and Countryside Programme, subscribe to the Farming blog. "
        }
    ]
}