{
    "url": "https://mhclgmedia.blog.gov.uk/2025/12/15/coverage-of-our-over-1-billion-investment-to-support-victims-of-domestic-abuse/",
    "title": "Coverage of our over £1 billion investment to support victims of domestic abuse",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Domestic abuse",
        "Housing"
    ],
    "pub_date": "2025-12-15T11:23:47+00:00",
    "content": [
        {
            "text": "There has been widespread national coverage of the government’s announcement which unveiled over £1 billion will be invested for victims of domestic abuse to access support and rebuild their lives."
        },
        {
            "text": "An extra £19 million will be invested under the Domestic Abuse Safe Accommodation Duty, meaning local authorities will receive nearly £500 million over the next three years to provide support in safe accommodation. The total funding is expected to help nearly 140,000 people, including women and their children. "
        },
        {
            "text": "As part of the announcement, the Ministry of Justice also reaffirmed that more than half a billion pounds is also being invested in vital support services to help domestic abuse victims and witnesses navigate the justice process, ensuring survivors receive the support they need at every stage. "
        },
        {
            "text": "National coverage can be seen in the Times, Mirror, Guardian, Independent, Express and PA who report that this funding is on top of £480 million already pledged over three years for victims of domestic abuse, including refuges."
        },
        {
            "text": "Elsewhere the Herald and Politico London Playbook outline the measures which local authorities will be able to provide includingaccess to housing or confidential locations, as well as security upgrades such as lock changes and alarms for people staying in their own home."
        },
        {
            "text": "This morning, Justice Minister, Alex Davies Jones also gave interviews to Times Radio, Sky, BBC Breakfast, LBC, ITV GMB, ITN, and GB News about the announcement."
        },
        {
            "text": "Homelessness Minister Alison McGovern said:  "
        },
        {
            "text": "“No one should have to choose between staying in an unsafe home or facing homelessness."
        },
        {
            "text": "“We’re treating violence against women and girls as a national emergency, with a clear commitment to halve it in the next decade."
        },
        {
            "text": "“This funding will help local authorities provide safe accommodation and tailored support, including refuges and Sanctuary Schemes, so every survivor can access safety, stability and a fresh start.”"
        },
        {
            "text": "Minister for Safeguarding and Violence Against Women and Girls, Jess Phillips, said:"
        },
        {
            "text": "“With government and society united, we can achieve our mission of halving violence against women and girls within a decade. That means bearing down on abusers but also giving survivors the support and resources they desperately need to rebuild their lives."
        },
        {
            "text": "“This funding will ensure victims remain safe while preventing their abusers from inflicting further unnecessary suffering.”"
        }
    ]
}