{
    "url": "https://food.blog.gov.uk/2025/12/15/future-food-regulation-and-healthy-food-sales/",
    "title": "Future Food Regulation and Healthy Food Sales",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-12-15T09:36:11+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "At the FSA’s Board meeting on Wednesday, the Chief Executive’s update to the Board highlighted the recent request from Government for the FSA to develop a new national approach to regulation for large food businesses in England. This will be part of a wider programme of reform, as discussed at previous board meetings, to ensure food regulation remains effective and fit for the future.  "
        },
        {
            "text": "FSA Chief Executive, Katie Pettifer, made clear that protecting public health must remain at the heart of everything the FSA does and any changes should benefit consumers. Katie pointed out that developing a new approach to regulating large national food businesses would be part of a wider set of improvements to the assurance system, which had been discussed with stakeholders over the past year. Local authorities play a vital role in supporting businesses and maintaining standards, and it was important that they could continue to do so in future. Board members expressed their support for this, having shadowed expert Environmental Health and Trading Standards Officers in Slough and Reading earlier in the week and observing how these physical inspections and support complement the proposals for strategic intelligence and data-led regulation.  "
        },
        {
            "text": "The Board welcomed the request from Government and the approach outlined by Katie. They reflected on the way the food industry continues to evolve, which requires a more tailored and agile approach to regulation. The Board emphasised that the FSA needs to work in partnership with local authorities and businesses to support growth and, above all, to make sure people continue to have food they can trust. They were clear that the FSA must continue engaging with partners across the sector – local authorities, businesses, and consumers – to inform the development of these proposals. "
        },
        {
            "text": "Board members highlighted that reforms must work for businesses of all sizes, combining robust data with on-the-ground checks to maintain confidence and protect public health. While the FSA has been asked to develop a new national approach for England only, the Board considered that there may be opportunities to align options for reform across Northern Ireland, Wales and Scotland, recognising the operating footprint of most of the larger businesses and asked FSA officials to explore this.  "
        },
        {
            "text": "Commenting after the FSA Board meeting, the Chartered Institute for Environmental Health said:  "
        },
        {
            "text": "“Environmental Health professionals work across local authorities and business to ensure the public can trust the safety of the food and drink they buy.  We welcome the Government budget announcement, and the FSA’s clear commitment to full engagement with its stakeholders at all stages of this work.  CIEH will work to ensure these opportunities enhance protection for the public.” "
        },
        {
            "text": "The Government has asked us to take on this role, but it’s the FSA Board’s job to scrutinise how it is done. Our job, set out in law, is to protect public health and to protect the interests of consumers.  We recognised at the Board meeting that doing this well – through proportionate and efficient regulation – is the best way in which we can also support economic growth. "
        },
        {
            "text": "In an additional item, I discussed with the Board a new request from the Department of Health and Social Care for the FSA to provide detailed advice on the policy development and implementation of the mandatory healthy food sales reporting and targets. These aim to increase the healthiness of sales by large food businesses, following a commitment in the NHS 10-year plan. Final decisions on the regulation of the scheme will be subject to consultation, but the Board welcomed the opportunity for the FSA to be involved in the design at this early stage. "
        },
        {
            "text": "You can watch the FSA Board’s discussions on this and all the other items on the agenda."
        },
        {
            "heading": 2,
            "text": "Rheoleiddio Bwyd yn y Dyfodol a Gwerthu Bwyd Iach"
        },
        {
            "text": "Yn ystod cyfarfod Bwrdd yr Asiantaeth Safonau Bwyd (ASB) ddydd Mercher, nododd diweddariad y Prif Weithredwr i’r Bwrdd fod y llywodraeth wedi gofyn i’r ASB ddatblygu dull cenedlaethol newydd o reoleiddio ar gyfer busnesau bwyd mawr yn Lloegr. Bydd hyn yn rhan o raglen ddiwygio ehangach, fel y trafodwyd mewn cyfarfodydd bwrdd blaenorol, er mwyn sicrhau bod y dull o reoleiddio bwyd yn parhau i fod yn effeithiol ac yn addas ar gyfer y dyfodol."
        },
        {
            "text": "Eglurodd Prif Weithredwr yr ASB, Katie Pettifer, fod yn rhaid i ddiogelwch iechyd y cyhoedd barhau wrth wraidd popeth y mae’r ASB yn ei wneud, ac y dylai unrhyw newidiadau fod o fudd i ddefnyddwyr. Nododd Katie y byddai datblygu dull newydd o reoleiddio busnesau bwyd cenedlaethol mawr yn rhan o set ehangach o welliannau i’r system sicrwydd, sydd wedi bod yn destun trafodaethau â rhanddeiliaid dros y flwyddyn ddiwethaf. Mae awdurdodau lleol yn chwarae rhan hanfodol wrth gefnogi busnesau a chynnal safonau, ac roedd yn bwysig eu bod yn gallu parhau i wneud hynny yn y dyfodol. Mynegodd aelodau’r Bwrdd eu cefnogaeth, a hynny ar ôl cysgodi Swyddogion Iechyd yr Amgylchedd a Safonau Masnach arbenigol yn Slough a Reading yn gynharach yn yr wythnos ac arsylwi sut mae arolygiadau ffisegol a chefnogaeth yn ategu’r cynigion ar gyfer cudd-wybodaeth strategol a rheoleiddio sy’n seiliedig ar ddata."
        },
        {
            "text": "Croesawodd y Bwrdd y cais gan y llywodraeth a’r dull a amlinellwyd gan Katie. Gwnaethon nhw fyfyrio ar y ffordd y mae’r diwydiant bwyd yn parhau i esblygu, sy’n gofyn am ddull wedi’i deilwra a mwy hyblyg tuag at reoleiddio. Pwysleisiodd y Bwrdd fod angen i’r ASB weithio mewn partneriaeth ag awdurdodau lleol a busnesau i gefnogi twf ac, yn anad dim, i sicrhau bod pobl yn parhau i gael bwyd y gallant ymddiried ynddo. Roeddent yn glir bod yn rhaid i’r ASB barhau i ymgysylltu â phartneriaid ar draws y sector – awdurdodau lleol, busnesau a defnyddwyr – i ddatblygu’r cynigion hyn."
        },
        {
            "text": "Pwysleisiodd aelodau’r Bwrdd fod yn rhaid i’r diwygiadau weithio i fusnesau o bob maint, gan gyfuno data cadarn â gwiriadau ar y safle i gynnal hyder a diogelu iechyd y cyhoedd. Er mai datblygu dull cenedlaethol newydd ar gyfer Lloegr yn unig oedd gofyniad y cais i’r ASB,, ystyriodd y Bwrdd y gallai fod cyfleoedd i alinio opsiynau diwygio ar draws Cymru, Gogledd Iwerddon a’r Alban, gan gydnabod bod y rhan fwyaf o’r busnesau mawr yn gweithredu ar draws y DU. Gofynnwyd i swyddogion yr ASB edrych ar hyn ymhellach."
        },
        {
            "text": "Yn ei sylwadau ar ôl cyfarfod Bwrdd yr ASB, dywedodd Sefydliad Siartredig Iechyd yr Amgylchedd (CIEH):"
        },
        {
            "text": "“Mae gweithwyr proffesiynol Iechyd yr Amgylchedd yn gweithio ar draws awdurdodau lleol a busnesau i sicrhau y gall y cyhoedd ymddiried bod y bwyd a’r ddiod maen nhw’n eu prynu yn ddiogel. Rydym yn croesawu cyhoeddiad cyllideb y llywodraeth, ac ymrwymiad clir yr ASB i ymgysylltu’n llwyr â’i rhanddeiliaid ar bob cam o’r gwaith hwn. Bydd CIEH yn gweithio i sicrhau bod y cyfleoedd hyn yn gwella diogelwch i’r cyhoedd.”"
        },
        {
            "text": "Mae’r Llywodraeth wedi gofyn i ni ymgymryd â’r rôl hon, ond gwaith Bwrdd yr ASB fydd yn craffu’r broses. Ein gwaith, fel y nodir yn y gyfraith, yw diogelu iechyd y cyhoedd a buddiannau defnyddwyr. Yn ystod y cyfarfod, gwnaethom ni gydnabod mai gwneud hyn yn dda – drwy reoleiddio cymesur ac effeithlon – yw’r ffordd orau y gallwn ni hefyd gefnogi twf economaidd."
        },
        {
            "text": "Yn ychwanegol, trafodwyd y cais newydd gan yr Adran Iechyd a Gofal Cymdeithasol, yn gofyn i’r ASB ddarparu cyngor manwl ar ddatblygu polisi a gweithredu dulliau adrodd a thargedau gorfodol ar gyfer gwerthu bwyd iach. Nod y rhain yw gwella pa mor iach yw’r bwyd y mae busnesau bwyd mawr yn ei werthu, yn dilyn ymrwymiad yng nghynllun 10 mlynedd y GIG. Bydd penderfyniadau terfynol ar reoleiddio’r cynllun yn destun ymgynghoriad, ond croesawodd y Bwrdd y cyfle i’r ASB fod yn rhan o’r gwaith cynllunio ar y cam cynnar hwn."
        },
        {
            "text": "Gallwch wylio trafodaethau Bwrdd yr ASB ar hyn, yn ogystal â’r holl eitemau eraill ar yr agenda."
        }
    ]
}