{
    "url": "https://environmentagency.blog.gov.uk/2025/12/15/turning-science-into-action-how-were-delivering-water-data-for-englands-future/",
    "title": "Turning science into action: How we’re delivering water data for England’s future  ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "hydrometry",
        "Rivers",
        "Science",
        "telemetry",
        "Water Monitoring"
    ],
    "pub_date": "2025-12-15T15:21:06+00:00",
    "content": [
        {
            "text": "By Dr Robert Bradburne, Environment Agency Chief Scientist "
        },
        {
            "text": "Friday 12 December marked a significant moment for all of us who care about England’s rivers and streams. Today, we’re releasing our first set of analysis-ready water data under Defra’s Natural Capital and Ecosystem Assessment (NCEA) programme and I’m immensely proud of the work of hundreds of committed Environment Agency Staff that has got us to this point. We know England’s rivers are hugely valuable to us, but face considerable pressures, from pollution to climate change, and that’s precisely why building this evidence base matters. "
        },
        {
            "text": "Why? Because this isn’t just data we’re collecting. It’s the foundation for something potentially transformative: a truly representative national picture of river and stream health, built on a statistically balanced design.  This first data release is a major step towards the NCEA producing a complete baseline of our natural assets by 2029, which will underpin decisions that strengthen resilience for nature, people, and the economy. "
        },
        {
            "text": "We are at the start of the biggest investment from water companies in improving the water system that we have seen for many years, with £104bn being put into measures that could improve water quality over the next five years.  The Government has recently announced £500m will be spent with farmers on Landscape Recovery Schemes across the country, sparking considerable land use or management change across a number of catchments.  We’re planting trees faster now than we have for 20 years, and of course there will be more houses, and new industrial clusters in many places across the country. "
        },
        {
            "text": "What makes NCEA different? "
        },
        {
            "text": "The Natural Capital and Ecosystem Assessment (NCEA) is Defra’s largest single research and development programme. Its ambition is clear: that the national baseline of our natural assets, can ensure decisions and investments across government and society that impact our environment can be grounded in the best possible evidence. "
        },
        {
            "text": "The water component, delivered by the Environment Agency, is designed for national-scale insight. Using unbiased, spatially balanced sampling across rivers and small streams, it helps us understand England’s water environment as a whole - not just individual sites or local pressures. That matters because it gives us a clearer, fairer picture of how our rivers and streams are doing.  It enables us to see how the investments and changes we are making interact with drivers such as changing weather patterns and how this ultimately shapes the health and value of our waters. "
        },
        {
            "text": "How does this fit with existing monitoring? "
        },
        {
            "text": "It’s important to be clear: NCEA evidence does not replace regulatory monitoring such as that needed under The Water Environment (Water Framework Directive) (England and Wales) Regulations 2017 which remains the overarching statutory framework for assessing and managing much of the water environment, focusing on a cycle of river basin planning, programmes of measures, with monitoring targeted at assessing pressures and “at-risk” water bodies. "
        },
        {
            "text": "The NCEA is a separately funded research programme which complements this by fulfilling a different need. The NCEA tells us how the environment is doing at the national scale. For example, how the health and value of rivers and lakes and groundwaters is changing in response to broad scale changing pressures and management activities. Assessments done for the Water Environment (WFD) (England and Wales) Regulations 2017, support regulatory and planning actions at local and regional levels, and enable us to understand how those plans, actions and investments are supporting and improving the chemical and biological status of our waterbodies. Both are vital and, together with the variety of other data available, they give us a truly unique and powerful set of tools with which to understand our water environment.  "
        },
        {
            "text": "What we’re publishing now "
        },
        {
            "text": "This release includes analysis-ready datasets from the River Surveillance Network (RSN) and the Small Streams Network (SSN). It's an interim snapshot, a small subset of the planned survey, so it’s not the full picture yet. But it’s a major step forward, and it sets the stage for what’s to come. "
        },
        {
            "text": "Why this matters "
        },
        {
            "text": "Opening up NCEA data at this early stage is about transparency and openness, and I hope it will encourage discussion and innovation. It reflects the work of colleagues across field teams, labs, and analysis -combining traditional expertise with newer methods to raise the bar in environmental science. "
        },
        {
            "text": "It embodies our vision for science in the Environment Agency: evidence that is excellent, trusted, and applied to real-world decisions. This is science in action - making a difference for the places and people we serve. "
        },
        {
            "text": "Using the data in the right way "
        },
        {
            "text": "We know people will want to compare NCEA data with other datasets. I’m really pleased for people to explore the data, but a friendly caution: methodological differences can look like real-world change if you don’t account for them. That’s why we’re incorporating plain-English caveats, guidance on appropriate use, and reminders that these datasets are for national-scale inference - not site-level compliance decisions.  As we collect more data over the coming years you will be able to do more and more with it, and I am really looking forwards to hearing about new insights that are generated using it. "
        },
        {
            "text": "What comes next "
        },
        {
            "text": "This is just the start. Over the coming years, we’ll release more data across freshwater, groundwater, estuarine, and coastal networks - all part of building England’s national baseline. By pairing open data with clear contextual information, we’ll help everyone - from policymakers and practitioners to researchers and communities - to make better, more confident choices for England’s environment. "
        },
        {
            "text": "So, I encourage you all - explore the data, share your insights, and join us in shaping a resilient future for England’s rivers and streams. "
        },
        {
            "text": "To hear more from the NCEA programme on their other newly released datasets, read their latest blog. "
        }
    ]
}