{
    "url": "https://actuaries.blog.gov.uk/2026/01/09/gad-at-botswana-actuarial-symposium/",
    "title": "GAD at Botswana Actuarial Symposium",
    "authors": [
        "Dave Johnston - Policy and Assurance Director"
    ],
    "categories": [
        "Actuary",
        "Analysis"
    ],
    "pub_date": "2026-01-09T12:15:38+00:00",
    "content": [
        {
            "text": "I recently had the pleasure of speaking at the inaugural Botswana Actuarial Symposium in the country’s capital, Gaborone."
        },
        {
            "text": "The symposium brought together Batswana actuaries, alongside a small number of international participants to explore the role actuaries could play in improving public policy in Botswana. "
        },
        {
            "text": "I welcomed the opportunity to reflect on how actuaries have supported UK policy, drawing on our history in the Government Actuary’s Department (GAD)."
        },
        {
            "heading": 2,
            "text": "Broad range of policy areas"
        },
        {
            "text": "I began by outlining our origins in the establishment of the National Insurance Fund in 1919, and how we broadened our advice to support pensions for a growing public service. "
        },
        {
            "text": "Today GAD’s actuaries contribute across a much broader range of policy areas, including climate risk, indemnity cover for clinical negligence, and providing independent quality assurance on the analytical evidence used in decision-making across government."
        },
        {
            "text": "Ahead of the event, I benefited from insight and background material provided by the British High Commission in Gaborone. It helped me to understand Botswana’s current fiscal environment, from headwinds to ambitions to grow into a more resilient economy. "
        },
        {
            "text": "Against that backdrop I focussed on similarities (and differences) between the UK and Botswana and consider what lessons actuaries in the UK might offer to local actuarial professionals."
        },
        {
            "text": "Botswana does not currently employ actuaries within its civil service, so I finished with my personal reflections on what makes an effective actuary in government:"
        },
        {
            "heading": 2,
            "text": "Opportunities for actuaries"
        },
        {
            "text": "Conversations during and after the symposium suggested there are significant opportunities for actuaries in Botswana to support decision-makers through professional, strategic advice on fiscal risk, underpinned by robust and reliable evidence and analysis. "
        },
        {
            "text": "I hope that some of the UK’s experience will help provide insight into how actuarial expertise can be deployed quickly and effectively."
        },
        {
            "text": "Personally, I was struck by how easy it was to deepen my understanding of Botswana simply by talking to those at the symposium. A handful of conversations, with plenty of open questions, gave me far more insight than I could have gained from my desk in London."
        },
        {
            "text": "I am also grateful for the generous hospitality of Mimi Moilwa, who organised the event with her team at Dima Actuaries, alongside the British High Commission in Gaborone. It was great to see UK officials at work on the other side of the globe."
        },
        {
            "text": "Finally, I will leave an image from my talk covering some of the areas of expertise GAD provides to the UK. "
        },
        {
            "text": "If you think there is expertise we could share, please contact us at enquiries@gad.gov.uk, or connect with me on LinkedIn."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The views expressed are the author’s own and the opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}