{
    "url": "https://space.blog.gov.uk/2025/10/08/celebrating-climate-innovation-during-world-space-week/",
    "title": "Celebrating climate innovation during World Space Week",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "Earth from space",
        "Earth observation"
    ],
    "pub_date": "2025-10-08T17:13:36+01:00",
    "content": [
        {
            "text": "As we mark World Space Week 2025, the UK Space Agency announces the launch of six new projects funded through our third Climate Services Call."
        },
        {
            "text": "These projects will use satellite data to tackle climate challenges in creative and practical ways, from monitoring woodland health to supporting sustainable aviation. "
        },
        {
            "text": "This year’s World Space Week theme, “Living in Space,” invites us to reflect on how space technologies are not only helping us explore beyond Earth, but also improving life here at home."
        },
        {
            "text": "With a combined investment of £380,000, the six projects demonstrate how satellite data can be transformed into practical tools that support sustainable living, whether through better forest monitoring, or more reliable carbon measurement in woodland and seagrass."
        },
        {
            "text": "Earth Observation (EO) is also playing a vital role in driving economic growth, as the insights gained from satellite data fuel new industries, create skilled jobs, and unlock innovative business opportunities in the environmental and technology sectors. "
        },
        {
            "text": "One project, led by Edinburgh based New Gradient, is developing machine learning tools that use satellite and aerial data to measure the health and carbon value of woodlands."
        },
        {
            "text": "This will help landowners and investors understand the impact of tree planting and restoration projects, making it easier to fund and manage nature-based climate solutions. "
        },
        {
            "text": "Data Dynamics, working with Fangorn, is testing whether drones and satellite images can replace traditional forest surveys done on foot. "
        },
        {
            "text": "By combining high-tech imaging with artificial intelligence, they hope to create fast, accurate maps of individual trees. This could save time and money while improving forest management. "
        },
        {
            "text": "Treeconomy is tackling a key challenge for nature-based climate solutions: trust in carbon credits. "
        },
        {
            "text": "Their project, QUBIST, will pioneer a cutting-edge methodology integrating data from multiple satellites with advanced statistical models to robustly quantify and reduce uncertainty in forest carbon estimates."
        },
        {
            "text": "This approach will build investor confidence, make carbon credits more trustworthy, and support the UK’s growing market for nature-based climate solutions.   "
        },
        {
            "text": "In the aviation sector, Amelia Space Technologies is building a system that uses satellite data and artificial intelligence to track agricultural waste that can be turned into Sustainable Aviation Fuel (SAF)."
        },
        {
            "text": "This helps ensure the materials meet environmental standards, promotes a more circular economy, and supports the UK’s efforts to make flying greener. "
        },
        {
            "text": "2Excel’s woodland mapping initiative is exploring new types of satellites that can capture detailed images of woodland areas."
        },
        {
            "text": "These projects aim to go beyond simply mapping where trees are by assessing the overall condition of habitats. This includes spotting signs of stress, deadwood or invasive species, which are key indicators of biodiversity and carbon storage potential. "
        },
        {
            "text": "To support our oceans, Plastic-i’s Sequestra project is developing a UK-led satellite and AI tool to protect seagrass meadows – vital coastal habitats that store carbon and support marine life."
        },
        {
            "text": "By combining high-resolution satellite and drone data, Sequestra will detect damage from boat activity and estimate how much carbon is being stored or lost, supporting more sustainable marine management. "
        },
        {
            "text": "Together, these six projects show how space technology can help us understand and protect our natural environment."
        },
        {
            "text": "Living in space starts with learning how to live better on Earth."
        },
        {
            "text": "These projects show how satellite data can help us make smarter decisions about our environment, our resources and our future.  "
        }
    ]
}