{
    "url": "https://defradigital.blog.gov.uk/2025/10/08/how-do-you-assess-digital-services-for-sustainability/",
    "title": "How do you assess digital services for sustainability?",
    "authors": [
        "Ned Gartside"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Digital Sustainability"
    ],
    "pub_date": "2025-10-08T15:14:45+01:00",
    "content": [
        {
            "text": "Ned Gartside, Sustainable Design Lead, shares how Defra is testing an approach to assess and record how well digital services are managing their environmental and social impacts."
        },
        {
            "heading": 2,
            "text": "Defra’s strategic goals for sustainability"
        },
        {
            "text": "2025 is a big year for digital sustainability, with more and more people getting interested in how building greener services can save money and support the growing UK sustainable technology sector. We’ve seen this momentum building in my own Digital Sustainability team in Defra – for example in the expansion of our Government Digital Sustainability Alliance (GDSA) advisory group, and in the increasing collaboration we’re leading across government on this issue with things like the Government Buying Standards (GBS)."
        },
        {
            "text": "With so much happening and such an urgent issue there’s always a risk of unmanaged or duplicated effort, so within Defra we’ve been working on a new Digital Sustainability Strategy. This sets out our key objectives, which focus on decarbonization, circularity, water and material use, boosting social value, supply chain transparency and resilience to climate change."
        },
        {
            "text": "But we know strategies don’t mean anything unless they drive practical changes and outcomes, so we’re delighted Defra (with the sponsorship of our Director of Digital Delivery) is testing a way to ensure our digital services are as sustainable, efficient and circular as possible."
        },
        {
            "heading": 2,
            "text": "What are we doing with Defra digital projects?"
        },
        {
            "text": "Our approach is based on creating a digital sustainability standard which Defra group digital services need to meet at their service assessments (where they also need to demonstrate compliance with the overall Government Digital Service (GDS) Service Standard)."
        },
        {
            "text": "At present, these assessments cover things like usability, accessibility, privacy, security and reliability, so introducing sustainability puts it on a level with these established project priorities."
        },
        {
            "heading": 2,
            "text": "Our approach"
        },
        {
            "text": "We’re designing a process to support both service teams and those who will be assessing them. As well as the digital sustainability standard, the key parts of this process are:"
        },
        {
            "text": "We know sustainability is a new topic for most service teams, and it can be difficult for them to identify relevant sustainability actions, especially if these aren’t readily findable."
        },
        {
            "text": "For this reason, we’ve worked with experts across government and partners in the GDSA to develop the Greener Service Principles – a single repository of meaningful actions to deliver efficient, sustainable services."
        },
        {
            "heading": 2,
            "text": "Testing and learning"
        },
        {
            "text": "We’ve begun testing and gathering feedback on this process and the products above with services in Defra group at different stages of the agile lifecycle."
        },
        {
            "text": "In early 2026, we intend to integrate the digital sustainability standard into Defra service assessments as a non-binding element."
        },
        {
            "text": "From later in the spring of 2026, the plan is for the digital sustainability standard to become fully part of Defra service assessments as a 15th point."
        },
        {
            "heading": 2,
            "text": "Wider application"
        },
        {
            "text": "We’re really excited to pilot this approach within Defra group. As the lead department for sustainable IT across government, we work closely with GDS to embed digital sustainability into their cross-government guidance and strategies."
        },
        {
            "text": "We’re already working with GDS on some updates to the mandatory Service Standard and Service Manual, building on the best practice advice in our Greener Service Principles."
        },
        {
            "text": "From early 2026 we’ll be working with other departments to see how we could make the above approach repeatable across government more widely. We’ll also work with GDS on how to best reflect this within their products and guidance."
        },
        {
            "text": "The input of our cross-government steering group and GDSA will be vital in all this work, and we’re looking forward to finding out more and sharing updates on our progress."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}