{
    "url": "https://publicguardian.blog.gov.uk/2025/10/08/power-of-attorney-stories-jennie/",
    "title": "Power of Attorney Stories: Jennie",
    "authors": [
        "harryfortuna"
    ],
    "categories": [
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2025-10-08T10:00:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (also known as an LPA) is a legal document. It allows you to nominate someone you trust to step in and make decisions about your health and welfare and property and finance if you lack mental capacity to do so. "
        },
        {
            "text": "Jennie, 49, from Gloucestershire, has recently registered her LPA. When her stepmother lost capacity to make decisions for herself at a young age, Jennie became aware of the importance of planning for the future.  "
        },
        {
            "heading": 4,
            "text": "Here, Jennie tells us about her experiences with LPAs and why she believes it’s never too early to start a conversation about them:  "
        },
        {
            "text": "When people think about lasting power of attorney (LPA), they often imagine it’s something for later life, something you deal with when you’re retired or unwell. But I’ve learned, through my work and my own family’s experience, that it’s something we should all be thinking about much earlier. "
        },
        {
            "text": "As a former midwife and someone who worked closely with families through a child bereavement charity, I’ve seen the value of being prepared. Alongside a will and life insurance, having an LPA in place is one of the most thoughtful and practical things you can do — not just for yourself, but for the people you love. "
        },
        {
            "text": "My husband and I set up our LPAs last year when I was 48. We didn’t use a solicitor, although we had the support of my sister, who’d done hers professionally. It was straightforward and empowering. "
        },
        {
            "text": "For my own LPA, I chose three attorneys: my husband, my younger sister (who’s just had a baby herself), and my 18-year-old son. I waited until my son turned 18 so that I could include him. While I love and trust my husband and sister implicitly, I also know that life is unpredictable. I wanted to spread the responsibility across generations. Sharing the load is really important, because lots of people are willing to help. Having my son involved brings a layer of longevity and future-proofing to the decisions that might need to be made on my behalf. "
        },
        {
            "text": "I’m also an attorney for my husband, and for my sister which reinforces how much we trust each other as a family.  "
        },
        {
            "text": "My motivation for getting an LPA came from personal experience. In 2016, my stepmother, who was just 48 at the time, had a horse-riding accident that led to a brain injury. While the injury itself was being treated, doctors revealed to the family that she had a brain tumour, and within a short time she lost mental capacity. "
        },
        {
            "text": "She was American, with no family in the UK, and my father had already passed away. Her elderly mother, the only living named attorney on her LPA, had to fly over from America to help. It was a lesson in how crucial it is to think not just about who you want as an attorney, but who will realistically be able to help if and when that time comes. "
        },
        {
            "text": "Later, when my stepfather became unwell it was necessary to set up his LPA. Sadly, due to the time it takes to process, it came through the day after he died. It was a sharp reminder of how close we often cut these decisions, and how much smoother things can be if we act earlier. "
        },
        {
            "text": "I’m a horse rider. It’s a sport I love, but it’s one that carries risk. Life doesn’t always give us a warning before things change so my LPA gives me great peace of mind.  "
        },
        {
            "text": "It’s not always a comfortable conversation, but it’s one worth having. If you’re thinking it’s too early, it probably means it’s the perfect time. "
        },
        {
            "text": "Jennie is one of the many people across England and Wales who has made an LPA. It's never too early to talk about lasting powers of attorney with someone you trust. "
        },
        {
            "text": "Start a conversation today. "
        },
        {
            "text": "Find out more at https://powerofattorney.campaign.gov.uk/"
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Straeon Atwrneiaeth: Jennie"
        },
        {
            "text": "Mae Atwrneiaeth Arhosol (sydd hefyd yn cael ei galw’n LPA) yn ddogfen gyfreithiol. Mae’n eich galluogi i enwebu rhywun rydych chi’n ymddiried ynddo i gamu i mewn a gwneud penderfyniadau am eich iechyd a lles a’ch eiddo a materion ariannol, os nad oes gennych chi’r galluedd meddyliol i wneud hynny."
        },
        {
            "text": "Mae Jennie, 49 oed, o Swydd Gaerloyw, wedi cofrestru ei Hatwrneiaeth Arhosol yn ddiweddar. Pan gollodd ei llysfam y galluedd i wneud penderfyniadau drosti hi ei hun yn ifanc iawn, daeth Jennie yn ymwybodol o bwysigrwydd cynllunio ar gyfer y dyfodol."
        },
        {
            "heading": 4,
            "text": "Yma mae Jennie yn sôn am ei phrofiadau gydag atwrniaethau arhosol, a pham mae hi'n credu nad yw hi byth yn rhy gynnar i ddechrau siarad am hynny:"
        },
        {
            "text": "Pan fydd pobl yn meddwl am Atwrneiaeth Arhosol, maen nhw'n aml yn dychmygu mai rhywbeth i’w wneud yn nes ymlaen mewn bywyd yw hynny, rhywbeth i ddelio ag ef pan fyddwch chi wedi ymddeol neu'n sâl. Ond rydw i wedi dysgu, drwy fy ngwaith a drwy brofiad fy nheulu fy hun, ei fod yn rhywbeth y dylai pob un ohonom ei ystyried yn gynt o lawer."
        },
        {
            "text": "Fel cyn-fydwraig a rhywun a fu'n gweithio'n agos gyda theuluoedd drwy elusen profedigaeth plant, rydw i wedi gweld pa mor werthfawr yw paratoi. Ochr yn ochr ag ewyllys ac yswiriant bywyd, mae cael atwrneiaeth arhosol yn un o'r pethau mwyaf ystyriol ac ymarferol y gallwch chi ei wneud – nid dim ond i chi'ch hun, ond i'r bobl rydych chi'n eu caru hefyd."
        },
        {
            "text": "Mi wnaeth fy ngŵr a minnau drefnu ein hatwrniaethau arhosol y llynedd pan oeddwn i'n 48 oed. Wnaethon ni ddim defnyddio cyfreithiwr, ond fe gawson ni help gan fy chwaer a oedd wedi gwneud ei hatwrneiaeth arhosol hi gyda gweithiwr proffesiynol. Roedd yn broses syml, ac yn gwneud i mi deimlo bod gen i reolaeth dros fy mywyd."
        },
        {
            "text": "Ar gyfer fy atwrneiaeth arhosol fy hun, mi wnes i ddewis tri atwrnai: fy ngŵr, fy chwaer iau (sydd newydd gael babi ei hun), a fy mab 18 oed. Mi wnes i aros nes bod fy mab yn troi'n 18 oed er mwyn i mi allu ei gynnwys. Er fy mod i'n caru ac yn ymddiried yn llwyr yn fy ngŵr a fy chwaer, rydw i hefyd yn gwybod bod bywyd yn llawn troeon annisgwyl. Roeddwn i eisiau rhannu'r cyfrifoldeb rhwng y cenedlaethau. Mae’n bwysig iawn rhannu'r baich, oherwydd mae llawer o bobl yn barod i helpu. Mae cynnwys fy mab yn y broses yn ffordd o roi sicrwydd at y dyfodol ac yn dod ag elfen hirdymor i'r penderfyniadau y gallai fod angen eu gwneud ar fy rhan."
        },
        {
            "text": "Rydw i hefyd yn atwrnai i fy ngŵr, ac i fy chwaer hefyd – sy'n atgyfnerthu faint rydym ni'n ymddiried yn ein gilydd fel teulu."
        },
        {
            "text": "Roedd fy nghymhelliant i gael atwrneiaeth arhosol yn deillio o brofiad personol. Yn 2016 cafodd fy llysfam, a oedd ond yn 48 oed ar y pryd, ddamwain wrth farchogaeth a arweiniodd at anaf i'r ymennydd. Er bod yr anaf ei hun yn cael ei drin, datgelodd y meddygon wrth y teulu fod ganddi diwmor ar yr ymennydd, ac o fewn cyfnod byr fe gollodd alluedd meddyliol."
        },
        {
            "text": "Americanes oedd hi. Doedd ganddi ddim teulu yn y DU, ac roedd fy nhad eisoes wedi marw. Bu'n rhaid i'w mam oedrannus, yr unig atwrnai a enwyd ar ei hatwrneiaeth arhosol a oedd yn dal yn fyw, hedfan draw o America i helpu. Roedd yn esiampl o ba mor bwysig yw meddwl nid yn unig am bwy hoffech chi ei gael fel atwrnai, ond pwy yn realistig fydd yn gallu helpu os a phan ddaw'r amser."
        },
        {
            "text": "Pan aeth fy llystad yn sâl yn nes ymlaen, bu’n rhaid trefnu ei atwrneiaeth arhosol. Yn anffodus, oherwydd ei bod yn cymryd gymaint o amser i brosesu atwrneiaeth arhosol, cafodd ei chyhoeddi ddiwrnod ar ôl i fy llystad farw. Roedd yn wers anodd ynghylch pa mor hwyr rydym ni’n gwneud y penderfyniadau hyn yn aml iawn, a chymaint yn fwy hwylus y gall pethau fod os gwnawn ni weithredu'n gynt."
        },
        {
            "text": "Rydw i'n marchogaeth. Rydw i’n caru’r gamp, ond mae’n gallu bod yn beryglus. Dydy bywyd ddim bob amser yn rhoi rhybudd i ni cyn i bethau newid, felly mae fy atwrneiaeth arhosol yn rhoi tawelwch meddwl mawr i mi."
        },
        {
            "text": "Dydy hi ddim bob amser yn sgwrs gyfforddus, ond mae'n un sydd werth ei chael. Os ydych chi'n meddwl ei bod hi'n rhy gynnar, mae'n siŵr mai dyma’r amser delfrydol."
        },
        {
            "text": "Mae Jennie yn un o’r llu o bobl ledled Cymru a Lloegr sydd wedi gwneud atwrneiaeth arhosol. Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo."
        },
        {
            "text": "Dechreuwch sgwrs heddiw."
        },
        {
            "text": "Mae rhagor o wybodaeth ar gael yn https://powerofattorney.campaign.gov.uk/"
        }
    ]
}