{
    "url": "https://companieshouse.blog.gov.uk/2025/10/08/then-and-now-the-impact-of-the-economic-crime-and-corporate-transparency-act-on-companies-house/",
    "title": "Then and now: The impact of the Economic Crime and Corporate Transparency Act on Companies House ",
    "authors": [
        "Integrity and Enforcement Team"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2025-10-08T15:04:56+01:00",
    "content": [
        {
            "text": "In March 2024, the first reforms brought about by the Economic Crime and Corporate Transparency Act 2023 came into effect.  "
        },
        {
            "text": "These changes granted Companies House enhanced powers and marked a major shift in our capacity to tackle corporate abuse and fraud.  "
        },
        {
            "heading": 2,
            "text": "Before the Economic Crime and Corporate Transparency Act  "
        },
        {
            "text": "Before the act, company registration was enacted with a strong emphasis on trust.  "
        },
        {
            "text": "We generally accepted documents sent to us and placed them on the public register with limited verification, which meant there was less assurance over the accuracy of the information provided. "
        },
        {
            "text": "Identity checks were not required to be as robust as they’re today, and this made it possible for directors and people with significant control (PSCs) to cover their tracks through the use of PO boxes. They may also have provided details that were intentionally misleading to make sure they would be difficult to authenticate. "
        },
        {
            "text": "We were less equipped to act on false, incomplete or misleading information. We were more constrained, and correcting the register was a timely and inefficient process.  "
        },
        {
            "text": "Enforcement action was far less common, and our approach was mostly reactive rather than proactive. These circumstances allowed for the register’s weaknesses to be exploited. This led to a rise in shell companies, the misuse of legitimate names and a greater ability for criminal enterprises to obscure ownership details. "
        },
        {
            "heading": 2,
            "text": "A new chapter in company regulation"
        },
        {
            "text": "We’ve now been given a wider set of tools to strengthen the accuracy and reliability of the register. "
        },
        {
            "text": "We can now query or reject filings if the information provided appears to be incomplete, inaccurate or misleading. We can ask for changes before we accept records. We can remove false or incorrect entries more quickly than before, without always needing an external complaint. "
        },
        {
            "text": "Identity requirements have also been improved. Directors and PSCs will now need to verify their identity and companies must provide an appropriate registered office address. When a new company is formed, it must also confirm that it’s being created for a lawful purpose, and this statement is repeated in annual filings. "
        },
        {
            "text": "Companies House now has a broader range of options to encourage compliance. These include fines, annotations on the register, and where necessary, company strike-off action. We now have dedicated teams working with law enforcement to make sure that issues can be identified and addressed at the earliest possible stage. "
        },
        {
            "heading": 2,
            "text": "Changes in action"
        },
        {
            "heading": 3,
            "text": "Company name abuse"
        },
        {
            "text": "Then - Companies House had limited powers to combat misleading company names being registered. "
        },
        {
            "text": "Now - Companies House can reject names at incorporation, require changes, and annotate or remove records. "
        },
        {
            "text": "Companies House investigated a number of cloned restaurant companies in 2024, targeting 786 incorporations flagging suspicious applications and removing 965 companies and 2,895 fraudulent appointments. "
        },
        {
            "heading": 3,
            "text": "False information"
        },
        {
            "text": "Then - Incorrect or incomplete entries could remain on the register for long periods, with challenges often needing external complaints or lengthy legal processes."
        },
        {
            "text": "Now - Companies House proactively removes false entries, verifies identities and applies sanctions. The focus has shifted from passive record-keeping to ongoing verification. "
        },
        {
            "text": "Between 4 March 2024 and 3 March 2025, we queried and removed false or misleading information affecting 100,400 companies and rejected over 10,200 suspicious applications. "
        },
        {
            "heading": 3,
            "text": "Identity and addresses"
        },
        {
            "text": "Then - Use of PO boxes or non-traceable addresses was common and PSCs and directors could avoid identity confirmation. "
        },
        {
            "text": "Now - Companies must provide appropriate office addresses, and the identities of directors and PSCs can now be subject to verification requirements, with stronger checks on the legitimacy of submitted information. "
        },
        {
            "text": "Since March 2024, false entries have been removed across 82,600 registered office addresses, 66,900 officer addresses and 55,100 PSC addresses. "
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "Since the act received royal assent in October 2023, we've made great progress. We’ve moved from being a passive collector of information to an active guardian of corporate transparency.  "
        },
        {
            "text": "Many of the provisions under the act are still being rolled out. We’re continuing to strengthen the integrity of our identity verification systems and we’re expanding our workforce to make sure we can carry out timely and effective action at proportionate scale. "
        },
        {
            "text": "Together, we're strengthening the UK’s company register and helping to build a more transparent and trustworthy business environment. "
        },
        {
            "text": "Read more on our changes to UK company law website.  "
        }
    ]
}