{
    "url": "https://accessibility.blog.gov.uk/2022/02/15/accessible-by-default-at-the-food-standards-agency/",
    "title": "Accessible by default at the Food Standards Agency",
    "authors": [
        "Samantha Merrett, Accessibility Lead, Food Standards Agency"
    ],
    "categories": [
        "Accessibility",
        "Accessibility Regulations"
    ],
    "pub_date": "2022-02-15T10:00:21+00:00",
    "content": [
        {
            "text": "Setting the course to becoming a much more inclusive organisation, the Food Standards Agency’s Accessibility Lead, Samantha Merrett, discusses her approach to improving awareness of accessibility and ensuring the organisation is pioneering the way."
        },
        {
            "heading": 2,
            "text": "Where it all started"
        },
        {
            "text": "The Public Sector Bodies Accessibility Regulations 2018 sparked action across government departments to make our websites more accessible. Considering the impact of COVID-19 and the fact that 1 in 5 people have a disability, digital accessibility feels more important than ever."
        },
        {
            "text": "At the Food Standards Agency (FSA), like many government departments, we completed a significant amount of work in the run-up to the September 2020 deadline to make sure our external website (food.gov.uk) met the required standard. However, we feel that just complying with the Web Content Accessibility Guidelines does not go far enough. To be truly accessible, you need to put user needs at the heart of your approach."
        },
        {
            "text": "As part of the evolving work in this space we’ve developed an ‘accessible-by-default’ strategy that underpins our objectives and ambitions and, crucially, keeps our users front and centre of any decisions we make."
        },
        {
            "heading": 2,
            "text": "The strategy"
        },
        {
            "text": "We approached this work in four main themes:"
        },
        {
            "heading": 3,
            "text": "Our workflows"
        },
        {
            "text": "The aim of the ‘workflow’ strand is to build greater accountability for creating accessible content into our production processes and planning. It is about emphasising that it shouldn’t be the responsibility of just one team to make content accessible - it is the responsibility of everyone involved in the production cycle, whether that’s the supplier, content creator, editor or publisher. We have built in processes where myself and other content managers in the communications team are involved in the production cycle from the beginning. This allows us to inform and educate people on accessibility throughout the process. We will continue to do this until we are sure that all those involved have the knowledge and confidence they need to produce accessible content."
        },
        {
            "heading": 3,
            "text": "Our capability"
        },
        {
            "text": "The ‘capability’ strand focuses on building resilience through training and access to guidance material. We have identified gaps in staff knowledge and we have started to run training sessions to target these areas. An important part of this workstream is building staff advocacy by creating a network of staff champions who run basic accessibility checks and engage with their own teams and the wider organisation. We also have a digital knowledge hub with access to guidance, information, videos, and other material to support and educate staff."
        },
        {
            "heading": 3,
            "text": "Our content"
        },
        {
            "text": "The ‘content’ strand is quite simple. This is about auditing the content we already have published online and updating it and/or converting into HTML. Our focus is on becoming HTML-first and reducing the production of PDFs. This is not an easy task. Publishing PDF documents has been the standard for a long time and it is difficult to tackle in such a large, science-driven organisation. We will also establish standardised accessibility quality checks, so we know that any new published content is good quality and accessible."
        },
        {
            "heading": 3,
            "text": "Our platforms"
        },
        {
            "text": "Lastly, the ‘platforms’ strand focuses on providing advice to FSA platform owners. We have several subdomains that require support and we have a mentoring relationship with these platform owners. We want to encourage them to carry out regular audits and update their accessibility statements appropriately. This also applies to our social media channels. One of our additional focuses for 2022 is to make sure all of our output across our social platforms is accessible."
        },
        {
            "text": "We also work with a number of third party and external agencies, so it is important to take them on the journey with us. Everyone needs to understand their responsibility and why it is so important to achieve a successful outcome."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "So where are we now? We have just launched our internal communications campaign to raise awareness of the importance of this change and have already run 10 training sessions this month."
        },
        {
            "text": "We have senior leadership behind the initiative and accessibility clinics that run every week to target specific problem areas identified by staff."
        },
        {
            "text": "We are developing our website to continue to iterate and evolve the platform and we are designing new accessible templates that cover everything from science reports to campaign pages."
        },
        {
            "text": "Finally, as part of any good content management system, we are continually reviewing, auditing and amending existing content to ensure it complies with standards."
        },
        {
            "text": "We still have a long way to go. For example, over 100 pages need converting into HTML and this will require significant resources. We are working through these issues and I suspect there will be more along the way. This is a learning process and we will adapt and evolve with it."
        },
        {
            "text": "I hope by sharing the FSA story we might be able to encourage other digital communicators to consider whether a HTML-first future is possible in their department or organisation. Or at least how they can strive to work towards this."
        },
        {
            "text": "Sometimes you have to be the catalyst. It might be challenging at points, but I would argue it is worth doing. I always like to remember the saying ‘nothing changes, if nothing changes’."
        }
    ]
}