{
    "url": "https://defrafarming.blog.gov.uk/2022/02/15/co-design-in-2022-reflections-plans-and-principles/",
    "title": "Co-design in 2022: reflections, plans and principles",
    "authors": [
        "Neville Cavendish",
        "Aditi Arora",
        "The Co-design Team"
    ],
    "categories": [
        "Future Farming and Countryside Programme"
    ],
    "pub_date": "2022-02-15T14:58:45+00:00",
    "content": [
        {
            "text": "More than 4,000 people from across the farming community in England are now working with us to design, pilot, test and trial new farming policies and schemes.  "
        },
        {
            "text": "In this post, we’ll explain how we’re working with the farming community. We'll also share the 7 co-design principles we’re encouraging groups to follow.  "
        },
        {
            "heading": 2,
            "text": "Our work in 2021 "
        },
        {
            "text": "Last year’s work has given us a much better understanding of what people expect from us. "
        },
        {
            "text": "In September 2021, we published a blog post about what we learned when we undertook co-design at agricultural shows. "
        },
        {
            "text": "Since then, we have been working to address the feedback from the farming community on: "
        },
        {
            "text": "The feedback and lessons we've learned have not only helped us to shape policy, but 7 new co-design principles. "
        },
        {
            "text": "The principles, which we will share below, act as a standard for people to follow. They exist to show: "
        },
        {
            "text": "These principles will help us to make sure that co-design is applied consistently, whatever area we’re working on. "
        },
        {
            "heading": 2,
            "text": "Our co-design principles"
        },
        {
            "heading": 3,
            "text": "1.Understand the scope"
        },
        {
            "text": "Clearly set out the problem that needs to be addressed through a policy or scheme change. Agree with those participating in co-design what we can change, taking government commitments into account. "
        },
        {
            "heading": 3,
            "text": "2. Have a wide view of the problem space"
        },
        {
            "text": "We need to work with everyone, not just in the farming community, to make sure we understand the impact of any policy changes across the whole system. For example: supermarkets, academics, and water companies."
        },
        {
            "heading": 3,
            "text": "3. Share power"
        },
        {
            "text": "People need to feel confident their voice is being heard. They need know they are helping to influence our policy and service design decisions. "
        },
        {
            "heading": 3,
            "text": "4. Build trusting relationships"
        },
        {
            "text": "Take the time to engage with everyone involved in the process to build long-term relationships in which people feel valued. "
        },
        {
            "heading": 3,
            "text": " 5. Communicate clearly and effectively"
        },
        {
            "text": "Communicate with co-design participants in a clear, timely way and delivered in a format that works for participants. Updates should follow co-design sessions. "
        },
        {
            "heading": 3,
            "text": "6.Make evidence-based decisions"
        },
        {
            "text": "Decisions should be taken after considering user needs, data, statistics, and people’s lived experience. "
        },
        {
            "heading": 3,
            "text": "7. Continuously learn, invite and share feedback"
        },
        {
            "text": "Explain clearly and honestly what will happen and what won’t happen following co-design. To improve, we must continually encourage feedback. "
        },
        {
            "heading": 2,
            "text": "Coming in 2022  "
        },
        {
            "text": "As our new farming schemes gradually roll out, we will step up our work supporting new projects to incorporate co-design. "
        },
        {
            "text": "We will publish more posts to set out exactly how we have been applying the principles, what members can expect at the discussion groups, and what we are learning as a community through co-design.  "
        },
        {
            "heading": 2,
            "text": "Get involved in co-design "
        },
        {
            "text": "If you work in farming, why not get involved in informing and shaping future Defra policy? We hope to have more in-person events this year as restrictions ease.   You can choose how much time you commit to the group, with most activities taking place online.  "
        },
        {
            "text": "Sign up to take part in co-design. We’ll send email updates on the events taking place for your subjects of interest. "
        }
    ]
}