{
    "url": "https://digitaltrade.blog.gov.uk/2022/02/15/old-admiralty-building-past-present-and-future-workplace/",
    "title": "Old Admiralty Building: past, present and future workplace",
    "authors": [
        "Natalia Rowles, Product Engagement Manager"
    ],
    "categories": [
        "Culture",
        "Diversity and Inclusion",
        "Flexible working"
    ],
    "pub_date": "2022-02-15T11:40:28+00:00",
    "content": [
        {
            "text": "The Old Admiralty Building (OAB) is the new London Headquarters of the Department for International Trade (DIT), located in the heart of Whitehall on Horse Guards Parade. Some world-famous people have worked here, such as former Prime Minister Winston Churchill and James Bond creator Ian Fleming. After joining DIT’s Digital, Data and Technology (DDaT) team, I wanted to explore the story of OAB and how it serves the needs of a government department in the modern world."
        },
        {
            "heading": 2,
            "text": "The history of OAB"
        },
        {
            "text": "OAB was originally one of the buildings from which the worldwide affairs of the Royal Navy were run. The building as it is recognised today was completed in 1905, although its construction was not straightforward. The red brick, and the distinctive copper-topped towers which have since turned green, were not typical choices for government buildings, and OAB was criticised for this. However, the building design let in plenty of light, which was essential for staff such as the Naval Constructors who were once based there, and their precise drawings."
        },
        {
            "heading": 2,
            "text": "Significant moments in OAB’s history"
        },
        {
            "text": "OAB was bombed during the Second World War and the damage is still visible from the courtyard. That didn’t prevent it from being the place where one of the war’s most decisive operations was planned. “Operation Mincemeat”, the deceptive plan to convince Germany that the Allies were to invade Greece instead of Italy in 1943, was prepared in “Room 13” of OAB’s basement. There is a film dramatising this event that comes out this year! On the topic of film, it is thought that Ian Fleming’s inspiration for the character “M” in the James Bond films was Naval Intelligence Director, Admiral John Godfrey. Godfrey occupied OAB’s “Room 39”, and Fleming was his personal assistant."
        },
        {
            "heading": 2,
            "text": "Adapting OAB to reflect modern changes for DIT colleagues"
        },
        {
            "text": "While much of OAB’s original character remains, it has been transformed into a Smarter Working environment. Smarter Working aims to provide DIT colleagues with greater flexibility around when, where, and how they work, in line with business needs. To support this, we have a mixture of work settings and meeting spaces to complement a wide range of tasks and activities in OAB. There are quiet task areas which discourage talking or phone calls, as well as large, open touchdown areas which are great for checking emails or taking a quick call."
        },
        {
            "heading": 3,
            "text": "Latest technology to support hybrid working"
        },
        {
            "text": "Technology in OAB supports hybrid working. All meeting rooms are fitted with Audio-Visual Unit technology. The units have speakerphone facilities and there is a camera attached to the screen in the room, so that those in the office can work alongside their colleagues who are dialling in via video call. You can find out more how we support hybrid working across DDaT in our blog, ‘Make hybrid working work for you!’. We also have a sophisticated booking system, and sensors fitted around the desks which provide insights into the quieter days and times in the office, allowing colleagues to plan and book the best times to visit."
        },
        {
            "heading": 3,
            "text": "Facilities at OAB"
        },
        {
            "text": "OAB has all the facilities that you would expect to find in a modern office. DIT colleagues can access a gym, canteen, coffee carts on multiple floors, seamless Wi-Fi, and a tech bar for IT support. Plants are dotted across the building, and the courtyard provides a peaceful space to relax. OAB’s fantastic location on Whitehall means quick access to St James’s Park for a lunchtime walk, plus all the amenities you could dream of in the surrounding area."
        },
        {
            "heading": 2,
            "text": "What makes OAB special to our DDaT colleagues?"
        },
        {
            "text": "“It’s lovely to walk through the park on the way to the office - you never know what wildlife you might see!”  Sian Thomas, Chief Data Officer"
        },
        {
            "text": "“As someone who is new to London, the office couldn’t be in a better location. I really like the number of refreshment hubs and other places to sit and have a coffee, especially the turrets.”  Jamie Rogers, Performance Analyst"
        },
        {
            "text": "“As a big fan of East Asian cooking, I love that OAB is only a 10-minute walk from Chinatown. The office really feels like it's in the middle of everything which makes it great for lunchtime or pre/post work exploring!”  Natasha Howard, Business Support Manager"
        },
        {
            "text": "“I feel privileged to work in such a beautiful building in the middle of London. On my way home, I'm often looking to see if there's anything exciting happening near Buckingham Palace. OAB is not just an office, it is the place to be.” Sanna Huovinen, Product Manager"
        },
        {
            "text": "In DDaT, we know that the working world is changing. Our London office has the facilities to champion wellbeing, inclusion and collaboration, whether in the room or at home. We are committed to Levelling Up in DIT and have team members based at our regional offices across the UK."
        }
    ]
}