{
    "url": "https://environmentagency.blog.gov.uk/2024/03/27/2023-event-duration-monitoring-data-publication/",
    "title": "2023 Event Duration Monitoring Data Publication",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2024-03-27T11:48:23+00:00",
    "content": [
        {
            "text": "Today (Wednesday 27 March) we have published storm overflow (Event Duration Monitoring data) for the 2023 calendar year. Event Duration Monitors record the number and duration of spills from storm overflows. To view mapped data visit Storm Overflow Spill Frequency (arcgis.com)  "
        },
        {
            "text": "Storm overflows are an automatic safety valve that release excess pressure on the network from flooding and rainfall or snowmelt – preventing sewage backing up into properties and streets. They should, however, only be used under strict permit conditions. Storm overflows have been part of the sewerage network since it was built. "
        },
        {
            "text": "Many of the storm overflow spills meet permit conditions as set out in legislation and are therefore legal. They are an essential part of the combined sewer network in England. Where spills do occur outside of permit conditions, the Environment Agency has procedures in place to investigate.  "
        },
        {
            "text": "We publish the annual Event Duration Monitoring data from all water companies operating in England to give greater transparency as part of our statutory duty under the Environment Act 2021. This has enabled an unprecedented level of transparency, lifting the lid on storm overflow operation for the public and enabling us to hold the water industry to account in a much greater way. No other country has this level of monitoring of storm overflows.  "
        },
        {
            "text": "The data for 2023 shows: "
        },
        {
            "text": "It’s important that we put the data into context.  "
        },
        {
            "text": "We know that it will take time for investment in storm overflows and increased regulation to take effect before we start to see spill figures improve.  "
        },
        {
            "text": "And in 2022 the lower number of spills was primarily a result of dry weather; in 2023 it is the reverse – the high numbers published today are partly due to high levels of rainfall in 2023. 2023 was provisionally the wettest year across England since 2012 and the sixth wettest in the Met Office series which starts in 1836. Only 2012, 2000, 1960, 1872 and 1852 were wetter (data sourced from the Met Office National Climate Information Centre). However, heavy rainfall doesn’t take away from water companies’ obligation to maintain their assets or the need for greater operational investment.  "
        },
        {
            "text": "The higher number of recorded spills in 2023 is also because there is now 100% coverage on storm overflows. More monitors mean more data (there were 14,241 overflows with monitors installed in 2023 compared with 13,323 in 2022). In previous years, any storm overflows without a monitor were not being counted. However, on average each overflow operated more times in 2023 than it did in 2022. That is simply not good enough.   "
        },
        {
            "text": "The total number of spills for 2023 reinforces the importance of the water companies’ obligation to maintain and invest in their assets. Climate change will inevitably bring wider variations in rainfall in the future and the water industry needs to adapt.  "
        },
        {
            "text": "What is being done to address the issues caused by storm overflows?  "
        },
        {
            "text": "Ultimately, water companies have a very long way to go. They need to invest more in tackling storm overflow pollution. Any water companies in breach of their permits are acting illegally and must act urgently to address any non-compliance. We will always seek to hold those responsible for environmental harm to account. If we identify illegal discharges from storm overflows, we investigate them, and action is taken in line with our Enforcement and Sanctions Policy. For example, in 2023, Yorkshire Water breached its environmental permit with an unauthorised sewage discharge. It submitted an Enforcement Undertaking to the Environment Agency proposing a charitable donation totalling £1m which is the largest ever accepted by the Agency. At the start of 2024, the Environment Agency also prosecuted Severn Trent water for a huge discharge of raw sewage at treatment works in Stoke with Severn Trent ordered to pay a fine of over £2m.  "
        },
        {
            "text": "We continue to work with government, who are putting in record levels of investment, to address the issues caused by storm overflows: "
        },
        {
            "text": "How to view the data  "
        },
        {
            "text": "For the 2023 data publication, we have published mapped data for the first time. This makes it easier to interpret, understand and compare water and sewage companies' Event Duration Monitoring data. The portal will allow users to view mapped spill frequencies across all or individual water and sewage companies with three years of data, from 2021, 2022, and 2023. The maps will also show sites where data is not available, whether this be the result of operational issues, or where monitors were recently installed but not commissioned at the time and therefore not returning data.  "
        },
        {
            "text": "As part of our efforts to improve the accessibility and transparency of the Event Duration Monitoring Data, we have highlighted ‘no data’ sites where Event Duration Monitoring data is missing. This can be for a number of reasons and we have made these clearly identifiable using coloured triangles. The reasons can include:  "
        },
        {
            "text": "In some cases, previously identified storm overflows that have had their permits revoked or surrendered, as a result of being deactivated, have been removed from the map so that only ‘active’ sites are shown.   "
        },
        {
            "text": "To view the mapped data visit Storm Overflow Spill Frequency (arcgis.com)    "
        },
        {
            "text": "Does the data include information on dry spills?  "
        },
        {
            "text": "No, it isn’t possible to identify 'dry spills' from the summary data. Now that the summary data has been published, we will formally request detailed data (including dates and start and stop times of spills) which can then be assessed against rainfall data to identify possible dry- day spills.   "
        },
        {
            "text": "A ‘dry spill’ is when a storm overflow is used on a ‘dry day’ – which is defined as no rainfall above 0.25mm on that day and the preceding day (24 hours). However, there are exceptions which must also be considered, such as in very large catchments with long drain down times. We carry out a detailed modelling process, looking at local rainfall gauges and drainage times – as well as Met Office data – to establish if dry spills have happened. When data indicates that dry spills may have occurred, this is followed by an investigation on a site-by-site basis. "
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "Going forward, we will use this data to inform compliance and investigation work. It provides a clear framework for where water companies should focus their investment. We are investing in people and digital tools to assess compliance, enforce more rapidly and ensure water companies comply with the law. Since 2015, the Environment Agency have concluded 60 prosecutions against water and sewerage companies securing fines of over £150 million.   "
        },
        {
            "text": "The EA is already ramping up inspections on water company assets with over 1,100 completed this financial year. Subject to government consultation, by the end of March 2025 our inspections will more than quadruple to 4,000 a year and rise to more than 10,000 from April 2025. This will include an increase in unannounced inspections, which will strengthen oversight of water companies and reduce the reliance on water company self-monitoring.  "
        },
        {
            "text": "Ensuring people and wildlife have clean and plentiful water is one of the biggest challenges we face but also one of the biggest gifts we can give to future generations. The Environment Agency, and the public, want more for the water environment and we are rising to the challenge. Despite the challenges, we remain positive about the future.  Getting to lasting solutions will take time, but we know what the problems are, and we know how to address them.  "
        },
        {
            "text": " "
        }
    ]
}