{
    "url": "https://hmlandregistry.blog.gov.uk/2024/03/27/amalgamation-or-merger-whats-the-difference/",
    "title": "Amalgamation or merger – what’s the difference?",
    "authors": [
        "Adam Hookway, Customer Policy Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-03-27T09:03:49+00:00",
    "content": [
        {
            "text": "At HM Land Registry we find that applicants sometimes mistakenly refer to amalgamation when the application is actually for a merger. This distinction is important, because HM Land Registry uses certain criteria to decide whether or not we should process an application for amalgamation, but we would normally complete a merger. "
        },
        {
            "heading": 2,
            "text": "Amalgamation"
        },
        {
            "text": "An amalgamation joins two or more parcels of registered and/or unregistered estates affecting different extents of land under a single registered title. "
        },
        {
            "text": "For amalgamation to proceed, it must be both possible and beneficial for HM Land Registry to complete the application, which must first fulfil certain requirements."
        },
        {
            "text": "If these requirements are met, we will then consider whether or not amalgamation is beneficial from HM Land Registry’s perspective, taking account of the applicant’s needs and the additional time it would take to process the application, on a case-by-case basis. "
        },
        {
            "text": "Current priorities mean we are able to accept only those applications for amalgamation that will bring positive advantage to a number of prospective purchasers, for example: "
        },
        {
            "text": "By the same measure, we would be unlikely to progress: "
        },
        {
            "text": "It is important to note, however, that registration under separate title numbers does not impede future dealings with the titles, as any number of titles can be dealt with in one instrument. "
        },
        {
            "heading": 2,
            "text": "Merger"
        },
        {
            "text": "A merger is the fusion of two or more estates, for example leasehold into freehold or a superior leasehold. It takes place when the leasehold interest and its immediate reversionary estate come into the same ownership. This can occur when the tenant acquires the immediate reversionary estate or when the landlord acquires the leasehold interest. "
        },
        {
            "text": "The lease is absorbed by the reversion and thus determined (which is the same principle as for surrender). For merger to take place, the following conditions apply."
        },
        {
            "text": "For more information about merger of a lease, see our practice guide 26 on GOV.UK, and for guidance on surrender and regrant applications, see our handy checklist. "
        },
        {
            "heading": 2,
            "text": "What this means in practice"
        },
        {
            "text": "Amalgamations can and do happen if there are good reasons and it makes sense to do so from HM Land Registry’s perspective. Mergers, however, are routinely applied for and processed and, although they cannot always be completed, this is usually the result of technical issues with the application, such as the presence of a restriction. "
        },
        {
            "text": "First published in the Law Society Property Section, Property in Practice. "
        }
    ]
}