{
    "url": "https://services.blog.gov.uk/2021/07/22/bridging-the-language-gap-when-working-with-new-people/",
    "title": "Bridging the language gap when working with new people",
    "authors": [
        "Martin Price, Senior service designer – WMCA"
    ],
    "categories": [
        "New lenses and perspectives",
        "Service transformation"
    ],
    "pub_date": "2021-07-22T13:48:33+01:00",
    "content": [
        {
            "text": "At West Midlands Combined Authority (WMCA), we provide over 80 services for public transport, for example, getting an older person’s free travel pass or planning a journey."
        },
        {
            "text": "In 2018, we had the opportunity to create an agile delivery team to redesign some of our services. We adopted the Service Standard and embedded DDaT roles into our team. This includes the organisation’s first service designer – me!"
        },
        {
            "text": "In service design we work with several people from different backgrounds. Usually we call these people stakeholders. Some live and breathe service design, others find what we do confusing."
        },
        {
            "text": "As service designers, we help people to  explore the problem space by looking at end-to-end and front-to-back journeys."
        },
        {
            "text": "Lou Downe, the former Head of Design at GDS, says “the biggest barrier to making good services is to get them to think of things as services in the first place”."
        },
        {
            "text": "We need stakeholders to understand what we’re doing and why we need to do it."
        },
        {
            "heading": 2,
            "text": "What is the language gap?"
        },
        {
            "text": "Several parts of service design are technical. We get caught up in design jargon and find ourselves making complicated processes."
        },
        {
            "text": "Sometimes, it’s the simplest words that create barriers to people understanding services."
        },
        {
            "text": "For example, the word ‘user’. We find this term can be confusing to stakeholders. Their words for users are more emotive:"
        },
        {
            "text": "At WMCA, we use these words interchangeably. It helps stakeholders to get on board as they understand what you mean."
        },
        {
            "text": "We have a slide that explains this when we first engage with them before a discovery:"
        },
        {
            "heading": 2,
            "text": "How we identified the gap"
        },
        {
            "text": "At the start of a recent project, we asked our stakeholders to answer a survey. The survey asked them whether they understood terms and ideas about agile, user-centred design and service design. For example:"
        },
        {
            "text": "We ran the survey to understand our stakeholders. How much knowledge and experience do they have?"
        },
        {
            "text": "We also asked stakeholders to tick statements they agreed with, for example:"
        },
        {
            "text": "The results showed that we had a gap in understanding around:"
        },
        {
            "text": "We also found that a quarter of stakeholders:"
        },
        {
            "heading": 2,
            "text": "How we bridged the gap"
        },
        {
            "text": "We were now mindful that although we have a strong team culture, we were only a small part of each stakeholders’ work life."
        },
        {
            "text": "Simplifying our language and processes helps stakeholders to understand what we do. We call this onboarding stakeholders.  It’s not dumbing down, it’s opening up."
        },
        {
            "text": "We used our simple language to encourage people to get involved. We did this in three ways:"
        },
        {
            "heading": 3,
            "text": "Opening up discovery"
        },
        {
            "text": "This is a great time to get people on board with your approach. It sets the scene for your process and starts to build trust. We use case studies to show how service design can make services better."
        },
        {
            "text": "Once we have introduced the approach, we workshop to create:"
        },
        {
            "text": "This workshop creates a common set of objectives that everyone has signed up to. We also learn our stakeholder’s language and team culture."
        },
        {
            "text": "We invite everyone to get involved in research and contribute to the discovery."
        },
        {
            "heading": 3,
            "text": "Educating through show and tells"
        },
        {
            "text": "Our show and tells are open to anyone in our organisation and the public sector."
        },
        {
            "text": "In our show and tells, we started to explain ourselves and processes more. Repeating definitions helps people to learn our approaches and terminology."
        },
        {
            "text": "We built bridges with people across the organisation who can help when we start to redesign services in future."
        },
        {
            "heading": 3,
            "text": "Persuading through stakeholder newsletters"
        },
        {
            "text": "Every fortnight we update stakeholders about the project through an email. We send this every fortnight during the first week of our sprint."
        },
        {
            "text": "This helps stakeholders to stay up to date with the project and summarises what we are up to. We did this to build trust."
        },
        {
            "text": "We also showed real-world examples from colleagues across government by:"
        },
        {
            "text": "We chose to send our newsletters at 1pm on a Friday afternoon. We hoped it would give stakeholders an interesting distraction as the weekend approached."
        },
        {
            "heading": 2,
            "text": "Has this been successful?"
        },
        {
            "text": "Since we adopted this approach, we have noticed there is more trust for our team to get on with busting through the backlog."
        },
        {
            "text": "As we have redesigned more services, we have worked with several more departments. It has become easier to have user-centred conversations and we are trusted by senior stakeholders."
        },
        {
            "text": "Being flexible to our stakeholder’s language and experience has resulted in better public services for our users. For us, that’s success."
        },
        {
            "text": "What language barriers have you experienced when designing or transforming your service? How did you overcome them? What helped you communicate better with your stakeholders? Please share your experience in the comments."
        }
    ]
}