{
    "url": "https://food.blog.gov.uk/2021/07/22/chairs-stakeholder-message-welcoming-the-national-food-strategy/",
    "title": "Chair’s stakeholder message - welcoming the National Food Strategy",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2021-07-22T15:40:18+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Cymraeg"
        },
        {
            "text": "The Food Standard Agency’s New Chair Susan Jebb takes over this edition of the FSA’s stakeholder update to discuss the National Food Strategy and delivering on the government’s vision for food policy. Sign up to receive regular updates."
        },
        {
            "text": "I am delighted to be writing this as the new Chair of the FSA and am looking forward to meeting as many of you as possible."
        },
        {
            "text": "It is an exciting time to have joined the FSA. Food continues to be a subject that makes headlines and inspires people’s passion. I was pleased to see the publication of Part Two of the National Food Strategy, an independent review commissioned by the Government to plan for a better food system. It is a compelling and important report which needs to be considered by all of us working in the food system."
        },
        {
            "text": "The National Food Strategy is part of a wider conversation across government about how we make our food system the best it can be. The FSA is an independent regulator, trusted by the public to make sure food is safe and is what it says it is. I believe that we have an important role to play in helping to deliver on the government’s vision for food policy. There will now be further discussions with colleagues about how we can play our part."
        },
        {
            "text": "The FSA is already stepping up the development of its future strategy and we will be seeking your views on this as it progresses. Food standards are not just about minimising risk but maximising the opportunities for the food system to be at its best, ensuring food that is good for people, the planet and the economy. Of course, we need to continue doing the day job brilliantly, and that means keeping food safe and protecting public health.  It’s a big challenge, but it’s what motivates me to do this job."
        },
        {
            "text": "It’s an enormous privilege to be joining the FSA at such a pivotal moment. In my first few weeks, I have been impressed at the commitment of the FSA team. I am also grateful to have the opportunity to work with you all, our partners and stakeholders. I am looking forward to meeting more of you to hear your thoughts about what we can do better and then working together to achieve a strong, resilient food system."
        },
        {
            "heading": 1,
            "text": "\nNeges y Cadeirydd i randdeiliaid - croesawu'r Strategaeth Fwyd Genedlaethol"
        },
        {
            "text": "Cadeirydd Newydd yr Asiantaeth Safonau Bwyd (ASB), Susan Jebb, sy’n gyfrifol am y rhifyn hwn o ddiweddariad yr ASB i randdeiliaid er mwyn trafod y Strategaeth Fwyd Genedlaethol a chyflawni gweledigaeth y llywodraeth ar gyfer polisi bwyd."
        },
        {
            "text": "Rwy’n falch iawn o fod yn ysgrifennu hyn fel Cadeirydd newydd yr ASB, ac rwy’n edrych ymlaen at gwrdd â chynifer ohonoch chi â phosib."
        },
        {
            "text": "Mae'n amser cyffrous i fod wedi ymuno â'r ASB. Mae bwyd yn parhau i fod yn bwnc amlwg yn y wasg, ac mae’n ennyn angerdd pobl. Roedd yn dda gen i weld cyhoeddi Rhan Dau’r Strategaeth Fwyd Genedlaethol, sef adolygiad annibynnol a gomisiynwyd gan y Llywodraeth i gynllunio system fwyd well. Mae’n adroddiad grymus a phwysig y mae angen i bob un ohonom sy’n gweithio yn y system fwyd ei ystyried."
        },
        {
            "text": "Mae’r Strategaeth Fwyd Genedlaethol yn rhan o drafodaeth ehangach ar draws y llywodraeth ynglŷn â sut y gallwn wneud ein system fwyd yr orau y gall fod. Mae’r ASB yn rheoleiddiwr annibynnol y mae’r cyhoedd yn ymddiried ynddo i sicrhau bod bwyd yn ddiogel a’i fod yn cyd-fynd â’r hyn sydd ar y label. Credaf fod gennym ni ran bwysig i’w chwarae wrth helpu i gyflawni gweledigaeth y llywodraeth ar gyfer polisi bwyd. Nawr, bydd trafodaethau pellach gyda chydweithwyr am sut gallwn ni gyflawni ein rhan ni."
        },
        {
            "text": "Mae’r ASB eisoes yn dwysáu datblygiad ei strategaeth ar gyfer y dyfodol, a byddwn ni’n ceisio eich safbwyntiau ar hon wrth iddi fynd rhagddi. Nid yw safonau bwyd yn ymwneud â lleihau risgiau yn unig, ond cynyddu’r cyfleoedd i’r system fwyd fod ar ei gorau, gan sicrhau bod bwyd yn dda i bobl, y blaned, a’r economi. Wrth gwrs, mae angen i ni barhau i wneud ein gwaith beunyddiol yn wych, ac mae hynny’n golygu cadw bwyd yn ddiogel a diogelu iechyd y cyhoedd. Mae’n her fawr, ond dyna sy’n fy ysgogi i wneud y swydd hon."
        },
        {
            "text": "Mae’n fraint enfawr cael ymuno â’r ASB ar adeg mor allweddol. Yn ystod fy wythnosau cyntaf, mae ymrwymiad tîm yr ASB wedi gadael argraff arnaf. Rwyf hefyd yn ddiolchgar am y cyfle i weithio gyda phob un ohonoch chi, ein partneriaid a’n rhanddeiliaid. Rwy’n edrych ymlaen at gwrdd â rhagor ohonoch chi i glywed eich meddyliau am yr hyn y gallwn ni ei wneud yn well, ac yna cydweithio i sicrhau system fwyd gref, gydnerth."
        },
        {
            "text": " "
        }
    ]
}