{
    "url": "https://rtau.blog.gov.uk/2021/07/22/exploring-the-role-of-data-intermediaries-in-supporting-responsible-data-sharing/",
    "title": "Exploring the role of data intermediaries in supporting responsible data sharing",
    "authors": [
        "Dave Buckley",
        "Christopher Thomas",
        "Kimberley Moran"
    ],
    "categories": [
        "Data",
        "Intermediaries",
        "Responsible innovation"
    ],
    "pub_date": "2021-07-22T08:53:22+01:00",
    "content": [
        {
            "text": "At the Centre for Data Ethics and Innovation (CDEI), we aim to drive trustworthy innovation in data and data-driven technologies, including AI. Exploring, developing, and promoting mechanisms for supporting responsible data access and sharing across the economy is therefore a key area of focus for us. "
        },
        {
            "text": "Today, we have published our first report on data intermediaries, which explores the activity of existing data intermediaries across different sectors, and considers the role they could play in the future. This paper was commissioned by DCMS to support ambitions set out in the National Data Strategy and subsequent consultation response; in particular, the commitment to consider the role of data intermediaries in supporting responsible data sharing, and how the government can intervene to support their adoption. "
        },
        {
            "heading": 2,
            "text": "Defining data intermediaries"
        },
        {
            "text": "Data intermediary is a broad term that covers a range of different activities and governance models for organisations that facilitate greater access to or sharing of data. "
        },
        {
            "text": "Our paper explores seven types of data intermediaries, including: data trusts, data exchanges, personal information management systems (PIMS), industrial data platforms, data custodians, data cooperatives, and trusted third parties. "
        },
        {
            "heading": 2,
            "text": "Exploring real-world examples of data intermediaries"
        },
        {
            "text": "The concept of data intermediaries - and the ways in which they facilitate data access and sharing - can be intangible and abstract. Our paper includes visual representations (such as exhibit 1 which can be viewed here) and case studies (such as the SOLID case study below) to demonstrate how they work in practice. "
        },
        {
            "text": "Exhibit 1 explores a personal information management system (PIMS) where an individual imports personal data from providers such as social media companies, banks, hospitals, and the government, among others. The individual is able to manage who has access to their personal data store, granting or revoking access to organisations such as GPs, banks, and online retailers, among others. SOLID, explored below, is one such example of a data intermediary."
        },
        {
            "heading": 2,
            "text": "Unlocking the value of data through data intermediaries"
        },
        {
            "text": "Data intermediaries unlock opportunities to empower individuals and businesses, offering them greater control and choice over who has access to data about them, and the purposes for which it is used. In addition, data intermediaries facilitate data access and sharing for the purposes of analysis. This can include research in the public interest, supporting innovation in commercially-sensitive environments, and enabling the independent audit of data-driven technologies. The COVID-19 pandemic has highlighted the importance of this opportunity, demonstrating how effective use of data can aid decision-making and produce social and economic benefits, which we explored in our COVID-19 retrospective."
        },
        {
            "text": "There are opportunities to leverage data intermediaries in response to the most pressing social, economic, and environmental challenges today, where greater access to and sharing of data is crucial. Our paper discusses three potential opportunities, including: facilitating preventative medicine to improve individuals’ wellbeing; enabling better matching of workers with available jobs, particularly as technology transforms the labour market; and enabling the UK to meet its Net Zero targets."
        },
        {
            "heading": 2,
            "text": "Supporting the CDEI’s work on trustworthy innovation"
        },
        {
            "text": "As stated in our recently published two year review, facilitating responsible data sharing across the economy, including piloting new forms of data stewardship and governance, is one of three themes that will guide the CDEI’s work over the next year, alongside public sector innovation and AI assurance. Although this paper is our first published output on the topic of data intermediaries, it complements other projects that we have been undertaking in this area, including our work with DCMS on the Online Safety Data Initiative, and our ongoing work on PETs. "
        },
        {
            "heading": 2,
            "text": "Get in touch"
        },
        {
            "text": "We are working with DCMS to further build the evidence base on the opportunities and risks presented by intermediaries, to support DCMS policy thinking on how government intervention could enable and engender confidence in intermediary activity. We would be keen to hear your reflections on the intermediary opportunities set out in our paper. Do you agree with the opportunities identified? Do you think there are any particular use-cases or areas which could be further explored to unlock data access and sharing?"
        },
        {
            "text": "As part of our wider work on data sharing, we recently published a PETs adoption guide, which is an interactive tool designed to aid decision-making around the use of PETs in data-driven projects. We would be interested to hear views on the interaction between intermediaries and PETs. To what extent, for example, might PETs reduce how active intermediaries need to be in data stewardship activities? Are there use-cases where only third-party intermediaries can achieve the needed outcomes?"
        },
        {
            "text": "Finally, we recognise that there may be risks associated with intermediary activity which have not been explored in the paper. If you have any thoughts on these, we’d like to hear from you. Please get in touch with us at cdei@cdei.gov.uk. "
        }
    ]
}