{
    "url": "https://insidehmcts.blog.gov.uk/2021/07/22/going-further-to-support-intimidated-witnesses/",
    "title": "Going further to support intimidated witnesses",
    "authors": [
        "Daniel Flury"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2021-07-22T13:13:16+01:00",
    "content": [
        {
            "text": "For many witnesses, the fear and stress associated with the investigation of a crime can be hugely difficult. This can then increase even further if they then need to attend court and give evidence at a trial. Some witnesses may find it especially difficult to do this due to a number of additional factors, including their age, personal circumstances, fear of intimidation or because of particular needs."
        },
        {
            "text": "If witnesses are considered more vulnerable or could be intimidated, a judge or magistrate may decide that \"special measures\" can be granted to improve the quality of their experience by helping them to give their best possible evidence."
        },
        {
            "text": "One of these special measures is ‘section 28’, or ‘Section 28 of the Youth Justice and Criminal Evidence Act 1999 (s.28)’ to give its full title. It allows witnesses to pre-record their cross examination before trial, regardless of the offence. This spares them the potential trauma of attending the trial itself in person, and in the presence of the accused."
        },
        {
            "text": "Last year, my colleague Trudy Lewis wrote about how this particular special measure has been rolled out to all Crown Courts in England and Wales to vulnerable witnesses. Vulnerable witnesses are defined as all witnesses under the age of 18, and those whose evidence is likely to be diminished by either a mental disorder, significant impairment of intelligence or social functioning, or a significant physical disability or disorder."
        },
        {
            "text": "Expanding our intimidated witnesses pilot"
        },
        {
            "text": "As well as rolling out section 28 for vulnerable witnesses across England and Wales, HMCTS and the Ministry of Justice are now looking to go further. In 2019 this special measure started to be piloted for a subset of intimidated witnesses - complainants of sexual offences and modern slavery offences - at Liverpool, Leeds and Kingston upon Thames Crown Courts."
        },
        {
            "text": "I’m really pleased that this pilot has now been extended to more Crown Courts – as confirmed in the government’s recent action plan to increase the number of rape cases reaching court. The pilot will be expanded to Durham, Isleworth, Wood Green, and Harrow Crown Courts."
        },
        {
            "text": "We chose these sites based on projected numbers of serious sexual offence cases; the volume of outstanding work and length of waiting lists for victims; and operational feasibility for criminal justice system (CJS) partners."
        },
        {
            "text": "We will carry out a full evaluation once a sufficient number of section 28 hearings have been recorded for this group, which will inform next steps towards wider roll out."
        },
        {
            "text": "Elsewhere, we’ve also just began testing section 28 in the Youth Court, and will be working closely with senior judiciary and key criminal justice partners to develop a process that supports pre-recorded cross examination in this environment."
        },
        {
            "text": "I’m enormously proud of the hard work that goes on in our courts to provide this vital service to those who need it most. It’s making such a difference, benefitting countless victims of crime. Since August 2020, section 28 special measures have been used to support over 1000 vulnerable and intimidated witnesses to give their best possible evidence. This ensures that the justice system is less daunting for those involved, and the feedback from those involved supports that."
        },
        {
            "text": "As we move forward, we’ll keep working closely with our partners – the Victims Commissioner, judiciary, Crown Prosecution Service, legal professions, police, and a range of other public user bodies. I am immensely grateful to all for their vital support to victims and witnesses of crime. Working together, I am confident that we will continue to increase the support we provide, and transform the experience of our criminal justice system for some of the most vulnerable people in society."
        },
        {
            "text": " "
        },
        {
            "text": "Read more about how HMCTS is implementing section 28 special measures and other areas of the crime programme."
        },
        {
            "text": "* Where the complainant in respect of a sexual offence or an offence under section 1 or 2 of the Modern Slavery Act 2015 is a witness in proceedings relating to that offence (or to that offence and any other offences), the witness is eligible for assistance in relation to those proceedings unless they have informed the court that they do not wish to be eligible."
        }
    ]
}