{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/07/22/hacking-the-policymaking-system/",
    "title": "If you could change just one thing: hacking the policy system",
    "authors": [
        "Kate Josephs"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2021-07-22T12:00:42+01:00",
    "content": [
        {
            "text": "Twenty years ago I embarked upon a career in the civil service.  From pensions policy, to public service reform, education and skills I dipped in and out of jobs which were described as ‘policy’ during my career.  But increasingly I strayed from that anchor towards a focus on the intersection with delivery and implementation – cemented during my time in the Prime Minister’s Delivery Unit in the noughties – and moved towards increasingly operational roles.  Rather than being explicitly recognised as a career path, that focus was driven from my own sense of frustration; the more I learned and saw, the clearer it seemed to me that policy is all well and good, but how it is interpreted and acted upon is what really matters."
        },
        {
            "text": "In those two decades in national government I saw a welcome shift in the way we talk about policy making in the civil service - the language of delivery, systems thinking, user engagement, multi-disciplinary teams, design and iteration all began to take hold.  And as this blog series shows that direction of travel is more than words in some notable areas – the work Janet Hughes and the Defra team are doing on Future Farming is a great example."
        },
        {
            "text": "I now find myself in a very different world having swapped the ‘distant, ivory towers of Whitehall policy making’ for a role where I walk past the consequence of policy decisions every day, where engaging with communities isn’t just a ‘nice thing to do if there’s time’ but the heart of our work."
        },
        {
            "text": "In this new world, despite having strong and established personal relationships, civil service colleagues feel distant.  Despite knowing how it works intimately, the civil service ‘machine’ can feel confusing and obtuse.  Despite trusting and believing in the capability and commitment of my former colleagues, I wonder if curiosity, humility, and space to iterate will be valued enough to become the rule rather than the exception."
        },
        {
            "heading": 2,
            "text": "How policy starts"
        },
        {
            "text": "Most of the challenges Government faces or questions it needs to answer are deeply complex; for a policy to have impact its delivery will involve a diverse range of actors in multiple overlapping systems – institutions and organisations; places; communities of profession and practice.  It seems almost trite to point out that policy making in this context is going to be hard to get ‘right first time everywhere’ and so an adaptive mindset must be the goal – an approach to policy making that prizes feedback & learning; deep understanding of systems, places and people; the bravery to make space for co-production & iteration."
        },
        {
            "text": "It’s instructive that I was asked to write this blog focusing on the way we ‘commission’ policy work. This highlights an immediate challenge - policy making in Government is still too often a linear process – an ‘event’ which starts within the Whitehall machine.   The operating environment for policy makers is one where ministers or senior leaders ‘commission’ (or initiate) policy work – perhaps in response to evidence of need; perhaps in response to external pressures or a crisis; perhaps driven by a process like a spending review or political announcement.  It goes without saying that it is the democratic role of the Government and its ministers to initiate policy, and that drive can play a key part in over-riding inertia and driving ambition. But without care, details of the policy risk being predetermined from the top down at the outset – by the way the core ‘question to be answered’ is framed, by constraints applied (time, cost, assumptions) and by expectations stated or implied."
        },
        {
            "text": "Some would argue the operating environment for national policy making is fundamentally broken, but I’m not ready to go there just yet.  Instead, I wanted to identify ways to move things forward within this context – how might we hack the linear policy making system? How might we change the way senior leaders commission policy work at the beginning of the process to drive better policy results? To help me in this task I took to Twitter and am grateful to all those who shared their views, the suggestions below shamelessly meld their ideas with my own (check out the original thread here)."
        },
        {
            "heading": 2,
            "text": "Framing"
        },
        {
            "heading": 2,
            "text": "Listening"
        },
        {
            "heading": 2,
            "text": "Challenging ourselves"
        },
        {
            "text": "A few weeks ago the Declaration on Government Reform was published. There are specific mentions for: multidisciplinary teams, evidence-led decision making and sharing data, public value, getting out of Whitehall, open collaborative policy-making, operating more seamlessly with institutions outside government, and building partnerships with the wider public sector, private sector and community organisations to secure the best outcomes for citizens.  These are welcome commitments and in many ways map onto the suggestions I’ve made.  The question, as ever, is whether they will be implemented.  To do so requires all those who initiate policy work in national government – the most senior officials, ministers and their offices - to genuinely embrace different assumptions and questions from the start of that process.  Speaking from the outside, I sincerely hope they will."
        }
    ]
}