{
    "url": "https://phescreening.blog.gov.uk/2021/07/22/new-imd-information-leaflets/",
    "title": "New inherited metabolic disease (IMD) information leaflets have been published on GOV.UK",
    "authors": [
        "Amy Headley"
    ],
    "categories": [
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2021-07-22T10:58:43+01:00",
    "content": [
        {
            "text": "The newborn blood spot (NBS) screening programme screens for 9 rare but serious conditions. This includes 6 inherited metabolic diseases (IMDs), which are:"
        },
        {
            "heading": 2,
            "text": "IMD screening leaflets"
        },
        {
            "text": "PHE has public information leaflets for all NBS conditions, including the IMDs, to support parents throughout screening and diagnosis."
        },
        {
            "text": "There are 13 IMD information leaflets. For each of the conditions, there are 2 types of leaflet:"
        },
        {
            "text": "For IVA, there is also a third leaflet on ‘mild IVA’ (the 932C>T variant), which is also detected through NBS screening."
        },
        {
            "heading": 2,
            "text": "Updating the leaflets"
        },
        {
            "text": "Last year, we re-published all of the existing IMD leaflets in HTML format so they would comply with the new accessibility guidelines. At that stage, we did not make any changes to the content of the leaflets."
        },
        {
            "text": "Since then, we have been working hard to review and update all of the IMD leaflets so they contain up-to-date clinical guidance. We have worked with clinicians, lab staff, an IMD charity and parents of affected children to ensure the leaflets are as user friendly, informative and accessible as possible."
        },
        {
            "text": "We hope the new leaflets will be a useful source of information for parents following their baby’s positive NBS screening result, and that they will help support them during an anxious and stressful time."
        },
        {
            "text": "Please send any queries, suggestions or feedback about the updated IMD leaflets to the PHE Screening helpdesk."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}