{
    "url": "https://healthmedia.blog.gov.uk/2021/07/22/nhs-pay-review-announcement-key-questions-and-guidance/",
    "title": "NHS pay review announcement - key questions and guidance",
    "authors": [
        "dhscpressoffice"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-22T17:41:40+01:00",
    "content": [
        {
            "text": "Information on DHSC's announcement that all NHS staff within scope of the pay review will receive a 3% pay uplift. "
        },
        {
            "text": "Independent pay review process"
        },
        {
            "text": "The NHS Pay Review Body (NHSPRB) and Review Body on Doctors' and Dentists' Remuneration (DDRB) are composed of independent experts."
        },
        {
            "text": "The government asked them for their recommendations on NHS pay this year, while uplifts in the wider public sector are paused for those earning over £24,000."
        },
        {
            "text": "Both pay review bodies have recommended pay uplifts of 3% for all staff in scope. In deciding upon their recommendations, both independent bodies have carefully considered evidence submitted by a wide range of stakeholders, including NHS organisations and trade unions."
        },
        {
            "text": "They also factored in a wide range of factors including recruitment, retention, morale and motivation, alongside affordability and the national economic context."
        },
        {
            "text": "The government has accepted the recommendations of both PRBs for 2021/22 meaning NHS staff including nurses, paramedics, consultants, and dentists in England will receive a 3% pay rise."
        },
        {
            "text": "What this means for non-medical staff"
        },
        {
            "text": "Non-medical staff in the NHSPRB’s remit include nurses, porters, healthcare assistants, managers. Around 350,000 nurses will receive a pay rise of at least £740 (pro-rated for those working part time), with an average increase of around £1,000."
        },
        {
            "text": "The NHS Pay Review Body’s recommendation is separate from the 0.7% investment in Agenda for Change (AfC) in 2021/22. This was a result of the AfC multi-year pay and contract reform deal and has already come into effect as of April 2021. It affected a small number of NHS staff."
        },
        {
            "text": "What this means for medical staff"
        },
        {
            "text": "For consultants, this award is worth between £2,400 and £3,300. Specialty Doctors not transferring to new contracts will be awarded between £1,200 and £2,300."
        },
        {
            "text": "For Associate Specialists, this award is worth between £1,700 and £2,800."
        },
        {
            "text": "This award will raise the minimum recommended pay range for Salaried GPs by £1,814 and the maximum by £2,737."
        },
        {
            "text": "What this means for junior doctors "
        },
        {
            "text": "Doctors and dentists in training are still benefitting from multi-year pay and contract reform deals (2019/20-2022/23), so the pay review bodies were not asked to make pay recommendations for them."
        },
        {
            "text": "The pay deal, announced in July 2019, guarantees junior doctors’ pay scales will rise by a minimum of 8.2% over the four years. This year they are receiving a total investment of 3% in their contract, with 1% of this going towards contract reform and the other 2% to increase pay."
        },
        {
            "text": "On top of this, the government has invested £90 million to create a new higher pay point for the most experienced junior doctors, increase allowances for those working the most frequently at weekends, enhance eligibility for night shift pay, and create a £1,000 a year allowance for junior doctors who work less than full time to help them with the cost of training."
        },
        {
            "text": "To help deliver a high standard of rest areas for staff in every hospital, the government has invested a further £10 million as part of its commitment to the mental and physical wellbeing of all junior doctors."
        },
        {
            "text": "To tackle the disruption caused by the pandemic, Health Education England (HEE) are also investing £30 million to support the development of individual training recovery plans for junior doctors and to deliver training across hospital trusts."
        },
        {
            "text": "What this means for GPs and dentists"
        },
        {
            "text": "General Practice is subject to a five-year investment agreement (to 2023/24) between NHS England and NHS Improvement and the British Medical Association so the government has not asked for a pay recommendation for GP contractors. This investment will expand the GP workforce and transform the system to address workload and retention issues and better meet the needs of patients."
        },
        {
            "text": "This is in addition to the £4.5 billion real terms annual increase announced for primary and community care in the Long Term Plan by 2023/24."
        },
        {
            "text": "For salaried GPs, the recommended minimum and maximum pay will be uplifted by 3%. Dental contracts will also be uplifted to account for the 3% uplift for dentists."
        },
        {
            "text": "What this means for Specialty and Associate Specialist doctors"
        },
        {
            "text": "The DDRB were not asked to make a pay recommendation for Specialty and Associate Specialist (SAS) doctors who have transferred to the new contract as they are already in a multi-year pay deal."
        },
        {
            "text": "The multi-year deal agreed with the British Medical Association is not just about headline pay uplifts, but reforms to help improve the working lives, opportunities for progression and the health and wellbeing of SAS doctors."
        },
        {
            "text": "SAS doctors can choose whether to move to the new contract. Investment into the deal covering pay and contract reform is worth 3% a year."
        },
        {
            "text": "SAS doctors who do not transfer will receive the 3% uplift."
        },
        {
            "text": "Wales, Scotland and Northern Ireland"
        },
        {
            "text": "The devolved administrations provide the independent pay review bodies with respective remits."
        },
        {
            "text": "Health spending and public sector pay is a devolved responsibility and it is up to the government of each nation to determine how they respond to pay review bodies and what pay uplift to provide for staff."
        }
    ]
}