{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/07/05/b-sen-speaker-series-making-the-oxford-astrazeneca-vaccine/",
    "title": "B-SEN Speaker Series: Making the Oxford AstraZeneca Vaccine",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities"
    ],
    "pub_date": "2021-07-05T15:42:21+01:00",
    "content": [
        {
            "text": "On the 14th July 2021, 15:00 - 16:00, the BEIS Science & Engieering Network (B-SEN), are holding a talk discussing Making the Oxford AstraZeneca Vaccine, as part of the B-SEN Speaker Series. Join us in warmly welcoming Prof. Catherine Green, and tune in to learn all about how she led her team in making the Oxford AstraZeneca vaccine in the early days of 2020. This talk is open to all departments, including those outside of BEIS. Here is a blurb from Professor Green of what the session will cover:"
        },
        {
            "text": "It took just 65 days at the start of 2020 for my team at Oxford's Clinical BioManufacturing Facility to manufacture, test and provide to trial the first batch of clinical ChAdOx1 nCoV-19 vaccine, that went on to be called the Oxford AstraZeneca Vaccine. I will describe some of the previous work that enabled us to develop this vaccine so rapidly, and the path that was taken to later scale up, large late-stage clinical trials and eventual emergency use authorisation of this vaccine now in global deployment against Covid-19. I will also comment on the challenges of trying to respond to a pandemic while in a pandemic, and highlight some lessons learned along the way that will hopefully prepare us better for the next one."
        },
        {
            "heading": 3,
            "text": "Event Details"
        },
        {
            "text": "14th July 2021, 15.00-16.00"
        },
        {
            "text": "MS Teams Event link: https://bit.ly/3611oLf"
        },
        {
            "text": "(alternatively, email Oscar at oscar.williams@beis.gov.uk to get a calendar link)"
        }
    ]
}