{
    "url": "https://dragonsden.blog.gov.uk/2021/07/05/dragons-den-episode-13-series-18/",
    "title": "Dragons’ Den, Episode 13, Series 18",
    "authors": [
        "Kelsey Lewis"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Designs",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-07-05T11:11:35+01:00",
    "content": [
        {
            "text": "Peter Jones returned to the Den with renewed vigour this evening after a short period of absence. From an app that tracks carbon footprint, to reduced-sugar jams and a patented pooper-scooper, the Den was set alight with intellectual property…but which inventions had the Dragons chomping at the bit?"
        },
        {
            "heading": 3,
            "text": "Every dog has its day"
        },
        {
            "text": "First to face the Dragons was product designer Darren Louet-Feisser, who I have since discovered is no stranger to Dragons’ Den. Darren first appeared on the Irish version of the show 13 years ago where he successfully secured investments from three Dragons. But would he repeat his former success?"
        },
        {
            "text": "This time around, the charismatic Irishman was seeking a £50,000 investment for 10% in his company Nobu Pets Ltd. The product that he was keen to demonstrate was the Potty Mouth, a sphere-shaped pooper-scooper which distributes its own, biodegradable dog waste bags."
        },
        {
            "text": "Darren explained that the idea came to him while watching his children picking up snails in the garden with a broken tennis ball. In his pitch, he announced that the product had a patent for its biodegradable bags and the method by which they are distributed."
        },
        {
            "text": "Patent protection is essential for an inventor who will, as a result of the patent being granted, inherit the right to stop others (for a limited period) from making, using or selling their creation without their permission. To be granted a patent, an invention must be all of the following:"
        },
        {
            "text": "Although we were impressed by Darren’s savviness on IP, it wasn’t enough to convince Peter, Deborah, Sara or Tej to invest."
        },
        {
            "text": "Touker however, who’s been building a portfolio of pet businesses over the past year, expressed a desire for new and innovative products like the Potty Mouth. He offered all of the money for 35% of the company (reducing to 30% if he makes his £50,000 within 18 months). He also promised to help with sourcing and distributing. Visibly delighted, Darren scooped up Touker’s offer."
        },
        {
            "heading": 3,
            "text": "Eyes on the prize"
        },
        {
            "text": "Spying an investment in their company Ocushield were optometrist innovators Dhruvin Patel and Asad Hamir. After expressing a particular interest in Tej and Peter before entering the Den, the duo pitched their blue light screen filters and requested £75,000 for 5% in the business."
        },
        {
            "text": "After an interesting discussion on how blue light from screens affects our eyes, skin and melatonin levels, Sara was quick to turn the subject to IP. I was pleased to hear that the pair had spoken to a patent attorney early on in their entrepreneurial journey."
        },
        {
            "text": "The patent attorney had explained that, unfortunately for them, there wasn’t anything defensible that could be patented when dealing with waves of light, therefore making the patent easy to get around. But rather than giving up on IP, they decided to focus on their brand instead."
        },
        {
            "text": "A brand is essential for a business as it’s how the business is recognised in a competitive market. It also offers your customers assurance about the nature of the product or service they will receive. Trade marks are a vital component in setting up a brand and are in place to protect your identity by distinguishing your goods and services from that of your competitors'. You can learn more about trade marks in our online trade mark guidance."
        },
        {
            "text": "It’s helpful to remember that registering your company name with Companies House offers you no rights to prevent others using your trade mark. You must apply for your trade mark with the Intellectual Property Office (IPO)."
        },
        {
            "text": "As hoped, the pitch hooked both Peter and Tej into a ferocious bidding battle and tempers flared. Requiring both Tej’s health care knowledge and Peter’s experience in distribution, the duo cleverly diffused the situation by offering the Dragons the opportunity to work together for 7.5% each in the business."
        },
        {
            "text": "The optical entrepreneurs left the Den with all of the money and the might of two fierce Dragons behind them."
        }
    ]
}