{
    "url": "https://accessibility.blog.gov.uk/2021/07/05/lets-talk-about-the-elephant-in-the-room-invisible-disabilities/",
    "title": "Let’s talk about the elephant in the room: invisible disabilities",
    "authors": [
        "Andreea Vlad (NHS Business Service Authority)"
    ],
    "categories": [
        "Access needs",
        "Accessibility"
    ],
    "pub_date": "2021-07-05T10:00:38+01:00",
    "content": [
        {
            "text": "Following Nellie the interactive dinosaur, I decided to expand on this and raise awareness of invisible disabilities in a similar way. Or as some of us would call it, the elephant in the room."
        },
        {
            "text": "We conducted an experiment to see how people perceive invisible disabilities. I also tried to talk about how biases can impact us and others."
        },
        {
            "text": "Please be aware that the event and photos taken took place in December 2019, pre COVID-19 when social distancing measures weren’t required."
        },
        {
            "text": "Join us as we follow a week-long journey of an elephant around an NHS organisation. We'll gain an insight into the perception of mental health within the organisation. So let’s talk about the literal elephant in the room; a 2x2m cardboard cut-out of an elephant!"
        },
        {
            "heading": 2,
            "text": "Where did we find inspiration?"
        },
        {
            "text": "The inspiration came from Nellie the interactive dinosaur. Stella Perrett raised this concept in her blog post - “Personal Disability Stories: Part 6 - Stella’s story”. The idea highlighted the lack of awareness that can happen in a digital workplace. We expected to see an impact on the services that we provide on a daily basis."
        },
        {
            "heading": 2,
            "text": "What did we do?"
        },
        {
            "text": "We wanted to really make sure this caught people's attention. The week began with the appearance of a two-metre tall cardboard elephant at one of the NHSBSA offices. Designing, sneaking, and moving the elephant into high footfall areas of the office to grab attention and intrigue the curious. The elephant had only one message for people passing by:"
        },
        {
            "text": "“I may be big and look happy but I may be hiding something - I’m going to be moving around the building and asking you different questions every day this week - look out for me and remember to find out why there’s an elephant in the room on [date] in the [session location]\"."
        },
        {
            "text": "The elephant was the bearer of a very important message. Most people are aware of Disability as a very visible thing. But that isn't always the case. A lot of disabilities are invisible, but sometimes our reaction to them isn’t. There is a need for consideration in our behaviour and actions. We highlighted this by sharing personal stories and user quotes while running an engaging exercise."
        },
        {
            "text": "The event ran for a week and had engagement from different departments, including our leadership team. By opening the doors and our arms to everyone, we tried to highlight that you never know what’s going on in someone’s life. We should treat everyone with empathy. They might or might not have an invisible disability, or they might be going through a rough time."
        },
        {
            "heading": 2,
            "text": "How to get engagement, curiosity and buy in from your participants?"
        },
        {
            "text": "The initial four days were part of our awareness campaign. We aimed to get more people curious about the elephant. Participants found out on the last day the secret that our “elephant” was willing to share. Each day we had a question from the elephant, such as:"
        },
        {
            "text": "Our TVs and walls had engaging photos, questions, and hints that supported the journey. Moreover, the elephant had a journey around the building so that we could get others curious. We’ve seen behaviours, trends, and tried to adapt each day and rise like a phoenix at the end."
        },
        {
            "text": "A small number of colleagues knew the elephant's secret. Colleagues became more and more curious as the days progressed and tried new clues. We had over 300 answers over the four days. The answers informed our final session."
        },
        {
            "text": "Friday came fast and we had a high number of people looking for reasonable answers to the previous days. Supported by a handful of my colleagues, we were able to provide a session. I would like to thank Chris Moore and Robert Djaelani for their support on the day. I would also like to thank everyone involved in the process; including the elephant."
        },
        {
            "heading": 2,
            "text": "Topics covered"
        },
        {
            "text": "The session covered topics about invisible disabilities, bias, false perceptions, labels, or wording. For example, some terms may appear to be negative in someone’s perception. This is especially true when describing what people cannot do instead of showcasing their talents."
        },
        {
            "text": "Some common misunderstandings raised by the audience included:"
        },
        {
            "text": "We discussed the false perceptions and judgements that a person could encounter. We also provided support and materials in combating this behaviour."
        },
        {
            "text": "\"Looking fine\" is a social barrier for people with invisible disabilities. Individuals often struggle as their impairments go unrecognised. To combat this, new initiatives have been introduced, such as the:"
        },
        {
            "heading": 2,
            "text": "Conversation topic"
        },
        {
            "text": "In order to keep the audience engaged, we asked them to think about problems when mentioning to someone: “Get some rest!”. The aim is to discuss the influence our words can have based on one’s circumstances; for example:"
        },
        {
            "text": "“How can you support somebody who has an invisible disability?” is a question that is shaped during the day to ”How to support everyone?”. Because everyone is fighting a battle of some kind. And I believe we can do that by exercising:"
        },
        {
            "heading": 2,
            "text": "Findings"
        },
        {
            "text": "Opening up and sharing personal stories while listening to the public has been the key to success. We wrapped up the session with a guest speaker, Matthew Graham, one of our Mental Health First Aiders (MHFA). Matthew discussed the existing support in place for our colleagues. In the end, there was lots of interest from attendees in becoming a trained MHFA."
        },
        {
            "text": "But there is one thing I didn’t plan for; the impact on my mental health at the end of the week. After a week of running about with the elephant, trying to get engagement, running a session and making sure it had the right impact. I prioritised being cautious about sharing the wrong information or using triggering words, especially when considering the large audience and their possible backgrounds."
        },
        {
            "text": "If you are curious, would I do the same thing again? YES, without a doubt! But there are a few things that I would consider and reassess, such as:"
        },
        {
            "text": "In the months to come, I was able to see the impact of the session, and the change in the vision when considering our service users."
        }
    ]
}