{
    "url": "https://gfie.blog.gov.uk/2021/07/05/our-growing-community/",
    "title": "Our Growing Community",
    "authors": [
        "danmason"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "A modern Civil Service",
        "A Skilled Civil Service",
        "apprenticeships",
        "build capability",
        "Care Leavers",
        "connect",
        "Inclusion",
        "levelling up",
        "Life Chances",
        "Prison Leavers",
        "Social mobility",
        "Veterans"
    ],
    "pub_date": "2021-07-05T11:19:46+01:00",
    "content": [
        {
            "text": "As the Going Forward into Employment community continues to grow, we meet some of those people who have set up schemes over the last year."
        },
        {
            "heading": 3,
            "text": "Glenda Devonald launched a life chances scheme in the Department for Business, Energy and Industrial Strategy (BEIS)"
        },
        {
            "text": "Tell us about your life chances scheme?"
        },
        {
            "text": "'The Programme is designed to help unemployed people who find it hard to compete through fair and open competition due to a lack of qualifications and/or work experience. BEIS want to help this group with the provision of a supported apprenticeship role, which could lead to a permanent position. The candidates will be jointly selected as part of an agreed pilot relationship with DWP'."
        },
        {
            "text": "Why did you want to get involved?"
        },
        {
            "text": "'Bringing in talent from a range of different sources provides an opportunity to build a more diverse Department in line with one of our Diversity strategy goals to be more diverse in our identity and thought. It also supports the new levelling up agenda'."
        },
        {
            "text": "What are your hopes for the scheme?"
        },
        {
            "text": "'We hope that this becomes a great way of bringing in and developing new talent, and that the apprentices secure permanent roles'."
        },
        {
            "text": "What would you to say to someone thinking about getting involved ? "
        },
        {
            "text": "'Go for it! The team were really helpful and the process was much easier than I expected'."
        },
        {
            "heading": 3,
            "text": "Emily Przybyla set up a traineeship scheme in the Department for Education (DfE)"
        },
        {
            "text": "Tell us about your life chances scheme?"
        },
        {
            "text": "'A traineeship is a work placement, designed for 16—24-year-olds who lack work experience to move into sustainable work or an apprenticeship. Traineeships are a skills development programme that includes a work placement and training course. Department for Education will provide the work placement'."
        },
        {
            "text": "Why did you want to get involved?"
        },
        {
            "text": "'We wanted to ensure that successful trainees could join the DfE after finishing their traineeship, so we have linked successful trainees to an apprenticeship position. I am part of DfE’s Apprenticeship team and wanted to get involved in running a new scheme aimed at supporting young people. I feel that this support is needed more than ever with the impact that the pandemic has had on young people and youth unemployment'."
        },
        {
            "text": "What are your hopes for the scheme?"
        },
        {
            "text": "'My hope for this scheme is to have run a successful traineeship pilot with our first ‘cohort’ of trainees. The overall aim is for all trainees to have a quality work placement with DfE, where they can learn valuable skills that will aid in their careers. It would also be brilliant to have a number of trainees progress into permanent employees and start on their apprenticeship with DfE'."
        },
        {
            "text": "What would you to like say to someone thinking about getting involved ?"
        },
        {
            "text": "'It was a simpler process than I had originally thought it might be! I was advised along the way by the team and had help drafting the exceptions bids. It’s also been really useful hearing about all the other schemes that are currently ongoing.   Research what is currently out there and what would fit your department the best'."
        },
        {
            "heading": 3,
            "text": "Alex Almukhtar has set up two schemes in the Crown Prosecution Service (CPS)"
        },
        {
            "text": "Tell us about your life chances scheme?"
        },
        {
            "text": "'We have two programmes in CPS – the first is an Apprenticeship Programme targeted at young people from low socio-economic backgrounds and they undertake a Paralegal apprenticeship. The second is an  External Solicitor programme, opening early next year it offers the solicitor an apprenticeship and permanent Crown Prosecutor post at the end'."
        },
        {
            "text": "Why did you want to get involved?"
        },
        {
            "text": "'Social mobility, diversity and inclusion are all really important to CPS. We pride ourselves on being an inclusive employer and are always searching for ways to provide opportunities to people who might not normally have access to them. Apprenticeships are a great tool for doing this, and a focus on social mobility is really the essence of what apprenticeships are meant to be about'."
        },
        {
            "text": "What are your hopes for the scheme?"
        },
        {
            "text": "'Hopefully it’ll be a big success with this first round as a proof of concept, and we can make it bigger and better every year'."
        },
        {
            "text": "What would you to say to someone thinking about getting involved ?"
        },
        {
            "text": "'It is much easier than you first assume! I think it sounds like it’ll be really difficult to get off the ground, but the team at Going Forward into Employment have been an amazing support and make it really simple to do – so go for it!'."
        },
        {
            "heading": 3,
            "text": "Amy Baldwin is working with the Going Forward into Employment (GFiE) team on a Care Leavers Scheme and on strategy and engagement across our Life Chances community"
        },
        {
            "text": "Tell us about your scheme?"
        },
        {
            "text": "'I’m working with the GFiE team on Strategy and Engagement - so I’m interested in all of the schemes accredited under exception2. I’m also leading on the GFiE Care Leavers scheme.  We’re working with Newcastle City Council to match Care Leavers into Civil Service roles.  I'm so impressed by the positive approach and \"can do\" attitude of everyone involved.   The Council wants to find roles for the brilliant young people they work with and the vacancy holders have been really thoughtful and creative in making sure that they got the very best from the candidates'."
        },
        {
            "text": "Why did you want to get involved?"
        },
        {
            "text": "'When I heard about GFiE I knew I wanted to be a part of it.  The work we are doing is closely aligned with my personal values. In my first couple of months I’ve been speaking to each of the schemes and the passion and commitment they have is really energising. The  stories of some of the brilliant colleagues who’ve joined the civil service via life chance schemes are inspiring'.  "
        },
        {
            "text": "What are your hopes for the scheme?"
        },
        {
            "text": "'For the GFiE care leavers scheme I hope that our first candidates have a great experience – that they gain confidence and skills and  enjoy their new roles.   Then I hope we can develop the scheme to support as many young people as possible'."
        },
        {
            "text": "What would you to say to someone thinking about getting involved?"
        },
        {
            "text": "'If you have a vacancy for an AA, AO or EO please consider offering an opportunity to a life chance candidate and recruiting via one of our schemes. We can find great candidates including care leavers, veterans, military spouse/partner and prison leavers.  Or you could volunteer to be a buddy to a candidate. Either way you can be part of providing opportunities and building a more inclusive civil service.  Get in touch with us and find out more at gfie@cabinetoffice.gov.uk"
        }
    ]
}