{
    "url": "https://movingon.blog.gov.uk/2021/07/05/securing-loads-and-maintaining-safe-roads/",
    "title": "Securing loads and maintaining safe roads",
    "authors": [
        "Mark Horton"
    ],
    "categories": [
        "Enforcement",
        "Safe driving"
    ],
    "pub_date": "2021-07-05T15:56:36+01:00",
    "content": [
        {
            "text": "Road users will often concentrate on the hazards in front of them.  But for vehicles pulling heavy loads, it’s often the hazard behind that’s the greatest threat."
        },
        {
            "text": "Ensuring loads are secure is vital for road user safety and it’s really important that you, as operators and drivers follow the guidance."
        },
        {
            "text": "Pulling a load over 40 tons, combined with an unsecured load with considerable height and the permitted speed on the UK’s road network, can create an incredibly dangerous combination."
        },
        {
            "text": "Hauling heavy goods is a serious responsibility and if it goes wrong, it can have serious consequences, that can and has ended in the loss of life."
        },
        {
            "text": "While we know the vast majority of you know this and take the issue seriously, there’s still a significant threat caused by the small portion of drivers who don’t. Our enforcement teams prohibited just shy of 1,000 vehicles that were clearly insecurely loaded between April 2018 and April 2019. If we could see that, so could those drivers."
        },
        {
            "text": "Think about an average road journey, and the countless vehicles you pass to put that figure into horrifying context. Especially when you consider the consequences…"
        },
        {
            "heading": 2,
            "text": "Guidance for drivers and operators on load security"
        },
        {
            "text": "In 2013, there were 22,000 road collisions in England due to objects falling from vehicles. We responded to this, by creating a video and guide to support vehicle operators and drivers transport loads securely. We updated our online guidance as recently as November 2020."
        },
        {
            "text": "But, it’s not only on the roads that load issues can cause problems. Items falling out of vehicles during unloading are a serious risk. The Health and Safety Executive (HSE) found that workplace transport accounts for over half of all death or injury incidents reported. A risk that isn’t worth taking."
        },
        {
            "text": "While the guidance is clear and our enforcement teams are patrolling to keep Britain’s roads safe, we are still seeing incidents with devastating consequences."
        },
        {
            "text": "Please take time to watch our video on safe loading practices below."
        },
        {
            "heading": 3,
            "text": "Check your load is secured before setting off"
        },
        {
            "text": "As the video shows, when you load a vehicle, you should ask yourself whether the load can:"
        },
        {
            "text": "If any of the above could happen, you’ll need to use load restraints. Relying on friction to secure a load is not enough."
        },
        {
            "heading": 2,
            "text": "Damage control"
        },
        {
            "text": "While the chief concern is for the safety of other road users, there is also the question of cost. Any load that is damaged in transit will come with a cost to the consumer hoping to use your load, the supplier, and an operator who may well have to foot the bill. This will cause disruption to people’s everyday lives."
        },
        {
            "heading": 2,
            "text": "Devastating consequences "
        },
        {
            "text": "Consider the impact an accident will have on you as the operator or driver. There is a possibility of prosecution, damaged reputation, and lost contracts. Above all, the weight of feeling responsible for injuries or in the very worst cases, someone’s life, can be devastating."
        },
        {
            "text": "Taking those extra moments to make sure your load is secure will keep your cargo and other road users safe whilst also reducing the risk of being stopped by enforcement officers."
        },
        {
            "heading": 2,
            "text": "What we’re doing"
        },
        {
            "text": "We’re working with industry stakeholders on load security to make sure that their input and experience feeds into the guidance we create. They provide us with information on the latest solutions on safely securing loads and highlight problems as they become aware of them. This helps us maintain our focus firmly on the latest in load security safety."
        },
        {
            "text": "We encourage you to be a leader in your industry and promote safe practices in the interests of all road users."
        },
        {
            "text": " "
        }
    ]
}