{
    "url": "https://civilservice.blog.gov.uk/2021/07/05/take-5-minutes-and-beat-meeting-fatigue/",
    "title": "Take 5 Minutes - and Help Beat Meeting Fatigue",
    "authors": [
        "Adrian Chesson, Deputy Director Economics Statistics Development, Delivery and Support Office for National Statistics"
    ],
    "categories": [
        "A great place to work",
        "Better policymaking"
    ],
    "pub_date": "2021-07-05T08:48:07+00:00",
    "content": [
        {
            "text": "Adrian Chesson offers some simple tips on how taking just five minutes can create a little bit of space to give a big boost to your wellbeing. "
        },
        {
            "text": "I am proud to be part of a team here at the Office for National Statistics,  honing and producing essential economic statistics, used across government and society to inform important decisions.  "
        },
        {
            "text": "Like so many, my colleagues and I had to make the shift to working from home when virtually everything  changed over a year ago.  With these overnight  changes came the urgent need to adapt and find new ways to support each other."
        },
        {
            "text": "Looking after each other "
        },
        {
            "text": "Watching for danger signs that a colleague  needs a little help, or recognising that someone in your team is perhaps overdoing it is crucial to keeping a happy, healthy workplace.  "
        },
        {
            "text": "Being prepared to listen and offering  support or sharing ideas that have helped with our own wellbeing can have a powerful impact.  "
        },
        {
            "text": "We need to do all this stuff  in normal times, but when the global pandemic hit, so many of us were thrown into a new world, this support became perhaps even more important. "
        },
        {
            "text": "Despite the challenges, I want to share  how we have given that little bit extra, checked in on colleagues and created a bit of breathing space to help look after ourselves. "
        },
        {
            "text": "Each month a different person on our team leads a range of wellbeing activities for the benefit of everyone.  The activities  are totally optional, but varied enough to appeal to most people whilst not so time consuming that people don’t want to engage.  "
        },
        {
            "text": "They include quizzes, little exercise challenges, stress and burnout awareness sessions, resilience training and so much more.  Combining this with  regular contact - on MS Teams and phone - and looking out for each other has helped strengthen our teams bond and developed a culture of supporting and boosting our wellbeing."
        },
        {
            "text": "Stay in touch"
        },
        {
            "text": "Most of the team were working from home so  back-to-back meetings were cramming our diaries.  We were striving to keep that regular contact going, for our work and to stay in touch.  "
        },
        {
            "text": "However, some of us were struggling to take a break. So to beat meeting fatigue, we introduced a simple but effective initiative to schedule the start of meetings five minutes later.  Only five minutes! I hear you cry!  Can that really make a significant difference?  Well, believe it or not,  yep!  "
        },
        {
            "text": "Reap the benefits"
        },
        {
            "text": "This practice spread fast, and now many of us are reap the benefits of taking five minutes out between meetings. Just enough time to rustle up  a a cup of tea (which for me is essential), take a break from the computer screen or perhaps to simply reflect on the previous meeting. "
        },
        {
            "text": "And if I may offer  a little extra  tip, we found it so much easier to schedule meetings to start five minutes later rather than rushing to finish meetings five minutes early."
        },
        {
            "text": "Making that difference "
        },
        {
            "text": "Some things we do to help support others may be quite big, others  may be small, but at the end of the day, for us, five minutes really has made a difference."
        }
    ]
}