{
    "url": "https://deframedia.blog.gov.uk/2022/11/26/times-coverage-of-bathing-water-pollution-inspections/",
    "title": "Times coverage of bathing water pollution inspections",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Pollution",
        "water"
    ],
    "pub_date": "2022-11-26T14:45:59+00:00",
    "content": [
        {
            "text": "There is coverage in the Times regarding the Environment Agency’s inspections of bathing water pollution incidents."
        },
        {
            "text": "They claim that the EA has privately issued guidance that weakens its inspection regime when people report pollution incidents. This is incorrect – the inspection regime has not changed and there will not be fewer inspections as a result of it."
        },
        {
            "text": "The EA remains responsible for classifying pollution incidents, not water companies. The guidance does not change the EA’s approach to classification or inspection."
        },
        {
            "text": "It instead emphasises taking a precautionary approach to pollution incidents, so as to provide bathers with the best information on the risks associated with bathing at affected bathing waters."
        },
        {
            "text": "The guidance is freely available on request."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "“There has been no change to how we classify and assess pollution incident reports."
        },
        {
            "text": "“We are promoting a precautionary approach which assumes a water quality impact has occurred unless proven otherwise, providing bathers with the best information on any risks associated with using affected bathing waters."
        },
        {
            "text": "“We continue to work with local communities and water companies to identify what action is needed to ensure cleaner and healthier waters for people to enjoy.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here"
        }
    ]
}