{
    "url": "https://teaching.blog.gov.uk/2021/10/25/how-school-leaders-can-benefit-from-a-free-recruitment-service/",
    "title": "How school leaders can benefit from a free recruitment service",
    "authors": [
        "David Earnshaw"
    ],
    "categories": [
        "Primary schools",
        "Secondary schools"
    ],
    "pub_date": "2021-10-25T09:47:09+01:00",
    "content": [
        {
            "text": "David Earnshaw CBE, Chair of Trustees at Outwood Grange Academies Trust (OGAT), talks about his experience as a school leader, during the COVID-19 pandemic and why he’d recommend Teaching Vacancies, provided by the DfE, to help with recruitment."
        },
        {
            "text": "The COVID-19 pandemic has impacted every aspect of school operations and this has presented OGAT with an opportunity to improve and evaluate recruitment practices. Teaching Vacancies was an obvious choice for us in taking a new approach to teacher recruitment, it's the official service for finding and listing teaching jobs provided by the DfE and is free of charge."
        },
        {
            "text": "Almost four in every five state-funded schools (81%) have already signed up to the service, with thousands of job-seeking teachers visiting the website each week."
        },
        {
            "text": "Saving schools money "
        },
        {
            "text": "Recruitment contributes to our overall budget, and, like many schools, we have been frustrated to see so much money spent on teacher recruitment advertising. Whilst the Trust has worked to keep recruitment advertising costs to a minimum, they have been increasing. Some large Multi Academy Trusts spend upwards of £500,000. Therefore, we were drawn to Teaching Vacancies’ zero cost offer and freedom to advertise as many times as we need."
        },
        {
            "text": "The money saved using the free listings service has been redirected into improving student outcomes. The use of Teaching Vacancies is encouraged for all of our schools, and, because of our Trust’s size, we are one of the highest users of the service in the West Yorkshire area. Our hope is that by swapping to Teaching Vacancies we can remove the cost of recruitment advertising completely."
        },
        {
            "text": "Saving schools time and providing more control"
        },
        {
            "text": "Teaching Vacancies puts schools in control of their own recruitment through one streamlined service. When listing a teaching job, you can upload supporting documents like application forms, job descriptions or video links. This gives potential applicants a taster of the school environment. As listing a job is a standardised process, you don’t have to spend time typing the same information across different websites or tailoring your advert to suit the format of a recruitment website."
        },
        {
            "text": "It also means schools don’t have to worry about posting a job at a particular time of day to catch the eye of prospective applicants and there’s no need to create paid-for adverts and banners, which can be an additional cost when using alternative recruitment services."
        },
        {
            "text": "Having a nationally available teacher recruitment service has the potential to work for everyone, it helps reduce fees and time spent advertising and gives schools autonomy in the recruitment process."
        },
        {
            "text": "All state maintained primary and secondary schools in England are eligible to use this service, to find out more visit the Teacher Vacancies website."
        },
        {
            "text": "List a teaching job."
        }
    ]
}