{
    "url": "https://naturalengland.blog.gov.uk/2021/10/25/rewilding-the-marches-mosses-britains-third-largest-raised-bog/",
    "title": "Rewilding the Marches Mosses – Britain’s third largest raised bog",
    "authors": [
        "Dr Joan Daniels MBE"
    ],
    "categories": [
        "Parks, trails and nature reserves",
        "Peat",
        "Protected sites and species"
    ],
    "pub_date": "2021-10-25T08:50:17+01:00",
    "content": [
        {
            "text": "By Dr. Joan Daniels, MBE, Natural England’s Marches Mosses BogLIFE Project Officer, at Fenn’s, Whixall & Bettisfield Mosses National Nature Reserve.  "
        },
        {
            "text": "For 30 years, I have been lucky enough to lead Natural England/Natural Resources Wales rewilding of the centre of Fenn’s, Whixall, Bettisfield, Wem & Cadney Mosses Special Area of Conservation (the Marches Mosses), which straddles the English/Welsh border near Whitchurch in Shropshire, and Wrexham. As we celebrate the 30th anniversary of the establishment of the NNR, I’ve paused to reflect on this incredible place and my work and the work of our Marches Mosses BogLIFE team in rewilding it."
        },
        {
            "text": "Together, the Mosses form a 1,000 hectare rainwater-fed lowland raised bog - a climax community. They developed here because of the amazing powers of Sphagnum bogmoss, creating cold, water-logged, nutrient-poor acidic conditions. Over 10,000 years, this resulted in the accumulation of a saturated peat dome 10m higher than the current flat, drained landscape. The bog swallowed up the wildwood and spread over the plain of glacial out-wash sand, to the limits of its enclosing moraines."
        },
        {
            "text": "However, for the last 700 years, this huge wilderness has been drained for agriculture, peat cutting, transport systems and more recently forestry and even a scrapyard. When I first walked the site in the late 1980s, I despaired. The centre of the Moss had a peat cutting drain every 10m, peat was stacked as far as the eye could see and mire plants and animals had been eradicated from most of the site. It looked like a desert – a desert in desperate need of being saved."
        },
        {
            "text": "A large increase in the rate of commercial peat cutting in the late 1980’s led NGOs to form the Peatlands Campaign Consortium to save the Mosses and others like it. The campaign was driven by Shropshire Wildlife Trust’s local volunteer Jess Clarke. North Wales Wildlife Trust staff, including myself, and SWT staff, aided by brave Nature Conservancy Council staff, particularly Mark July and Paul Day, pushed to get the UK government to take on the restoration of this devastated site."
        },
        {
            "text": "We succeeded in convincing the Nature Conservancy to acquire the centre of the Moss in 1990, because there was not enough raised bog habitat in good condition to meet Britain’s international conservation obligations. The new peat-extraction company agreed to sell because they found the Mosses peat quality was inadequate to meet their site-rental costs."
        },
        {
            "text": "We have worked doggedly to restore this precious peatland ever since. Natural England and Natural Resources Wales (NRW) have acquired progressively more and more of the bog, clearing trees and bushes that were smothering the peat, damming ditches and installing storm water control structures. Shropshire Wildlife Trust mirrored this on the smaller 28ha Wem Moss at the south of the peat body. The knowledge and skills of the Fenn’s Moss NNR team of ex-peat-cutters, particularly Bill Allmark, and Andrew and Paul Huxley, appointed with me in 1991, has been invaluable in understanding how to re-construct the Mosses."
        },
        {
            "text": "In 2016, an opportunity to purchase more peatland on the edge of the Mosses led to a successful funding bid for the five-year, £6 million pounds BogLIFE Project, funded by European LIFE and the Heritage Lottery Fund. Its goal is to make a step-change in the rate of rewilding of 660ha of the Mosses through a partnership of Natural England, NRW and SWT. I was more than willing to stay on to help with project management, designing and implementing the restoration projects and have found the work extremely challenging and rewarding."
        },
        {
            "text": "Importantly, the BogLIFE Project addresses a problem affecting all British raised mires – the loss of our mire edge “lagg” communities (fen, carr and swamp). The high water table of the “lagg” is important as it sustains that of the mire’s central expanse."
        },
        {
            "text": "I’ve been involved with the team in buying another 100ha of marginal forests, woodland and fields, clearing trees, disconnecting under-drainage, stripping turf, re-seeding 3 hectares  cleared peat with Sphagnum and using a new technique of linear cell damming or “bunding” to restore water levels. We’ve moved “lagg” streams, which were canalised within the peat to lower the marginal water tables during the Enclosure Awards 200 years ago, back to the bog’s margin, to enable disconnected areas of peat to be hydrologically reunited."
        },
        {
            "text": "The BogLIFE Project also involves adjusting dams on the central mire areas and bunding peat areas that haven’t got a cutting pattern to dam. We’ve even cleared up the scrapyard and have tried to tackle a problem that affects most nature conservation sites nationally – high levels of aerial nitrogen pollution and, at the Moss, its consequent high coverage of purple moor-grass."
        },
        {
            "text": "So why did we bother with this mammoth struggle on such a damaged peatland? In the 1980s, the main impetus for the fight to preserve the Mosses was its relict biodiversity - its rare specialist bog wildlife, its bog rosemary and cranberries, all three British sundew species, lesser bladderwort, white-beaked sedge, its raft spiders, large heath butterflies and moth communities including Manchester Treble-bar, Silvery Arches and Argent and Sable moths."
        },
        {
            "text": "Despite the devastation, this huge site provided corners for rare wildlife to hide in, waiting for the restoration of mire water tables. Those creatures, and the hope that we could rebuild a site worthy of them, drove me on."
        },
        {
            "text": "Today the vital sphagnum bog mosses have recolonised many areas and flagship species like the white-faced darter have been dragged back from the brink of extinction. Now, in spring, rare mire picture-winged species like Idioptera linnei dominate the cranefly community and the Mosses’ spider community is breaking national records. Regularly, invertebrate species, often new to either countries or counties, like micro-moth Ancyllis tineana emerge from hiding, and the wetland bird community now is of national importance."
        },
        {
            "text": "But today the reason for rewilding the Mosses is about building resilience in the face of climate change and also restoration of the ecosystem services provided by a functioning bog – regulation of water quality and flow, particularly important with increasingly-frequent flood events, and the re-pickling of the bog’s vast carbon store so its release doesn’t add to climate change and also encouraging future carbon sequestration."
        },
        {
            "text": "I’ve seen the growing pride for the restored Mosses in the local community and the increasing numbers of visitors from far afield, boosting the local economy. These are a testament to the success of rewilding this quagmire and will be helped by further sensitive access provision as the BogLIFE Project nears completion."
        },
        {
            "text": "Now, when I walk through the Mosses, I marvel at what I see. As a scientist, I am proud of what we’ve accomplished, while I see the work that remains to be done. Personally, I am amazed at the wildlife that make the Mosses their home, at the wide open skies and tranquillity of the place."
        },
        {
            "text": "The last 30 has just been a blink in the eye of a 10,000 year old bog. What will the next 30 years bring?  This project we’ve begun must continue. The threat of climate change is urgent and growing. Saving the Mosses and protecting the three million tonnes of carbon stored in the peat will prevent that CO2 escaping into the atmosphere. Continuing the work we started 30 years ago will ensure a home for the biodiversity on this precious site, store even more carbon and maintain a special place for people to reconnect with nature. What better way to spend my career?"
        }
    ]
}