{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/02/14/exploring-earth-observation/",
    "title": "Exploring Earth Observation",
    "authors": [
        "Lucy Hurford"
    ],
    "categories": [
        "Guest Blog"
    ],
    "pub_date": "2023-02-14T14:36:02+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is Earth Observation?"
        },
        {
            "text": "Earth Observation (EO) refers to the collection, analysis and presentation of data to better understand our planet. These data are collected by a range of instruments on land, in the sea, in the air, or in space."
        },
        {
            "text": "The National Space Strategy sets out that the UK has the potential to establish global leadership in EO applications and services. In November 2022, the Department for Business Energy and Industrial Strategy announced nearly £200 million of funding investment in the UK EO sector (read more)."
        },
        {
            "heading": 2,
            "text": "But why is EO important?"
        },
        {
            "text": "EO has huge potential to provide valuable insight and inform policy decisions spanning the remit of many government departments."
        },
        {
            "text": "For example, the UK Space Agency (UKSA) has supported the Surface Water Ocean Topography, or ‘SWOT’, mission, which launched from California in December 2022. The SWOT mission will use high-resolution altimetry data to survey at least 90% of Earth’s surface water to help further our understanding of climate change, and to help us predict and mitigate flood risks."
        },
        {
            "text": "The UK has a strong record of participation in the collaborative missions required to establish EO data from satellites and has contributed to the SWOT mission. On the engineering side, part of the innovative radar instrument was made by UK technology company Honeywell with funding support from UKSA. On the academic side, co-funding from UKSA and the Natural Environment Research Council is supporting research to calibrate and validate the SWOT satellite data with in-situ measurements in the Bristol Channel (read more)."
        },
        {
            "heading": 3,
            "text": "Use of Earth Observation across policy areas"
        },
        {
            "text": "EO data is especially powerful when combined with other types of geospatial data, such as that from citizen science or census data."
        },
        {
            "text": "Examples of areas where Earth Observation is currently or has potential to be used include."
        },
        {
            "heading": 2,
            "text": "Making the most of Earth Observation Data"
        },
        {
            "text": "With so many current and potential uses for EO data a big part of the work of the Defra Earth Observation policy team is making connections between opportunities for EO use across the Defra group, nationally, and internationally. The Defra EO policy team also facilitates the running of the Defra Earth Observation Centre of Excellence (EOCoE), a collaborative virtual hub bringing together EO expertise (read more)."
        },
        {
            "heading": 2,
            "text": "International Earth Observation"
        },
        {
            "text": "The intergovernmental Group on Earth Observations (GEO), is a partnership of more than 100 national governments and 140 Participating Organisations, convening global and inter-disciplinary expertise in a variety of ‘work initiatives’. The GEO work initiatives cover a wide range of topics,  with participants working to establish requirements, develop products, and utilise EO data collectively."
        },
        {
            "text": "The Defra EO policy team have been working to identify opportunities for strengthening UK engagement in international EO fora. Last year, representatives from the team participated in the GEO Week 2022 Plenary in Ghana, and the EuroGEO workshop in Greece."
        },
        {
            "heading": 3,
            "text": "Interested to find out more?"
        },
        {
            "text": "The UK GEO/CEOS Office, which is responsible for coordinating UK engagement in GEO and CEOS (the Committee on Earth Observation Satellites), is planning an in-person coordination meeting in early March 2023. If you work in a policy area where you think EO could be applied, and/or are interested in attending the event in March, please contact lucy.hurford@defra.gov.uk. To get in touch with the Defra Earth Observation policy team, please contact Earth-obs@defra.gov.uk."
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession. "
        }
    ]
}