{
    "url": "https://educationhub.blog.gov.uk/2023/02/14/the-turing-scheme-what-is-it-and-who-is-it-for/",
    "title": "The Turing Scheme: what is it and who is it for?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Skills",
        "Universities"
    ],
    "pub_date": "2023-02-14T12:56:27+00:00",
    "content": [
        {
            "text": "Over the past two years, the Turing Scheme has provided funding for schools, colleges and universities across the UK to offer their students the chance to develop new skills, gain international experience and boost their employability by studying and working across the world."
        },
        {
            "text": "As applications open to schools, colleges and universities, and the programme heads into its third year, find out more about the global experiences it has to offer here."
        },
        {
            "heading": 3,
            "text": "What is the Turing Scheme? "
        },
        {
            "text": "The Turing Scheme is the UK government’s programme to study and work abroad, supporting students and pupils to benefit from once-in-a-lifetime opportunities."
        },
        {
            "text": "It gives pupils, learners and students in UK schools, colleges, and universities the chance to learn new skills, travel the world, and boost their employability, all while learning about different cultures."
        },
        {
            "text": "The Turing Scheme also aims to widen access to international opportunities. This academic year, over half of the applicants due to take part in the scheme are from disadvantaged backgrounds."
        },
        {
            "heading": 3,
            "text": "Where could I go?"
        },
        {
            "text": "The Turing Scheme is fully international and allows participants to go anywhere in the world (subject to Foreign and Commonwealth Office travel advice)."
        },
        {
            "text": "This year, the Scheme is supporting 38,000 pupils, learners and students from across the UK the chance to travel to over 160 destinations across continents, from Albania to Zimbabwe."
        },
        {
            "heading": 3,
            "text": "Who can take part? "
        },
        {
            "text": "The Turing Scheme is aimed at:"
        },
        {
            "text": "Additional support is available to participants from disadvantaged backgrounds to cover the costs of travel, passports, and visas. Applicants with special educational needs (SEND) are eligible for funding to cover additional costs which arise as a result of being disabled and/or having a Special Educational Need, such as visits to help put reasonable adjustments in place."
        },
        {
            "heading": 3,
            "text": "How do I apply?"
        },
        {
            "text": "Schools, colleges and universities apply for projects on behalf of their students and receive funding per participant. Organisations can visit this link to apply – applications are open until April 6 2023"
        },
        {
            "text": "Contact your organisation to find out what funding is available and whether you’re eligible to take part."
        },
        {
            "heading": 3,
            "text": "What kind of things could I do?"
        },
        {
            "text": "From school trips to Iceland, to work placements in Australia, Turing Scheme participants have travelled across continents to work, study and experience different cultures."
        },
        {
            "text": "The possibilities are wide-ranging – but here are just a handful of examples:"
        },
        {
            "heading": 4,
            "text": "Rebecca Barker-Rourke is a teacher at Hyndburn Academy in Blackburn, where pupils spent two weeks in Eswatini or Morocco: "
        },
        {
            "text": "“We are in an area that is economically deprived in East Lancashire, and Turing Scheme funding means we can offer this opportunity to students that would otherwise never get the chance for a trip like this. Most of the students had never travelled abroad and we were able to pay for passports, for instance.”"
        },
        {
            "heading": 4,
            "text": "Ellie Hamilton is a catering student at South Eastern Regional College who spent two weeks on a work placement in Tennessee:  "
        },
        {
            "text": "“Learning about new foods and styles of cooking and how the line kitchen works – where the cook supervises a specific area of the kitchen and reports to the head chef – was very interesting. The trip has made me more culturally aware and more confident in my own skills and abilities.”"
        },
        {
            "heading": 4,
            "text": "Chris Sandever is an MPhys student at the University of Southampton, who spent a year on work placement with CERN, the European Organization for Nuclear Research in Switzerland."
        },
        {
            "text": "\"The placement has been amazing. It’s been a massive change of pace from learning four modules every semester and planning for exams, to trying to solve new, interesting problems in a field I still feel quite new to, on a 9 to 5 schedule. All in all, I couldn’t have wished for a better placement and I’m so glad I chose to do it.”"
        },
        {
            "text": "You can read about the differences between the Turing Scheme and Erasmus+ here."
        }
    ]
}