{
    "url": "https://deframedia.blog.gov.uk/2022/04/13/coverage-of-lump-sum-exit-scheme-opening/",
    "title": "Coverage of Lump Sum Exit Scheme opening",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-04-13T10:59:21+01:00",
    "content": [
        {
            "text": "Today we are looking at media coverage of our new Lump Sum Exit Scheme, following applications opening yesterday."
        },
        {
            "text": "On Tuesday 12 April 2022, Defra announced the opening of applications for the Lump Sum Exit Scheme to facilitate a voluntary planned exit from farming."
        },
        {
            "text": "The announcement has received widespread coverage across trade and regional titles, including in Yorkshire Post, Western Morning News, Scotsman, Farmers Weekly, Farming Life, Farming UK and Agriland. Supportive statements from the National Farmers Union and Tenant Farmers Association are also carried in the coverage."
        },
        {
            "text": "Farmers in England who wish to leave the industry can now apply for the new Lump Sum Exit Scheme which will provide a payment so they can exit the sector in a managed way. In return, farmers will be expected to either rent or sell their land or surrender their tenancy in order to create opportunities for new entrants and farmers wishing to expand their businesses. The Scheme will remain opened for applications until 30 September 2022."
        },
        {
            "text": "Defra also wants to support new entrants coming into the industry and will be giving more detail of our next steps in the near future."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "The Future Farming Resilience Fund, which provides free expert business advice to BPS recipients in England, is still open for applications. Our delivery partners will be able to support farmers in making decisions on how to ensure they have viable businesses or indeed to make the decision to exit the sector. A further phase of support will be launched in late September and will run until March 2025."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}