{
    "url": "https://teaching.blog.gov.uk/2022/04/13/early-intervention-and-support-for-students-in-alternative-provision/",
    "title": "Early intervention and support for students in alternative provision",
    "authors": [
        "Jeremy Dodd"
    ],
    "categories": [
        "Alternative provision"
    ],
    "pub_date": "2022-04-13T09:49:27+01:00",
    "content": [
        {
            "text": "Jeremy Dodd, Co-Headteacher at Academy of Central Bedfordshire (ACB), an alternative provision secondary school, explains how early intervention and the right support for pupils can have a transformative impact."
        },
        {
            "heading": 3,
            "text": "Focusing on learning and achievement"
        },
        {
            "text": "When your school is averaging a physical intervention every day and more than one exclusion every day, something has to change."
        },
        {
            "text": "This was the position just over four years ago at the Academy of Central Bedfordshire on our Stotfold campus. However, since then, we have demonstrated change is achievable with a 91% decrease in the use of physical interventions, a 92% decrease in the use of suspensions, and significantly improved academic outcomes."
        },
        {
            "text": "In our experience, we found that all too often Pupil Referral Units and alternative provision focused on the behaviours of the young people as being ‘wrong’ rather than communication about what the difficulties really are. We changed our focus to ensure we understood the underlying needs of children."
        },
        {
            "text": "Our vision was to build the future of our school based on the strength of our relationships with a strong focus on learning and achievement."
        },
        {
            "heading": 3,
            "text": "Transforming the school culture"
        },
        {
            "text": "To make this a reality we made a series of changes over the next few terms. We reframed everything we did with a positive emphasis and discussed the ‘whys’ with the young people themselves so they felt engaged and informed:"
        },
        {
            "text": "1. We introduced a four-stage arrival routine with welcome teams, breakfast teams and keyworker sessions in the morning before timetabled lessons, supporting everyone to “come in to land” and start the school day as gently as possible. This simultaneously has allowed us to identify issues and work through them together so that they do not impact negatively upon the day."
        },
        {
            "text": "2. Our pastoral team was re-tasked to help every young person arrive at their lessons feeling regulated and ready to learn. They led the development of building trusting relationships with our young people and we ensured there were safe spaces for conversations."
        },
        {
            "text": "3. Displays were coordinated in corridors and classrooms so that they were attractive and informative, but not overstimulating. Our teaching assistants were also assigned to specific subject areas to develop a deeper understanding of the curriculum with a focus on assisting teaching and supporting differentiation rather than addressing behaviours."
        },
        {
            "text": "4. Our timetable was redrafted to provide a standard daily structure providing a settled routine for our young people. Our curriculum was broadened and work experience was used to support post-16 ambitions. We invested in PSHRE and Careers Guidance through training so we could deliver this ‘in-house’, thus reducing barriers to accessing support."
        },
        {
            "heading": 3,
            "text": "Collating and tracking data"
        },
        {
            "text": "All of the work we did, and still do, is underpinned by the collection and analysis of meaningful data. In every lesson we record student engagement, behavioural measures, attendance, and progress against learning objectives and mastery descriptors."
        },
        {
            "text": "We produce ‘heat maps’ for each of our measures allowing us to track progress and challenges for each student, in each subject, with each staff member, in each lesson across every day. This allows us to respond to an emerging situation with positive changes made much sooner, directly leading to improved outcomes."
        },
        {
            "text": "The benefits of cultural change did not appear overnight, green shoots took a few months to emerge, but in the second year we saw dramatic improvements in student outcomes and reductions in negative measures."
        },
        {
            "text": "The messages from our young people and their families stay with us long after they have left, showing us that our approach is the right one and it is having the transformative impact we all wanted to achieve:"
        },
        {
            "text": "\"Thank you so much to each and every one of you for giving me my son back… forever grateful\""
        },
        {
            "text": "\"I feel like I’m something now…I’m part of a school here\""
        }
    ]
}