{
    "url": "https://civilservice.blog.gov.uk/2022/04/13/great-disability-debate/",
    "title": "Great disability debate",
    "authors": [
        "Lorraine Pereira"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-04-13T11:30:56+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Disability does not define me, it just makes me stronger, says civil servant Lorraine Pereira."
        },
        {
            "text": "Ok, let’s start at the very beginning, which is usually an excellent place to start. I was born with Spinal Muscular Atrophy (SMA) Type 3. "
        },
        {
            "text": "But I really did not know that I wasn’t the ‘same’ as my friends. They accepted my limitations, but my limitations seemed totally normal to me. At the age of 11, I went  to senior school and discovered that I now faced obstacles such as steps and stairs to overcome and also needed to get to class in a certain timescale. Bang! I realised that not only was I becoming a teenager - it dawned on me that some challenging times lay ahead."
        },
        {
            "heading": 4,
            "text": "Boarding school"
        },
        {
            "text": "I didn’t want to let people into my world and so stopped going to the secondary school, but was ultimately made to attend a boarding school. This led me to meet a lot of great people, but severely impacted the level of qualifications I could study. It also started a life of treated depression, which is difficult enough on its own."
        },
        {
            "text": "I lost count of the number of times growing up when I heard people talking about me in the third person."
        },
        {
            "text": " “Do you know she works full-time?” "
        },
        {
            "text": "“She’s married, she’s even had children.” "
        },
        {
            "text": "…and they say you should never assume. "
        },
        {
            "text": "My point is: when you look at someone’s disability from the perspective of the condition’s name, you don’t always get the right facts. It’s important to understand how that disability, whether visible or not, affects them and you on a day-to-day basis, as well as appreciating the extent of any support needed."
        },
        {
            "heading": 4,
            "text": "Make a difference"
        },
        {
            "text": "One size definitely does not fit all, and we are all individuals and we can make a difference in this world. You cannot change the cards you’ve been dealt. But you can make the best of this and support other people. Children growing up with disabilities need to focus on what they can do rather than what they can’t."
        },
        {
            "text": "If I could go back in time now and speak to myself as that young girl, I would acknowledge that, yes, there will be challenges ahead. However, you can still achieve your dreams and believe that you will improve your life. "
        },
        {
            "text": "Strong and confident"
        },
        {
            "text": "You should always try to remain strong and confident as this is what will allow you to be whoever you want to be. My turning point was having my children, working full-time and realising I could achieve so many things. Although sometimes it took me longer, I could achieve what I wanted from the blessing of having my two children, and now, two grandchildren. "
        },
        {
            "text": "Coming to terms with change is difficult for all of us, however when you look back upon life’s ups and downs, you realise the achievements and the barriers you have overcome. "
        },
        {
            "heading": 4,
            "text": "Great support"
        },
        {
            "text": "When I started working in the Civil Service in 1987, I had very little self confidence. However, meeting the public and working with great colleagues over the years has enabled me to build on these skills and to grow and flourish. I’ve had some great managers and CEOs over the years. I have one memory of a colleague who I had mentored and who I bumped into several years later. They told me that my confidence in them had enabled them to go on to make better career choices and develop themselves, something I had never really considered before. "
        },
        {
            "heading": 4,
            "text": "Positivity bubble"
        },
        {
            "text": "When you manage a team, you can motivate and influence them even by simple gestures such as thanking them for helping, and trying your best to be upbeat; creating a positive atmosphere makes a real difference to the team."
        },
        {
            "text": "For line managers, I advise them to never make assumptions about a disabled colleague, but strive to support and enable them to flourish and encourage them to show you what they can do, treating them the same as everyone else. This enables you not just to personally grow and develop, but also your colleagues, friends, and family, so the positivity bubble can get bigger, without you even realising it’s happening. "
        },
        {
            "heading": 4,
            "text": "A Modern Civil Service"
        },
        {
            "text": "I recently became an A Modern Civil Service champion. This has allowed me, at the age of 56, to bring some of the things that I’ve learnt over the years to the table. I was interested in this as I helped with the BETA project to look at how we align our Department for Work and Pensions values to our teams. As a disabled individual, I want to show that part of A Modern Civil Service means everyone can contribute and add value. "
        },
        {
            "text": "I’ve championed a few individuals; one had a hidden disability, and we talked through how she could use tools and overcome obstacles to get the promotion she wanted. By believing in herself and understanding that she was an important part of her team, she was ultimately successful in achieving that promotion."
        },
        {
            "text": "I came back to the Civil Service two years ago, after thinking I had retired. Now I can honestly say it’s the best job, alongside colleagues who strive to help and deliver every day, and who enable me to continue to be my best self."
        },
        {
            "heading": 4,
            "text": "Hope for change"
        },
        {
            "text": "I don’t think things will change dramatically in my lifetime, but I hope for future generations that people gain a greater understanding on how assumptions can significantly impact somebody’s life. You don’t need to tread carefully, I’m the same as anyone my age, it’s just that my body isn’t wired up correctly. Enjoy and appreciate your world and remember to not judge someone on appearance or speech but get to know the person first. "
        },
        {
            "text": "It’s worth repeating a great quote I heard from the Nigerian author Chimamanda Ngozi Adichie, whose work drew extensively on the Biafran war in Nigeria during the late 1960s."
        },
        {
            "text": "“Single stories create stereotypes. It’s not that they’re untrue, just incomplete.”"
        }
    ]
}