{
    "url": "https://environmentagency.blog.gov.uk/2022/04/13/have-your-say-on-proposals-to-improve-the-water-environment/",
    "title": "Have your say on proposals to improve the water environment",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-04-13T10:07:21+00:00",
    "content": [
        {
            "text": "Richard Thompson, Deputy Director - Water Strategy and Partnerships, Environment Agency"
        },
        {
            "text": "On 22 April, the Environment Agency’s consultation on the next round of river basin management plans (RBMPs) closes. The plans, delivered on behalf of the Environment Secretary, are important because they set local objectives for our shared water environment, help secure investment, set conditions in environmental permits and enable sustainable growth. So, it’s fair to say that, as the challenges facing water are increasing in the face of climate change, population growth and urbanisation, they are a pretty big deal to the Environment Agency and our partners."
        },
        {
            "text": "So, what do RBMPs actually do? Put simply, they pull together all the evidence about water in what we refer to as ‘river basin districts’ – that is, areas of the country joined together by rivers (this map shows where they are) and how organisations, stakeholders and communities will work together to improve them. For water bodies to be classed as ‘good’ under the Water Framework Directive (WFD) they must meet standards in a range of areas such as pollution, the numbers of fish and other aquatic life, and groundwater quantity. The plans are like a business case that sets out how much money is needed, who is responsible for the actions, how all the work will be done, and by who."
        },
        {
            "text": "Measuring the health of our rivers"
        },
        {
            "text": "The Government’s 25 Year Environment Plan has set a target for 75% of waters to be as close to their natural state as soon as possible, which is based on the RBMPs. So, they are a really important process to help meet this goal and summarise billions of pounds of investment to 2027."
        },
        {
            "text": "Waters are not in the condition we want. They are no longer improving. Only 14% of them currently meet the criteria for good ecological status under WFD, and that number has stayed stubbornly the same for several years. We are still seeing too much pollution from sewage, farming, industry and road-run off. Meanwhile new threats are seeping into waters, including microplastics and so-called forever chemicals.  We do know, though, that rivers have improved in some aspects because there are other ways we can measure their health aside from the overall categories set out in the WFD."
        },
        {
            "text": "You can read our case studies document for evidence where our work has improved things for rivers – for example, the ‘Natural Course’ project, a striking example of what can be achieved when partners came together to improve the whole of the North West’s water environment; and on the River Don in Sheffield, where salmon have returned for the first time in 150 years."
        },
        {
            "text": "Analysis of our data also shows that:"
        },
        {
            "text": "You can read our State of the Water Environment Indicators Report to look at the data in more detail. Under the ‘one out, all out’ requirement of the WFD it is difficult to show where things are progressing, as this isn’t always reflected in overall changes in good ecological status. Good ecological status results don’t tell the whole story of rivers."
        },
        {
            "text": "Looking to the future"
        },
        {
            "text": "Whilst the problems facing the water environment are extremely complex, as England’s environmental regulator we are using RBMPs as a tool to set and agree local objectives for shared waters to drive forward the changes we need to see. We have made good progress in protecting and enhancing water over the last couple of decades, but we still have a long way to go. Getting to lasting solutions will take decades, but we know what the problems are, and we know how to address most of them. Those are good foundations on which to build. But if we really want to shift the dial then we will also need to think and act differently, and everyone needs to play their part.  It is crucial that all those who use, rely on and are responsible for water take part in these consultations to help us take forward the right actions together to and help deliver the improvements we all need."
        },
        {
            "text": "Take part in the online consultation before 22 April - RBMP consultation"
        }
    ]
}