{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/13/hse-trainee-inspector-of-health-and-safety-eo/",
    "title": "HSE: Trainee Inspector of Health and Safety- EO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities",
        "Uncategorized"
    ],
    "pub_date": "2022-04-13T17:03:24+01:00",
    "content": [
        {
            "text": "The Health and Safety Executive exists to help prevent work-related death, injury and ill health. Our inspectors play a critical role on the frontline in the workplace; protecting people by preventing and investigating incidents and enforcing the law."
        },
        {
            "text": "Working across a wide geographic area, you will begin your career in a robust training programme involving a combination of field and classroom based training culminating in a post-graduate level qualification and promotion to the career grade for an Inspector. In training you will build a technical understanding of the law, safety technology and health matters as well as learning to analyse how companies manage these issue and deal with people at every level in a wide range of organisations."
        },
        {
            "text": "It’s a hugely varied and rewarding opportunity that offers the scope for continuous personal and professional development, as well as the chance to make a positive impact on people’s lives. Getting the perfect match between our culture, our work and you is incredibly important for both of us."
        },
        {
            "text": "As an inspector you will be involved in a range of activities, notably inspections and investigations. Where appropriate, you will use various legal processes such as enforcement notices and prosecutions to secure health and safety compliance."
        },
        {
            "text": "To register your interest and book a slot on our Trainee Inspector events, please visit our Eventbrite page here"
        },
        {
            "text": "For more information including a detailed job description and how to apply, please click here"
        },
        {
            "text": "Deadline: 11:30am on 05/05/2022"
        }
    ]
}