{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/13/hse-chemical-regulations-division-regulatory-scientists-eo/",
    "title": "HSE Chemical Regulations Division: Regulatory Scientists- EO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-04-13T16:51:35+01:00",
    "content": [
        {
            "text": "The UK leaving the EU offers an exciting opportunity to develop and shape our regulatory schemes for the future. With a world-class reputation for safeguarding the health and safety of people at work, HSE is adapting and evolving to meet the new challenges ahead. At CRD, we work with one goal in mind – to protect human health and the environment from the effects of potentially harmful substances and mixtures."
        },
        {
            "text": "To help us meet these challenges, we require a number of ambitious Regulatory Scientists to join our Human Health, Environmental and Regulatory Assessment Teams. You will work as part of a team and be responsible for technical assessments into regulatory programs on biocides, pesticides and general chemicals to support regulatory decisions in the UK. You will be expected to explain your decisions internally and externally, to Expert Committees, other government departments and relevant stakeholders."
        },
        {
            "text": "We have up to 80 opportunities for regulatory scientists to work in the following areas:"
        },
        {
            "text": "Posts A - Human Health Regulatory Scientists\nPosts B - Environmental Regulatory Scientists\nPosts C - Regulatory assessment managers"
        },
        {
            "text": "You will get hands-on experience of the work we do from day one, enabling you to gain knowledge in the regulation of chemicals and gain valuable experience in regulatory science; working with national and international legislation, communicating with stakeholders, scientific writing and development of skills in regulatory decision making."
        },
        {
            "text": "For more information on the job, please join us for our Information Webinar - details on how to register can be found here"
        },
        {
            "text": " "
        },
        {
            "text": "For more information including the detailed job description and how to apply, please click here."
        },
        {
            "text": "Deadline: 23:55 on Monday 2nd May 2022."
        }
    ]
}