{
    "url": "https://marinescience.blog.gov.uk/2022/04/13/introducing-the-marine-natural-capital-and-ecosystem-assessment-programme-mncea/",
    "title": "Introducing the Marine Natural Capital and Ecosystem Assessment Programme (mNCEA)",
    "authors": [
        "Lauren Szylarski"
    ],
    "categories": [
        "Animal Health",
        "Science",
        "Socio Economics"
    ],
    "pub_date": "2022-04-13T17:05:09+01:00",
    "content": [
        {
            "text": "Following a successful proof of concept year, the Marine Natural Capital and Ecosystem Assessment (mNCEA) programme began on 1 April."
        },
        {
            "text": "What is mNCEA and why is it important"
        },
        {
            "text": "Our vision it to create a platform for a thriving marine environment, where nature is at the heart of decision-making."
        },
        {
            "text": "Part of the broader Natural Capital and Ecosystem Assessment Programme, the mNCEA is Defra’s flagship 3-year research and development programme that will provide a robust evidence base, suite of tools and a framework where ecological, societal, and economic information is brought together in a holistic way. Improving our understanding and helping us make better decisions about the marine environment."
        },
        {
            "text": "Natural capital considers the value of nature for people and the economy and charges us to consider the ocean as a whole, interconnected system, rather than focussing on individual component parts like fishing, recreation or offshore wind."
        },
        {
            "text": "What will it achieve?"
        },
        {
            "text": "The programme is establishing new ways of working and gathering new and innovative evidence to measure the health of our seas and how it’s changing over time."
        },
        {
            "text": "By ensuring nature’s value is fully considered, mNCEA will ultimately transform marine decision-making in England across national and local governments, and in the private sector."
        },
        {
            "text": "The UK has some of the busiest seas in the world, despite looking relatively quiet from the surface. The natural capital approach provides a holistic and consistent approach to help us balance the interconnected and increasing pressures on the marine environment and improves our understanding of the complex trade-offs faced."
        },
        {
            "text": "How is it being delivered? "
        },
        {
            "text": "During 2021/22 we ran a proof of concept year to ensure that we could test and begin to develop an evidence base showcasing the advantages natural capital and ecosystem assessment approaches could bring to policy decision making."
        },
        {
            "text": "Considering the marine system as a whole, the programme works alongside its partners - Centre for Environment Fisheries & Aquaculture Science, Environment Agency, Joint Nature Conservation Committee, Marine Management Organisation, and Natural England - to deliver its projects and outcomes."
        },
        {
            "text": "The proof of concept year built on recommendations from recent reviews, including Natural Capital Committee, Marine Pioneer and Dasgupta review, whilst also identifying and filling strategic evidence gaps by delivering 21 foundation projects."
        },
        {
            "text": "Data and findings from the proof of concept year have built a strong foundation for how the programme will mature over the next three years. Final reports from the proof of concept year will be released over the coming months and will be available through Gov.uk Research Hub."
        },
        {
            "text": "Although the programme has a clear overall ambition, it is designed to incrementally deliver its projects and outcomes, in order to continually build on emerging evidence and to respond to the most up to date information and technology available. A new, ambitious and innovative way of working for government."
        },
        {
            "text": "Year one of the programme (22/23) will build on our strong start by:"
        },
        {
            "text": "Want to know more? "
        }
    ]
}