{
    "url": "https://ruralpayments.blog.gov.uk/2022/04/13/jake-mcclure-joins-best-leaders-around-the-world-to-champion-leadership-development/",
    "title": "Jake McClure joins best leaders around the world to champion leadership development",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Rural Payments service"
    ],
    "pub_date": "2022-04-13T16:23:05+01:00",
    "content": [
        {
            "text": "Jake McClure, Director of Organisational Development at the Rural Payments Agency, has been named a Chartered Institute of Management Chartered Companion."
        },
        {
            "text": "Jake will help lead the Chartered Institute of Management’s (CMI) 140,000 members and partners in transforming experience, expertise and ideas into leadership and management best practice, supporting the CMI’s mission of increasing the number and standard of professionally qualified managers."
        },
        {
            "text": "Chartered Companions are a select group of the best leaders around the world, they are pioneers and role-models. Companions share practical advice with professional managers across all sectors and career stages, for example by delivering talks, lectures, thought leadership, research, mentoring and content."
        },
        {
            "text": "Matt Roberts, Director of Membership at CMI commented: “CMI Chartered Companions are amongst our most valuable ambassadors in demonstrating our values and enabling us to drive up professional standards in management and leadership."
        },
        {
            "text": "“We’re delighted to recognise Jake as a Chartered Companion and look forward to working with him\"."
        },
        {
            "text": "Jake, based in Torquay, Devon, joined the RPA two-and-a-half years ago from City and Guilds, the global leader in skills development and apprenticeship schemes with 2million learners working on diverse qualifications every year."
        },
        {
            "text": "Jake was City and Guilds Executive Director of Strategy, working alongside senior management to reposition City and Guilds whilst also continuing to adapt and evolve the learning, at a dynamic time for individuals, businesses, and economies, to support change people’s lives through skills development."
        },
        {
            "text": "Jake, an experienced trustee and non-executive director, is currently a Board member at West London College."
        },
        {
            "text": "At the RPA, Jake led on developing the Social Mobility Strategy at the Department for Environment Food and Rural Affairs (DEFRA), supporting more people from across the England regions, from lower socio-economic backgrounds to have access to work and leadership and development opportunities."
        },
        {
            "text": "Jake also led on developing the first Chartered Management Degree in Environmental Sustainability at the Rural Payments Agency and DEFRA, and the Civil Service, again to ensure leaders are being developed with the critical leadership organisations now require, so they can continue to meet their strategic objectives whilst supporting climate action."
        },
        {
            "text": "Jake said: “I’m thrilled to be a CMI Chartered Companion, supporting people with their leadership development and journeys whilst also championing the value of having transformational leaders in organisations."
        },
        {
            "text": "“Raising leadership and management standards impacts positively on productivity and engagement within our organisations but also supports the economy and wider societal improvements.”"
        },
        {
            "text": "Jake will participate in CMI research, events, roundtable discussions, and support mentoring students and young managers as part of being a Chartered Companion. To mark this year’s 75th anniversary of the CMI, CMI is exploring the best practice for inclusive modern management and how leaders can fully maximise the talent available by removing barriers."
        },
        {
            "text": "Jake will also support with CMI projects, including the development of new Employability Bootcamps and the review being undertaken of CMI’s Professional Standard framework."
        },
        {
            "text": "Jake added: “I’m looking forward to working with the CMI and other Chartered Companions to support leaders across the UK and support more on their leadership journeys."
        },
        {
            "text": "“It is really important we all continue to champion best practice for inclusive modern management and how leaders can fully maximise the talent available by removing barriers."
        },
        {
            "text": "“It’s also great to be involved with supporting with the CMI initiatives during the 75th anniversary year.”"
        },
        {
            "text": "More on Jake: https://www.gov.uk/government/people/jake-mcclure"
        },
        {
            "text": "More on the CMI Chartered Companions: https://www.managers.org.uk/companions"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}