{
    "url": "https://naturalengland.blog.gov.uk/2022/04/13/offshore-wind-best-practice-advice-to-facilitate-sustainable-development/",
    "title": "Offshore wind – best practice advice to facilitate sustainable development",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Marine environment"
    ],
    "pub_date": "2022-04-13T17:36:25+01:00",
    "content": [
        {
            "text": "The Government has set ambitious targets for offshore wind and the recent British Energy Security Strategy is clear that offshore wind has a key role to play in tackling climate change and the UK’s move towards Net Zero, setting a target to deliver up to 50GW by 2030, including up to 5GW of floating wind."
        },
        {
            "text": "Natural England’s Approach to Offshore Wind sets out how Natural England will facilitate the sustainable development of low-impact offshore wind to tackle the twin climate and biodiversity emergencies. It is therefore essential that there is clear advice regarding the use of data and evidence to support offshore wind development and enable smoother consenting decisions."
        },
        {
            "text": "Natural England has been leading the ‘Offshore Wind Marine Environmental Assessments: Best Practice Advice for Evidence and Data Standards’ project, funded by Defra’s Offshore Wind Enabling Actions Programme (OWEAP)."
        },
        {
            "text": "The project is providing up-front best practice advice on the way data and evidence is used to support offshore wind farm development and consenting in English waters, focussing on the key ecological receptors which pose a consenting risk for projects, namely seabirds, marine mammals, seafloor habitats and species and fish."
        },
        {
            "text": "The project aims to facilitate the sustainable development of low impact offshore wind by increasing clarity for industry, regulators and other stakeholders over data and evidence requirements at each stage of offshore wind development, from pre-application through to post-consent."
        },
        {
            "text": "Stakeholder and industry engagement is an integral part of the project. The project team have undertaken extensive engagement with a stakeholder focus group with representatives from industry, regulators, examiners and landowners to obtain input, feedback and advice. JNCC and Cefas have also provided technical advice."
        },
        {
            "text": "UPDATE JULY 2022: The publication cycle has now concluded and the advice documents are available in their first iteration for each of the four phases of the project. These provide advice for baseline characterisation surveys of ecological receptors, pre-application engagement, data and evidence expectations at the application stage and post-consent monitoring plans. Minor updates have been made to Phases I, II and III for the purposes of consistency and cross-document referencing."
        },
        {
            "text": "The advice documents are considered ‘live’ and will be periodically updated to reflect evolving best practice in environmental assessments, new evidence, planning reforms or other relevant changes coming out of the Environment Act and in response to Government policy and initiatives, such as Project Speed and the recent British Energy Security Strategy."
        },
        {
            "text": "The project has made waves nationally and internationally and has already been shared with colleagues in Norway and Poland!"
        },
        {
            "text": "How to access the advice "
        },
        {
            "text": "The advice documents are currently stored on a SharePoint Online site, which will also host best practice advice for cable projects."
        },
        {
            "text": "Please note, for non-Defra staff, access to the SharePoint site needs to be requested from neoffshorewindstrategicsolutions@naturalengland.org.uk. Please allow up to three working days for requests to access the site to be granted. Natural England is currently reviewing ways of making the advice more accessible and open access."
        },
        {
            "text": "For any questions relating to the project, or Natural England’s other work facilitating sustainable offshore wind, please contact neoffshorewindstrategicsolutions@naturalengland.org.uk."
        }
    ]
}