{
    "url": "https://ukhsa.blog.gov.uk/2022/04/13/what-is-lyme-disease-and-why-do-we-need-to-be-tick-aware/",
    "title": "What is Lyme disease, and why do we need to be tick aware?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-04-13T15:04:21+01:00",
    "content": [
        {
            "text": "Lyme disease is an infection caused by a type of bacteria that is carried by some species of ticks. People can get the disease if bitten by an infected tick."
        },
        {
            "text": "People are most likely to be exposed to ticks when spending time outdoors in green spaces."
        },
        {
            "text": "Ticks and the potential risk of Lyme disease shouldn’t stop you from enjoying the outdoors, but there are various things you can do to avoid being bitten and to reduce the chance of being infected. This blog looks at what Lyme disease is, how it is treated and how we can avoid it."
        },
        {
            "heading": 2,
            "text": "What is Lyme disease?"
        },
        {
            "text": "Lyme disease is an infection that can be passed to people when they are bitten by an infected tick. People are most likely to encounter ticks when doing activities in the countryside or other green spaces such as woodland, some urban parks or gardens."
        },
        {
            "text": "Ticks are most active in the spring and summer months when the weather warms up but can be found all year round. There are estimated to be around 3000 cases of Lyme disease diagnosed in England each year."
        },
        {
            "text": "In the UK, Lyme disease is an uncommon infection and can be successfully treated with a full course of antibiotics. This is the case for most people who contract Lyme disease, but if left untreated, the infection can spread to the nervous system and other areas of the skin, joints or rarely to the heart. If the nervous system or heart is affected, then injected antibiotics may be offered."
        },
        {
            "text": "A very small number of people treated for early Lyme disease can develop more severe symptoms months or years later, however, this is usually if the treatment they receive is delayed or not completed. If you are exposed to Lyme disease, it’s recommended that you speak to your doctor if symptoms return or don’t improve."
        },
        {
            "text": "There is no reliable evidence that Lyme disease can be transmitted by any other bites (for example from mosquitoes, flies, fleas, spiders, or lice) and it cannot be transmitted from person to person by touching, kissing or having sex with someone with the infection."
        },
        {
            "heading": 2,
            "text": "What are the signs of Lyme disease?"
        },
        {
            "text": "Looking out for symptoms of Lyme disease, and checking yourself for ticks after you go to green spaces where they may be presentis very important. Prompt tick removal can reduce your chances of acquiring Lyme disease."
        },
        {
            "text": "Rapidly recognising symptoms can ensure that if you are developing the disease you can receive the earliest diagnosis and treatment from your GP. If you are bitten by an infected tick your symptoms will typically develop 1-4 weeks after being bitten, however, they can appear anytime between 3 to30 days after exposure."
        },
        {
            "text": "Symptoms include a spreading circular red rash, which may appear as a bulls-eye rash like the image below, as well as non-specific flu-like symptoms. Although a lot of people associate the disease with the rash, 1/3 of people don’t report seeing one."
        },
        {
            "text": "Other signs to look out for include muscle or nerve pains or a drooping facial appearance when the nerves to the muscles around the upper part of the face are affected."
        },
        {
            "text": "If you have developed symptoms after being bitten by a tick or spending time outdoors, immediately contact your GP or call NHS 111, mentioning where you have been and if you remember being bitten."
        },
        {
            "heading": 2,
            "text": "Are cases of Lyme disease increasing?"
        },
        {
            "text": "Studies in Europe estimate that 1-5% of tick bites can lead to Lyme disease. On average, between 2.5–5.1% of ticks are infected in England and Wales, although this range can fluctuate in different areas and across years."
        },
        {
            "text": "Since data collection began in 2005, there has been a general trend of increasing cases of Lyme disease, although yearly fluctuations have been observed. In 2021, there were a total of 1,156 laboratory-confirmed cases of Lyme disease in England and Wales."
        },
        {
            "text": "The rise in total cases may be due to a combination of increased awareness of Lyme disease as well as improved surveillance, better access to diagnostics, increased potential for encounters with ticks due to changes in wildlife populations and habitat modification that may have resulted in changes in tick distribution across the country."
        },
        {
            "heading": 2,
            "text": "What is ‘chronic Lyme disease'?"
        },
        {
            "text": "There is no agreed definition of the term ‘chronic Lyme disease’ among doctors so it can mean different things to different people. Some people use the term chronic Lyme disease to describe a range of non-specific symptoms including chronic tiredness and unexplained neurological symptoms, even when there is no evidence of past or current Lyme disease infection."
        },
        {
            "text": "The non-specific symptoms overlap with those of several other conditions including fibromyalgia and chronic fatigue syndrome, which can be triggered by common infections such as the glandular fever virus, and more recently COVID-19."
        },
        {
            "heading": 2,
            "text": "Should I get tested by the NHS or a privately funded laboratory? Is there a difference?"
        },
        {
            "text": "If patients have a recent tick exposure but no bull’s eye rash, guidance to NHS doctors in England is to take a blood sample and send it for testing at an NHS or UKHSA laboratory."
        },
        {
            "text": "The tests work by looking for antibodies that a person infected with Lyme disease would produce."
        },
        {
            "text": "The antibodies take some time to reach levels that can be detected,therefore, tests carried out within the first 4 weeks of infection may be negative and may need to be repeated on a fresh blood sample taken 4 to 6 weeks after the first test."
        },
        {
            "text": "We recommend people exercise caution with private tests and speak to their NHS doctor for advice before spending money on private tests or treatments, as some private laboratories and clinics offer tests and treatments for Lyme disease which may not be supported by scientific evidence."
        },
        {
            "text": "Diagnostic tests done outside the NHS may also produce false positives where the test shows positive for Lyme disease when the patient doesn’t actually have it. Our advice is to seek help through the NHS."
        },
        {
            "heading": 2,
            "text": "How can I prevent Lyme disease?"
        },
        {
            "text": "While walking in green spaces, consider wearing clothing that covers your skin to make it more difficult for ticks to access a suitable place to bite."
        },
        {
            "text": "Use insect repellent such as DEET and consider wearing light coloured clothing so that you can easily spot ticks and brush them off."
        },
        {
            "text": "After spending time outside, check yourself, your clothing, your pets and others for ticks. Remove any attached tick as soon as you find it using a tick-removal tool or fine-tipped tweezers."
        },
        {
            "text": "More information can be found on the NHS website."
        },
        {
            "text": "The idea of being bitten by a tick can be daunting. It is important to know that with the right precautions and by being tick aware you can help to protect yourself and your family from tick bites."
        },
        {
            "text": "Remember that advice and treatment is readily available through the NHS. So, if you think you have been bitten by a tick and have symptoms, contact your GP and accept the treatment that is offered to you."
        }
    ]
}