{
    "url": "https://nda.blog.gov.uk/will-you-be-an-ally/",
    "title": "Will you be an ally?",
    "authors": [
        "Sadia Samas"
    ],
    "categories": [
        "diversity",
        "Safety and Wellbeing"
    ],
    "pub_date": "2022-04-13T15:40:05+01:00",
    "content": [
        {
            "text": "Encouraging people to become an ally to their black, Asian and minority ethnic (BAME) colleagues is one of the ways that we in the BAME network are trying to help Sellafield Ltd to become a more inclusive business."
        },
        {
            "text": "The short video we’ve produced introduces people to some of the network and gives examples of how people can become allies."
        },
        {
            "heading": 3,
            "text": "What is an ally?"
        },
        {
            "text": "An ally is a person who fights for and supports others in their fight for equality, despite not necessarily being affected themselves."
        },
        {
            "heading": 3,
            "text": "How can you be an ally?"
        },
        {
            "text": "In the video we tried to give real examples of how people can be our ally."
        },
        {
            "text": "For example, when you walk into a meeting or an event, do you automatically gravitate towards people who look like you?"
        },
        {
            "text": "Could you approach someone who looked different instead? That act of being approached and engaged in conversation is a really simple way of making everyone feel included."
        },
        {
            "text": "Other examples given in the video include asking people how they pronounce their name, rather than excluding them from the conversation because you don’t know, and asking about religious festivals."
        },
        {
            "text": "Opening up a discussion or asking questions is a great start to raising awareness and becoming an ally, the key is being genuinely interested and also respectful in the way the questions are asked."
        },
        {
            "heading": 3,
            "text": "Want to know more?"
        },
        {
            "text": "Sellafield Ltd employees can contact the BAME network. Contact details are available on the intranet."
        }
    ]
}