{
    "url": "https://cspl.blog.gov.uk/2024/11/05/codes-of-conduct-independent-scrutiny-and-education-nolans-golden-threads/",
    "title": "Codes of conduct, independent scrutiny and education - Nolan’s golden threads.",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "30th Anniversary",
        "Ethical standards",
        "Nolan Principles"
    ],
    "pub_date": "2024-11-05T09:08:33+00:00",
    "content": [
        {
            "text": "In CSPL’s first report in 1995, Lord Nolan said three ‘golden threads’ were applicable right across all public life to maintain high standards:"
        },
        {
            "text": "‘All public bodies should have a Code of Conduct incorporating the seven principles of public life. Internal systems for maintaining standards should be supported by independent scrutiny. More needs to be done to promote and reinforce standards of conduct in public bodies, in particular through guidance and training including induction training.”"
        },
        {
            "text": "30 years on, codes of conduct are well established across public life and independent regulators oversee many areas of the standards landscape. A patchwork of ethical regulators including the Advisory Committee on Business Appointments, the Civil Service Commission, the Commissioner for Public Appointments, the Parliamentary Commissioner for Standards, the Adviser on Ministers’ Interests, the Registrar of Consultant Lobbyists and the Independent Parliamentary Standards Authority now exist - each with a specific remit and caseload. And although overall compliance levels are high, public perception of standards - which has remained low - is hard to shift. "
        },
        {
            "text": "In 2021, the Committee reviewed the now complex standards landscape to evaluate the strengths and weaknesses of the institutions, processes and structures in place and evaluate the effectiveness of standards regulation. The Committee made recommendations for reform in central government, calling for stronger rules, greater independence and a more rigorous compliance function to restore confidence in the regulation of standards. The Labour Party - and now government - committed to setting up an independent Ethics and Integrity Commission. The detail on what that the new body would do was limited both before the election and in their manifesto so it is hard to assess whether it will ease or add to the complexity of the landscape."
        },
        {
            "text": "Lord Nolan’s seven principles restated common standards expected across the public sector. The context in which public office holders operate also matters; different office holders can be subject to different types of standards risks. Adjudicating fairly on complaints or standards issues is something the independent regulators know isn’t always straightforward or popular. These are not easy jobs at times. That is why the Nolan principles themselves are so important. They are shared by all who serve the public, and it is the personal responsibility of each office holder to live up to them. Sitting above specific Codes of Conduct or detailed rules, the principles frame public expectation and require public office holders to use their own judgement."
        },
        {
            "text": "Transparency helps support Nolan’s second golden thread - independent scrutiny. Back in 1995, Lord Nolan was optimistic that greater transparency would do more to rebuild public trust. And while it is a vital part of upholding standards now, the link between ‘knowing more’ and ‘trusting more’ is not a simple equation. We have learnt that context matters. A lot. Recent stories about hospitality and gifts demonstrate these points well. Conduct that is within the rules and transparent may not be seen to be in line with the principles. The MPs’ expenses scandal of 2009 demonstrated the huge damage that can be done when the detail of rules and public expectations diverge. That was a costly period in terms of public trust. "
        },
        {
            "text": "Standards matters are regularly weaponised in party political crossfire. Having strong independent regulators in place to deal with allegations and complaints through due process is vital to maintaining public confidence and fair treatment of individuals. Regulators themselves require review from time to time to ensure their operations, policies and governance are maintaining the right balance. CSPL regularly participates in those consultations and reviews."
        },
        {
            "text": "The third golden thread - education - is one I am particularly keen to promote. Right across the public sector, we find the Nolan principles written in Codes and on lanyards, but are we making the space for staff to discuss ethics and standards regularly enough? Knowing what ‘doing the right thing’ is can be complicated at times. Nurturing organisational values and expectations takes time but is an essential part of leadership in the public sector if the public interest is to be properly served. "
        },
        {
            "text": "The job will never be finished. Maintaining standards requires regular, proactive attention, which was why John Major established CSPL as a standing committee 30 years ago to provide what he termed ‘a workshop for running repairs on our system’. We await the detail of the government’s proposals for the Ethics and Integrity Commission with keen interest and look forward to engaging constructively on its remit. But we all need to accept that however good it is, it’s not going to be a panacea. Maintaining high standards in public life requires constant vigilance, hard work and the willingness to adapt as challenges and circumstances arise."
        },
        {
            "text": "Doug Chalmers will be taking part in a panel event ‘What next for Standards in Public Life’ at the Institute for Government on 21 November.  "
        },
        {
            "text": "Find out more about the Committee’s work"
        }
    ]
}