{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/11/05/interview-with-kate-whitehead-diversity-and-inclusion-award-winner/",
    "title": "Meet the GSE award winners",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion"
    ],
    "pub_date": "2024-11-05T16:21:20+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Interview with Kate Whitehead, Diversity and Inclusion award winner"
        },
        {
            "text": "At the GSE Conference, we celebrated excellence in science and engineering by recognising outstanding contributions across government. There were awards in different categories, with eight key awards in total. We sat down with our award winners in this award blog series to hear more about their achievements."
        },
        {
            "text": "First in this series, we have our Diversity and Inclusion in Science and Engineering award winner, Kate Whitehead from West Yorkshire Police Regional Scientific Support Services (RSSS). This award honours those who have supported, promoted, or inspired diversity and inclusion within their organisation or in the broader science and engineering community. "
        },
        {
            "text": "Let's hear from Kate."
        },
        {
            "text": "GSE team: Hi Kate, what is your role and what do you do?"
        },
        {
            "text": "Kate: I am one of six Area Forensic Managers for Regional Scientific Support Services (RSSS) which provides forensic services to West Yorkshire, North Yorkshire, South Yorkshire and Humberside Police. My role is incredibly varied and consists of co-ordinating Crime Scene Investigation (CSI) and specialist resources at serious and major crime scenes. It also includes developing strategies to maximise forensic evidence, working with major crime teams to identify and convict offenders, managing a team of CSI supervisors and having oversight for RSSS health and safety and also diversity, equality and inclusion within the department. The work of RSSS and my role as Area Forensic Manager has recently been featured in a documentary TV series produced by Channel 5 entitled ‘Forensics – Murder Scene’."
        },
        {
            "text": "GSE team: How did you get into the area of government that you're currently working in?"
        },
        {
            "text": "Kate: Having gained a BSc (Hons) in Biomedical Science, I initially worked for the HSE Health and Safety Laboratory but had always had a keen interest in forensic science and analytical techniques, particularly toxicology. I saw the role of a Scenes of Crime Officer advertised locally and decided to apply – I liked the idea of combining my scientific background with helping victims and detecting crime. After a number of years, I was promoted to the role of CSI Supervisor and then subsequently Area Forensic Manager and I am now based in Wakefield, West Yorkshire. As Area Forensic Manager, I have oversight for the team of CSI’s and I quickly noticed that as a department we were not very ethnically diverse, the same can be said for policing in general, not just forensics. I really believe that in order to work effectively with the local community we must also represent it, so I approached our Senior Leadership Team and volunteered to lead on improving diversity, equality and inclusion within RSSS."
        },
        {
            "text": "GSE team: What does winning this award mean to you personally and professionally?"
        },
        {
            "text": "Kate: I wasn’t even aware I had been nominated for the award by my line manager, so to win was a huge surprise, at first, I even thought the email telling me I was a winner was some sort of scam. It feels incredible to have the work I do recognised on a national level, but I genuinely feel that the recognition is unwarranted, I am simply ‘doing my job’. Promoting diversity and inclusion within RSSS and West Yorkshire Police is just another important part of my role. Attending the Government Science and Engineering conference was very enjoyable (and somewhat daunting), but I felt proud to be representing West Yorkshire Police within such an assorted collection of government departments."
        },
        {
            "text": "GSE team: How important do you think it is for government science and engineering to be recognised in this way?"
        },
        {
            "text": "Kate: I think the awards are a great opportunity to celebrate the extraordinary work of so many GSE members and it really showcases the huge range of GSE departments and roles within."
        },
        {
            "text": "Thank you for talking to us, Kate, and congratulations again."
        },
        {
            "text": "Stay tuned for the rest of the winners’ series to find out more about the extraordinary science and engineering achievements across government."
        }
    ]
}