{
    "url": "https://healthmedia.blog.gov.uk/2024/11/05/the-tobacco-and-vapes-bill-what-you-need-to-know/",
    "title": "The Tobacco and Vapes Bill: What you need to know  ",
    "authors": [
        "eschwarer"
    ],
    "categories": [
        "Cancer",
        "Smoking",
        "Vaping"
    ],
    "pub_date": "2024-11-05T16:32:44+00:00",
    "content": [
        {
            "text": "The government has introduced the Tobacco and Vapes Bill, as set out in the King’s Speech. "
        },
        {
            "text": "This will be the biggest public health intervention in a generation – breaking the cycle of addiction and disadvantage and putting us on track towards a smoke-free UK. "
        },
        {
            "text": "Here’s what you need to know. "
        },
        {
            "text": "What are the key measures that have been announced? "
        },
        {
            "text": "The Bill will create the first smoke-free generation so children turning 15 this year or younger can never legally be sold tobacco.  "
        },
        {
            "text": "The Bill provides powers to extend the indoor smoking ban to specific outdoor spaces. In England, children’s playgrounds, outside schools and hospitals are all being considered, subject to consultation. "
        },
        {
            "text": "We are also taking powers to make most public places and workplaces that are smoke free, vape free too.  "
        },
        {
            "text": "The Bill will also ban the advertising and sponsorship of vapes and nicotine products and allow ministers to regulate the flavours, packaging, and display of vapes so that they do not appeal to children. All vaping and nicotine products will be banned from being sold to under 18s and we will also ban the free distribution of these products.    "
        },
        {
            "text": "To tackle the illicit market and protect legitimate businesses, the Bill also provides powers to introduce a new retail licensing scheme in England, Wales and Northern Ireland for tobacco, vapes and nicotine products and strengthens Scotland’s existing retail register. "
        },
        {
            "text": "It will also introduce a new £200 fixed penalty notice in England and Wales, which will enable Trading Standards Officers to act ‘on the spot’ to clamp down on offences such as underage sales. "
        },
        {
            "text": "The government will also be provided with powers to establish a new registration system for tobacco, vaping and nicotine products entering the UK market, which will strengthen consumer safety and overall enforcement."
        },
        {
            "text": "Will the Bill be UK wide? "
        },
        {
            "text": "The Bill is UK-wide and has been developed in partnership with the Scottish Government, the Welsh Government and the Northern Ireland Executive.  "
        },
        {
            "text": "It builds on the existing legal frameworks of all four nations to create a cohesive legal approach to regulating tobacco and vaping products.   "
        },
        {
            "text": "The extent of the measures varies across the UK respecting the devolution settlement.    "
        },
        {
            "heading": 2,
            "text": "Smoking "
        },
        {
            "text": "Why is it important to introduce these measures? "
        },
        {
            "text": "Smoking is the number one preventable cause of death, disability and ill health in the UK. It causes around 80,000 deaths a year, causes 1-in-4 of all cancer deaths and kills up to two-thirds of its long-term users.   "
        },
        {
            "text": "Prevention will always be better and cheaper than a cure and as part of our health mission, we will shift the health system from treatment to prevention by tackling the social determinants of health. "
        },
        {
            "text": "Will this impact people who currently smoke?   "
        },
        {
            "text": "The increase in the age of sale will be phased in over time, so no one who can legally be sold tobacco products today will be prevented from doing so in the future.     "
        },
        {
            "text": "Tobacco is uniquely harmful - there is no safe level of smoking and no other consumer product kills two thirds of its users. Smoking cannot be part of a balanced lifestyle or diet in the way sugar, salt or alcohol can. That is why we must act to protect future generations.    "
        },
        {
            "text": "Smoking rates are in decline in both adults and children, why are you doing this? "
        },
        {
            "text": "Smoking is still the biggest killer. It claims around 80,000 lives a year and puts huge pressure on our NHS, and costs taxpayers billions.  "
        },
        {
            "text": "The UK has stark health inequalities – people in the richest areas of the country live around a decade longer than people in the poorest areas – and smoking is one of the biggest causes. "
        },
        {
            "text": "Inequality is most evident in pregnant smokers - 19.4% in Blackpool smoke vs 3.4% in Kensington and Chelsea. "
        },
        {
            "text": "Children of smokers are 3 times as likely to start to smoke perpetuating the cycle of disadvantage and there is high prevalence amongst people with a mental health condition or those in routine and manual work. "
        },
        {
            "text": "How will this help the NHS and the economy? "
        },
        {
            "text": "Smoking costs the economy and wider society £21.8 billion a year.  "
        },
        {
            "text": "This includes an annual £18.3 billion loss to productivity, through smoking related lost earnings, unemployment, and early death, as well as costs to the NHS and social care of £3.1 billion.  This is equivalent to the annual salaries of almost 700,000 nurses, half a million GPs, half a million police officers, or over 500 million GP appointments."
        },
        {
            "text": "By protecting people from the harms of tobacco, we can help build a healthier society and a more prosperous economy. "
        },
        {
            "text": "What are you doing to support smokers to quit?   "
        },
        {
            "text": "To support current smokers, we will work to ensure that all hospitals integrate ‘opt-out’ smoking cessation interventions into routine care, making every clinical consultation count in health improvement. This legislation complements existing programmes to help smokers quit.  "
        },
        {
            "text": "Alongside the Bill, pack inserts will be introduced to support current smokers to quit by providing them with positive messages and advice. We will also explore expanding highly-effective standardised packaging to all tobacco products.  "
        },
        {
            "heading": 2,
            "text": " Smoke-free places "
        },
        {
            "text": "Where will smoking be banned outdoors? "
        },
        {
            "text": "Our approach will be guided by two public health objectives – we will prioritise protecting children and the most vulnerable, and we will target settings where there is prolonged exposure to second-hand smoke.  "
        },
        {
            "text": "In England, the preferred starting position is to extend smoke-free outdoor places to outside: "
        },
        {
            "text": "Exactly which settings should become smoke-free will be a matter for secondary legislation and our preferred starting position will be subject to a full consultation.  "
        },
        {
            "text": "We will follow the evidence and want to hear the views of the public, public health stakeholders and businesses."
        },
        {
            "text": " Are you banning smoking outside pubs and bars? "
        },
        {
            "text": "In England, hospitality settings, including outside areas of pubs and bars, will not be included in the proposed extension to the indoor smoking ban.  "
        },
        {
            "text": "We aim to strike a balance between protecting the most vulnerable and ensuring businesses are not financially harmed.   "
        },
        {
            "heading": 2,
            "text": "Vaping "
        },
        {
            "text": "Why won’t you ban vapes outright, just like tobacco? "
        },
        {
            "text": "The health advice on vaping is clear: vapes, when combined with behavioural support, can help adult smokers to quit, but children and adults who have never smoked should never vape. "
        },
        {
            "text": "The government is concerned about the worrying rise in vaping among children, with youth vaping more than doubling in the last 5 years and one-in-four 11-15-year olds having tried vaping in 2023."
        },
        {
            "text": " This is clearly unacceptable and why this government is taking strong action to end the deliberate targeting of vapes to children.  "
        },
        {
            "text": "What about disposable vapes? "
        },
        {
            "text": "It’s deeply worrying that a quarter of 11-15-year-olds used a vape last year and we know disposables are the product of choice for the majority of kids vaping today.  "
        },
        {
            "text": "Banning disposable vapes will not only protect the environment, but importantly reduce the appeal of vapes to children and keep them out of the hands of vulnerable young people. "
        },
        {
            "text": "A ban on the sale and supply of disposable vapes in England has been brought forward by DEFRA under environmental legislation separate to the Tobacco and Vapes Bill. Scotland, Wales and Northern Ireland have laid the same legislation for their nations.  "
        },
        {
            "text": "If passed, the ban will come into force on 1 June 2025 in all four nations of the UK. "
        },
        {
            "text": "What about vaping in public places? "
        },
        {
            "text": "We are also taking powers to make most public places and workplaces that are smoke free, vape free. Many places have already done this voluntarily."
        },
        {
            "text": "These measures will also be subject to a full consultation, and we will be guided by public health advice. In England, our preferred starting position is to include indoor places which are currently subject to existing smoke-free legislation; as well as outdoor spaces where children and young people are present, for example, children’s playgrounds and schools.   "
        },
        {
            "text": "This will enable us to clamp down on children vaping while continuing to enable adult smokers to use vapes as a quit aid. "
        }
    ]
}