{
    "url": "https://defrafarming.blog.gov.uk/2022/07/13/how-early-roll-out-of-the-sustainable-farming-incentive-is-going-an-early-update/",
    "title": "How early roll out of the Sustainable Farming Incentive is going – an early update",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-07-13T09:46:16+01:00",
    "content": [
        {
            "text": "It’s been almost 2 weeks since we opened the Sustainable Farming Incentive (SFI) for applications, so we thought now would be a good time to share an update on how it’s going so far. "
        },
        {
            "heading": 2,
            "text": "A system that works well for everyone"
        },
        {
            "text": "We’ve put in place a new service to make it easier for farmers to apply and quicker for us to process applications. This means that farmers can get started with their SFI agreement much quicker than has previously been possible."
        },
        {
            "text": "We’re rolling out the new service in a controlled way, so that we can make sure everyone gets the right level of service and support during these first few weeks. This includes carrying out some extra checks and monitoring in the background and continuing to refine and improve the service based on what we learn as more people use it."
        },
        {
            "text": "So far, the service is working well. We’re pleased that farmers have already started their SFI journey with hundreds already using the service. We’ve already had some good feedback from those of you using the service, with some describing it as “incredibly easy”, but we’ll continue to make improvements as we go, as we always planned. "
        },
        {
            "heading": 2,
            "text": "Processing applications more quickly"
        },
        {
            "text": "The service allows us to automate the checks we need to do and process applications to offer agreements much more quickly than we’ve previously been able to do."
        },
        {
            "text": "Within the SFI pilot, it took us an average of 6 months to process each application. We took the learning from that, and from existing schemes, to design a faster process for our new service. "
        },
        {
            "text": "Our aim is to process an application for the Sustainable Farming Incentive within 2 months. We’re currently managing to get through applications a lot faster than that – we're currently turning around agreements well within 2 weeks. The time it takes to go through each application varies, and we expect there will be busy and quiet periods for applications depending on farming activities."
        },
        {
            "heading": 2,
            "text": "New agreements starting every month "
        },
        {
            "text": "The start date for your agreement depends on when you submit your SFI application, how long it takes us to process it and how quickly you accept your agreement offer. "
        },
        {
            "text": "Your agreement won't start until you accept it. Once it’s ready for you to review on the Rural Payments service, you'll have 15 working days to accept. "
        },
        {
            "text": "If you accept your agreement by the end of the calendar month, it will start on the first day of the following calendar month. If you do not, it will start later, on the next available start date. "
        },
        {
            "text": "Your SFI standards agreement will last for 3 years from its start date, which you’ll find on your agreement document. You’ll start getting paid quarterly, starting within the 4th month of your agreement starting."
        },
        {
            "text": "You can learn more about this in the SFI scheme guidance on GOV.UK. "
        },
        {
            "text": "If you have any questions about our approach, do leave them in the comments. The team will pick them up. "
        },
        {
            "text": "Finally, don't forget to subscribe to the Future Farming blog for the latest updates."
        },
        {
            "heading": 2,
            "text": "How to apply "
        }
    ]
}