{
    "url": "https://apprenticeships.blog.gov.uk/2022/07/13/how-ifate-is-supporting-the-governments-climate-change-agenda/",
    "title": "How IfATE is supporting the Government’s climate change agenda",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprenticeship standards",
        "Employers",
        "Services"
    ],
    "pub_date": "2022-07-13T12:16:04+01:00",
    "content": [
        {
            "text": "Technical education and apprenticeships are important in both retraining the current workforce and equipping young people with the skills required for the transition to net zero."
        },
        {
            "text": "We’ve been working hard to support the Government’s climate change agenda. We already have a number of apprenticeships ready to help meet green skills needs, including sustainability business specialist, ecologist, and countryside ranger."
        },
        {
            "text": "Our work is focused on:"
        },
        {
            "text": "How can you get involved?"
        },
        {
            "text": "Could you bring a green perspective to the trailblazer groups we already have?"
        },
        {
            "text": "Trailblazer groups are responsible for developing occupational standards.  If you’re interested, please get in touch and we’ll connect you to the right group, as your insight will be invaluable."
        },
        {
            "text": "We are also seeking more trailblazer group members for the Retrofit Co-ordinator and Energy Efficiency Assessor apprenticeships, if you are interested in helping to develop these apprenticeships, please contact Construction.TRANSPORT@education.gov.uk"
        },
        {
            "text": "Making a difference to how we work at IfATE  "
        },
        {
            "text": "We listen to employers and stakeholders, and you have told us that the key to identifying green career pathways is through the evolution of current occupations to cover new and emerging job roles."
        },
        {
            "text": "Evidence shows that most of our need for green skills can be met within existing occupations. However, some brand new occupations will emerge with new apprenticeship and occupationally based training needs."
        },
        {
            "text": "We have developed a new search tool.  This will help apprentices, employers, training providers and other stakeholders find the occupations that include green job roles. This tool allows filtering of our apprenticeship products to show only those with green job roles."
        },
        {
            "text": "The green job roles data will accumulate from our trailblazers over time. All newly published apprenticeships will be flagged if they offer green job roles. This is in the filters for the apprenticeship search, to support employers identify which apprenticeships offer green roles.  So far, there are a small number of apprenticeships identified as containing green job roles, but over the coming months you will see more as we continue to incorporate our pre-existing catalogue."
        },
        {
            "text": "IfATE Green Strategy"
        },
        {
            "text": "We have a vision to contribute to the Government’s net zero ambition for 2 million new jobs by 2030, by supporting employers to create, endorse and engage with apprenticeships and technical education qualifications that are green."
        },
        {
            "text": "To do this we want to make sure we are contributing to the wider green agenda and are as forward-thinking as possible, working with employers and the Department for Education’s Unit for Future Skills to identify emerging skills needs."
        },
        {
            "text": "We will also continue to champion the role apprenticeships and technical education can play in reaching net zero by 2050. We are working to make our partnerships with government departments and wider stakeholders who are working on making this agenda stronger, making sure green apprenticeships and technical qualifications are a key part of the achieving net zero conversation."
        },
        {
            "text": "Later this year we plan to publish a refreshed green strategy, which will set out the occupational areas we will prioritise, how we will make sure that apprenticeships and technical education products deliver green skills, and how we will strengthen green processes within IfATE."
        },
        {
            "text": "We also know that stakeholders want to understand what green skills will be provided. We are working to improve the data available for green jobs and green skills, which involves defining green jobs and skills and collaborating across departments to make sure our data aligns across government."
        },
        {
            "text": "Building sustainability into apprenticeships and technical qualifications"
        },
        {
            "text": "We ask all trailblazer groups to apply IfATE’s Sustainability Framework when developing or revising products so that sustainability themes are always considered in a way that is meaningful to each occupation."
        },
        {
            "text": "We shared the Green Advisory Panel’s advice with over 150 trailblazer groups.  This advice shows how occupations map to requirements set out in the 'National Green Jobs Taskforce Report'."
        },
        {
            "text": "The initial themes we identified from the report as a priority were:"
        },
        {
            "text": "Energy"
        },
        {
            "text": "Agriculture and Forestry"
        },
        {
            "text": "Construction"
        },
        {
            "text": "Shift to Electric Vehicles including Battery Manufacture "
        },
        {
            "text": "Green and Finance and Innovation"
        },
        {
            "text": "Supportive of Green Economy "
        },
        {
            "text": "National Trailblazer Mapping to National Green Jobs Task force:"
        },
        {
            "text": "On 1 June 2022, we had received over 160 responses from trailblazers.  This is a great start with the rest on their way."
        },
        {
            "text": "Response from National Trailblazer Mapping exercise:"
        },
        {
            "text": "Trailblazer groups have responded positively to the challenge, and we are working with them to make the necessary changes. Trailblazers want to involve stakeholders with an interest in the green economy so that changes are meaningful and future proofed."
        },
        {
            "text": "Many of the apprenticeships in routes such as Construction and Engineering and Manufacturing are already in revision through our Route Review process.  We expect that any necessary changes will be part of that work."
        },
        {
            "text": "We will continue to consult our Green Advisory Panel and sub-groups to make sure we are covering the skills needed for the greening of the UK economy."
        }
    ]
}