{
    "url": "https://ipo.blog.gov.uk/2022/07/13/one-ipo-transformation-first-glimpse-of-the-new-patent-application-service/",
    "title": "One IPO Transformation: first glimpse of the new patent application service",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Digital",
        "Patents",
        "Transformation",
        "User research"
    ],
    "pub_date": "2022-07-13T09:13:51+01:00",
    "content": [
        {
            "text": "It’s just over a year since we launched our One IPO Transformation programme - a ground-breaking five-year project, in planned stages, that will see the biggest modernisation of our intellectual property rights services ever experienced by the IPO and its customers."
        },
        {
            "text": "Emma Ford, One IPO Transformation Project Lead, explains what you, our customers, can expect from our new patent application service...including  a first glimpse of what it will look like."
        },
        {
            "text": "There are two fundamental questions people ask us about intellectual property (IP). ‘What is IP?’ and ‘how do I get it?’."
        },
        {
            "heading": 3,
            "text": "So, what can you expect from your new application service?"
        },
        {
            "text": "We’re passionate about helping people truly understand and access IP, while providing lots of great improvements for seasoned IP veterans too. We’re excited to share more information and a first glimpse of what we’ve been working on. Here’s what you can expect:"
        },
        {
            "text": "We’re also thinking about how we can build on the work we have completed on the AI-powered Trade Mark Pre-apply tool and see where we can use Artificial Intelligence (AI) in the future to improve the service."
        },
        {
            "heading": 3,
            "text": "Where are we now?"
        },
        {
            "text": "We’ve started designing and testing early editions of the new application service. Below is a video demonstration. It focuses on patents, because that's launching first, but if you’re also interested in trade marks or designs you’ll still get a feel for what we’re aiming for. We’re still changing and improving the designs, so there’s plenty of time for you to give us feedback. The features that make it into the final design will change as we learn more."
        },
        {
            "heading": 3,
            "text": "Are there any other benefits?"
        },
        {
            "text": "We’re also making a huge upgrade to our internal systems. It will allow our staff to process applications more efficiently. We recently shared the news that we have cleared our examination backlogs. New internal systems will reduce the chances of big backlogs building up again in future."
        },
        {
            "heading": 3,
            "text": " What's next?"
        },
        {
            "text": "Over the next few months we’ll be refining and improving this design and working on our new internal systems at the same time. We’ll start building this new service on our new tech in July."
        },
        {
            "heading": 3,
            "text": "What do you think?"
        },
        {
            "heading": 3,
            "text": "Would you like to get involved as we test and improve our services?"
        },
        {
            "text": "Can you spare an hour of your time to become a user tester, helping us to test and improve our new systems as we’re building? Let us know by emailing us at usertesting@ipo.gov.uk."
        }
    ]
}