{
    "url": "https://hmlandregistry.blog.gov.uk/2022/07/13/register-of-overseas-entities-how-it-affects-land-transactions/",
    "title": "Register of Overseas Entities: How it affects land transactions",
    "authors": [
        "Pascal Lalande, Central Operations Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-07-13T14:37:42+01:00",
    "content": [
        {
            "text": "The Economic Crime (Transparency & Enforcement) Act 2022 requires overseas entities that own or acquire property in the UK to register with Companies House. Companies House intends to launch the Register of Overseas Entities on 1 August 2022. A link to the service will be shared with those subscribed to the Companies House newsletter once it’s gone live. It is planned that the land registration elements of the Act will come into force on 5 September 2022. This will allow time for those currently engaged in a relevant land transaction to comply with the requirement to register with Companies House and obtain an Overseas Entity ID (OE ID) number before making an application to the relevant land registry."
        },
        {
            "text": "Companies House will publish guidance on how to register the information they will require about persons who own or control the overseas entity. Once registered, Companies House will issue the overseas entity with an OE ID. More information on this can be found in this joint blog."
        },
        {
            "heading": 2,
            "text": "How will this affect registered proprietors and property transactions?"
        },
        {
            "text": "The Act prohibits any application being made to HM Land Registry to register an overseas entity as proprietor of land unless, at the time of the application, the overseas entity has obtained its OE ID."
        },
        {
            "text": "Overseas entities due to acquire land soon should start preparing now to apply for an OE ID. Once the Act commences, they may need to apply promptly to Companies House in time so they can still apply for land registration within their priority search period. We must reject a land registration application if an overseas entity is needed but has not been provided."
        },
        {
            "text": "Ultimately, the Act will prohibit overseas entities from transferring, leasing or charging their land unless, at the time of the disposal, they have obtained an OE ID."
        },
        {
            "text": "There are some exceptions that apply. In particular, anyone who successfully applies to register a transfer, lease or charge from an overseas entity that owned land when the Act commenced will not be prevented from registering the disposition by a restriction on disposition if they make their application within the first six months of the Act taking effect."
        },
        {
            "heading": 2,
            "text": "How has HM Land Registry prepared for these changes?"
        },
        {
            "text": "We have worked closely with Companies House to make the new register a success."
        },
        {
            "text": "We will publish amended versions of forms that will allow you to provide the OE ID. We are working on changing our external systems, including portal and Business Gateway APIs, to allow for the OE ID to be provided with your application."
        },
        {
            "text": "We will also be publishing an updated version of our Practice Guide 78 which will include detailed information about our requirements and guidance about how the Act will apply in different registration scenarios."
        },
        {
            "heading": 2,
            "text": "What should I be doing now?"
        },
        {
            "text": "If you are negotiating to buy, lease or take a mortgage from an overseas entity, remember: the provisions of the Act preventing the registration of dispositions by overseas entities that already own land will only affect the application to HM Land Registry to register your disposition if you lodge it more than six months after the Act commences."
        },
        {
            "text": "If you are an overseas entity landowner any disposition you make of land you already own can be registered within six months of commencement even if you do not have an overseas entity ID when you make the disposition. However, you will still have to comply with other reporting obligations in the Act. You may also find that the person taking the disposition still asks you to register with Companies House before they will proceed."
        },
        {
            "text": "If you are an overseas entity that owns property or is planning to purchase property you should start planning for these requirements now. Please also ensure you have read the latest blog posts published by Companies House about the secondary legislation for the Register of Overseas Entities. Secondary legislation, or statutory instruments, provide the practical measures needed for the Act to come into force. Companies House will publish detailed guidance on GOV.UK in the coming weeks."
        },
        {
            "text": "If, after considering this and the guidance provided by Companies House you do not know what effect the Act will have on your plans, you should take legal advice. Remember – plan ahead and expect the Act to come into force very soon."
        }
    ]
}