{
    "url": "https://educationhub.blog.gov.uk/2022/07/what-is-the-school-rebuilding-programme-and-how-is-it-benefitting-pupils/",
    "title": "What is the School Rebuilding Programme and how is it benefitting pupils?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-07-13T11:47:11+01:00",
    "content": [
        {
            "text": "All pupils should be able to learn in buildings that are fit for purpose. Some buildings in the school estate don’t meet the standards pupils or parents should expect – but the School Rebuilding Programme is fixing that."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the School Rebuilding Programme?"
        },
        {
            "text": "The School Rebuilding Programme carries out major rebuilding and refurbishment projects at schools and sixth-form colleges across England. Projects are prioritised according to the condition of buildings taking into account things like how poor the fabric and structure of the buildings are."
        },
        {
            "text": "All buildings in the School Rebuilding Programme are built to the latest construction standards, designed to be net-zero in operation and more resilient to the effects of climate change. New buildings will provide modern facilities to support a world-class education ranging from classrooms and science labs to sports halls and dining rooms."
        },
        {
            "heading": 3,
            "text": "How many schools are in the School Rebuilding Programme?"
        },
        {
            "text": "Over the course of this decade 500 schools will benefit from the programme. As of July 2022, 161 have been selected for inclusion."
        },
        {
            "heading": 3,
            "text": "How do you decide which schools get to benefit from the School Rebuilding Programme?"
        },
        {
            "text": "We prioritise schools based on how immediate and severe their need for improvement is. We ran a public consultation on how we should decide which schools are in the worst condition and have developed the application process from that. The consultation findings can be found here: Prioritising schools for the School Rebuilding Programme - GOV.UK (www.gov.uk)"
        },
        {
            "text": "We closed the most recent round of nominations in March and are currently assessing them."
        },
        {
            "heading": 3,
            "text": "Why is it so important that school buildings are improved? "
        },
        {
            "text": "We believe that it is important that all pupils, regardless of where they are from or their background, have access to facilities that will help them maximise their potential."
        },
        {
            "text": "The commitment to rebuild and refurbish the schools most in need is part of Government’s wider Schools White Paper commitments, to ensure that by 2030 every child will be taught a broad and ambitious curriculum in a school with high expectations and strong standards of behaviour."
        }
    ]
}