{
    "url": "https://marinescience.blog.gov.uk/2025/03/03/defras-one-food-programme-collaborates-with-united-nations-food-and-agriculture-organization-fao-on-systems-approaches-for-food-sustainability/",
    "title": "Defra’s One Food programme collaborates with United Nations Food and Agriculture Organization (FAO) on systems approaches for food sustainability.",
    "authors": [
        "Julie Bremner"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "Fisheries",
        "International",
        "Science",
        "Seafood Hazards"
    ],
    "pub_date": "2025-03-03T11:27:07+00:00",
    "content": [
        {
            "text": "The One Food programme team at the Centre for Environment, Fisheries and Aquaculture Science (Cefas) and Animal and Plant Health Agency (APHA) recently visited the FAO head office in Rome, Italy to co-lead a collaborative workshop on multi-hazard monitoring and early warning in agrifood systems. The aim of the workshop was to identify opportunities for collaboration between One Food and FAO’s development of a Multi-Hazard Dashboard for early warning of threats to food security."
        },
        {
            "text": "The One Food programme, funded through Defra’s Global Centre on Biodiversity for Climate and co-led by Cefas, APHA and South Africa’s Council for Scientific and Industrial Research and Human Sciences Research Council, is a pilot study in how to bring One Health approaches to food systems transformation, to maximise the potential for food systems to be simultaneously nutritious, accessible, economically viable, climate resilient, environmentally positive and socially equitable. The programme, which includes 21 UK, South African and global partners drawn from government, academia and non-profit, is organised around three main themes of ‘food system evidence’, a ‘One Food Risk Tool’ and ‘enabling change’. The programme has been developing and testing the themes in South Africa and the workshop is a natural extension of this, working with FAO to explore how the tools and knowledge can have impact long-term at a global level."
        },
        {
            "heading": 2,
            "text": "Transforming food systems for healthy people and planet"
        },
        {
            "text": "Opening the workshop, FAO Assistant Director-General and Chief Veterinarian Dr Thanawat Tiensin eloquently set the scene, highlighting the importance of collaboration and partnerships to advance a One Health approach in food systems and noting that “the One Food perspective is highly complementary and catalytic to the current efforts from FAO, at global and national levels.”"
        },
        {
            "text": "The workshop gave the opportunity to present the One Food approach and its principles of economic, environmental, and social sustainability. One of the central outputs of the programme is the ‘One Food Risk Tool’, a whole-system risk assessment tool, developed on the template of the earlier Seafood Risk Tool, which seeks to estimate the impact of all hazards (i.e. problems) acting on, or created by, food systems. The tool considers chemical, biological, physical and socio-economic hazards along different stages of the food value chain, across all food sectors. This allows the relative risk of hazards to be compared, actively embracing trade-offs and, in doing so, facilitating collective decisions on priority interventions."
        },
        {
            "text": "The collaboration with One Food has allowed FAO to review their current repertoire of >100 systems and tools that consider different aspects of animal/plant, ecosystem and human health and how these can be incorporated into their developing Multi-Hazard Dashboard. The report will soon be published on the One Food Community platform and will form the basis for future developments."
        },
        {
            "heading": 2,
            "text": "One Health synergies"
        },
        {
            "text": "What clearly emerged from the workshop was that the One Food Risk Tool and FAO Multi-Hazard Dashboard are strongly complementary; the hazard dashboard will provide a country/global snapshot of current presence and extent of animal, plant and environment health hazards, whereas the One Food Risk tool provides an assessment of the impacts of these hazards and identification of suitable mitigation strategies. Both One Food and the Multi-Hazard Dashboard are targeting ambitious goals and the group exchanged insights on challenges, successes, and best practices, focusing on optimising synergies between the initiatives as a means to address the complex interconnections between food, ecosystems, climate change and society."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The One Food pilot programme completes in March this year, providing an opportunity to develop further collaborations with FAO on One Health and the One Food approach for better, more sustainable food systems. The Assistant Director-General's subsequent letter of support highlights the importance of collaboration between these two important initiatives “reinforcing our commitment to continue working hand in hand to make significant strides in transforming agrifood systems to be more efficient, inclusive, resilient, and sustainable.”  "
        },
        {
            "text": "The whole experience for the One Food team has been very positive. FAO’s commitment to secure and sustainable food is fully evident in their ethos, from food waste measurement and hydroponics in the nutrition-positive canteen to the programmes of work they presented on hazard early warning and climate-driven food loss. In times of uncertainty, it is gratifying to see Defra-funded research align with and support FAO’s global efforts to feed the planet well and the collaboration with both the FAO and the South African government assures us that the One Food programme is having tangible impact."
        }
    ]
}