{
    "url": "https://insidedvla.blog.gov.uk/2025/03/03/gone-in-60-seconds-on-the-road-with-our-vehicle-tax-evasion-enforcement-team/",
    "title": "Gone in 60 seconds: On the road with our vehicle tax evasion enforcement team",
    "authors": [
        "DVLA External Comms"
    ],
    "categories": [
        "Features",
        "Vehicle tax"
    ],
    "pub_date": "2025-03-03T12:02:48+00:00",
    "content": [
        {
            "text": "We recently joined DVLA’s wheel-clamping partner, NSL, to find out how they’re tackling vehicle tax evasion in the Liverpool and Midlands regions."
        },
        {
            "text": "Our visit was part of a wider campaign targeting locations of the UK where vehicle tax evasion is highest. In 2024, we took enforcement action – which includes fines and clamping – on more than 120,000 vehicles in the Liverpool and West Midlands areas."
        },
        {
            "text": "NSL operate across the UK and work closely with local authorities and police forces who are able to use devolved powers to remove untaxed vehicles from our roads."
        },
        {
            "text": "So, what does a typical day on the road with NSL look like? Our team travelled to DVLA’s Widnes and West Brom vehicle pounds to find out…"
        },
        {
            "heading": 2,
            "text": "First stop: Widnes pound"
        },
        {
            "text": "We arrived at the pound where Enforcement Manager, Paul Davies, gave us a guided tour of the facility and the low down on the new fleet of state-of-the-art Automatic Number Plate Recognition (ANPR) vehicles."
        },
        {
            "text": "After learning about how the team operate, we were taken to the vehicle storage facility which featured a remarkable collection of vehicles of all shapes and sizes. Some of the more unusual ones included a 1984 mobile library that had been converted into a camper van, a Subaru Impreza from the 90s complete with rally stickers, as well as various newer luxurious brands such as Mercedes, BMW and Audi – all impounded for having no tax."
        },
        {
            "heading": 2,
            "text": "Park and hide"
        },
        {
            "text": "We hit the road with the enforcement team on one of their daily patrols where we received reports of an untaxed van that had been attempting to park and hide down a side street. Our campaign slogan felt appropriate here: ‘hard to hide, easy to tax’. The van was clamped within 60 seconds and the owner had to tax the van and pay a release fee – a cost that could have been avoided if the vehicle keeper had kept their vehicle taxed."
        },
        {
            "text": "Next, we recruited the work of NSL’s low loader lorry for some heavy lifting to pick up and impound an untaxed MINI in Warrington. This 20-year-old car had been abandoned on a residential street and the lift drew a small crowd of intrigued residents who were all too happy to see it gone. The car was in great condition for its age (except for its vehicle tax status), and so off it went on a MINI adventure to the pound."
        },
        {
            "heading": 2,
            "text": "Lights, ANPR cameras, action"
        },
        {
            "text": "Day 2 saw us on patrol again, but this time in West Bromwich and in one of the ANPR vehicles. Fitted with cameras on the roof, these vehicles can rapidly read vehicle registration plates and detect an untaxed vehicle instantly."
        },
        {
            "text": "As we made our way around the Midlands market town, it appeared that all vehicles were taxed as they should be – good work West Brom! We also noticed countless personalised registration plates featuring the letters WBA, what better way to pay tribute to the local football team West Bromwich Albion FC!?"
        },
        {
            "text": "However, there was no added extra time for this next vehicle. As we drove into a local industrial estate, thoughts of a fully taxed town were dashed when the ANPR camera detected an untaxed pick-up truck outside a mechanic’s workshop."
        },
        {
            "text": "The team got to work immediately adding a new eye-catching accessory to the vehicle – a bright yellow DVLA clamp. As we were about to leave, the owner emerged from the yard with no one to blame but himself. As he paid his tax online on the spot plus a release fee, it was clear that he’d be taxing it, rather than risking it in the future!"
        },
        {
            "heading": 2,
            "text": "The debrief"
        },
        {
            "text": "After an eventful 2 days, it was time to leave West Brom and head back to Swansea, but not before a debrief back at the pound. The visit gave us a real appreciation of the essential and sometimes difficult work undertaken by the enforcement team to crack down on vehicle tax evasion."
        },
        {
            "text": "While more than 98% of vehicles on UK roads are taxed correctly, a small minority continue to break the law which costs HM Treasury millions of pounds every year – vital funds which would otherwise go towards public services."
        },
        {
            "text": "It’s never been easier for motorists to tax their vehicles and there are a number of ways to do so from using our 24/7 online service to spreading the cost with Direct Debit options. "
        },
        {
            "text": "So remember, it’s important to make sure you tax your vehicle before using it on the road. It’s quick, easy and guarantees your vehicle avoids any yellow accessories or vehicle pound adventures! Tax it, don’t risk it."
        }
    ]
}