{
    "url": "https://hmlandregistry.blog.gov.uk/2025/03/03/how-caseworkers-investigate-easements/",
    "title": "How caseworkers investigate easements ",
    "authors": [
        "Andrew Smedley, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2025-03-03T13:50:03+00:00",
    "content": [
        {
            "text": "In Explaining easements – making the correct applications, we discussed the importance of identifying, at the outset, the full extent of the land affected by the grant of an easement and making the correct applications against all affected titles.  In this article, we will look at the registration requirements for easements in more detail and examine some of the issues we encounter on a regular basis. "
        },
        {
            "text": "For these purposes, we’ll assume the easement fulfils the general characteristics that make it capable of being a legal easement (see our practice guide 62 for more information), and that all the required application(s) have been made as described in our previous blog."
        },
        {
            "heading": 2,
            "text": "Initial investigation"
        },
        {
            "text": "As part of our initial investigation, we look closely at the definition in the deed of the land affected by the easement (the servient land), including any plans referred to. "
        },
        {
            "text": "Sometimes, we find that the servient land is not clearly defined. This might be because a definition is missing: for example, an easement is granted over the “Estate” but there is no specific definition of that term anywhere in the deed.  In such a case, we would have to send a requisition for the relevant definition to be added to the deed.  At other times, the definition is included but unclear. "
        },
        {
            "text": "We would recommend defining the servient land by direct reference to the relevant title number(s). This removes any doubt as to the land affected, thus preventing delays and avoiding future disputes.  "
        },
        {
            "text": "We also commonly find the ‘Estate’ is defined to include both the land in a specified title number (of which the grantor is the proprietor) “together with any other neighbouring land owned by the grantor” or “with any additional land to be acquired by the grantor at a later date”. This creates a degree of doubt surrounding the grant. We must be clear as to the extent of the servient land over which the easement is being granted at the date of the grant. "
        },
        {
            "text": "Such wording may therefore result in our raising a requisition or adding a note to the entry, stating that the easements are: “included in the title only in so far as the Transferor has power to grant the same and are capable of subsisting at law at the date of the grant”. "
        },
        {
            "text": "Once we are clear as to the extent of the servient land, we investigate the register(s) of the affected title(s) to establish the grantor’s power to make the grant."
        },
        {
            "heading": 2,
            "text": "Power to grant"
        },
        {
            "text": "Three common problem areas in this respect are restrictions, charges and leases. "
        },
        {
            "text": "The grant of an easement is a disposition by the registered proprietor. This means any restriction in the register of the grantor’s title which catches the grant of the easement must be complied with. This includes a restriction in favour of the proprietor of a registered charge.  "
        },
        {
            "text": "Remember that this requirement also applies to any additional registered titles over which the easement has been granted that are subject to such a restriction. This is an important point that is often overlooked, leading to a requisition. "
        },
        {
            "text": "When a registered charge affects the grantor’s land, the chargee has not consented to the grant and they exercise their power of sale, the easement may be overridden. "
        },
        {
            "text": "The charge does not in itself stop us registering the easement, so we won’t usually requisition for the chargee’s consent unless there is a restriction in favour of the registered chargee that catches the grant. "
        },
        {
            "text": "Instead, we may register the easement but include a note to explain that the chargee’s consent did not accompany the application and that the easement may be overridden should they exercise their power of sale. "
        },
        {
            "text": "For this reason, it’s important for the grantee to obtain the chargee’s consent to the grant of the easement, whether there is a restriction in favour of the registered charge on a servient title or not. "
        },
        {
            "text": "If part of the land affected by the grant has previously been leased to a third party, this may also affect the power to grant.  We investigate the terms of the lease to see whether it reserved the easement to be registered.  If not, the new easement may not bind the lessee. "
        },
        {
            "text": "Once again, we might include an appropriate note to reflect this in the entry we make. "
        },
        {
            "heading": 2,
            "text": "Plans"
        },
        {
            "text": "Finally, a few words about plans.  "
        },
        {
            "text": "Easements granted are usually defined by reference to a plan, so it is important that they are clearly shown on that plan using a line, edging or tinting as appropriate. "
        },
        {
            "text": "We regularly receive applications accompanied by plans that are not clear at all: for example, the colours are difficult to see and/or do not follow the underlying map detail.  This can lead to delays in processing and to requisitions. "
        },
        {
            "text": "Always make sure the plans are copied in full colour, they are signed by the grantor and give them a final check to ensure the easements are clearly defined before sending your application to HM Land Registry.  A bit of time spent at this stage can certainly save a lot of time later on! "
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "Our practice guide 62: easements provides more information on this subject. "
        },
        {
            "text": "For more information about preparing plans, head to practice guide 40, supplement 2."
        },
        {
            "heading": 2,
            "text": "Special requests"
        },
        {
            "text": "If there’s a land registration topic you’d like us to look at, please do get in touch. Email your suggestions to the Customer Communications Team."
        },
        {
            "text": "Please note, the Communications team cannot answer any queries about live casework."
        }
    ]
}