{
    "url": "https://buyingforschools.blog.gov.uk/2025/03/03/how-academy-transformation-trust-saved-over-1500000-through-better-contract-management/",
    "title": "How Academy Transformation Trust saved over £500,000 through better contract management",
    "authors": [
        "Tony Diaram, Project Manager at Academy Transformation Trust"
    ],
    "categories": [
        "Advice and support",
        "Services"
    ],
    "pub_date": "2025-03-03T12:55:33+00:00",
    "content": [
        {
            "text": "Tony Diaram, Project Manager at Academy Transformation Trust, shares how specialist contract management training has helped deliver significant savings across his trust."
        },
        {
            "text": "Academy Transformation Trust is a not-for-profit charitable trust of 22 schools across central England, including primary, secondary, special, and further education. As Project Manager, I have responsibility for contract management across all our academies which is both challenging and rewarding."
        },
        {
            "text": "With responsibility for approximately 300 contracts, ranging from facilities management to educational subscriptions, I thought it was time to get a formal qualification in contact management."
        },
        {
            "text": "When I first took on this role, our trust didn’t have a real grip on our contracts. Schools that had joined our trust brought their existing systems and agreements, creating a patchwork of different subscriptions, licences, and contracts. This decentralised approach meant we weren't maximising our buying power or maintaining consistent standards across our schools."
        },
        {
            "text": "Training impact and implementation"
        },
        {
            "text": "The contract management training has been transformative for me and our trust. We had often just renewed existing contracts in the past."
        },
        {
            "text": "Through the measures I have put in place to make contract management more efficient, we've achieved unprecedented savings across our Trust. The results have been nothing short of extraordinary, with three key areas delivering significant financial benefits:"
        },
        {
            "text": "• Minibus procurementWe've saved £35,000 through smarter procurement processes. A prime example of this was our approach to purchasing 13 minibuses - a £750,000 procurement. By using the knowledge acquired from the course, it gave me a better understanding of the specification and how to get the best value for money."
        },
        {
            "text": "• Facilities managementOur new facilities management contract is set to deliver an initial £200,000 rising to £1.5m in savings. This was achieved through careful contract negotiation and a more strategic approach to our facilities requirements across all sites."
        },
        {
            "text": "• Subscriptions and licencesOne of our most eye-opening achievements has been saving £325,000 on subscriptions and licences. We discovered numerous duplicated subscriptions, for instance, we were paying £153,000 for various educational supplements, some of which were available in our Management Information System."
        },
        {
            "text": "By conducting a thorough audit of our subscriptions, we've eliminated redundant costs while maintaining service quality."
        },
        {
            "text": "These are massive sums of public money and serious savings that make a real difference."
        },
        {
            "text": "The impact of these savings has been immediate and tangible, they are not just numbers on a spreadsheet - they represent real opportunities for our pupils and staff. We're now able to reinvest these funds in critical areas, including:"
        },
        {
            "text": "• new kitchen facilities at one of our secondary schools• enhanced IT infrastructure with new interactive whiteboards• video conferencing suite• student technology, including laptops and iPads for interactive learning• trust-wide subscription consolidation to maximise value for money"
        },
        {
            "text": "Building commercial capabilityTo ensure sustainable improvement, we're investing in our team's professional development. We've recently appointed a contract manager who is working towards a CIPS qualification. We're also designing robust processes for managing contracts and procurements to bring everything into one single system to operate more easily and efficiently."
        },
        {
            "text": "The Board of Trustees has been extremely supportive, recognising the potential that good contract management brings to our organisation. Putting into practice knowledge from the training, I've seen first-hand how investing in commercial capability can transform educational outcomes."
        },
        {
            "text": "The potential savings from good contract management are clear. But more importantly, it's about making every pound count for our pupils' education."
        },
        {
            "text": "For me, this journey has not just been about saving money - it's been about creating a more efficient, effective educational environment that benefits everyone in our trust community. The personal satisfaction of seeing these improvements translate into better resources and opportunities for our pupils makes all the effort worthwhile."
        },
        {
            "text": "*The figures quoted in this blog were supplied by Academy Transformation Trust and have not been verified by the Department for Education."
        },
        {
            "text": "Contract Management Foundation trainingYou can access the Contract Management Foundation training through the Government Commercial College site."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post. "
        }
    ]
}