{
    "url": "https://defradigital.blog.gov.uk/2024/04/19/being-assessed-and-assessing-a-tale-of-two-perspectives-part-one/",
    "title": "Being assessed and assessing – a tale of two perspectives: Part one",
    "authors": [
        "Jenny Taylor"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2024-04-19T07:00:05+01:00",
    "content": [
        {
            "text": "Jenny Taylor shares her experiences of having her work to design a new Defra Forms service assessed, and how she will apply the learnings in her future work."
        },
        {
            "text": "I wrote back in December about the Defra Forms project and how we are making our forms accessible and easy to use. I shared our intention not just to deliver a Defra form builder as a technological solution, but a new approach for how, as a department, Defra can create, manage, and benefit from a consistent approach to digital forms."
        },
        {
            "text": "This will ultimately involve a number of options and solutions, depending on the needs of the users, both within Defra group, and externally."
        },
        {
            "text": "Since then, the Defra Forms team have been working to test potential solutions, prototype some elements and continue to carry out user research to inform our designs of a new Defra Forms service."
        },
        {
            "text": "As a new service we have recently taken part in an Alpha Service Assessment to ensure we are working towards the Service Standard."
        },
        {
            "text": "I have been a Lead Assessor, assessing services within Defra and other government departments for seven years. I spent two and a half of those years in the role of Head of Service Assessments for Defra, where I coached teams preparing for assessments and providing training, guidance, and support to Defra’s community of assessors."
        },
        {
            "text": "Now as a Lead Product Manager it was only a matter of time before I would be on the other side of the table being assessed rather than assessing!  To say I felt vulnerable and anxious about the upcoming assessment is to put it mildly, and I had a severe bout of imposter syndrome a few weeks before."
        },
        {
            "text": "Would I be shown up as a hypocrite? Would everyone realise that I didn’t have a clue what I was doing? Would I undermine my own role as an assessor – who am I to assess others if I can’t demonstrate perfection myself?!"
        },
        {
            "heading": 2,
            "text": "Preparing for the Assessment"
        },
        {
            "text": "Having worked at Defra for some time, across several roles and teams, I have, over the years, built up a strong network of colleagues and mentors who I am fortunate to call upon for support and coaching."
        },
        {
            "text": "I reached out to other assessors and colleagues in digital delivery teams to test out the content the team and I were planning to demonstrate at our assessment. But also to seek feedback, well in advance of the assessment, for our approach to embedding user centred design in our delivery and our efforts to meet the fourteen-point Service Standard."
        },
        {
            "text": "I knew from my experience of assessing other services, that a common risk is for teams to present too much information, particularly at the start of the assessment in the ‘Show and Tell’ segment."
        },
        {
            "text": "It is difficult to strike a balance of setting the scene, communicating the ‘why’ and scope of the service, and not subjecting the audience to ‘death by PowerPoint’. In designing our show and tell the team and I focused on answering the following key questions:"
        },
        {
            "text": "We had a thirty-minute slot on the agenda to cover this, including a demo of the service. The slide deck we produced contained 17 slides plus a space for the demo. Crucially I designed the slides to enhance the presentation – so to provide a visual aid, and not to include a line-by-line readout of all that we planned to communicate."
        },
        {
            "text": "To keep the presentation engaging we also varied the speakers – our Service Owner kicked things off, setting the case for change and the landscape our service sits in, whilst as the Product Manager I spoke of the scope, users and insights we had gained so far."
        },
        {
            "text": "Within Defra Forms we are fortunate to have users embedded within our delivery team and this meant the demo of our prototype could be delivered by a user, giving excellent context and evidence to key design decisions and intentions for the service."
        },
        {
            "text": "After successfully keeping to time the team and I felt spurred on for the remaining elements of the assessment, which was broken up into disciplines each assessor would focus on: User Research, Design, Technology, Team, and Measuring Performance. Here the same approach was taken with the team preparing slides as a visual aid but planning only short presentations whilst still allowing time for questions from the assessors."
        },
        {
            "heading": 2,
            "text": "Key Reflections"
        },
        {
            "text": "As an assessor and having worked in an assurance role previously I feel I have been telling delivery teams for years that Service Assessments are a positive thing – a great opportunity to celebrate your hard work, to reflect on the decisions taken and how far you have come and to receive constructive feedback from peers with an impartial perspective and expertise in their field."
        },
        {
            "text": "I also know from experience that many people fear assessments, and dread the experience, and what the outcome might bring."
        },
        {
            "text": "I can honestly say that the Defra Forms team, whilst having a certain degree of nervous anticipation prior to the assessment, actually enjoyed the experience and benefitted hugely from it. Afterwards we felt more bonded as a team, proud of each other’s performances and contributions, and proud of the work we have produced."
        },
        {
            "heading": 2,
            "text": "Why do I think we experienced this success?"
        },
        {
            "heading": 2,
            "text": "Assessment Outcome"
        },
        {
            "text": "Defra Forms was rated “Amber” following the assessment. Under the new Central Digital and Data Office (CDDO) ratings this means we can proceed to Private Beta but there are some points the assessors felt must be addressed in order to be rated “Green”."
        },
        {
            "text": "We are confident these points are already in our plans, so this did not feel like a shock or disappointment, rather an accurate reflection of where we are, and we look forward to presenting further evidence to the panel soon.So, that was my experience as part of the team being assessed, but how did it feel to assess us?"
        },
        {
            "text": "In part two, David Thomas, a Programme Delivery Manager who was our Lead Assessor on the day, shares his thoughts, in particular how he tried to make the experience a positive one for us."
        }
    ]
}