{
    "url": "https://deframedia.blog.gov.uk/2024/04/19/coverage-about-upcoming-border-checks/",
    "title": "Coverage about upcoming border checks",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Food"
    ],
    "pub_date": "2024-04-19T10:37:48+01:00",
    "content": [
        {
            "text": "There has been reporting this morning (19 April) claiming that health and safety checks for EU imports won’t be “turned on” as planned from 30 April 2024. This is not the case, as has been previously outlined, we will be commencing checks from 30 April."
        },
        {
            "text": "The UK government has full confidence that the facilities, infrastructure and systems at the border, will be ready for the 30 April implementation date of new border checks."
        },
        {
            "text": "The priority for physical checks from day one will be on the highest risk goods, and Port Health Authorities will be conducting documentary checks on consignments of all risk levels and will contact traders where they have concerns. Checks will be scaled up to full check levels in a sensible and controlled way."
        },
        {
            "text": "A UK Government spokesperson said:"
        },
        {
            "text": "Our approach ensures we are striking the appropriate balance between protecting the UK from biosecurity risks and facilitating trade. We will continually review our enforcement approach tracking compliance levels to protect biosecurity and food safety whilst minimising disruption to trade flows.  Our enforcement approach will be graduated to help traders to comply."
        },
        {
            "text": "This follows extensive engagement with businesses – including regularly contacting 30,000 importers with up-to-date information, delivering over 50 webinars to thousands of businesses and working with major supermarkets and their suppliers to provide training."
        },
        {
            "text": " "
        }
    ]
}