{
    "url": "https://civilservice.blog.gov.uk/2024/04/19/empowering-people-unlocking-democracys-superpower/",
    "title": "Empowering people: Unlocking democracy’s superpower",
    "authors": [
        "Catherine Day1"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-04-19T12:46:14+00:00",
    "content": [
        {
            "text": "Cabinet Office civil servant, Catherine Day, visited the London Borough of Waltham Forest’s Neighbourhood Policing Citizens’ Assembly to explore how such assemblies work and their impact. She convenes a cross-government participatory methods forum to improve broad-based participation in policymaking."
        },
        {
            "text": "As civil servants, our job is fundamentally about connecting government with the people it serves. Yet over the course of my career, I have found meaningful citizen engagement to be as challenging as it is invaluable. Whether working on national security or housing strategy, on policy or operational delivery, the challenge is the same. How can we most effectively harness the rich diversity of our population to deliver better policy?"
        },
        {
            "text": "Discovering democracy in action"
        },
        {
            "text": "One sunny Sunday in March, I experienced one answer to that challenge at Waltham Forest Borough Council’s citizen’s assembly on neighbourhood policing. A large, airy room was full of the quiet buzz of some 50 local people of all ages, ethnicities, occupations and genders talking purposefully in small groups. This was the last of five days of intense learning and deliberation spread over three weekends. As part of a process led by the charity Involve, assembly members were working through the various trade-offs involved in deciding the future of policing in their neighbourhood and putting together final recommendations."
        },
        {
            "text": "Harnessing democracy’s superpower"
        },
        {
            "text": "Citizens’ assemblies are just one way of tapping into democracy’s superpower. From routine public information and consultation to empowered decision-making processes like participatory budgeting, there is a spectrum of methods for involving people. Technology expands the possibilities, with platforms like pol.is and the government’s Collective Intelligence Lab creating new ways of engaging."
        },
        {
            "text": "Collaborative approaches like citizens’ assemblies have been used all over the world to help foster consensus, trust and innovative solutions to complex challenges. Over the last decade, the Irish Government has routinely held assemblies on issues ranging from abortion to drugs abuse, transforming Irish society in the process. The Scottish Government has commissioned assemblies on climate and the country’s future. Many local authorities have held citizens’ panels, juries and assemblies and Parliamentary Select Committees have used collaborative methods on issues relating to justice, policing and Northern Ireland. The Organisation for Economic Cooperation and Development has collated and analysed over 700 examples. "
        },
        {
            "text": "The “missing voice of Londoners”"
        },
        {
            "text": "The most effective assemblies are characterised by a commitment by decision-makers to engage with both the process and recommendations. In Waltham Forest, the Council’s commitment was palpable. A review into the behaviour and culture of the Metropolitan Police after a police officer murdered Sarah Everard had urged police to listen to the “missing voice of Londoners”. That horrific murder together with a mismatch between relatively low local crime rates and people’s perceptions that crime rates were high had strengthened the Council’s determination to restore trust in the police. With Involve, they meticulously crafted a process and space to involve local people and do just that."
        },
        {
            "text": "For me, three things stood out:"
        },
        {
            "text": "It is too early to gauge the assembly’s overall impact, but the early signs are that a whole range of benefits should flow from the process."
        },
        {
            "text": "Harnessing collective endeavour"
        },
        {
            "text": "The power of people coming together, in a spirit of shared endeavour, to work on shared problems is tangible. You can feel it. We all want to deliver policies that foster security, opportunity and societal wellbeing and improvepeople’s lives. Few of us have the opportunity to make such a practical contribution. Experiencing this citizens’ assembly in action brought home the power of these opportunities to deliver better outcomes. It is an opportunity that we must take. To learn more or get involved, join our cross-government participatory methods forum (email catherine.day@cabinetoffice.gov.uk) or take part in our online debate. And if you have a chance to visit, run, or contribute to a citizens’ assembly, jump at it!"
        },
        {
            "text": " "
        }
    ]
}