{
    "url": "https://minimumwage.blog.gov.uk/2024/04/19/what-will-the-minimum-wage-be-next-year/",
    "title": "What will the minimum wage be next year?",
    "authors": [
        "eduinlatimer"
    ],
    "categories": [
        "Bite",
        "National Living Wage",
        "UK minimum wage rates"
    ],
    "pub_date": "2024-04-19T10:00:20+01:00",
    "content": [
        {
            "text": "‘What will the minimum wage be next year?’ This is a common question we hear from workers and employers on our visits around the country. Though the final recommended rate is agreed by Low Pay Commissioners through a negotiated process,  we can still provide guidance on what kind of increases are consistent with our remit from the Government. To do this, we project a range for next year’s National Living Wage (NLW, the minimum wage for workers aged 21 and over). This is currently £11.65 to £12.18, with a central projection of £11.89, although forecasts could change over the year. In this blog, we’ll explain how we make this projection and how it relates to the recommendations Commissioners will make in the autumn."
        },
        {
            "text": "Figure 1: Actual and projected National Living Wage rates, 2019-2025"
        },
        {
            "text": "The Government has asked us to recommend a minimum wage rate equal to two-thirds of median earnings"
        },
        {
            "text": "The Low Pay Commission recommends minimum wage rates each year, based on a remit set by the Government. We make our recommendations in October each year, and the new rates come into force the following April. Our recommendations cover both the NLW for workers aged 21 and over, and separate rates for young people and apprentices. For these latter groups, the Government has asked us to raise the minimum wage as high as possible without damaging the employment prospects of the affected workers. For the NLW, though, our approach is different."
        },
        {
            "text": "Since 2016, the Government has asked us to set the NLW according to a target relative to median hourly pay. First, it asked us to raise the NLW to 60 per cent of median hourly pay by 2020, then to two-thirds of median pay by 2024. Having reached the two-thirds target, in this year’s remit the Government asks us to maintain the NLW at two-thirds of median hourly pay in 2025."
        },
        {
            "text": "Since the Government has asked us to make a recommendation with reference to median hourly pay, we can give workers and employers advance guidance to roughly what the rate might be. To do this, we need to estimate what median hourly pay will be next year."
        },
        {
            "text": "We make a projection of the 2025 National Living Wage in three steps:"
        },
        {
            "text": "Step 1: Estimate baseline median hourly pay ​"
        },
        {
            "text": "We take the most recent estimate of median hourly earnings from the Annual Survey of Hours and Earnings (ASHE), an employer survey of 1 per cent of employees in PAYE as our baseline. The latest (April 2023) estimate of median pay for workers aged 21 and over was £15.98 (the navy dot on Figure 2 below). When we make our recommendations in October 2024, we will have a new baseline from April 2024."
        },
        {
            "text": "Step 2: Estimate pay growth from baseline median hourly pay​"
        },
        {
            "text": "Next, we estimate pay growth from the baseline (April 2023) to October 2025 (the target date). We use October 2025 as the target date as it is the midpoint within the financial year (2025/26) that the rate will apply.  To do this we use two data sources:"
        },
        {
            "text": "This step gives us an estimate of median hourly pay in October 2025 (orange dot on Figure 2)."
        },
        {
            "text": "Step 3: Calculate two-thirds of median hourly pay in October 2025"
        },
        {
            "text": "Finally, we need to go from this projected median pay to a projected NLW rate. We do this by taking two-thirds of our forecast of median hourly pay in October 2025. This gives a central projection of £11.89 (the yellow dot on Figure 2)."
        },
        {
            "text": "There is uncertainty around these projections, since they rely on a proxy for wage growth and forecasts. To show this, we display a range of projections around our central projection. This range allows for pay growth to be one percentage point faster or slower each year from our baseline."
        },
        {
            "text": "Figure 2: Illustration of 2025 on-course rate projection, April 2023 - October 2025 "
        },
        {
            "text": "What is the role of the social partnership?"
        },
        {
            "text": "Making recommendations on the minimum wage requires evidence and forecasts but also judgement. The Government’s target of two-thirds is not unconditional."
        },
        {
            "text": "When Commissioners meet in October 2024 to agree their recommendations they will consider the latest projections of median hourly pay, alongside all of the other evidence we collect over the year. This includes analysis of the impacts of recent changes, consultation responses and many meetings with affected workers and employers. Together, this will give Commissioners a broad understanding of the state of the labour market and economy. Commissioners will recommend the National Minimum Wage rates based on all of this information."
        },
        {
            "text": "The strength of the Low Pay Commission is its tripartite nature. The Low Pay Commission is made up of worker representatives, employer representatives and three independents (the Chair and two academic experts). The Low Pay Commissioners are well placed to make judgement calls, as they include experts and representatives of the key affected groups."
        }
    ]
}