{
    "url": "https://defrafarming.blog.gov.uk/2023/05/12/delinked-payments-updated-guidance/",
    "title": "Delinked Payments: updated guidance",
    "authors": [
        "Claire Williams"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2023-05-12T09:12:08+01:00",
    "content": [
        {
            "text": "We recently updated the guidance for delinked payments on GOV.UK.   "
        },
        {
            "text": "The guidance sets out whether you’re eligible for delinked payments, how they’re calculated and when you’ll receive them. "
        },
        {
            "text": "In this post, I’ll provide an overview and links for you to find out more. "
        },
        {
            "heading": 2,
            "text": "Phasing out Direct Payments: a recap"
        },
        {
            "text": "In England, Direct Payments are being phased out. They are currently paid through the Basic Payment Scheme (BPS)."
        },
        {
            "text": "To phase the payments out fairly, we introduced progressive reductions in 2021. From 2024, we’ll replace BPS in England with ‘delinked payments’. This will simplify the payments as we phase them out. "
        },
        {
            "text": "As the name suggests, delinked payments remove the link between payments and the land. "
        },
        {
            "text": "As delinked payments will not be linked to the amount of land you have, you will not need any land or entitlements to receive them. "
        },
        {
            "text": "Delinked payments will be made between 2024 and 2027, but the payment amount will decrease each year as progressive reductions are applied."
        },
        {
            "text": "After 2027, these payments will stop completely. "
        },
        {
            "text": "As we set out in the Agricultural Transition Plan, the money freed up from Direct Payments is being redirected straight back into Countryside Stewardship and our other environmental land management schemes. "
        },
        {
            "heading": 2,
            "text": "Receiving delinked payments "
        },
        {
            "text": "You don’t need to apply for delinked payments themselves, this will happen automatically. However, there are steps to be aware of: "
        },
        {
            "heading": 3,
            "text": "Apply for BPS 2023 "
        },
        {
            "text": "To receive delinked payments, you must apply and be eligible for BPS 2023 (apart from some inheritance cases). If you haven’t already done this, the deadline to apply without penalty is Monday 15 May 2023 at 11:59pm."
        },
        {
            "text": " The absolute deadline is Friday 9 June at 11:59pm, however if you submit your application after Monday 15 May there will be a BPS late application penalty. "
        },
        {
            "text": "The GOV.UK guidance for BPS 2023 includes: "
        },
        {
            "heading": 3,
            "text": "Preparing to receive delinked payments "
        },
        {
            "text": "As mentioned, to receive delinked payments, you need to apply and be eligible for BPS 2023 in England, though it’s worth saying that there are exceptions for some inheritance cases, so do check the guidance. "
        },
        {
            "text": "To receive delinked payments, you also need a ‘reference amount’. This will normally be your average BPS payment in the reference period, which is the BPS 2020 to 2022 scheme years. "
        },
        {
            "text": "The Rural Payments Agency (RPA) will send you an information statement showing your reference amount later this year for you to check."
        },
        {
            "text": " It is important for you to check this when it arrives, because the RPA will use your reference amount when they calculate your delinked payments each year.  "
        },
        {
            "text": "You will be able to transfer some or all of your reference amount to one or more other businesses during a transfer period in early 2024.  "
        },
        {
            "text": "For example, you might want to do this if your business has merged or split, your Single Business Identifier (SBI) has changed, or you have passed some or all your business to someone else since the start of the reference period. "
        },
        {
            "text": "The GOV.UK guidance for delinked payments page includes: "
        },
        {
            "heading": 2,
            "text": " Quick links to help you plan "
        },
        {
            "text": "You can continue to farm, receive delinked payments and also apply for other schemes. Every grant and ongoing payment can be found on the Funding for Farmers and Land Managers page on GOV.UK. "
        },
        {
            "text": "A couple of months ago, we published a blog post setting out the grants available in 2023. Just remember to check the dates as we don’t update blog posts. The guidance pages on GOV.UK will always contain the most up-to-date information.  "
        },
        {
            "text": "If you currently receive Direct Payments, you are eligible to receive free business advice through the Future Farming Resilience Fund. Independent providers across England will help you make the right business choices for the future. The list of advisers can be found on GOV.UK. They’re arranged by county and you can contact them directly."
        },
        {
            "text": " The RPA post about all rural payments, so be sure to visit the Rural Payments blog too. "
        },
        {
            "text": "Finally, if you have any questions or comments about our approach, feel free to leave them below."
        }
    ]
}