{
    "url": "https://supportingfamilies.blog.gov.uk/2023/05/12/hertfordshire-county-council-key-local-achievements-of-the-supporting-families-programme/",
    "title": "Hertfordshire County Council: key local achievements of the Supporting Families Programme",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Employment",
        "Evaluation",
        "Health",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict",
        "Transformation"
    ],
    "pub_date": "2023-05-12T09:09:57+01:00",
    "content": [
        {
            "text": "The Supporting Families Programme is based on the principle of a whole family approach, providing support to all members of the family, including children, parents and grandparents. The programme’s holistic approach helps families to address and overcome multiple challenges they might be facing relating to unemployment, housing, education and health.  "
        },
        {
            "text": "Hertfordshire County Council is proud of the Supporting Families programme’s successes over the last 10 years. "
        },
        {
            "text": "Our infographic highlights some of the key achievements made in supporting families, programme milestones and feedback received throughout the programme.  "
        },
        {
            "text": "https://delta.communities.gov.uk/document-repository/public/download?uri=/document-repository/SF-10-year-Infographic---HCC-for-SF-Blog.pdf"
        },
        {
            "text": "In Hertfordshire all early help services work together in partnership under the name \"Families First\" and our Families First Assessment (FFA) is the term used for early help support plans. Here are some of our key statistics:   "
        },
        {
            "text": "Parent - “We are very grateful for all the help and support we have received to turn things around for us.”  "
        },
        {
            "text": "We have a shared vision that strong partnership working is a key component to our early help system. One of the ways we help to foster this shared sense of vision across the partnership is through a pledge that we and all partners sign up to.  "
        },
        {
            "text": "Our pledge explains Families First and the commitment of the council and our partners to families and how we will work with them.  "
        },
        {
            "text": "To support partnership working and workforce development across the county, Families First co-ordinate and organise:  "
        }
    ]
}