{
    "url": "https://socialcare.blog.gov.uk/2023/05/12/international-nurses-day-celebrating-our-values-strengths-and-ambition/",
    "title": "International Nurses Day: celebrating our values, strengths and ambition",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Events",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-05-12T08:25:23+00:00",
    "content": [
        {
            "text": "This month sees the annual celebration of International Nurses Day (Nurses Day in the UK) on 12 May, the anniversary of Florence Nightingale’s birth. In difficult and uncertain times, celebrating who we are, what we stand for and the amazing contribution we make to the health and wellbeing of our communities is more important than ever."
        },
        {
            "text": "Throughout May, I’m joining Skills for Care colleagues to visit every region in England as, together, we shine a light on the work of the social care nursing workforce, sharing ideas, celebrating progress and recognising the phenomenal work of the sector."
        },
        {
            "text": "Helen Whately, Minister for Social Care at the Department of Social Care, has also written to all social care nursing colleagues in a heartfelt letter to mark International Nurses Day and recorded this special video message. She, likewise, applauds your talent, skills and dedication and signposts the support, training and development opportunities already in train or yet to come to help you get the most out of careers in care."
        },
        {
            "heading": 2,
            "text": "Pride in our profession"
        },
        {
            "text": "It is 42 years this year since I started my nurse training. I can honestly say it has been an incredible journey so far and it continues to be an utmost privilege to serve in public life. I have met so many incredible people, experienced so much, learnt from many situations, roles and opportunities. I am truly proud to be a nurse. We often underestimate the impact we have and the imprint we leave on the lives of others. The intimacy of the relationships we have with those in our care and their absolute trust in us feels like such a huge responsibility."
        },
        {
            "text": "I am currently receiving treatment from a nursing team and I am blown away by their knowledge, skill and interest in what they are doing. They are truly demonstrating person-centred care, discussing all the options with me and finding solutions around my hectic schedule when making appointments. The lived experience I am having is very reassuring and makes me truly glad to be part of such an incredible profession."
        },
        {
            "heading": 2,
            "text": "Our voice is growing stronger"
        },
        {
            "text": "Nurses are fantastic advocates for their patients and I think we need to be equally proactive in being advocates for our profession. The social care nursing advisory councils, standing up in every ICB (integrated care board) in England, are a demonstration of our intent to make our voices louder and our influence felt more strongly, in a constructive and inspiring way."
        },
        {
            "text": "More broadly, we need to use our passion and excitement about nursing to encourage others and facilitate opportunities for young people to glimpse into our world, work with local schools and colleges and spark the excitement of nursing within them."
        },
        {
            "text": "We need every nurse to grow our profession, develop practice and make 2023 the year we ignite a passion for social care in many more talented individuals. And I will do my utmost to make sure the guidance, training and support is there to make the most of that talent – for the benefit of our profession and those we care for so deeply."
        }
    ]
}