{
    "url": "https://ukhsa.blog.gov.uk/2021/12/24/reflecting-on-a-year-responding-to-covid-19/",
    "title": "Reflecting on a year responding to COVID-19",
    "authors": [
        "Susan Hopkins"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-12-24T13:56:26+01:00",
    "content": [
        {
            "text": "At this time of year many of us stop to reflect. The past two years have been hard on us all, the world as we know it changed forever."
        },
        {
            "text": "Like the vast majority of people, physical and social isolation were the biggest challenge for me. I saw very few people for months and didn’t see my family in Ireland for more than a year and a half. I spent my time worrying about my parents catching COVID. The day they got their first vaccinations felt like the beginning of the future. The enforced separation from family and friends has reminded me not to take simple pleasures like meeting for dinner or a walk in the woods for granted."
        },
        {
            "text": "The vaccination programme has changed how we see the virus, with over 120 million doses administered in the UK. As the global population gains immunity, we will see reductions in the impact of this terrible infection on lives lost and serious illness. Reflecting on the number of people involved in developing these vaccines, making sure they get into people’s arms and monitoring their impact has reminded me once again that science and medicine only works as a collaborative effort. I am extremely proud of the role my colleagues across the health system have played in the development and delivery of the vaccines."
        },
        {
            "text": "We have come such a long way; science has been at the heart of it all. Breakthroughs that might have taken decades have happened in months."
        },
        {
            "text": "UKHSA and its predecessor organisations have led and been involved in so many critical studies – from the early studies in care homes allowing us to understand transmission and asymptomatic disease, the studies on lateral flow devices in schools and in the community as an alternative to isolation of contacts, the vaccine effectiveness studies, studies looking at the severity of disease and the transmission in households and many more. We are hugely grateful to all the participants who give their time to contribute to science. Many are feeding back that it has allowed them to understand the importance of participation in research and will continue to reinforce the positive impacts of clinical trials to their patients, friends and family."
        },
        {
            "text": "I want to thank my colleagues across the public health system, for their professionalism, hard work and dedication to the communities they serve. Their commitment to solving some of the most difficult challenges we have ever known is inspirational."
        },
        {
            "text": "Also, to the public, who just keep going. Especially school children and parents who have been one of the most impacted groups. Thank you to everyone for all your sacrifices, for testing regularly and for getting the vaccine which protects you and those you mix with."
        },
        {
            "text": "So, what does the future hold for us and COVID? We know things can change drastically at rapid speed. The emergence of Omicron shows this, at a time when many were starting to relax, we have now returned to being on high alert. There will be moments in the coming months and years when we must exercise caution, and this is one of them."
        },
        {
            "text": "As we vaccinate more and immunity is gained globally, I hope that COVID-19 becomes another part of the seasonal respiratory viruses. But even more than that, with the advances in medical sciences with new drugs and vaccines rapidly developed during the pandemic, I hope that we can reduce the impact of other infectious diseases."
        },
        {
            "text": "Many of us have gained good habits over the pandemic that we will keep. I continue to regularly go for walks, taking my crazy cockapoo Luna with me when I meet up with friends in a park, it is good for our physical and mental wellbeing. I know many people continue to wash their hands more frequently and thoroughly. Good hand hygiene should never be underestimated."
        },
        {
            "text": "We’ve also learnt a considerable amount about wider society. Health threats do not affect everyone equally, people in the most deprived communities or who are vulnerable have suffered the worst outcomes. This is not a coincidence and we will need to drive evidence-based policies to reduce disparities and improve the inequalities in our society."
        },
        {
            "text": "Quite rightly COVID has dominated the agenda but there are other issues we must stay vigilant about."
        },
        {
            "text": "Antimicrobial resistance (AMR) has been described as a hidden pandemic and it’s important that we do not come out of COVID and enter another crisis. Taking antibiotics when you don’t need them puts us all at risk. The government has launched an action plan to eliminate HIV transmission and our organisation will play a key role in delivery. We also have actions plans to eliminate key vaccine preventable diseases, TB and hepatitis. Our teams working collaboratively in the new organisation will allow us to work effectively on these challenges."
        },
        {
            "text": "Then there are chemical, radiological and environmental hazards. Our changing climate is another health security threat we face and mitigating its impact is key. From extreme heat or cold weather to pollution impacting the air we breathe."
        },
        {
            "text": "Right now, it is once again a time to exercise caution, as we learn more about Omicron. Go and get your booster as soon as you can. We have come a long way over the past year, and we will progress even further over the next 12 months. Thank you for your work and dedication and your families for supporting you. I hope everyone manages to have a break over the holiday season."
        }
    ]
}