{
    "url": "https://publicguardian.blog.gov.uk/2018/10/23/a-professionals-perspective-on-the-deputy-online-reporting-service/",
    "title": "A professionals' perspective on the deputy online reporting service",
    "authors": [
        "Amy Feetham"
    ],
    "categories": [
        "Deputies",
        "Digital"
    ],
    "pub_date": "2018-10-23T12:39:44+01:00",
    "content": [
        {
            "text": "Amy Feetham, accounts paralegal at law firm Irwin Mitchell, discusses her experience of using our online deputy reporting service."
        },
        {
            "text": "Irwin Mitchell was the first professional organisation to use the deputy online reporting service which launched in spring 2018."
        },
        {
            "text": "“Prior to us using the online service, we completed reports in PDF format which was an inconvenient procedure due to there not being enough space to accommodate all of our answers and the reports had to be printed for the deputy’s signature.  We tried to streamline the process by exporting data and copying and pasting it into spreadsheets, applying categories and electronically copying it on to the reporting form. We also started to apply the deputy’s digital signature instead of printing the lengthy forms. However, the process was still difficult and time consuming."
        },
        {
            "text": "OPG approached us to trial their new service, and we started small, moving clients in just one area of the country on to the system first."
        },
        {
            "text": "Since the start of the trial, we’ve found the whole process of completing deputy reports is much easier for us. Key information is saved so you don’t have to write it all out repetitively, submitting reports directly to OPG with deputy consent is easier, and small but welcome things, like the report being all on one screen, and not across two PDFs, has made filling them out simpler."
        },
        {
            "text": "Not having to do the report in one go has also helped save time and made the process more efficient. We’ve even been able to feedback suggestions on how the system can be improved which have been implemented as suggested."
        },
        {
            "text": "Currently only our Sheffield office are digitally reporting, but our Birmingham staff are due to go online soon. Once other elements of the form are made available digitally, we’d like all our offices to switch over to this way of reporting to meet with our own vision of going more digital."
        },
        {
            "text": "I’d encourage other professional organisations to use it - it’s much easier, saves time and we believe it’s the most beneficial way forward.”"
        },
        {
            "text": "If you’re a professional interested in using the service to manage your clients’ reports, please contact the professional deputy team at opg.pro@publicguardian.gov.uk."
        }
    ]
}