{
    "url": "https://gfie.blog.gov.uk/2024/04/08/972/",
    "title": "Removing barriers in recruitment for prison leavers and people with convictions in the Probation Service",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "A modern Civil Service",
        "A Skilled Civil Service",
        "Ex-offenders",
        "Life Chances",
        "Lived Experience",
        "Prison Leavers",
        "Uncategorized"
    ],
    "pub_date": "2024-04-08T10:00:23+01:00",
    "content": [
        {
            "text": "The Civil Service currently has 23 Going Forward into Employment (GFiE) Life Chance Schemes in operation across Government, using innovative approaches to recruitment and providing Individuals from a wide range of backgrounds, who face barriers to employment, with opportunities and experience."
        },
        {
            "text": "In this blog edition, we introduce you to the Probation Employment Pathway (PEP) scheme led by the Ministry of Justice."
        },
        {
            "heading": 2,
            "text": "What is the Probation Employment Pathway (PEP) scheme?"
        },
        {
            "text": "The Probation Employment Pathway (PEP) scheme was implemented in Autumn 2023 to remove barriers into recruitment for prison leavers and people with convictions in the Probation Service."
        },
        {
            "text": "The PEP was designed to build on the success of the Going Forward into Employment (GFiE) scheme and extend the eligibility criteria to meet groups who were beyond the parameters of the GFiE scheme but who still faced barriers to employment within the Probation Service due to nature of their conviction and their interactions with the Criminal Justice system."
        },
        {
            "text": "The PEP offers employment within the Probation Service in roles up to NPS Band 3 (EO equivalent), on a 2-year fixed-term appointment, through Exception 2 of the CS Commission Recruitment Principles. The PEP scheme is not available for Probation Service Officer or Professional Qualification in Probation (PQiP) roles. It is the ambition of the Probation Service to use exception 10 and convert applicants to permanency where appropriate."
        },
        {
            "heading": 3,
            "text": "PEP Eligibility"
        },
        {
            "text": "To be eligible for the PEP scheme an applicant must: "
        },
        {
            "heading": 3,
            "text": "PEP Innovation"
        },
        {
            "text": "The PEP scheme is designed to make it easier for applicants, probation staff and third-party referrals to apply for a role. All the scheme’s vacancies are advertised on the Justice Jobs portal and Civil Service jobs so that current vacancies can be easily found."
        },
        {
            "text": "This is a big step forward for Life Chance recruitment and is something the team behind the scheme are very proud of. This digitalisation allows The Probation Service to scale up its activity in this area and makes it a simple process for vacancy managers to do the right thing and support Life Chance recruitment. Additionally, it supports applicants and referrers as they will have a live view of current vacancies so they are working off the latest information and can set alerts to vacancies which match their needs."
        },
        {
            "text": "To search for a PEP vacancy, an applicant needs to type ‘PEP’ into the keyword search function on Justice Jobs or Civil Service jobs."
        },
        {
            "text": "When applying for a vacancy applicants will be asked a series of eligibility questions to identify whether they meet the scheme criteria, before being progressed to the application."
        },
        {
            "text": "Many third sector organisations and probation partners were contacted at the launch of the scheme and were briefed on the key points of the scheme so they could make best use of this opportunity."
        },
        {
            "heading": 3,
            "text": "Current Progress and Next steps"
        },
        {
            "text": "The PEP scheme is still in its infancy but there have been vacancies advertised and there are applicants progressing through the recruitment pipeline and into pre-employment checks who will hopefully be able to build a career within the Probation Service."
        },
        {
            "text": "Work is ongoing to encourage further vacancy submissions from within Probation and to promote the scheme to a wider audience, which hopefully this GFIE blog will support."
        },
        {
            "text": "If you want to know more about GFiE Life Chance Schemes, or are a Government department and would like to discuss providing life changing opportunities to individuals through use of the schemes for vacancies you have coming up, please get in contact with the GfiE Team at GFiE@cabinetoffice.gov.uk"
        }
    ]
}