{
    "url": "https://educationhub.blog.gov.uk/2024/04/free-childcare-how-we-tackling-the-cost-of-childcare/",
    "title": "Free childcare: How we are tackling the cost of childcare",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Childcare",
        "childminders",
        "early years",
        "Funding"
    ],
    "pub_date": "2024-04-08T10:00:34+01:00",
    "content": [
        {
            "text": "England has some of the highest quality childcare provision in the world, with 96% of early years settings rated by Ofsted as good or outstanding. But we recognise that childcare is also one of the biggest costs facing working families today. "
        },
        {
            "text": "That’s why we’re making the biggest investment by a UK government into childcare in history, doubling the amount we expect to spend over the next few years from around £4 billion to around £8 billion each year. "
        },
        {
            "text": "By September 2025, working parents will be able to claim 30 hours of government-funded childcare a week, over 38 weeks of the year, all the way through from nine months up to their child starting school."
        },
        {
            "text": "The scheme is already being rolled out, with more families able to sign up for the support than ever before."
        },
        {
            "heading": 3,
            "text": "When does the 30 hours free childcare start? "
        },
        {
            "text": "The increased offer will be rolled out in stages to allow childcare providers time to be able to implement the changes, making sure the places that are needed are available across the country when the offers are introduced."
        },
        {
            "text": "These hours can be used over 38 weeks of the year during school term time, or up to 52 weeks if you use fewer than your total hours per week."
        },
        {
            "text": "You can start using the entitlements from the term after you apply. These terms begin on 1 January, 1 April and 1 September."
        },
        {
            "text": "Applications are now open for eligible working parents whose children will be 2 or older by the 31 August to receive 15 hours childcare, starting from September 2024."
        },
        {
            "text": "And from 12 May, eligible working parents whose children will be aged between 9- and 23-months old on 31st August, can apply to receive 15 hours childcare starting from September 2024."
        },
        {
            "heading": 3,
            "text": "Why won’t this be available until 2025? "
        },
        {
            "text": "This is a massive expansion in the offer and will take some time to implement and rollout."
        },
        {
            "text": "The staggered approach will give childminders and nurseries time to prepare for the changes, ensuring there are enough places ready to meet demand."
        },
        {
            "text": "The government is supporting with this, with a range of new initiatives to boost the workforce, including a national recruitment campaign and a £1,000 cash incentive pilot to encourage new staff into the sector."
        },
        {
            "heading": 3,
            "text": "How else is the government supporting nurseries and childminders?  "
        },
        {
            "text": "Nurseries are set to receive a £204 million cash boost as part of the government’s promise to deliver the largest ever investment in childcare."
        },
        {
            "text": "Every area across the country is getting a share of the government funding which childcare providers can use to ease cost pressures such as staffing costs, training and bills."
        },
        {
            "text": "Funding rates per child paid from September will increase from an average of £5.29 to £5.62 for 3 and 4-year-olds, and from an average of £6.00 to £7.95 for 2-year-olds."
        },
        {
            "text": "All local authorities have started to receive their share of £289 million in funding to support their delivery of the programme, with parents expected to see an expansion in the availability of wraparound care from September 2024."
        },
        {
            "heading": 3,
            "text": "How will this make childcare cheaper? "
        },
        {
            "text": "Nurseries are not allowed to charge top-up fees when providing the government funded hours offers, and that won’t change as these are expanded."
        },
        {
            "text": "Some providers may ask for charges in addition to the government-funded childcare, such as meals. You can find more information the Childcare Choices website."
        },
        {
            "text": "And of course, parents will be paying for far fewer hours in the future."
        },
        {
            "heading": 3,
            "text": "What do you mean when you say free childcare is for ‘working’ parents? "
        },
        {
            "text": "Working parents who individually earn more than £9,518 (from April 2024) but less than £100,000 per year are eligible."
        },
        {
            "text": "If you’re in a couple, the rules apply to both of you, so you must both earn at least £9,518 and neither one of you can earn more than £100,000 adjusted net income."
        },
        {
            "text": "There’s more information available on the exact criteria on the Childcare Choices website, for example if you work irregular hours."
        },
        {
            "heading": 3,
            "text": "Who is eligible for free childcare now? "
        },
        {
            "text": "Eligible working parents of 3- and 4-year-olds already get 30 hours a week of government-funded childcare."
        },
        {
            "text": "Eligible working parents of 2-year-olds are also now able to access 15 hours childcare support."
        },
        {
            "heading": 3,
            "text": "What childcare support is available for people on Universal Credit?  "
        },
        {
            "text": "Parents on Universal Credit are set to get further support too."
        },
        {
            "text": "The amount parents are able to claim from Universal Credit to cover childcare costs is  £951 a month for one child, and £1,630 for two children."
        },
        {
            "text": "Parents can receive DWP support to cover their costs upfront, making it easier for them to get a job or increase their hours. This eases parents into the childcare costs payment cycle."
        },
        {
            "heading": 3,
            "text": "What other Government childcare support is there? "
        },
        {
            "text": "Local authorities and schools will be given more funding for what’s known as “wraparound care”, so that parents of school-age children can access childcare in their local area from 8am – 6pm."
        },
        {
            "text": "This could include provision of activities that fall outside of school hours, via things like breakfast clubs and after-school clubs."
        },
        {
            "text": "The funding worth up to £289 million will enable schools to test different ways to increase their wraparound options, including working with local private providers or partnering with other schools."
        },
        {
            "text": "This will be rolled out in September 2024, and we expect that by September 2026, all parents will be able to access wraparound care, either from their school or other provider."
        },
        {
            "text": "Parents can also get up to £500 every three months (up to £2,000 a year) for each child to help with the cost of childcare, or up to £1,000 every three months (up to £4,000 a year) if a child is disabled, with Tax-Free Childcare. You can find out more about the scheme on Gov.uk. Parents may also be able to claim back up to 85% of their wraparound childcare costs if they are eligible for Universal Credit."
        }
    ]
}