{
    "url": "https://insidedio.blog.gov.uk/2024/04/08/in-the-jungle-operating-alongside-the-flora-and-fauna-of-belize/",
    "title": "In the jungle: Operating alongside the flora and fauna of Belize",
    "authors": [
        "Maj Dai Davies"
    ],
    "categories": [
        "BATSUB",
        "Belize",
        "Conservation",
        "Defence Training Estate (DTE)",
        "Military Training",
        "Sustainability",
        "Wildlife"
    ],
    "pub_date": "2024-04-08T11:02:18+00:00",
    "content": [
        {
            "text": "A soldier from C Company, Scots Guards takes aim during jungle training in Belize on 19 November 2021. [Crown Copyright / MOD 2021]Did you know that the British Army undertakes Close Country Tropical Training within the jungles of Belize? The British Army Training Support Unit Belize (BATSUB), supported by DIO, operates on one of the MOD’s overseas training areas, which we share with the Belize Defence Force. It covers 375,000 hectares of training areas, which are owned by Non-Governmental Organisations (NGO) and the Government of Belize."
        },
        {
            "text": "The jungle environment presents different challenges to our soldiers than they are used to, ranging from jungle forest to secondary and primary jungle. It’s a far cry from the open grasslands of Salisbury Plain Training Area. It is not just the training that’s different, it’s the environmental considerations. It’s vital that we maintain our consent to train by adhering to the BATSUB environmental compliance plan. We hold the key for future training and must ensure we are able to operate alongside the wildlife within this unique training area."
        },
        {
            "heading": 2,
            "text": "Charitable partners"
        },
        {
            "text": "As well as working with Panthera, a charity that monitors and protects big cats, we also work with other NGOs to protect the environment we share with the local inhabitants."
        },
        {
            "text": "We work closely with the Belize Maya Forest Trust (BMFT), which purchased a large area of 80,000 hectares of forest. Their aim is to preserve the area from being used for agriculture, which would have an impact on the local wildlife. This will reduce the threat to four Endangered or Critically Endangered species and reduce carbon emissions."
        },
        {
            "text": "The BATSUB team have helped with tree planting in the area. [Crown Copyright / MOD 2023]Some of the training areas we use are on BMFT owned land and the consent to train on this prime training estate is arranged through a memorandum of understanding. Where BMFT lay down the rules that we must adhere to, we hold the keys to future training within BMFT and must adhere to these basic restrictions. In return, we have assisted BMFT in delivering ground sign awareness training to their wardens and joined them in planting thousands of trees within the local area. It’s a fantastic opportunity for us to give something back to this country in which we live and work."
        },
        {
            "heading": 2,
            "text": "Working with the Belizean government"
        },
        {
            "text": "Naturally, a military force training overseas, even in a friendly nation such as Belize, requires a positive working relationship with our hosts. We are in regular contact with various departments of the Belizean government, especially the Forest Department and the Department of Environment, and we host a yearly visit for these organisations. This allows us to show the training estate we have used, and how we have managed the area to allow the jungle time to recover."
        },
        {
            "text": "A Jungle Warfare Instructor teaches paratroopers jungle tactics in Belize. [Crown Copyright / MOD 2019]For example, when exercising troops create a temporary training camp, the locations used must rotate to give the affected area a chance to regenerate. Among other considerations, there are restrictions to noise levels and no training is permitted to take place within 500m of any location which has been identified as being important to priority species, such as nest sites for scarlet macaws. These are sensible and reasonable restrictions; we ensure we do what we can to protect this remarkable place."
        },
        {
            "text": "Forest fires are unfortunately another danger in this tropical environment. We ensure the exercising troops are fully aware of the restrictions imposed upon them, along with the actions that are required if a fire starts. BATSUB engaged with the Belize Forest Department at the start of the dry season, sharing information and experience of forest fires and allowing us to learn and share our own experiences of preventing and fighting fires. Last summer, for example, the Range Control team worked with BMFT rangers and the Forest Department to get water to a large area which was actively burning. Such collaboration is vital to our successful operation in this beautiful country and we are always grateful for the support of the Belizean government and our other partners."
        }
    ]
}