{
    "url": "https://stratcommand.blog.gov.uk/2024/04/08/major-pearce-returns-to-rg/",
    "title": "Major Pearce returns to the Royal Gibraltar Regiment following two years in Directorate for Overseas Bases",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-08T14:54:41+01:00",
    "content": [
        {
            "text": "The Royal Gibraltar Regiment is pleased to announce the return of Major (Maj) Elvis Pearce after a two-year assignment as Staff Officer Class 2 (SO2) Gibraltar Desk in the Directorate for Overseas Bases in MOD’s Strategic Command, Northwood, United Kingdom."
        },
        {
            "text": "Maj Pearce's return marks a significant moment for the Regiment, as he brings back a wealth of experience and expertise gained during his tenure."
        },
        {
            "text": "During his posting, Maj Pearce served with distinction in the vital role where his responsibilities included overseeing operations related to British Forces Gibraltar and ensuring the effective co-ordination of activities in support of the region."
        },
        {
            "text": "Maj Pearce's leadership, strategic vision, and dedication to duty were instrumental in advancing the goals and objectives of the Royal Gibraltar Regiment during his time in the UK."
        },
        {
            "text": "Lieutenant Colonel Matt Moore, Commanding Officer of the Royal Gibraltar Regiment, expressed his pride in Maj Pearce's accomplishments during his assignment."
        },
        {
            "text": "He commended Maj Pearce for his exceptional performance, unwavering commitment, and the positive impact he made in his role as SO2 Gibraltar Desk."
        },
        {
            "text": "“Major Pearce's return to the Royal Gibraltar Regiment is met with great anticipation and enthusiasm by his colleagues and superiors."
        },
        {
            "text": "His experience and insights acquired during his time in the UK will undoubtedly enhance the Regiment's capabilities and contribute to its continued success.”"
        },
        {
            "text": "As Maj Pearce re-joins the ranks of the Royal Gibraltar Regiment, the unit looks forward to benefiting from his leadership, expertise, and dedication to serving the Regiment and the community of Gibraltar in his new role as the Officer Commanding I Company, the Regiment’s infantry rifle company."
        }
    ]
}