{
    "url": "https://environmentagency.blog.gov.uk/2024/04/08/new-research-project-launched-by-the-environment-agency-to-monitor-saltmarshs-carbon-capture-and-storage/",
    "title": "New research project launched by the Environment Agency to monitor saltmarsh’s carbon capture and storage",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Flood",
        "Water"
    ],
    "pub_date": "2024-04-08T11:03:38+00:00",
    "content": [
        {
            "text": "The Environment Agency (EA) is part of a new research project that will monitor saltmarshes across the UK. "
        },
        {
            "text": "Saltmarsh plays a significant role in mitigating climate change by absorbing and storing greenhouse gasses in their plants and sediments. As well as carbon capture and storage, saltmarshes have many ecosystem services, including natural flood management and providing habitats for lots of different species.  "
        },
        {
            "text": "However, it is estimated that 85% of UK saltmarsh has been lost since the mid-19th Century, and they still face pressure today from coastal development, pollution, and climate change. That’s why we are excited to be working in partnership with the UK Centre for Ecology and Hydrology to install a new coastal network of flux towers across the country.  "
        },
        {
            "text": "Funded by the Defra marine Natural Capital Ecosystem Assessment (mNCEA) programme, these flux tower systems will measure how much greenhouse gas is captured from the atmosphere and is stored within natural and restored saltmarshes in England to help us understand the fundamental drivers of climate change. "
        },
        {
            "text": "The partnership is installing a new network of towers across the country. We have installed one at Abbots Hall in the Blackwater Estuary, in partnership with the Essex Wildlife Trust. Two further towers have been installed at Freiston Shore, one on a natural saltmarsh in The Wash and the other on a created saltmarsh site adjacent to The Wash. Both sites are managed by RSPB. A fourth tower will be installed in future at a separate location. "
        },
        {
            "text": " Natural England and WWF have also each bought a Flux tower which have been installed on the Ribble estuary in August 2023 in partnership with UKCEH and RSPB with one located on a natural saltmarsh and the other on a restored saltmarsh in the area. "
        },
        {
            "text": " The network has already started to collect crucial data on saltmarsh ecosystems. This type of data collection has not been done before for coastal and marine habitats, so our knowledge on blue carbon storage in saltmarshes is limited. "
        },
        {
            "text": " These flux towers will help to improve our understanding of the ability of saltmarsh habitats to capture and store carbon across tides, days, seasons and years. The evidence they will provide will be key to support the further restoration of saltmarshes, and for the inclusion of these habitats on the UK Greenhouse Gas Inventory.(GHGI) "
        },
        {
            "text": " The GHGI is a robust framework for monitoring and reporting on greenhouse gas emissions and storage. Right now, there are too many evidence gaps for saltmarshes to be included on the GHGI. However, the long-term, real-time data from this project will directly increase our knowledge on carbon storage in saltmarshes. It is hoped that data from this network will result in the inclusion of saltmarsh on the GHGI while also providing increased restoration efforts for important habitats.  "
        },
        {
            "text": " We are also feeding into the development of a saltmarsh carbon code, led by UKCEH. This is a scientifically based voluntary certification that aims to develop a standardised methodology, opening opportunities for saltmarsh creation and restoration that benefit people and wildlife.  Both, the salt marsh carbon code and the inclusion of salt marsh in the GHGI, will formally recognise the significant role salt marshes play in carbon storage, and consequentially, in helping mitigate effects from climate change. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}