{
    "url": "https://nationalscreening.blog.gov.uk/2024/04/08/partnership-board-updated-on-progress-with-sma-screening-evidence-review/",
    "title": "Partnership board updated on progress with SMA screening evidence review",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-04-08T12:24:42+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) and its partners were updated on work to review the evidence for newborn screening for spinal muscular atrophy (SMA) at the second meeting of the SMA in-service evaluation (ISE) partnership board."
        },
        {
            "text": "The board and its 3 sub-groups are responsible for planning the ISE of newborn blood spot (NBS) screening for SMA in real world NHS services in the UK."
        },
        {
            "text": "The meeting heard that the UK NSC had met the National Institute for Health and Care Excellence (NICE) to ensure that NICE’s upcoming review of SMA treatment guidance is aligned with the ISE, and vice-versa."
        },
        {
            "text": "Board members, who include screening experts from the 4 UK governments and NHS, organisations with a shared interest in newborn screening for SMA, clinicians, academics, genomic experts and patient and public voice members, were reminded of the importance of declaring any actual or potential conflicts of interest. Actions to mitigate conflicts of interest, if appropriate, will be agreed in line with the UK NSC’s declarations of interest guidance."
        },
        {
            "text": "Chairs of the 3 sub-groups then gave an overview of activity."
        },
        {
            "heading": 2,
            "text": "Clinical pathway sub-group"
        },
        {
            "text": "This group is tasked with defining the screening pathway, up to treatment. A very important part of this pathway is information for parents, the public and health care staff. The clinical pathway sub-group will lead on the development of information about the ISE that will be provided for parents, the public and healthcare staff. Parents, people with SMA and healthcare staff will be actively involved in the development of these materials."
        },
        {
            "text": "Sub-group chair Dr David Elliman said the group would learn from the materials already developed by various SMA support groups and from the evaluation of newborn screening for severe combined immunodeficiency (SCID) in England. This will include the need to inform parents about the nature of the ISE at the point of offering screening."
        },
        {
            "text": "David fed back on discussions over which SMN2 copy numbers would prompt a referral and reporting of SMA to parents. This discussion followed presentations from colleagues in Netherlands and Sweden on the referral and reporting pathways in those countries. This issue will be discussed further at the next meeting and within the laboratory sub-group."
        },
        {
            "heading": 2,
            "text": "Data and methodology sub-group"
        },
        {
            "text": "The data and methodology sub-group has contributed suggestions to a research commissioning brief on SMA newborn screening which will be publicised in due course by the National Institute for Health and Care Research’s (NIHR’s) Health Technology Assessment (HTA) programme."
        },
        {
            "text": "The research brief will address the feasibility, clinical effectiveness and cost effectiveness of screening. The sub-group’s suggestions included that the HTA study should include the potential use of existing data and stored blood spot samples as sources of information."
        },
        {
            "text": "The data and methodology sub-group will also be responsible for advising on any research gaps not covered by the HTA brief."
        },
        {
            "heading": 2,
            "text": "Laboratory sub-group"
        },
        {
            "text": "The laboratory sub-group will be led by NHS England. The first meeting of the group is scheduled for early April."
        },
        {
            "text": "Laboratory sub-group chair Professor Jim Bonham explained that the 6 screening labs which currently offer SCID testing could, without additional equipment, undertake evaluation for SMA screening if required. These labs cover approximately 60% of births in England, or around half of all babies born in the UK."
        },
        {
            "heading": 2,
            "text": "Generation study update"
        },
        {
            "text": "Dr Ellen Thomas, Deputy Chief Medical Officer at Genomics England (GEL), gave an update on progress with the Generation study, which will sequence the genomes of 100,000 newborn babies."
        },
        {
            "text": "The GEL team is in regular contact with Prof Bonham on SMA reporting and the collection of longitudinal data to ensure that processes align."
        },
        {
            "heading": 2,
            "text": "Cost effectiveness modelling project"
        },
        {
            "text": "Work has started on the development of a new comprehensive and flexible cost effectiveness SMA screening modelling study for the UK screening context."
        },
        {
            "text": "This work is being undertaken by the Sheffield Centre for Health and Related Research (ScHARR) at the University of Sheffield and the first stakeholder workshop will be held on 21 May."
        },
        {
            "text": "The ScHARR team is keeping in close contact with NICE colleagues regarding the managed access agreements (MAAs) for SMA treatments that will impact on the modelling work."
        },
        {
            "heading": 2,
            "text": "Updates from around the UK"
        },
        {
            "text": "The partnership board also heard updates from government and NHS screening experts from across the UK. Members agreed on the importance of communications emphasising that the UK NSC’s evidence review applies to all 4 nations."
        },
        {
            "text": "NHS colleagues stressed the need to address the challenges of delivering change at scale across the system, along with capacity and workforce issues across the whole pathway."
        },
        {
            "text": "The lead for the Oxford/Thames Valley based SMA newborn screening study gave an update on the progress of their study, which now also covers Southampton. Experience and lessons learnt from this study will feed into the ISE."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}