{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/04/08/reflections-on-the-first-year-as-head-of-the-government-science-and-engineering-profession/",
    "title": "Reflections on the first year as Head of the Government Science and Engineering Profession",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2024-04-08T10:08:59+01:00",
    "content": [
        {
            "text": "Dear GSE members, it has now been one year since I took on the best job in the world, the role of Government Chief Scientific Adviser, with the remit to advise the Prime Minister and government on all things related to science, technology and engineering – but this is not my only role as I am also the Head of the Government Science and Engineering Profession. It's been an enormous privilege to lead you over the past year as Head of Profession. Through my many engagements with the profession, I've been so impressed with the breadth and depth of work that goes on across government and your commitment to providing the best science and engineering advice through the course of your work."
        },
        {
            "text": "One of the priorities I set out when I took on this role as Head of Profession was to create a genuinely scientific civil service – to further strengthen and connect science and engineering capability across government. We as a profession have two main ways in which we are approaching this."
        },
        {
            "text": "First is awareness-building, we need science literacy at all levels to ensure science is seen as a key pillar across all areas of policymaking and operational delivery."
        },
        {
            "text": "This year we launched our GSE Science and Engineering courses, with one course focused on accessing science and engineering advice and the other on communicating it. The courses have been a long-term ambition developed with members from across government to ensure they are fit for purpose, and, most importantly, drawing on the best evidence and experience. I know many of you have taken these courses and found them to be beneficial, which is fantastic."
        },
        {
            "text": "The second is nurturing the STEM skills and talent that we already have and that we bring into government. This is to enhance expertise and to ultimately make better-informed decisions and deliver more effectively."
        },
        {
            "text": "In the summer of last year, the profession attended five Civil Service Live locations. I was fortunate enough to join colleagues and GSE members from HSE and APHA to share careers advice and guidance from the profession on our London panel. This year, I plan to join the profession team at the Edinburgh location – giving a talk on government science in 30 minutes or less – which is something I’m really looking forward to. Please do visit the GSE profession team at Civil Service Live this year if you can, I hear some really exciting science and engineering projects will be showcased by the profession, so don’t miss out."
        },
        {
            "text": "Additionally, in this first year, I’ve had the opportunity to meet many members, including during the webinar for National Apprenticeship Week and the Science and Engineering Fast Streamers at our regular breakfast meetings. I do enjoy meeting you as members and hope to meet even more of you as I enter my second year in post."
        },
        {
            "text": "Only a couple of weeks ago I attended the GSE-hosted day of the Royal Society Pairing Scheme."
        },
        {
            "text": "The Pairing Scheme is a long-standing collaboration between the Royal Society and government, pairing academic scientists and engineers with civil servants, and is now in its 24th year. To be able to fulfil my role as GCSA and Head of Profession (to enhance our expertise in order to make better-informed decisions and deliver more effectively) it is crucial to bring in experts from outside government. We need mechanisms to improve the flow of knowledge between government and academia and this scheme and the event are just one example of how this can be done."
        },
        {
            "text": "Looking forward to the year ahead, I am particularly looking forward to the GSE conference which is happening this autumn and is a flagship moment for the profession. Another important milestone for this year will be the development of a members’ site, as a way to boost engagement with you all."
        },
        {
            "text": "I am proud not only to lead but be a part of a rich, diverse and effective GSE profession and I hope the profession continues to help you in your careers through supporting you in gaining professional recognition, or through leadership masterclasses or even just keeping you up to date with the latest science and engineering news from across government. I hope that in the coming year, we can all work together to realise our ambition of an ever more scientific civil service."
        },
        {
            "text": "Best wishes,"
        },
        {
            "text": "Professor Dame Angela McLean"
        },
        {
            "text": "GCSA and Head of GSE Profession"
        }
    ]
}