{
    "url": "https://defradigital.blog.gov.uk/2024/04/08/whats-in-a-name-change/",
    "title": "What’s in a name (change)?",
    "authors": [
        "Hannah John"
    ],
    "categories": [
        "Defra digital",
        "Defra security"
    ],
    "pub_date": "2024-04-08T16:26:27+01:00",
    "content": [
        {
            "text": "Actually quite a lot, as Defra Head of Security Hannah John explains with our organisation undergoing a subtle but important name change aimed at building wider awareness and understanding of our broad and important Defra remit, while at the same time enabling us to grow an increased sense of belonging among all of our people."
        },
        {
            "text": "It’s been around six years since many of us came together to form Digital, Data, and Technology Services (DDTS). Essentially the process brought together Information and Communications Technology (ICT) teams and functions from Core Defra, the Rural Payments Agency, Natural England, Animal and Plant Health Agency, Marine Management Organisation and the Environment Agency to create a single Defra group ICT function."
        },
        {
            "text": "The aim of this change was to create a more efficient, effective, and unified way of managing Defra’s corporate functions."
        },
        {
            "text": "Since then, the role of security in Defra group has become increasingly important. As the digital world has evolved, so have the threats to our services and information and the responses and protection we need to be able to offer.  Likewise, as Defra’s property estate has expanded, so have its physical and personnel security requirements."
        },
        {
            "text": "In recognition of this fact, as of this week, DDTS will stand for Digital, Data, Technology, and Security. A small change, in some ways – after all we’ve simply swapped one ‘S’ for another ‘S’. and in terms of our acronym there’s no change at all – we are still DDTS. What is important to say is that this name change is to better represent the range of DDTS delivery as broadly as we can."
        },
        {
            "text": "From my perspective, it is exciting recognition that security is a separate function and profession, embedded within DDTS. I think it will help my team feel more integrated and invested in the Defra Digital and Data Strategy and all that DDTS delivers."
        },
        {
            "heading": 2,
            "text": "Belonging is important"
        },
        {
            "text": "A key element of staff retention is for people to feel that they belong, and that the work they do is recognised, equally, alongside other professions within our organisation. I believe that having ‘Security’ sitting alongside ‘Digital, Data, and Technology’ in our title can drive that equal sense of belonging, that sense of us all being in this together, pulling in the same direction."
        },
        {
            "text": "I also hope that it will enable increased visibility of the work of security teams, and support improved engagement across DDTS and the wider Defra group. It can also act as a baseline reminder to Defra colleagues to consider security in all aspects of their work."
        },
        {
            "text": "All this builds both staff, and customer knowledge and confidence to keep Defra’s people, property and information safe and secure."
        },
        {
            "text": "There is also a recruitment angle - anyone joining our organisation needs to know where they fit in and what they will be contributing to. This stuff matters and it could be the difference between someone clicking ‘Apply’, when they see one of our job ads’, or just scrolling through. I want people to know what we’re about, so that they can imagine all of the possibilities that joining DDTS might offer them."
        },
        {
            "text": "So, our name may be changing, but our wider DDTS team and purpose remains as strong as ever and well positioned to grow even stronger."
        }
    ]
}