{
    "url": "https://naturalengland.blog.gov.uk/2024/04/08/working-together-to-meet-government-targets-for-tree-planting-in-england/",
    "title": "Working together to meet government targets for tree planting in England",
    "authors": [
        "Adrian Jowitt",
        "Ian Tubby"
    ],
    "categories": [
        "Forestry Commission",
        "Natural England",
        "Tree Planting"
    ],
    "pub_date": "2024-04-08T13:25:26+01:00",
    "content": [
        {
            "text": "Ian Tubby, Head of Policy and Advice at the Forestry Commission, and Adrian Jowitt, Principal Adviser Woodland Policy at Natural England reflect on the recent CEO visit at Cranborne Estate, where Marian Spain and Richard Stanford discussed our shared vision for woodland creation."
        },
        {
            "text": "Society is facing a climate and nature emergency which is having a damaging effect on public health and wellbeing. To help address this, government has, in the Environmental Improvement Plan (EIP23), set challenging targets which support the commitment to grow a national Nature Recovery Network of wildlife-rich places that boost habitat and species recovery, enhance climate resilience and improve access to nature"
        },
        {
            "text": "Rates of woodland creation need to accelerate to capture carbon and to help biodiversity. To meet legally binding environmental targets, we need to increase tree cover from 14.5% to 16.5% by 2050."
        },
        {
            "text": " "
        },
        {
            "text": "Sharing our vision for woodlands"
        },
        {
            "text": "We cannot meet these challenging targets on our own and we need to work with land managers, government agencies and others to achieve this. In May 2023 Marian Spain, CEO of Natural England, and Richard Stanford, CEO of the Forestry Commission, signed a joint statement on woodland creation. Initially internally focused, we now want to share this thinking more widely."
        },
        {
            "text": "The statement sets out the types of woods and trees we want to see created to deliver EIP23 targets. Importantly, it makes the point that we need all sorts of trees and woody habitats to deliver government ambitions for nature recovery, carbon sequestration and timber production."
        },
        {
            "text": "This includes woodlands designed specifically for nature recovery and commercial tree plantations, from scrub and trees outside of woods and on our city streets, to agroforestry schemes on farmland. Some owners will expect their woodlands to contribute to the bottom line of their business. For others, economics and income may not be the principal reason for creating woodlands and planting trees."
        },
        {
            "text": "Delivery underway and challenges"
        },
        {
            "text": "Forestry Commission and Natural England know that applicants want quick decisions on woodland creation proposals and a predictable and joined up service. Effective joint working is key to making this happen. There have been some good examples of this, including guidance on tree planting and wading birds, and guidance on tree planting and peatland."
        },
        {
            "text": "In February, the Woodland Creation Fast Track, jointly developed with Natural England, was launched. This service will provide applicants with regulatory decisions and grant offers within 12 weeks of receipt where woodland creation proposals are in areas of ‘low sensitivity’ e.g. away from designated sites, deep peat, and the best and most versatile farmland. There are 3 million ha of this land. We only need around 8.5% (260,000 ha) to achieve our legally binding tree cover target, making space for woodland without having negative impacts on food security."
        },
        {
            "text": "So far, the average size of new woodland created under the Nature for Climate Fund is less than 5ha. This may not provide the scale needed for economically viable woodland management; however, these woodlands can provide important benefits for nature and carbon storage. Many owners simply enjoy ‘being there’ and take pleasure from watching their new woodland develop, attracting a variety of insect, bird and animal species."
        },
        {
            "text": "Whatever the objective for creating a new woodland, the ongoing maintenance and monitoring is an essential part of woodland ownership. Forestry Commission and Natural England are working together to encourage owners to improve the condition of their woodlands, recognising them as an asset which requires some form of management."
        },
        {
            "text": "Our woods have a long history of management that has helped create the important woodland habitats we value for wildlife. Ensuring that management, including deer and grey squirrel, is thought about in the design of new woods will enable our new woodlands to be sustainable and resilient in the long term, providing for nature and people."
        },
        {
            "text": "More and more estates and farms are planting trees and creating woodlands. Often woodlands planted for timber production can produce similar levels of income to agriculture in the long term, especially on marginal land. Landowners can also access income from carbon markets via the Woodland Carbon Code."
        },
        {
            "text": "Woodland management at Cranborne Estate"
        },
        {
            "text": "Forestry Commission and Natural England are working closely together to achieve these targets. This means investing in our staff, their expertise, our joint working practices, and our relationships with landowners and managers. To discuss this and much more, Marian and Richard visited Cranborne Estate in Dorset."
        },
        {
            "text": "At Cranborne we saw high-quality broadleaved and conifer mixed forests delivering for timber production and nature recovery, much of it happening on designated land. These forests are managed using continuous cover or irregular forest management, underpinned by a long-term vision. We also saw an impressive large scale nature recovery project on the edge of the Dorset Heaths, where a mix of trees and open areas are being managed using natural processes."
        },
        {
            "text": " "
        },
        {
            "text": "Key messages"
        },
        {
            "text": "· Cranborne demonstrates how economically viable land management can work for food, timber, biodiversity and people. Timber production and provision of biodiversity are not mutually exclusive, well managed conifers can help nature recovery, and broadleaves can be managed to produce income from timber sales."
        },
        {
            "text": "· Keeping landowners at the centre of woodland planning and habitat restoration decision making is key to making rapid progress towards woodland creation and habitat restoration targets."
        },
        {
            "text": "· The structure created through good management is key for the biodiversity outcomes and resilience of the forests."
        },
        {
            "text": "· Where we have sufficient scale and where natural processes are happening it is possible to take a more pragmatic approach to regulation that, for good reason, has been required on some of our protected sites."
        },
        {
            "text": "· Whilst at Cranborne continuous cover forestry was the best approach given site conditions and owner objectives, other approaches to management will be required to deliver successful outcomes elsewhere."
        },
        {
            "text": "· To create and manage truly multi-functional woodlands needs high quality silviculture. There is a need for Forestry Commission and Natural England to work with sector leaders to help increase the number of skilled practitioners."
        },
        {
            "text": "· Scale is important, not just for nature recovery but also to deliver the economies of scale needed to make woodland management economic. Farm/environmental farmer clusters, or the forestry equivalent, may help facilitate working across landholdings to provide the scale but need long-term commitment and facilitation."
        },
        {
            "text": "For further information, read our joint statement, or contact Adrian Jowitt, Natural England and Ian Tubby, Forestry Commission."
        }
    ]
}