{
    "url": "https://defrafmp.blog.gov.uk/2024/09/25/a-new-term-has-started-for-fisheries-management-plans/",
    "title": "A new term has started for Fisheries Management Plans ",
    "authors": [
        "Anne Freeman - Deputy Director- Domestic Fisheries and Reform, Defra"
    ],
    "categories": [
        "-Defra FMP programme"
    ],
    "pub_date": "2024-09-25T11:45:00+01:00",
    "content": [
        {
            "text": "After a short hiatus because of the General Election, it feels as if things are ramping back up. "
        },
        {
            "text": "During what is called the “pre-election period”, the Civil Service is limited in what it may do publicly and in the announcements it can make.  This is to ensure that we do not give one party an advantage or take attention from the election or candidates. "
        },
        {
            "text": "When a new government is formed, the Civil Service must build relationships with new ministers, brief and listen to their priorities.  We must check they want to continue with policies taken by the previous government, or whether they want to take a new direction.   "
        },
        {
            "text": "Over the summer, Defra’s new ministers agreed we should continue with development and implementation Fisheries Management Plans (FMPs).  We are therefore replanning our work and going through wider government clearances before we start formal processes and engagement.  Informal engagement has already started. "
        },
        {
            "text": "Our new Ministers are very supportive of the creation of policies in collaboration with those affected by them and they have asked us to think about how to do this even better.   "
        },
        {
            "text": "Getting an early start on this and working in partnership with the Cornish Fish Producers’ Organisation, National Federation of Fishermen’s Organisations, and UK Association of Fish Producer Organisations and Marine Management Organisation we are piloting an all-encompassing fisheries management, face-to-face workshop with commercial fishers.  "
        },
        {
            "text": "The pilot for this event will be held in Cornwall. The workshop will trial different ways of working together with a range of different policy areas coming together for the first time, including FMPs.  It will be held during a spring tide to hopefully mean fishers are more able to attend.  To manage numbers, it will be by invitation, but we will try to ensure attendees are representative.  And don’t worry, there will be plenty of other opportunities for others to get involved.   "
        },
        {
            "text": "We will use what we learn from this pilot to help improvements in future engagement with the fishing industry and if successful will look to run similar events around the country. "
        },
        {
            "text": "Watch this space for other new approaches as well as the return of old favourites. "
        }
    ]
}