{
    "url": "https://digitaltrade.blog.gov.uk/2024/09/25/accessibility-is-everyones-business/",
    "title": "Accessibility is everyone's business",
    "authors": [
        "Anais Reding, Chief Digital Officer - Business Growth",
        "Kathy Gribbin, Portfolio and Assurance Analyst and Accessibility Compliance Lead",
        "Ben Armstrong - Design Operations Lead and Accessibility Lead",
        "Jamie Sergeant - Global CEO of Crowd and DBT Export Champion"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2024-09-25T11:50:44+01:00",
    "content": [
        {
            "text": "It is well documented that at least 1 in 5 people have a long term illness, impairment or disability while many more have a temporary disability. At the Department for Business and Trade (DBT), our work is focused on business growth. When you speak about ‘businesses’ all day, it can be easy to forget that it is people who make them up. And when you're focused on delivering outcomes for the public, it can also be easy to forget that it is colleagues who deliver these. In this blog post, we share some of what we’re up to at DBT to make sure that our corporate and public services are accessible to all.  "
        },
        {
            "heading": 2,
            "text": "Ensuring compliance after the rush of delivering in time for EU Exit "
        },
        {
            "text": "The Digital, Data and Technology (DDaT) team at DBT first formed to build a new independent trading infrastructure in time to leave the European Union. We had to build services at scale and at pace and we wanted to make sure that we did this while meeting government standards."
        },
        {
            "text": "To meet government requirements and accessibility regulations digital services must:"
        },
        {
            "text": "Initially we conducted an accessibility review of our services and we focused on whether services had an up to date accessibility statement. This would show us whether services were aware of any areas where they did not meet accessibility standards as they are listed in the accessibility statement.  "
        },
        {
            "text": "The review results were sobering. Only 19% of our services met accessibility compliance regulations.  "
        },
        {
            "text": "We then undertook a programme of work to rectify this. We spoke to service owners and their teams and commissioned external accessibility audits conducted by the Digital Accessibility Centre."
        },
        {
            "text": "Due to this, all our live services now have accessibility statements and 95% of them have been reviewed and updated within the past 12 months.  "
        },
        {
            "text": "90% of our services have also undergone an external accessibility audit. All new services now undergo an accessibility audit in their early development stages.  "
        },
        {
            "heading": 2,
            "text": "Forming the Accessibility Working Group "
        },
        {
            "text": "We wanted all our corporate and public services to meet accessibility standards. We made an explicit decision at the time that we wanted accessibility to be everyone’s responsibility. We did not think we could meet our ambition if services were not procured and built with accessibility in mind from the outset."
        },
        {
            "text": "We were lucky that DBT had already accepted it should meet the Technology Code of Practice and Service Standard for all services, regardless of users or size. So, we formed an accessibility working group to supplement this governance by giving colleagues a space to seek support, identify common challenges and opportunities. "
        },
        {
            "text": "The accessibility working group is an informal group made up of staff from a range of professions, from content and design to service assurance. It includes colleagues who have various accessibility needs who can give insight to the working group. We meet every 3 weeks to discuss accessibility challenges and share pertinent information. We also invite colleagues who have queries to present their questions and discuss them with the group. Where necessary, we signpost them to teams who might be able to offer practical support to them.  "
        },
        {
            "text": "The working group’s mission is to “help colleagues understand the importance of accessibility and provide them with the knowledge, resources and support to make all our digital content, products and services accessible”. "
        },
        {
            "heading": 2,
            "text": "Working with commercial "
        },
        {
            "text": "A few of the services we were procuring did not meet the government standards for accessibility. As many of our corporate systems are procured off the shelf, this is a real challenge to ensure we can support our colleagues to do their best work."
        },
        {
            "text": "It has also posed issue with some of our public services. For example, we previously had a grants application system for small to medium-sized businesses. While we asked the supplier to address these issues, we found that our contract had not been sufficiently explicit for us to enforce this.  One of DBT’s own Export Champions, Jamie Sergeant, Global CEO of Crowd, told us that he had considered giving up his own application a number of times, given how challenging it was for him to complete it with his dyslexia. We have since tightened up digital, data and technology contract terms to make sure that can they all meet accessibility standards."
        },
        {
            "heading": 2,
            "text": "Improving services developed in-house "
        },
        {
            "text": "We had work to do on our own services too. Many of them were built at pace with evolving stakeholder demands at a time of significant change for the department and country.  "
        },
        {
            "text": "One of those services was Great.gov.uk. The accessibility audit and its comprehensive report revealed several issues. The team divided them into items which would require design solutions to address and those which were less involved fixes, (but no less important), which could be directly addressed by the development team. "
        },
        {
            "text": "We also changed the way the team were working. We decided to include at least one accessibility resolution ticket per developer per sprint period.  We also implemented accessibility checklists, local testing demos and awareness sessions. These ensured that ‘easily caught items’ weren’t being sent out to audit and built skills and knowledge in the team. "
        },
        {
            "text": "As part of these we implemented, smaller more regular, targeted audits to make accessibility part of our program of continual improvements for all our services. We are also making strides in building a design system and service manual to embed these processes, skills and knowledge across the department. "
        },
        {
            "heading": 2,
            "text": "Our Export Champions coming together "
        },
        {
            "text": "We have loved seeing a number of our Export Champions come together around their shared challenge of dyslexia.  They support and advocate for each other and the many businesses who are affected in one way or another by dyslexia.  "
        },
        {
            "heading": 3,
            "text": "Jamie Sergeant"
        },
        {
            "text": "“This group was formed to support each other in both our work we do as export champions and to offer general support. It was amazing to learn just how many people have created successful businesses with a focus on exports that are dyslexic.  "
        },
        {
            "text": "Sir Richard Branson is a huge advocate of dyslexic thinking and I do believe that it can be a superpower in business. Everything we do is thought about from a different perspective. This can be a huge challenge in some aspects of business, but a massive advantage in others. "
        },
        {
            "text": "This also varies from person to person. For me it meant that I was not able to attend university as I didn't achieve any academic GCSE’s. Thankfully I was able to work due to the Youth Training Scheme and worked my way up. This meant that not only was I an expert tea maker, but really understood every aspect of the advertising industry. This has helped a lot with running an agency.\""
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "As we continue our mission of making accessibility everyone’s business, we are looking forward to a few things: "
        },
        {
            "text": "For queries related to digital services accessibility, email digital.accessibility@businessandtrade.gov.uk."
        }
    ]
}