{
    "url": "https://medregs.blog.gov.uk/2024/09/25/an-update-on-our-plans-for-med-tech-regulatory-change/",
    "title": "An update on our plans for Med Tech regulatory change",
    "authors": [
        "Laura Squire"
    ],
    "categories": [
        "Med Tech Regulations",
        "Medical Devices"
    ],
    "pub_date": "2024-09-25T16:05:30+01:00",
    "content": [
        {
            "text": "Our external engagement on the programme of regulatory changes for medical devices has re-started in earnest this week following the pre-election period and early discussions with new ministers. Bilateral meetings with Trade Associations have begun again, we are speaking at a number of conferences, and this week I am really looking forward to attending a patient engagement forum led by the Patient Safety Commissioner. This blog seems to be a useful way of reaching people, so I am pleased to be starting this up again too."
        },
        {
            "text": "So where are we? Overall, the ‘shape’ of the roadmap we published in January 2024 remains the same, but some of the detail and timings will be slightly different. It remains the plan to bring our Medical Devices 2002 regulations up to date through a series of statutory instruments (SI), beginning with one that sets out clearer rules for Post Market Surveillance (PMS)."
        },
        {
            "text": "PMS covers the actions manufacturers need to take to monitor and report on devices once they are on the market. We have been working hard since May 2024, when we originally planned to put this to MPs and Peers, to make sure we minimise any delays, and I was really happy to see that Baroness Merron chose to announce last week that the government intends to lay the PMS regulation in Parliament before the end of the year."
        },
        {
            "text": "I began writing this blog in a quiet corner of the Airport in Seattle, waiting for my flight home following a week meeting regulators and representatives of industry and academia from across the world. What is inspiring is not only the shared commitment to patient safety, but the way this is being achieved in a harmonised way, led by the World Health Organization (WHO) through the Global Model Regulatory Framework. This is enabled through detailed IMDRF technical documents covering a range of subjects from essential principles to Unique Device Identifiers (UDI) and Software as a Medical Device."
        },
        {
            "text": "The IMDRF family is getting larger, with more affiliate members joining last week, and I feel extremely proud of the UK position in the forum. We are one of the eleven Management Committee members and leaders of several key working groups, including one looking at the clinical evidence requirements for IVDs which had its first meeting in June. In 2029 we are due to chair the forum and given the scale of the events this year hosted by US FDA, now doesn’t feel too early to start planning."
        },
        {
            "text": "Although IMDRF is trying hard to harmonise regulations, we all have different local contexts, health systems and priorities which lead to differences in the way the IMDRF guidance is translated into local regulatory frameworks. Those trading in global markets must navigate these differences and regulatory reliance came up in most of the discussions I had last week. Reliance is not only a way in which new countries with developing regulatory systems, can get access to safe products, but it is also a way for those with mature frameworks, such as the UK, to reduce regulatory duplication. It enables regulators to focus more on novel and innovative products, at the same time as reducing regulatory burdens, where safe to do so, on industry."
        },
        {
            "text": "At the MHRA we are thinking about reliance in two ways:"
        },
        {
            "text": "As we said in our published roadmap, after the PMS SI, we plan to lay a further statutory instrument, bringing in new measures which must be taken before a product can be put on the market. Our plans for this Pre-Market SI are that it will improve patient safety as well as patient access."
        },
        {
            "text": "We have been busy over the summer, as have our legal team, and we are well advanced in the drafting of the Pre-Market SI, but there are many checks and balances of the democratic process to go through before it could become law. Subject to those checks and balances, the measures to improve patient safety will include;"
        },
        {
            "text": "These measures are direct responses to the Independent Medicines and Medical Devices Safety review and will enable not only the MHRA, but the whole health system, to better protect patients."
        },
        {
            "text": "Protecting patients also means enabling the supply of safe products to the NHS to continue without unnecessary barriers being in place. We plan to address this in a number of ways in the Pre-Market SI. Whilst the improvements to patient safety in this SI, listed above, will be in line with our 2021 consultation, the measures to improve access go further, so we will need to consult on them. This will be focused and timed to enable meaningful input from stakeholders whilst maintaining pace. My ambition is to complete the consultation before the end of 2024. I think that is realistic, but I do not hold all the cards."
        },
        {
            "text": "For me, a regulatory framework is a broad term, encompassing the legal instruments but also the guidance and pathways available to get products to patients. Beyond the regulations, the MHRA software team has been busy, continuing to work both in the UK and internationally to better understand the challenges of these types of products. New internationally aligned guidance on transparency principles for machine learning medical devices has been released and this week, a call for pilot products to take part in our world leading regulatory sandbox, the AI Airlock, has been announced.Fees – please have your say - I would like to take this chance to say something about our fees consultation. There is still another month to give feedback and I would encourage people to do that with meaningful comments that can help us make informed decisions about future direction."
        },
        {
            "text": "I have already had a lot of informal feedback especially regarding our plans to introduce an annual registration fee. This is something that many other regulators do. Having an accurate record of products that are on the UK market is fundamental to us being able to effectively regulate. That requires people and technology, but it also requires up-to-date information. We need to recover our costs on those things. What is critical is that the fees recover costs correctly. Your suggestions on how our proposals could be improved would be very much appreciated."
        },
        {
            "text": "In the future we also hope that the MHRA database will be the foundation of a wider Product Information Management system or PIM, which would be used by the NHS as a single source of truth for the products they need. This is a long-term objective which will benefit patients and manufacturers. Excellent data quality is fundamental to that."
        },
        {
            "text": "Finally, I would like to say something about the team. We continue to grow in size and capability, and since Rob Reid joined as my deputy at the end of April, we are re-structuring a little. We continue to deliver the regulatory reforms by drawing on expertise from across the Agency, including on conformity assessments, safety and clinical investigations, as well as the growing expertise in the Innovative Devices team."
        },
        {
            "text": "Reporting to Rob we have two Senior specialists in Joseph Burt and Paul Campbell, each with two teams reporting to them covering IVDs, General Medical devices, Software in Mental Health Devices as well as Software as a Medical Device more broadly and the AI Airlock team."
        },
        {
            "text": "Our Software team is the fastest growing and whilst a little sad to be losing him, we are happy that experience in the team has provided Paul with a platform to accept a post in a not for profit whose mission is the safe and responsible adoption of AI in healthcare, especially in low- and middle-income countries. That means we are looking for someone new to take on Head of Software and AI as a medical device. There are some big shoes to fill…..but I also know some pretty expert and well connected big feet out there! Please do have a look if you have the right qualities to lead this excellent team or know someone who does!  "
        }
    ]
}