{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/25/applications-are-open-for-the-royal-society-pairing-scheme/",
    "title": "Applications are open for the Royal Society Pairing Scheme ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "GSE Offer",
        "GSE Opportunities"
    ],
    "pub_date": "2024-09-25T10:04:44+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Civil Service applications are now open until 6 November 2024"
        },
        {
            "text": "What is the Royal Society Pairing Scheme?"
        },
        {
            "text": "The Royal Society Pairing Scheme is a long-standing collaboration between the Government Science & Engineering (GSE) Profession and The Royal Society. Each year 30 research scientists and engineers are paired with UK parliamentarians and civil servants for one week."
        },
        {
            "text": "The scheme aims to upskill policy makers on how best to work with scientists outside of government. Next year, the scheme will be taking place between 17 and 20 March 2025. "
        },
        {
            "text": "The scheme has the support of the Head of GSE, and the Government Chief Scientific Adviser, Professor Dame Angela McLean: "
        },
        {
            "text": "“The Royal Society Pairing Scheme is a great opportunity for civil servants and talented UK scientists to experience each other’s worlds and ensure that  Government is empowered by the best scientific evidence. Apply now”  "
        },
        {
            "text": "What is involved?"
        },
        {
            "text": "Participants attend workshops, a parliamentary reception, and other events. Civil servants will be shadowed by scientists for two days to provide insight into government roles, and they’ll also visit the scientists' institutions."
        },
        {
            "text": "Who can apply?"
        },
        {
            "text": "The Royal Society Pairing scheme is aimed at a wide range of career stages, and civil servants are matched to scientists based on their expertise, interest and career stage."
        },
        {
            "text": "Royal Society scientists are matched with engaging civil servants who work in a policy area that matches one of the scientists' fields of study."
        },
        {
            "text": "To be eligible for the scheme you must: "
        },
        {
            "text": "Please note, you can contact the GSE Profession Team for support in arranging a suitable working location if you do not have access to a London office.  "
        },
        {
            "text": "Apply now"
        },
        {
            "text": "Why get involved?  "
        },
        {
            "text": "Past participant Eunice Wong, shares her thoughts on the experience: "
        },
        {
            "text": "“The experience deepened my understanding of how science and policy overlap in different ways. I identified the importance for us as policy makers to communicate with scientists from all different levels.”"
        },
        {
            "text": "You can read more in her blog about her experiences on the scheme."
        },
        {
            "text": "Key Dates "
        },
        {
            "text": "If you’re interested in applying, please fill out the application form. If you would like more information on the scheme, please contact gse@go-science.gov.uk.  "
        }
    ]
}