{
    "url": "https://defrafarming.blog.gov.uk/2024/09/25/extending-the-tree-health-pilot-scheme/",
    "title": "Extending the tree health pilot scheme ",
    "authors": [
        "Dr Elspeth Steel"
    ],
    "categories": [
        "Payments to improve tree health"
    ],
    "pub_date": "2024-09-25T12:01:17+01:00",
    "content": [
        {
            "text": "I’m pleased to share that funding for the tree health pilot scheme has been extended."
        },
        {
            "text": "In this post, I’ll provide an overview of the scheme and details of what the extension includes."
        },
        {
            "text": "Pests and diseases, like the spruce bark beetle (Ips typographus) and ash dieback, threaten our trees. "
        },
        {
            "text": "The tree health pilot scheme tests different ways to slow the spread of pests and diseases and increase the resilience of trees in England."
        },
        {
            "text": "Grants from the pilot support actions such as biosecure felling, treatment and the restocking and maintenance of newly replanted trees after a pest or disease outbreak."
        },
        {
            "text": "We’re very grateful to the farmers and land managers who have worked with us to help support and protect our trees and woodlands."
        },
        {
            "text": "The extension will ensure there is no gap in support as we transition into our environmental land management schemes."
        },
        {
            "text": "The tree health pilot scheme launched in 2021 and is administered by the Forestry Commission. There are currently 87 agreements in place with farmers, small landowners, local authorities and national park authorities. Some of those agreement holders kindly shared their experiences. I've included these below. "
        },
        {
            "heading": 2,
            "text": "The extension"
        },
        {
            "text": "The extension introduces new opportunities for funding, including:"
        },
        {
            "heading": 2,
            "text": "What existing agreement holders say"
        },
        {
            "heading": 3,
            "text": "Tackling the spruce bark beetle on the Hole Park Estate"
        },
        {
            "text": "The pilot helped prevent the spread of pests and diseases at Hole Park in Kent. This family-owned estate has a history of growing spruce for the local Christmas tree market. "
        },
        {
            "text": "In early 2022, Forestry Commission surveillance identified it as a site susceptible to Ips typographus, a spruce bark beetle. The beetle is a major pest in Europe and can severely damage Britain's spruce forestry and timber industries. "
        },
        {
            "text": "After a successful grant application, the landowner received support for proactively felling the ‘at-risk’ spruce and restocking with a diverse mix of trees."
        },
        {
            "text": "Edward Barham, owner of Hole Park, said:"
        },
        {
            "text": "\"I am sure that every forester wants to see Ips typographus defeated, so I was pleased to cooperate. I have more to lose than most because we are significant Norway spruce growers for the Christmas tree trade. Those plantations are actively monitored and managed, so Ips typographus is not a significant threat in them, but we could not tolerate it building up in woodland nearby."
        },
        {
            "text": "The Forestry Commission team has been fantastic in assisting with this new grant, of which I was a pilot applicant. Both sides were learning fast. I am proud that Hole Park is at the forefront of the battle against this controllable pest.\""
        },
        {
            "heading": 3,
            "text": "Haringey Council's plan for OPM in Haringey"
        },
        {
            "text": "Annabel Foskett, the Nature Conservation Officer for Haringey, applied for the Tree Health Pilot scheme and acted as lead facilitator for a group of local landowners."
        },
        {
            "text": "Haringey Council has been working with the Forestry Commission to tackle the large number of oak trees becoming infected with oak processionary moth (OPM)."
        },
        {
            "text": "As caterpillars, oak processionary moths can defoliate large areas of oak trees, leaving them vulnerable to disease, drought and flooding. "
        },
        {
            "text": "The caterpillars have thousands of hairs which, when in contact with human or animal skin, can cause rashes and, in more serious cases, breathing difficulties and eye problems."
        },
        {
            "text": "The scheme enabled OPM to be surveyed successfully across the entire borough for two consecutive years. This allowed Annabel to create an action management plan, which analysed the survey data and categorised the sites into low- to high-risk areas."
        },
        {
            "text": "By supporting Annabel, she was able to collaborate with various stakeholders, including local communities, environmental organisations and government agencies, to bring together diverse expertise and resources."
        },
        {
            "text": "Funding allowed for educational programmes, workshops and volunteering opportunities to raise awareness about tree health issues and involve residents in monitoring and managing OPM."
        },
        {
            "text": "Annabel  said:"
        },
        {
            "text": "\"Setting up the grant and acting as Lead Facilitator in Haringey was an intense yet fulfilling process. It required meticulous planning, strong leadership, effective communication and a deep commitment to community and environmental health. The collaborative effort and positive outcomes made the hard work worthwhile, demonstrating the power of community-driven initiatives in addressing environmental challenges.\""
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": "You can apply for the scheme now."
        },
        {
            "text": "You can receive funding from other agri-environment or woodland initiatives at the same time, as long as you’re not receiving payments for carrying out the same action."
        },
        {
            "text": "The pilot operates in the following regions: north-west, West Midlands, south-east, London and East Anglia (in the Ips typographus demarcated area)."
        },
        {
            "text": "Apply for the Tree Health Pilot or contact us at thpilotenquiries@forestrycommission.gov.uk."
        },
        {
            "text": "Find out more about the Tree Health Pilot."
        }
    ]
}