{
    "url": "https://services.blog.gov.uk/2024/09/25/how-government-defines-a-service/",
    "title": "How government defines a service",
    "authors": [
        "Ben Tate, Head of Strategy and Standards, CDDO"
    ],
    "categories": [
        "Naming things",
        "Service Standard",
        "Service transformation"
    ],
    "pub_date": "2024-09-25T07:32:54+01:00",
    "content": [
        {
            "text": "The Transforming Government Services team mission (at the Central Digital and Data Office) is to share good practice in digital and data across the public sector."
        },
        {
            "text": "CDDO is responsible for the Service Standard and the Service Manual, and in our previous blog post we talked about the need to update them. The main focus of our guidance and assurance processes is transactional services. However, many parts of government are thinking (and delivering) beyond that."
        },
        {
            "heading": 2,
            "text": "Why we’ve been working on a service definition"
        },
        {
            "text": "As we explain in a recent blog post, we want to expand our guidance to include more information about services that are not narrow, simple and transactional. The Top 75 Services programme champions services that take ownership of the users’ experience across their full, end-to-end journey and all of the organisation’s activities that support it. For example not just the process of applying for a new passport, but all the checks that happen behind the scenes, the producing of documents, and the sending and receiving of them too."
        },
        {
            "text": "Getting the scope of your service right is very important as it affects:"
        },
        {
            "text": "There have been successful attempts to define a service and there’s usually a close relationship between the definition of a service and its scope. However, we’ve learned that scope does not itself define a service. It’s all about understanding the outcome that you want to deliver. A broader or narrower scope says more about the organisation’s ambitions."
        },
        {
            "text": "So now we feel it’s time to introduce an official definition of a service for the specific purpose of focussing on outcomes, and tying all of the different types and scopes of services together."
        },
        {
            "heading": 2,
            "text": "How this definition is helping teams across the Government Digital and Data profession"
        },
        {
            "text": "We have been using this draft definition for a while and have found that it’s helping organisations across government in the following ways:"
        },
        {
            "text": "We’ve had feedback on this definition from hundreds of colleagues across the public sector. "
        },
        {
            "heading": 3,
            "text": "How the Department for Environment, Food and Rural Affairs (Defra) has been using the definition to shape their transformation strategy"
        },
        {
            "heading": 2,
            "text": "What a service is"
        },
        {
            "text": "When we talk about a service, we mean all the things that government collectively provides to deliver an outcome for all of its users, through any path a user takes to reach their goal."
        },
        {
            "heading": 3,
            "text": "What we mean by an outcome"
        },
        {
            "text": "An outcome is made up of 2 elements:"
        },
        {
            "text": "There are 3 levels of outcome that all contribute to these needs. Using ‘Apply for a driving licence’ as an example, these are:"
        },
        {
            "text": "An overall service outcome is often part of an even wider user journey. For example, a user’s need to legally drive a car on the road could be the result of moving to an area where there is less public transport, or needing to transport a relative they care for."
        },
        {
            "text": "A user journey could be triggered by someone’s change of circumstances or aspirations, a news story, a change in government policy or a government campaign."
        },
        {
            "text": "When government delivers an outcome, a user usually gets something along the way that has a policy intent behind it. Examples of what a user gets could be:"
        },
        {
            "text": "For government or ‘internal’ users, the examples could be:"
        },
        {
            "text": "Some services deliver multiple different outcomes at different times."
        },
        {
            "heading": 3,
            "text": "What we mean by things that collectively provide an outcome"
        },
        {
            "text": "To deliver an outcome for users, a service usually includes a number of different things, including:"
        },
        {
            "text": "For users of a service this includes all the things they interact with, like:"
        },
        {
            "text": "And to make sure the service works for everyone, it has to work across all channels such as:"
        },
        {
            "text": "A service also includes all the technology and data that supports its operation from start to finish."
        },
        {
            "text": "Usually it takes more than one part of government to deliver a whole service. On the way to getting an outcome, a user is likely to interact with things provided by several different organisations, functions and professions. For example:"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We’ll be publishing the service definition as guidance in the Service Manual."
        },
        {
            "heading": 3,
            "text": "Let us know what you think"
        },
        {
            "text": "We’d love to hear your feedback."
        },
        {
            "text": "You can:"
        }
    ]
}