{
    "url": "https://naturalengland.blog.gov.uk/2024/09/25/industry-experts-share-experiences-of-biodiversity-net-gain-on-small-sites/",
    "title": "Industry experts share experiences of Biodiversity Net Gain on small sites",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Ecosystem Services",
        "Environmental Improvement Plan"
    ],
    "pub_date": "2024-09-25T12:28:24+01:00",
    "content": [
        {
            "text": "In this Biodiversity Net Gain (BNG) guest blog industry experts sharing examples of BNG on small sites. They are: "
        },
        {
            "text": "Our guests discuss how they use the Small Sites Metric (SSM) calculation tool. It applies only to ‘small sites’ as defined in The Small Sites (Statutory Biodiversity Metric) User Guide. In short, this means residential development with 1 to 9 dwellings on a site area less than 1 hectare. If the number of dwellings is unknown, the site area must be less than 0.5 hectares. Non-residential development is where the floor space created is less than 1,000 square metres or the total site area is less than 1 hectare. Refer to the SSM User Guide for further information. "
        },
        {
            "text": "In their own words, here are Karl, Oliver and Ella’s reflections on their experience with BNG on small sites below. "
        },
        {
            "text": "by Karl Powell - KADS Design Ltd"
        },
        {
            "text": "A client asked KADS (Design) Ltd to design and develop a set of new garages in Bulkington, Warwickshire for prompt submission to the Local Planning Authority (LPA). The garages would be built in an area with both sealed surface and habitats with plants. The site did not qualify for a BNG exemption. "
        },
        {
            "text": "The site was under 10,000 m² and the total commercial floorspace of the new build was under 1,000 m2. This meant that KADS (Design) Ltd could produce a Small Site Metric (SSM). The team was able to easily map out the current habitats on the site using available digital tools. The intended works were then added.  "
        },
        {
            "text": "The team saw the impact of the original plans on the biodiversity score. We agreed that there was no need to pave over the land around the edges of the garages as originally intended. Instead, we decided to convert the paving into grassland with a few small trees. Following this, the team adapted the designs to add a set of trees and two areas of high-quality grassland habitat. "
        },
        {
            "text": "KADS (Design) Ltd offered a new design for the site within hours. It clearly delivered an on-site gain of over 10% and fully complied with the principles of the mitigation hierarchy. The team used the Small Site Metric and available online digital tools to achieve this. This enabled them to fully meet the BNG requirements. They also delivered an improved design and submitted all necessary documentation to the LPA in a matter of hours. This prevented the client from experiencing any delays or onerous costs. The Small Site Metric saved time and money. It also allowed the client and developer to work together to find a solution that suited everyone.   "
        },
        {
            "text": "by Oliver Lewis - of Joe’s Blooms"
        },
        {
            "text": "The project was to secure planning permission for a new agricultural building and to extend a gravel pathway on a field. The application was subject to mandatory BNG because it was submitted after 2 April 2024, and it affected more than 25m² of the field. "
        },
        {
            "text": "The proposed development involved building over a portion of grassland. The red line boundary only covered a small part of the field. Most of that was existing paving. This meant it wouldn’t be possible to secure the necessary uplift by enhancing the field. Instead, the team would identify and use an appropriate set of specific uplifts.  "
        },
        {
            "text": "The total area of the site was under 10,000 m² and the new building had a footprint of less than 1,000 m². So, the team could use the Small Site Metric (SSM). Unlike the main metric, the SSM does not require an ecologist to undertake habitat condition assessments, although it must be completed by a competent person with the knowledge and skills to complete and review SSM calculations. This meant the team could use the SSM and other digital tools like ours instead. "
        },
        {
            "text": "The team used these tools to map out all the habitats within the red line boundary. They adapted the site design to add small trees to the perimeter of the field. These included saplings with diameter at breast height of under 30cm. It was also deemed possible to improve the grass mix within the margins by planting a more diverse mix of species, which would further boost the BNG score.  "
        },
        {
            "text": "By iterating the design, the project found a way to secure the needed on-site uplift by planning to transform what was originally a species-poor field margin into a species-rich area. It is defined by high-quality grassland and small trees. BNG requirements were both good for habitat, and the aesthetics of the new development and the wider site. "
        },
        {
            "text": "The team was able to find an on-site solution within the constraints of a limited red line boundary. By using the SSM and digital tools available to them, they were able to generate the SSM Excel sheet, habitat plans, and submit them to the Local Planning Authority. The Small Site Metric allows developers a simple, proportionate and effective way to measure biodiversity, and (even better) the metric is available online for free.  "
        },
        {
            "text": "by Ella Dangerfield - of Burton Reid Associates"
        },
        {
            "text": "We used the Statutory Small Sites Metric (SSM) to inform proposals on a rural farmyard site near Buckfastleigh, Devon. The plans included a static caravan, a soakaway and a water treatment plant. The site consisted largely of ‘bare ground’ with some areas of ‘other neutral grassland’ and a small patch of ‘modified grassland’. "
        },
        {
            "text": "When measuring the habitat impacts, we looked at the static caravan’s position on habitat classified as ‘bare ground’. This means any type of bare soil or unvegetated substrate, rather than just hardstanding. So, net gains can still be triggered. We also found the groundworks for the installation of the soakaway will cause loss of ‘modified grassland habitats’. However, the loss of this habitat was recorded as a temporary loss because the habitat would reach its pre-development state again within 2 years. The ‘other neutral grassland’ would be retained, and a 10% gain would be achieved with the planting of a tree adjacent to the caravan.  "
        },
        {
            "text": "Our experience using the SSM is that it is limited in its use. Small sites are by their very nature limited in size and therefore contain few areas to deliver BNG. Many sites that we use the SSM for contain a large proportion of garden space. Although private gardens cannot be legally secured, gardens can make a positive contribution to biodiversity. The SSM recognises this in its scoring of the value of gardens. However, it is not possible to use the SSM on all sites defined as ‘small sites’. For example, if European protected species are present or when a designated site such as a Site of Special Scientific Interest (SSSI) or a Special Area of Conservation is within 500m, it may be more appropriate to use the full metric.  "
        },
        {
            "text": "The SSM has proved to be a simplified tool for calculating the habitat needed to fulfil the mandatory net gain requirement. It does so in a way that is proportional to the scale of the impacts on small sites.  "
        }
    ]
}