{
    "url": "https://environmentagency.blog.gov.uk/2024/09/25/should-i-swim-in-the-river-or-at-the-beach/",
    "title": "Should I swim in the river or at the beach?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas"
    ],
    "pub_date": "2024-09-25T13:14:16+00:00",
    "content": [
        {
            "text": "Summer is ending and you may be tempted to go for a swim in the river instead of the sea for a change, with just under half of the new bathing water sites announced this year being in rivers. So how do you find out where is the best place to swim and what information is out there to help you to decide? "
        },
        {
            "text": "New bathing waters – expectation vs reality "
        },
        {
            "text": "First, it’s important to know that just because a site is newly designated, that does not mean a guarantee of good bathing water quality. When Defra receives applications to consider new bathing water locations, the criteria cover elements like usage, access and the location of amenities like toilets. It does not initially include water quality as the sites will not have been previously sampled for bathing water quality. But once a bathing water does become designated, it will be managed and expected to reach water quality standards fit enough to swim in – which is not the case for other water bodies.  "
        },
        {
            "text": "In our Wessex area – our operational zone which covers Somerset, Dorset and other counties - samplers for the first time are now collecting compliance samples from our three new river bathing water sites, on the River Tone at French Weir Park in Taunton, River Frome at Farleigh Hungerford and River Avon at Fordingbridge. Once enough samples have been taken this season, each site will be given a bathing water classification ranging from ‘Excellent’ to ‘Poor’ to help you decide where to go swimming. It can often take years to build an accurate picture of the factors that might be affecting the bathing water quality at a site. In the meantime, if you are river swimming, consider the length of the river upstream of a new site and all the possible sources of pollutions along it like water company discharges, agricultural runoff, even septic tanks.  "
        },
        {
            "text": "Should a bathing water site be classified as ‘Poor’, then an action plan to investigate why is put in place. But finding solutions will take time and there is not likely to be a single fault to fix. Encouragingly, water companies have already approached us to discuss how to improve bathing water quality in designated rivers to a swimming standard despite the extra challenges present in these locations. "
        },
        {
            "text": "From the river ... "
        },
        {
            "text": "So why has there been a shift away from traditional coastal locations to rivers, estuaries and lakes? There is a lot of public interest to address concerns about water quality in these places and raise the bar from an ecological standard set to protect fish and wildlife up to a much higher level of quality needed for safe human use. Rivers have not been managed for recreation until recently. Rivers are usually monitored for their ecological health. However, this historic monitoring doesn’t include measuring the bacteria that would indicate a possible risk to human health as the river wildlife is largely unaffected by these. The bacteria we measure for bathing water quality come from faeces, which in turn can be present in treated and untreated sewage effluent, runoff from livestock and farming or from private treatment systems like septic tanks.  Bacteria and pathogens found in sewage and animal slurry pose the two biggest risks to human health. Because these factors do not typically affect wildlife, they haven’t been subject to strict controls.   "
        },
        {
            "text": "... To the sea "
        },
        {
            "text": "Despite the interest in river swimming, many people hit the beach in the summer, of which there are many in the South West. In fact, 99% of the bathing waters in Devon and Cornwall meet minimum water quality standards of 'Sufficient', with 96% meeting ‘Good’ or ‘Excellent’ - and these counties have about a third of England's 451 bathing waters.   Like neighbouring Wessex, sampling in this area is very thorough and quick to flag any issues. Coastal bathing waters also have the advantage of natural disinfection via salt water as well as much greater dilution and we are able to issue pollution risk forecasts based on our knowledge about the tide, rainfall and wind.  "
        },
        {
            "text": "No matter which open water you swim in this summer, anyone can become unwell. Check for any pollution risk forecasts or to review a bathing water’s classification by visiting our Swimfo website. And check out this advice from UK Healthy Security Agency on how to swim healthy and what to do if you become ill.  "
        }
    ]
}