{
    "url": "https://nda.blog.gov.uk/the-value-of-our-lgbt-employees-dr-juliet-long-chief-strategist-for-site-decommissioning-and-remediation-nuclear-decommissioning-authority/",
    "title": "The value of our LGBT+ employees - Dr Juliet Long, Chief Strategist for Site Decommissioning and Remediation, Nuclear Decommissioning Authority",
    "authors": [
        "samfrench"
    ],
    "categories": [
        "diversity"
    ],
    "pub_date": "2024-09-25T09:28:47+01:00",
    "content": [
        {
            "text": "This week celebrates National Inclusion Week (23rd – 29th September), a week dedicated to celebrating inclusion and taking action to create inclusive workplaces, with this year’s theme being ‘Impact Matters’, centring around identifying the impact on marginalised groups and taking actions that make for genuine, sustainable change."
        },
        {
            "text": "To celebrate National Inclusion Week, Dr Juliet Long, Chief Strategist for Site Decommissioning and Remediation at the Nuclear Decommissioning Authority (NDA), reflects on her LGBT+ journey, the importance of LGBT+ in the workplace and how diversity of thought is crucial to the NDA’s mission of decommissioning."
        },
        {
            "text": "“I’ve been with the NDA for just over two years now having spent over 25 years working in the nuclear sector. Both my degree and doctorate are in Geochemistry and I’m a Fellow of the Institute of Environmental Management and Assessment."
        },
        {
            "text": "“The NDA has 17 legacy nuclear sites across its estate that require decommissioning. Our work is world leading. We are constantly learning and adapting our approach to decommissioning, utilising new techniques and evolving technologies."
        },
        {
            "text": "“My role in the NDA is primarily to look at how we can best decommission our sites safely, securely and sustainably to free up our land for reuse, delivering benefit to local communities and the wider economy."
        },
        {
            "text": "“This means determining the urgency with which work is required, as well as the different ways in which we need to deliver it and understanding and managing the hazards and risks associated with our activities, to ensure people and the environment are kept safe."
        },
        {
            "text": "“I’m proud of what I do. I’m proud to identify as a lesbian, and in 2021, I was proud to marry the love of my life, Sarah."
        },
        {
            "text": "“I know that this sector is traditionally not the most diverse sector to work in, however I can say hand on heart that throughout my 25 years within in, I can see that progress is absolutely being made. However, the journey is long and there is still more work that can be done."
        },
        {
            "text": "“It took until I was 26 to ‘come-out’ to my parents despite realising I was gay back in my teens – and that was because I felt shame and embarrassment and because I didn’t want to upset them. I spent a large portion of my life trying to cover up who I was – even with my closest friends and family."
        },
        {
            "text": "“I’m lucky that I no longer feel that shame. As time has progressed, I’ve began to feel the support and acceptance of my friends and family – and indeed work colleagues."
        },
        {
            "text": "“Over time this made a huge difference in my professional surroundings. In my early days I wouldn’t talk at work about home life at all – or if I did it was in very abstract terms, avoiding any gender-specific reference to ‘my other half’. As I started to be more honest, I was paranoid that my work colleagues would think about or treat me differently. And they did…but, to my surprise, not because I’m gay – but because I was being open and honest with them. "
        },
        {
            "text": "“It became clear to me that what really mattered was what I did at work and that I continued to be valued for that. But what I hadn’t appreciated or expected, was my honesty and openness leading to many more conversations with work colleagues about how we each were, what was happening in our lives, so creating a far more supportive environment in which to work. My honesty helped pave the way for others to share some of their own personal experiences that were causing them problems – and let’s face it, we all have them!"
        },
        {
            "text": "“The NDA has a long-term mission to decommission the UK’s legacy nuclear sites safely, securely and with value for money to the UK taxpayer. The importance of our work draws in excellent people from many backgrounds from across the UK and ensuring we are building a workplace where employees, whoever they may be or however they identify, are respected, treated equitably and valued, is essential."
        },
        {
            "text": "“Given we spend most of our lives in work I do believe that we should each help create a workplace in which every one of us can thrive. And if we think about the theme of National Inclusion Week, being inclusive is the biggest impact on any workplace."
        },
        {
            "text": "“Embracing LGBT+ in the workplace is just one way of doing that – whether it’s in celebrating your own identity or in showing support for your colleagues who identify that way. It’s not about saying that one’s sexuality is of fundamental importance to our ‘getting decommissioning done’ – but it is about acknowledging and appreciating our different characteristics, supporting one another, and realising that our differences are what truly make us stronger. And to me, the value in being openly LGBT+ in the workplace is not about broadcasting my own status; it’s about being vocal and visible in a way that might help others who don’t feel so comfortable or welcome, thereby creating a more inclusive and supportive environment for all."
        },
        {
            "text": "“Creating a great workplace in which diversity matters and in which people feel supported in being their true, authentic selves, means also that we can make better decisions. If we were all the same, thought the same and behaved the same – then what a dull and unimaginative world that would be! Diversity of thought help inform and test our strategies and plans and the more representative our workforce can be of society then the better able we are to serve all parts of society – today and in the future.”"
        },
        {
            "text": "The NDA group offers a range of opportunities for those who wish to enter a career within the nuclear sector. To find out more about a career within the NDA, including graduate and apprenticeships opportunities, visit:"
        },
        {
            "text": "NDA group Careers - The NDA group"
        },
        {
            "text": "ndagroupgraduates.co.uk"
        },
        {
            "text": "energus.co.uk/skills-training/apprenticeships/"
        }
    ]
}