{
    "url": "https://educationhub.blog.gov.uk/2024/09/25/what-is-the-national-curriculum-and-why-is-it-being-reviewed/",
    "title": "What is the national curriculum and why is it being reviewed?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "Curriculum",
        "Exams and qualifications",
        "Primary Schools",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2024-09-25T11:00:00+01:00",
    "content": [
        {
            "text": "The national curriculum is a set of subjects and standards used by primary and secondary schools, so children learn the same things.   "
        },
        {
            "text": "We’ve announced that we’ll be holding an independent review to refresh the curriculum and make sure it meets the needs of every child and young person. "
        },
        {
            "text": " The Curriculum and Assessment Review is being led by Professor Becky Francis CBE who is an expert in education policy including curriculum and social inequality. The 8 week consultation was opened on the 25 September 2024."
        },
        {
            "text": " The views of experts, parents and teachers will be key for making recommendations. The review will also take written evidence from stakeholders and undertake a national roadshow, meeting and taking input from staff on the frontline.    "
        },
        {
            "text": "Here we’ll cover what the national curriculum is, who it's for, why it’s being reviewed and what it means for schools and pupils.  "
        },
        {
            "heading": 3,
            "text": "What is the national curriculum?  "
        },
        {
            "text": "The national curriculum is divided into key stages and maps out what schools should be teaching children in both primary and secondary schools. This includes what subjects are taught and what standards children should be aiming for.  "
        },
        {
            "text": "The review will span from Key Stage 1 to Key Stage 5. "
        },
        {
            "text": "Most of the national curriculum was introduced in September 2014, and since then it has been updated multiple times.  "
        },
        {
            "heading": 3,
            "text": "Do all schools have to teach the national curriculum? "
        },
        {
            "text": "Currently, academies and independent schools don’t have to follow the national curriculum.  "
        },
        {
            "text": "However, following the review, all state schools, including academies, will be required to teach the national curriculum.  "
        },
        {
            "text": "Whilst we know that many academies already choose to follow the national curriculum, we think this is important to ensure that all children have a strong core at the heart of their education.  "
        },
        {
            "heading": 3,
            "text": "Why is the curriculum being reviewed?  "
        },
        {
            "text": "The main purpose of the review is to ensure that the curriculum balances ambition, relevance, flexibility and inclusivity for all children and young people. "
        },
        {
            "text": " The review will look to deliver: "
        },
        {
            "heading": 3,
            "text": "What does this mean now?  "
        },
        {
            "text": "The eight-week consultation opened on the 25 September 2024 and is engaging young people, parents, employers and education staff, leaders and experts to bring everyone into conversation about what’s working well and what could work better in the curriculum."
        },
        {
            "text": "Responses will be invaluable in shaping the direction of the review and pivotal to the recommendations Professor Becky Francis and her expert panel put forward in 2025."
        }
    ]
}