{
    "url": "https://dluhcmedia.blog.gov.uk/2023/12/07/coverage-of-high-street-accelerators-announcement/",
    "title": "Coverage of High Street Accelerators announcement",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Levelling Up"
    ],
    "pub_date": "2023-12-07T12:37:03+00:00",
    "content": [
        {
            "text": "The Department for Levelling Up, Housing and Communities has launched a new High Street Accelerators pilot, providing ten high streets across England with a share of £7 million.  "
        },
        {
            "text": "The programme was a key commitment in the government’s Anti-Social Behaviour Action Plan, levelling up high streets most in need by allowing communities and councils to join up on long-term regeneration. "
        },
        {
            "text": "Several local outlets reported that this pilot follows other levelling up schemes including the £1.1bn Long-Term Plan for Towns. BBC Radio Stoke reported favourably on the new programme with Jo Gideon, Stoke on Trent Central MP, stating that the pilot would complement other interventions to address anti-social behaviour on Stoke on Trent’s high street.  "
        },
        {
            "text": "The news was also reported in the Manchester Evening News, Hull Live and Lancs Live, with each outlet carrying a quote from Minister Young, who says that the High Street Accelerators could allow the government to understand the benefits of “local businesses and their communities” working together. "
        },
        {
            "text": "Trade outlets Insider Media and The Business Desk also reported on the story, highlighting that each high street will receive a total of £237,000, with the opportunity to apply for a share of up to £5m to improve their high streets' green spaces.   "
        },
        {
            "text": " "
        },
        {
            "text": "Levelling Up Minister Jacob Young said:        "
        }
    ]
}