{
    "url": "https://forestrycommission.blog.gov.uk/2023/12/07/creating-a-lasting-legacy-of-accessible-woodlands-and-forests/",
    "title": "Creating a lasting legacy of accessible woodlands and forests",
    "authors": [
        "Alison Hallas"
    ],
    "categories": [
        "Access",
        "Health"
    ],
    "pub_date": "2023-12-07T08:00:22+00:00",
    "content": [
        {
            "text": "On 29 November, the government published its Woodland Access Implementation Plan which sets out new ambitions to improve the quality, quantity and permanency of public access to new and existing woodlands in England."
        },
        {
            "text": "By implementing the Woodland Access Implementation Plan, we are working towards meeting one of the commitments of the Environmental Improvement Plan - that everyone should live within 15 minutes' walk of a green or blue space."
        },
        {
            "heading": 2,
            "text": "Why is access to woodlands so important?"
        },
        {
            "text": "Last year people made over 290 million visits to the nation's forests, managed by Forestry England. The most recent Public Opinion of Forestry survey also found that nearly 75% of people have visited woodlands in the last few years. These numbers show the extent of the public’s appreciation for woodlands and forests and highlights their growing role as sought-after destinations that promote wellbeing and recreation."
        },
        {
            "text": "Forests and woodlands are good for our mental health. Woodland visits offer a refreshing escape from daily life, for exercise, relaxation, meditation and connection to nature. Almost 90% of people surveyed by the Forestry Commission last year agreed that woodlands provide spaces for relaxation and reducing stress."
        },
        {
            "text": "Woods can maintain an immersive sense of spaciousness and natural charm even when hosting a considerable number of visitors. They change with each season, offering something new throughout the year, from blooming bluebells to vibrant autumn colours. They are popular with walkers, cyclists, and horse-riders but also offer other adventures that are unique to woodlands, such as high-ropes courses."
        },
        {
            "text": "Having access to woodlands also enables people to better understand and appreciate the nature around them, and why we need to protect and nurture it, as well as showcasing the working environment that many of our woods are. It allows people to experience sustainable forestry management and better understand the value of home-grown timber and wood products."
        },
        {
            "heading": 2,
            "text": "What are the barriers to woodland access?"
        },
        {
            "text": "We know that not all communities enjoy the same opportunities to access woodlands and that there are differences in how confident people feel about visiting them. The increase in woodland visits during the pandemic put pressures on some woodlands and raised awareness of the importance of having easy access to our local green spaces."
        },
        {
            "text": "We understand also that the quality of visitor experiences can vary. In areas with high demand, it is vital that we ensure woodlands can welcome visitors both safely and sustainably, protecting wildlife and delivering the many other benefits to society that they support, such as improved water quality and capturing and storing carbon emissions."
        },
        {
            "heading": 2,
            "text": "The Woodland Access Implementation Plan"
        },
        {
            "text": "Through the Woodland Access Implementation Plan, we are taking steps to improve the quantity, quality and permanency of public access to woodlands. Here are a few examples of the work that’s underway:"
        },
        {
            "text": "We are gathering evidence to find out more about where, how and why people visit woodlands, and the range of recreational activities that people go to woodlands to enjoy. This includes:"
        },
        {
            "text": "We are providing support to both landowners and visitors by:"
        },
        {
            "text": "Through our grants for woodland creation and management, we are:"
        },
        {
            "text": "Forestry England continue to break down barriers for visitors and welcome everyone into the nation’s forests. This includes:"
        },
        {
            "heading": 2,
            "text": "A lasting legacy"
        },
        {
            "text": "Over the coming months, we will be sharing updates and outputs from delivery of the Woodland Access Implementation Plan. We want to create a lasting legacy of accessible woodlands and forests. As they grow and develop, we want people to enjoy them, understand them, and cherish them."
        }
    ]
}