{
    "url": "https://defrafarming.blog.gov.uk/2023/12/07/farming-regulation-from-the-new-year/",
    "title": "Farming regulation from the new year",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2023-12-07T12:14:43+00:00",
    "content": [
        {
            "text": "As part of the agricultural transition away from the European Union (EU), we’re committed to delivering a better regulation system for farming — one that is fair, clear and effective."
        },
        {
            "text": "At the moment, farmers who receive payments under the Basic Payment Scheme (BPS) and some other agri-environment schemes must meet minimum standards to receive those payments. This is known as cross compliance. "
        },
        {
            "text": "We've just published cross compliance guidance on GOV.UK. It explains what the end of cross compliance means for farmers and land managers. "
        },
        {
            "text": "In this post, we'll share some of the improvements we've made to farming regulation. "
        },
        {
            "heading": 2,
            "text": "The next step "
        },
        {
            "text": "BPS and cross compliance will both end midnight 31 December 2023."
        },
        {
            "text": " Rules will continue to protect the environment, animal and plant health, animal welfare and public health. This is because most cross compliance rules are already part of English domestic law and will continue to apply and be enforced by the existing regulators. Farmers will continue to be required to follow these rules. "
        },
        {
            "text": "We also plan to replace BPS with delinked payments on 1 January 2024. These payments will be made between 2024 and 2027 and will make things simpler for farmers during this transition. "
        },
        {
            "text": "Please note that these changes apply to England only.  "
        },
        {
            "heading": 2,
            "text": "Our approach to regulation "
        },
        {
            "text": "At the beginning of the transition, we listened to farmers and overhauled harsh cross compliance penalties. Whilst maintaining compliance rates, this contributed to an almost 95% reduction in complaints from 57 in 2018 to 3 in 2022.  "
        },
        {
            "text": "Now, we’re working with regulators to implement a more preventative and advice-led approach. What this means for farmers is that, wherever possible, we will work with you to get it right and give you opportunities to self-correct before taking formal action.    "
        },
        {
            "text": "Our advice-led approach is achieving real results. The Environment Agency has advised farmers and land managers on complying with the rules, working with farmers on over 12,000 improvement actions since April 2021, with over 6,000 complete so far.    "
        },
        {
            "text": "We’ve also made it easier to find which rules apply to you, with the Rules for farmers and land managers page on GOV.UK. This is a single page for all the ‘must dos’ in law, grouped by activity. For example, if you keep cattle, the section on keeping livestock has a link to the rules for that. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "BPS customers will later this month receive a 'Delinked Payments Information Statement' which shows the ‘reference amount’ used to calculate these payments. "
        },
        {
            "text": "Progressive reductions each year will be subtracted from this figure, as these payments phase out by the end of 2027.  "
        },
        {
            "text": "As we set out in the Agricultural Transition Plan, the money freed up from Direct Payments is put straight back into our farming schemes. You can receive delinked payments and apply for these schemes.    "
        },
        {
            "text": "The Rural Payments Agency (RPA) will also email Countryside Stewardship and Environmental Stewardship agreement holders this month with links to further guidance.    "
        },
        {
            "text": "As always, we are keen to get your feedback. Please do share your reflections in the comments. "
        }
    ]
}