{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/12/07/gse-takes-a-trip-down-science-street/",
    "title": "GSE takes a trip down Science Street",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Collaborating & Networking"
    ],
    "pub_date": "2023-12-07T16:11:50+00:00",
    "content": [
        {
            "text": "On November 8, the Government Science and Engineering (GSE) Profession was invited to attend a ‘science street’ lunchtime event at the Health and Safety Executive’s (HSE) Buxton Laboratory. The health and safety lab is set on a 550-acre site and is home to an impressive directory of laboratory and large-scale testing facilities, set within the rolling hills of Derbyshire."
        },
        {
            "text": "The event – taking place during an extended lunchtime slot – had 35 stallholders, many of whom were science, engineering and analysis experts working at HSE who took the opportunity to do a ‘show and tell’ of their current work. It was great to see government science and engineering on the ground level, and the diversity of expertise on show at just one location, within one department."
        },
        {
            "text": "The GSE Profession had a chance to meet and speak with deep specialists and specialist colleagues (learn more about the GSE job families here) and signpost areas of the GSE offer to meet their needs, such as the STEM Futures scheme. The team also covered opportunities for those that were interested in becoming more involved in the profession through becoming L&D champions within their department or joining the Diversity and Inclusion Action Group (DIAG)."
        },
        {
            "text": "Also in attendance were Sarah Newton, Chair of the HSE Board, and HSE’s Chief Scientific Adviser Andrew Curran, who visited all the stalls and spent some time on the GSE stall hearing about what the profession can offer to colleagues working in their department."
        },
        {
            "text": "After the event, Vicky Warbrick, one of the event organisers and GSE member, said: “The science street event created a great buzz and generated lots of conversations around the various stalls. It was an opportunity to share the science, engineering and analysis knowledge we generate across our organisation in an informal way. These events are the perfect way to bring our GSE professionals together, helping them make new connections, broaden their understanding of what research is happening across HSE and giving them an opportunity to hone their science communication skills.” "
        },
        {
            "text": "Are you thinking of organising your own departmental event? Holding events like science street is a great way to bring your colleagues together to communicate the work that they do, find opportunities to collaborate with others and invite external guests to build connections for the future."
        },
        {
            "text": "The GSE Profession are always looking to support our members, so please let us know what you’re planning by contacting gse@go-science.gov.uk."
        }
    ]
}