{
    "url": "https://charitycommission.blog.gov.uk/2023/12/07/opening-the-doors-to-charity-trusteeship/",
    "title": "Opening the doors to charity trusteeship",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Trustees"
    ],
    "pub_date": "2023-12-07T10:37:32+00:00",
    "content": [
        {
            "text": "During Trustees Week, I hosted a roundtable for some of the charity sector’s younger trustees. The Commission is keen to demystify trusteeship, enabling more people to get involved and give back to society – and the roundtable was a great opportunity to hear from those who are currently doing the role and to learn from their experiences to help inform what more we can do as the regulator to grow the number of those volunteering at every age."
        },
        {
            "text": "The passion, skill and experience people bring to trusteeship determines not just the success of individual charities but contributes in great part to the health of our communities and the cohesion of society."
        },
        {
            "text": "Making time for trusteeship can be a life-enhancing experience and, at the Commission, we want a wider group to benefit from everything trusteeship has to offer, including younger people."
        },
        {
            "heading": 2,
            "text": "Open to all "
        },
        {
            "text": "Trusteeship is open to everyone. Being a trustee is rewarding as well as challenging - sometimes delightful, sometimes hard work, requiring energy and imagination in the here and now –– and is also, always, an investment in the future."
        },
        {
            "text": "And it brings benefits for individuals too. The trustees I met at the roundtable described how being a trustee had improved their personal well-being, helped them develop a range of skills and is helping their career development. While they all had a slightly different take on trusteeship, the one thing they all had in common was that it had brought something positive to their lives. These attitudes, I’m pleased to say, are shared across our entire trustee community."
        },
        {
            "heading": 2,
            "text": "Driving change "
        },
        {
            "text": "We know younger generations are keen to enact change - and what better and more effective way to do so than from the inside. The core purpose of charities is to improve people’s lives. Be it through environmental action, tangible health and social care services or improving the accessibility of sport, the arts and culture. Being on a charity board means you’re guiding the ship, you are helping to make decisions about what the charity does and overseeing the way it is done. There are very few opportunities in the world like this, that are open to so many."
        },
        {
            "text": "While we’re keen for more younger people to explore trusteeship, people of all ages have something to contribute to a charity’s governance. We know a board that’s more varied in background, skills and experience is more diverse in its thinking. A leadership team – whether executive or non-executive - that can scrutinise and evaluate a problem or opportunity from a variety of perspectives is likely to be more effective than one that’s governed by people who all come from the same walk of life."
        },
        {
            "text": "We’re aware that work still needs to be done to open the doors to trusteeship. One of the common misconceptions, and something I again heard last week, was that trusteeship ‘isn’t for people like me’. As one trustee said, ‘you can’t be, what you can’t see’."
        },
        {
            "text": "Recommendations your organisation can consider to help tackle this could include:"
        },
        {
            "text": "I’m pleased to say we will be reviewing our Finding new trustees guidance next year. This will support charities to recruit to their boards."
        },
        {
            "text": "While there is still work to be done, there is so much to celebrate about the sector and those who lead it. But the discussion left me feeling optimistic and hopeful for the future. The sector is already in the safe hands of current trustees and I hope many more will make the decision to join them soon."
        }
    ]
}