{
    "url": "https://hmlandregistry.blog.gov.uk/2023/12/07/showcasing-hm-land-registrys-welsh-language-services/",
    "title": "Showcasing HM Land Registry’s Welsh language services",
    "authors": [
        "Eleri Sparnon Jones, Head of the Welsh Language Services"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2023-12-07T09:30:38+00:00",
    "content": [
        {
            "text": "Today (7 December) is Welsh Language Rights Day, an event organised by the Welsh Language Commissioner that gives organisations such as us an opportunity to promote our Welsh language services.  "
        },
        {
            "text": "The theme of this year’s campaign is ‘Defnyddia dy Gymraeg’ or ‘Use your Welsh’. If you’re a Welsh speaker or learner, go ahead and use your Welsh with us! "
        },
        {
            "text": "HM Land Registry’s Welsh Language Scheme ensures we treat the English and Welsh languages equally. We are committed to making sure solicitors and members of the public can communicate with us in Welsh, if they choose to. "
        },
        {
            "heading": 2,
            "text": "Welsh language team"
        },
        {
            "text": "We have a dedicated team of caseworkers who are fluent in Welsh and who welcome correspondence and applications submitted in the language.  "
        },
        {
            "text": "Applications or correspondence in Welsh can be emailed directly to our Welsh language team at: GwasanaethCymraeg@landregistry.gov.uk   "
        },
        {
            "text": "Here’s a short video about the service offered by our Welsh language team."
        },
        {
            "heading": 2,
            "text": "Dual language registers "
        },
        {
            "text": "The register template of every title in Wales is produced in bilingual format. The headings and standard information appear in English and Welsh, and the register entries appear in the language of the document on which they are based.  "
        },
        {
            "heading": 2,
            "text": "Services"
        },
        {
            "text": "The following services on GOV.UK are available in Welsh:  "
        },
        {
            "text": "Search for land and property information "
        },
        {
            "text": "Search for local land charges on land and property "
        },
        {
            "text": "UK House Price Index  "
        },
        {
            "text": "We have a Welsh language line for general enquiries: 0300 006 0422.  Anyone who receives correspondence or notices in English can request a version in Welsh if they prefer. "
        },
        {
            "text": "A Welsh version of LLC Maintain, which enables local and other authorities to register new local land charges and amend existing charges in our register, is also available. "
        },
        {
            "heading": 2,
            "text": "Publications "
        },
        {
            "text": "Many of HM Land Registry’s pages on GOV.UK are available in Welsh. They include: "
        },
        {
            "text": "HM Land Registry statutory forms "
        },
        {
            "text": "HM Land Registry practice guides "
        },
        {
            "text": "Information about HM Land Registry fees "
        },
        {
            "text": "Monthly UK House Price Index reports "
        },
        {
            "text": "Information on the Local Land Charges Programme "
        },
        {
            "text": "Our HM Land Registry glossary of legal terms has been useful to solicitors and members of the public who correspond with us in Welsh.  "
        },
        {
            "text": "You can view other GOV.UK pages available in Welsh by selecting the ‘Cymraeg’ tab located in the top right-hand corner of the page. "
        },
        {
            "heading": 2,
            "text": "Digital services "
        },
        {
            "text": "Our aim is to continue to further the commitments in our Welsh Language Scheme to ensure our services take account of Welsh-language requirements where appropriate.   "
        },
        {
            "heading": 2,
            "text": "Promoting our Welsh language services"
        },
        {
            "text": "Providing services in Welsh is important, but Welsh speakers need to use them to demonstrate their value.  "
        },
        {
            "text": "You can help spread the word by informing your colleagues and clients of these services and encouraging their use.   "
        },
        {
            "text": "More information about HM Land Registry’s Welsh language services is available on GOV.UK."
        }
    ]
}