{
    "url": "https://gott.blog.gov.uk/2023/12/07/top-tips-on-setting-up-a-knowledge-asset-management-strategy/",
    "title": "Top tips on setting up a Knowledge Asset Management Strategy",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "GOTT conference",
        "Intellectual Property",
        "Knowledge Asset Management",
        "Knowledge Asset Management Strategy"
    ],
    "pub_date": "2023-12-07T07:45:14+00:00",
    "content": [
        {
            "text": "Author: Rachel Egan, Deputy Director, GOTT"
        },
        {
            "text": "Last week, leaders and innovators from across the public sector gathered to discuss how we can unlock the potential of our Knowledge Assets (KAs). I chaired a panel that included Lucy Caffery from National Physical Laboratory (NPL), Ian Cameron from Met Office, and Tony Soteriou from UK Research and Innovation to talk about how a Knowledge Asset Management Strategy (KAMS) can help organisations manage their KAs better."
        },
        {
            "text": "Each of the panellists highlighted the different approach their organisation has taken to developing and implementing their KAMS, along with some advice on how to get started."
        },
        {
            "heading": 2,
            "text": "A made to measure approach at NPL"
        },
        {
            "text": "At the UK’s national metrology institute, research and innovation is fundamental to the organisation. But when it came to identifying and realising the wider potential benefits of the outputs of this work, there was limited guidance, best practice, and strategy."
        },
        {
            "text": "A small team looking to transform the culture in NPL took on this work and started by identifying the key strengths they had to work with: the early-adopter colleagues who saw the value in exploiting KAs; the wealth of NPL’s KAs; and an understanding of the behaviours they wanted to see more of."
        },
        {
            "text": "Lucy explained how her NPL colleagues built individual success stories, using these to gain wider buy-in with teams and leadership. As part of their work, they developed and implemented policies, procedures, and a coherent strategy, specifically considering the behaviours that existed and that they wanted to shape."
        },
        {
            "text": "Lucy identified the Rose Book and other GOTT-developed tools as valuable sources for benchmarking and informing continuous improvement."
        },
        {
            "text": "A weather eye at the Met Office"
        },
        {
            "text": "Ian highlighted the importance of identifying and gaining the support of influencers in an organisation as key to developing a KAMs. For example, Penny Endersby’s (Met Office CEO) advocacy resulted in Ian’s personal objectives including one on implementing strategic KA management- giving Ian the green light to start this work."
        },
        {
            "text": "Similarly to NPL, working with colleagues across the organisation to create buy-in and change behaviours and procedures has been critical. At the Met Office, this included making a clear case for how managing and exploiting valuable KAs delivers personal and organisational objectives."
        },
        {
            "text": "Putting the ‘You’ in UKRI"
        },
        {
            "text": "UKRI brings together numerous organisations including Innovate UK, research councils and Research England, each with their own context and capabilities. Therefore, a KAMs for the centre required close collaboration with each of these partners and taking their individual approaches into consideration. Tony described how it also had to speak to a diverse audience of 8,000 colleagues, half of whom work in research and the other half in managing grants, corporate, and administration."
        },
        {
            "text": "By working closely with those who would be needed to make implementation successful, and taking a high level approach to their central strategy, the Met Office developed a KAMS which was recently endorsed by UKRI’s Executive Committee – a good indicator of senior-buy in."
        },
        {
            "text": "Resources for developing your own KAMS"
        },
        {
            "text": "As set out in Managing Public Money (MPM) and the Rose Book, all public sector organisations headed by an Accounting Officer who is responsible for upholding MPM should develop a KAMS, overseen by a Senior Responsible Owner. Support and guidance is available online and from the Government Office for Technology Transfer."
        },
        {
            "text": "Or get in touch with the team."
        }
    ]
}