{
    "url": "https://moderncivilservice.blog.gov.uk/2023/11/23/a-skilled-civil-service-the-policy-profession/",
    "title": "A Skilled Civil Service: the Policy Profession",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2023-11-23T09:41:15+00:00",
    "content": [
        {
            "heading": 6,
            "text": "A guest blog by Toyin Owolabi, Policy Profession HR Business Partner"
        },
        {
            "text": "Civil Service policy professionals live and work in locations all across the UK. Some are based in cities, others in more rural areas. Regardless of location, they live alongside and interact daily with people whose lives will be impacted by government policies: education, health, security, business, transport - you name it."
        },
        {
            "text": "My team has been working with grassroots leaders to create and develop communities of policy professionals outside of London and across the country. Our ambition is to create and promote policy careers across the UK, utilising the skills and talents of those with lived experiences who better understand the local cultures. It is a journey, one that we are progressing on slowly but surely."
        },
        {
            "heading": 2,
            "text": "Where are policy professionals based?"
        },
        {
            "text": "Just over 33,000 civil servants identify as policy makers, and together they make up the Policy Profession. About 40% of the profession are based outside London and this number is increasing steadily.  My team in the government’s central Policy Profession Unit is responsible for regional policy programmes to promote policy career pathways outside of London and to better connect policy makers, to build capability and create a more diverse culture. "
        },
        {
            "text": "We started the regional policy programme with a pilot in the North West of England, in partnership with what was previously Civil Service Local. The event covered apprenticeships and other entry programmes into the profession, with a spotlight on the North West and interactive challenges to help dispel myths about policy making. "
        },
        {
            "text": "Since the successful pilot, the Policy Profession has established policy networks and programmes in the North East, Yorkshire and the Humber, and more recently in the South West. The policy regional programme builds on the opportunity that existing government hubs provide to encourage thriving communities of cross-government policy professionals to readily share data and insights from engaging with local communities. "
        },
        {
            "text": "As well as forming a policy network, each region prioritises their immediate needs. These can range from building a pipeline of local talents into the profession and the Civil Service, to holding policy roundtable discussions with local authorities and institutions.  For example, the North East programme is looking at running a pilot cross-government red teaming exercise with a view to having regular red teaming opportunities. In Sheffield, roundtable discussions between policy professionals and local organisations include commitments on sharing data, growing and retaining local talents and achieving the city strategy."
        },
        {
            "text": "At this year’s 2023 Policy Festival, policy network leads and senior sponsors from across the North and Yorkshire ran a joint panel session. They discussed their experiences of a full and rich career policy outside London without needing to move, and how the regional networks support the development of capability and careers in policy communities locally. This event is not just for existing policy makers but also for those looking to join the profession, which you can do so by signing up to the Policy Profession Network."
        },
        {
            "heading": 2,
            "text": "The Policy Profession is open to different skills"
        },
        {
            "text": "During a showcase event in the North West which targeted non-policy professionals, we ran sessions on mentoring and coaching, support with job applications, how to get involved with job shadowing and, most importantly, what policy making in the Civil Service looks like. "
        },
        {
            "text": "This was followed by a cross-department policy induction event in Wolverhampton where we were joined by Elizabeth Thomas, Policy Adviser at the Department for Levelling Up, Housing and Communities. She confessed that she was convinced she did not have any transferable skills that related to policy prior to the showcase. However, she successfully moved from an operational delivery post into her first policy role after the event. This was partly thanks to discovering the Policy Profession Network, which helped Elizabeth identify that the portable skills developed in her operational delivery role. The showcase was resounding proof that the power of networking, connecting and continuous learning is key to building a Skilled Civil Service."
        },
        {
            "heading": 2,
            "text": "Better connections for better policy making"
        },
        {
            "text": "Learning is continuous and although classroom-style learning is important, it is not the only way. Connecting with and learning from one another increases the synergy between work and learning and improves overall performance. It is knowledge, practical sharing and group mentoring rolled into one. No civil servant should feel isolated because of their location. The Policy Profession’s Policy Festival is our annual event that brings together policy colleagues from across government, to share perspectives and learn from each other as well as make new connections. "
        },
        {
            "text": "This year’s event covered nine days of online and regional sessions, attracting policy makers, academics, former ministers and experts from various fields to look at pressing national and global challenges. Participants were also able to gain credits for Continuous Professional Development as part of an ongoing process of supporting individuals to frequently improve skills, knowledge and career prospects."
        },
        {
            "heading": 2,
            "text": "We can make great policy in the regions"
        },
        {
            "text": "We all know that good policy is evidence-based. Diversity of thought, background and experience around the table where policies and decisions are made is also crucial. The regional policy programme, enabling more policy and decision making outside of London, is part of our strategy for building A Modern Civil Service, supporting the five key missions for reform—especially Capability, Place and Delivery. "
        },
        {
            "text": "So, if you’re a civil servant and want to join the Policy Profession Network in your region, please provide your details."
        }
    ]
}