{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/11/23/a-solution-focused-approach-to-social-work-to-support-interventions/",
    "title": "A Solution Focused approach to social work supporting interventions",
    "authors": [
        "Luke Goldie-McSorley"
    ],
    "categories": [
        "Social work: the profession"
    ],
    "pub_date": "2023-11-23T08:00:56+00:00",
    "content": [
        {
            "text": "Luke Goldie-McSorley, Practice Supervisor for the DBIT Service and Essex Solution Focused Centre, tells us about his experience working with a Solution Focussed approach and the difference it makes to working with families. "
        },
        {
            "text": "Social work is a profession supporting change for people and families who are vulnerable and facing challenges in life. I think at the heart of all social workers, managers, support workers, foster carers, etc, is a hopefulness and a desire to affect change."
        },
        {
            "text": "As social work has advanced, though, I wonder if the intervention aspect has been pushed down the priority list behind other tasks and duties, like workloads, recording, assessment, report writing, other statutory responsibilities."
        },
        {
            "text": "With Solution Focused Practice, social work becomes more about intervening again."
        },
        {
            "text": "Solution Focused Practice "
        },
        {
            "text": "So, what is Solution Focused Practice? This practice uses language, questions, and a stance which allows the people we talk with to reclaim their power, their strengths, their resources, and their change. It’s because of these reasons that I believe Solution Focused Practice can also help us reconnect with social work’s identity and roots as interventionists."
        },
        {
            "text": "Imagine your first meeting with a social worker involves the question, “what do you hope for from our involvement with you and your family?”"
        },
        {
            "text": "What if your review meeting started with, “what have you been proud of since we last met?”"
        },
        {
            "text": "What if in crisis your social worker asked you, “what does it say about you as a person that you’ve been able to keep going in this incredibly tough time?”"
        },
        {
            "text": "Imagine being a parent who at the end of a conversation says, “I hadn’t realised how much I had done and achieved until I heard myself say all these things out loud”."
        },
        {
            "text": "Now add in that structured talking, creating a situation in practice where we can continually step into conversations with people, ask questions which invite thought towards change, support people in their darkest moments and create safety in situations of risk. In my experience, social work needs to move away from referring on and instead get on with intervening with those with whom we have already built relationships."
        },
        {
            "text": "Proven results "
        },
        {
            "text": "Solution Focused Practice has proven to be both a powerful and empowering vehicle for achieving outcomes for those with whom we work, and in promoting confidence, wellbeing, and perhaps most importantly, hope. I have found that consistently applying a Solution Focused approach is impactful in co-creating change with families and leads to relationships improving - so many children are able to remain with their families. Their emotional wellbeing improves, hope for a future is regained, a trust in services returns and people can make the changes they want in their lives and ultimately no longer require social work involvement."
        },
        {
            "text": "We recently spoke with a parent who had seen a positive change within her family as a result of taking a Solution Focused approach. She said: “We’ve seen my son grow as a person over the months and he often says ‘I’m in a different place now mum’ which is great.”"
        },
        {
            "text": "My team and I have found Solution Focused social work practice to be very adaptable; it allows for long, regular, consistent pieces of sessional work as well as small moments in a phone call, text message, short visit or crisis. It’s impactful and collaborative. It’s accessible to all practitioners and also to the vast majority of people we support."
        },
        {
            "text": "The Essex Solution Focused Centre offer training in the Solution Focused approach from within children’s social care, to anyone looking to make a difference in people’s lives. "
        },
        {
            "text": "To find out more about the full catalogue of training available, please get in touch: Essex.SolutionFocusedCentre@essex.gov.uk"
        }
    ]
}