{
    "url": "https://educationhub.blog.gov.uk/2023/11/autumn-statement-2023-what-does-it-mean-for-apprenticeships/",
    "title": "Autumn Statement 2023: what does it mean for apprenticeships?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-11-23T12:26:30+00:00",
    "content": [
        {
            "text": "The Chancellor Jeremy Hunt outlined the latest plans for the British economy in the 2023 Autumn Statement on 22 November."
        },
        {
            "text": "You can read more about this year’s autumn statement here."
        },
        {
            "text": "The Chancellor focused on economic growth, making it clear that building a world-class education and skills system is key to that."
        },
        {
            "text": "Here’s what you need to know about what that means for apprenticeships."
        },
        {
            "heading": 3,
            "text": "What was announced for apprenticeships in the Autumn Statement?"
        },
        {
            "text": "To boost apprenticeship training in sectors which contribute to economic growth, like engineering and manufacturing, the government is investing £50 million in a two-year pilot, starting in Spring 2024."
        },
        {
            "text": "There are already more than 680 high quality apprenticeships in a wide range of roles. This includes degree apprenticeships in nursing, engineering, law, and science."
        },
        {
            "text": "The first ever NHS doctor apprenticeship will also start from September 2024, and we recently announced a brand-new degree apprenticeship in space systems engineering, also launching next year."
        },
        {
            "heading": 3,
            "text": "What is the apprenticeships growth pilot?"
        },
        {
            "text": "The £50 million extra funding will be used to create more opportunities for training and break down the barriers which might prevent some employers from offering high quality apprenticeships, such as the high costs of equipment and training facilities."
        },
        {
            "heading": 3,
            "text": "How much do apprentices earn?"
        },
        {
            "text": "The apprenticeship minimum wage will rise by 21.2% from 1 April 2024 to £6.40 an hour, with a cash increase of £1.12 per hour."
        },
        {
            "text": "The vast majority of employers already pay more than this – the average hourly pay for apprentices ranges between £8.23 for Level 2 and £14.02 for Level 6."
        },
        {
            "heading": 3,
            "text": "How will these changes create more opportunities for people?"
        },
        {
            "text": "An estimated 40,000 apprentices will benefit from the apprenticeship minimum wage increasing. Better pay will allow more people to start or finish an apprenticeship."
        },
        {
            "text": "Find out more about how we’re widening access to apprenticeships here."
        }
    ]
}