{
    "url": "https://civilservice.blog.gov.uk/2023/11/23/carers-day-2023/",
    "title": "Carers' Rights Day 2023",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary",
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-11-23T09:16:52+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Alex Chisholm and Rebecca Sudworth, Civil Service Permanent Secretary Lead and Deputy Lead for Carers, acknowledge the contribution of all our civil servant carers."
        },
        {
            "text": "Today is Carers’ Rights Day which provides a welcome opportunity to recognise the contribution of our carers."
        },
        {
            "text": "Around a fifth of civil servants are carers. Caring comes in many forms, for example taking care of elderly relatives, or neighbours who need support, or children with disabilities. Caring is not easy but it is often incredibly rewarding and it hones a myriad of skills which are invaluable in the workplace such as patience, empathy and understanding."
        },
        {
            "text": "Such skills are vital to good management and forging strong relationships with colleagues and customers. The benefits of a diverse workforce are well documented in the wider economy, in the civil service diversity in experience and skills can inform policy development and ensure better public services."
        },
        {
            "text": "We value the work of our carers and strive to support them as much as possible. The civil service does this through the carer’s passport and our line manager toolkit as well as other measures such as special leave."
        },
        {
            "heading": 4,
            "text": "Carer Confident"
        },
        {
            "text": "The support provided by departments is recognised through the ‘Carer Confident’ accreditation. It is great to see an increased number of civil servant organisations gaining this accreditation. The Intellectual Property Office gained Level 3 accreditation in June, the highest level of Carer Confident recognition. Further, HM Treasury has achieved Level 2 status alongside the Department for Transport, the Crown Prosecution Service and the Cabinet Office. Congratulations to all departments which have achieved this recognition, it is important for more organisations to seek accreditation to ensure the workplace is as inclusive as possible."
        },
        {
            "heading": 4,
            "text": "Being a carer"
        },
        {
            "text": "Anyone can take on careering responsibilities at any point in their working lives. Thank you to Steve Perry who works in the Cabinet Office for sharing his caring journey."
        },
        {
            "heading": 3,
            "text": "“I didn't know where to go for support and had little time to research help” "
        },
        {
            "text": "In 2019, Steve Perry became a carer for his mother"
        },
        {
            "text": "I unexpectedly became a carer for my mother as she was no longer able to live independently, I quickly became immersed in the world of state benefits and also having to deal with the NHS, social services and my solicitor. Having never been in this position, I didn't know where to go for support and had little time to research what help was available. To compound things, my pride and misplaced desire for 'home life' privacy delayed me from making my colleagues aware of my caring responsibilities."
        },
        {
            "text": "As soon as my line manager knew, she signposted me to the help I needed and began a comprehensive programme of support. My experience of reaching out and receiving support was a relief. It was straightforward, positive and beneficial to my wellbeing and productivity."
        },
        {
            "text": "My department, the Cabinet Office, recognises the importance of providing a supportive workplace for employees who are carers. This enables us to undertake our caring responsibilities while at the same time feeling included, engaged and productive in the work we do."
        },
        {
            "text": "Please check out the support available in your organisation. The Carer's Passport was fundamental in discussing my caring needs with my line manager. Together we identified and recorded agreed solutions. This enabled me to match and flex my caring needs as my responsibilities changed and meet my work objectives too."
        },
        {
            "text": "Also check if your organisation has a Carers’ Network where you will be able to meet other carers and share issues and information."
        }
    ]
}