{
    "url": "https://dvladigital.blog.gov.uk/2023/11/23/introducing-the-driver-and-vehicles-account/",
    "title": "Introducing the Driver and vehicles account",
    "authors": [
        "Rebecca Naylor"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2023-11-23T12:36:03+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Earlier this year, we launched the Driver and vehicles account, a new way for motorists to view their driving licence and vehicle details in one place. There is also the option to choose to receive vehicle tax reminders by text or email. This development is a huge milestone for DVLA and motorists as we continue to evolve our digital services for the benefit of our customers."
        },
        {
            "text": "In this blog, we share how easy it is to set up an account, and why you should do it!"
        },
        {
            "text": "How to set up your Driver and vehicles account"
        },
        {
            "text": "It only takes 5 minutes to complete, simply:"
        },
        {
            "text": "What you can do with a Driver and vehicles account"
        },
        {
            "text": "Created an account and logged in? You’ll now be able to:"
        },
        {
            "text": "Continuing to evolve the account"
        },
        {
            "text": "We’re continuing to add additional services within the account. Since launch, we’ve made it possible for professional drivers to view their CPC and tachograph driver card details within their account."
        },
        {
            "text": "And we’re not stopping there! When it comes to renewing your driving licence every 10 years, the Driver and vehicles account will enable you to upload your own driving licence photo, instead of having to use your passport photo."
        },
        {
            "text": "If you’re applying for a first provisional driving licence, you’ll also be able to do this through your Driver and vehicles account in the coming months."
        },
        {
            "text": "56,000 accounts – and counting!"
        },
        {
            "text": "We’ve had more than 56,000 customers set up an account since it was launched in August 2023. Motorists are already taking advantage of the 24 hour online service and accessing their driving and vehicle details in one place. So don’t miss out!"
        },
        {
            "text": "To help us continue developing the new service, we want to hear your feedback – if you have anything you would like to share with us about your experience, please fill in the satisfaction survey upon setting up your account."
        },
        {
            "text": "For future updates, keep an eye on our social media channels and sign up to our email alerts. You can also subscribe to this blog channel for all the latest updates."
        }
    ]
}