{
    "url": "https://food.blog.gov.uk/2023/11/23/understanding-antimicrobial-resistance-in-foodborne-pathogens/",
    "title": "Understanding antimicrobial resistance in foodborne pathogens",
    "authors": [
        "Dr. Erica Kintz, Senior Microbiological Risk Assessor",
        "Dr. Kathyrn Callaghan, Microbiological Risk Assessment Team Leader"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-11-23T09:49:47+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Our IID3 project will include an assessment of antimicrobial resistance (AMR) in bacterial pathogens; the first IID project to do so. A better understanding of AMR in foodborne pathogens will support our contribution to the UK’s AMR National Action Plan."
        },
        {
            "text": "Some bacteria that cause food poisoning are antimicrobial resistant (AMR). This means that antibiotics are ineffective, and infections are difficult or impossible to treat. Addressing the challenge of AMR and strengthening our knowledge about its implications, the bacteria that are most resistant and the antibiotics that they are resistant to, is crucial. If left unchecked, the increase of AMR could lead to the risk of disease being spread. Through projects such as IID3, we are able to learn more about AMR in foodborne pathogens with the aim of supporting work to prevent the spread."
        },
        {
            "heading": 2,
            "text": "What is AMR?"
        },
        {
            "text": "AMR has been identified as one of the most pressing global challenges we face this century. The World Health Organisation (WHO) has declared AMR as one of the top 10 global public health threats."
        },
        {
            "text": "AMR occurs when the organisms that cause infection evolve ways to survive treatments."
        },
        {
            "text": "Much of modern medicine - for example, organ transplantation and cancer chemotherapy - relies on antibiotics to prevent and treat infections that can follow treatment. AMR can delay that treatment, rendering patients infectious for longer times and increasing the risk of spreading resistant microorganisms to others. But what does this have to do with food?"
        },
        {
            "heading": 2,
            "text": "AMR bacteria in the food chain"
        },
        {
            "text": "Animals, like people, carry bacteria in their guts. This includes AMR bacteria, which can get in food in several ways:"
        },
        {
            "text": "People can get intestinal infections, including AMR infections, by handling or eating contaminated food, handling raw pet food, or coming in contact with untreated or uncomposted animal faeces. People can come in contact with animal faeces either through direct contact with animals and animal environments or through contaminated drinking or swimming water. Infections can also spread between people."
        },
        {
            "heading": 2,
            "text": "What can we do to reduce foodborne AMR?"
        },
        {
            "text": "We can track AMR infections and study how resistance emerges and spreads. Detecting and investigating outbreaks of AMR infections enables us to identify their sources and stop their spread. Fully integrated surveillance initiatives are crucial to understanding and mitigating the risk of AMR. Our shared need for knowledge gaps to be filled include transmission from people to animals as well as animals to people, both direct and through the environment."
        },
        {
            "text": "The PATH-SAFE programme has made some large advances in this area, and the National Biosurveillance Network initiative has the potential to build on that as we embed cross-disciplinary working to better understand and mitigate AMR risks."
        },
        {
            "text": "If we can find the sources of AMR infections that are commonly spread through food and animals, we can prevent onward transmission by promoting safe food handling and safe contact with animals. The risk of acquiring AMR-related infections through contaminated food is very low, provided that good hygiene and cooking practices are followed. Thorough cooking (and pasteurisation) will destroy bacteria present on food including those that are AMR. The UK Government promotes the 4C principles (proper cooking, chilling, cleaning and avoiding cross-contamination) in its food hygiene messaging to both industry and consumers."
        },
        {
            "text": "We can also make sure veterinarians, livestock and poultry producers, and other animal industries such as aquaculture have tools, information, and training around the appropriate use of antibiotic and antifungal drugs. Alongside reducing overall use of antibiotics, vets and the agriculture sectors are trained to ensure that highest priority critically important antibiotics for humans are protected."
        },
        {
            "text": "AMR is a national strategic priority for the UK Government which led to the development of the 20-year Vision for AMR and the 5-year National Action Plan (NAP), which runs until March 2024; NAP 2024-2029 is in development. The NAP lays out how the UK is addressing the AMR challenge, strengthening the ability of state and local health departments to detect, respond to, and report antimicrobial-resistant infections."
        },
        {
            "heading": 2,
            "text": "Tracking AMR bacteria that cause diarrhoea"
        },
        {
            "text": "The IID3 project will provide information to help us:"
        },
        {
            "heading": 2,
            "text": "How will we find the AMR bacteria?"
        },
        {
            "text": "We will use molecular diagnostic methods, like polymerase chain reaction (PCR) tests, to detect 21 different pathogens. IID3 will also include whole genome sequencing (WGS), allowing us to find out more information about these pathogens. WGS provides genomic information that can be used to identify the presence of AMR. We can also find out what antibiotics that bacteria are resistant to, investigate how the bacteria became resistant and if the AMR can be spread to other bacteria."
        },
        {
            "text": "Using genome information to explore AMR is still a new way of testing for AMR so we will also use traditional approaches to detect resistance. Culture methods involve measuring bacterial growth around paper discs or in broths containing antibiotics that have been inoculated with bacteria."
        },
        {
            "heading": 2,
            "text": "What have we found so far?"
        },
        {
            "text": "The IID3 project has recently completed a feasibility study to test the electronic systems developed by the research team. Seven faeces samples from GP patients were tested during this pilot phase, and three samples were positive for three different types of AMR E. coli known to cause diarrhoea."
        },
        {
            "text": "The main study data collection period began on 1 September 2023 and will run for two years. The data set and final report for the project are expected by 2027. During the study, you can stay updated on GP recruitment and sample analysis by visiting the IID3 Dashboard."
        },
        {
            "heading": 1,
            "text": "Deall ymwrthedd gwrthficrobaidd (AMR) mewn pathogenau a gludir gan fwyd"
        },
        {
            "text": "Bydd ein prosiect IID3 yn cynnwys asesiad o ymwrthedd gwrthficrobaidd (AMR) mewn pathogenau bacteriol; y prosiect IID cyntaf i wneud hynny. Bydd gwell dealltwriaeth o ymwrthedd gwrthficrobaidd mewn pathogenau a gludir gan fwyd yn cefnogi ein cyfraniad at Gynllun Gweithredu Cenedlaethol AMR y DU."
        },
        {
            "text": "Mae rhai bacteria sy’n achosi gwenwyn bwyd ag ymwrthedd i gyffuriau gwrthficrobaidd. Mae hyn yn golygu bod gwrthfiotigau yn aneffeithiol, ac mae heintiau’n anodd neu’n amhosib eu trin. Mae mynd i’r afael â heriau AMR a chryfhau ein gwybodaeth am y goblygiadau, y bacteria sydd fwyaf ymwrthol a’r gwrthfiotigau y maent yn ymwrthol iddynt, yn hollbwysig. Os na chaiff AMR ei wirio, gallai unrhyw gynnydd arwain at y risg o ledaenu’r clefyd. Trwy brosiectau fel IID3, rydym yn gallu dysgu mwy am AMR mewn pathogenau a gludir gan fwyd gyda’r nod o gefnogi gwaith i atal lledaenu."
        },
        {
            "heading": 2,
            "text": "Beth yw AMR?"
        },
        {
            "text": "Mae AMR wedi’i nodi fel un o’r heriau byd-eang mwyaf brys sy’n ein hwynebu yn y ganrif hon. Mae Sefydliad Iechyd y Byd (WHO) wedi datgan bod AMR yn un o’r 10 bygythiad mwyaf i iechyd cyhoeddus byd-eang."
        },
        {
            "text": "Mae AMR yn digwydd pan fydd yr organebau sy’n achosi haint yn datblygu ffyrdd o oroesi triniaethau."
        },
        {
            "text": "Mae llawer o feddygaeth fodern, fel trawsblannu organau a chemotherapi canser, yn dibynnu ar wrthfiotigau i atal a thrin heintiau posib ar ôl triniaeth. Gall AMR ohirio’r driniaeth honno, gan olygu bod cleifion yn heintus am gyfnod hirach, a chynyddu’r risg o ledaenu micro-organebau sy’n gwrthsefyll i eraill. Ond beth yw cysylltiad hyn â bwyd? https://www.england.nhs.uk/ourwork/prevention/antimicrobial-resistance-amr/"
        },
        {
            "heading": 2,
            "text": "Bacteria AMR yn y gadwyn fwyd"
        },
        {
            "text": "Mae anifeiliaid, fel pobl, yn cario bacteria yn eu perfedd. Mae hyn yn cynnwys bacteria AMR, a all fynd i mewn i fwyd mewn sawl ffordd:"
        },
        {
            "text": "Gall pobl gael heintiau perfeddol, gan gynnwys heintiau AMR, trwy drin neu fwyta bwyd wedi’i halogi, neu ddod i gysylltiad ag ysgarthion anifeiliaid heb eu trin neu heb eu compostio. Gall pobl ddod i gysylltiad ag ysgarthion anifeiliaid naill ai drwy gysylltiad uniongyrchol ag anifeiliaid ac amgylcheddau anifeiliaid neu drwy nofio mewn dŵr halogedig, neu ei yfed. Gall heintiau ledaenu rhwng pobl hefyd."
        },
        {
            "heading": 2,
            "text": "Beth allwn ni ei wneud i leihau AMR a gludir gan fwyd?"
        },
        {
            "text": "Gallwn olrhain heintiau AMR ac astudio sut mae ymwrthedd yn dechrau ac yn lledaenu. Mae canfod ac ymchwilio i achosion o heintiau AMR yn ein galluogi i nodi eu tarddiad ac atal eu lledaeniad. Mae mentrau gwyliadwriaeth cwbl integredig yn hanfodol i ddeall a lliniaru risg AMR. Mae bylchau yn yr wybodaeth y mae angen eu llenwi, gan gynnwys dulliau trosglwyddo o bobl i anifeiliaid yn ogystal ag anifeiliaid i bobl, yn uniongyrchol a thrwy’r amgylchedd. Mae’r rhaglen PATH-SAFE wedi gwneud rhai datblygiadau mawr yn y maes hwn, ac mae gan fenter y Rhwydwaith Bio-wyliadwriaeth Cenedlaethol y potensial i adeiladu ar hynny wrth i ni ymgorffori gwaith trawsddisgyblaethol i ddeall a lliniaru risgiau AMR yn well."
        },
        {
            "text": "Os gallwn ddod o hyd i darddiad heintiau AMR sy’n lledaenu’n gyffredin trwy fwyd ac anifeiliaid, gallwn atal trosglwyddo pellach trwy hyrwyddo arferion trin bwyd diogel a chyswllt diogel ag anifeiliaid. Mae’r risg o gael heintiau sy’n gysylltiedig ag AMR trwy fwyd wedi’i halogi yn isel iawn os ydych yn dilyn arferion hylendid a choginio da.  Bydd coginio trylwyr (a phasteureiddio) yn lladd unrhyw facteria sy’n bresennol ar fwyd, gan gynnwys bacteria AMR. Mae Llywodraeth y DU yn hyrwyddo’r hanfodion hylendid bwyd (coginio’n drylwyr, oeri, glanhau ac atal croeshalogi) wrth gyfleu negeseuon hylendid bwyd i’r diwydiant ac i ddefnyddwyr."
        },
        {
            "text": "Gallwn hefyd sicrhau bod milfeddygon, cynhyrchwyr da byw a dofednod, a diwydiannau anifeiliaid eraill fel dyframaethu yn meddu ar offer, gwybodaeth a hyfforddiant ynghylch y defnydd priodol o gyffuriau gwrthfiotig a gwrthffyngaidd. Ochr yn ochr â lleihau’r defnydd cyffredinol o wrthfiotigau, mae milfeddygon a’r sectorau amaethyddiaeth yn cael eu hyfforddi i sicrhau bod gwrthfiotigau hollbwysig â’r flaenoriaeth uchaf i bobl yn cael eu hamddiffyn."
        },
        {
            "text": "Mae AMR yn flaenoriaeth strategol genedlaethol ar gyfer llywodraeth y DU a arweiniodd at ddatblygu’r Weledigaeth 20 Mlynedd ar gyfer AMR a’r Cynllun Gweithredu Cenedlaethol (NAP) 5 mlynedd, sy’n rhedeg tan fis Mawrth 2024. Mae NAP 2024-2029 yn cael ei ddatblygu ar hyn o bryd. Mae’r NAP yn nodi sut mae’r DU yn mynd i’r afael â her AMR, gan gryfhau gallu adrannau iechyd gwladol, a lleol, i ganfod ac ymateb i heintiau sydd ag ymwrthedd i gyffuriau gwrthficrobaidd, yn ogystal ag adrodd arnynt."
        },
        {
            "heading": 2,
            "text": "Olrhain bacteria AMR sy’n achosi dolur rhydd"
        },
        {
            "text": "Bydd y prosiect IID3 yn darparu gwybodaeth i’n helpu i:"
        },
        {
            "heading": 2,
            "text": "Sut byddwn yn dod o hyd i’r bacteria AMR?"
        },
        {
            "text": "Byddwn yn defnyddio dulliau diagnostig moleciwlaidd, fel profion adwaith cadwynol polymerasau (PCR), i ganfod 21 o bathogenau gwahanol. Bydd IID3 hefyd yn cynnwys dilyniannu genom cyfan (WGS), gan ganiatáu i ni gael mwy o wybodaeth am y pathogenau hyn. Mae WGS yn darparu gwybodaeth genomig y gellir ei defnyddio i nodi presenoldeb AMR. Gallwn hefyd ddarganfod pa wrthfiotigau y mae bacteria yn ymwrthol iddynt, ymchwilio sut y daeth y bacteria i wrthsefyll ac a all yr AMR ledaenu i facteria eraill. Mae defnyddio gwybodaeth genom i archwilio AMR yn dal i fod yn ffordd newydd o brofi AMR, felly byddwn hefyd yn defnyddio dulliau traddodiadol o ganfod ymwrthedd. Mae dulliau meithrin (culture) yn cynnwys mesur twf bacteriol o amgylch disgiau papur neu mewn hylifau sy’n cynnwys gwrthfiotigau sydd wedi’u brechu â bacteria."
        },
        {
            "heading": 2,
            "text": "Ein darganfyddiadau hyd yma"
        },
        {
            "text": "Yn ddiweddar, mae prosiect IID3 wedi cwblhau astudiaeth ddichonoldeb i brofi’r systemau electronig a ddatblygwyd gan y tîm ymchwil. Profwyd saith sampl o ysgarthion gan gleifion meddygon teulu yn ystod y cyfnod peilot hwn, ac roedd tri sampl yn bositif ar gyfer tri math gwahanol o AMR E. coli sy’n achosi dolur rhydd."
        },
        {
            "text": "Dechreuodd y prif gyfnod casglu data ar gyfer yr astudiaeth ar 1 Medi 2023 a bydd yn rhedeg am ddwy flynedd. Disgwylir set ddata a’r adroddiad terfynol ar gyfer y prosiect erbyn 2027. Yn ystod yr astudiaeth, gallwch gael yr wybodaeth ddiweddaraf am recriwtio meddygon teulu a dadansoddi samplau trwy ymweld â Dangosfwrdd IID3."
        }
    ]
}