{
    "url": "https://mhclgdigital.blog.gov.uk/2024/09/26/funding-service-why-combining-self-service-with-a-human-touch-works-best-for-grant-teams/",
    "title": "Funding Service: why combining self-service with a human touch works best for grant teams ",
    "authors": [
        "Ruth Keeling, Service Owner, Funding Service"
    ],
    "categories": [
        "Funding Service"
    ],
    "pub_date": "2024-09-26T10:27:04+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What we mean by guided self-service "
        },
        {
            "text": "In the world of designing and launching new funds, guided self-service will allow grant teams in MHCLG to pick up and re-use established patterns to support grant delivery with minimal input from the department’s Funding Service.  "
        },
        {
            "text": "Guided self-service is a desirable thing because it reduces the cost of delivering grants, by reducing the amount of bespoke design time per grant, while also ensuring all MHCLG grants meet best practice set out in places such as the Grants Functional Standard and the Service Standard. "
        },
        {
            "heading": 2,
            "text": "Examples of guided self-service "
        },
        {
            "text": "Some tangible examples of guided self-service include: "
        },
        {
            "heading": 2,
            "text": "Why we need self-service "
        },
        {
            "text": "Self-service will help improve the quality and efficiency of MHCLG grant delivery in a number of ways: "
        },
        {
            "heading": 3,
            "text": "Faster delivery "
        },
        {
            "text": "Grant teams often need to create and launch a new grant at pace. Self-service allows MHCLG to respond quickly to these needs, often working across multiple grants.  "
        },
        {
            "heading": 3,
            "text": "Familiarity "
        },
        {
            "text": "Offering established, reusable patterns means grant managers who are setting up multiple grants do not have to follow a different approach each time, speeding up things further. "
        },
        {
            "heading": 3,
            "text": "Removing wasted effort "
        },
        {
            "text": "Onboarding new grants onto the Funding Service has been characterised by prolonged iterations, often involving extensive back-and-forth communication between teams. Resource-intensive interactions, such as lengthy kickoff meetings, user-centered design presentations, and tool feature requests exacerbate inefficiencies. A self-service approach means we can strip out activities which do not add much value for the service or its users. "
        },
        {
            "heading": 3,
            "text": "Reuse "
        },
        {
            "text": "New grant teams can build on and reuse the work of previous grants, instead of having to reinvent the wheel themselves. "
        },
        {
            "heading": 3,
            "text": "Autonomy "
        },
        {
            "text": "Grant teams can interact with our service at a time most convenient to them.  "
        },
        {
            "heading": 3,
            "text": "Scalability "
        },
        {
            "text": "With a growing number of grants in the service pipeline, self-service will help us respond to increased demand in the most cost-efficient way.  "
        },
        {
            "heading": 3,
            "text": "A better user experience  "
        },
        {
            "text": "Overall, a quicker, more efficient service translates to a much better experience for our users. This is good for them and good for MHCLG’s reputation as a deliverer of £21 billion worth of grants per year. "
        },
        {
            "heading": 2,
            "text": "Why self-service needs to be ‘guided’ "
        },
        {
            "text": "Based on experience to date, we know that a 100% self-service approach is not desirable. "
        },
        {
            "text": "100% self-service would be less efficient as grant teams would need to create ‘brand new’ processes and questions, instead of re-using what has worked well before. "
        },
        {
            "text": "100% self-service would also lead to inconsistency. For MHCLG’s grant recipients and the service’s end users, it would mean a less consistent user experience when accessing different grants, including being asked for the same data in a slightly different way, or being asked to use multiple different IT systems to submit data depending on different grants. For MHCLG users, it would mean funding data has been collected inconsistently, making it difficult to combine data about multiple grants and inform decision making. "
        },
        {
            "heading": 2,
            "text": "Keeping an element of human touch "
        },
        {
            "text": "There will still be moments when the more resource-intensive human touch is needed to launch a new grant on the service.  "
        },
        {
            "text": "For example, most of a new grant application can be populated by the common questions in the service’s question bank, but there are 5 questions bespoke to this fund because it is the only grant concerned with counting caravans. This is when the Funding Service’s user-centred design team can help the grant team design this small bespoke element to ensure it still meets the expected service, grant and data standards. "
        },
        {
            "text": "Importantly, the user-centred design team will be available to help when they are needed, precisely because the majority of all grant teams’ needs are being met via the guided self-service offer. "
        },
        {
            "heading": 2,
            "text": "Get in touch "
        },
        {
            "text": "We’d love to hear from similar services in other organisations so we can share learning and collaborate. Leave a comment below or contact us at fundingservice@communities.gov.uk. If you are working in a funding service in another government department, join the #funding-services channel on the cross-government Slack. "
        }
    ]
}