{
    "url": "https://publicpolicydesign.blog.gov.uk/2024/09/26/how-can-we-design-greener-policies/",
    "title": "How can we design greener policies?",
    "authors": [
        "Becky Miller"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2024-09-26T12:00:00+01:00",
    "content": [
        {
            "text": "The climate and biodiversity emergency invites all of us to understand our role in addressing arguably one of the biggest challenges of our time. Last year, I was part of a small group of service designers in the Department for Environment, Food and Rural Affairs (Defra), who took up this challenge by drafting a set of ‘greener service principles’. "
        },
        {
            "text": "On 22 March this year, led by Ned Gartside from Defra and Harriet Pugh from TPX Impact, we hosted a hack day to test those principles in practice with other designers from across the public sector. You can read more about the planning and outputs from the Greener Services hack day on the Defra Digital blog, and explore the Greener Service Principles online."
        },
        {
            "text": "As part of the hack day, I gave a talk on how government can design greener policies. Policies can be understood as the design brief for services. They set the intended course of action to achieve an objective, so if we’re aiming for greener services, we must start by designing greener policies. In this blog post, I’ll summarise my talk based on my experience working as a service designer in the UK’s cross-government Policy Lab team before joining Defra, where I now work.  "
        },
        {
            "heading": 2,
            "text": "Mandating greener policies"
        },
        {
            "text": "The UK’s new government’s central mission is to grow our economy, and in Defra new Secretary of State Steve Reed has laid out five key priorities: to clean up our rivers, lakes and seas; create a roadmap to move Britain to a zero-waste economy; support farmers to boost our food security; ensure nature’s recovery; and protect communities from flooding."
        },
        {
            "text": "Delivery of the mission and priorities is supported by existing legislation and guidelines which hold government to account and support policymaking. In 2023, the UK Government published its Environmental principles policy statement, a set of guidelines for ministers and policymakers with similar aspirations to the greener service principles. They are underpinned by the Environment Act 2021, which made the UK the first government in the world to put its environmental targets into law. This legislation in turn supports delivery of the UK’s 25 Year Environment Plan (2018) and the Environment Improvement Plan (2023), which are reported on annually. A dashboard is also being developed to report on indicators describing environmental change in relation to the legislation."
        },
        {
            "text": "Above this, the UK was one of 197 countries attending the United Nations (UN) 28th Conference of the Parties (COP) last year. Each year at the COP, agreements on aspects of climate policy are adopted by countries attending, creating a shared starting point for national policymaking. The COP agreements are now enhanced by the UN’s recent Pact for the Future, adopted by 143 nations this month (including the UK), agreeing actions towards a safer, more peaceful, sustainable and inclusive world for future generations."
        },
        {
            "text": "Like the UK, other countries are also developing ways to make their national policy decisions accountable to environmental targets, sometimes drawing directly on wisdom and knowledge of indigenous cultures. In 2008, Ecuador became the first country in the world to add a new chapter to its constitution dedicated to the Andean philosophy of ‘Sumak Kawsay’ (harmonious living with oneself, others, and nature), and recognising ‘Pachamama’ (Mother Earth) as a legal entity. "
        },
        {
            "text": "However, the case of Ecuador also demonstrates the risk of colonising indigenous knowledge through climate and environmental legislation if government ends up cherry-picking and politicising indigenous knowledge for political ends, rather than assimilating the fundamental wisdom and principles it offers us."
        },
        {
            "text": "An example of contemporary environmental legislation reflecting indigenous cultures' wisdom without being directly linked to it is the Wellbeing of Future Generations Act 2015 in Wales. The Act explicitly permits all Welsh Government policies to improve the social, cultural, environmental and economic well-being of current and future generations and has its own independent Commissioner for Future Generations to ensure that work happens. The pioneering legislation took ten years of iterative development - listen to Jane Davidson explain the creation of the Act."
        },
        {
            "heading": 2,
            "text": "Participation as a precursor to good policy"
        },
        {
            "text": "Although legislation for environmental outcomes is an essential foundation, the methods we use to develop policies that deliver on the legislation are critical. Policy teams have learned that qualitative methods like user research and ethnography allow us to deeply understand the people we are designing for, and methods like systems thinking and futures thinking help us understand and design for complexity and different possible futures. "
        },
        {
            "text": "However, the scale and urgency of environmental issues, combined with the lack of ‘win-win’ solutions and current financial constraints, can only be resolved by genuinely opening up the policymaking process. This means going beyond the conventional consultation process, and trusting citizens by considering them as an integral part of our policymaking team. The recent Citizens’ White Paper published by Demos and Involve explains this in its opening chapter:"
        },
        {
            "text": "The good news is that European countries, including the UK adopted the UNECE agreement on this approach in 1998, and there are already tried and tested methods happening across the world that increase citizen participation in both national and local governments, including co-design, citizens’ assemblies, collective intelligence and legislative theatre. Indeed our Prime Minister, Sir Keir Starmer described the benefits to participants at the Camden Climate Crisis Citizens’ Assembly in 2019. Many of the innovative methods we already use - user research, ethnography, systems thinking, futures thinking - can be adapted and combined with more participatory methods to open them up to wider participation. For example Policy Lab’s project with Defra and the Welsh Government to co-design ideas for a new Fisheries Management Plan for Seabass with fishers."
        },
        {
            "text": "Trusting citizens with this more active role in policy design, beyond simply being the subject of research, facilitates more empathy both with government’s challenges and, importantly, empathy with other citizens who have different needs and perspectives. "
        },
        {
            "text": "Successful policy design and delivery needs to balance these different needs whilst being acceptable to everyone, and a more open, participatory policy design process can facilitate this. The big, complex policy issues we face today - including the climate crisis - impact each of us differently, so how we choose to design policy has the potential to either polarise communities or unite them. "
        },
        {
            "text": "Interestingly, the word ‘citizen’ comes from the Latin ‘civis’, meaning belonging to a community. In this way, could we start to understand our role as ‘civil servants’ as helping people discover their role as citizens and their contribution to our communities and democracy? "
        },
        {
            "heading": 2,
            "text": "Not everything government designs is a digital service"
        },
        {
            "text": "The last thought I shared at the Greener Services hack day - speaking to a room of service designers - was a reminder that not everything government designs is a digital service. "
        },
        {
            "text": "This might seem counterintuitive since digitising services can reduce emissions from physical interactions and touchpoints, such as buildings and travel emissions. But digital services have their own physical infrastructure and carbon footprint too. Vast amounts of energy are used to power data centres and manufacture digital devices, most of which is out of sight and therefore often overlooked."
        },
        {
            "text": "We need to remember that ‘greener’ services and optimising carbon emissions is still fundamentally about understanding human behaviour to help people achieve their goals and government achieve its outcomes. "
        },
        {
            "text": "Focusing disproportionately on delivering services through digital channels - however much we optimise carbon emissions - could be a false economy when delivering complex, high-value services rooted in the physical world. These are scenarios that Lou Downe describes in their book ‘Good Services’ (2020) that tend to benefit from human interaction. I’d also add that human interaction can be critical for building trust where trust is low to start with."
        },
        {
            "text": "These scenarios are increasingly true for services that are helping deliver policies intended to transition whole sectors of the economy to low carbon, regenerative futures. For example, in research with advisers who work with farmers to adopt more nature-friendly farming, we heard that visiting farmers was critical to delivering a trusted service, compared to delivering their advice purely by phone, video call, letter or signposting to online guidance."
        },
        {
            "text": "Beyond the scope of service design, it’s important to consider the portfolio of policy interventions that can be combined to deliver outcomes. During my time at Policy Lab, we often used the Government styles of action framework to invite policymakers to think more widely about how they might deliver their policy objectives. On reflection, this framework is also useful to service designers working with policymakers to translate policy objectives into delivery, where delivery is understood as a system of interventions, not a service alone."
        },
        {
            "heading": 2,
            "text": "How to get involved with greener policy design"
        },
        {
            "text": "If you’re working in the UK public sector there are a growing number of peer communities and networks where you can learn more about emerging ‘green’ policy and service design work:"
        }
    ]
}