{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/26/seo-senior-scientific-officer-department-for-culture-media-and-sport/",
    "title": "SEO Senior Scientific Officer, Department for Culture, Media and Sport",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2024-09-26T14:43:59+01:00",
    "content": [
        {
            "text": "The Department for Culture, Media and Sport supports culture, arts, media, creative industries, tourism, sport and civil society - recognising the UK’s world leading position in these areas and the importance of these sectors in contributing so much to our economy, way of life, and our reputation around the world."
        },
        {
            "text": "Job description"
        },
        {
            "text": "Do you have a keen interest in science and engineering and want to apply it to an exciting, fast-paced and varied role? The Department for Culture, Media and Sport is looking for a highly motivated Senior Executive Officer to be part of its Chief Scientific Adviser's Private Office, working directly with the Principal Scientific Officer and the Chief Scientific Adviser."
        },
        {
            "text": "The role of the CSA team at DCMS is to ensure that research and evidence is embedded into the culture of the department and that DCMS is well supported in its policy and decision making. The team operates to three core objectives: proactively delivering informed technical and scientific advice, promoting strong external links with the science and research community, and strengthening technical capabilities."
        },
        {
            "text": "The Senior Scientific Officer will be part of a team that supports the CSA in their role in delivering independent, impartial assurance on scientific rigour, and providing access to expertise from the cross-government network of CSAs and wider scientific community and advice to ministers, the Permanent Secretary, Directors and policy officials on science and engineering matters."
        },
        {
            "text": "For more information, including the full job description and how to apply, please see the Civil Service Jobs webpage here. "
        },
        {
            "text": "Apply before 11:55 pm on Monday 7th October 2024."
        }
    ]
}