{
    "url": "https://environmentagency.blog.gov.uk/2024/09/26/shifting-perspectives-from-clean-air-to-healthy-air/",
    "title": "Shifting perspectives: from clean air to healthy air",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Nature",
        "Other areas of our work",
        "Regulated industry"
    ],
    "pub_date": "2024-09-26T07:40:35+00:00",
    "content": [
        {
            "text": "Jointly authored by: Dr Pippa Douglas (Environment Agency), Dr Emma Marczylo (UK Health Security Agency) and Prof. Sean Tyrrel (Cranfield University)"
        },
        {
            "text": "IntroductionWhen we talk about air quality, the term \"clean air\" often comes to mind. Clean air initiatives have played a crucial role in raising awareness about the harm of air pollutants, such as particles and gases. However, as our understanding of air quality evolves, it's becoming clear that we need to shift our focus from \"clean air\" to \"healthy air\". This mindset change is essential if we are to make meaningful progress towards biologically healthy air. An important aspect of this shift is recognising the role of bioaerosols and the diversity they bring to our air."
        },
        {
            "text": "What are bioaerosols?Bioaerosols are airborne particles of biological origin. They are a complex mix of different microbes, including bacteria, fungi, viruses, and particles originating from plants and animals such as pollen, dust mite fragments, animal skin and fur, and human skin cells. Every breath we have taken since birth contains bioaerosols, reflecting their global presence in both outdoor and indoor environments. Bioaerosols are formed when biological matter is disturbed and becomes airborne, such as when wind blows over flowers, birds flap their wings, or humans sneeze."
        },
        {
            "text": "Why we need to think differently: the case for healthy airThe traditional notion of clean air suggests the absence of pollutants, or “sterile air”. Healthy air is not just about the absence of harmful substances but also about the presence of beneficial ones. Understanding and communicating the concept of healthy air requires us to embrace the diversity of bioaerosols and their varying impacts on health."
        },
        {
            "text": "The importance of diversity: local environments, individuals, and microbesDiversity is an ecological concept that is relevant to bioaerosols. The types and amounts of bioaerosols in the air depend on the local environment and change over time. Moreover, the impact of bioaerosols on health varies among individuals due to differences in genetics, immune systems, and health conditions. This diversity means that the composition of healthy air is not the same for everyone. A diverse range of bioaerosols can promote good health, especially during early childhood when exposure to a variety of microbes helps us to develop robust immune systems."
        },
        {
            "text": "Air is not microbially cleanThe concept of clean air often implies sterility, but this is neither possible nor desirable. Our bodies host billions of microbes that contribute to our health by providing barriers against infections, aiding digestion, and producing essential vitamins and compounds. While we strongly recognise the importance and impact of harmful microbes in the air, such as those causing infectious diseases, it's equally important to recognize the beneficial microbes we encounter daily."
        },
        {
            "text": "Healthy air: a personalized conceptDefining healthy air is challenging due to the vast diversity of bioaerosols and individual susceptibilities. Healthy air for one person might not be the same for another. Factors such as age, ethnicity, nutrition, and pre-existing medical conditions all influence how bioaerosols impact health. Therefore, while we work towards a general understanding of healthy air, it's crucial to acknowledge that it cannot be a one-size-fits-all concept."
        },
        {
            "text": "Everyone's role: from individuals to governmentsAchieving biologically healthy air requires a collective effort. Individuals can contribute by making healthy living choices: For example, to reduce exposure to harmful bioaerosols indoors, individuals can improve ventilation in their homes and reduce moisture build-up, which limits the growth of harmful microbes. At the same time, it’s important to spend time in diverse environments, as exposure to a variety of microbes can support a healthy immune system. Governments and policy makers are working to support research and implement regulations that reduce harmful emissions and better understand the beneficial bioaerosols in our environments. Industry and Non-Governmental Organisations can play a pivotal role by raising awareness and driving innovations that enhance air quality."
        },
        {
            "text": "Conclusion: towards a healthy environmentHealthy air is a vital component of a healthy environment, and achieving it requires a fundamental shift in how we think about air quality. By embracing the diversity of bioaerosols and understanding their complex impacts on health, we can move towards a future where air quality initiatives not only aim to eliminate pollutants but also promote beneficial biological components. This holistic approach will help create environments that support healthy lives for everyone."
        },
        {
            "text": "As our knowledge grows, so too will our ability to manage air that promotes health and well-being, leading to healthier natural and semi-natural spaces for the benefit of all."
        },
        {
            "text": "AcknowledgementsThis work was funded by the indoor/outdoor bioaerosols interface and relationships network (BioAirNet), funded by a UK Research and Innovations grant (NE/V002171/1)."
        },
        {
            "text": "The images were produced by Dan Andrews from Scribey Sense for Centre for Facilitation."
        },
        {
            "text": "Subscribe to receive updates from the Environment Agency. You can also follow us on X."
        }
    ]
}