{
    "url": "https://earlyyears.blog.gov.uk/2024/09/26/who-needs-to-submit-an-ey2-form-and-tips-for-completing-it/",
    "title": "Who needs to submit an EY2 form, and tips for completing it",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2024-09-26T10:42:41+01:00",
    "content": [
        {
            "text": "In this blog, we’ll set out who needs to submit an EY2 form and give you some tips on completing it, which will help us process your submission quickly and efficiently."
        },
        {
            "text": "Do I need to complete an EY2 form?"
        },
        {
            "text": "If you want to become part of an Ofsted-registered childcare organisation you may need to complete an EY2 (application) form."
        },
        {
            "text": "This depends on the type of role you will have. You will definitely need to apply if you are joining:"
        },
        {
            "text": "We may need to carry out checks on you even if you don’t care for children yourself. We need to make sure that everyone who is legally responsible for the children’s care, and anyone over 16 who could come into contact with children, is suitable."
        },
        {
            "text": "Our guidance gives more information on who needs to apply and how to complete the form."
        },
        {
            "text": "If you are a registered childminder only, you should use our childminders: report new adults in the home service."
        },
        {
            "text": "Tips for completing an EY2 form"
        },
        {
            "text": "It is important to make sure you include the correct information in the EY2 form. Any missing or incorrect information can stop us being able to process it and delay your application. It could also mean we have to return the form to you."
        },
        {
            "text": "Below are some common sticking points to be aware of when submitting the form."
        },
        {
            "text": "New nominated individuals"
        },
        {
            "text": "If you are applying to become the new nominated individual (NI), the outgoing NI will need to provide us with written confirmation that they are stepping down and give us your details. We cannot begin to process your application, or accept any change, until we receive this."
        },
        {
            "text": "If you are already listed under the registered person, you do not need to complete a new EY2 form. You can tell us about changes to registered people."
        },
        {
            "text": "We know that sometimes it will not be possible for the current NI to inform us that they are stepping down. If you are in this situation, you should contact us directly to explain the reason. Depending on the circumstances, we will discuss the next steps with you. When contacting us, please use the email address registered with us and include your URN."
        },
        {
            "text": "Joining a company or charity"
        },
        {
            "text": "In most cases, if you are applying to join a company or charity you will need to make sure you are listed on Companies House or the Charity Commission before submitting the form. If you are not listed, we will not be able to accept the form."
        },
        {
            "text": "Individuals already known to Ofsted"
        },
        {
            "text": "If you are already known to Ofsted (for example, if you have previously been registered with us or associated with an application), we will check the information you give us against any information we already hold. If there are any discrepancies, we may need to return the form. We will attempt to call you to let you know we will be returning it."
        },
        {
            "text": "DBS checks"
        },
        {
            "text": "You will need a valid DBS certificate that meets the criteria. We will check the information in your DBS check against the details you give us in the EY2 form. This will include any previously used names and your full address history for the last five years."
        },
        {
            "text": "There are some circumstances where we need to review the original DBS certificate, for example if it has not been applied for through our DBS application portal or if the portal indicates there may be information disclosed. If we request the original certificate, you will need to send it to us by post. You may wish to do this by recorded delivery. Please wait for us to request to see your certificate before sending it to us. We are unable to accept digital or scanned copies."
        },
        {
            "text": "Using the correct unique reference number"
        },
        {
            "text": "Please make sure you enter the correct unique reference number (URN) on the form."
        },
        {
            "text": "If the daycare organisation you are joining operates as childcare on non-domestic premises, you must use the registered person’s (RP) URN. You can find this number on the registration certificate. It has the prefix ‘RP’ followed by six digits. Alternatively, you can find it by looking up the organisation on our website."
        },
        {
            "text": "If you are joining daycare operating in a home (childcare on domestic premises), you will need to use the setting’s URN."
        },
        {
            "text": "Submitting the form"
        },
        {
            "text": "When you are ready to submit the form, please double-check all details are correct."
        },
        {
            "text": "At the end of the form, you will need to enter the date of submission. We have noticed that some applicants enter their date of birth instead, so please check this carefully."
        },
        {
            "text": "Tracking applications"
        },
        {
            "text": "After you have submitted the form, we will carry out the relevant checks as part of your application. We will also write to you to confirm we have received your application and to request any additional information we need."
        },
        {
            "text": "You will receive progress updates every 2 weeks. Once all of our checks have been completed, we will send you a letter confirming suitability."
        }
    ]
}