{
    "url": "https://socialcare.blog.gov.uk/2023/10/24/black-history-month-inspirational-lives-inspiring-careers-in-care/",
    "title": "Black History Month: inspirational lives, inspiring great careers in care",
    "authors": [
        "Christabel Chinonso U",
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2023-10-24T09:31:00+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Black History Month and me"
        },
        {
            "text": "Black History Month to me is a real call to action, a wake-up call. There seems to be some sort of subtle discrimination and limited black representation in leadership positions all over the world."
        },
        {
            "text": "Despite this, several individuals who draw their lineage from black heritage are still making headway in their various fields. I draw my motivation and inspiration from these great black leaders, prompting myself and others to utilise every opportunity and be the best we can be! YES WE CAN!"
        },
        {
            "text": "I definitely feel that my heritage, growing up and starting my career in Nigeria, shaped my choice of profession. Social care nursing is not really a key area of healthcare in Nigeria. My experience was more in acute, secondary care, and primary care."
        },
        {
            "text": "I started an initiative towards home care nursing in my country, but the opportunity for a better experience outside my country arose and I had to pursue it. Nigerian culture, traditions, values, and experience motivated me towards the quest to improve myself, my competence, and patient outcomes."
        },
        {
            "text": "In Nigeria, there is an emphasis on grassroots care, which helps drive home health information to everyone, including those without access to education."
        },
        {
            "text": "The relationship between health institutions, communities, and even religious organisations provides a good platform for healthcare staff to move into communities and churches, providing health education to individuals and families using their local languages, pictures, songs, dance drama, and demonstrations. The involvement of relatives around our elderly tends to overshadow the need for social care in my country."
        },
        {
            "heading": 2,
            "text": "Universal values, local customs"
        },
        {
            "text": "Nursing is the same everywhere, but each society seems to operate on certain principles and guidelines peculiar to its citizens. This posed a challenge to me on entering the UK to work as a nurse as it dampened my supposed confidence and communication skills. Getting job satisfaction, and building my confidence and competence became a huge quest for me. Fortunately, Florence Nightingale Foundation Academy emerged with a heartwarming solution."
        },
        {
            "text": "As part of the FNF leadership programme, we underwent the RADA sessions and the ‘building your authority’ course. I didn’t want the sessions to end as they were so interesting, impactful, and motivating. Then every day at work I would see myself trying to stand the way we had practiced at RADA. I was seeing myself living it out daily. My confidence has greatly improved, as has my competence, communication skills, collaboration and teamwork. The list of positives is endless."
        },
        {
            "text": "When I first came into social care, I didn’t understand the role very well and so I felt stampeded, I wasn’t able to be effective. I was in a hurry to run away but going through this course I had a big change of mind. I wish I’d done it earlier in my work in social care. It changed me. Hearing Chief Nurse for Adult Social Care, Deborah Sturdy, talk to us about her dreams and her passion for social care was amazing. “Why didn’t anybody bring this up to me before!” It gave me a huge lift. I realized career progression in social care really does exist."
        }
    ]
}