{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/10/24/black-history-month-reflections-on-allyship/",
    "title": "Black History Month: reflections on allyship",
    "authors": [
        "Shantel Thomas",
        "Neil Sanyal",
        "Lyn Romeo"
    ],
    "categories": [
        "Communities",
        "Society"
    ],
    "pub_date": "2023-10-24T11:34:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Pivotal moments"
        },
        {
            "text": "Shantel: The murder of George Floyd in the United States in 2020 and its galvanising impact on the Black Lives Matter movement, sharpened global attention on the issue of racism, within the context of the Covid-19 pandemic."
        },
        {
            "text": "Since then, there has been a call for acute attention to be given to issues of structural and institutional racism in the UK and the social work sector is no exception to this. Despite our value base of social justice, human rights, anti-discriminative, anti-oppressive and antiracist practice, there is still a very long way to go in becoming an anti-racist workforce."
        },
        {
            "text": "As a black woman, I do not have the privilege of ignoring racism or pretending it doesn’t happen but have had to ignore and subconsciously bury the feelings evoked when on the receiving end. I was deeply stirred by the events of 2020 and the activist within was unleashed."
        },
        {
            "text": "Neil: But it wasn’t until I watched a December 2020 You Tube recording of Dr Helen Morgan’s presentation on “Whiteness: A Problem of Our Time?” that I realised something new was about to happen."
        },
        {
            "text": "After 34 years of race equality work, I came across the term “whiteness” for the first time in this presentation, which was my lightbulb moment. A discussion with the AMHP Lead in Barnet gave me some impetus and support and I had already read Akala’s book “Natives”, and Reni Eddo-Lodge’s book “Why I am no longer talking to White People about Race”."
        },
        {
            "text": "I started discussing Whiteness with some local social work colleagues from both White British and other ethnic backgrounds, which helped formulate some concrete concepts of allyship for race equality. I watched Robin DiAngelo’s You Tube presentation on “White Fragility” given in 2018, which further enlightened me."
        },
        {
            "heading": 2,
            "text": "Building courses, coalitions and compassion"
        },
        {
            "text": "Shantel: Together with colleagues from the Hertfordshire Social Work Teaching Partnership we developed the ‘Becoming an Anti-Racist Practitioner: An Invitation to Allyship’ short course in response to the recognised need to build allyship or a ‘coalition’ across networks and systems in social work."
        },
        {
            "text": "The course shares theoretical and research informed knowledge in relation to racism and the notion of becoming an anti-racist ally.  The aim is to invite participants to think about anti-racist practice with the people they support and within their organisations and teams."
        },
        {
            "text": "The course holds relationship-based, anti-racist practice at its core and is based on a model for achieving emotionally intelligent, critically reflective, curious conversations, in a ‘brave’ space."
        },
        {
            "text": "During my term as BASW’s UK anti-racism lead, I delivered the course across the UK, inviting participants to consider their own individual identity and position in relation to power, white privilege and black empowerment and develop their own personal mission statement for their learning on the course.  The group are invited into a shared space, with an ethos of collaborative learning, where responsibility for learning is co-created."
        },
        {
            "heading": 2,
            "text": "Profound learning"
        },
        {
            "text": "Neil: In March 2022, I created my own presentation, using some stark aspects of the British Empire’s financial effects on non-white populations of the world, and concepts of anti-racism and whiteness, utilising clips of the videos just mentioned, and delivered it to final year apprenticeship students on the University of Winchester Social Work Degree course."
        },
        {
            "text": "Their response was profound and passionate, and I realised that this message was something that needed to be promoted across the world of social work. In April 2022, I was co-opted to join the National AMHP Leads Network Steering Group to assist them with developing practice. The co-chairs of the group assisted and supported me to promote my presentation to wider audiences through their connections."
        },
        {
            "text": "I participated in a workshop on allyship at the BASW Annual Conference in June 2022 where I first met Shantel. By April 2023 I was delivering my presentation and training session to AMHPs as far afield as Cumbria and Yorkshire both face to face and online, and I had covered Hampshire, West Berkshire and North London Boroughs by July."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        }
    ]
}