{
    "url": "https://educationhub.blog.gov.uk/2023/10/24/education-secretarys-letter-to-parents-you-have-the-right-to-see-rshe-lesson-material/",
    "title": "Education Secretary's letter to parents: You have the right to see RSHE lesson material",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-10-24T09:51:19+01:00",
    "content": [
        {
            "text": "Dear parents and carers,"
        },
        {
            "text": "You may be aware of concerns about inappropriate materials being used in some cases to teach relationships, sex and health education (RSHE) in schools and parents who have had difficulty accessing these materials."
        },
        {
            "text": "This Government is clear that this is not acceptable. You have a fundamental right to know what your children are being taught about healthy relationships, sex and development in school."
        },
        {
            "text": "So, today I have acted by writing to schools, making it clear that as parents you should always be able to see the materials that are being used to teach your children. To place this right beyond any further doubt, my letter clarifies that copyright restrictions do not prevent you from seeing materials that are being used in the classroom."
        },
        {
            "text": "I am clear that schools must share worksheets, presentations, or other content used in lessons with parents when asked to do so. This is regardless of what a school’s contract with the organisation that provided the materials might say."
        },
        {
            "text": "Schools can lawfully share copies of resources with you via an online “parent portal” or, if this is not possible, through a presentation. Schools will ask you, in these circumstances, to agree that the content will not be copied or shared further. If you cannot attend a presentation, schools may provide copies of materials for you to take home, provided you similarly agree not to copy the content or share it further."
        },
        {
            "text": "Earlier this year I brought forward an urgent review of the RSHE statutory guidance and asked an independent panel to advise us on how we can introduce age limits to RSHE teaching. This will make sure children are always taught sensitive content in an appropriate manner and at the right time. This upcoming guidance will reflect the letter that I have sent to schools today."
        },
        {
            "text": "We have been listening to both parents and teachers as part of the review and updated guidance will be published for public comment soon. I encourage you to read and respond to this."
        },
        {
            "text": "Yours sincerely,"
        },
        {
            "text": "The Rt Hon Gillian Keegan MP\nSecretary of State for Education"
        }
    ]
}