{
    "url": "https://thebluebeltprogramme.blog.gov.uk/from-data-to-decision-making-how-a-network-of-underwater-cameras-is-helping-to-improve-marine-protection-in-the-remote-uk-overseas-territories/",
    "title": "From data to decision-making: How a network of underwater cameras is helping to improve marine protection in the remote UK Overseas Territories",
    "authors": [
        "Dr Paul Whomersley"
    ],
    "categories": [
        "Blue Belt Programme",
        "Global Ocean Wildlife Analysis Network",
        "Marine Protected Areas",
        "Science"
    ],
    "pub_date": "2023-10-24T07:00:25+01:00",
    "content": [
        {
            "text": "Imagine being able to see life in some of the most unexplored oceans on earth? "
        },
        {
            "text": "This is the reality for scientists and partners who are part of the Global Ocean Wildlife Analysis Network (GOWAN), a global network of underwater cameras designed to monitor ocean biodiversity and ecosystems found in the vast waters of the UK Overseas Territories (UKOTs). Started in 2020 and open to all UK Overseas Territories (UKOTs), GOWAN builds on the successes of the Blue Belt Programme which has supported the protection, management, and conservation of over 4 million km2 of ocean.  "
        },
        {
            "text": "In the first of this two-part blog series, Dr Paul Whomersley, International Marine Advisor at Cefas, discusses the opportunities and challenges of running a global programme tasked with protecting some of the most remote marine environments in the world.  "
        },
        {
            "text": "What is it that makes the Global Ocean Wildlife Analysis Network so unique?  "
        },
        {
            "text": "GOWAN is one of the largest networks of Baited Remote Underwater Video Systems (BRUVS) in the world providing data on the marine biodiversity found in our oceans and seas. The camera systems which can be deployed mid-water (pelagic deployment) or, once legs have been fitted, on the seabed (benthic deployment). They consist of two cameras which have been calibrated to give a stereo image. These cameras are mounted in a carbon fibre base bar. Attached to the base bar is a boat pole which extends outwards like a long arm. Attached to this is the bait canister which we fill with 1kg of fish offal sourced from local fish markets to attract the fish, sharks, or other marine species.   "
        },
        {
            "text": "While scientist have, for decades, used underwater cameras to explore our oceans, this is the first global network of BRUVS which collects data and information using a consistent and standardised approach. The fact that the data are collected and processed in a standardised way allows scientific questions to be addressed on both a national and global scale. A great feature of the BRUVS is that the cameras have been pre-calibrated. This means that the species being monitored no longer have to be caught to be measured, sexed or aged. All this information can be acquired using a specific software from the high-quality imagery collected during each deployment.  Also, the quality of the images is really high which makes it much easier to identify the different species. Watch this space for part 2 of the blog, where we explain more about this. "
        },
        {
            "text": " "
        },
        {
            "text": "Why is the data collected so important? "
        },
        {
            "text": "The data are vital to help scientists and managers assess the abundances and diversity of key fisheries and threatened and endangered species. When we deploy the cameras on the seabed, the imagery collected can also be used to assess the ‘health’ of coral reefs as they provide habitat and refuge for many other marine species. There are many challenges facing our marine environments in terms of climate change, biodiversity loss and pollution, and the information collected can be used to support the development and implementation of effective polices and management measures that not only protect and conserve marine environments but ensure that our oceans are used sustainably. This means that communities that rely on the ocean for food and income and other services can do so in harmony with their marine environment, helping to protect it for generations to come. There are currently 13 UKOTs in the Atlantic, Mediterranean,  "
        },
        {
            "text": "Indian, Pacific and Southern Oceans engaged in the programme, and the UKOT teams have delivered 15 expeditions, deploying cameras at more than 675 sampling stations so far.  An amazing amount of work has already been done to protect the waters around the UKOTs, but the work under GOWAN is helping to fill the data gaps and to increase our understanding of how our oceans and seas function and are being impacted by climate change and the effects of, fishing and tourism.  "
        },
        {
            "text": "What does the future hold for the Global Ocean Wildlife Analysis Network?  "
        },
        {
            "text": "There is obviously a lot of work out there still to do. As part of the Blue Belt programme, we will continue to work with the  UKOTs to provide the assistance they need to implement their marine management plans. We are also looking forward to other OTs joining both GOWAN and the Blue Belt programme. We also have a great opportunity  to begin addressing global scientific questions linked to migratory species such as tuna and sharks because the data is collected and processed in a standardised way. We hope that data collected from across the network can be brought together and to begin answering some key questions linked to climate change and biodiversity loss. We are also keen to use the GOWAN and the amazing footage we collect through BRUVs to inspire the next generation of marine scientists and conservationists across the UK and in the OTs. We are currently in the process of creating some great interactive educational resources and games which we hope to roll out to schools in the new year. We have also just produced some 3d video clips from  original BRUVS footage collected. This means you can now feel what it is like to be a baited camera when sharks and fish are swimming up to you to try and eat the bait., so watch this space.  "
        },
        {
            "text": "Watch out next week for part 2 of our GOWAN blog where we talk to Professor Jessica Meeuwig from Blue Abacus and the University of Western Australia, and Kirsty Jones, Marine and Fisheries Conservation Officer for St Helena Government, to understand more about how the data is collected using BRUVS and then used to inform conservation and protection policy. "
        }
    ]
}