{
    "url": "https://forestrycommission.blog.gov.uk/2023/10/24/hedging-our-bets-coming-together-to-explore-ways-of-investing-in-nature/",
    "title": "Exploring ways of investing in nature",
    "authors": [
        "Emma Stewart"
    ],
    "categories": [
        "Climate change and resilience",
        "nature"
    ],
    "pub_date": "2023-10-24T11:22:10+01:00",
    "content": [
        {
            "text": "There is lots of evidence about how trees and woodland sequester carbon from the atmosphere. But what about carbon sequestration in other types of habitat? What about scrub, heathland, or hedgerows?"
        },
        {
            "text": "Although we know that different types of habitat also sequester carbon, at present there is limited data available to enable us to understand exactly how much. With woodland currently covering only 10% of land in England (albeit increasing), there is much to learn about the role that other types of habitat can play in tackling the climate crisis."
        },
        {
            "heading": 3,
            "text": "Nature Returns Programme"
        },
        {
            "text": "Since April 2021, the Nature Returns Programme (funded by HM Treasury via its Shared Outcomes Fund) has been working to bridge this knowledge gap. The Programme, led by Natural England, in partnership with the Forestry Commission, Environment Agency, and Royal Botanical Gardens Kew, and sponsored by Defra and DESNZ, has been exploring approaches to creating and restoring natural habitats in ways that tackle the twin challenges of climate change and biodiversity loss. Understanding how the landscape works holistically is key to understanding how and where carbon is stored."
        },
        {
            "text": "The Forestry Commission is lending its expertise to the Programme through its experience with the Woodland Carbon Code (WCC). Since 2011, the WCC has supported the development of a highly credible market for the sale of carbon from tree planting, thanks to the robust scientific research that backs it up – helping to boost rates of woodland creation in the UK by making it more financially attractive. By joining forces through Nature Returns, our organisations are working together to better understand how private finance can be brought in to create and restore other types of natural habitat outside of woodlands."
        },
        {
            "text": "On the ground, Nature Returns is working with local partnerships in six established project areas which are creating and restoring different types of habitat that can contribute learning to the Programme, recognising that collaboration is key to the success of landscape scale nature projects. These project sites, spanning the length of England from Plymouth to Northumberland, were selected for their ability to work in ways that deliver nature-based solutions to climate change and biodiversity loss. Already established, and each with unique objectives and design, these projects are pioneering in their work to deliver holistic environmental outcomes that deliver multiple benefits. The projects’ different approaches to solving local problems – but on a landscape scale – are providing valuable insights that the Programme will seek to build on. The Forestry Commission’s Nature Recovery Advisors are supporting the projects with their woody habitats, and creating a link to Local Nature Recovery Strategies."
        },
        {
            "heading": 3,
            "text": "Building a Bank of Evidence"
        },
        {
            "text": "The project sites are providing the Programme’s scientists with valuable study areas to gather data. Access has been granted to Natural England to allow them to measure the carbon flux of different habitats (as well as measuring biodiversity), whilst RBG Kew is carrying out similar work at its Wakehurst site to address key questions on the trade-offs and interactions between ecosystem function and carbon sequestration."
        },
        {
            "text": "Meanwhile, the Programme is also working with the projects behind the scenes to explore how their partnerships can work effectively together to deliver their ambitions. The Environment Agency is investigating the role of good governance, and how private finance can be brought in to secure long-term ‘nature returns.’ They have worked with research partners to better understand the different models for the aggregation of buyers and sellers of ecosystem services, as well as engaging with investors for their views on nature markets. Bringing in these stakeholders is providing us with valuable information that will help fund future habitat creation through private finance."
        },
        {
            "heading": 3,
            "text": "Fuelling the Carbon Market"
        },
        {
            "text": "As more and more organisations declare net zero targets and strategies, the demand for carbon units in the voluntary carbon market (such as those certified by the WCC) far outstrips the supply. The Natural Environment Investment Readiness Fund (NEIRF) has been supporting the development of new Codes and Standards like the WCC, and Nature Returns is creating opportunities to test these in our local partnership sites."
        },
        {
            "text": "For buyers, it is an exciting prospect that new Carbon Standards are in development: there will be more carbon units for sale on the market."
        },
        {
            "text": "But navigating the voluntary carbon market has its challenges. The prices paid for carbon units backed by the WCC are not disclosed to the market, and remain a private transaction between the buyer and seller. As the voluntary carbon market grows, and new Carbon Standards are published, a buoyant market will need greater transparency in the prices that carbon units are fetching. Through Nature Returns, the first steps towards this have been taken by reporting on the prices paid for carbon units backed by the WCC and Peatland Code (PC). This engagement was carried out by Ecosystem Marketplace, and the results of their work can be found here. This research will contribute to developing  our understanding of blended funding models, which are key to unlocking future opportunities for getting nature projects off the ground."
        },
        {
            "text": "Nature already has many of the answers to climate change and biodiversity loss. Through working in partnership, Nature Returns is taking a holistic approach to seeking out these answers, providing the evidence to enable investment in nature recovery, and allowing us to reap the rewards."
        }
    ]
}