{
    "url": "https://educationhub.blog.gov.uk/2023/10/how-protect-against-measles-vaccines-school-pupils/",
    "title": "How to protect against measles – vaccines for school pupils",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-10-24T11:50:41+01:00",
    "content": [
        {
            "text": "Measles is an infection that spreads very easily and for some people can cause serious problems. Cases of the virus are rising across England, including among children. "
        },
        {
            "text": "There’s no specific medical treatment for measles, so it’s important to get vaccinated as it’s the best protection against becoming seriously unwell. "
        },
        {
            "text": "The MMR vaccine protects against measles, mumps and rubella. Here, we explain everything you need to know about getting your child up to date on their vaccines.  "
        },
        {
            "heading": 3,
            "text": "Why is it important for school pupils to get the MMR vaccine? "
        },
        {
            "text": "One in 15 children develop serious complications from a measles infection, which can include meningitis and blindness. Vaccination is the best way for your children to build up immunity and offers good protection against serious illness.  "
        },
        {
            "text": "Being vaccinated is also the most effective way to prevent the disease from spreading and to minimise the disruption to your child’s education. "
        },
        {
            "heading": 3,
            "text": "How old does my child have to be to get an MMR vaccine? "
        },
        {
            "text": "The MMR vaccine is free on the NHS and is given as two doses – the first when your child turns one, and the second when they turn 3 years and 4 months old. Both doses are needed to ensure full protection, which lasts into adulthood.  "
        },
        {
            "text": "Each dose is a single injection into the muscle in the thigh or upper arm.  "
        },
        {
            "heading": 3,
            "text": "How do I get the MMR vaccine for my child? "
        },
        {
            "text": "You should contact your GP to make an appointment for your child.   "
        },
        {
            "text": "You can still ask your GP surgery for the MMR vaccine if your child has missed either of these 2 doses. "
        },
        {
            "heading": 3,
            "text": "How do I know if my child has already had the vaccine? "
        },
        {
            "text": "If you’re unsure whether your child is up to date with their vaccines, you should check your child’s red book or GP records.  "
        },
        {
            "text": "You can also call your GP to find out if you’re up to date with your own vaccines.  "
        },
        {
            "heading": 3,
            "text": "Is the MMR vaccine safe?"
        },
        {
            "text": "The MMR vaccine is very safe. Before vaccines can be used, they must be thoroughly tested for safety. Many studies have taken place to look at the safety and effectiveness of MMR vaccine."
        },
        {
            "text": "Most side effects are mild and do not last long. It's important to remember that the possible complications of infectious conditions, such as measles, mumps and rubella, are much more serious."
        },
        {
            "text": "For more information on the MMR vaccine, please visit the NHS website. "
        }
    ]
}