{
    "url": "https://naturalengland.blog.gov.uk/2023/10/24/land-managers-discuss-opportunities-created-with-biodiversity-net-gain/",
    "title": "Land managers discuss opportunities created with biodiversity net gain",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Species recovery"
    ],
    "pub_date": "2023-10-24T11:16:51+01:00",
    "content": [
        {
            "text": "How are land managers embracing biodiversity net gain (BNG) while working towards their green strategies? In this guest blog, Digby Sowerby, Operations Officer at Environmental Farmers Group (EFG), Chris Avent, Green Estate Manager at Plymouth City Council, and Emma Holman-West, CEO at Alscot Estate, discuss how they approached BNG in recent land management projects."
        },
        {
            "text": "Digby Sowerby - Environmental Farmers Group (EFG) and Bisterne Farm\nFarmers across England are preparing for biodiversity net gain as new trading opportunities begin to arise. In several counties of England, the Environmental Farmers Group (EFG) is working in the natural capital sector. EFG is a farmer-led co-operative covering over 130,000 hectares. EFG has been supporting its members in accessing current and future BNG markets. Forty-four EFG farmers have now completed a Biodiversity Baseline Audit of their farm using the Natural England Metric 4.0 and the group is working on several BNG trading opportunities with local developers."
        },
        {
            "text": "Hallam Mills, at Bisterne Farms, is a dairy and arable farmer with forestry who farms alongside the River Avon in Hampshire. Mr Mills has completed one such BNG audit as part of EFG and said about it:"
        },
        {
            "text": "“In these uncertain arable markets, and with our Grade 3-4 land, we see a future in taking on new environmental schemes on marginal unproductive fields, no longer seeing the extensive timeframe of the agreements as a barrier. We see the agreements as providing a stable income in a very volatile world, whilst doing real long term, measurable good for the environment.\nA BNG audit serves many purposes. It is a gateway to understanding values and mechanisms. It identifies areas for delivering biodiversity improvements and it helps get a grip on how the payments might fund management costs."
        },
        {
            "text": "We are now at the stage of deciding which projects we want to deliver. As well as BNG enquiries from developers, we have Environmental Social Governance (ESG) interests knocking on our door. The 30-year obligation has a lot of implications for our farm, especially as we manage succession planning, but it might be exactly what we need now.”"
        },
        {
            "text": " "
        },
        {
            "text": "Chris Avent - Plymouth City Council’s Habitat Bank: Ocean City Nature\nIn Plymouth, our local authority is quite a prominent landowner with 1400 hectares of green space around the city. Through a strategic opportunity assessment of our assets, we identified the option to take land that can often be seen as a liability to local authorities and turn it into genuine assets. Those assets then provide an income stream that goes back into improving and maintaining green spaces. One such opportunity arose with one of our strategic transport schemes."
        },
        {
            "text": "Plymouth City Council's Forder Valley Link Road scheme required 102 offsite Biodiversity Units to achieve a net gain across a mix of woodland, grassland, and river habitats. The Council's Environmental Planning and Green Estate Operations teams collaborated to plan, deliver and maintain this across several sites in the city from 2019.\nMost notably, the team enhanced habitats in two local nature reserves that were adjacent to the development site. They enhanced Forder Valley and Bircham Valley through management prescriptions such as:"
        },
        {
            "text": "The north of Plymouth has significant deer populations, meaning the greatest challenge has been protecting new planting and coppice stems from browsing pressure. The teams' perseverance and innovation resulted in installing sympathetic and robust fencing. A 2023 survey showed a tree failure rate under 10 per cent."
        },
        {
            "text": "This was the earliest BNG scheme the Council delivered. We've used this experience to improve our land management and have used the BNG metric to help inform management planning and our team's skills through training and recruitment."
        },
        {
            "text": "This has helped develop key partnerships with National Trust and Finance Earth to consolidate our work and implement our own Habitat Bank known as Ocean City Nature."
        },
        {
            "text": "Emma Holman-West – Alscot Estate"
        },
        {
            "text": "Alscot Estate is a diverse country estate covering over 4,000 acres. In 2017, my attention was brought to a new project, biodiversity net gain and the Government selected Warwickshire to introduce BNG policy into their planning system. This was the right way to go for Alscot Estate, as it aligned with Alscot's long-term strategy of introducing conservation and habitat enhancement and creation."
        },
        {
            "text": "The first phase of the Alscot BNG Project was a trial. We chose our land carefully, which was crucial. We chose 47.86 acres of land along the river corridor that runs through the Estate. The River Stour now plays a significant role in the Estate's land use and how it functions. The first phase has been so successful that we are about to embark on a second phase connecting more land along the river corridor."
        },
        {
            "text": "We have concluded over fourteen transactions with developers over Warwickshire to provide their off-site mitigation. This has enabled the development of over 500 residential dwellings and the delivery of commercial enterprises, including a leading supermarket."
        },
        {
            "text": "During the second phase, we will observe the Lawton Principle (bigger, better, and more joined up sites within the landscape) to create an ecological network that operates more naturally and effectively. Within that corridor, we will give over the parkland and some farmland. So, we are improving grasslands and creating habitats with the all-important connectivity!"
        },
        {
            "text": "After three and a half years, I already see the rewards, which fills me with a great sense of pride. Not only does BNG form part of the Estate's income, but it also enables development and keeps the economy moving. Through BNG, we are contributing to our planet's well-being and creating a biodiversity legacy for future generations to cherish."
        }
    ]
}