{
    "url": "https://marinedevelopments.blog.gov.uk/2023/10/24/marine-planners-from-the-marine-management-organisation-visit-the-isles-of-scilly/",
    "title": "Marine Planners from the Marine Management Organisation visit the Isles of Scilly",
    "authors": [
        "Zia Fikardos & Alicia Shephard, MMO Marine Planners"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2023-10-24T12:23:55+01:00",
    "content": [
        {
            "text": "We were recently invited to attend the Festival of Nature on the Isles of Scilly to discuss marine planning and marine plan use with event attendees. The event was led by the Isles of Scilly Wildlife Trust and was aimed to engage locals and tourists on the local environment, as well as involving key stakeholders including the Local Authority, Statutory Nature Conservation Bodies, fishing, and tourism and recreation organisations."
        },
        {
            "text": "The Isles of Scilly lie 45 km (24 nautical miles) off the Cornish peninsula, and are within the South West marine plan area. The five inhabited islands and numerous islets have been recognised as an Area of Outstanding Natural Beauty due to the biodiversity and rich fauna and flora found there. The Isles are also considered the warmest place in Britain – although the hosts failed to mention how windy and rough the crossing was!"
        },
        {
            "text": "The Isles of Scilly are England’s largest ocean archipelago, are a Special Area of Conservation, and have 26 Sites of Special Scientific Interest, 11 Marine Conservation Zones, 5 protected wreck sites, and numerous RAMSAR habitats."
        },
        {
            "text": "What we did"
        },
        {
            "text": "Visiting the Isles of Scilly was a great opportunity to build relationships and to raise awareness of marine planning and the South West marine plan."
        },
        {
            "text": "We presented to stakeholders and the public as part of the welcome event that kicked off the Festival of Nature. We also facilitated a series of bespoke training sessions on marine planning and the South West marine plan with a range of stakeholders, involving local council members, the Wildlife Trust, Isles of Scilly Inshore Fisheries Conservation Authority (IFCA), Natural England and the Ocean Conservation Trust."
        },
        {
            "text": "Issues affecting the Isles of Scilly"
        },
        {
            "text": "Tourism and recreation are widely recognised as very important sectors within the South West marine plan areas, and activities that promote or facilitate sustainable tourism and recreation activities are supported.  Although the Isles of Scilly are a small location it has an abundance of tourism and recreation activities taking place."
        },
        {
            "text": "This comes with numerous issues, and it was highlighted by some stakeholders that tourism and recreation is a major concerning factor that has a knock on effect in other areas. For example, tourists are taken on boats to see wildlife such as seals, dolphins, puffins and to visit the other islands. This tourism is positive for the local economy, but it has an impact on local fisheries, air quality, water quality and underwater noise within protected areas."
        },
        {
            "text": "The South West marine plan's Marine Protected Area (MPA) policies, alongside biodiversity policies, seek to protect these areas and the vulnerable species and habitats within them."
        },
        {
            "text": "Land-based infrastructure is critical to facilitating marine activities upon which the Isles are reliant. Examples of current and potential future developments supported by the infrastructure policies include: cables between the archipelago and the mainland, infrastructure to support the renewable energy sector, and port development."
        },
        {
            "text": "Feedback and reflection"
        },
        {
            "text": "There was a general feeling among stakeholders that the sessions had helped them to better understand terrestrial and marine planning together. There was limited prior knowledge on the South West marine plans or marine planning in general before the session. Stakeholders were keen to continue this engagement with more sessions for those that were unable to attend."
        },
        {
            "text": "Other stakeholders facilitated some very valuable discussion around marine spatial prioritisation, and it was considered that in the future more spatially specific plans would be helpful to tackle some of the issues arising on the Isles."
        },
        {
            "text": "While marine planning is a new concept for several groups it was embraced eagerly, for example, researchers from Swansea University who previously had no knowledge of marine planning highlighted that it would be very useful in their research. Their research involves building a database of evidence on seagrass habitats as well as studying the sociological aspect of stakeholder engagement."
        },
        {
            "text": "Overall, the trip was successful in creating stronger stakeholder relationships. It initiated some valuable conversations regarding marine planning and the unique challenges that the Isles of Scilly face, while also learning about the various projects being undertaken around the islands."
        }
    ]
}