{
    "url": "https://deframedia.blog.gov.uk/2023/10/24/mendip-super-national-nature-reserve/",
    "title": "Mendip 'super' National Nature Reserve",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2023-10-24T13:03:52+01:00",
    "content": [
        {
            "text": "There has been coverage across national and regional outlets, including The Times, ITV West Country, BBC Radio Somerset and Somerset County Gazette, following the declaration of the Mendip ‘super’ National Nature Reserve."
        },
        {
            "text": "This landscape will bring together over 1,400 hectares of wildflower grasses, limestone gorges and rocky outcrops stretching from the cliffs at Brean Down to the woodlands in England’s smallest city of Wells."
        },
        {
            "text": "The site will be managed by a partnership of 9 organisations including the Mendip Hills AONB, the National Trust, Longleat/Cheddar Gorge Caves, Somerset and Avon Wildlife Trusts, Butterfly Conservation, the Woodland Trust and the South West Heritage Trust, who will all work together to manage the landscape and drive nature recovery."
        },
        {
            "text": "This bigger, better and more joined up approach to nature recovery will support nationally important species such as greater horseshoe bats, black oil beetles, and endemic plants including Cheddar pink."
        },
        {
            "text": "This is the second declaration in the Kings Series of National Nature Reserves which will see the creation of 25 reserves over the next five years to tackle nature loss and enable species to thrive, all while improving access to these precious landscapes."
        },
        {
            "text": "Natural England Chair Tony Juniper said:"
        },
        {
            "text": ">Today’s declaration of the new Mendip National Nature Reserve is a huge step for Nature recovery, not just in Somerset but the country as a whole. This treasure trove of ancient woodlands, rich wildflower grasslands and stunning geology is of great national importance and sustains a huge variety of wildlife. There are birds, small mammals, rare butterflies and plants that are found only here."
        },
        {
            "text": ">Creating this new National Nature Reserve will be a step along the road of enhancing the biodiversity of the Mendip Hills – making it a bigger, better and more joined up place for wildlife to thrive.” It also gives even more opportunities for the local community and visitors to connect with Nature, history and the local heritage."
        }
    ]
}