{
    "url": "https://educationhub.blog.gov.uk/2023/10/24/rshe-relationships-health-sex-education-review-curriculum-to-protect-children/",
    "title": "Sex education: What is RSHE and can parents access curriculum materials?",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Relationships and Sex Education",
        "Schools",
        "Sex and Relationship Education"
    ],
    "pub_date": "2023-10-24T13:15:01+01:00",
    "content": [
        {
            "text": "We want to make sure that young people can make informed decisions about their health, wellbeing and relationships, in a sensitive way that is appropriate for their age."
        },
        {
            "text": "Parents need to have confidence in what their children are being taught in the classroom about relationships sex and health education (RSHE) and schools have a duty to share teaching materials."
        },
        {
            "text": "To ensure young people continue to be taught about these issues appropriately, we are also reviewing the RSHE statutory guidance for schools and education settings."
        },
        {
            "heading": 3,
            "text": "What is RSHE and what do pupils learn?"
        },
        {
            "text": "RSHE stands for relationships, sex and health education."
        },
        {
            "text": "Relationships education has been compulsory for pupils in primary education since September 2020, while secondary schools are required to teach students relationships and sex education (RSE). Health education is now compulsory in all schools too."
        },
        {
            "text": "The current RSHE guidance can be found here."
        },
        {
            "heading": 3,
            "text": "Can parents see what is being taught in RSHE lessons?"
        },
        {
            "text": "Yes. Parents should be able to see what their children are being taught in RSHE lessons. Schools must share teaching materials with parents."
        },
        {
            "text": "We are clear that schools must make sure all content they use is factual and age-appropriate and talk to parents, so they are aware of what their children are being taught."
        },
        {
            "text": "The Education Secretary has written to all schools in England to remind them of their duty to share RSHE materials with parents when asked to. The letter makes it clear that companies providing teaching resources can’t use copyright law to prevent schools from doing so due to the public interest in parents being aware of what their children are being taught."
        },
        {
            "text": "Gillian Keegan has also written an open letter to parents, outlining their rights, and to ensure sure they feel confident asking their child’s school to share RSHE teaching materials."
        },
        {
            "heading": 3,
            "text": "So, parents can share these materials freely?"
        },
        {
            "text": "A parent can share these materials with anyone who needs to see the materials, for example the other parents or carers. Or to use as evidence if they wish to make a complaint about the materials. However, a parent should not publish materials online or use commercially in any way. Doing so, would make the parents liable for breach of copyright."
        },
        {
            "heading": 3,
            "text": "Why are we carrying out a review on RSHE and what will it look at?"
        },
        {
            "text": "RSHE is an important part of the curriculum, and this review will ensure that it is being taught appropriately."
        },
        {
            "text": "We are putting together an expert panel that will inform the review and will advise on how to put in place protection from pupils being introduced to things that they are too young to understand properly. The panel will also consider how age ratings can be introduced for different parts of the curriculum."
        },
        {
            "heading": 3,
            "text": "When will this review happen?"
        },
        {
            "text": "The review will be complete before the end of 2023."
        },
        {
            "heading": 3,
            "text": "Can I ask for my child to be removed from these lessons?"
        },
        {
            "text": "Parents have a right to request that their child is withdrawn from sex education, but not from relationships education."
        },
        {
            "text": "Parents can ask their school for their child to be withdrawn from some or all of sex education lessons."
        },
        {
            "heading": 3,
            "text": "Does my child’s school have to teach RSHE?"
        },
        {
            "text": "It is mandatory for RSHE to be taught in all schools."
        },
        {
            "text": "We expect all schools to teach the full RSHE curriculum to secondary age pupils and relationships and health education to primary age pupils."
        },
        {
            "text": "Primary schools may also teach sex education where appropriate. The teaching of RSHE is reviewed by Ofsted at inspection."
        },
        {
            "text": "Schools should also ensure that the policy meets the needs of pupils and parents and reflects the community they serve."
        }
    ]
}