{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/10/24/were-growing-our-digital-markets-unit-in-manchester/",
    "title": "We're growing our Digital Markets Unit in Manchester",
    "authors": [
        "Felicity Algate",
        "Jess Farrimond"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA"
    ],
    "pub_date": "2023-10-24T15:51:18+01:00",
    "content": [
        {
            "text": "The Digital Markets Unit (DMU) has been set up to promote competition and tackle unfair behaviour by the largest digital technology firms. "
        },
        {
            "text": "Our actions will help give people confidence that they are getting fair deals, are able to use products and services that best meet their needs and are protected from misleading practices. We will also work to ensure that competitive, fair-dealing business can innovate and have the chance to challenge existing firms. "
        },
        {
            "text": "Read more about the CMA’s approach to promoting competition and innovation in digital markets.  "
        },
        {
            "text": "As part of the UK’s Competition and Markets Authority (CMA) we are based across the country, and we have recently opened a new office in Manchester which will be a key hub for the DMU.  "
        },
        {
            "text": "We’re hiring – so now is the perfect time to join the team! "
        },
        {
            "text": "The following roles are available now: "
        },
        {
            "text": "Apply by the 6 November 2023 for both roles."
        },
        {
            "text": "Find out what it's like to work in the DMU from 2 of our Manchester-based colleagues, Jess and Felicity, below."
        },
        {
            "heading": 2,
            "text": "How did you come to work for the DMU?"
        },
        {
            "heading": 2,
            "text": "What do you do on a day-to-day basis?"
        },
        {
            "heading": 2,
            "text": "What is it like working for the DMU in Manchester? "
        },
        {
            "heading": 3,
            "text": "Join the DMU now! "
        },
        {
            "text": "We are excited to build our presence in Manchester and benefit from the deep talent pool and history of innovation that exists within the city.  "
        },
        {
            "text": "We are looking for a people from a range of backgrounds, with transferable skills. This could include experience in one of the following fields: accountancy, advocacy, data analysis/science, economics, government, law, project management, regulation, research, teaching/academia, technology.  "
        },
        {
            "text": "Previous experience studying or working in a digital-related field may be helpful but is not essential – we are proud of our commitment to learning and development and will support you to upskill in key areas.  "
        },
        {
            "text": "If you’re interested in hearing more about these roles and the work of the DMU, please register for our online live Q&A event on Monday 30th October 2023."
        }
    ]
}