{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/10/31/all-about-bats/",
    "title": "All about bats",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2024-10-31T14:03:53+00:00",
    "content": [
        {
            "text": "As the spooky season of October is upon us, we have collaborated with Madan Gautam from Natural Resources Wales (NRW) to bring you the fascinating world of bats. Read this blog to discover all about bats, learn about their unique adaptations, and understand the importance of their conservation. "
        },
        {
            "heading": 3,
            "text": "Global diversity of bats"
        },
        {
            "text": "Did you know that bats are the only flying mammals? They are nocturnal, leaving their roosts at dusk to forage for food and sleeping during the day in trees, caves, and rock crevices. There are more than 1,400 species of bats in the world. Some are very small, such as the Kitti's hog-nosed bat, known as the bumblebee bat, weighing only 2 grams – the world’s smallest mammal by body length. Meanwhile, other bats can be very large such as the Indian Flying Fox, which can weigh up to 1.6 kilograms. Vampire bats actually do exist, but there are only three species of vampire bat in the world, and they are found in South and Central America. "
        },
        {
            "heading": 3,
            "text": "Bat abilities "
        },
        {
            "text": "Bats can be broadly categorised into two groups: Megabats, which are fruit bats and sometimes known as flying foxes; and Microbats which are smaller in size. Most bats echolocate – a technique to determine the location of objects using reflected sound. This ability allows bats to fly in pitch darkness to navigate, hunt, and forage for insects and fruits. However, not all bats echolocate; some rely on smell and vision to find food."
        },
        {
            "heading": 3,
            "text": "UK bats "
        },
        {
            "text": "In the UK, there are 18 species of bats, and bats in the UK eat only insects. Among the UK bats, the Alcathoe bat is a small bat with small feet and thumbs, with a head and body length of 31 to 34 mm. In contrast, Noctule bats are larger, with a head and body length ranging from 71 mm to 82 mm. These bats are mostly found in south-east Wales and England and are primarily tree dwellers, living mainly in rot holes and woodpecker holes, preferably in oak woodlands."
        },
        {
            "heading": 3,
            "text": "Bat conservation "
        },
        {
            "text": "According to the Red List for British Mammals, four British bat species are red listed as being at imminent risk of national extinction, with two more species listed as near threatened."
        },
        {
            "text": "There is not a clear understanding of the bat population in the UK due to the elusiveness of some species. Observations indicate that their numbers are decreasing, and it is thought this may be due to the application of pesticides, which reduces bat food supplies, and decreasing habitats, including native tree populations."
        },
        {
            "text": "Natural Resources Wales (NRW), especially in south-east Wales, is planting more oak trees in semi-natural woodlands to create better habitats for oak-dwelling native animals. Furthermore, NRW maintains and avoids destroying old and veteran trees during clear-felling and harvesting woodland sites, which promotes habitat preservation."
        },
        {
            "text": "More information on bats can be found on the NRW website. We hope you have a great spooky season!"
        }
    ]
}