{
    "url": "https://hmlandregistry.blog.gov.uk/2024/10/31/are-you-paying-too-much-for-hm-land-registry-services/",
    "title": "Are you paying too much for HM Land Registry services?",
    "authors": [
        "Andrew Robertson, Head of Customer Policy and Service Improvement"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2024-10-31T11:22:29+00:00",
    "content": [
        {
            "text": "If you are looking for information about land or property in England or Wales, you will probably want to explore HM Land Registry  land and property records using our Search for land and property information service. "
        },
        {
            "text": "You may not realise, however, that some private companies re-purpose our information and repackage it into bundles. This can sometimes lead to customers paying more for information they don’t always need. "
        },
        {
            "text": "We are often contacted by people who have bought a title register or title plan from one of these resellers thinking they had been dealing with us. They are surprised to find they could have bought the information they needed directly from HM Land Registry at a lower cost. "
        },
        {
            "text": "This usually comes about when customers look for our website via a web search and click on the first search result they see with the words \"Land Registry\" in the title.  "
        },
        {
            "text": "We are aware that, as a result, some people do not receive the information they believe they have ordered and paid for from us. "
        },
        {
            "text": "They naturally assume the first web search result that comes up is our website, but in practice, by going through search engines, they have reached third-party websites where companies have placed paid-for advertisements that will not lead directly to GOV.UK or our services."
        },
        {
            "text": "Currently, it costs just £3 (£7 from 9 December 2024) each for copies of a title register and plan delivered electronically, and £7 (£11 from 9 December 2024) per document by post. It also costs £7 at present (£11 from 9 December 2024) to obtain a copy of a document we have filed, such as a deed."
        },
        {
            "heading": 2,
            "text": "Don't pay too much"
        },
        {
            "text": "To avoid paying more than you need to for our services, always: "
        },
        {
            "text": "• start on GOV.UK, the official home of government information and services; "
        },
        {
            "text": "• look out for the word \"Sponsored\" if you're using the Google search engine, as these are adverts for third-party services; "
        },
        {
            "text": "• watch out for disclaimer statements in website banners and footers; and "
        },
        {
            "text": "• check for \"gov.uk\" in the domain name (website address), as only government departments can legally use this. "
        },
        {
            "heading": 2,
            "text": "Making it clear who's who"
        },
        {
            "text": "Third parties must not confuse the public into thinking they are transacting with us and are not entitled to use \"Land Registry\" in their domain name. We're aware that some sites use variations to try to get around this and are exploring what we can do to stop them. "
        },
        {
            "text": " If you think you've been misled by a website, please contact us  We keep a log and will take action where appropriate. Our previous actions have resulted in changes being made to some websites and two others being closed down by the UK internet governing body for infringing the use of our name. "
        },
        {
            "text": "Equally, if you believe that an advert is misleading, you can report it to the Advertising Standards Authority. "
        },
        {
            "text": "If you think you have been misled into buying goods or services, you can report it to Trading Standards.  "
        },
        {
            "heading": 2,
            "text": "Guidance and support"
        },
        {
            "text": "If you want to look at your title register or download a copy of your register and plan, we have online guidance to help you, including a YouTube video on how to use Search for Land and Property Information. "
        },
        {
            "text": "You will also find guidance and support online if you are thinking of making a simple application to us, for example to change your name in the register or update your contact address. You can get assistance on our website, GOV.UK, or on YouTube. Our Public Guidance playlist on YouTube contains a host of short video guides to completing our forms and making straightforward applications. "
        }
    ]
}