{
    "url": "https://educationhub.blog.gov.uk/2024/10/31/budget-2024-education-send-childcare-private-schools-vat/",
    "title": "What does the Budget 2024 mean for education?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Primary Schools",
        "School building",
        "Schools",
        "Secondary schools",
        "SEND"
    ],
    "pub_date": "2024-10-31T13:52:15+00:00",
    "content": [
        {
            "text": "On Wednesday 30 October, the Chancellor announced the government's Budget for 2025-26."
        },
        {
            "text": "The Budget is the point at which the amount of money the government spends on public services like health and education is decided."
        },
        {
            "text": "We explain what this year's Budget means for early years providers, schools, colleges and children’s social care."
        },
        {
            "heading": 3,
            "text": "Was funding for early years included in the Budget?"
        },
        {
            "text": "The Budget included investment of an extra £1.8billion into the early years in 2025-26, so the government will be spending over £8billion in total."
        },
        {
            "text": "This money will mean the government can continue the expanded roll out of funded childcare hours for parents of children from 9-months-old, up to 3- and 4-year-olds."
        },
        {
            "text": "There is also £15million to begin delivery of 3,000 school-based nurseries. Schools can bid for up to £150,000 to expand existing nurseries or open a new one."
        },
        {
            "text": "The money is expected to mean 300 new or expanded nurseries open by September 2025."
        },
        {
            "heading": 3,
            "text": "Is there more money for schools in the Budget?"
        },
        {
            "text": "Funding for schools will rise by £2.3billion next year."
        },
        {
            "text": "£1billion of that funding is for high needs, recognising the immense need in the sector. The government is continuing to develop plans to transform England’s Special Education Needs and Disabilities (SEND) system and improve outcomes for young people."
        },
        {
            "text": "This remaining increase to the schools budget will continue to fully fund this summer’s 5.5% pay award for teachers, and help cover pay awards in 2025-26."
        },
        {
            "text": "Despite the investment, there will still be difficult decisions to take on how money is spent right across the public sector - including in schools."
        },
        {
            "text": "We will support schools to use their money more efficiently wherever possible."
        },
        {
            "heading": 3,
            "text": "Will there be new investment in fixing school and college buildings?"
        },
        {
            "text": "For schools, government has committed an additional £1.4billion to make sure the School Rebuilding Programme can continue, which means 100 rebuilding projects starting next year and keeps us on track to rebuild 518 schools in total."
        },
        {
            "text": "A further £2.1billion is being allocated to maintain and improve school buildings, which is an increase of £300million compared to last year."
        },
        {
            "text": "Colleges will receive a further £300million to invest in the further education estate, providing certainty for colleges to plan improvements to their facilities."
        },
        {
            "heading": 3,
            "text": "Will further education receive more funding?"
        },
        {
            "text": "We’re committed to making sure young people have the skills the country needs. That’s why the Budget allocated an additional £300million to further education. We’ll set out in due course how the funds are to be distributed."
        },
        {
            "text": "We’re also taking steps to transform the Apprenticeship Levy into a more flexible Growth and Skills Levy by investing £40million to help deliver new foundation and shorter apprenticeships in key sectors."
        },
        {
            "heading": 3,
            "text": "Is there anything else for education in the Budget?"
        },
        {
            "text": "To support parents, particularly those from disadvantaged backgrounds, we’re significantly increasing investment in breakfast clubs to over £30million, to help ensure children are ready to learn at the start of the school day, and helping drive improvements to behaviour, attendance and attainment."
        },
        {
            "text": "The investment will both support the existing DfE school breakfast programme, used by around 2,700 schools, and support the roll out of our new free breakfast clubs, with the first 750 schools set to be up and running in the spring."
        },
        {
            "text": "There is also £44million for children’s social care, to support kinship and foster carers."
        },
        {
            "text": "The funding will support the trialling a new kinship allowance in up to 10 local authorities to test whether payment to cover certain costs – like supporting a child to settle into a new home with relatives – can help increase the number of children taken in by family members and friends."
        },
        {
            "text": "The funding will also be used to help recruit more foster parents by ensuring that every local authority has access to a regional recruitment hub."
        },
        {
            "text": "The government has confirmed its commitment to further reforms to children’s social care in future spending reviews to make sure every child, irrespective of background, has the best start in life."
        }
    ]
}