{
    "url": "https://environmentagency.blog.gov.uk/2024/10/31/day-in-the-life-of-a-new-environment-officer/",
    "title": "Day in the life of a new Environment Officer",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Nature",
        "Rivers",
        "Sustainability",
        "Water"
    ],
    "pub_date": "2024-10-31T09:19:53+00:00",
    "content": [
        {
            "text": "The Environment Agency (EA) is improving the way the water industry is regulated. This includes expanding the number of our officers focused solely on regulation and compliance. Here, one of the EA’s new dedicated Environment Officers, Rebecca Lee, explains why this area of work is so vital."
        },
        {
            "text": " Every day has been different since I started as an Environment Officer (EO) in the new Water Industry Regulation (WIR) team. From learning how to test for pollutants in our rivers to spending a full day completing inspections no 24 hours are ever the same."
        },
        {
            "text": "My team is led by Sarah Clement-Dawson, with Senior Environment Officer’s (SEO) Josh Laidler and Wendy Ronald, and a total of 9 EOs – 7 being new recruits like myself, and 2 existing EA colleagues who have joined the new team."
        },
        {
            "text": "A day that really shows the variation in the role is an inspection day! Whilst this can be challenging at times, it is extremely rewarding to be able to play a part in keeping our watercourses as healthy as possible."
        },
        {
            "text": "Today, we have an inspection planned at a wastewater treatment works in the Northeast Area. I spend the morning preparing by making myself familiar with the site’s Environmental Permit, the site area, and local water catchment.  After completing pre-inspection checks, I get my Personal Protective Equipment (PPE) and sampling equipment ready and head out to the site."
        },
        {
            "text": "Having notified Northumbrian Water within 24 hours of the inspection, I will greet a representative of the company and shadow our Senior Environmental Officers and Environment Officers as they lead the inspection. This will continue while I develop in my role. We inspect the wastewater treatment works and assess compliance with the site’s environmental permit which sets out conditions under which the site can discharge treated effluent into the river. We take photographs, reference the permit and ask questions about on-site operations and maintenance as we go along. We are assessing if the site is compliant with the permit and looking for any breaches of the conditions."
        },
        {
            "text": "Once we locate the outfall, we check its condition and look for signs of potential issues with how the treatment works is operating. A plume of discoloured water, odour, sewage fungus or foam are some things that could indicate issues with the quality of the final effluent discharged to the river."
        },
        {
            "text": "If required, we take a sample to check water quality. We use a range of sampling equipment to check the quality of our rivers, assessing the dissolved oxygen and ammonia levels in-situ for signs of issues related to wastewater and taking formal samples when necessary. "
        },
        {
            "text": "Finishing up the inspection, we ensure all paperwork is completed and return to the office for post-inspection tasks. If samples have been taken, we make sure these are properly bagged and labelled to be sent to our national laboratory for testing and await their results in the following days."
        },
        {
            "text": "Within 14 days of the inspection being complete, I work with the leading EOs to complete Compliance Assessment Reports which are then sent to Northumbrian Water outlining the outcome of the inspection. These highlight any actions that need to be taken to improve the site and address any breaches of the conditions of the permit appropriately."
        },
        {
            "text": "As an Environment Officer in the new Water Industry Regulation (WIR) team, I spend a lot of my time attending and inspecting lots of different sites and assisting with incidents associated with the water industry. To find out what we are doing to prioritise this work and prevent pollution incidents from happening in the first place, visit How we’re bringing change to water industry performance – Creating a better place"
        },
        {
            "text": "Subscribe to get updates from the Environment Agency delivered to your inbox, or follow us on X. "
        }
    ]
}