{
    "url": "https://gds.blog.gov.uk/2024/10/31/how-design-system-day-makes-our-community-stronger/",
    "title": "How Design System Day makes our community stronger",
    "authors": [
        "Imran Hussain - Community Designer, GOV.UK Design System, Government Digital Service"
    ],
    "categories": [
        "Digital Service Platforms",
        "GOV.UK",
        "Service design"
    ],
    "pub_date": "2024-10-31T15:23:53+00:00",
    "content": [
        {
            "text": "An active community is essential to the GOV.UK Design System. We are a contribution based design system, so continually growing and engaging the community is essential. "
        },
        {
            "text": "Functioning communities do not run themselves, especially those that actively ‘create’ together. That’s where a community designer, like myself, comes in; to build relationships with our users, find out their needs, and work with the team to design solutions. I’m there after things have gone live too, checking that things have landed as intended, feeding back to the team if they haven’t. A community designer is there for the whole user journey but where the community is the service."
        },
        {
            "text": "As a team, we’ve been doing collaborative design for a few years and continue to iterate on our processes. When I joined the team, user research showed that users wanted more visibility of our roadmap and decision-making processes."
        },
        {
            "text": "We’ve been working for years to break these problems down. Part of the solution was the community values we introduced to the team in 2022:"
        },
        {
            "text": "We try to embody these values whenever we interact with our community. That could be on support channels, on monthly calls, workshops and conferences.Design System Day"
        },
        {
            "text": "Design System Day is our annual flagship conference. It started as a way to pick our community up after the summer lull, and it’s proving really effective at doing that. If we have one big-bang event for the year, this is it."
        },
        {
            "text": "We’ve endeavoured to make all forms of contribution more participatory, experimenting with co-design, running open design workshops, crits, and testing sessions. This requires a lot of engagement work and a highly motivated, switched on community. During summer, when people take holidays and spend time with children during their school break, the appetite for extra-curricular activity is muted."
        },
        {
            "text": "We use Design System Day as a re-energiser for the community, it brings focus back onto the design system’s collaborative work and draws even more eyes to our community. The event perfectly aligns with our open-source contribution model and with our community values."
        },
        {
            "text": "Open"
        },
        {
            "text": "The GOV.UK Design System is an open-source platform and the team share our roadmap online. We do regular show and tells at our monthly calls, and we follow this up with a larger showcase at our events."
        },
        {
            "text": "Here’s our showcase from the first Design System Day event earlier this year:"
        },
        {
            "text": "And we encourage the community to share what they are working on too. Inviting"
        },
        {
            "text": "Our community work is all about making people feel that we want active participation in our design system. We have a collaborative philosophy and welcome input in sessions throughout the year. We consider contribution to be anything that helps bolster our community and make it better. This can be attending an event, giving an answer during a discussion, spotting a spelling mistake on our site, sharing how you used a component, through to contributing a new component or pattern."
        },
        {
            "text": "Design System Day is essentially a celebration and showcase of our community. We had an open call for speakers and almost all (9 of 10) speakers came from this call for speakers. We also invited Greg Macoy, a local speaker from Liverpool to speak about working with local charities and making positive change in the area. We like to pay tribute to the city we host in, and talking about local user needs is one way we do that.Transfer of power"
        },
        {
            "text": "To stop our design system being too top-down, it is important to hand over some decision-making authority to our community. After all, most of the components and patterns that sit in our product are contributed by external users. We have an impartial, external panel of experts that make up the GOV.UK Design System Working Group, that have the final say on whether components and patterns are ready to launch. We also now co-design all our components and patterns, running collaborative kick-off sessions, ideations, crits and launches."
        },
        {
            "text": "Design System Day helps that process of transferring power. It is our highlight event of the year, and that’s why we insist on putting our community members front and centre. We essentially create a stage for our community to showcase their work and skills. Every talk is user-pitched, drafted and delivered; much like any other contribution to the design system. The agenda is shaped by the community, for the community, and we love being able to give people that agency."
        },
        {
            "text": "Educational"
        },
        {
            "text": "As with any good community of practitioners, we want members to learn new things from being part of the community. Whether chatting on Slack, sharing examples on Github, or discussing in one of our monthly chats, our community members have the ability to make new connections and share best practice.We encourage collaboration, and one thing that we hope to see is community members working together on new projects and achieving something collectively. On Design System Day, we were lucky to have sustainability lead Ishmael Burdeau talk to us about his drive for services to have public sustainability statements. You can watch Ishmael’s talk here:"
        },
        {
            "text": "We hope it inspires you to take action in your service. You can join the Civil Service Climate and Environment Network and discuss on the Cross-Government Slack channels #sustainability and #green-software-development."
        },
        {
            "text": "Gratitude"
        },
        {
            "text": "We like to say thank you to our community members for the hard work they put into making our product great. We put together stickers, credit people in release notes and send thank you messages to our speakers."
        }
    ]
}