{
    "url": "https://naturalengland.blog.gov.uk/2024/10/31/mapping-our-green-and-blue-spaces-the-green-infrastructure-mapping-project/",
    "title": "Mapping our green and blue spaces: the green infrastructure mapping project",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Development",
        "Environmental Improvement Plan",
        "Flood Management",
        "Green Infrastructure",
        "Mapping",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network",
        "Science and evidence",
        "Uncategorized"
    ],
    "pub_date": "2024-10-31T15:33:05+00:00",
    "content": [
        {
            "text": "Martin Moss, senior officer for green infrastructure mapping, and Sarah Parrott, higher officer for engagement and impact"
        },
        {
            "text": "If you looked at a map of your local area, could you identify the accessible green spaces? What about the blue ones? If not, maybe you should check out Natural England’s newly updated Green Infrastructure Map, which can help you identify these areas."
        },
        {
            "text": "‘Green infrastructure’ can make places more attractive to the people who use them, contribute to nature recovery, and provide natural solutions to issues like poor air quality. It includes a wide range of features, such as parks, street trees, green bridges, private gardens, sustainable drainage systems, and woodlands. Blue infrastructure includes water features, like ponds and rivers."
        },
        {
            "text": "The Green Infrastructure Map shows where these important features are found across England. We've just released version 2.1, quadrupling the map’s content. The map, which is actually many maps combined, is developing all the time as we build upon our datasets."
        },
        {
            "text": "The first version of the map was published in 2021, and in 2022 it won the ‘excellence in geo-visualisation' award at the Geography in Government Awards. The map has received funding from the Natural Capital and Ecosystem Assessment, Defra’s largest research & development programme, which is undertaking a nationwide survey of England’s land, coast and sea. It is a collaboration between Natural England, Defra, the University of Manchester and the Rivers Trust."
        },
        {
            "text": "Supporting more green infrastructure, in the right places"
        },
        {
            "text": "The Green Infrastructure Map is a key tool to support Natural England’s Green Infrastructure Framework, and the government’s commitment for everyone to live within 15 minutes’ walk of a green space. Launched in January 2023, the Framework provides local authorities and developers with principles and standards to help them improve green and blue infrastructure. It defines what good green infrastructure looks like, helping them plan strategically to deliver multiple benefits. It includes standards for:"
        },
        {
            "text": "The Green Infrastructure Map is designed to meet many of the data needs of these standards. For example, it was recently used to allocate funding from the £9 million Levelling Up Parks Fund. It also underpins many other commitments, including local nature recovery strategies. The map may help identify gaps in green infrastructure which the biodiversity net gain process could fill, helping to target gain in nature-deprived areas."
        },
        {
            "text": "What’s new in Version 2.1?"
        },
        {
            "text": "Version 1 of the Green Infrastructure Map provided every local authority in England with evidence they need to develop local green infrastructure strategies. It included data on green and blue infrastructure assets, access to greenspace and the Public Rights of Way system."
        },
        {
            "text": "Version 2.1 updates much of the original content, including Census data and maps showing inequalities in access to greenspace related to socio-economic factors. The update also adds new data to support nature recovery and look at the proportion of green cover in urban areas. Two new maps show data from the People and Nature Survey: perceptions of improvement of local greenspace and visits to them in the last 14 days. For some cities, including Greater Manchester, the update incorporates some experimental data. This includes new maps of urban habitats, urban heat, air quality and urban food production. These give more data for developing local nature recovery strategies and show how green infrastructure meets communities' needs. Including this data will support future development, to potentially roll out these maps over more areas."
        },
        {
            "text": "The green infrastructure map in action: connecting communities with green spaces"
        },
        {
            "text": "The green infrastructure map is being used in a wide range of ways in both national and local projects. One example is Culture Nature England, the third collaborative project between Natural England and Libraries Connected. This supports libraries to help people rediscover nature, enhance their wellbeing and contribute to nature recovery in urban landscapes. It also funds nature connection training for library staff so that they can run nature engagement activities. The project uses the green infrastructure mapping database to generate interest, exchange information and consider opportunities for local landscapes. Between September 2024 and March 2025, they will work with up to 30 libraries across England."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "The update means that Natural England can now compare the map’s data to that found in the previous version, to see how England’s green infrastructure is changing over time. This exercise will be repeated every five years, helping us understand whether we’re meeting our goals to improve access to nature and other green infrastructure benefits."
        },
        {
            "text": "To find out more about the new update, and how Green Infrastructure Mapping can support your work, join our webinar: "
        },
        {
            "text": "Green Infrastructure Framework: Mapping Database Version 2.1 Tickets, Tue, Nov 5, 2024 at 10:00 AM | Eventbrite "
        },
        {
            "text": "You can also get in touch with us at enquiries@naturalengland.org.uk"
        },
        {
            "text": "The map brings together data from many sources, who all want the most accurate data possible. You can help by reporting any errors, as described in the Mapping User Guide."
        }
    ]
}