{
    "url": "https://moderncivilservice.blog.gov.uk/2024/10/31/meet-the-modern-civil-service-ed-mccutcheon-government-chief-architect-central-digital-and-data-office/",
    "title": "Meet the Modern Civil Service: Ed McCutcheon, Government Chief Architect, Central Digital and Data Office",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Digital and data",
        "Innovation",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-10-31T09:17:11+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What does a Modern Civil Service mean to you?"
        },
        {
            "text": "There’s so much potential for the future Civil Service and the impact we could have. I'm particularly interested in how we can use digital, data and AI across the government. We have amazing digital teams in the public sector, and the technology continues to move at pace, so we have no idea what we’ll be doing with the tech in the future; but that’s pretty exciting because we're going to discover it together."
        },
        {
            "heading": 2,
            "text": "Tell us a little bit about your career journey in the Civil Service"
        },
        {
            "text": "I started as a graduate in a HEO software engineering job. Over the years, through building technology, running technology teams and designing new digital services, I began to care about the technology people agenda. I was asking questions like ‘who are we going to recruit into digital?’ and ‘how are we going to look after our digital people?’ which led me into a bunch of roles, and I'm now a senior civil servant thinking about our ambitions for the digital architecture of government in the future. I’d love for people reading this to take away that you can be a deep technologist and be a senior civil servant, using your technical skills every day."
        },
        {
            "text": "What advice can I share? One of the most powerful tools is coaching: I can rattle off a list of people that I'm super proud to have grown, who have got promoted within the Civil Service and are now grade 7s and grade 6s. There's even one who is now a Chief Technology Officer. I’ve coached individuals during some of the hardest decisions in their career, and it's really rewarding to see them flourish now."
        },
        {
            "heading": 2,
            "text": "What’s the best part of your job?"
        },
        {
            "text": "One of the really unusual things about my current role is the number of foreign governments we interact with, because the Civil Service has adopted digital in a way that others want to follow. "
        },
        {
            "text": "This week for me it's Brazil and my colleague is in Canada. I had to decide last week which of me or a colleague were going to Tokyo to talk to the Japanese government. I have also ended up in the US, including in the White House, discussing future technology roadmaps."
        },
        {
            "text": "That's the importance of the digital agenda to other countries, and they look to us for expertise. So we are paving the way for governments around the world to do digital government and digital deployments across civil services."
        },
        {
            "heading": 2,
            "text": "What is the ‘Get Cloud Certified’ programme?"
        },
        {
            "text": "In the Central Digital and Data Office (CDDO), which is now part of the Department for Science, Innovation and Technology, we’re driving a modern digital government agenda. One of the big challenges that we have, but also that the entire global market has, is we don't have enough digital skills to achieve our ambitions."
        },
        {
            "text": "The Get Cloud Certified Programme is designed to help all civil servants, regardless of job role or previous experience, to complete a cloud certification and gain digital skills. I'm an advocate of everybody learning something about digital - it could be applied to your policy problem, your operational delivery problem or your HR problem."
        },
        {
            "text": "We are enthusiastic about providing upskilling opportunities for people from under-represented communities, whether it be gender or other protected characteristics, into digital roles. These include CloudUp for Her, TechHer for Government, and digital apprenticeship schemes."
        },
        {
            "heading": 2,
            "text": "One Big Thing 2024 is about innovation. How is CDDO helping to foster that spirit of innovation?"
        },
        {
            "text": "We are currently supporting colleagues across government to experiment with AI tools that are embedded in the software that they use. "
        },
        {
            "text": "We’re about to start a trial of AI to help software engineers - we call that AI Coding Assistants. We hope to see how AI can work alongside civil servants to transform the way they work, and to give colleagues a chance to see AI in action as a civil servant at their desk."
        },
        {
            "heading": 2,
            "text": "How can civil servants who are interested, but not deep technologists, get into a digital role?"
        },
        {
            "text": "Last year we launched the Government Digital and Data Civil Service Careers Hub. You can see all the roles available there, and various routes into them including apprenticeships and Fast Stream opportunities. It’s an exciting time to join Government Digital and Data - the community that drives digital transformation in government.  Digital colleagues are a crucial part of every Civil Service department, whether you’re analysing attendance data at schools or designing technology to read passports. On top of these technical roles, you can be a leader. There is an exciting offer for digital people who want to get more senior and the Modern Civil Service supports that. You can also subscribe to our Central Digital and Data blog and follow us on LinkedIn to find out all the latest digital transformation news happening across government."
        }
    ]
}