{
    "url": "https://homeofficemedia.blog.gov.uk/2023/08/29/a-history-of-the-uk-passport/",
    "title": "A history of the UK passport",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-08-29T06:00:29+01:00",
    "content": [
        {
            "text": "For the first time in 70 years, British passports bearing the title of ‘His Majesty’ will start being issued this week in the name of His Majesty King Charles III, the Home Secretary has announced."
        },
        {
            "text": "You can find out more about the new salutation in our press notice on Gov.UK. More information about the history of the UK passport can be found below."
        },
        {
            "text": "1414 – The earliest recorded British passport can be traced back to documents known as safe conducts. These appeared in an Act of Parliament under the reign of Henry V."
        },
        {
            "text": "1540 – The Privy Council, which advises the monarch, granted passports from at least 1540."
        },
        {
            "text": "1641 – The oldest passport still in existence was issued on 18 June 1641 and signed by Charles I."
        },
        {
            "text": "1778 – Until 1778 passports were written in English and Latin. After this date, they were issued in French which was the language of diplomacy at the time."
        },
        {
            "text": "1794 – All passports began to be issued by the Principal Secretary of State for Foreign Affairs, who we would now call the Foreign Secretary. Previously all passports would have been issued and signed by the King and Queen."
        },
        {
            "text": "1915 – The first modern-style British passports, including a photograph and signature were first issued. They were made of a single piece of paper that folded out and sat between cardboard covers."
        },
        {
            "text": "1921 – The first blue passport in the format of a book was issued in 1921, it had 32 pages and was written in French."
        },
        {
            "text": "1947 – The final passports issued bearing the signature of the Foreign Secretary were issued."
        },
        {
            "text": "1968 – UK passports began to be issued with validity for ten years, double the previous validity."
        },
        {
            "text": "1972 – The first security feature was introduced to the passport – a special watermark. Laminated photographs would follow in 1975 and further security features in the 1980s."
        },
        {
            "text": "1988 – The first burgundy coloured machine-readable passports were issued in the UK following the common format introduced by the European Economic Community."
        },
        {
            "text": "1998 – The first digital UK passport was introduced which included a digital image of the photograph and signature."
        },
        {
            "text": "2006 – The first biometric passports were issued with an electronic chip featuring the holder’s data."
        },
        {
            "text": "2008 – The first e-Passport gates were introduced in the UK. There are now around 240 ePassport Gates operational, covering 21 air and rail terminals, helping to speed up arrivals and improve border security."
        },
        {
            "text": "2016 – The passport renewal process went entirely online for those aged 26 and over."
        },
        {
            "text": "2017 – We recently announced that all those over the age of 16 can now renew their passport online."
        },
        {
            "text": "2019 – The new blue passport will be phased in from October 2019, in line with the new passport contract."
        },
        {
            "text": "2023 – For the first time since 1952, passports are issued under the title “His Majesty”, in the name of King Charles III."
        },
        {
            "heading": 4,
            "text": "Sign up for email alerts and follow us on Twitter."
        }
    ]
}