{
    "url": "https://civilservice.blog.gov.uk/2023/08/29/celebrating-east-and-south-east-asian-heritage-month/",
    "title": "Celebrating East and South East Asian Heritage Month",
    "authors": [
        "Michelle Chan,"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-08-29T12:40:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "As September awaits around the corner, civil servant Michelle Chan explores East and South East Asian (ESEA) Heritage Month and its significance within the Civil Service and in wider society"
        },
        {
            "text": "September takes on a lot of meaning for many. Autumn is ushered in with its vibrant colourful fall of leaves, bringing cosy nights in as we enjoy a nice cup of tea. Its long dark nights can signal the countdown for Christmas for many of us."
        },
        {
            "text": "In a similar vein, the Civil Service Race Forum’s (CSRF) ESEA Working Group is eagerly counting down the days until September. The reason being as it’s a month-long commemoration of East and South East Asian heritage."
        },
        {
            "text": "ESEA Heritage Month"
        },
        {
            "text": "Did you know there are many countries that make up the ESEA region? These include Brunei, Burma (Myanmar), Cambodia, China, Hong Kong, Indonesia, Japan, Laos, Macau, Malaysia, Mongolia, North Korea, Singapore, South Korea, Taiwan, Thailand, the Philippines, Timor-Leste, and Vietnam. That’s a rich mix of cultures, identities, heritages, roots, languages, and more with some currently existing within the Civil Service."
        },
        {
            "text": "Compared to other months commemorating other cultures, ESEA Heritage Month is in its infancy with 2023 being its third year in the UK. This is the second year it’s being celebrated in the Civil Service. While it’s not officially recognised, it’s fast growing and being recognised across Civil Service diversity & inclusion groups, local communities, and wider society. "
        },
        {
            "text": "Commemorate and celebrate"
        },
        {
            "text": "A group of ESEA individuals formed ESEA Heritage Month, commemorating those who have contributed positively to British society and celebrating the richness of ESEA culture."
        },
        {
            "text": "ESEA heritage and history aren’t mainstream topics. Having done some research, many ESEA civil servants weren’t aware of poignant events affecting ESEA people, and nor were they aware of Frank Soo, the first ever British footballer to have ESEA heritage. "
        },
        {
            "text": "Shining a spotlight"
        },
        {
            "text": "Thankfully, we have a cross-government Working Group shining more of a spotlight on ESEA stories previously hidden in society. Its membership encompasses Civil Servants from multiple departments, other government departments, and arms-length bodies. Membership has grown to over 300 in the past two years alone. "
        },
        {
            "text": "This group was founded in 2021 and is a space where ESEA civil servants and allies can discuss, celebrate, and promote cultures. Within the UK and globally, there is wider awareness and celebration of ESEA cultures. This is seen in the US with the Asian American and Pacific Islander Heritage Month taking place every May."
        },
        {
            "text": "The founders and current committee members recognise the importance of building solidarity and acknowledge the significant impact the ESEA community has in the Civil Service and wider afield."
        },
        {
            "text": "Celebration time!"
        },
        {
            "text": "On 5 September, come and join our flagship hybrid launch event in London where we’ll be celebrating the Working Group’s achievements and hearing from members about what this special month means to them. "
        },
        {
            "text": "In collaboration with over five government departments, we’ll be holding other events including: "
        },
        {
            "text": "We hope you all can attend and celebrate the rich and colourful histories of the diaspora which this expansive part of the continent has brought to the world today. "
        },
        {
            "text": "If you’re interested in joining the ESEA Working Group, please complete our registration form.  "
        }
    ]
}