{
    "url": "https://dwpdigital.blog.gov.uk/2023/08/29/developing-wonderful-people/",
    "title": "Developing Wonderful People  ",
    "authors": [
        "Josh Bhogal"
    ],
    "categories": [
        "Digital transformation",
        "Digital With Purpose",
        "Learning at Work"
    ],
    "pub_date": "2023-08-29T15:24:42+01:00",
    "content": [
        {
            "text": "Josh is a student at Notre Dame College in Leeds, studying Digital Production and Design at T-level. He recently brought his skills to DWP Digital as part of our work placement programme.   "
        },
        {
            "text": "I joined DWP Digital earlier this year and going in, I didn’t know what to expect. My mind was full of so many questions that were quickly answered by the great team that I was introduced to. Over the course of my placement at DWP Digital I felt nothing but welcomed and appreciated for the work that I was producing.  "
        },
        {
            "text": "I was interested in applying as I could see that DWP Digital was very different to my previous workplaces. I knew that being here, I would learn so many new skills that I could apply to many different situations, both in and outside of my time at DWP Digital. "
        },
        {
            "heading": 2,
            "text": "An ambition to learn "
        },
        {
            "text": "As part of my nine-week placement I was tasked with developing a system that could be used in Jobcentres to help customers find a job quickly using their mobile phones. The task included doing this without developing an app in order to make the system more widely accessible.  "
        },
        {
            "text": "I began work developing a digital jobs dashboard that would replace the old paper dashboard currently used in job centres.  "
        },
        {
            "text": "I used different coding IDE’s (integrated development environments) which allowed me to create the digital job board that I was able to use and demonstrate at Pudsey Jobcentre. I was also fortunate enough to test the digital job board within the Quarry House office to get feedback from colleagues.  "
        },
        {
            "text": "Developing a basic understanding of JavaScript in this role allowed me to expand my coding knowledge and was directly applied to the project. As a result, the dashboard has been developed with the ability to pull live job information from ‘Find A Job’ and display them in a meaningful way. QR codes are included for customers to scan to get further information on their mobile phone. "
        },
        {
            "heading": 2,
            "text": "Providing impact to customers "
        },
        {
            "text": "Developing the dashboard reduced the risk of roles becoming quickly out of date and ensured the latest technology was used. It reduces time searching and helps customers as soon as they step into the Jobcentre rather than having to wait to be served. "
        },
        {
            "text": "Having something that looks complete was rewarding and meant that I was able to test the system out on people and see if it works for them. It also provided me with an opportunity to get their thoughts on improvements. I’ve had some excellent feedback so far and am so glad it works for customers. "
        },
        {
            "heading": 2,
            "text": "Showcasing my development "
        },
        {
            "text": "I presented my work to CDIO (Chief Digital and Information Officer) Rich Corbridge and Universal Credit Digital Director, Paul Francis at a recent visit to Pudsey Jobcentre. "
        },
        {
            "text": "After seeing the digital jobs dashboard Rich Corbridge said: “I’m so impressed with the work Josh has done in such a short space of time. He’s obviously a real talent. This is really great product. In the Jobcentres I’ve visited recently this kind of thing is on the top of their lists to help customers.” "
        },
        {
            "text": "My line manager Chris was also there and said: “Josh has exceeded expectations in what he achieved in just nine weeks. Colleagues and I shared an initial vision of the needs that digital jobs boards could meet, and provided support and feedback throughout, but he stepped up to lead this project. His prototype was used unprompted by real customers, generated lots of valuable feedback, and we already have plans to trial it in another four sites”. "
        },
        {
            "text": "I’ve learnt so much being in Digital Group – coding skills and working in a team – it’s the best thing I’ve ever done!  "
        }
    ]
}