{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/08/29/neptune-guardians/",
    "title": "NEPTUNE GUARDIANS",
    "authors": [
        "blythevictor"
    ],
    "categories": [
        "Defence Academy",
        "Gibraltar",
        "Overseas Bases",
        "Personnel",
        "Training",
        "Uncategorized"
    ],
    "pub_date": "2023-08-29T11:09:57+01:00",
    "content": [
        {
            "text": "Two members of British Forces Gibraltar joined their Scottish counterparts in a force protection exercise known as Neptune Guardian at the Kings Bay Naval Base, USA. The exercise takes place\ntwice a year and involves the Faslane Patrol Boat Squadron, the Clyde Marine Unit, and 43 Commando."
        },
        {
            "text": "Hosted by the US Coastguard at the state-of-the-art Trident Training Facility, the exercise sees the multiple agencies that work together on the Clyde come together to train them to deal with every\neventuality during force protection operations."
        },
        {
            "text": "The Royal Navy Gibraltar Squadron and the Gibraltar Defence Police conduct like-for-like operations, escorting high-value units in and out of HMNB Gibraltar. Both were represented at the latest\niteration of Exercise Neptune Guardian alongside their opposite numbers, who are based at HMNB Faslane."
        },
        {
            "text": "The Commanding Officer of HMS DAGGER and a Chief Inspector from the Gibraltar Defence Police deployed to the USA for 10 days to see the facilities and training that can be achieved at the Kings Bay simulator. The pair took part in the scenarios and had their skills tested by the variety of challenges they faced. Both are key members of the command and control of an escort operation; however, the trainer also allows all other members, from coxswains to weapon directors, to hone their skills."
        },
        {
            "text": "The Commanding Officer of HMS DAGGER said, \"We are separated from our Scottish counterparts only by geography, and the benefit of us coming together to share our experiences at this state-of-the-art facility is invaluable to both the Gibraltar and Faslane teams\"."
        },
        {
            "text": "British Forces Gibraltar aim to conduct their own training alongside the US Coastguard in the future to ensure they remain at the peak of operational capability. The level of protection that can be\nprovided to visiting warships, submarines, and other high value units, coupled with the engineering and logistical support, makes HMNB Gibraltar the perfect strategic location for vessels entering, operating in, and exiting the Mediterranean Sea."
        },
        {
            "text": "Chief Inspector Chellaram said, \"This was a great learning experience and training opportunity, not only to work in a cutting-edge facility, but the rare opportunity to have such a broad range of\nexperience and expertise in a single exercise was priceless.\""
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}