{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/08/29/our-tips-and-tricks-for-back-to-school-shopping/",
    "title": "Our tips and tricks for Back-to-school shopping",
    "authors": [
        "Paul Kellaway"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2023-08-29T13:50:58+01:00",
    "content": [
        {
            "text": "The start of the school year is fast approaching for children and parents, and it is more important than ever with the rising costs of living and inflation to make informed choices when last-minute shopping for back-to-school supplies."
        },
        {
            "text": "There are school-run, government-backed and local authority support schemes to help with the back-to-school shop and make your money go the extra mile. But it is hard to know where to find the best deals and what red flags to look out for which can help you save much needed time and money as well as anxiety and stress."
        },
        {
            "text": "Here are some useful tips and tricks to help you when shopping online and instore for back-to-school supplies."
        },
        {
            "heading": 3,
            "text": "Know what you need and shop around"
        },
        {
            "text": "Make sure you understand what your school’s uniform policy is and especially what items need school branding and where they can be bought from. Even if you can only buy branded items from one place, make sure you find the best deals for everything else. Remember that for many items you do not need to buy from a school’s approved shop."
        },
        {
            "heading": 3,
            "text": "Pressure selling"
        },
        {
            "text": "Some retailers might make you rush into paying by saying that stock is low, lots of people are looking right now, or that it’s only available for a limited time. This is not always true. So, take your time to compare prices and availability on other sites, and ignore sales tactics that pressure you."
        },
        {
            "heading": 3,
            "text": "Fake reviews"
        },
        {
            "text": "Some businesses pay or reward people for positive reviews, so don’t believe everything you read. Fake reviews are difficult to spot, so try reading the negatives as well and find reviews on multiple sites. If it’s too good to be true, it probably is."
        },
        {
            "heading": 3,
            "text": "8 things to keep in mind"
        },
        {
            "heading": 3,
            "text": "More information on back-to-school shopping: "
        },
        {
            "text": "You may be eligible to receive financial help of a grant up to £200 to help with uniform costs. You can see if you are eligible by entering your postcode online at Gov.uk which will take you to your local council."
        }
    ]
}