{
    "url": "https://hmlandregistry.blog.gov.uk/2023/08/29/seamless-property-transactions-vision-or-reality/",
    "title": "Seamless property transactions – vision or reality?",
    "authors": [
        "Konrad Rotthege, Co-founder, Conveyo"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2023-08-29T14:49:22+01:00",
    "content": [
        {
            "text": "Conveyo is currently a participant in the Geovation Accelerator Programme – a programme backed by HM Land Registry and Ordnance Survey which provides geospatial and property technology (PropTech) start-ups with grant funding and 12 months of support. "
        },
        {
            "heading": 2,
            "text": "Why create Conveyo?"
        },
        {
            "text": "Conveyo prepares properties to be legally ready before listing, making home sales more certain and efficient."
        },
        {
            "text": "I founded Conveyo in 2022 with data scientist Andrea Monti Solza. Our objective was to help home movers sell without hassle and buy with confidence."
        },
        {
            "text": "As a property lawyer, I've been through the nitty-gritty of property transactions myself. It became clear to me that there had to be a smarter way to handle things by blending legal know-how with technology."
        },
        {
            "text": "At Conveyo, we believe technology, in particular data-driven conveyancing, will play a crucial role for property transactions going forward. However, while some firms already embrace technology in some way, others still operate manually or on paper. The reality is that these manual workflows consume valuable time and erode hourly rates, potentially compromising the competitive edge of these firms."
        },
        {
            "heading": 2,
            "text": "How does Conveyo help property transactions?"
        },
        {
            "text": "Conveyo ensures frictionless property transactions by collecting all required data early in the process and sharing it with stakeholders through its digital conveyancing platform. For customers, Conveyo offers a tailored concierge service around their transaction. Often, home sales are not easily accessible to individuals, leaving them unsure what to do and who to trust. Conveyo steps in as their trusted partner guiding sellers and buyers towards a seamless transaction."
        },
        {
            "text": "Through its network, Conveyo helps customers to find the best-fit estate agent and solicitors for their transaction. Beyond that matchmaking, Conveyo coordinates the entire transaction, handles the legal workstream and provides automated communications between all parties, making sure everyone is on the same page without the need for update calls."
        },
        {
            "text": "With Conveyo, everybody wins - sellers and buyers transact without hassle and with more confidence while solicitors save time and increase their profitability."
        },
        {
            "heading": 2,
            "text": "How Conveyo uses location data"
        },
        {
            "text": "Conveyo’s digital conveyancing platform sources data from over 100 data points, incorporating data from HM Land Registry and Ordnance Survey. These datasets include HM Land Registry’s local land charges, restrictive covenants, registered leases and price paid information. Together with Ordnance Survey’s address base, we can paint a comprehensive picture about the property and its surroundings."
        },
        {
            "text": "At Conveyo, we believe that the more accessible property data becomes, the better use can be made of it, empowering a data-driven property market."
        },
        {
            "heading": 2,
            "text": "The benefits of taking part in the Geovation programme"
        },
        {
            "text": "The experience we have gained in Geovation has been incredibly valuable so far. It has provided us with access to a network of experts and like-minded individuals who understand our business and are helping us turn our vision into reality."
        },
        {
            "text": "Geovation also provides us with exposure to potential customers, investors, and collaborators within the PropTech sector, allowing us to expand our network and pursue new market opportunities. Being part of the Geovation Accelerator Programme is a validation of our approach to improving the house buying and selling process."
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "We are actively exploring the integration of artificial intelligence into our platform, which aims to further foster collaboration among consumers, estate agents and conveyancers. We are particularly excited about HM Land Registry’s efforts to transform Local Land Charges (LLC) information, as it forms part of our service. More importantly, we are keen to have a complete digital LLC register because it will greatly support well-informed and efficient property transactions, making home buying faster and more affordable."
        },
        {
            "text": "We want to help estate agents and conveyancers by offering a gateway that leverages technology, allowing them to unlock invaluable time efficiencies."
        },
        {
            "text": "Against this backdrop, we are working on increasing our capacity to process larger transaction volumes by expanding our technology and team."
        },
        {
            "text": "If you’re interested in finding out more, visit www.conveyo.io"
        }
    ]
}