{
    "url": "https://planninginspectorate.blog.gov.uk/2023/08/29/the-planning-inspectorate-and-springboard-providing-opportunities-for-young-people/",
    "title": "The Planning Inspectorate and Springboard, providing opportunities for young people",
    "authors": [
        "Sarah North"
    ],
    "categories": [
        "People",
        "Public service",
        "Recruitment"
    ],
    "pub_date": "2023-08-29T13:49:46+01:00",
    "content": [
        {
            "text": "Imagine for a moment that you are a 16 year old from a small village in Northumberland or from a city – maybe Leeds or Birmingham. You work hard at school, but you’re not actually sure how you will fit into the “workplace” that your teachers keep mentioning, or what your future might hold. You have never really stayed away from home on your own."
        },
        {
            "text": "Imagine then that you have an opportunity to travel to London, for a week, with a peer group of your own age, who you have never met. You will stay at one of the world’s most prestigious universities (LSE) and work with a team of professionals at the top of their game, to find ingenious solutions to real world issues."
        },
        {
            "text": "The Springboard Programme has been providing opportunities for young people from all backgrounds to tackle the world’s biggest challenges, by advancing social mobility through innovation, since 2018."
        },
        {
            "text": "This year I was fortunate to be part of the Planning Inspectorate team who joined five other “clients” in preparing a brief for the students to tackle in small groups, guided by PA Consulting’s expert teams and project managers."
        },
        {
            "text": "The UN Sustainable Development Goals provide 17 global targets to promote peace and prosperity, while protecting our environments and it was on these targets that the briefs were focused."
        },
        {
            "text": "After a couple of video calls during the course of the week, to answer questions and check progress, I was able to attend the final presentations at PA’s London offices, with Jade Woodger-Bassford, one of our own Environmental Impact Assessment work placement students, who wrote the Planning Inspectorate brief on Goal 15 – Life on Land. Unbeknown to the students, our CEO Paul Morrison also attended."
        },
        {
            "text": "To stand up and present to a prestigious London boardroom full of experienced business people might give even the most seasoned Ted-Talker a few butterflies beforehand. To travel to London for a week, aged 16 or 17, for the very first time in your life and present your ideas to that room full of professionals was, in itself, a truly outstanding achievement for these young people."
        },
        {
            "text": "Their grasp of the subject matter and the ingenuity which they applied to solving the problems before them, in order to present an engaging, cohesive and workable real world solution left no one in any doubt that the world’s Sustainable Development objectives are in safe hands with the next generation."
        },
        {
            "text": "Ideas included a metaverse AI learning and development platform and a biodiverse and carbon neutral countryside project, benefitting the entire community."
        },
        {
            "text": "Each team received great feedback from their clients, from the PA team and from the UK charity partners - the Social Mobility Foundation."
        },
        {
            "text": "There was then a chance for the students to meet the clients over refreshments and confide in us how nervous they had been (it didn’t show!) and what an amazing experience the past week had been “the best week of my life!” exclaimed one 17 year old. Our team really appreciated the feedback and were particularly excited to meet the Chief Executive of the Planning Inspectorate  – but said they would have been far more nervous beforehand, had they known he was in the audience!"
        },
        {
            "text": "The bonds they had created with each other over the week were clearly strong and after evening activities going bowling and to the cinema, the week was rounded off in style with a Thames River boat cruise party, to celebrate their outstanding achievements."
        },
        {
            "text": "This was my third year in the Planning Inspectorate, supporting Springboard, but our first opportunity to be involved in person. Jade has already recorded a presentation which she delivered to the whole organisation at our All Staff Briefing. The programme is incredibly rewarding and inspiring for everyone involved – no wonder PA say it is their favourite week of the year!"
        },
        {
            "text": "Next year the plan is for Springboard to become an accredited programme; it has provided more than 250 young people in the UK, and now also the US, with the opportunity to access work experience, mentorship and support. I’m looking forward to next year’s event already!"
        }
    ]
}