{
    "url": "https://naturalengland.blog.gov.uk/2025/08/18/from-fences-to-freedom-englands-continuing-beaver-journey/",
    "title": "From fences to freedom: England’s continuing beaver journey",
    "authors": [
        "Delphine Pouget",
        "Stuart Otway"
    ],
    "categories": [
        "Licensing",
        "Natural England",
        "Nature",
        "Nature-based solutions",
        "Species re-introductions"
    ],
    "pub_date": "2025-08-18T11:02:05+01:00",
    "content": [
        {
            "text": "By Stuart Otway, Principal Officer in Natural England’s Complex Cases Team and Delphine Pouget, Principal Officer in Natural England’s Species Recovery & Reintroductions Team"
        },
        {
            "text": "In February 2025 Defra published its landmark policy on the wild release and management of beavers in England. "
        },
        {
            "text": "Beavers are considered a keystone species because they help create and restore wetland habitats, boost biodiversity and reduce downstream flooding. Their reintroduction is an important step toward meeting the government's species abundance and extinction targets.  "
        },
        {
            "text": "This announcement enabled the first licensed beaver wild release at Purbeck in Dorset, and allowed us to invite further ‘expressions of interest’ (EoIs). As part of our national beaver reintroduction journey, we are also moving away from enclosures, so we can focus efforts on successful wild release projects, and the growing wild populations."
        },
        {
            "heading": 4,
            "text": "High Interest in Wild Release "
        },
        {
            "text": "We received 39 EoIs for wild beaver release across England, including some for our largest river systems. The high volume of interest has meant a slightly longer review process, but we’re nearing completion. The feedback we're providing is designed to help applicants improve their proposals and speed up the full application process."
        },
        {
            "text": "So far, we've invited eight to submit full applications.  These projects are located in the south-west or south-east of England and include proposals from wildlife trusts, the National Trust, and a landscape recovery partnership.  Cornwall Wildlife Trust has already submitted the first full application for the Fowey and Par catchments.  "
        },
        {
            "text": "The majority of EoIs were considered ‘potentially viable projects’ and we offered detailed feedback to help them strengthen their proposals. A small number of EoIs were deemed unlikely to meet the criteria, mainly because they were too small in scale. We’ve encouraged these applicants to form or join catchment-wide partnerships.  "
        },
        {
            "heading": 4,
            "text": "A Measured Approach to Reintroduction "
        },
        {
            "text": "Natural England’s and Defra’s goal is to enable a measured pace of beaver reintroduction, prioritising well-planned and well-resourced projects where the benefits outweigh the risks. This gradual approach allows local communities and infrastructure time to adapt, building trust and ensuring that beavers become a permanent and valued part of the landscape.   "
        },
        {
            "text": "We will review our EoI process and invite new EoIs in 2026. In the meantime, we expect to make the first full application decisions this autumn, well before the next breeding season."
        },
        {
            "heading": 4,
            "text": "Moving away from beaver enclosures  "
        },
        {
            "text": "We are now moving away from the use of beaver enclosures to focus on successful wild release projects and the growing wild beaver population. While enclosures have been invaluable for public education and gathering data on beavers, the ultimate goal is to see them thrive in their natural habitats. "
        },
        {
            "text": "Our updated guidance for licensing new enclosures or renewing existing enclosures sets out clear criteria, such as the requirement for exceptional environmental benefits that cannot be achieved by other means. Projects must also have a strong design, community engagement, long-term monitoring, and a robust exit strategy.  "
        },
        {
            "text": "We will continue to renew licences for existing enclosures that can demonstrate significant benefits and maintain high standards of welfare. This shift from enclosures to wild releases is a key step in helping beavers fulfil their role as ecosystem engineers in England's landscape. "
        }
    ]
}