{
    "url": "https://environmentagency.blog.gov.uk/2025/08/18/from-fish-to-rare-crayfish-englands-drought-wildlife-rescue-operations/",
    "title": "From Fish to Rare Crayfish: England’s Drought Wildlife Rescue Operations ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Drought"
    ],
    "pub_date": "2025-08-18T13:43:50+00:00",
    "content": [
        {
            "text": "Fisheries teams across England respond as drought and prolonged dry weather puts aquatic life at risk. "
        },
        {
            "text": "England’s driest start to the year since 1976 is severely impacting waterways. While Environment Agency fisheries officers work with partners to help fisheries prepare for extreme conditions, teams have needed to step in with emergency rescues as rivers shrink and water temperatures soar. Fish are often the first casualties when conditions deteriorate, but they’re not alone – birds, insects, and aquatic plants are all struggling as their habitats disappear.  "
        },
        {
            "text": "This summer, EA teams have rescued fish from critical situations, including 1,500 fish relocated from a single brook near the River Lea, and 50 brown trout given new homes in deeper waters of the River Lambourn in Berkshire. In Yorkshire, teams have also rescued a critically endangered species, saving 32 native white-clawed crayfish, including 21 females carrying eggs, from dried-out riverbeds.  "
        },
        {
            "text": "Preparing for the worst "
        },
        {
            "text": "The Environment Agency works year-round with angling clubs and fisheries to prepare for dry weather and drought conditions. This partnership approach, developed over the last decade with organisations like the Institute of Fisheries Management, focuses on better fishery design, management practices, and installing aeration equipment to prevent fish losses. "
        },
        {
            "text": "These efforts have helped minimise the impacts of this year’s drought, particularly for stillwater fisheries which are most vulnerable to low oxygen levels. We have offered grants through our Angling Improvement Fund for fisheries to buy their own aeration equipment, and this has paid dividends for many of these waters. By working proactively with fishery operators, many potential rescues have been prevented before they become emergencies. "
        },
        {
            "text": "When troubles multiply "
        },
        {
            "text": "Sometimes problems combine to create emergencies despite best preparations. At Eastnor Park Estate in Herefordshire, a pond leak became a critical emergency when drought conditions prevented natural recovery. The small stream that feeds the estate's four connected pools had completely dried up, and evaporation made the situation worse. "
        },
        {
            "text": "Fish became stranded in just 30 square metres of remaining water, with larger carp having their backs exposed and smaller fish showing clear signs of distress. Working with the estate and local fishing syndicate, EA officers carefully captured and relocated approximately 100kg of fish, including carp, roach and perch, to safer waters downstream. "
        },
        {
            "text": "“The Environment Agency team’s quick response made all the difference,” said Shaun, a local angler. “We were delighted to help save these fish stocks that are so important to our fishery. It was a mucky job but absolutely worth it to protect the fish.” "
        },
        {
            "text": "Rescue kit essentials "
        },
        {
            "text": "Environment Agency fisheries officers use specialist equipment during emergency operations. Using seine nets, dip nets, and oxygenated transport tanks, teams work quickly to capture and relocate distressed fish to a suitable habitat. "
        },
        {
            "text": "The operations require careful assessment; officers must ensure rescued fish are healthy enough to survive relocation and that receiving waters can support additional fish populations. This expertise proves crucial during emergencies. "
        },
        {
            "text": "Saving endangered species "
        },
        {
            "text": "Rescues can reveal unexpected discoveries. At Burley in Wharfedale, Yorkshire, a member of the public reported crayfish in distress as their watercourse dried up. EA teams arrived to find shallow pools separated by stretches of dry riverbed, and discovered a previously unknown population of critically endangered native white-clawed crayfish. "
        },
        {
            "text": "The rescue saved 32 adults, including 21 ‘berried’ females carrying eggs. These native crayfish are the UK’s only freshwater crayfish species and play a vital role keeping waterways clean. "
        },
        {
            "text": "Claire Barrow, the Environment Agency’s drought lead in Yorkshire, said: “Finding a previously unknown population of endangered white-clawed crayfish is great news, despite the challenging conditions. This shows how important it is for the public to report wildlife in distress – they become our eyes and ears during these difficult times.” "
        },
        {
            "text": "How you can help "
        },
        {
            "text": "The Environment Agency encourages all water users to remain alert during challenging conditions. Key signs include fish gasping at the water surface, unusual concentrations of fish in small areas, or any signs of fish in distress. "
        },
        {
            "text": "If you spot fish or other aquatic wildlife in trouble, report it immediately to the Environment Agency's 24-hour incident hotline on 0800 80 70 60. Early reporting can mean the difference between a successful rescue and a significant environmental loss. "
        },
        {
            "text": "As challenging conditions continue, Environment Agency fisheries teams remain ready to respond, working with communities to protect out waterways and the wildlife that depends on them. "
        },
        {
            "text": "Find out more about we’re responding to the 2025 drought via our blogs and take a look at recent coverage from a fish rescue in Gloucestershire.  "
        }
    ]
}