{
    "url": "https://ukefdigital.blog.gov.uk/2025/08/18/how-can-generativeai-help-ukef-staff-work-more-efficiently-day-to-day/",
    "title": "How can GenerativeAI help UKEF staff work more efficiently day-to-day?  ",
    "authors": [
        "Mike Green",
        "Ben Johnson"
    ],
    "categories": [
        "AI",
        "User Centred Design",
        "user research"
    ],
    "pub_date": "2025-08-18T15:42:13+01:00",
    "content": [
        {
            "text": "Since May 2025, UK Export Finance (UKEF) has been trialling 30 Microsoft 365 Copilot licences, distributed across a range of staff. These participants have been trying out the AI product in their day-to-day work and recording their experiences. "
        },
        {
            "heading": 2,
            "text": "What did we want to learn? "
        },
        {
            "text": "Our goal was to understand trial participants’ experience of using M365 Copilot for two months in their day-to-day work, including:  "
        },
        {
            "text": "All the data and findings we gathered would be used to help inform a decision on purchasing more M365 Copilot licences in the future and exploring AI’s potential more broadly across UKEF. We also wanted to learn more about the potential training needs of UKEF users for this new technology. "
        },
        {
            "text": "Methodology: "
        },
        {
            "text": "We used a mixed-methods approach, including two surveys (an initial single-entry survey and a repeated behavioural survey), in-depth interviews over Teams, and three short research tasks: a card-sorting activity, a Copilot meta-analysis task using a prompt we sent participants, and a dot voting activity. This allowed us to combine quantitative data with qualitative insights. "
        },
        {
            "text": "Participant engagement with our research was generally high throughout the trial: "
        },
        {
            "text": "Participants: "
        },
        {
            "text": "The 30 staff were self-selecting and came from all areas of the organisation, including DDaT, Project Management Office, Business Group, Private Office, HR, IT Security and Learning & Development. A number of participants were also members of our Disability, Carers and Neurodiversity Network (D-CAN). "
        },
        {
            "text": "As an aside, a revealing insight about the limitations of GenAI is demonstrated by the image above. Copilot was prompted multiple times to “Create a small image of 30 human beings. Do this as colourful genderless icons in a form that I could use as an image in a slidedeck”. However, it appeared incapable of doing this correctly. On each occasion it produced a grid with only 24 or 25 icons, even when reprompted to correct itself. GenAI’s sporadic inability to count or spell correctly is well-documented: Why Can't AI Count the Number of \"R\"s in the Word \"Strawberry\"? | HackerNoon "
        },
        {
            "heading": 2,
            "text": "What did we learn? "
        },
        {
            "text": "*N.B. Much of the above summary was drafted by Copilot itself, based on the qualitative and quantitative research insights gathered during this trial. As ‘humans in the loop’, we nevertheless maintain that it represents an accurate reflection of what we’ve learned. "
        },
        {
            "text": "The outcome of the card sorting activity underscores this generally positive view of Copilot by those who took part in our trial.  "
        },
        {
            "text": "We also asked participants to rate themselves in terms of the way they use Copilot. More participants rated themselves as being independent users of Copilot than requiring support. A roughly equal proportion rated their usage of Copilot as exploratory as did those who were more task-focussed in their approach to using Copilot.  "
        },
        {
            "text": "One insight in particular stood out. We had not anticipated how strongly neurodiverse trial participants would appear to benefit from Copilot. We heard from a number of such trial participants how beneficial Copilot was in allowing them to overcome ‘blank-page syndrome’ and get started with work tasks. One of them even described the tool as a ‘gamechanger’ for their work. This is encouraging and echoes the findings of similar research into Copilot that has been carried out elsewhere. "
        },
        {
            "heading": 2,
            "text": "What does all this mean for UKEF?  "
        },
        {
            "text": "The trial has proved extremely beneficial in helping us better understand the potential benefits and limitations of Copilot for UKEF staff at this stage. "
        },
        {
            "text": "Our research has shown that Copilot has real potential to enhance how we work at UKEF – but like any tool, its success depends on how well it’s understood, supported, and integrated into our daily routines, something which we are now working to develop. "
        },
        {
            "text": "Based on this trial, we are therefore recommending that UKEF continues to: "
        }
    ]
}