{
    "url": "https://ukhsa.blog.gov.uk/2025/12/16/5-simple-ways-that-we-can-help-stop-superbugs/",
    "title": "5 simple ways that we can help stop superbugs ",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance"
    ],
    "pub_date": "2025-12-16T18:56:10+01:00",
    "content": [
        {
            "text": "Antibiotic-resistant infections are on the rise. Data published in autumn 2025 shows there are nearly 400 new cases reported every week in England. "
        },
        {
            "text": "When bacteria adapt to survive antibiotics, vital medicines stop working when we need them most. "
        },
        {
            "text": "But the fight against superbugs isn't just happening in laboratories – here are 5 easy ways to help the fight against antibiotic resistance in our day-to-day lives.  "
        },
        {
            "heading": 2,
            "text": "1. Talk to a GP, nurse or pharmacist before taking antibiotics "
        },
        {
            "text": "Most colds, coughs and sore throats are caused by viruses, which means they can't be treated by antibiotics. "
        },
        {
            "text": "Taking antibiotics when you don't need them gives bacteria more chances to develop resistance. "
        },
        {
            "text": "Always talk to a doctor, nurse or pharmacist before taking antibiotics – and take as directed by your doctor, nurse or pharmacist, even if you feel better. "
        },
        {
            "text": "If the advice is that you don't need antibiotics, ask what else can help you feel better – often rest, fluids and over-the-counter pain relief are all you need. "
        },
        {
            "heading": 2,
            "text": "2. Take leftover antibiotics back to the pharmacy "
        },
        {
            "text": "If you have antibiotics that are no longer needed, take them back to a pharmacy where they can be disposed of safely. "
        },
        {
            "text": "Throwing antibiotics in the bin could lead to higher risks of resistant bacteria developing in the environment. "
        },
        {
            "text": "Don't save them for later – if you're unwell it's vital to speak to a doctor, nurse or pharmacist first, so that you get the right antibiotic and the right dose for your current infection. "
        },
        {
            "heading": 2,
            "text": "3. Wash your hands properly "
        },
        {
            "text": "The best way to avoid needing antibiotics is to reduce your chances of becoming unwell in the first place. "
        },
        {
            "text": "Thorough handwashing, covering your mouth when you cough and staying home when you're unwell are simple, but they're also the most effective defences we have for breaking chains of infection. "
        },
        {
            "text": "For more information on the threats from antimicrobial resistance and how we can help prevent it, follow the UKHSA Keep Antibiotics Working campaign. "
        },
        {
            "heading": 2,
            "text": "4. Stay up to date with your vaccinations "
        },
        {
            "text": "You might not connect vaccinations with antibiotic resistance, but they're closely linked. "
        },
        {
            "text": "Vaccines prevent infections from happening in the first place, which means fewer people need antibiotics. "
        },
        {
            "text": "In fact, vaccination remains one of the most successful public health measures for reducing the need for antibiotics – so please do make sure you and your loved ones are up-to-date with the vaccines they are eligible for. "
        },
        {
            "text": "Check with your GP if you're unsure what vaccines are available to you. "
        },
        {
            "heading": 2,
            "text": "5. Practice safe sex "
        },
        {
            "text": "Sexually transmitted infections (STIs) like gonorrhoea – which are at near record levels in the UK – are becoming increasingly resistant to antibiotics. "
        },
        {
            "text": "It’s important to take effective steps to protect yourself and others from STIs so that we reduce demand for antibiotics in the first place. "
        },
        {
            "text": "The best way to protect yourself from STIs is to use condoms consistently with new or casual partners. If you've had unprotected sex, get tested – even if you have no symptoms. "
        },
        {
            "text": "Some people with STIs have no symptoms, which means people often pass them on without realising it. "
        },
        {
            "text": "Testing is free, confidential and available through local sexual health clinics or via self-sampling kits you can order online: Find sexually transmitted infection (STI) testing and treatment - NHS. "
        }
    ]
}