{
    "url": "https://space.blog.gov.uk/2025/12/16/imperials-magnetometer-on-nasas-imap-mission-records-successful-first-light/",
    "title": "Imperial’s magnetometer on NASA’s IMAP Mission records successful ‘first light’ ",
    "authors": [
        "Imperial College London"
    ],
    "categories": [
        "Space science"
    ],
    "pub_date": "2025-12-16T15:46:12+00:00",
    "content": [
        {
            "text": "Imperial researchers celebrate a landmark achievement as NASA’s IMAP mission sends back its first data from space."
        },
        {
            "text": "All instruments on board NASA’s Interstellar Mapping and Acceleration Probe (IMAP) spacecraft have successfully recorded their first measurements in space."
        },
        {
            "text": "Among the instruments, the Magnetometer (MAG) developed by Imperial scientists has begun capturing vital information on magnetic fields stretching across the Solar System."
        },
        {
            "text": "These “first light” observations mark a major milestone as IMAP begins collecting preliminary science data en route to its destination."
        },
        {
            "text": "Launched in September 2025 from Cape Canaveral, IMAP is designed to map the boundaries of the heliosphere, a giant bubble created by the solar wind that surrounds our Solar System, and study how it interacts with the local galactic environment."
        },
        {
            "text": "The mission is currently on its way to its operational post at Lagrange Point 1 (L1), a stable point in space about one million miles away from the Earth towards the Sun, where it will send data back to Earth within minutes.  "
        },
        {
            "text": "To achieve this, IMAP carries 10 dedicated instruments, including the Magnetometer, designed to study various cosmic phenomena."
        },
        {
            "text": "The UK Space Agency has supported the UK development of the IMAP mission with £4.2 million, including funding for the MAG instrument."
        },
        {
            "heading": 2,
            "text": "MAG’s role and first measurements"
        },
        {
            "text": "Imperial’s MAG measures the interplanetary magnetic field around the spacecraft, which influences how charged particles move through space and shape the heliosphere. Understanding these fields is key to predicting space weather and its impact on satellites, astronauts and technology on Earth."
        },
        {
            "text": "The instrument’s first-light data has successfully captured the magnetic component of shockwaves created by the solar wind, an important step in validating its performance and beginning its scientific mission."
        },
        {
            "text": "Helen O’Brien, IMAP Magnetometer Instrument Manager said: "
        },
        {
            "text": "Professor Tim Horbury, Science Lead of the IMAP magnetometer at Imperial College London’s Department of Physics, said:"
        },
        {
            "text": "These early observations will help researchers refine models of solar wind behaviour and improve forecasts of space weather events."
        },
        {
            "text": "Imperial played a leading role in designing and building MAG, drawing on decades of expertise in space magnetometry. The team collaborated with colleagues at Princeton University, led by Professor David McComas as well as Professor Silvia Dalla at the University of Lancashire."
        },
        {
            "text": "The instrument was integrated into IMAP ahead of its successful launch and is now operating as the spacecraft travels towards L1."
        },
        {
            "text": "Professor Tim Horbury said:"
        },
        {
            "heading": 2,
            "text": "Why IMAP matters"
        },
        {
            "text": "IMAP will act as a modern-day celestial cartographer, mapping the invisible boundaries of the heliosphere and studying how solar wind interacts with interstellar space."
        },
        {
            "text": "Its observations will provide critical insights into the processes that accelerate particles to high energies, phenomena that affect space weather and, ultimately, life and technology on Earth."
        },
        {
            "text": "For example, SWAPI, led by a team at Princeton University and CoDICE, led by Southwest Research Institute (SwRI), measure ions from the solar wind and beyond. Together with MAG, these instruments will help scientists understand how charged particles move through space and how the heliosphere interacts with the interstellar environment."
        },
        {
            "text": "IMAP is expected to reach L1 in early 2026, where it will begin its full science mission. For Imperial researchers, the successful first-light measurements mark the start of an exciting phase of data analysis that will advance our understanding of heliophysics and space weather."
        },
        {
            "text": "Imperial’s involvement in IMAP continues its long heritage in space science, following contributions to missions such as Solar Orbiter, JUICE and Cluster."
        },
        {
            "text": "The success of MAG underscores the university’s leadership in developing instruments that enable groundbreaking discoveries in space physics."
        }
    ]
}