{
    "url": "https://healthmedia.blog.gov.uk/2025/12/16/resident-doctor-strikes-everything-you-need-to-know/",
    "title": "Resident doctor strikes: everything you need to know ",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2025-12-16T03:47:00+00:00",
    "content": [
        {
            "text": "There have been two periods of strike action this year by resident doctors (25-30 July and 14-19 November 2024. More strikes are planned in December."
        },
        {
            "text": "Here, we tell you everything you need to know about resident doctor strikes, including what patients need to know about their care."
        },
        {
            "heading": 3,
            "text": "When are resident doctors going on strike?"
        },
        {
            "text": "Strikes are planned by the BMA from 7am Wednesday 17 December to 7am Monday 22 December."
        },
        {
            "text": "It’s extremely disappointing that the BMA is planning more strike action in the run up to Christmas and during a flu epidemic, aiming to cause maximum disruption."
        },
        {
            "text": "The Health Secretary and Social Care Secretary offered to extend the BMA’s mandate to postpone strikes until January to protect the NHS – this offer was refused."
        },
        {
            "heading": 3,
            "text": "What happens next and what are you doing to stop strikes?"
        },
        {
            "text": "With waiting lists down by over 226,000 since July 2024, satisfaction with GPs on the up, and 5.2 million appointments delivered in our first year, we are turning the NHS around."
        },
        {
            "text": "There is finally light at the end of the tunnel for the NHS, but the BMA is putting that progress at risk with further strike action."
        },
        {
            "text": "We have been clear that, following a 28.9% pay rise across three years for resident doctors, we cannot go further on pay this year."
        },
        {
            "text": "On 8 December, the Health and Social Care Secretary sent an offer in writing to the BMA Resident Doctors Committee, which would have halved competition ratios for resident doctor jobs by introducing emergency legislation to prioritise UK medical graduates."
        },
        {
            "text": "Unfortunately, on 15 December, the BMA rejected the offer after a short survey of members."
        },
        {
            "text": "The offer is now off the table. We will now consider our next steps, but our priority is dealing with the strikes and keeping patients safe."
        },
        {
            "heading": 3,
            "text": "What was in the offer to the BMA?"
        },
        {
            "text": "Resident doctors have already received an average pay rise of 28.9% over the past three 3 years."
        },
        {
            "text": "The offer made to the BMA last week included: "
        },
        {
            "heading": 3,
            "text": "How much do resident doctors earn? "
        },
        {
            "text": "Resident doctors can increase their pay if rostered during unsocial hours or through working additional hours. The impact of additional earnings means that average earnings for Foundation Year 1 doctors are expected to be around £49,000 increasing to £97,000 for the most experienced resident doctors. "
        },
        {
            "text": "That is significantly more, in a resident doctor’s first year, than the average full-time worker in this country earns."
        },
        {
            "heading": 3,
            "text": "What pay rises have they had in recent years? "
        },
        {
            "text": "Resident doctors pay has increased by 28.9% across the last three years, thanks to this government. "
        },
        {
            "text": "For the second consecutive year, resident doctors received the highest pay increase across the public sector – 5.4% this year. This means they’ve had two years in a row of above inflation pay increases.  "
        },
        {
            "heading": 3,
            "text": "Is it true that there’s a doctor employment crisis?"
        },
        {
            "text": "There are record numbers of doctors in the NHS – 7000 more doctors than this time last year."
        },
        {
            "text": "However, we know that high competition for specialty training has caused concern, and we are taking steps to address this. "
        },
        {
            "text": "By cutting red tape and investing more in our NHS, we have already put over 2,500 extra GPs into general practice to deliver more appointments."
        },
        {
            "text": "Our 10 Year Health Plan also commits to creating 1000 extra speciality training places."
        },
        {
            "text": "In October, NHSE made changes to this year’s specialty training application process to reduce competition and support UK medical graduates.  "
        },
        {
            "text": "Our offer to the BMA also included introducing emergency legislation to prioritise UK medical graduates – this would have halved competition ratios."
        },
        {
            "text": "It also offered to quadruple the number of specialty training places and bringing 1000 forward to benefit resident doctors applying for roles this year. "
        },
        {
            "text": "We want to work with the BMA on this, but their rush to strike action compromises resource which could have been focussed on work to improve conditions and career progression for doctors."
        },
        {
            "heading": 3,
            "text": "How are you keeping patients safe during strikes? "
        },
        {
            "text": "The BMA’s decision to go ahead with strikes now is irresponsible."
        },
        {
            "text": "The focus of government and NHS England is now fully on efforts to get the health service through the double disruption of flu and strikes."
        },
        {
            "text": "There are record numbers of doctors in the NHS, thousands more NHS staff than last year have been vaccinated against flu, and the NHS has tried and tested measures to mitigate the impact of strike action."
        },
        {
            "text": "Due to the dedication of NHS staff and a different operational approach from previous strikes, the NHS has significantly reduced disruption to patients during strikes throughout this year."
        },
        {
            "text": "In November, the NHS met its ambitious goal to maintain 95% of planned care during the latest round of strike action – surpassing the 93% protected during action in July – while still maintaining critical services, including maternity services and urgent cancer care."
        },
        {
            "text": "However, all strike action is disruptive, and it's especially worrying during the ongoing flu epidemic."
        },
        {
            "heading": 3,
            "text": "Will my appointment be cancelled during strikes? "
        },
        {
            "text": "Patients with appointments booked on strike days will be contacted if their appointment needs to be rescheduled due to industrial action.  "
        },
        {
            "text": "If they have not been contacted, they should attend their appointment as planned.   "
        },
        {
            "text": "Any appointments that need to be rescheduled will be done so as a priority. "
        },
        {
            "heading": 3,
            "text": "What if I need urgent medical attention? "
        },
        {
            "text": "It’s important that you do not put off seeking urgent care, and you should turn up for planned appointments unless you have been told otherwise.  "
        },
        {
            "text": "Anyone who needs urgent care should use NHS 111 online or use the NHS App to be assessed and directed to the right care for them.  "
        },
        {
            "text": "As usual, patients should only use 999 if it is a serious or life-threatening emergency. "
        },
        {
            "text": "For more information on when to call 999 and when to go to A&E, you can visit the NHS UK website. "
        },
        {
            "heading": 3,
            "text": "Should I be worried about falling ill during strikes? "
        },
        {
            "text": "The NHS has tried and tested ways to keep patients safe during strikes. "
        },
        {
            "text": "This includes derogations which are exemptions or special arrangements that allow certain essential services to continue operating during industrial action, even when healthcare workers are on strike. "
        },
        {
            "text": "When NHS staff take strike action, they work with hospital management to identify critical services that must be maintained to ensure patient safety and prevent serious harm.  "
        },
        {
            "text": "This ensures that whilst industrial action can proceed to highlight disputes over pay, working conditions, or other issues, patient safety remains the primary concern. "
        }
    ]
}