{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/16/the-future-of-the-funding-service-solving-a-whole-problem-for-users/",
    "title": "The future of the Funding Service: solving a whole problem for users ",
    "authors": [
        "Kate Harries, Head of User Centred Design, Funding Service"
    ],
    "categories": [
        "Design",
        "Funding Service"
    ],
    "pub_date": "2025-12-16T11:05:14+00:00",
    "content": [
        {
            "text": "The Funding Service is a multidisciplinary team in the Ministry of Housing, Communities and Local Government (MHCLG) transforming the way the department delivers grants to councils and communities. It has already achieved a lot in its mission to make grant delivery more cost-effective, consistent and user-focused. "
        },
        {
            "text": "As 2025 draws to a close, the Funding Service is at a turning point.  "
        },
        {
            "text": "Over the past few years, our focus has been on responding to user feedback for the products we had already built and, more recently, on the critical task of creating a new digital service that could scale.  "
        },
        {
            "text": "The general election, change of government and spending review created a great deal of change in grant funding policy, including periods of uncertainty and lower-than-expected demand for the service. This meant we sometimes had a very small number of active users, and it could be hard to judge what was a must-have for multiple users and should be prioritised, versus a nice-to-have for a single user. "
        },
        {
            "text": "Now we have a larger and more diverse group of users, our focus is prioritising based on analysed research and user needs, rather than nice-to-haves, to avoid creating an overly bespoke and technically unstable service.  "
        },
        {
            "text": "We’ve matured as a service and as a team, too. We’ve improved our ways of working by consolidating agile and user-centred design best practices. We've  created an Insights Library to help us organise and prioritise user insights at each point of the journey. This sets us off on the right foot to solve a whole problem for users, end-to-end, and look at opportunities to integrate, either side of our current products. "
        },
        {
            "heading": 2,
            "text": "Our guiding values "
        },
        {
            "text": "We’ve agreed on 6 values to help us prioritise and address the biggest pain points affecting the biggest number of users first. "
        },
        {
            "heading": 3,
            "text": "1. Go wide, not deep "
        },
        {
            "text": "We start by doing the essentials for each part of the grant lifecycle, then move quickly to cover the whole journey. We won’t go feature-heavy on any single stage until we’ve created a minimum viable product (MVP).  "
        },
        {
            "text": "Alongside building services, our focus will be on integrating with tools that already exist. If they don’t meet our users’ needs, we need to be clear about why that is and what we will build instead. "
        },
        {
            "heading": 3,
            "text": "2. Integrate, integrate, integrate "
        },
        {
            "text": "We need to connect MHCLG and non-MHCLG products so that users don't  feel the seams between services or have to enter the same data twice. That means using high-quality reference data wherever it exists and avoiding redundant or inconsistent copies. Good integration isn’t just about  technology; it’s about making the whole journey feel smooth (more on this below!). "
        },
        {
            "heading": 3,
            "text": "3. Design for the seams "
        },
        {
            "text": "We know users move between multiple services. Our job is to make those transitions easier to navigate for users. That means gathering insight about the whole journey, not just the products we’ve built. "
        },
        {
            "text": "As Richard Pope puts it in his book Platformland, designing for the seams gives us “a way of revealing decisions, rules, data and accountability to users while not abandoning the aspiration for simplicity”. "
        },
        {
            "heading": 3,
            "text": "4. Prioritise based on multiple user needs "
        },
        {
            "text": "We need to identify the top priority based on user needs, deliver it quickly to the agreed standard, and then move on. This approach helps us avoid   spreading ourselves too thin and means we’re creating value where it's  needed most.  To support this, we’re embedding new feedback loops into our process: synthesised feedback and user research findings feed into an Insights Library, which informs product prioritisation. By taking this evidence-based approach, we can make more informed decisions and deliver meaningful improvements faster. "
        },
        {
            "heading": 3,
            "text": "5. Release new things fast "
        },
        {
            "text": "We’ll release quickly, get real feedback, and iterate. It’s better to launch something useful now than wait for perfect later. "
        },
        {
            "heading": 3,
            "text": "6. Be ready for policy changes "
        },
        {
            "text": "Our team and our products need to be flexible and ready to quickly adapt to changes in policy. "
        },
        {
            "heading": 2,
            "text": "Identifying integration opportunities and joining up "
        },
        {
            "text": "Policy teams delivering grants and grant recipients currently need to engage with several teams and services both within MHCLG and in wider government during the funding lifecycle. This may include: "
        },
        {
            "text": "This can lead to a disjointed, time consuming, and often confusing experience for users (and for our team working with grants, too).  "
        },
        {
            "text": "Our ambition for 2026 into 2027 is an end-to-end user journey that feels friction-free for the user.  "
        },
        {
            "text": "Over the next few months, we'll be exploring the processes, policies and teams which underpin these products to ensure there is a good link-up to support the user experience. "
        },
        {
            "heading": 2,
            "text": "Our work in the new year and beyond "
        },
        {
            "text": "A new year brings new challenges, but also opportunities! We know our plan is ambitious, which is why we’ve already started. "
        },
        {
            "text": "Our Service Insights team have been busy:   "
        },
        {
            "text": "The team is now working on: "
        },
        {
            "heading": 2,
            "text": "How to get involved "
        },
        {
            "text": "We can’t do this alone, which is why we’ll be working closely with teams  across MHCLG and wider government. We plan to engage with teams working on products our users may interact with to see how we can integrate and avoid duplication. "
        },
        {
            "text": "Whether you’re in MHCLG or another department, please get in touch to learn more about our work at FundingService@communities.gov.uk. "
        }
    ]
}