{
    "url": "https://forestrycommission.blog.gov.uk/2025/09/22/ashes-of-hope-12-years-of-observing-ash-dieback-in-east-anglia/",
    "title": "Ashes of hope: 12 years of observing ash dieback in East Anglia",
    "authors": [
        "Steve Scott"
    ],
    "categories": [
        "Tree health"
    ],
    "pub_date": "2025-09-22T09:00:00+01:00",
    "content": [
        {
            "heading": 2,
            "text": "The impact of ash dieback"
        },
        {
            "text": "Ash dieback has had a significant impact on the UK’s landscapes and ecosystems since it was first detected. It is currently estimated that ash dieback will kill up to 50-75% of ash trees across the UK,1 which will also impact many species which rely on ash. This also poses substantial economic and safety challenges. The estimated cost of managing of diseased trees, particularly those near roads, buildings and public spaces, runs into the billions.2"
        },
        {
            "text": "The crisis has highlighted the vulnerability of the UK's tree population to imported diseases, prompting enhanced biosecurity measures and research into resistant ash varieties."
        },
        {
            "heading": 2,
            "text": "My observations of ash dieback"
        },
        {
            "text": "Since 2013, I’ve been monitoring ash trees across Norfolk and Suffolk, and in 2025, there are some signs of cautious optimism."
        },
        {
            "text": "I vividly remember the alarm sparked by the discovery of the ash dieback fungus in East Anglia in the autumn of 2012. Almost overnight, I found myself part of a national rapid-response survey effort, even appearing regularly on local and national TV."
        },
        {
            "text": "At the time, Danish scientists were leading the research into the causes, lifecycle and implications of the fungus Hymenoscyphus fraxineus (initially known as Chalara fraxinea). I was particularly struck by a series of time-lapse photographs from Denmark showing two trees by a park bench – one dying, while the other seemingly untouched. Inspired, I began my own photographic record."
        },
        {
            "text": "This is citizen science at its simplest. While driving around north Suffolk and south Norfolk, I selected trees in accessible public spaces with clear silhouettes. Some are solitary ash trees, while others are in small groups. I’ve only been photographing and observing visible changes (no sampling was conducted), so I can’t confirm the cause of any decline."
        },
        {
            "heading": 2,
            "text": "The findings of my 12-year record"
        },
        {
            "text": "To set expectations: most trees have declined over the past twelve years. Of the 36 trees or groups I’ve tracked, half now unfortunately have a reduced canopy. Most have lost less than 50% of their canopy, and only two (around 5%) have lost more than that. Surprisingly, only one tree has died of natural causes."
        },
        {
            "text": "But I’ve noticed a more troubling trend: 11 of the original 36 samples (30%) have been felled. Some were clearly in decline and posed possible safety risks. However, others that had been pollarded (where the top of the tree has been cut to encourage new growth) and those with no heavy limbs and seemingly healthy, were removed without obvious cause."
        },
        {
            "heading": 2,
            "text": "A glimpse of hope"
        },
        {
            "text": "The most remarkable finding is that five of the trees are in significantly better condition in 2025 than they were in 2013. One or two others have retrenched, where the tree’s canopy has reduced but maintained its health. Most of these are smaller trees, which is unexpected, as conventional wisdom suggests that trees with smaller diameter stems are more vulnerable to the ash dieback fungus. A few trees that seemed doomed 12 years ago are now remarkably thriving!"
        },
        {
            "text": "Forest Research, along with other partners, identified ash trees with a high degree of natural tolerance to ash dieback through the Living Ash Project between 2013 and 2024. The project aimed to secure the genetic material of these trees for breeding and conservation, to ensure its availability for future timber production and woodland restoration. Monitoring of living trees has shown that some trees have healed lesions, showing that recovery is possible, reaffirming my findings that there are modest grounds for hope."
        },
        {
            "text": "Those dire predictions back in 2012 of 95% mortality have not yet materialised. If we can afford to let trees be, some may well recover."
        },
        {
            "heading": 2,
            "text": "What to do if you spot ash dieback in your woodland"
        },
        {
            "text": "Ash dieback can be identified through dark spots on leaves that appear between May and October. Infected leaves will then wilt and discolour to black, before falling prematurely while other tree species remain green. On the branches and trunk, look for dark brown or black lesions on the bark, which often have a diamond shape."
        },
        {
            "text": "Dieback of shoots and branches typically starts in the crown and works downwards. Infected trees may also develop epicormic shoots (new growth sprouting directly from the trunk or main branches) as the tree attempts to compensate for crown loss, and over time, the overall canopy will become increasingly sparse and thin."
        },
        {
            "text": "For more information and resources on how to identify ash dieback, you can visit Observatree’s ash dieback page, or watch How to identify Chalara ash dieback in the field video I produced twelve years ago."
        }
    ]
}