{
    "url": "https://aphascience.blog.gov.uk/2025/09/22/bovine-viral-diarrhoea/",
    "title": "Advancing the fight against Bovine Viral Diarrhoea",
    "authors": [
        "Amin Asfor"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2025-09-22T10:43:54+01:00",
    "content": [
        {
            "text": "Meet the APHA scientist tackling a hidden cattle virus - Dr. Amin Asfor’s mission to stop Bovine Viral Diarrhoea could change farming, food safety, and global animal health."
        },
        {
            "heading": 2,
            "text": "The role of the National Reference Laboratory (NRL) led by Dr. Amin Asfor"
        },
        {
            "text": "Bovine Viral Diarrhoea Virus (BVDV) presents a major challenge to farmers due to its ability to spread silently through persistently infected animals, causing immunosuppression, reproductive losses, and increased vulnerability to other diseases. These effects lead to significant economic costs from reduced productivity, veterinary expenses, and trade restrictions. Diagnostic complexity and the need for coordinated eradication efforts further complicate control, making BVDV a persistent threat to cattle health and farm sustainability both in the UK and globally. I play a leading role in addressing this disease through my work as Head of the National Reference Laboratory for BVD at the Animal and Plant Health Agency."
        },
        {
            "text": "The NRL for BVD really is a team effort, not only overseeing testing, but also providing advice on BVD-related matters to vets and livestock practitioners. My role involves improving our testing capabilities and helping to fill in knowledge gaps by advancing research to better understand how the virus transmits across different species. I also develop species-specific diagnostic assays, and continuously check that the tests we have are fit for purpose. All this information is shared with colleagues at APHA and our partners."
        },
        {
            "heading": 2,
            "text": "Understanding BVDV and its impact"
        },
        {
            "text": "The UK has ambitious plans to eradicate BVD from our national herd (Animal Health and Welfare Pathway - GOV.UK) and the APHA is committed to improving animal health, ensuring the resilience and safety of our food supply, and strengthening the long-term sustainability of the livestock industry."
        },
        {
            "text": "BVDV causes significant health, environmental, and economic implications, highlighting the importance of coordinated eradication efforts."
        },
        {
            "text": "Unlike most viral infections that animals (or humans) can overcome, leading to full recovery, BVDV is unusual as it can cause persistent infection. This means continuous shedding of the virus (the process by which virus particles are released from an infected host into the environment) and greater chances of onward transmission. By identifying and removing these persistently infected animals, we can take an important step towards stopping the spread of this virus and eradicate the disease."
        },
        {
            "heading": 2,
            "text": "Global support and academic collaboration"
        },
        {
            "text": "The APHA is World Organisation for Animal Health (WOAH) Reference Laboratory on BVDV, which offers a great opportunity for APHA to extend its expertise internationally and facilitates global collaboration in disease diagnostics. We provide resources, reagents, and advice to laboratories worldwide, and offer training if needed."
        },
        {
            "text": "Additionally, I hold a senior lecturer position at the University of Surrey, which strengthens the academic ties of the reference laboratory for BVDV and offers a platform to educate and inspire future vets and scientists about the importance of the BVDV eradication programme and the holistic activities of APHA as a frontline for disease control in the UK.  "
        },
        {
            "heading": 2,
            "text": "The path forward"
        },
        {
            "text": "It is a collaborative effort of veterinary practitioners, researchers, policymakers, and educators. By increasing the capabilities of the National Reference Laboratory for BVDV, we are better equipped to tackle this disease. Through continuous targeted research, improved diagnostic methodologies, international collaboration, and public educational initiatives, we aim to create a future where BVDV is no longer a threat to cattle health."
        },
        {
            "text": "The battle against BVDV is not just a scientific effort; it is a vital investment in the future of livestock health, agricultural productivity, and food safety. Together, we can establish a path toward the successful eradication of this disease, ensuring a healthier future for animals and farmers alike."
        }
    ]
}