{
    "url": "https://nationalscreening.blog.gov.uk/2025/09/22/uk-nsc-moves-to-2-yearly-open-call-cycle/",
    "title": "UK NSC moves to 2-yearly open call cycle",
    "authors": [
        "Katy Town"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-09-22T09:53:11+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee’s (UK NSC’s) open call is the regular opportunity for you – our stakeholders – to submit proposals to the committee."
        },
        {
            "text": "During the 3-month open call period, individuals or organisations can propose any of the following:"
        },
        {
            "text": "We previously conducted this process once a year but are now moving to a 2-yearly cycle. This decision has been made so the committee can robustly consider and progress the much larger number of complex proposals it receives since the expansion of its remit."
        },
        {
            "text": "We have also established an exceptions process that will allow the UK NSC to consider proposals outside the new 2-yearly open call period if there is significant new evidence that meets specific criteria."
        },
        {
            "text": "The next open call for topics will start on 1 July 2026 and close on 30 September 2026."
        },
        {
            "text": "See UK NSC open call: submitting a screening proposal for detailed guidance on the open call process and how to submit a proposal."
        },
        {
            "heading": 2,
            "text": "Reasons for the change"
        },
        {
            "text": "In 2022, the remit of the UK NSC expanded, in line with the recommendations of the 4 UK chief medical officers (CMOs), so the committee can now consider targeted screening topics as well as population screening topics."
        },
        {
            "text": "This expansion in remit has led to a significant increase in the volume and complexity of open call submissions to the UK NSC. "
        },
        {
            "text": "Moving to a 2-yearly cycle will enable the committee to robustly consider and discuss all stakeholder submissions with its experts, engage with proposers, and then add topics as appropriate to its formal business planning and research processes."
        },
        {
            "heading": 2,
            "text": "Exceptional circumstances"
        },
        {
            "text": "The UK NSC will, however, retain the ability to consider proposals outside the 2-yearly open call period in exceptional circumstances."
        },
        {
            "text": "For this to happen, there must be new evidence which:"
        },
        {
            "text": "See UK NSC open call exceptions criteria."
        },
        {
            "heading": 2,
            "text": "Other activities"
        },
        {
            "text": "The open call for topics is just one way the committee continually engages with new and important issues."
        },
        {
            "text": "The UK NSC’s expert reference groups and its secretariat help make sure the committee has the best understanding of the latest screening issues and developments, their importance for potential screening programmes, and relevant uncertainties and possibilities."
        },
        {
            "text": "Other activities include:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}