{
    "url": "https://buyingforschools.blog.gov.uk/2025/09/22/using-the-dfes-integrated-curriculum-financial-planning-icfp-tool-to-get-essential-insights-into-managing-your-schools-resources/",
    "title": "Using the DfE’s Integrated Curriculum Financial Planning (ICFP) tool to get essential insights into managing your school’s resources",
    "authors": [
        "Michele Lavelle, CFO at Campfire Education Trust"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2025-09-22T15:35:46+01:00",
    "content": [
        {
            "text": "Michele Lavelle, CFO at Campfire Education Trust (CET) in Buckinghamshire, Milton Keynes and Northamptonshire, shares how using the DfE’s Integrated Curriculum and Financial Planning (ICFP) tool has helped to transform the trust’s planning"
        },
        {
            "text": "As the Chief Financial Officer (CFO) of a multi-academy trust with six primary schools, I'm a firm believer in how the Integrated Curriculum and Financial Planning (ICFP) tool can both inform and transform resource management."
        },
        {
            "text": "I first came across ICFP through the free DfE webinars, and I found it really interesting and started testing it. Since joining Campfire Education Trust, we have used it to inform budget setting and to make sure that the expenditure, particularly around staffing, were in line with the metrics."
        },
        {
            "text": "When I first joined the trust, the headteachers used benchmarking effectively but were unaware of the full potential of ICFP to support and refine the budget setting and monitoring process."
        },
        {
            "text": "So, I worked closely with them and with the school business managers to implement ICFP, the metrics it provides, and the importance of them in helping make decisions. All of our headteachers are better informed and absolutely on board with it now."
        },
        {
            "text": "The integration advantage"
        },
        {
            "text": "The integration is what makes it so powerful. I always emphasise that finance isn't a separate function. You need to understand what's driving the finances in your school, making sure they're linked to the curriculum, the costed school development plans, the whole strategy of where your trust is going. "
        },
        {
            "text": "At CET, we've just set the next three-year budget forecast and ICFP has been invaluable. Funding is tight, so it's increasingly important to make sure that we're getting the best out of it. We've got to ensure that the children are getting the best education possible and that staffing structures are appropriate."
        },
        {
            "text": "Context is key. All our schools are very different. We have some schools with high levels of deprivation; we have some schools that are PFI schools. There are all sorts of different things to consider. So, we don't compare metrics against each other, but individually we can keep an eye across the whole trust from a consolidated position of where we are but also monitor the individual schools."
        },
        {
            "text": "If there are metrics that throw up things that are outside what would be deemed the usual range for a particular school, it just opens those discussions, to provide the school with a range of options so that we can look at what else we could do to achieve a balanced budget."
        },
        {
            "text": "Transforming decision-making in our schools"
        },
        {
            "text": "Perhaps the most significant advantage is the ability to look ahead. I think that's where our headteachers have really appreciated ICFP. They've been able to use it to inform their decision making, about staffing structures particularly, and they've got the data there to justify that."
        },
        {
            "text": "Staffing and funding changes a lot, everything's moving all the time. We have to flex. We have to work within the available resources, we must always be thinking ahead."
        },
        {
            "text": "If pupil numbers are predicted to decrease in the next two years, for example, we need to be thinking now of our staffing structure and plan accordingly. If you're just looking at the here and now, if you don't have the ICFP metrics, you may delay adjusting staffing levels."
        },
        {
            "text": "This forward visibility allows us to avoid possible job reductions through natural staff turnover and strategic planning. Without these metrics, you don't get an early enough warning, making it much harder to address potential issues before they become critical."
        },
        {
            "text": "Alongside the data we get from ICFP, we also use the DfE’s Financial Benchmarking and Insights Tool (FBIT). With this, we can look at what other schools or trusts are spending on certain things to check whether we're in line – though you need to be wary of whether you’re comparing like for like."
        },
        {
            "text": "We have reviewed contracts as a result of these insights and have tried, where possible and beneficial, to have contracts that are trust wide rather than on an individual school basis."
        },
        {
            "text": "Our schools are aware of the importance of setting an in-year surplus in future years, to deliver positive operational margins, with healthy trust-wide reserves, including how to build back school specific reserves. Context is key when using benchmarks and ICFP, and it is therefore essential that the metrics are considered in the light of the individual school’s detailed knowledge of pupils and their complex needs."
        },
        {
            "heading": 4,
            "text": "Supporting others in the sector"
        },
        {
            "text": "I do a lot of networking with other trusts and I'm always recommending ICFP as part of our conversations. In fact, my confidence in the tool and the process led me to pursue DfE accreditation as a School Resource Management Advisor (SRMA) myself. The training was first rate, and I now support other schools and trusts in their resource management."
        },
        {
            "text": "Having the accreditation has given the Trust greater credibility and a strong understanding of ICFP gives you confidence to present to trustees, to respond to challenge from them, to understand what's happening in your schools, and how you can support headteachers in their decision making. All those things make you feel better informed and more confident in your role."
        },
        {
            "text": "Why every trust should embrace ICFP"
        },
        {
            "text": "With ongoing funding pressures and pupil numbers fluctuating, ICFP has delivered tangible benefits across our trust. It provides essential insight into what's driving your finances and ensures financial decisions are aligned with curriculum needs and pupil outcomes and what opportunities are available to make financial efficiencies or reallocate spending."
        },
        {
            "text": "I believe every school and academy trust should make ICFP a diagnostic tool to support strategic curriculum financial central to their financial planning, to provide conversation starters with senior leaders with consideration to the strategic aims and the context of the schools."
        },
        {
            "text": "Find out more about ICFP here - and start taking advantages of the benefits for your curriculum and financial planning."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ at the top right of this page to subscribe to our blog and receive notifications when we next post."
        }
    ]
}