{
    "url": "https://socialcare.blog.gov.uk/2024/02/20/ambition-fuels-rewarding-social-care-careers/",
    "title": "Ambition fuels rewarding social care careers",
    "authors": [
        "David Wilmott"
    ],
    "categories": [
        "Care and support",
        "Leadership",
        "Mental health",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2024-02-20T17:50:39+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A family passion"
        },
        {
            "text": "I left school with two O Levels and I didn’t really have a career in mind, but nursing was in the family and my mum told me I’d be good at it. So, I thought, ‘why not?’"
        },
        {
            "text": "I started as a health care assistant at the Royal Gwent Hospital, in Newport, South Wales, in 1991 and loved it. As a consequence of my enthusiasm, I decided to do three nights a week at night school to get my grades to train to be a student nurse."
        },
        {
            "text": "I then spent 10 years in various clinical roles before moving into mental health commissioning and leadership. I joined Cygnet Health Care in 2018."
        },
        {
            "text": "Having struggled academically at school, becoming a registered nurse was the proudest day of my life. It felt a real achievement."
        },
        {
            "text": "After that, becoming a ward manager was amazing. It's a role which gives you the unique ability to change the quality of care for patients. No doubt it’s one of the most challenging roles, but also rewarding. It gives you the chance to recruit and develop nurses, influence standards and shape the quality of care. It was an immensely exciting time."
        },
        {
            "text": "I moved into a leadership role because it provided the opportunity to influence nursing care on a larger scale. There’s scope to guide the direction of nursing within an organisation but also through wider networks such as the MHN Directors Council which influences national programmes of work."
        },
        {
            "heading": 2,
            "text": "Making careers in care attractive"
        },
        {
            "text": "In my opinion, making the workforce fit for the future is the biggest challenge facing the nursing profession. There are challenges around attracting people into mental health nursing in particular. There’s no denying it is a tough job and incentivising people is vital."
        },
        {
            "text": "When I went to university, I didn’t have to pay tuition fees, I had a bursary, but now it’s more challenging to finance courses like mine. I hope this issue can be addressed so more people are able to pursue an education in mental health nursing (and other specialisms)."
        },
        {
            "text": "The pandemic elevated the status of nursing and the clinical expertise our workforce brings. It showed the highly skilled and numerous talents we have across the profession. Nurses and care workers come from a range of backgrounds that truly represent the diversity of our society. Without a doubt, these careers have an impact on so many lives. I think the world realised how vital nurses are to us all."
        },
        {
            "text": "I am proud that here at Cygnet there are many roles available in nursing and more career pathways opening up for support workers, carers and nurses. Wherever you are in your career, there are always opportunities. Don’t be afraid to ask colleagues, friends or relatives how they got to where they are. Their successes could be all the inspiration you need."
        }
    ]
}