{
    "url": "https://defrafarming.blog.gov.uk/2024/02/20/farming-equipment-and-technology-fund-2024-guidance-now-available/",
    "title": "Farming Equipment and Technology Fund 2024: guidance now available",
    "authors": [
        "Laurren March"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2024-02-20T13:18:19+00:00",
    "content": [
        {
            "text": "You will soon be able to apply for a grant through the Farming Equipment and Technology Fund (FETF)."
        },
        {
            "text": "To help you prepare, we’ve published the FETF grant guidance on GOV.UK. "
        },
        {
            "text": "In this post, I’ll give an overview of the grants and include details of an upcoming webinar for you to learn more."
        },
        {
            "heading": 2,
            "text": "Grants to improve Productivity, Slurry management and Animal Health and Welfare "
        },
        {
            "text": "The Farming Equipment and Technology Fund provides grants for equipment and technology that support improvements in: "
        },
        {
            "text": "You can apply for one grant from each of the 3 themes."
        },
        {
            "text": "The fund is competitive. The Rural Payments Agency (RPA) will allocate funding after all applications within an application window have been received and scored. You may not receive any, or all of the funding you apply for. "
        },
        {
            "text": "Successful applicants will receive a grant of: "
        },
        {
            "text": "We will pay a percentage of the cost depending on the item. For many items, this percentage is an increase on last year. This funding will go towards either: "
        },
        {
            "heading": 2,
            "text": "What’s new for 2024 "
        },
        {
            "text": "New for 2024, the fund is now split into 3 separate grants: productivity, slurry and animal health and welfare equipment."
        },
        {
            "text": "We have increased the maximum grant amounts for productivity and slurry, so you can now apply for up to £50,000 for each of these themes."
        },
        {
            "text": "The maximum grant amount for animal health and welfare remains at £25,000."
        },
        {
            "text": " This means you could receive up to £125,000 in total, towards the purchase of new equipment and technology. "
        },
        {
            "text": "Further to these improvements, we have also increased the grant amount available for most items from last year."
        },
        {
            "text": "This year there will be multiple application windows. We'll let you know when these are open for applications. "
        },
        {
            "text": "There is also a new Farming Investment Fund application service to make it easier to apply for FETF grants. You will need to register for the new Farming Investment Fund application service to submit your application when this is launched. "
        },
        {
            "heading": 2,
            "text": "Productivity "
        },
        {
            "text": "Applications for productivity items are scored on:"
        },
        {
            "text": "There are now 85 different items of productivity equipment, and you can apply for a grant towards the cost of any of these items. "
        },
        {
            "text": "We've put them into categories to make it easier to find equipment that is relevant to you – but please do look in all the categories as there may be relevant items there too."
        },
        {
            "text": "Following suggestions captured in our survey, we are including 24 new items of productivity equipment for the first time in this new round including: "
        },
        {
            "text": "Popular and innovative items of productivity equipment that continue to be eligible for a grant include a robotic drill and guided hoe, inter row hoes and weeders, camera guided inter row sprayers, rainwater harvesting tanks, automatic tree planter, direct drill with fertiliser placement and a robotic silage pusher."
        },
        {
            "text": "The list of productivity items is available on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Slurry"
        },
        {
            "text": "Applications for slurry items are scored on: "
        },
        {
            "text": "There are now 17 different items of slurry equipment to help improve the collection and spreading of slurry. You can apply for a grant towards the cost of any of these items. "
        },
        {
            "text": "Following suggestions from farmers, we have widened the specification for slurry separators to allow screw press, screen press and mobile separators. "
        },
        {
            "text": "Popular items of slurry equipment that continue to be eligible for a grant include robotic slurry collectors, flow rate monitoring equipment and low emission slurry spreaders, such as dribble bars."
        },
        {
            "text": "Applying slurry directly to the ground is a major step farmers can take to reduce ammonia emissions and improve use of slurry as an organic fertiliser."
        },
        {
            "text": "The list of slurry items is available on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Animal health and welfare "
        },
        {
            "text": "Animal health and welfare grants are available to commercial farmers who keep pigs, sheep, dairy and beef cattle and layer and broiler chickens."
        },
        {
            "text": "There are more than 130 animal health and welfare items available in 2024, including 29 new items."
        },
        {
            "text": " We’ve worked closely with farmers, vets, academics and industry groups to compile a list of items which improve the health and welfare of livestock, including items that respond to challenges such as heat stress and biosecurity."
        },
        {
            "text": "Applications for animal health and welfare items are scored on their contribution towards the Animal Health and Welfare Pathway priorities. This year, you can increase your application score by 20% if you can show evidence that you’ve discussed your application with a vet."
        },
        {
            "text": "We encourage all applicants to speak with a vet about their application. They'll be able to help you identify specific health and welfare challenges on your farm, to inform which equipment would work best for you. "
        },
        {
            "text": "An Annual Health and Welfare Review is a great way to have this conversation. We hope that you'll take the opportunity to have a fully funded vet visit before applying for a grant."
        },
        {
            "text": "The list of animal health and welfare items is available on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "Applications will open soon. We'll blog when you can apply so, subscribe to the Farming blog to receive a reminder on the day. "
        },
        {
            "text": "Our team will host a webinar on 12 March 2024. You will be able to put your questions to policy leads during this session. Register to attend the webinar. "
        },
        {
            "text": "We look forward to seeing you there!"
        }
    ]
}