{
    "url": "https://moderncivilservice.blog.gov.uk/2024/02/20/government-is-one-of-the-largest-employers-of-digital-and-data-professionals-in-the-uk/",
    "title": "Government is one of the largest employers of digital and data professionals in the UK",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-02-20T10:39:31+00:00",
    "content": [
        {
            "text": "Guest blog by Mike Potter, Government Chief Digital Officer."
        },
        {
            "text": "At the end of last year, the Central Digital and Data Office (CDDO) launched Government Digital and Data, a community of experts leading digital transformation in government. Together, we are a powerful force creating more efficient services that have a meaningful impact on people’s lives."
        },
        {
            "text": "There are over 28,000 specialists across government working everyday to improve public services in the long-term, through digital innovation such as Artificial Intelligence (AI), designing new apps or improving the data that supports top-level decisions.  Civil Service workforce reports show that working on digital and data has nearly doubled in the last five years,growing from 2.8% in 2018 to 5% in 2023 to make the UK Government one of the biggest tech employers. "
        },
        {
            "text": "Every department in government is currently working towards delivery for the Transforming for a Digital Future, a roadmap for digital and data transformation by 2025. The roadmap has been written collaboratively by us at CDDO and government departments, it sets out six missions to achieve digital transformation by 2025."
        },
        {
            "heading": 2,
            "text": "A mission to deliver digital skills at scale"
        },
        {
            "text": "A crucial pillar of the roadmap is to equip civil servants for a digital future, particularly focusing on upskilling civil servants in digital capabilities and digital delivery, with access to the right data and tools to do their jobs effectively."
        },
        {
            "text": "This is vital to making sure that the Civil Service has the digital skills needed both for today’s and tomorrow’s challenges and also to reduce our reliance on contingent labour, reducing costs and growing capability for the long-term. "
        },
        {
            "text": "Senior civil servants (SCS) are also part of the digital and data upskilling drive to ensure all leaders are comfortable with digital, not just leaders of digital teams. So far, over 10% of all SCS have been upskilled on digital and data essentials and participated in the Digital Excellence Programme."
        },
        {
            "heading": 2,
            "text": "A commitment to introduce new digital talent"
        },
        {
            "text": "In addition to our collective vision to upskill, last year we announced a new commitment to bring in 2500 tech and digital roles into the Civil Service via bespoke new programmes such as the digital and data apprenticeships programme, Tech Track, which is due to launch this year. "
        },
        {
            "text": "The programme provides the opportunity for both existing civil servants and new entrants to join apprenticeship programmes at HEO grade into the most in-demand roles, such as cybersecurity technologists, DevOps engineers and software developers, and there will be an opportunity to secure SEO roles at the end of the apprenticeship. A new Digital Secondments Programme pilot will also bring in skills from the private sector."
        },
        {
            "heading": 2,
            "text": "A vision to use artificial intelligence safely "
        },
        {
            "text": "Embracing emerging technologies is another key pillar of the roadmap with vast potential to transform the government services. CDDO has just released the Generative AI Framework for HMG which shares guidance on using generative AI safely and securely for civil servants and people working in government organisations in ten easy to follow principles. "
        },
        {
            "text": "We’ve also introduced a range of online courses on generative AI covering topics such as risk, strategy, tools and applications. "
        },
        {
            "heading": 2,
            "text": "Shaping the future workforce "
        },
        {
            "text": "Government Digital and Data should be viewed alongside tech giants as one of the largest and most exciting employers in the UK. And we have a unique selling point for prospective talent: our work is fundamentally about transforming lives for the better. "
        },
        {
            "text": "At the forefront of digital innovation, we’re shaping the future workforce with a strong focus on AI roles. Our commitment to cutting-edge technology and data is revolutionising government for greater efficiency and effectiveness."
        },
        {
            "text": "Please follow the CDDO blog and LinkedIn for all the latest news of digital transformation happening across government. Look out for more details about the programmes mentioned above and how to apply on the Cabinet Office Digital and Data website in due course and on the Civil Service Careers Hub. Find out more about how the public sector is transforming at Innovation 2024."
        }
    ]
}