{
    "url": "https://digitaltrade.blog.gov.uk/2024/02/20/how-we-built-a-service-owner-profession-at-the-department-for-business-and-trade/",
    "title": "How we built a service owner profession at the Department for Business and Trade",
    "authors": [
        "Anais Reding, Chief Engagement and Design Officer",
        "Julian dos Remedios - Service Owner of Customer Relations Management system",
        "Julia Crompton – Service Owner for Employee Experience"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2024-02-20T10:30:23+00:00",
    "content": [
        {
            "text": "As this blog is published, we are onboarding our 10th service owner, 3 years into building the new profession. Service owners at the Department for Business and Trade (DBT) act a bit like business partners. They bridge the gap between the Digital Data and Technology (DDaT) function and the rest of the department. Service owners make sure that we are not just a delivery function, but help inform thinking, policies and projects. "
        },
        {
            "text": "Having started my career in policy, I know that user-centred design and more generally digital, data and technology approaches are still primarily part of the DDaT delivery toolkit rather than policy or project development. This is a gulf that must be bridged if we want to deliver the most impactful work for the public. I also know that conversations between DDaT and policy practitioners can be at odds: we do not work at the same pace or follow the same approaches. Any collaboration is difficult at first and has to be intentional. We set out to address this challenge by building our service owner profession at DBT."
        },
        {
            "text": "I am really proud of the success we have had to date. I know service ownership is making a big difference to our ability to deliver on our mandate as a department, with value for money, at a time when IT projects going wrong continue to make headlines. Over the last 2 years, our service owners have been critical in helping the department focus its activity on the highest value opportunities. They did this by making better use of data and providing a digital self-serve offer to exporters and investors. Service owners represented DDaT in the governance of the Investment Transformation Programme and the Export Support Service Programme, both on the Government Major Projects Portfolio (GMPP). The programmes recently closed with a ‘green’ rating from the Infrastructure Projects Authority. This would not have been possible if DDaT’s work had not aligned to the programme’s priorities, its role in benefits realisation clearly articulated. "
        },
        {
            "text": "Service owners spent a lot of time in the programme design phase making sure DDaT’s strategic role was recognised, and it was not seen as ‘just’ a delivery function. At a recent global gathering of colleagues working on investment, we received this feedback which captures nicely how we try to work: "
        },
        {
            "text": "“Thank you to [programme and frontline colleagues] and the DDaT team for their collaborative working across [DBT offices abroad] and [DBT in the UK] to bring Expand Your Business to life .... The success and take up [of the service] is due to their commitment to design and roll out a service focused around client and colleagues’ needs.” "
        },
        {
            "text": "While service ownership has become central to how we work at DBT, getting here has been a roller coaster. We are by no means at the end of our journey. The Central Digital and Data Office for the UK Government defines the role of  ‘service owner’ as clearly as others in the digital, data and technology framework, like ‘product manager’ or ‘delivery manager’. This gives the impression it is an established role. But the reality is that it does not exist in many departments, and where it does, it varies hugely in the shape that it takes. We had to figure out the outcomes that we needed from the role at DBT, the capabilities that mattered for this, and the environment that would enable the role to succeed.  "
        },
        {
            "text": "At DBT, our service owners act as partners to the business and DDaT. They bring our expertise together with their objectives so that we can be user centred and think about digital, data and technology as outcome enablers rather than just delivering a solution. This involves co-designing strategies, business cases and business plans so everyone is clear how digital, data and technology will contribute to achieving the departmental objectives, including its contribution to economic benefits. "
        },
        {
            "text": "Our service owners equip Director-Generals and Directors with the knowledge they need to take accountability for DDaT services, alongside their teams’ policy or operational work. While DDaT is a separate corporate function in DBT, we know that Director-Generals and Directors can only meet their policy objectives in today’s world by making good use of digital, data and technology. Last but not least, the work of service owners also involves a lot of advocacy. This helps strengthen colleagues’ understanding of digital, data and technology and vice-versa, policy objectives. They do this through a mix of communications, governance, and training to name a few.  "
        },
        {
            "text": "“As a service owner it’s really refreshing and positive to be part of DBT where the role is fully supported and understood. Developing and running services in government can be complex and exciting. Service owners are an important part of any team, bringing a range of different skills and experiences together to help shape a service. This often means thinking about the user, policy, strategic and operational needs and working with a range of experts and professions to deliver the best service for everyone. My current role, working in the data area, also includes thinking about new technology and developing the opportunities these innovations bring.” Julian dos Remedios. "
        },
        {
            "text": "So what makes a good service owner? We expect our service owners to have strong consultancy skills. These include problem ownership, using various methods to derive insight, excellent facilitation, influencing and more generally engagement skills to bring professionals together, and deliver something greater than the sum of its parts. We also expect them to have a solid understanding of standards across digital, data and technology, and both agile and traditional project management. They will often be the first representatives of the digital, data and technology function, they need to know red lines and when to bring colleagues in. "
        },
        {
            "text": "This is a broad set of capabilities. Our service owners come from a range of backgrounds. They often major on some capabilities upon taking on the role and develop the breadth of expertise on the job. This is something I hope to keep. Every area of work benefits from a different focus, and as a team, it helps us learn from each other. "
        },
        {
            "text": "It has been great seeing colleagues from a variety of professions express interest and successfully make the move into service ownership. Our most effective service owners all have one thing in common: they are born collaborators. Service ownership is a leadership role, and those with a servant leadership style tend to perform better and be happiest in the role. This is compared to owner or decider leaders who provide a style that may be critical for other roles in the team or in different contexts. "
        },
        {
            "text": "“The service owner role is pivotal in helping delivery teams focus on the work of most value, understand the drivers of what we work on, and ensure developments are shared across the department.” Julia Crompton."
        },
        {
            "text": "We will be recruiting more roles over the course of the year, so sign up for alerts if you are interested to see these. We are always keen to learn how we can strengthen our service ownership by speaking to others and hearing about their own experiences. Please do not hesitate to get in touch. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}