{
    "url": "https://marinedevelopments.blog.gov.uk/2024/02/20/mayflower-pontoons-provide-new-base-for-charter-and-recreational-anglers-in-plymouth/",
    "title": "Mayflower Pontoons provide new base for charter and recreational anglers in Plymouth",
    "authors": [
        "Amy Blackham, Communications & Engagement Manager"
    ],
    "categories": [
        "Coastal",
        "Grant funding"
    ],
    "pub_date": "2024-02-20T13:26:17+00:00",
    "content": [
        {
            "text": "Cattewater Harbour Commissioners (CHC) has officially opened of the Mayflower Pontoons, an extension to the Barbican Landing Stage (BLS) facilities in Plymouth. Supported by a £150,000 grant awarded through MMO's Fisheries and Seafood Scheme, this project improves the port infrastructure at the Barbican Landing Stage (BLS) in Plymouth. The installation of two additional pontoons provides new drop-off and pick-up points for a variety of recreational fishing vessels, including wildlife safaris, dual coded vessels and angling vessels."
        },
        {
            "text": "The current infrastructure is well used by local ferries and larger vessels to collect and disembark up to 200 passengers. Our funding allows for additional berth space at BLS for local businesses to offer trips from the heart of Plymouth. In periods of bad weather, it will also act as a safe haven for commercial fishers who, while they can’t land catches on the BLS, can use it for safe mooring."
        },
        {
            "text": "Benefits we expect to see from this investment:"
        },
        {
            "text": "The ribbon-cutting event, held on 20 February 2024, was well attended with MMO represented by Plymouth-based Marine Environment Officer, Sara Wordley."
        },
        {
            "text": "Paul Errington, MMO’s Acting Director of Finance and Resources said:"
        },
        {
            "text": "The Mayflower Pontoons, three new pontoons connected to the BLS provides over 60 meters of additional mooring space. Equipped with shore power and mains water they will provide a dedicated area for pick up and drop off for charter vessels, and other small vessel passengers with prior arrangement via CHC. "
        },
        {
            "text": "CEO and Harbour Master, Capt. Richard Allan said:  "
        },
        {
            "text": " Several charter vessels took part in a pilot in 2023 using the existing BLS during with strict vessel traffic management in place to coordinate with existing stakeholders to include local ferries and boat tours. This new facility builds on the success of the pilot, anyone wishing to operate out of the new facility for the 2024 season can contact the Harbour at info@plymouthport.org.uk"
        },
        {
            "text": " Local charter skipper, Dave Uren said: "
        },
        {
            "text": " Cllr Tudor Evans OBE, Leader Plymouth City Council said: "
        },
        {
            "text": " "
        }
    ]
}