{
    "url": "https://ace.blog.gov.uk/2023/11/14/ace-helps-university-achieve-security-research-centre-ambition/",
    "title": "ACE helps university achieve security research centre ambition",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Academia",
        "Data",
        "Data science",
        "Security"
    ],
    "pub_date": "2023-11-14T09:55:53+00:00",
    "content": [
        {
            "text": "Oxford Brookes University has just launched a new research centre focusing on defence and security, and being a member of the ACE Research Network has helped make it happen. "
        },
        {
            "text": "Karl Kjelstrup-Johnson, senior lecturer and programme director in the faculty of Technology, Design and the Environment, credits ACE with helping him build the business case for establishing the Defence and Security Research Centre at Oxford Brookes University (DASOBU).  "
        },
        {
            "text": "“There's always been a drive to support and deliver research and impact into the defence and security domain,” he says.  "
        },
        {
            "text": "“When we came across ACE we applied and were selected for the first University Innovation Concept for Counter Terrorism Policing. That really gave us confidence that there is a platform to engage with these kind of government opportunities and allowed us to demonstrate, as a university, our relevant skills and capabilities. "
        },
        {
            "text": " "
        },
        {
            "text": "The power of networks "
        },
        {
            "text": "“But ACE has provided us with more than just an opportunities platform to engage with government stakeholders. It’s the network, it’s the ability to build collaborative relationships and form an ecosystem of academic and industry expertise. "
        },
        {
            "text": "“With access to these capabilities we have the confidence we can translate cutting-edge research into real world impact at the pace of relevance.” "
        },
        {
            "text": "Kjelstrup-Johnson identifies the diversity of capabilities and thinking that lie at the heart of ACE as key to the value the ARN offers to academics and universities. He explains that DASOBU will build upon cognitive and computer science expertise with a focus on AI, data science and psychology. "
        },
        {
            "text": "“As a university we have the ability to assimilate diverse interdisciplinary capabilities,” he says. “This can unlock strategies and solutions that you just can't do using restricted or siloed approaches. "
        },
        {
            "text": "“It’s about what you can bring to a problem, maybe in a space that you haven't necessarily engaged in before, but where research and skills are transferable. ACE creates this platform that you can get people from, let's say, a data science or psychology background now looking at serious organised crime and, through collaboration, formulate innovative responses.” "
        },
        {
            "text": " "
        },
        {
            "text": "Helping focus on mission "
        },
        {
            "text": "ACE supported Counter Terrorism Policing in establishing the University Innovation Concept to provide it with a greater diversity of academic expertise to address mission challenges via the ACE Research Network. "
        },
        {
            "text": "Oxford Brookes has been among the cohorts of universities taking part in the first two phases, presenting research at showcase events at Sheffield University in 2022 and Cranfield University earlier this year. "
        },
        {
            "text": "“Working with the ACE team on the University Innovation Concept has been great,” Kjelstrup-Johnson says, citing the support and feedback on developing proposals provided by the ACE team, who help shape and direct ideas to best address the mission challenges. "
        },
        {
            "text": "“What's been motivating is the focus on applied research. It's not about a polished product. It's about identifying that problem space, identifying the art of the possible, outlining potential next steps and courses of action. Responding to Government defined problems and conducting research and development which has real world impact is the driver. "
        },
        {
            "text": "“ACE will remain a key focus for the research centre because we feel the support is there. The initiative and the mission are aligned.” "
        },
        {
            "text": "There are almost 90 academic institutions in the ACE Research Network, with more than 370 individual academics receiving ARN communications. The ARN provides leading research and expertise for ACE commissions and supports our Futures & Insight horizon scanning capability. If you are an academic interested in joining the network, please contact aceresearchnetwork@vivace.tech.  "
        }
    ]
}