{
    "url": "https://teaching.blog.gov.uk/2023/11/14/how-does-it-feel-to-be-an-award-winning-early-career-teacher/",
    "title": "How does it feel to be an award-winning Early Career Teacher?",
    "authors": [
        "Daniel Callaghan"
    ],
    "categories": [
        "Inspiring teachers",
        "Support for ECTs"
    ],
    "pub_date": "2023-11-14T09:33:38+00:00",
    "content": [
        {
            "text": "Daniel Callaghan, Teacher at Thorpe Primary in Bradford, won the Silver Award for Outstanding New Teacher of the Year at the National Teaching Awards 2023. In this blog, he talks about his experience as an Early Career Teacher (ECT) and shares some top tips."
        },
        {
            "text": "How did it feel to win the Silver Award?"
        },
        {
            "text": "When I found out I was nominated and won a National Teaching award for Outstanding New Teacher of the Year, I was in complete shock. I was overwhelmed with a mixture of emotions; surprised, excited, and nervous."
        },
        {
            "text": "It was and still is a big deal, especially being recognised for the hard work and commitment I have put into my teaching career so far."
        },
        {
            "text": "As an ECT, the first 2 years are the hardest; finding your feet, promoting a positive behaviour management strategy, getting to know the children in your class on a personal level and being able to have a work life balance. So, being recognised early on in my career has been one of the biggest achievements I have done, since I am only 25 years old."
        },
        {
            "text": "What inspired you to become a teacher?"
        },
        {
            "text": "During my primary school experience, I had a great set of role models: teachers and teaching assistants, who showed me the love for teaching and learning stems from the interactions you have with students and peers in school."
        },
        {
            "text": "It was during my volunteering hours at my old primary school, that I realised a strong male role model could make a positive impact on the children within and surrounding the classroom setting."
        },
        {
            "text": "As soon as I decided I wanted to be a teacher, I chose my A level subjects based on this, and then completed my teaching degree at Leeds Trinity University. Once I completed my degree, I secured a post as HLTA (Higher Level Teaching Assistant) which gave me confidence in developing my teaching ability, until I then secured a full-time teaching post in Year 5 at Thorpe Primary School."
        },
        {
            "text": "How do you set your pupils up for success?"
        },
        {
            "text": "My belief is that every child can succeed in all aspects of their learning and development with strong role models and a great range of opportunities."
        },
        {
            "text": "My classroom reflects my teaching style - it’s a calm, warm and inviting space where children can immerse themselves in the range of books, get creative with different resources and feel confident to ask for support or use the working walls to develop their work."
        },
        {
            "text": "My behaviour management has been noticed to be highly effective and consistent, by the use of positive praise, daily class certificates and personalised stickers: which my children absolutely love!"
        },
        {
            "text": "I believe being a young teacher has also helped me be able to relate and create lasting relationships and bonds with the children I teach; I’ve got to know them on a personal level, which further supports my planning as I can tailor and adapt it to the needs of my children."
        },
        {
            "text": "Within my school, the Carlton Academy Trust vision statement is, ‘Excellence for All,’ which I use and strongly believe in whilst teaching and setting my children up for success."
        },
        {
            "text": "What are your 5 top tips for ECT’s?"
        },
        {
            "text": " "
        },
        {
            "text": "Nominate your colleagues for a National Teaching Award"
        },
        {
            "text": "Entries for the 2024 National Teaching Awards are now open. The awards are free and there are 16 individual and team categories covering the early years, primary, secondary and FE sectors, open to schools and colleges across the UK."
        },
        {
            "text": "Visit the National Teaching Awards website to enter now"
        }
    ]
}