{
    "url": "https://hmlandregistry.blog.gov.uk/2023/11/14/keeping-your-property-safe/",
    "title": "Keeping your property safe",
    "authors": [
        "Lynne Feddon, Head of Counter Fraud "
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2023-11-14T09:00:27+00:00",
    "content": [
        {
            "text": "This week sees the return of International Fraud Awareness Week, launched in 2000 by the Association of Certified Fraud Examiners, when hundreds of organisations across the world come together to raise awareness and encourage people to guard against fraud. "
        },
        {
            "text": "Fraud costs the UK nearly £7 billion a year, accounting for more than 40% of crime, so earlier this year the Government launched a new Fraud Strategy, introducing a range of measures aimed at driving this figure down.   "
        },
        {
            "text": "At HM Land Registry we work hard to combat property fraud, which happens when criminals target the most vulnerable properties or property owners in our society.  "
        },
        {
            "text": "This type of fraud can deprive people of their homes, lose them hundreds of thousands of pounds and have a seriously detrimental impact on their lives, often before they realise what is happening.  "
        },
        {
            "text": "When a criminal steals a property owner's identity and uses it to make an application to HM Land Registry to register, for example, a forged transfer or mortgage deed, this is officially known as ‘registered title fraud’. "
        },
        {
            "text": "Over the past five years, HM Land Registry has prevented registered title fraud against more than £100 million of property, through a combination of detection, prevention and education.  "
        },
        {
            "text": "However, fraudsters targeting the properties of both individuals and companies continue to pose a threat to property owners and conveyancers, as they look to exploit any real or perceived weakness in the system.  "
        },
        {
            "text": "It is worth remembering, too, that fraud methods vary and continually evolve, so we all need to be vigilant and look out for anything that seems unusual or suspicious.  "
        },
        {
            "heading": 2,
            "text": "If a fraud has been committed"
        },
        {
            "text": "If a registered title fraud has been committed, the Land Registration Act 2002 sets out when a mistake in the register can be put right, and when it cannot.  "
        },
        {
            "text": "This is underpinned by a scheme to compensate those who suffer loss because of a mistake in the register, whether or not it is corrected.  "
        },
        {
            "text": "Depending on the circumstances, the defrauded proprietor may not regain ownership of the property, so prevention should always be the number one priority."
        },
        {
            "heading": 2,
            "text": "How you can help prevent property fraud "
        },
        {
            "heading": 3,
            "text": "Apply for a Form LL restriction  "
        },
        {
            "text": "Owners can apply to enter a ‘Form LL restriction’ in the property title register. This is designed to help prevent the type of fraud where a fraudster obtains identity documents in the registered property owner’s name and then uses them to persuade a buyer or lender that they are the true owner of the property. "
        },
        {
            "text": "Typically, they might be a tenant with access to the property or some other trusted person.   "
        },
        {
            "text": "To sell or mortgage the property, the fraudster has to obtain a certificate from a conveyancer in order to comply with the Form LL restriction in the register.  "
        },
        {
            "text": "The Form LL restriction can deter fraudsters from targeting a property because they will first have to convince the conveyancer that they are indeed the true owners.  "
        },
        {
            "text": "It is not a mandatory requirement when you buy a property, and your legal advisor may or may not raise it with you during the conveyancing process, but if you have this restriction in place, you could stop a fraudster from selling your property without your knowledge.  "
        },
        {
            "text": "However, you should also be aware that having this restriction in your register can slow down the process of selling, leasing or mortgaging your property because you’ll need to address extra steps, which can take some time to resolve.  "
        },
        {
            "text": "Find out more at property fraud - HM Land Registry (blog.gov.uk) or watch our video, Form LL – the 'counter-fraud' restriction."
        },
        {
            "heading": 3,
            "text": "Consider signing up to Property Alert "
        },
        {
            "text": "Property Alert is another preventative measure you can take which is well worth considering.   "
        },
        {
            "text": "HM Land Registry’s Property Alert service currently has more than 1.25 million active alerts protecting properties across England and Wales and giving their owners greater peace of mind. "
        },
        {
            "text": "By signing up for this free service, you will be notified of certain types of activity on the register in relation to your property, which you can rapidly respond to if necessary.  "
        },
        {
            "text": "You don’t have to be the property owner to set up an alert; you might want to keep an eye on a friend or relative’s house, or simply want to know if someone is interested in buying it. And it is not limited to just one address: you can monitor up to 10 properties. "
        },
        {
            "text": "It takes just a few minutes to set up an account. Sign up at Property Alert service and enter the required details. You’ll find some great pointers here: 5 top tips to keep your property safe."
        },
        {
            "heading": 2,
            "text": "Property fraud hotline lets you report suspicions quickly and easily"
        },
        {
            "text": "For anyone who thinks they may have been the victim of property fraud, HM Land Registry operates a dedicated property fraud line for you to report any concerns. Please call us on 0300 006 7030 (Monday to Friday, 8am to 5pm). "
        },
        {
            "text": "So why not sign up to our Property Alert service during Fraud Awareness Week and help protect your property?"
        }
    ]
}