{
    "url": "https://aphascience.blog.gov.uk/2023/11/14/observatree/",
    "title": "Celebrating 10 years of tree-mendous citizen science",
    "authors": [
        "Jane Barbrook"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2023-11-14T09:30:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What is Observatree?"
        },
        {
            "text": "Observatree is an early warning system using citizen science to help spot new pest and disease threats to UK trees, and to increase plant health surveillance delivered through a partnership approach."
        },
        {
            "heading": 3,
            "text": "Where it all began"
        },
        {
            "text": "Many people remember the impact Dutch Elm disease had on the removal of mature Elm from our landscape, and posters in police stations urging people to report. More recently, the arrival of Ash dieback prompted a national conversation and raised public awareness of the threats to plant health and the landscape."
        },
        {
            "text": "Set against this backdrop, ten years ago a bid for EU Life funding was made. The proposed project aimed to establish whether a network of specialist volunteers could be trained to look out for, and report on, plant pests and diseases of concern."
        },
        {
            "text": "Happily, the bid was successful, and Observatree was launched in October 2013 with an enthusiastic collective partnership at the helm."
        },
        {
            "heading": 3,
            "text": "What does APHA bring to the partnership?"
        },
        {
            "text": "APHA have contributed through technical input at partnership meetings and in helping steer and develop the project with a place on the Observatree board. On the ground, our exceptional inspectors have delivered in-field training to volunteers. To date some 200 volunteers have been trained in recording and recognition skills for 24 priority pests and diseases."
        },
        {
            "text": "Working with the regional managers to find people who would like to be involved has been key and there has been no shortage of people coming forward over the last ten years."
        },
        {
            "text": "APHA’s Plant Health and Seeds Inspectorate (PHSI) have delivered biosecurity training to new and existing volunteers. Each of our inspectors bring their own style of delivery, taking the opportunity to share anecdotes and experiences in the plant health field."
        },
        {
            "text": "We have taken part in workshops covering tree identification, surveying and recording, and biosecurity. The tree identification sessions proved particularly popular with everyone, and there were always some slightly tricky conifer species thrown in for good measure."
        },
        {
            "text": "The first post COVID-19 session, in the Wyre Forest, was particularly memorable. We had all been inside for so long due to restrictions, so to reaffirm collectively with nature and the trees had a special significance. We learned the techniques for assessing tree crown condition, used back to basics trigonometry to calculate height and size, and met up with folk who until then we had only met online."
        },
        {
            "heading": 3,
            "text": "Building and strengthening partnerships"
        },
        {
            "text": "Being a board member has provided a great opportunity for building and strengthening partnerships, to work with new colleagues, and to consider next steps for the project such as associate partners. It has been key to supporting and guiding the project through the initial funding phase and beyond. Throughout, it has been the willingness of partners to work together to make Observatree a success which has been key in bringing this new approach to the table for identifying pests and diseases."
        },
        {
            "text": "With partners, we have promoted Observatree at external events including The Royal Welsh Show, Horticultural Trades Association shows, RHS Chelsea and local regional shows. We have provided technical input to project resources such as the Pest and Disease Field Guides which are a real asset and actively signpost stakeholders to them."
        },
        {
            "text": "We also attended a parliamentary reception at the Houses of Parliament, a real opportunity to showcase the work of Observatree and the partnership approach to ministers in quite a unique setting!"
        },
        {
            "heading": 3,
            "text": "Successes of the project"
        },
        {
            "text": "The first big success came in the summer of 2015. Oriental chestnut gall wasp (OCGW) had just been found for the first time in the United Kingdom (UK) in a Kent woodland, and plans were being drawn up to limit its spread. An Observatree volunteer then reported it north of London, some 50 miles away. This prompted further surveillance by tree and plant health inspectors who found evidence of the gall wasps in many areas between. This altered our understanding of pest distribution, how long it had probably been in the UK and, provided an early indication of the potential of the Observatree project."
        },
        {
            "text": "Other notable reported finds from volunteers have been Elm zig zag sawfly, Oak Processionary Moth and Phytophthora ramorum."
        },
        {
            "text": "Over the ten years, volunteers have submitted an amazing 20,000 reports and, although finding pests and diseases can be exciting, data submitted about healthy trees are just as important. These absence data help us to understand the current extent of a pest or disease. The project is considering how all these data can be made available and shared more widely (for research for example)."
        },
        {
            "text": "Some volunteers are also engaged in developing a sentinel network, where the same tree or group of trees are looked at regularly. There has also been opportunity to help with specific projects and research-based activities including sticky traps deployment."
        },
        {
            "heading": 3,
            "text": "Where next and future challenges"
        },
        {
            "text": "The number of tree pests and diseases arriving in the UK from other parts of the world has increased significantly in recent times. Others are thought to be heading our way, helped by increased global movement of goods and people, and changing climatic conditions. However, with the collective efforts of government, citizen science, charitable trusts, Non-Government Organisations and the public, we can perhaps be in a better position to detect and respond to these threats."
        },
        {
            "text": "Finally, a big thanks for the expertise, enthusiasm, and support that our inspectors, managers, project partners and the volunteers have brought to Observatree over the last 10 years, during which time the project has grown, developed and thrived, at a time in which there have been many changes and pressures in the plant health world."
        },
        {
            "heading": 3,
            "text": "How you can help"
        },
        {
            "text": "Have a look at the tree pests and diseases we are most keen to hear about. If you think you may have spotted any of them, please report using Tree Alert."
        },
        {
            "heading": 3,
            "text": "Find out more!"
        },
        {
            "text": "If you would like to find out more, please check out these links."
        }
    ]
}