{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/11/14/supporting-social-workers-on-their-development-and-journey-to-leadership/",
    "title": "Supporting social workers on their development journey to leadership",
    "authors": [
        "Rochelle"
    ],
    "categories": [
        "Leadership",
        "Social work: the profession"
    ],
    "pub_date": "2023-11-14T09:58:52+00:00",
    "content": [
        {
            "text": "Social workers looking to develop their career are encouraged to sign up to the Pathways programme, which is a fantastic opportunity to develop the leadership skills of social work managers and leaders. The programme is funded by the Department for Education and delivered by England’s largest social work charity, Frontline."
        },
        {
            "text": "There are four pathways specific to children’s social work and tailored for different stages of leadership: supervisors, middle managers, heads of service and practice leaders."
        },
        {
            "text": "Rochelle is a team leader in a Local Authority's children and families social work team and has a decade of experience. She completed Pathway 2, a course designed for team managers, in July 2023. After graduating university in 2013, Rochelle spent time working in child protection services before progressing to a manager within fostering services. Rochelle experienced homelessness as a child so, even though she didn’t have a social worker, feels that she can relate to similar experiences people who have been in care might have had. For her, social work is a way, a career, where she can support some of these children and families."
        },
        {
            "text": "Before starting your journey on Pathway 2, what were you hoping to get out of the programme? "
        },
        {
            "text": "I didn’t really know what to expect, but I knew it was going to be a great opportunity to network with other social workers from across the country, hearing how they manage certain tasks in their local authorities. It was incredibly useful to connect with my peers, as I was able to build relationships and share ideas, which you don’t usually have time for as a social worker day to day. Aside from the networking element, I wanted to develop my confidence in the skills I already possess and in the ones that still need development."
        },
        {
            "text": "Reflecting on the residential experience, was there a particular session or conversation that impacted you? "
        },
        {
            "text": "Feedback was a theme throughout the residential, and for me understanding the power of feedback and how valuable it can be when used correctly really struck me. As a manager, I’ve never had the opportunity to practice giving feedback, so having the space to practice this skill while receiving guidance from the facilitator was really useful. I’ve already implemented one of the feedback models we were shown with my team and found that it helped people to digest the feedback more easily. Feedback is also so important when working with families - I will be looking at how I can use this model to help strengthen how we deliver feedback and to build relationships based on the value of giving and receiving it."
        },
        {
            "text": "Have you taken anything that you learnt back to share with your team? "
        },
        {
            "text": "One of the sessions was titled ‘Let’s think and talk about race’. This gave me the space to really think about my local authority and if we were doing enough to encourage greater diversity and ultimately, I was left feeling that we could do more. My team’s role is to recruit foster families, and we specifically struggle to recruit families from racially diverse backgrounds. The residential made me realise that we need to be having more conversations with families from racial minorities to understand what the barriers are to fostering and whether we can work with them to remove these barriers."
        },
        {
            "text": "What was your understanding of leadership in social work before the residential, and has this changed?"
        },
        {
            "text": "My understanding of what a manager and a leader is has changed, and it also challenged me to think about what kind of leader I want to be. It’s reframed my intentions for my role: I want to inspire, motivate and empower my team to come up with ideas and push them forward, and to be a facilitator rather than an instructor. Additionally, one of the other Pathway 2 leaders spoke about how we need to be shapeshifters, to adapt to the individual needs of the team member we are working with. Since the residential I’ve been much more focused on considering how each team member would want me to approach a situation and involving them in the conversation rather than assuming it for them."
        },
        {
            "text": "Further information"
        },
        {
            "text": "The Pathways programme is a fantastic opportunity to develop the leadership skills of your social work managers and leaders."
        },
        {
            "text": "Applications for Pathway 1 ,specifically for Practice Supervisors, are currently open. We particularly encourage applications from a range of leaders to help mirror the diverse workforce and families within your local areas."
        },
        {
            "text": "Find out more and apply"
        },
        {
            "text": " "
        },
        {
            "text": "If you have a story to share with the children’s social care community or want to see a blog on a particular area, please get in touch: blog.bulletin@education.gov.uk"
        }
    ]
}