{
    "url": "https://mojdigital.blog.gov.uk/2023/11/14/tripods-building-a-connected-delivery-profession/",
    "title": "Tripods: Building a Connected Delivery Profession",
    "authors": [
        "Lianne Mellor"
    ],
    "categories": [
        "delivery profession",
        "Our services"
    ],
    "pub_date": "2023-11-14T12:19:30+01:00",
    "content": [
        {
            "text": "Introducing Tripods"
        },
        {
            "text": "This blog explores the transformative impact of 'Tripods', a novel approach that connects Delivery Managers from other government departments. They meet regularly to share experiences and support each other. It’s a small idea that’s had a big impact on the culture of some of the largest departments in government. "
        },
        {
            "text": "The Birth of Tripods"
        },
        {
            "text": "I was invited to speak at a DWP delivery management away day. During the day, I had an idea and approached their Head of Role, Barry Traish."
        },
        {
            "text": "How might we…"
        },
        {
            "text": "Defining Tripods"
        },
        {
            "text": "Barry & I met up to discuss how we could join our communities together. The initial idea was to create micro-networks of 3 people. We came up with the following definition of what Tripods are;"
        },
        {
            "text": "We started small & launched our pilot with 3 departments; MoJ, DWP & OFSTED. We matched 111 people into 37 Tripods."
        },
        {
            "text": "Lessons Learnt & Tips for Success"
        },
        {
            "text": "The value that people gain from being in a Tripod is directly related to the amount of effort that the whole Tripod puts into it. Once people are able to experience the value of being part of a small, supportive network for themselves, the benefits start to be realised. We created a few tips for success;"
        },
        {
            "text": "Expanding & Sustaining the Initiative"
        },
        {
            "text": "Following a successful pilot we were able to extend the scheme out to Government Digital Service (GDS), Home Office, Health & Safety Executive (HSE), Department for Education (DfE), Department for Environment, Food and Rural Affairs (DEFRA) & Department for Levelling Up, Housing & Communities (DLUHC)."
        },
        {
            "text": "We aim to inspire others by sharing our approach and successes. We encourage readers to consider implementing a similar initiative into your organisations and invite you to reach out to let us know how you get on."
        }
    ]
}