{
    "url": "https://cddo.blog.gov.uk/2023/11/29/government-digital-and-data-workforce-growing-at-record-rate/",
    "title": "Government Digital and Data workforce growing at record rate",
    "authors": [
        "Jack Hunnaball, Head of Digital Capabilities Strategy and Transformation, CDDO",
        "Delwar Ali, Senior Business Analyst, CDDO"
    ],
    "categories": [
        "DDaT community",
        "Government Digital and Data"
    ],
    "pub_date": "2023-11-29T14:05:48+00:00",
    "content": [
        {
            "text": "The skills we need to deliver modern government services are changing, and growing digital capability in Government continues to be a key priority. In a recent speech at Policy Exchange, former Minister for the Cabinet Office Jeremy Quin highlighted the need to “harness the power of digital, data and technology in order to deliver most efficiently and effectively for the public.”"
        },
        {
            "text": "Our latest insights show that the workforce behind digital transformation across government is growing with top talent and expertise driving forward our progress. This is reflected by today’s launch of Government Digital and Data, the first ever unifying brand name for this group of professionals, and wider function supporting digital government. "
        },
        {
            "text": "Part of our remit within the Capability team in the Central Digital and Data Office (CDDO) is to collaborate with government departments on the monitoring of the Government Digital and Data workforce. This results in the production of a biannual Workforce Insights Commission. "
        },
        {
            "heading": 3,
            "text": "Key insights from the last commission"
        },
        {
            "text": "1. The profession has grown"
        },
        {
            "text": "The profession as a whole has seen continuous growth and is becoming stronger with greater capability and skill being retained and onboarded."
        },
        {
            "text": "As a result, the profession has grown by 9% in the last 6 months, with 28,337 professionals across government now housed with the Government Digital and Data profession. Collectively this makes the UK government one of, if not the largest, employers of digital and data professionals in the UK. "
        },
        {
            "text": "Digital and data roles now comprise approximately 5.2% of the total Civil Service headcount, a 0.4 percent point rise, since October 2022. "
        },
        {
            "text": "Likewise the size of our senior leadership cohort continues to grow with almost 300 Senior Civil Service (SCS) roles reported. This is an 8% increase in the last 6 months and 18% in the last year."
        },
        {
            "text": "2. Digital is nationwide"
        },
        {
            "text": "The regional footprint of the profession continues to be very varied with 79% of the profession being based outside of London. After London, the North West has the second highest footprint accounting for 10% of the headcount and Wales shortly follows with 9%. "
        },
        {
            "text": "This nationwide footprint extends to our senior leadership too, 66% of digital SCS being based outside the capital. This means as a profession we have already met the target to have 50% of its SCS outside of London by 2030 as set in the declaration of government reform. "
        },
        {
            "text": " "
        },
        {
            "text": "3. Roles are in demand"
        },
        {
            "text": "In terms of the roles that fulfil Government Digital and Data, software developer remains the most in-demand position, accounting for 13% of all filled roles. Delivery manager and business analysts taking the second and third spots respectively. "
        },
        {
            "text": "At the time of collection there were a grand total of 3905 vacancies across the Civil Service, that's a vacancy rate of 12%. We see two clear take homes from this. "
        },
        {
            "text": "The first, that vacancies and vacancy rates are going in the right direction, down 5% and two percent points respectively in the last 12 months. That puts the Civil Service on track to achieve its targeted less than 10% vacancy rate as outlined in Transforming for a Digital Future. "
        },
        {
            "text": "The second, it's clear our digital workforce is growing, and will continue to do so with ample opportunity for more seasoned professionals or budding future specialists to join our ranks."
        },
        {
            "heading": 3,
            "text": "How we use the data"
        },
        {
            "text": "The Workforce Insights Commission collects line by line information on digital and data professionals working for HM Government, which includes both Civil Servants and third parties such as individual contractors, managed services and professionals seconded into government from the private sector. "
        },
        {
            "text": "We use the data provided from the exercise as our primary evidence base for many of our key programmes aimed at building digital capability across the Civil Service. These include the Digital, Data and TechnologyFast Stream, the Digital, Data and Technology Capability Framework and digital pay reform."
        },
        {
            "heading": 3,
            "text": "Looking ahead "
        },
        {
            "text": "We are currently launching our next round of data collection, which is on track to be our largest yet. "
        },
        {
            "text": "Our focus in the next cycle of data collection centres around implementing user research findings from previous commission which flagged areas we could improve usability of the collection tool. We are also looking to incorporate specific requests for social mobility data in the commission, which will be the first time such information has been collected through the commission. We look forward to writing again soon with further insights from the latest round."
        },
        {
            "text": "If you’re interested to hear more about the growing Government Digital and Data communities across the UK then blogs by the Digital Trade on the growing digital workforce in Cardiff and our very own CDDO blog on the Civil Service’s Digital Skills Imperative."
        }
    ]
}