{
    "url": "https://deframedia.blog.gov.uk/2023/11/29/new-measures-to-boost-access-to-nature-announced/",
    "title": "New measures to boost access to nature announced",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-11-29T16:26:42+00:00",
    "content": [
        {
            "text": "Today (Wednesday 29 November), there has been widespread coverage of the government's new package of measures to improve public access to nature and reverse its decline. The announcement has been covered across a number of national outlets, including the BBC, The Guardian, The Times, The Daily Mail and The Daily Telegraph."
        },
        {
            "text": "Secretary of State Steve Barclay discussed the package in a number of broadcast interviews with the BBC, Times Radio, Sky News, LBC, GB News and ITN, outlining how the new policies will help to better connect people with nature."
        },
        {
            "text": "Amongst the policies announced was the beginning of a search for a new National Park, a competition to find a site for a national forest, two new community forests in Tees Valley and Derbyshire and £2.5 million in funding to for disadvantaged children and young people to access green spaces."
        },
        {
            "text": "When the designation process is complete , the new National Park will be England’s 11th and will fulfil a government manifesto commitment. The move comes alongside £10 million of additional funding announced for existing National Parks and protected landscapes over this year and next to help support them with funding pressures. Around £5 million of new funding was also announced to improving the quality of water courses in these landscapes."
        },
        {
            "text": "Other measures involved in the package included more of a say for the public in the felling of street trees, the second round of funding for the Landscape Recovery scheme, which will facilitate 34 new projects, and a new temperate rainforest strategy, including £750,000 for research and development into how to protect our rainforests."
        },
        {
            "text": "Establishing new forests, including plans for a new national forest and two community forests in the Tees Valley and Derbyshire, will help the UK to meet net zero targets, while offering new habitats to boost biodiversity and nature recovery. Public access to woodlands was also boosted with a Woodland Access Plan."
        },
        {
            "text": "Prime Minister Rishi Sunak said: "
        },
        {
            "text": "  "
        },
        {
            "text": "Environment Secretary Steve Barclay said: "
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter and sign up for email alerts here."
        }
    ]
}