{
    "url": "https://defrafarming.blog.gov.uk/2023/11/29/round-two-projects/",
    "title": "Landscape Recovery: sharing the successful second round projects",
    "authors": [
        "Sam Burford"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-11-29T10:15:28+00:00",
    "content": [
        {
            "text": "I’m pleased to share the 34 successful projects in the second round of Landscape Recovery. "
        },
        {
            "text": "This £25 million round will fund 12 more projects than the previous round, demonstrating our commitment to funding that delivers environmental benefits in harmony with food production. "
        },
        {
            "text": "The focus of this round is net zero, protected sites, and wildlife-rich habitats. "
        },
        {
            "text": "Together, the projects involve over 700 farmers and landowners working with their communities to support over 200,000 hectares across England.  "
        },
        {
            "text": "They will:"
        },
        {
            "heading": 2,
            "text": "Successful projects "
        },
        {
            "text": "The second round Landscape Recovery projects are: "
        },
        {
            "text": "As was the case for the first round of the scheme, projects were selected through a competitive application process. "
        },
        {
            "text": "Applicants were assessed against criteria which considered their feasibility, costs, environmental and social benefits and impact on food production, by a panel of subject matter experts.  "
        },
        {
            "text": "The successful initiatives demonstrated pioneering ideas that will reverse the decline in nature and support the sustainable production of food. "
        },
        {
            "heading": 2,
            "text": "Project spotlight "
        },
        {
            "text": "The Penwith Landscape Recovery project will rejuvenate the moors and downs of Penwith, Cornwall. The project aims to return the widespread grazing of cattle on the heathlands, while also ensuring that clean water flows through the fens and farmland. "
        },
        {
            "text": "On the other side of the country, the West Norfolk Nature Network will see a group of farmers transform the ecological landscape in Norfolk by creating swathes of contiguous multi-layered successional scrub, integrated with a mosaic of land and water-based features, serving as conduits for wildlife movement and diversity enhancement. "
        },
        {
            "text": "The Hadrian's Wall Wetland Landscape Recovery project in the Northumberland National Park will improve water quality, increase biodiversity, recreate ecologically rich habitats and enhance protected sites across the iconic Hadrian’s Wall area. This project will encourage collaboration between farmers, land managers, neighbours and stakeholders to create new habitats to sequester carbon, which will help prevent urban flooding downstream. Using the landscape more efficiently will support the UK in its ambition to reach net zero.  "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We will now start to enrol each project. This will be led by colleagues in the Environment Agency and Natural England.    "
        },
        {
            "text": "Projects will then move into the Project Development Phase (PDP), in which they will have up to 2 years to complete project development activities. "
        },
        {
            "text": "These activities will include developing detailed land management plans, quantifying environmental and social outcomes and further assessing the impact on food production.   "
        },
        {
            "text": "Subject to reaching agreement on suitable funding, projects will then move into implementation.   "
        },
        {
            "text": "We will open a third round of Landscape Recovery in 2024."
        },
        {
            "text": "Subscribe to the Farming blog for updates and for more project spotlight posts.  "
        }
    ]
}