{
    "url": "https://teaching.blog.gov.uk/2023/11/29/school-leaders-tips-on-their-pupil-premium-strategy/",
    "title": "School leaders tips on their pupil premium strategy  ",
    "authors": [
        "Jane Elsworth",
        "Clare Greene",
        "Julie Kettlewell"
    ],
    "categories": [
        "Pupil premium & PE premium",
        "Pupil wellbeing and behaviour",
        "School funding",
        "Secondary schools"
    ],
    "pub_date": "2023-11-29T10:07:45+00:00",
    "content": [
        {
            "text": "The deadline of 31st of December, for schools to publish their annual pupil premium strategy statement to their website, is fast approaching. You can access the DfE strategy statement template and guidance documents here. "
        },
        {
            "text": "In the lead up to the deadline, you may be seeking advice and guidance from your peers about how to develop and implement an effective pupil premium strategy for your school.  In all 3 blogs linked below, school leaders explain how they use pupil premium funding to improve the educational outcomes of disadvantaged pupils in their schools.  "
        },
        {
            "heading": 3,
            "text": "Pupil Premium Strategy: We prioritise understanding our pupils’ key barriers to learning "
        },
        {
            "text": "Members of staff at NEAT Academy Trust explain how they diagnose the complex needs of their disadvantaged pupils and identify the resources needed to support them.  "
        },
        {
            "text": "Read the full blog "
        },
        {
            "heading": 3,
            "text": "A 360 overview of our Pupil Premium Strategy "
        },
        {
            "text": "Jane Elsworth, the director and deputy headteacher of Huntington Research School, along with her colleague Julie Kettlewell, the assistant director and assistant headteacher, give us a full breakdown of their pupil premium strategy from start to finish. "
        },
        {
            "text": "Read the full blog "
        },
        {
            "heading": 3,
            "text": "A headteacher’s top tips to effectively manage Pupil Premium funding "
        },
        {
            "text": "Clare Greene, an executive headteacher in the South West of England and evidence lead in education for West Somerset Research School, tells us her tips about how to effectively managing Pupil Premium funding.   "
        },
        {
            "text": "Read the full blog "
        },
        {
            "text": " "
        },
        {
            "text": "Further reading: "
        },
        {
            "text": "Pupil premium: overview - GOV.UK (www.gov.uk) "
        },
        {
            "text": "Pupil premium: allocations and conditions of grant 2023-24 - GOV.UK (www.gov.uk) "
        },
        {
            "text": "Using pupil premium: guidance for school leaders (publishing.service.gov.uk) "
        },
        {
            "text": "Guidance reports | EEF (educationendowmentfoundation.org.uk) "
        }
    ]
}