{
    "url": "https://defralanduse.blog.gov.uk/2023/11/29/the-biodiversity-net-gain-statutory-instruments-explained/",
    "title": "The Biodiversity Net Gain Statutory Instruments - explained",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "BNG",
        "Land Use"
    ],
    "pub_date": "2023-11-29T16:54:24+00:00",
    "content": [
        {
            "text": "Today, we published the draft secondary legislation which provides the detail for the new biodiversity net gain (BNG) framework. There are six statutory instruments which will become law when BNG goes live in January 2024."
        },
        {
            "text": "BNG will apply to most new major development under the Town and Country Planning Act (TCPA) from January 2024 and to small sites from April 2024."
        },
        {
            "text": "We have committed to BNG applying to NSIPs from November 2025. To support their readiness, we will consult on the biodiversity gain statement in March 2024 and publish a final version, alongside further NSIP guidance, in September 2024."
        },
        {
            "text": "What is secondary legislation?"
        },
        {
            "text": "Secondary legislation is law created by ministers under powers given to them by an Act of Parliament."
        },
        {
            "text": "It is used to fill in the details of Acts (primary legislation). The relevant primary legislation for BNG is the Environment Act 2021. These details provide practical measures that enable the law to be enforced and operate in daily life."
        },
        {
            "text": "What is a Statutory Instrument?"
        },
        {
            "text": "Statutory Instruments (SIs) are documents drafted by a government department to make changes to the law."
        },
        {
            "text": "SIs are the most frequently used type of secondary legislation, with approximately 3,500 made each year, although only about 1,000 need to be considered by Parliament."
        },
        {
            "text": "They usually have either rule, order or regulation in their title, the BNG SIs are all referred to as regulations."
        },
        {
            "text": "What do the six BNG SIs cover?"
        },
        {
            "text": "There are six SIs that all work together to deliver the new BNG framework. They all cover different areas but need to go live all together on day 1 to put in place the framework to ensure that developers can meet the new duty to deliver a 10% net gain."
        },
        {
            "text": "Tomorrow we will lay the first of the regulations to be considered and approved by parliament:"
        },
        {
            "text": "The Biodiversity Gain (Town and Country Planning) (Consequential Amendments) Regulations 2023 "
        },
        {
            "text": "These regulations make further consequential amendments to existing primary legislation on planning, to integrate the BNG framework. These amendments include the definition of a planning authority under Schedule 7A which sets out the BNG framework."
        },
        {
            "text": "The Biodiversity Gain Site Register (Financial Penalties and Fees) Regulations 2023 "
        },
        {
            "text": "These regulations allow for fees to be charged for applications to register land in the biodiversity gain site register and allows the register operator (Natural England) to issue financial penalties where false or misleading information is provided."
        },
        {
            "text": "Today we have also published the following draft regulations. There may be minor changes to the legal drafting before these are signed by Ministers and laid in parliament, once the above regulations have been approved."
        },
        {
            "text": "The Biodiversity Gain Site Register Regulations 2023"
        },
        {
            "text": "These regulations allow for a new, publicly available “biodiversity gain site register”. The biodiversity gain site register will provide a publicly accessible record of the off-site BNG commitments that have been entered into. The register will be established and operated by Natural England, who will ensure that information in it is accessible to the public."
        },
        {
            "text": "The Regulations set the eligibility criteria which must be met for land to be registered. In principle, these criteria will require that habitats are improved for biodiversity, and these enhancements must be made available to be allocated to a development as biodiversity units where planning permission has been granted for that development. These habitat enhancements must be secured by an appropriate legal agreement for at least 30 years."
        },
        {
            "text": "The Biodiversity Gain Requirements (Exemptions) Regulations 2023"
        },
        {
            "text": "These regulations set out categories of development which are exempt from needing to create a biodiversity net gain. This list is narrow and is intended to keep the policy ambitious but proportionate. Development which has received planning permission after day 1 but falls under one of these exemptions is not required to deliver the 10% net gain."
        },
        {
            "text": "We will publish a further blog with more details on how the exemptions apply to development."
        },
        {
            "text": "The Biodiversity Gain Requirements (Irreplaceable Habitat) Regulations 2023"
        },
        {
            "text": "These regulations set out the list of habitats to be considered irreplaceable for BNG metric calculation purposes and ensures that the regular 10% requirement is not applied to them. You can find more details in our previous blog on irreplaceable habitats and BNG."
        },
        {
            "text": "Because these habitats are valuable and difficult to recreate, it would be impossible to compensate for their loss with a simple 10% net gain. Instead, these regulations require alternative bespoke compensation to be agreed between the developer and the local planning authority."
        },
        {
            "text": "Irreplaceable habitats already have significant protection in the National Planning Policy Framework. Impacts on these habitats from development require a strong justification. BNG will strengthen these protections further."
        },
        {
            "text": "There will be a public consultation on the definition of irreplaceable habitats in 2024."
        },
        {
            "text": "The Biodiversity Gain (Town and Country Planning) (Modifications and Amendments) (England) Regulations 2024"
        },
        {
            "text": "These regulations set out how the new BNG framework sits within the development management process for planning applications.  This includes the content and form of the BNG plan, the procedure for submission and approval of the plan, as well as who should approve the plan. The regulations set out that the local planning authority should determine the plan within 8 weeks unless an alternative period is agreed. The regulations also set out the process for making an appeal relating to the determination of the BNG plan."
        },
        {
            "text": "The regulations set out modifications to the BNG framework for planning permissions where development will occur in phases, to ensure that BNG is achieved over the whole development (thought the proportion delivered on each phase may vary). The regulations also cover modifications relating to variations to eligible planning permissions to ensure the general biodiversity gain condition applies, but there are circumstances where an earlier plan is regarded as approved for the purpose of the new permission granted under section 73."
        },
        {
            "text": "Where can I find the SIs?"
        },
        {
            "text": "Two of the SIs are subject to additional parliamentary procedure which means that they need to be approved by Parliament before they can be made (signed into law) and brought into effect as law. These are the first two instruments that will be laid tomorrow, and they will be published on the government’s legislation website, legislation.gov.uk, this usually happens the day after the legislation is laid before parliament."
        },
        {
            "text": "The remaining SIs will be laid once the first two SIs have been approved by parliament. In the meantime, the draft versions linked above have been published for information, to enable stakeholders to prepare for BNG."
        },
        {
            "text": "Who should read the SIs?"
        },
        {
            "text": "Planning lawyers, planners and other specialists will want to look at these SIs to familiarise themselves as they set out the detailed legislative framework for BNG"
        },
        {
            "text": "The SIs are legal documents, and the language can be difficult to understand if you’re not legally qualified. A further document called an explanatory memorandum has been published alongside each SI which helps to explain the purpose and content of the SI and why the regulations are necessary."
        },
        {
            "text": "There will also be easy to read BNG guidance, based on the regulations to help developers, local planning authorities, landowners and other users to understand how they should implement BNG."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}