{
    "url": "https://publicguardian.blog.gov.uk/2026/01/16/investigations-at-opg/",
    "title": "Investigations at OPG",
    "authors": [
        "dquill"
    ],
    "categories": [
        "Investigations",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2026-01-16T12:00:00+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Last year, our teams handled more than 11,000 concerns reported to us – with only around a third falling within our legal powers to act. Understanding how investigations work at the Office of the Public Guardian (OPG), and how we use the information you share, can make the process clearer and easier to navigate. "
        },
        {
            "text": "One of our principal responsibilities is to consider concerns about how a donor’s affairs are being managed, including whether decisions made on their behalf are done in their best interests.  "
        },
        {
            "text": "From October 2025, concerns about the misuse of a lasting/ enduring power of attorney (LPA/ EPA) or deputyship order can be reported online using our digital form . This improved service is designed to make reporting simpler, quicker and more accessible; while helping us gather everything we need to decide how best to respond. We hope this will become the main route for concerns to be reported to us.   "
        },
        {
            "heading": 3,
            "text": "When should you get in touch with us?  "
        },
        {
            "text": "We encourage you to contact us if you believe an attorney or deputy is not acting in the best interests of the person they support. Some examples that might raise concern include: "
        },
        {
            "text": "We cannot investigate concerns if:  "
        },
        {
            "text": "If we’re unable to investigate, we will explain any reasoning and direct you to other organisations that may be able to help, such as the police or local authorities. "
        },
        {
            "heading": 3,
            "text": "Checking if an LPA or deputyship exists"
        },
        {
            "text": "If you’re unsure if an LPA or deputyship order is in place or are unable to approach the donor directly, you can request a search of the OPG registers. This allows you to check whether an LPA, enduring power of attorney (EPA), or deputyship order is registered, and who is acting on behalf of the donor.  "
        },
        {
            "text": "You can find details about how to complete a search via our FAQs. "
        },
        {
            "heading": 3,
            "text": "How our investigations work"
        },
        {
            "text": "When a concern is raised, we review all available information to determine if we have enough evidence and the legal authority to act. If we open an investigation, there are three possible outcomes: "
        },
        {
            "heading": 3,
            "text": "How much legal authority do we have?"
        },
        {
            "text": "Under the Mental Capacity Act 2005, we can explore whether someone appointed under a lasting/ enduring power of attorney, or by the Court of Protection, is acting in the best interests of the person they represent. "
        },
        {
            "text": "However, it’s important to understand that our powers are specific and limited. The law allows us to: "
        },
        {
            "text": "We cannot: "
        },
        {
            "heading": 3,
            "text": "How long does an investigation take?  "
        },
        {
            "text": "Where there is enough evidence to begin an investigation, we aim to respond within five working days. Most investigations are complex and can take several months to complete, depending on the circumstances of the case. "
        },
        {
            "text": "If an investigation is likely to exceed 14 weeks, we will inform anyone who is legally entitled to updates. Information is not typically provided to any third parties, including the person who raised the concern, unless they have a professional safeguarding role.  "
        },
        {
            "text": "We are currently experiencing a period of high demand, which may mean some investigations take longer to complete. "
        },
        {
            "heading": 3,
            "text": "What if an attorney or deputy doesn't cooperate?  "
        },
        {
            "text": "If an attorney or deputy does not cooperate with our investigation, or if we uncover evidence of abuse, we may need to take further action by applying to the Court of Protection. Here, the Court can order attorneys or deputies to provide evidence of their decisions, and where necessary, restrict or remove their powers. "
        },
        {
            "text": "The Court of Protection is the specialist Court responsible for making decisions about someone’s property, finances, health, or welfare when they lack the mental capacity to do so themselves. While we can investigate and escalate concerns about attorneys or deputies, only the Court has the authority to act if a breach of duties is suspected. "
        },
        {
            "heading": 3,
            "text": "How to raise a concern"
        },
        {
            "text": "If you find yourself concerned about the actions of an attorney or deputy, please don’t hesitate to reach out to us. You can contact us at: "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Ymchwiliadau yn Swyddfa'r Gwarcheidwad Cyhoeddus"
        },
        {
            "text": "Y llynedd, deliodd ein timau â dros 11,000 o bryderon a adroddwyd i ni - gyda dim ond tua thraean yn dod o fewn ein pwerau cyfreithiol i weithredu. Gall deall sut mae ymchwiliadau'n gweithio yn Swyddfa'r Gwarcheidwad Cyhoeddus (OPG), a sut rydym yn defnyddio'r wybodaeth rydych chi'n ei rhannu, wneud y broses yn fwy clir ac yn haws ei defnyddio. "
        },
        {
            "text": "Un o'n prif gyfrifoldebau yw ystyried pryderon ynghylch sut mae materion rhoddwyr yn cael eu rheoli, gan gynnwys a yw penderfyniadau sy'n cael eu gwneud ar eu rhan yn cael eu gwneud er eu lles gorau.  "
        },
        {
            "text": "O fis Hydref 2025 ymlaen, gellir rhoi gwybod ar-lein am bryderon ynghylch camddefnyddio atwrneiaeth arhosol/barhaus (LPA/EPA) neu orchymyn dirprwyaeth gan ddefnyddio ein ffurflen ddigidol. Mae'r gwasanaeth gwell hwn wedi'i gynllunio fel bod y broses adrodd yn symlach, yn gyflymach ac yn fwy hygyrch; gan ein helpu i gasglu popeth sydd ei angen arnom i benderfynu ar y ffordd orau o ymateb. Rydym yn gobeithio mai dyma fydd y prif ddull o roi gwybod i ni am bryderon.  "
        },
        {
            "heading": 3,
            "text": "Pryd ddylech chi gysylltu â ni? "
        },
        {
            "text": "Ni allwn ymchwilio i bryderon os:  "
        },
        {
            "text": "Os na allwn ymchwilio, byddwn yn egluro unrhyw resymau ac yn eich cyfeirio at sefydliadau eraill a allai helpu, fel yr heddlu neu awdurdodau lleol. "
        },
        {
            "heading": 3,
            "text": "Gwirio a oes LPA neu ddirprwyaeth yn bodoli"
        },
        {
            "text": "Os nad ydych chi'n siŵr a oes LPA neu orchymyn dirprwyaeth ar waith neu os nad ydych chi'n gallu cysylltu â'r rhoddwr yn uniongyrchol, gallwch wneud cais i chwilio cofrestrau'r OPG. Mae hyn yn eich galluogi i wirio a yw LPA, atwrneiaeth barhaus (EPA), neu orchymyn dirprwyaeth wedi'i gofrestru, a phwy sy'n gweithredu ar ran y rhoddwr.  "
        },
        {
            "text": "Cymerwch gip ar ein Cwestiynau Cyffredin i gael manylion am sut mae mynd ati i chwilio.  "
        },
        {
            "heading": 3,
            "text": "Sut mae ein hymchwiliadau'n gweithio "
        },
        {
            "text": "Pan godir pryder, rydym yn adolygu'r holl wybodaeth sydd ar gael i benderfynu a oes gennym ddigon o dystiolaeth a'r awdurdod cyfreithiol i weithredu. Os byddwn yn agor ymchwiliad, mae tri chanlyniad posibl: "
        },
        {
            "heading": 3,
            "text": "Faint o awdurdod cyfreithiol sydd gennym? "
        },
        {
            "text": "Dan Ddeddf Galluedd Meddyliol 2005, gallwn archwilio a yw rhywun a benodir dan atwrneiaeth arhosol/barhaus, neu gan y Llys Gwarchod, yn gweithredu er lles gorau'r unigolyn y maent yn ei gynrychioli. "
        },
        {
            "text": "Fodd bynnag, mae'n bwysig deall bod ein pwerau'n benodol ac yn gyfyngedig. Mae'r gyfraith yn caniatáu i ni: "
        },
        {
            "text": "Ni allwn: "
        },
        {
            "heading": 3,
            "text": "Pa mor hir mae ymchwiliad yn ei gymryd?  "
        },
        {
            "text": "Os oes digon o dystiolaeth i ddechrau ymchwiliad, ein nod yw ymateb o fewn pum diwrnod gwaith. Mae'r rhan fwyaf o ymchwiliadau'n gymhleth a gallant gymryd sawl mis i'w cwblhau, yn dibynnu ar amgylchiadau'r achos. "
        },
        {
            "text": "Os yw ymchwiliad yn debygol o bara am fwy na 14 wythnos, byddwn yn rhoi gwybod i unrhyw un sydd â hawl gyfreithiol i gael yr wybodaeth ddiweddaraf. Nid yw gwybodaeth fel arfer yn cael ei rhoi i unrhyw drydydd parti, gan gynnwys yr unigolyn sydd wedi codi'r pryder, oni bai fod ganddynt rôl ddiogelu broffesiynol.  "
        },
        {
            "text": "Ar hyn o bryd rydym yn profi cyfnod o alw mawr, a allai olygu bod rhai ymchwiliadau'n cymryd mwy o amser i'w cwblhau. "
        },
        {
            "heading": 3,
            "text": "Beth os nad yw atwrnai neu ddirprwy yn cydweithredu?  "
        },
        {
            "text": "Os na fydd atwrnai neu ddirprwy yn cydweithredu â'n hymchwiliad, neu os byddwn yn datgelu tystiolaeth o gamddefnyddio, efallai y bydd angen i ni gymryd camau pellach drwy wneud cais i'r Llys Gwarchod. Yma, gall y Llys orchymyn i atwrneiod neu ddirprwyon ddarparu tystiolaeth o'u penderfyniadau, a lle bo angen, cyfyngu neu ddileu eu pwerau. "
        },
        {
            "text": "Y Llys Gwarchod yw'r Llys arbenigol sy'n gyfrifol am wneud penderfyniadau am eiddo, cyllid, iechyd neu les rhywun pan nad oes ganddo'r galluedd meddyliol i wneud hynny ei hun. Er y gallwn ymchwilio i bryderon am atwrneiod neu ddirprwyon a'u huwchgyfeirio, dim ond y Llys sydd â'r awdurdod i weithredu os amheuir bod dyletswyddau wedi cael eu torri. "
        },
        {
            "heading": 3,
            "text": "Sut mae mynegi pryder   "
        },
        {
            "text": "Os ydych chi'n poeni am weithredoedd atwrnai neu ddirprwy, mae croeso i chi gysylltu â ni. Gallwch anfon e-bost atom yn: "
        }
    ]
}