{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/16/speculation-on-local-elections/",
    "title": "Speculation on local elections",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections",
        "Local government"
    ],
    "pub_date": "2026-01-16T08:54:05+00:00",
    "content": [
        {
            "text": "There has been continued speculation in the media about the potential number of areas that may have their local elections postponed this May."
        },
        {
            "text": "To be clear: no decisions have been taken. Councils had until 23:59 tonight (15 January) to submit their representations, and ministers will now assess the evidence before making any decisions."
        },
        {
            "text": "The position remains that all elections should go ahead unless there is strong, evidence-based justification for a temporary delay. The vast majority of local elections in May 2026 are not affected by local government reorganisation and will proceed as planned."
        },
        {
            "text": "Where councils are undergoing reorganisation, we invited local leaders to tell us whether a delay would free up capacity to deliver these essential reforms. If they said yes, we are listening carefully. If they say no, there will be no delay. This approach respects local judgment rather than imposing decisions from Whitehall."
        },
        {
            "text": "There is clear precedent for this. Previous governments postponed local elections during reorganisation, including in Cumbria, Somerset and North Yorkshire between 2019 and 2021."
        },
        {
            "text": "Running elections for councils that are about to be abolished risks diverting scarce resources — staff, money and time — away from frontline services and the work needed to create stronger, more accountable local government. Councils themselves, across all political stripes, have raised concerns that holding these elections would derail reorganisation and delay improvements residents have waited years for."
        },
        {
            "text": "Reorganisation will cut the number of councillors, and bring critical services like housing, planning and roads under one roof to speed up decision making in key areas like housebuilding."
        },
        {
            "text": "As a result, residents will receive better, more efficient public services, freeing up cash to be invested in local priorities."
        },
        {
            "text": "Any decisions will be announced to Parliament in the usual way."
        }
    ]
}