{
    "url": "https://companieshouse.blog.gov.uk/2026/01/16/understanding-identity-verification-for-people-with-significant-control-pscs/",
    "title": "Understanding identity verification for people with significant control (PSCs)",
    "authors": [
        "Identity Verification Team"
    ],
    "categories": [
        "Changes to UK company law",
        "Digital transformation",
        "Running a company"
    ],
    "pub_date": "2026-01-16T09:54:26+00:00",
    "content": [
        {
            "text": "As part of the UK government's efforts to tackle economic crime and improve transparency, Companies House has introduced new identity verification requirements for people with significant control (PSCs). If you're a PSC of a company, this blog post will help you to understand:"
        },
        {
            "heading": 2,
            "text": "What is a PSC?"
        },
        {
            "text": "A PSC is someone who owns or controls a company. A PSC may hold more than 25% of the shares or voting rights, have the power to appoint or remove directors, or otherwise influence key decisions, even without formal ownership. Many PSCs are also directors, but this is not always the case."
        },
        {
            "text": "A PSC could be:"
        },
        {
            "text": "In small and medium-sized enterprises (SMEs) and family businesses, a PSC could be:"
        },
        {
            "heading": 2,
            "text": "Why PSCs need to verify their identity"
        },
        {
            "text": "Identity verification has been introduced to help tackle fraud, improve the accuracy of information on the Companies House register, and make it harder for criminals to use fake or stolen identities to set up and control companies. These changes will help create a more trustworthy business environment where honest companies can thrive."
        },
        {
            "heading": 2,
            "text": "When PSCs need to complete identity verification"
        },
        {
            "text": "When you need to complete identity verification depends on your specific circumstances. Every PSC has a 14-day period during which they must provide their Companies House personal code and a verification statement."
        },
        {
            "text": "You can get your personal code by verifying your identity either through the Verify your identity for Companies House service, which uses GOV.UK One Login, or via an Authorised Corporate Service Provider (ACSP). You only need to do this once – the same personal code can then be used to link your verified identity to each role you hold."
        },
        {
            "text": "If you're both a PSC and a director of the same company, your 14-day period starts from the day after the company's confirmation statement date.For example, if your company’s confirmation statement date is 31 March 2026, your 14-day verification period as a PSC would run from 1 April to 14 April 2026."
        },
        {
            "text": "If you're a PSC but not a director of the company, you must complete identity verification within the first 14 days of your birth month. This makes sure that where a PSC is not directly involved in the running of the company, they have a clearly defined period for complying with identity verification requirements"
        },
        {
            "text": "As an example, if your birthday is 24 February, your 14-day verification period as a PSC would run from 1 February to 14 February 2026."
        },
        {
            "text": "If you’re a new PSC, you can provide your personal code when you’re first added to the register, or within 14 days of the date on the direction letter sent to you shortly after you’re added."
        },
        {
            "text": "You can check your specific due dates on the Companies House register."
        },
        {
            "heading": 2,
            "text": "How to provide your personal code to Companies House"
        },
        {
            "text": "Once you’ve verified your identity and received your personal code, you can use the Provide identity verification details for a PSC service to link your personal code to the PSC roles you hold."
        },
        {
            "text": "After you’ve signed in, you’ll be asked for the company number. The service will then list the company’s PSCs, where you can find your name and provide your personal code."
        },
        {
            "text": "You’ll only be able to provide the personal code once your 14-day period has started."
        },
        {
            "text": "Alternatively, you can share your personal code with the company or an ACSP who can provide it for you during your 14-day period."
        },
        {
            "heading": 2,
            "text": "Data mismatches"
        },
        {
            "text": "The ‘Provide identity verification details for a PSC’ service will check the details used to verify your identity and match them to the details Companies House holds."
        },
        {
            "text": "If the details do not match, you will not be able to connect your verified identity to our records. This might be because your date of birth is incorrect on our records or if you verified your identity with an ACSP, they may have provided incorrect details for you."
        },
        {
            "text": "Find out what you should do if the personal details linked to your code do not match our records."
        },
        {
            "heading": 2,
            "text": "Important things to remember"
        },
        {
            "text": "Before you verify, make sure the personal details held by Companies House (such as your date of birth) match the details on your identity documents. If they do not match, you’ll need to update your details before you link your verified identity to your PSC role."
        },
        {
            "text": "If you cannot provide your verification details on time, you can request a 14-day extension before your deadline passes using the online service."
        },
        {
            "text": "If you do not comply with identity verification requirements as a PSC, you may be committing an offence and have to pay a financial penalty or fine. In the future, we may also display a note against your name on the public register."
        }
    ]
}