{
    "url": "https://environmentagency.blog.gov.uk/2015/10/29/electrofishing-to-assess-a-rivers-health/",
    "title": "Electrofishing to assess a river's health",
    "authors": [
        "Dan Hayter"
    ],
    "categories": [
        "Fisheries and biodiversity",
        "Water"
    ],
    "pub_date": "2015-10-29T15:12:54+00:00",
    "content": [
        {
            "heading": 2,
            "text": "For me, an average day at work consists of a boat, a net, a few colleagues and a lot of fish. And I love it."
        },
        {
            "text": "It is amazing what you can find out about fish now."
        },
        {
            "text": "I work for the Environment Agency as an Environment Monitoring officer in Essex, Norfolk and Suffolk, specialising in fisheries, and as part of my work lead a team carrying out fish surveys across the area."
        },
        {
            "text": "I specialise in electro-fishing, which tells us a whole host of information about the fish, from their age and their weight to how healthy they are."
        },
        {
            "text": "Electro-fishing sounds very high tech but it is actually quite simple and involves passing a mild electrical field through the water to immobilise the fish. We then net the fish and place them in a holding tank filled with water where they recover straight away. We can then carefully remove a scale from the fish and record length measurements. After that, we release them all back into the river keeping interference to a minimum."
        },
        {
            "text": "Although electro-fishing may seem a little extreme, it is actually harmless to the fish and is a very humane way of catching them and allowing us to carry out this vital work. Although we take a scale from some fish, this does not cause them a problem as they quickly grow new scales."
        },
        {
            "text": "Not a lot of people know this, but just one scale from the fish tells us how old they are (similar to rings inside a tree trunk). We only take scales from a small number of the fish we catch, so we have just enough age data for our needs."
        },
        {
            "text": "The surveys are carried out between the spring and autumn and are normally undertaken by a team of 4. We choose a certain section of a watercourse and repeat at regular intervals to give us vital info on trends within the fish population. The data set we have in our area is of the best quality and some of it goes back around 30 years."
        },
        {
            "text": "We carry out these fish surveys for a number of reasons. It is obviously useful for the millions of anglers out there to know information about fish stocks, and it also gives us a good indication of the health of the river, which is important for lots of reasons, with the status needing to meet set European standards."
        },
        {
            "text": "I also carry out eel monitoring between March and September. My colleagues and I count the elvers (young eels) and eels that migrate into our rivers after their amazing transatlantic journey. Eels are classed as endangered and this information helps assess the progress made by European countries to aid eel population recovery."
        },
        {
            "text": "Hydroacoustic fish surveys are another thing which I help with. These are carried out on tidal rivers where electro-fishing cannot be done due to the size of the river and the saline water. In our area, these are mostly carried out on the Broadland rivers in Norfolk. We do the surveys at night when the fish are more active and spread across the river channel due to the reduced threat from predators."
        },
        {
            "text": "Hydroacoustic fish surveys use sonar equipment, which sends sound waves through the water, recording the number of fish present, and the location."
        },
        {
            "text": "I know that all the data I collect is vital to help protect and enhance the environment and I feel very lucky to have a job that is so valued...and good fun!"
        },
        {
            "text": "Dan Hayter  has worked for the EA for 13 years, and is now Environment Monitoring officer for Essex, Norfolk and Suffolk, specialising in fisheries."
        },
        {
            "text": "You can find out more about the Environment Agency's work on Twitter."
        }
    ]
}