{
    "url": "https://nda.blog.gov.uk/hollys-apprenticeship-journey-in-nuclear-decommissioning/",
    "title": "Holly’s apprenticeship journey in nuclear decommissioning",
    "authors": [
        "Holly New"
    ],
    "categories": [
        "Early careers",
        "Recruitment",
        "Skills"
    ],
    "pub_date": "2026-02-13T11:12:52+00:00",
    "content": [
        {
            "text": "Holly New, Project Management Degree Apprentice, joined the Nuclear Decommissioning Authority (NDA) as a Business Admin Apprentice in September 2023, working as part its Group Cyber Services (GCS) team."
        },
        {
            "text": "She has played a key role in supporting a variety of initiatives regarding cyber security across the NDA group – which is responsible for safely decommissioning the nation’s earliest nuclear sites – as well being an invaluable figure supporting other apprentices entering the NDA."
        },
        {
            "text": "I always knew I didn’t want to go down the more traditional post-18 education routes."
        },
        {
            "text": "I knew I wanted a career where I could build practical skills while continuing to learn. I have always enjoyed organising work, supporting different teams and being open to new experiences, so the apprenticeship scheme seemed like a perfect fit for me, and I knew the opportunities for development it could lead to were infinite. For two years, I studied for a level 3 business admin apprenticeship, based within the GCS team. I was drawn to the idea of earning a qualification while learning real hands-on experience in a professional environment and the two years within this team really afforded me that. Digital capabilities have become ever more critical to decommissioning in the current climate, and I enjoyed being part of a team who are an important part of our cyber security capabilities. And between phishing, vishing, and smishing, every day I was being kept on my toes and enhancing my learning and development!"
        },
        {
            "text": "At the end of this apprenticeship, I knew I wanted to continue my development further. Through support from Energus and the NDA, I was fortunate enough to develop onto the project management degree apprenticeship scheme, which started in September 2025."
        },
        {
            "text": "My project management apprenticeship involves a balance of university work and workplace responsibilities. On the job, I have had the opportunity to lead and get involved in various projects, to support different service teams and to contribute to improving processes for example leading a service refresh project within the Cyber services team and a team building project at Energus which both contribute to ensuring standardisation, aligning to NDA values and ensuring safety and compliance in this work. The study side has given me an in-depth understanding of project management concepts, such as collaborating with cyber small medium enterprises (SMEs) and governance bodies, managing cyber tasks and security improvements, and supporting project lifecycles. This has been of real benefit as modules such as scheduling work and projects and organisations have been the main ones I have been working on presently in my apprenticeship."
        },
        {
            "text": "There have been two standout examples throughout my apprenticeship."
        },
        {
            "text": "The first is recently supporting on the NDA group’s involvement in Nuclear Week in Parliament and the sector skills fair. During the week, I engaged with not just parliamentarians, but other high-level representatives in the nuclear supply chain, effectively showcasing the breadth of the NDA group and opportunities available."
        },
        {
            "text": "The second was winning the Outstanding Apprentice Achievement Award at a recent ceremony hosted by Energus that commemorated apprentices and graduates in the current cohort, as it was a real recognition of all my hard work and I was really proud to even just be nominated, let alone win!"
        },
        {
            "text": "What really appealed to me about choosing an apprenticeship with NDA was the various opportunities you can be exposed to and the importance of their work. Being part of an organisation, whose mission is crucial to the UK, felt extremely meaningful and exciting. Additionally, I have always been impressed by NDA’s commitment to developing early careers and the number of opportunities that come through their apprenticeship schemes."
        },
        {
            "text": "There have been many highlights during my time at the NDA such as contributing to important work, expanding my confidence and knowledge through new responsibilities and meeting different stakeholders, both internal and external. I’ve had the opportunity to meet new apprentices from different areas of the NDA group which has helped me build connections and learn from other individuals’ experiences."
        },
        {
            "text": "Lastly, I have been able to travel up and down the country to different nuclear sites and office spaces, seeing the real breadth of how far reaching our mission is, and the communities it is supporting."
        },
        {
            "text": "I would absolutely recommend the apprenticeship route to others. It’s an excellent way to gain qualifications and build practical experience all at the same time. For anyone who enjoys new opportunities, working in a team and wants a strong start to their career, NDA apprenticeships are there to build confidence and sets you up for skills to benefit your future career. I have genuinely found my passion, and I can’t wait to see what the future brings."
        }
    ]
}