{
    "url": "https://civilservice.blog.gov.uk/2026/02/13/part-2-why-we-love-the-civil-service/",
    "title": "Part 2 - Why we love the Civil Service",
    "authors": [
        "Lorraine McBride, senior editor, Civil Service Blog team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-02-13T19:00:00+00:00",
    "content": [
        {
            "text": "This Valentine’s Day, civil servants reveal what really makes their hearts beat a little faster at work: from the small everyday wins to big reasons to stay, these are the stories our staff are proud to love! Interviews by Lorraine McBride"
        },
        {
            "heading": 2,
            "text": "Moment I knew my job was worth it"
        },
        {
            "text": "Safer routes to school, greener journeys, healthier communities – this is what good infrastructure investment looks like, writes Melanie Etherton, Inspector, Active Travel England"
        },
        {
            "text": "What I love most is seeing the difference our work makes to everyday life. As an Inspector, I visit places transformed to make walking and cycling safer and more appealing. "
        },
        {
            "text": "One of my favourite new routes is in Stevenage, a route we helped fund last summer. When I visited, teenagers were relaxed, chatting and laughing as they rode their bikes to school by themselves. Moments like that show what good public investment can achieve: fun, safe routes, greener journeys and healthier lives. Creating spaces where people feel safe to move and connect is why I do the job – and why I'm proud to do it."
        },
        {
            "heading": 2,
            "text": "How helping others helped me find my voice"
        },
        {
            "text": "From anxious phone calls to career-defining confidence, Abby Tipping’s Civil Service journey shows how supporting others can unlock your own potential."
        },
        {
            "text": "My “This is why I do my job” moment didn’t come in a meeting or milestone email. It came through my headset working on PIP [Personal Independent Payments] Telephony. Speaking to vulnerable customers and hearing the relief in their voices brings a powerful reminder that our work matters. "
        },
        {
            "text": "I didn’t expect how fulfilling it would be to help colleagues shine – supporting them to put their achievements into words, build confidence and gain recognition. My defining moment came when I secured my role as Comms Manager for Accessibility, Disability and Disputes in DWP  through the Opportunity for All scheme. It wasn’t just a new job - it transformed my confidence.  "
        },
        {
            "text": "I couldn’t have reached that point without Tim Davis from People and Capability. Tim’s guidance helped me craft stronger personal statements and recognise my strengths."
        },
        {
            "text": "That’s what I value most about the  Civil Service: real opportunities to grow, supportive people and the chance to make a real difference when it matters most."
        },
        {
            "heading": 2,
            "text": "Heartbeat behind the hardest problems"
        },
        {
            "text": "Monika Paloschi, Deputy Director Commercial, in the Cabinet Office’s Complex Transactions Team, on finding meaning in government’s most complex deals."
        },
        {
            "text": "The heartbeat of my job isn’t the commercial deal itself – it’s the people at the end of it. In the CTT, I help shape strategies for some of the government's toughest commercial challenges, from new hospitals and rebuilt schools, to cladding remediation. But the real moment it clicks is when the paperwork fades and the impact comes into focus. A strategy I helped shape isn't just a document – it means a safer home for a family, a better classroom for a child, or a modern hospital for a patient. "
        },
        {
            "text": "I couldn’t do it without my team. They challenge me, back me and give me the confidence to tackle the hardest problems. Together, we turn complex commercial thinking into real-world improvements - and the ultimate reward is knowing together, we’ve made a difference to somebody’s life in the UK."
        },
        {
            "heading": 2,
            "text": "The Job That Stole My Heart"
        },
        {
            "text": "What started as a gap year, became a calling, a career shaped by kindness, and a Civil Service that proved belonging can change everything, says Agnieszka Fularska, Head of South West Regional Support, HM Courts and Tribunals, Bournemouth Law Courts"
        },
        {
            "text": "When I joined the Civil Service in 2005 on a gap year, I expected a short adventure before returning to university in Poland. Instead, the warmth of my colleagues at Winchester Probate Registry changed everything. I cancelled my gap year, transferred my studies, and never looked back."
        },
        {
            "text": "At just 19, supporting families to swear oaths and validate wills was deeply sobering. It taught me early on, the weight - and privilege - of public service. When customers struggled with my accent, my manager Bernice Phillips always stepped in. Her simple act of kindness made me feel protected, valued and seen. "
        },
        {
            "text": "Over the years, I’ve grown from probate, to the county court, and then into regional roles. Training and developing others showed me I could blend my teaching background with my passion for public service, and nothing makes me prouder than seeing colleagues thrive. The Civil Service is a place where who you are matters, and kindness is part of the culture. If you’re willing to grow, it grows with you."
        }
    ]
}