{
    "url": "https://nationalscreening.blog.gov.uk/2024/04/09/anneke-helps-the-uk-nsc-navigate-the-complexities-of-genetics/",
    "title": "Anneke helps the UK NSC navigate the complexities of genetics",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-04-09T11:26:58+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) only makes a positive screening recommendation when it is convinced it will do more good than harm."
        },
        {
            "text": "To determine if any screening proposal is viable, effective and appropriate, the Committee assesses the evidence against a range of criteria including health outcomes, clinical effectiveness, ethical aspects, feasibility and cost effectiveness."
        },
        {
            "text": "Its membership therefore needs to cover an equally broad range of expertise in areas such as public health, general practice, social science, epidemiology, screening implementation, ethics and health economics."
        },
        {
            "heading": 2,
            "text": "Medical background"
        },
        {
            "text": "Dutch-born Anneke moved to the UK as a child when her parents worked for Unilever at Port Sunlight in Cheshire."
        },
        {
            "text": "She trained in general medicine at the University of Newcastle upon Tyne and did much of her junior doctor training in Oxford. Her interest in genetics was first kindled during a year abroad when she spent 6 months on a South Pacific island as part of a clinical research study exploring the relationship between thalassaemia, Glucose-6-phosphatase dehydrogenase deficiency and malaria. Her Wellcome-funded clinical training fellowship resulted in a DPhil exploring genetic factors in type 1 diabetes."
        },
        {
            "text": "Anneke specialised in clinical genetics and entered the emerging speciality just as testing for Huntingdon’s disease and the breast cancer susceptibility genes BRCA1 and 2 became possible. She said:"
        },
        {
            "heading": 2,
            "text": "A rich clinical research seam"
        },
        {
            "text": "Anneke has been a consultant in clinical genetics since 1997, firstly at Oxford, then for 21 years at Southampton. She returned to Oxford in 2021 where she is also Professor of Genomic Medicine at the university."
        },
        {
            "text": "Her interdisciplinary research group moved with her from Southampton to Oxford where she also directs the Centre for Personalised Medicine, a research and engagement vehicle to discuss aspects of genomics – among other means of personalising medicine."
        },
        {
            "text": "Anneke chairs the ethics advisory committee of UK Biobank and the Joint Committee on Genomics in Medicine (JCGM). She also co-leads the national Genethics Forum, where health professionals discuss practical ethical problems encountered through their clinical or laboratory NHS practice. After nearly 70 one-day meetings and discussion of well over 1,000 cases, Anneke still finds that what is ostensibly the same issue can arise in many ways, adding:"
        },
        {
            "heading": 2,
            "text": "Committee’s challenge in managing expectations"
        },
        {
            "text": "Anneke was appointed to the UK NSC in May 2022 and is also a member of its Blood Spot Task Group, which was set up to help researchers develop evidence on screening for rare diseases."
        },
        {
            "text": "She sees her role as helping the committee navigate the complexities around the use of genetics, particularly since media and government headlines can be dominated by enthusiastic but not always achievable messages. She said:"
        },
        {
            "text": "Anneke, who recently presented a UK NSC seminar that explored the potential benefits and limitations of using polygenic scores, added:"
        },
        {
            "heading": 2,
            "text": "Taking a hike outside work"
        },
        {
            "text": "When not at a desk or clinic, Anneke likes the great outdoors. She has enjoyed many a cycling holiday and is currently looking forward to a 26-mile trek in the Brecons in June to raise funds for the Alzheimer’s Society. She explained:"
        },
        {
            "text": "Hill-walking works up an appetite, so it’s also lucky for Anneke that her husband is a competition-winning hobby chef and the elder of their 2 daughters is in the process of setting up a restaurant in Amsterdam."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}