{
    "url": "https://deframedia.blog.gov.uk/2024/04/09/coverage-of-the-launch-of-the-water-restoration-fund/",
    "title": "Coverage of the launch of the Water Restoration Fund",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-04-09T17:06:31+01:00",
    "content": [
        {
            "text": "There has been coverage, including in the Independent, ITV, Evening Standard and Sky News of today’s announcement of the launch of the Water Restoration Fund, which will see £11m in water company fines and penalties invested back into projects that improve the water environment. Water Minister Robbie Moore also carried out a morning radio round including interviews with Times Radio and Bauer Media."
        },
        {
            "text": "All water company environmental fines and penalties since April 2022 have been ringfenced to directly improve the water environment. The Water Restoration Fund will now offer grant funding on a competitive basis to support local groups, farmers and landowners and community-led schemes, bolstering their capacity and capabilities for on-the-ground projects to improve the water environment."
        },
        {
            "text": "As set out in our Plan for Water, funding for the Water Restoration Fund comes exclusively from water company fines and penalties – but it is important to note that these penalties and fines are additional to any reparations that water companies make when they have breached environmental regulations."
        },
        {
            "text": "Today’s announcement follows significant action taken in recent months to hold water companies to account, including a ban on bonuses for water company executives where firms have committed serious criminal breaches, subject to Ofwat consultation, and plans to quadruple the Environment Agency’s regulatory capacity, enabling them to carry out 4,000 water company inspections by the end of this financial year."
        },
        {
            "text": "Environment Secretary Steve Barclay said:  "
        },
        {
            "text": "Natural England’s Chief Executive Marian Spain said:"
        },
        {
            "text": "Fines and penalties issued since October 2023 will now be accrued for future years to be spent on environmental improvements. Last December, the government lifted the cap on civil penalties for water companies, and expanded the range of offenses they cover."
        },
        {
            "text": "This means we are toughening our enforcement tools and expanding where regulators can use them. These changes will deliver a proportionate punishment for operators that breach their permits and cause pollution. Though we aren't in a position to pre-empt future regulatory action or court decisions, this increased scrutiny will likely result in future increases in the funding ringfenced for the environmental improvements from water company penalties."
        },
        {
            "text": "Applicants will have an eight-week window to apply from today, with grant awards expected to be issued from late July. For further details are available in our application guidance."
        }
    ]
}