{
    "url": "https://childrenssocialcare.blog.gov.uk/2024/04/09/drawing-from-personal-experiences-to-improve-childrens-social-care/",
    "title": "Drawing from personal experiences to improve children’s social care",
    "authors": [
        "Mags Mulowska"
    ],
    "categories": [
        "Leadership",
        "Social work: the profession",
        "Wellbeing"
    ],
    "pub_date": "2024-04-09T09:30:19+01:00",
    "content": [
        {
            "text": "In this blog, we hear from Mags Mulowska, member of the Children’s social care National Practice Group (NPG), and social worker. She explains how drawing from her own personal experience of the care system has helped support the development of a National Framework for children’s social care."
        },
        {
            "text": "Why this is important to me"
        },
        {
            "text": "As a member of the National Practice Group (NPG), I am able to represent the voice of all of us with lived experience, on the team of people developing the Children’s Social Care National Framework. The National Framework sets out how social workers practise with children and families. It can help us all understand what social workers are there for and how they can help."
        },
        {
            "text": "My brothers, sisters and I had very differing experiences of children’s social care. Some of it was a good experience, even excellent, and at other times it was very challenging. My family are still coping with the impacts of what we all experienced."
        },
        {
            "text": "This is why I was glad to support the National Framework, especially the development of the animated version. These different versions help break down and explain what the National Framework is to a younger audience. These versions can, and should, be used by practitioners in their work with children, young people, and families. If a child or young person feels that the support they or their family is getting is not what the National Framework says it should be, then they can take action."
        },
        {
            "text": "The framework in practice"
        },
        {
            "text": "In 2015 I trained as a social worker for children and families and once qualified, practised social work in the way I would have wanted me and my siblings to have been supported. I took real care to explore the culture and values of the families I supported, knowing that this is what can often lead to positive change. It is vital that practice considers the economic and social circumstances impacting children, young people and families. Poverty and discrimination affect children, young people and families every day in our society. This is why the National Framework asks practitioners to work to address discrimination and promote equality. The alternate versions encourage children and young people to speak up if their social worker isn’t taking care to explore their experiences and helping to lessen the impacts of them."
        },
        {
            "text": "There is a big focus in the National Framework on working with a child’s wider family network and community. Social workers can help to access the love and support that is available in family networks and ensure that children and young people get to feel the benefit of it. I think this is a really important part of what good social work should be. Your family is who you define as family, so practitioners and children can be creative about who they define as their network! And where it is safe, practitioners will do their best to bring those people on board to help children, young people and families."
        },
        {
            "text": "The National Framework asks people to think ambitiously about their work in children’s social care and to hold high aspirations for children, young people and families. The versions for children and young people are part of our work to bring their voices to the heart of practice."
        },
        {
            "text": "Further reading: "
        }
    ]
}