{
    "url": "https://mhclgmedia.blog.gov.uk/2024/04/09/explainer-data-supporting-governments-work-to-improve-building-safety/",
    "title": "Explainer: data supporting government’s work to improve building safety",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-04-09T17:14:41+01:00",
    "content": [
        {
            "text": "We regularly receive media enquiries about the progress of our remediation programmes and see coverage in the media. In addition to our media statements and regular data publications, this blog sets out various statistics relating to building remediation for journalists and the public. "
        },
        {
            "heading": 3,
            "text": "Building Safety Remediation Data and Statistics "
        },
        {
            "text": "The Government’s work to tackle unsafe cladding in 11m+ buildings around the country continues to accelerate and we are committed to providing updates on a regular basis.  Along with the expansion of monthly updates in November 2023 to cover a much wider range of building safety remediation, Ministers have also committed to providing the House of Commons, and those interested, regular updates of progress, the latest of which was provided on 26 March 2024 and can be accessed here. "
        },
        {
            "text": "The Government publishes a number of different statistics and datasets on building safety remediation and, necessarily, some of those numbers will be based on the best estimates available at the time of publication.  Additionally, different units of measurement, different subsets and different approaches will be used when referencing those statistics.  Following requests for more information about how they all interact, we are publishing this blog to provide further information. "
        },
        {
            "heading": 3,
            "text": "General definitions and units of measurement "
        },
        {
            "text": "All residential buildings above 11 metres in England have a pathway to fix unsafe cladding, protecting leaseholders from these costs. This is either through a taxpayer-funded scheme, a developer-funded scheme, or social housing provider led remediation. "
        },
        {
            "text": "The government publishes data on each of these schemes, with the latest publication here:  "
        },
        {
            "text": "The data which we release on a monthly basis covers those buildings where remediation is being monitored – i.e. those buildings which have been identified as having unsafe cladding and are part of a remediation programme.  We are aware that further buildings need to enter those funds – particularly in the 11 – 18 metre height cohort where the remediation programme has been open for significantly less time than the 18m+ cohort.  All residential buildings above 11m with cladding issues have had a pathway to remediation since the opening of the Cladding Safety Scheme in July 2023, and regulators are encouraging all relevant building owners to come forward.  Until the time when all buildings have been identified and entered into a programme, it will be necessary to estimate the number of further buildings likely to come forward in the future, either voluntarily or through enforcement action.  "
        },
        {
            "text": "Two units of measurement are most commonly used within these programmes: "
        },
        {
            "heading": 3,
            "text": "Progress of Remediation Programmes "
        },
        {
            "text": "As at end February 2024, the department is monitoring the remediation of 4,092 11m+ residential buildings in England identified with unsafe cladding. Of these buildings: "
        },
        {
            "text": "Each building is in one or more of the following remediation programmes. Remediation progress differs by programme due to the different maturity of each programme: "
        },
        {
            "text": "Table 1: Remediation progress by programme (source: Building Safety Remediation data release, February 2024) "
        },
        {
            "text": "Note: ‘Building completed’ include those that have received building control sign-off, and those that are awaiting building control sign-off. ‘Buildings started’ include those that have had their cladding removed but not yet completed remediation. ‘Buildings not started’ include those with plans in place, those not yet with plans in place but with an intent to remediate, those where a remediation plan is unclear and six social housing buildings where remediation work is not required due to demolition works planned. "
        },
        {
            "text": "It should be noted that some buildings are being monitored by more than one remediation programme. For example, an 18m+ building in the Building Safety Fund that has unsafe ACM cladding will appear in both the ACM scheme statistics and the Building Safety Fund statistics. The headline number of 4,092 buildings removes the duplicated buildings so each building in that total is distinct. That is why the sum of buildings in individual programmes is larger than 4,092. "
        },
        {
            "heading": 3,
            "text": "Buildings with a pathway to remediation "
        },
        {
            "text": "As highlighted above, not all buildings above 11m that require building safety works are currently in a remediation programme – where buildings owners are failing to do the right thing, regulators have a range of legal powers to compel them to take action. "
        },
        {
            "text": "We estimate that 6,200 to 8,900 buildings 11-18m in height require remediation. Further information is available here. Of these, 1,565 are already in a remediation programme. The rest of the buildings have a pathway to remediation, and are estimated to contain 100,000 – 160,000 dwellings. This has been calculated using the average number of dwellings in 11-18m residential buildings available in this publication.   "
        },
        {
            "text": "Table 2: Dwellings within remediation programmes and with a pathway to remediation (source: Building Safety Remediation data release, February 2024; Estimating the prevalence and costs of external wall system life-safety fire risk in mid-rise residential buildings in England; Building Safety Programme: monthly data release – September 2023) "
        },
        {
            "heading": 3,
            "text": "Comparing providers of remediation "
        },
        {
            "text": "For some remediation programmes (developer-led, and that done by social housing providers), we publish additional statistics to allow comparison of remediation providers for key variables, such as proportion of building stock where a fire risk assessment has been undertaken. "
        },
        {
            "text": "These additional publications include statistics that sometimes differ from those in the monthly building safety remediation release. This is due to different methodologies used in the collection and compilation of the provider-by-provider statistics. Further information on the differing methodologies is available in the release documents. "
        },
        {
            "heading": 3,
            "text": "Comparing enforcement authorities "
        },
        {
            "text": "Data was recently published for the first time on enforcement actions undertaken by fire and rescue authorities in relation to high-rise residential buildings in their area. This was published alongside data on enforcement actions undertaken by local authorities in relation to high-rise (18m+) residential buildings. This information is available here.  "
        }
    ]
}