{
    "url": "https://defraenvironment.blog.gov.uk/2024/04/09/launching-our-water-restoration-fund/",
    "title": "Launching our Water Restoration Fund",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Community",
        "Nature",
        "Water"
    ],
    "pub_date": "2024-04-09T12:35:22+01:00",
    "content": [
        {
            "text": "Communities are rightly concerned about the damage that is being done to their local environment when the performance of water companies is not as it should be. Now, a new fund has been established to support local people who want to improve and support their water environment. "
        },
        {
            "text": "Previously, fines and penalties from water companies were returned to the Treasury. Our new Water Restoration Fund will channel money from water company fines and penalties – paid from water company profits, not customers’ bills – into supporting farmers and land managers, eNGOs, community groups and councils to carry out on-the-ground projects to protect and improve our rivers, lakes, and streams. "
        },
        {
            "text": "This Fund is in addition to any money water companies pay to clean up the original impact of pollution incidents. "
        },
        {
            "text": "We are committed to holding water companies accountable for their actions. When they are fined by the courts or issued with penalties from regulators for causing environmental damage, it is only right that the fine money is used to restore and protect our waters in the region where damage has been done. "
        },
        {
            "text": "A total of £11 million will be made available for local projects in regions where fines and penalties have been issued between April 2022 and October 2023. The water companies who have paid fines and penalties in this period for environmental offences are Anglian Water, South West Water, Thames Water, Yorkshire Water and United Utilities. Fines and penalties from October 2023 will be used for future years. "
        },
        {
            "text": "From re-meandering rivers and restoring water-dependent habitats, to removing barriers to fish migration and increasing sustainable public access to nature, the Fund has the potential to support a wide range of projects focused on improving the water environment and management of our water bodies. "
        },
        {
            "text": "It will enable local groups to pilot new innovative technologies to deliver their projects, ranging from the use of data and artificial intelligence to using mapping software and remote sensing technologies. "
        },
        {
            "text": "The launch of the Water Restoration Fund follows significant action to hold water companies to account, including a ban on bonuses for water company executives where firms have committed serious criminal breaches subject to consultation, and plans to quadruple the Environment Agency’s regulatory capacity, enabling them to carry out 4,000 water company inspections by the end of this financial year. "
        },
        {
            "text": "We have also scrapped the cap on civil penalties, enabling regulators to take action against polluters more swiftly. "
        },
        {
            "text": "As part of the Plan for Water, over £2.2 billion of new, accelerated investment will be directed into vital infrastructure to improve water quality and secure future supplies, with £1.7 billion of this being used to tackle storm overflows. Water companies will be fast tracking £180 million of investment to prevent sewage spills over the next 12 months.  "
        },
        {
            "text": "The Water Restoration Fund will support the delivery of our ambitious goals laid out in the Environmental Improvement Plan and Plan for Water, to clean up our waters and ensure a plentiful supply for future generations. "
        }
    ]
}