{
    "url": "https://sustainableict.blog.gov.uk/2024/04/09/leave-your-badges-at-the-door/",
    "title": "“Leave your badges at the door.”",
    "authors": [
        "Matt Bradley",
        "Helena Evangelidis"
    ],
    "categories": [
        "GDSA",
        "Planetary Impact",
        "Sustainable ICT"
    ],
    "pub_date": "2024-04-09T07:00:20+01:00",
    "content": [
        {
            "text": "Matt Bradley and Helena Evangelidis explain what their Planetary Impact work is trying to achieve, and they share their passion for how we can better understand the impacts that technology is having on the planet and what each of us can do about it."
        },
        {
            "text": "We are both members of the Government Digital Sustainability Alliance (GDSA) Planetary Impact Working Group. To us, the planetary impact (of technology) is defined as the effect that design, build, operation and disposal of technology products and services has on the planet."
        },
        {
            "text": "Our working group is about understanding how we go beyond the carbon emissions that we are currently reporting within the technology sector to limit that planetary impact. Our aim is to identify how to define, quantify, and measure the planetary impacts from UK Government digital services and technology, and produce a set of recommendations for the future procurement of technology and services."
        },
        {
            "text": "Although as individuals we work for different technology organisations, our working group brings together expertise from GDSA partners including Capgemini, Xerox, Kainos and Hewlett Packard Enterprises."
        },
        {
            "heading": 2,
            "text": "Assessing and raising awareness of the impacts of tech"
        },
        {
            "text": "Sustainability isn’t anything new but until recently there's been a lot of focus on carbon. There are a huge number of frameworks and different organisations working across the sustainability pillars. What we're not seeing is any cohesive framework that focuses just on planetary impact for the technology industry."
        },
        {
            "text": "So, we're raising awareness that it's not just about our carbon impact anymore. There are a huge number of impacts that the tech industry has on our planet, both in terms of the biosphere and on society, touching on our oceans, biodiversity, land, and we're all dependent on them. We want to consider the impacts that our end-to-end cycle of technology has, from mineral extraction, all the way through to use of equipment, and then end of life."
        },
        {
            "text": "It's quite a challenging industry, there are so many different aspects to it, from hardware, to services, to digital, which makes it tricky to come up with any one framework."
        },
        {
            "heading": 2,
            "text": "The story so far for our working group"
        },
        {
            "text": "Starting from an absolute zero base we’ve delivered some important actions over the last twelve months that have moved the dial for us."
        },
        {
            "text": "Firstly, we’ve been onboarding others to help us; we can't just do this ourselves - it's got to be a 'collective us'. It's not a 'you' and 'us' scenario, between government and the tech partners. So, we've started to wrap our arms around everybody to come together as a group, and we feel a real success in building that momentum and moving forward; people clearly want to do something about it."
        },
        {
            "text": "We’ve made a thought-provoking video too, which we showcased at the recent GDSA Summit, and is now out there in the public domain. The team worked hard to create an engaging resource with a view to raising awareness and educating others about this topic of planetary impact and to introduce what we are all about as a group."
        },
        {
            "text": "We're also working on white papers that explore some of these issues in more detail, and other blogs, that explain more about what we’re trying to achieve."
        },
        {
            "text": "All of this feels like we've really got the foundations laid ready for us to accelerate through this year."
        },
        {
            "heading": 2,
            "text": "What we got from the GDSA Summit"
        },
        {
            "text": "The biggest takeaway for us from the GDSA Summit was the sheer amount of passion in the room. The number of people who turned up, eager to be a part of this enterprise, wanting to contribute in their own way, ready and willing to come together make a difference and to help us accelerate what we are trying to do."
        },
        {
            "text": "That, for us, is what was so encouraging, the power of the Government Digital Sustainability Alliance."
        },
        {
            "text": "As we say, it's 'leave your badge at the door'; we are one team, all here for a common goal, and it’s vital that we approach this challenge without any corporate or organisational prejudice or baggage that might undermine that neutrality, or which might get in the way of approaching the challenges with an open mind."
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "Our call to action for everyone out there is to help us raise awareness of the work we are doing by amplifying the messages in this blog, through your organisations, through your employee base, and through your client/supplier networks."
        },
        {
            "text": "We want to continue broadening out this collaborative spirit of the GDSA by sharing progress and future plans, and by enabling others to contribute to our on-going working groups to keep us honest and on point. It would be great if we had more expertise, more people, and more organisations around the table, to drive that collaborative effort."
        },
        {
            "text": " "
        }
    ]
}