{
    "url": "https://stratcommand.blog.gov.uk/2024/04/09/letr-visit-gdp-hq/",
    "title": "Law enforcement torch run visit to the Gibraltar Defence Police",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-09T09:14:15+01:00",
    "content": [
        {
            "text": "On Friday 5 April 2024, the Gibraltar Defence Police were delighted to host the European Co-ordinator for Special Olympics at Northgate House, Gibraltar Defence Police (GDP) Headquarters."
        },
        {
            "text": "Mr Jan Branderhorst and his wife, who are from the Netherlands, were on holiday in Malaga, Spain, and decided to visit the GDP HQ and speak to the some of the GDP Law Enforcement Torch Runs (LETR) representatives."
        },
        {
            "text": "The Law Enforcement Torch Run for Special Olympics is the largest public awareness vehicle and grassroots fundraiser for Special Olympics."
        },
        {
            "text": "Known as the Guardians of the Flame, law enforcement members and Special Olympics athletes carry the Flame of Hope into the opening ceremony of the annual summer games of Special Olympics Gibraltar."
        },
        {
            "text": "Gibraltar has been involved in Special Olympics since 1985 and was the first location in Europe to start the Torch Run programme in 1988."
        },
        {
            "text": "As a police officer himself, Jan Branderhorst has served with the Dutch Police for more than 39 years. He started his career in 1978 in the police force of the City of Amsterdam, becoming a detective in 1985 and moving to Rotterdam."
        },
        {
            "text": "Since then, Jan has worked in several detective units and in 2016 started as a team leader with the National Police."
        },
        {
            "text": "In 1997, along with 3 other colleagues, Jan started Law Enforcement Torch Run Netherlands. Since then, he has organised several Torch Runs in the Netherlands and the Torch Run for the European Summer Games in 2014 in Antwerp, Belgium."
        },
        {
            "text": "During the visit, the Branderhorsts were hosted by Police Constable (PC) Byron Lopez and Ms Jane Payas, the GDP LETR representatives, given a tour of the control room by PC Joe Martinez and Police Sergeant Kyle Moreno, boarded a GDP vessel with PC Gerald Diaz and PC Reggie Azopardi, met Police Dog Robyn and her handler, PC Jordan Dean, and met with Deputy Chief of Police, Mark Wood and Chief Inspector Eric Olivero."
        }
    ]
}