{
    "url": "https://educationhub.blog.gov.uk/2024/04/09/primary-school-offer-day-2023-everything-you-need-to-know/",
    "title": "Primary school offer day 2024: Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools",
        "Schools"
    ],
    "pub_date": "2024-04-09T11:15:09+01:00",
    "content": [
        {
            "text": "Parents of three and four-year-olds will soon find out what primary school has offered their child a place for the next academic year. "
        },
        {
            "text": "The majority of pupils will be offered a place at one of their preferred primary schools, while most will be offered their top choice.  "
        },
        {
            "text": "Here, we explain everything you need to know about primary school offer day, from when you can expect to find out, to how to appeal a decision. "
        },
        {
            "heading": 3,
            "text": "When is primary school offer day and what time are school places released?  "
        },
        {
            "text": "Parents will find out which primary school has offered their child a place for September 2024 on Tuesday 16 April."
        },
        {
            "text": "The decision will be sent by the local council by either letter or email. Some councils allow parents to view their results through the admissions portal or system. Exactly what time the offers will be released varies by council."
        },
        {
            "heading": 3,
            "text": "How likely am I to get my first-choice primary school? "
        },
        {
            "text": "We want parents to feel reassured when it comes to getting one of their top choice primary schools."
        },
        {
            "text": "In 2023, 92.5% of families received an offer from their first choice of primary school and 98.3% received an offer from one of their top three choices."
        },
        {
            "text": "At the same time, over 1 million additional school places have been created between May 2010 and May 2023, with many more in the pipeline."
        },
        {
            "heading": 3,
            "text": "What happens after I receive an offer of a school place? "
        },
        {
            "text": "A parent or carer must formally accept the offer by the given deadline. This is usually set through the local authority’s admissions portal or system. You’ll receive details of next steps with the offer. "
        },
        {
            "heading": 3,
            "text": "Can I appeal a primary school placement decision? "
        },
        {
            "text": "If you’re not offered your first-choice school, you can appeal the decision. However, even if you're appealing a decision, we recommend accepting the offer your child did receive so that they have a school place if the appeal is unsuccessful. Accepting another offer won’t affect your appeal or limit other options available to you. "
        },
        {
            "text": "Parents or carers who want to appeal a decision should first contact the school’s admission authority, which is responsible for organising the appeal panel. Parents and carers can find their school’s admission authority by visiting their local council website: Find your local council - GOV.UK (www.gov.uk). "
        },
        {
            "text": "The panel is independent and will look at the case presented by both the admission authority and the parent before coming to a decision. "
        },
        {
            "text": "The decision of the appeal panel is binding – if the appeal is upheld, the admission authority must offer your child a place at the school. "
        },
        {
            "text": "Admission authorities and appeal panels must comply with the statutory School Admission Appeals Code, which is available here. Guidance for parents on the admission appeals process can also be found here. "
        },
        {
            "heading": 3,
            "text": "How are primary school places decided? "
        },
        {
            "text": "All schools have admission criteria to decide which children get places. This criteria is set by the school or local council. "
        },
        {
            "text": "While all state-funded schools must give top priority to admitting children who are in care or have been in care, admission criteria is  different for each school. They may choose to give priority to children: "
        },
        {
            "text": "Your local council can give you information about a school’s criteria. "
        },
        {
            "heading": 3,
            "text": "Why has my child not been offered a place at one of their preferred schools? "
        },
        {
            "text": "Some schools will receive more applications than places it has available and unfortunately not every parent will be successful. Priority must be given to those who most closely meet the school’s specific admission arrangements. "
        },
        {
            "text": "If the local authority is unable to offer a place at one of the parents’ preferred schools, it must offer a place at another school. "
        },
        {
            "text": "In the unlikely event that a parent does not receive an offer of a place on 17 April, parents should contact their local authority for further advice. "
        },
        {
            "heading": 3,
            "text": "Can I join a waiting list for my top-choice primary school? "
        },
        {
            "text": "You can add your child’s name to the waiting list for any school that you’ve applied for. You should still accept the offer you received and this won’t affect where you stand in the waiting list. "
        },
        {
            "text": "Schools must keep a waiting list for at least one term. The waiting list will be ordered by the school’s oversubscription criteria.  "
        },
        {
            "text": "In some areas, your child will be automatically added to the waiting lists of the schools you ranked more highly. In others, you must ask to be put on the waiting list. Check the school admissions section of your local authority website to find out how it works in your area. "
        }
    ]
}