{
    "url": "https://defrafarming.blog.gov.uk/2024/04/09/storm-henk-grants-available-for-affected-farmers/",
    "title": "Storm Henk: grants available for affected farmers",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Flooding support"
    ],
    "pub_date": "2024-04-09T12:36:08+01:00",
    "content": [
        {
            "text": "Storm Henk caused significant damage to large swathes of the country. Thousands of acres of farmland were left under water as a result.  "
        },
        {
            "text": "Eligible farmers in England who suffered damage to their land during Storm Henk that was uninsurable, will be contacted by the Rural Payments Agency (RPA) about a grant to help cover the costs of returning the land to the condition it was in before it flooded."
        },
        {
            "text": "In this post, we'll give an overview of this support including details of eligibility.  "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "The Farming Recovery Fund supports the cost of reinstating agricultural land which flooded between 2 and 12 January 2024. "
        },
        {
            "text": "You will get £130 per hectare. The RPA will indicate how many hectares of your land are eligible."
        },
        {
            "text": "The minimum grant available is £500. The maximum grant available is £25,000. "
        },
        {
            "text": "Eligible parcels must be in the counties listed below and within 150 metres of the midpoint of one of the rivers that had notably high river level gauge readings during that time: "
        },
        {
            "text": "Additionally, land parcels must be registered as agricultural land in the Rural Payments service to be eligible. "
        },
        {
            "text": "You will not be eligible to make a claim if your land is on a designated flood storage area. "
        },
        {
            "text": "Land parcels included in Countryside Stewardship with flood resilience options SW12, SW15 and SW16, are not eligible for the grant.  "
        },
        {
            "text": "We used satellite imagery and river gauge level data to work out which land parcels were flooded following notably high river levels between 2 and 12 January 2024. Stakeholders were involved in the development of the eligibility criteria."
        },
        {
            "text": "Eligibility for the fund will remain under review to ensure it supports areas where farmland is most impacted. We’re currently reviewing Berkshire, Herefordshire, Oxfordshire, Surrey, Staffordshire, Yorkshire, Norfolk and Derbyshire. "
        },
        {
            "heading": 2,
            "text": "The process to claim a grant  "
        },
        {
            "text": "If the RPA writes to you, you are eligible."
        },
        {
            "text": "They will work out how much you might be eligible for based on your land details in the Rural Payments service.  "
        },
        {
            "text": "All you need to do is download the form the RPA sends you, check it and sign. You need to do this by 10 July.  "
        },
        {
            "text": "You do not need to have recultivated the land by this date. You do need to complete the work by the end of September 2024. "
        },
        {
            "text": "Once the RPA receives the form from you, they will review it and contact you if they need more information or clarification."
        },
        {
            "text": "If your claim is approved, payments will be made to the bank account registered with the Rural Payments service, if there are no questions to resolve, then payments will be made quickly. "
        },
        {
            "text": "If you have already carried out work and meet the eligibility criteria set out above, then you will be reimbursed with a contribution towards your costs.   "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "The fund forms part of a broader scheme called the Flood Recovery Framework, which is activated in exceptional circumstances and provides funding for eligible households and businesses which have suffered severe impacts from flooding that cannot be recovered from insurance. "
        },
        {
            "text": "While the framework has only been activated for Storm Henk, if you’re not in the areas listed above, you can still get advice on Natural Flood Management (NFM) through your local Catchment Sensitive Farming adviser. "
        },
        {
            "text": "This year, we’re updating existing actions and introducing new actions to the Sustainable Farming Incentive (SFI) and Countryside Stewardship to support NFM, flood mitigation and increase flood resilience. "
        },
        {
            "text": "You can find out more in the Technical Annex to the ATP Update. "
        }
    ]
}