{
    "url": "https://defrafarming.blog.gov.uk/2024/04/09/water-restoration-fund-grants-now-available/",
    "title": "Water Restoration Fund: grants now available",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-04-09T13:28:05+01:00",
    "content": [
        {
            "text": "Groups of farmers in England can now apply for a grant to improve freshwater habitats."
        },
        {
            "text": "Through the new Water Restoration Fund, local groups can apply for funding to bolster their capacity and capabilities for delivery of on-the-ground projects which improve the water environment. "
        },
        {
            "text": "The fund, announced in Defra’s Plan for Water, is funded through environmental fines and penalties issued to water companies between April 2022 and October 2023.  "
        },
        {
            "text": "In this post, we'll give an overview."
        },
        {
            "heading": 2,
            "text": "Overview  "
        },
        {
            "text": "The Water Restoration Fund offers grants to support projects which improve the water environment of rivers and their headwaters, lakes, canals, ponds, wetlands and estuaries. "
        },
        {
            "text": "There are 2 types of grants: "
        },
        {
            "text": "The £11 million is made up of water company fines. The money will be allocated to projects by region. This is to ensure that money goes to the areas where environmental damage has occurred."
        },
        {
            "text": "The water companies and their fines and penalties are as follows: "
        },
        {
            "text": "We want local groups and farm clusters to work together and consider applying for funding to deliver projects at the catchment scale. "
        },
        {
            "text": "Projects will be encouraged to restore and protect habitats using nature-based solutions, improve community access to blue and green spaces, ranging from re-meandering rivers and restoring water-dependent habitats to removing barriers to enable fish natural movement in rivers. "
        },
        {
            "text": "We'd like to fund projects that test innovative technologies to deliver their projects. From the use of data and artificial intelligence to mapping software and remote sensing. "
        },
        {
            "heading": 2,
            "text": "Applying for a grant  "
        },
        {
            "text": "Please read the Water Restoration Fund guidance on GOV.UK before you begin your application. "
        },
        {
            "text": "Before you apply, you should consider whether this fund is the most relevant grant for your project. "
        },
        {
            "text": "You can apply for a grant if you receive funding through our environmental land management schemes (such as the Sustainable Farming Incentive) and our grants. This grant shouldn’t be used for anything you're already being paid for. We'll check this during the assessment of your application. More information on duplicate funding is in the guidance. "
        },
        {
            "text": "You can apply from today, 9 April 2024. The window will remain open for 8 weeks. The deadline to apply is 7 June 2024.  "
        },
        {
            "text": "After you submit your application, the Rural Payments Agency (RPA) will check whether your project is eligible.  "
        },
        {
            "text": "If your application meets the eligibility criteria, it will then be assessed by a panel against the scoring criteria, which can be found in the guidance documents.  "
        },
        {
            "text": "We’ll then assess applications against the scheme’s objectives, value for money and other applications.  "
        },
        {
            "text": "We will process applications as they come in. We expect to award grants at the end of July.  "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "This Fund builds on the Water Management Grant which supports farmers to store more water on their land, support food production, and improve water security. "
        },
        {
            "text": "If, after reading the guidance, you have any questions you can contact the RPA.  "
        }
    ]
}