{
    "url": "https://childrenssocialcare.blog.gov.uk/2021/12/02/acorn-academy-coaching-reaffirming-the-importance-of-social-worker-wellbeing/",
    "title": "Acorn Academy Coaching: reaffirming the importance of social worker wellbeing",
    "authors": [
        "Rachel Baker"
    ],
    "categories": [
        "Leadership",
        "Wellbeing"
    ],
    "pub_date": "2021-12-02T15:27:46+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Rachel Baker has been a qualified social worker for 18 years. A chance encounter with a University of Warwick prospectus inspired her to stop training as a solicitor and take her career in a new professional direction.  Here, Rachel talks about her work as a life coach and the importance of social workers taking control of their lives, so that they can transition ‘from surviving to thriving’."
        },
        {
            "text": "Early in my social work career, I worked in frontline child protection before specialising in working therapeutically with birth parents in adoption cases at Warwickshire County Council. In my current role as Academy Learning Lead, my team is responsible for the learning and training of social workers. It has only been a few months since we launched Warwickshire’s Children and Families Academy, so it’s all very new currently. "
        },
        {
            "heading": 2,
            "text": "Changing my lifestyle to improve my physical and mental health"
        },
        {
            "text": "My time in child protection, along with personal experiences, increased my interest in wellness and wellbeing. Over a 10-year period, I saw my health decline. I put on a lot of weight and caught pneumonia twice. Just before my fortieth birthday, my doctor advised me that I needed to change my lifestyle to improve my physical and mental health. This was also over a period where I lost five grandparents and experienced a lot of grief. It was grief on grief, really; a lot of stress accumulated, and I thought, ‘I’d better do something now’.  "
        },
        {
            "text": "While taking steps to improve my mental wellbeing, I became interested in life coaching. I also started running regularly; a new habit that helped me to lose nine stone. Around this time, my partner and I adopted two children who had been through the care system. I knew I would need to change my working hours to part-time and move away from child protection to be able to meet their needs. My ethos has always been to put my family first.  "
        },
        {
            "heading": 2,
            "text": "An unexpected springboard into life coaching"
        },
        {
            "text": "Alongside working for the council, I was successful in applying for a part-time position at Adoption UK. The role involved providing therapeutic support on the telephone for adoptive families who were often close to breakdown, as they were not getting appropriate intervention. Unfortunately, funding for the program ended and I was made redundant.  "
        },
        {
            "text": "I like to call this the divine intervention that acted as my springboard into life coaching. My redundancy provided the money I needed to train as a life coach. I seized the opportunity and six months before the first lockdown, I realised my dream. As well as life coaching, I also started 'Run Fit 5K', where I teach people in the community to run. "
        },
        {
            "heading": 2,
            "text": "The personal experiences of social workers"
        },
        {
            "text": "In early 2020, I was invited by John Coleman, the Director of Children’s Services, to provide a life coaching service to social work colleagues in Warwickshire. John has always been very keen to invest in the wellbeing of staff and is always seeking new ways to drive improvement. The workshops started in February 2020, just before lockdown began, and have continued throughout 2020 and 2021. To begin with they were online and now they are being delivered in person. Under John’s leadership, I am currently supporting the seventh cohort of social workers to change and improve their lives, through a mixture of workshops, one to one coaching and running. "
        },
        {
            "heading": 2,
            "text": "How wellbeing coaching works in practice "
        },
        {
            "heading": 2,
            "text": "An opportunity for social work education"
        },
        {
            "text": "In our profession, we are naturally trauma experienced, but not necessarily trauma informed. There are a lot of social workers who don’t understand how trauma impacts on their work and their life outside of work. I can see a huge gap in social work education and research here. If we can correct this and find a solution, we will have a healthier workforce who are able to achieve better outcomes for children and families."
        },
        {
            "text": "I remind social workers of tools and techniques that can help them, for example:"
        }
    ]
}