{
    "url": "https://aphascience.blog.gov.uk/2021/12/02/fertility-control-in-wildlife/",
    "title": "Exploding animal populations – how can we co-exist?",
    "authors": [
        "Giovanna Massei"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2021-12-02T09:00:41+00:00",
    "content": [
        {
            "text": "Using contraceptives to slow reproductive rates in exploding animal populations may offer an extra tool to manage human-wildlife conflicts. In this blog, we hear from senior ecologist, Giovanna Massei, as she outlines this global issue and humane, evidence-based and sustainable solutions."
        },
        {
            "text": "We love them, we feed them in our parks and gardens. We fear them and chase them away. We hunt them and we crave to be close to them. We take selfies with them but worry about their destructive impact."
        },
        {
            "text": "Deer, rats, mice, wild boar, feral livestock and pigeons are among the animals whose numbers are exploding worldwide. In Europe, invasive species such as grey squirrels, raccoons, pot-bellied pigs, parakeets and Canada geese now roam our cities. Their environmental and economic impact is phenomenal, ranging from disease transmission to damage to crops and forestry, traffic accidents, attacks on people and pets, nuisance behaviour and impacts on native species."
        },
        {
            "heading": 3,
            "text": "Close encounters"
        },
        {
            "text": "Recently, in the middle of Barcelona, a couple of wild boar accustomed to being fed by locals, stole the bag of pop star Shakira, presumably hoping for a snack. The same happened to a nudist in Berlin, whose video went viral as he ran in his birthday suit after a sow that had grabbed his backpack! Local authorities suggested killing the sow and thousands signed a petition against it."
        },
        {
            "text": "This year, Australia experienced the worst mouse plague in decades, with millions of mice in fields, inside houses, garages and even prison cells. Meanwhile, African Swine Fever virus is travelling through Eurasian pigs and wild boar, costing billions to the pig industry. In the United Kingdom (UK), many sea towns are warning not to feed gulls that regularly swoop over tourists, stealing fish and chips and even ice creams."
        },
        {
            "text": "Our own species is firmly set on the same trajectory. According to the United Nations, the human population will increase from today’s 7.9 billion to 10.9 billion by the end of the century. In this context, human-wildlife clashes are unavoidable."
        },
        {
            "heading": 3,
            "text": "What are the options?"
        },
        {
            "text": "Culling is unpopular for ethical, environmental and animal welfare reasons (think rodenticides) and may not be feasible as the sole option to keep numbers down. Moving animals out of their native area (translocation) causes stress and many die trying to go back home or simply resume the nuisance behaviour in the new area. Translocations also spread pathogens to local resident populations that also do not take kindly to newcomers dumped on their patch. Using contraceptives for slowing down reproductive rates may offer an extra tool to manage human-wildlife conflicts."
        },
        {
            "heading": 3,
            "text": " Fertility control for wildlife: the dawn of a new era"
        },
        {
            "text": "In my 18 years working in this area, the requests for new projects have grown and grown. Since the initial project on an injectable contraceptive vaccine for wild boar, we have tested contraceptives for wild boar in Spain and Hong Kong, for goats in Wales, for badgers, parakeets and grey squirrels in England, for feral cattle in Hong Kong and for stray dogs in Nepal and India."
        },
        {
            "text": "We modelled the impact of fertility control on wildlife and developed ingenious ways to deliver . We had fun with naming the POD (parakeet-operated-device) and the BOS (boar-operated-system). We are particularly proud of the BOS, which exploits the natural rooting behaviour of wild boar. The BOS consists of a metal bell, sliding on a pole and covering a round base where one can place bait containing contraceptives or vaccines. We proved that wild boar in the UK, in the US and in Italy is the only species (apart from bears!) capable of lifting the bell and feeding on the bait."
        },
        {
            "text": "Although our customers and contexts vary, the story, with local variations, is always the same: too many animals causing trouble, culling not acceptable nor capable of reducing numbers. There are only so many feral goats and ponies you can adopt out or translocate; local residents demand solutions."
        },
        {
            "text": "It is not straightforward and the road is still bumpy. Legal requirements, bureaucracy, the many uncertainties of field work and research, and even the weather contribute to add colour and frustration, in equal parts, to our work on fertility control."
        },
        {
            "text": "But the rewards are huge, as our work in this area could provide humane, effective and socially acceptable alternatives to mitigating human-wildlife conflicts. These rewards recently culminated in my team being commissioned for a five-year study to develop and deliver oral contraceptives for grey squirrels. This project is ongoing, funded by the UK Squirrel Accord, which acts as an umbrella for 39 main UK government and non-government organisations."
        },
        {
            "heading": 3,
            "text": "A new hub for fertility control"
        },
        {
            "text": "In 2016 The Botstiber Institute for Wildlife Fertility Control (BIWFC) headquartered in the United States, was established as a hub for stimulating discussion, collaboration, education and networking on wildlife fertility control. This summer, I had the honour of being asked to become the European Director of the BIWFC, based at the University of York."
        },
        {
            "text": "The European office will assist the BIWFC in its mission to advance the use of effective, sustainable fertility control methods to mitigate human-wildlife conflicts and to promote coexistence worldwide. Its timing is perfect as many countries in Europe are among the most densely populated of the world. Public interest in this area has never been so high."
        },
        {
            "text": "My job, which is now part-time shared with my APHA role, is to plan, manage, and lead the Institute’s European programs, such as conferences, workshops, grants and projects, and public education initiatives. I will also pursue collaboration with European partners and encourage academic research on wildlife fertility control."
        },
        {
            "heading": 3,
            "text": "So… what does the future looks like?"
        },
        {
            "text": "For me, building bridges across Europe, a bumper crop of public talks, the immense reward of feeling that my job might inform public attitudes to wildlife and the support of some fantastic, like-minded new colleagues across the pond."
        },
        {
            "text": "For wildlife and for the environment concerted action to tackle overabundant animals’ impacts through humane, evidence-based and sustainable methods."
        },
        {
            "text": "And for Shakira? The small consolation that the attack was not personal, but simply due to our need to feed wild animals without wanting to face the consequences."
        },
        {
            "heading": 3,
            "text": "Conference on wildlife fertility control and resources"
        },
        {
            "text": "The Botstiber Institute for Wildlife Fertility Control marks its fifth anniversary this year with an array of events and projects including an educational film “An Overview of Wildlife Fertility Control.” Running for about 15 minutes, the film is an excellent introduction to one of the most important issues of wildlife population control today."
        },
        {
            "text": "For anyone interested, the next conference on wildlife fertility control will be organised by the BIWFC in the US at the end of May 2022. Deadline to submit an abstract is the 3rd of December 2021."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}