{
    "url": "https://educationhub.blog.gov.uk/2021/12/02/how-the-national-tutoring-programme-could-help-boost-your-childs-learning/",
    "title": "How the National Tutoring Programme could help boost your child’s learning",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2021-12-02T14:25:14+00:00",
    "content": [
        {
            "text": "Launched in November 2020, The National Tutoring Programme (NTP) is helping boost the learning of those pupils most affected by the impact of missed time in school during the pandemic."
        },
        {
            "text": "The programme, which forms a key part of the Government’s ambitious and long-term education recovery plan, gives pupils access to one-to-one or small group teaching with specialist tutors."
        },
        {
            "text": "Over one million tutoring courses have started through the National Tutoring Programme, with the programme on track to deliver the ambitious target of two million courses this academic year."
        },
        {
            "text": "Based on feedback from schools, we have expanded the NTP for the second year of the programme, offering state-funded schools and academy trusts three routes to tutoring - tuition partners, academic mentors, and school-led tutoring."
        },
        {
            "text": "Here’s everything you need to know about the NTP."
        },
        {
            "heading": 3,
            "text": "How does it work?"
        },
        {
            "text": "The National Tutoring Programme provides schools with high-quality, subsidised tuition through carefully selected organisations that work with highly-trained tutors. These tutors – who have all been subject to robust high-quality training and safeguarding checks – can provide additional capacity to schools to support disadvantaged pupils who have been impacted by disruption to their education."
        },
        {
            "text": "There are three routes schools can pursue to secure tutoring for their pupils, they can appoint expert accredited tutoring organisations, employ an academic mentor, sourced centrally, or they can use their funding to source tutors locally or use their own staff."
        },
        {
            "text": "Schools can access the subsidised tuition by visiting: Tuition Partners - NTP (nationaltutoring.org.uk). Schools can search for providers in their region from an approved list and make an enquiry directly with their chosen provider."
        },
        {
            "text": "The NTP can only be accessed by schools for their pupils. The evidence shows this is the best way to make sure tutoring is effective, targeted and linked to what pupils are learning in school."
        },
        {
            "heading": 3,
            "text": "Why is the NTP needed?"
        },
        {
            "text": "One course of high-quality tutoring has been proven to boost attainment by three to five months, so tutoring will be vital for young people in recovering the teaching hours lost in the last year."
        },
        {
            "text": "However, access to tutoring is often limited to the schools and parents that can most afford it. It’s estimated that around 80% of disadvantaged pupils don’t have access to quality tuition. The NTP will help change that."
        },
        {
            "heading": 3,
            "text": "Which pupils have access to the tutoring?"
        },
        {
            "text": "The NTP has been developed to provide additional, targeted support to those children and young people due to having lost time in education during the last year."
        },
        {
            "text": "All state funded schools in England are able to access this additional resource to support disadvantaged pupils. Teachers and school leaders should use their professional judgement to determine which pupils are in most need of support."
        },
        {
            "heading": 3,
            "text": "Can pupils with special educational needs and disabilities get help from the NTP?"
        },
        {
            "text": "Yes. The NTP is open to all children and young people who need the most support catching up. Many of the organisations we are working with are able to support pupils with SEND and are able to support pupils in special school settings."
        },
        {
            "text": "Which subjects is tutoring available for?"
        },
        {
            "text": "The NTP provides tuition funding in six main areas:"
        },
        {
            "heading": 3,
            "text": "When is the tutoring delivered?"
        },
        {
            "text": "Tuition is very flexible and can happen in-school, either online or face-to-face, or during the school holidays. These arrangements will depend on individual circumstances such as the preference of the family and school, and tutor availability."
        },
        {
            "text": "Tutoring sessions should happen at appropriate times for pupils, for example immediately after the school day. If tutoring is taking place during the holidays, it should happen broadly in line with school hours."
        },
        {
            "heading": 3,
            "text": "How do I make sure my pupil’s school is getting involved?"
        },
        {
            "text": "For more information on tuition and any alternative additional support which may be available, please contact your child’s school."
        }
    ]
}