{
    "url": "https://civilservice.blog.gov.uk/2021/12/02/international-day-of-persons-with-disabilities-2021/",
    "title": "International Day of Persons With Disabilities 2021",
    "authors": [
        "Richard Purvis"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-12-02T09:14:19+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Deaf civil servant Richard Purvis sheds insight into his life, the daily challenges and dreams that motivate him. "
        },
        {
            "text": "To celebrate the International Day of Persons with Disabilities on 3 December, the Civil Service Deaf and Hard of Hearing Network (CSDHHN) is keen to highlight what it’s like to be a Deaf civil servant: the challenges and barriers as well as the opportunities amid a global pandemic."
        },
        {
            "text": "    BSL users, please follow this link for a translation of the blog post (if you cannot access this on a work device, you may need to use a personal device)."
        },
        {
            "text": "It’s probably hard to imagine what it’s like to be Deaf or hard of hearing, unless you’ve experienced it. Yet one in six UK adults is affected by a hearing condition - including me. Deafness is the second most common disability, though you probably won’t spot a deaf person in a crowd. As an invisible disability, it often goes unnoticed, making it easier for those affected to be neglected.  "
        },
        {
            "text": "That’s why I joined the DIVAA project (Deaf Inclusion, Visibility, Accessibility and Awareness), run in collaboration with the CSDHHN and the Future Leaders Academy.           "
        },
        {
            "text": "DIVAA was formed to tackle barriers that Deaf colleagues face in the Civil Service - most people don't realise these barriers even exist."
        },
        {
            "heading": 4,
            "text": "What barriers? "
        },
        {
            "text": "Deaf people use a variety of strategies at work. For example, some use British Sign Language, some use Sign Supported English whilst others don't want to sign and communicate in different ways. It’s a myth that all Deaf people are the same.                    "
        },
        {
            "text": "I joined the Civil Service in 2001. Unfortunately my line managers haven’t always been supportive, but it made me passionate for change and I hope both Deaf people and their managers can benefit from this article and DIVAA’s work.     "
        },
        {
            "text": "Being part of the Deaf community, I’ve realised many issues aren’t unique to me. Some Deaf colleagues feel isolated at times, so I want to share my experiences to improve awareness of the difficulties Deaf colleagues face at work."
        },
        {
            "heading": 4,
            "text": "Useful resources"
        },
        {
            "text": "At times, I’ve experienced a lack of guidance, and was grateful to find support. Support ranges from helping personal development to booking interpreters and appropriate adjustments, which make a huge difference in getting on with the job and enabling me to thrive.   "
        },
        {
            "text": "  When a conversation has multiple participants, it can be difficult for a Deaf person to follow and for an interpreter to communicate. Online meetings offer fantastic resources such as live captions, meeting transcripts and an option to ‘raise your hand’.                     "
        },
        {
            "heading": 4,
            "text": "Small changes matter"
        },
        {
            "text": "Making even a small change can make a positive difference, but it shouldn’t need to be continually flagged for colleagues to remember. I often get tired trying to lip-read or read English documents and regularly suffer from fatigue. "
        },
        {
            "text": "It’s encouraging to see positive change, including the launch of the National Disability Strategy in July, a cross-government effort aiming to transform disabled people’s lives. The Ministry of Justice will bring forward legislation in 2021 as part of the Police, Crime, Sentencing and Courts Bill to amend common law, enabling deaf people who need a BSL interpreter to perform jury service."
        },
        {
            "heading": 4,
            "text": "Job applications"
        },
        {
            "text": "Any job application process is daunting, but even more so if you’re Deaf. For some of us, BSL is our first language and English our second. Interviewers don’t always understand my requirements - so it’s important to explain these clearly in advance. The application process for all Civil Service roles offers reasonable adjustments, so whether you need an interpreter or something else, make sure you ask for it.                    "
        },
        {
            "heading": 4,
            "text": "My advice to new Deaf or hard of hearing civil servants"
        },
        {
            "text": "Speak to your manager openly to explain your preferred ways of communication. Discuss how you work with interpreters, or whether you lip-read and rely on video during online meetings. Conversations can be hard to initiate, but are important to ensure you can work productively. "
        },
        {
            "text": "Your manager might suggest a diversity training session for the team where you can explain your working preferences and listen to suggestions from colleagues. The earlier this conversation can be held, the better, making settling in as smooth as possible. "
        },
        {
            "heading": 4,
            "text": "Dreams"
        },
        {
            "text": "Part of my dream as a Deaf person is to have all-staff emails or mandatory office updates translated into British Sign Language, to improve connectivity and mental health issues. "
        },
        {
            "text": "Ultimately, I want to use the DIVAA project to empower Deaf and hard of hearing colleagues to speak up and challenge their leaders to do more to support them. If we work together, we will see a brighter future and equality for everyone."
        },
        {
            "text": "Working closely with CSDHHN, DIVAA has helped raise awareness about Deaf and hard of hearing civil servants, initiated important conversations on reasonable adjustments, and helped promote diversity. "
        },
        {
            "text": "I’ve seen first-hand that treatment of Deaf employees has improved. This year, HMRC pioneered the use of BSL interpreters for internal live-streaming events to improve inclusivity. This shows that the Civil Service is committed to supporting diversity.                "
        },
        {
            "heading": 4,
            "text": "Unique perspectives"
        },
        {
            "text": "Deaf and hard of hearing people bring unique perspectives, experiences and skills just like anybody else, and disability representation has reached its highest level yet. "
        },
        {
            "text": "Now as the Civil Service embraces ‘A Modern Civil Service’ ethos, it’s a valuable opportunity to be more inclusive, hire more Deaf and hard of hearing employees and mirror the society we serve.      "
        },
        {
            "text": "The CSDHHN welcomes new members. Visit the network’s page on gov.uk to find out more."
        }
    ]
}