{
    "url": "https://defrafarming.blog.gov.uk/2021/12/02/introducing-the-moorland-and-rough-grazing-standard/",
    "title": "Introducing the Moorland and Rough Grazing Standard",
    "authors": [
        "Ian Condliffe"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2021-12-02T13:07:48+00:00",
    "content": [
        {
            "text": "I recently joined the Sustainable Farming Incentive team to help develop some of the standards for 2022/23. In particular, those focused on upland farming and moorland management. "
        },
        {
            "text": "My name may be familiar to some as I worked for The Ministry of Agriculture, Fisheries and Food (the precursor to Defra) and its agencies between 1986 and 2006."
        },
        {
            "text": "Much of my work focused on the uplands. I led the development of some of the upland Environmentally Sensitive Area schemes and the original upland Countryside Stewardship and Environmental Stewardship options. "
        },
        {
            "text": "I am particularly proud of persuading the department that agri-environment schemes needed to include common land and it would not be impossible to bring common land into agreements. "
        },
        {
            "text": "Although it felt impossible at times, the hard work put in by colleagues on the ground and commons graziers paid off. New commons associations and agreements followed. "
        },
        {
            "text": "This helped pave the way for regional and national commons federations to make the voice of commoners heard. "
        },
        {
            "heading": 2,
            "text": "Agri-environment agreements over time "
        },
        {
            "text": "I’ve seen the objectives of moorland agri-environment agreements change over time. "
        },
        {
            "text": "They started with reducing moorland and fell grazing pressures to help heather plants recover. "
        },
        {
            "text": "They moved on to encouraging the diversity of moorland plant and animal species; often with tailored grazing regimes, sometimes reintroducing cattle. "
        },
        {
            "text": "At the moment, rewetting the peatlands and reducing heather and grass burning add to the mix."
        },
        {
            "text": "As our understanding of moorland ecosystems and their importance beyond the moorland line has increased, so has the vocabulary around it. For example: biodiversity, environmental goods and services and ecosystem services. Today we talk of natural capital and public goods and services."
        },
        {
            "text": "Farmers and land managers will be paid for delivering those public goods. "
        },
        {
            "text": "In the case of the uplands, this includes carbon storage and capture, natural flood management, clear and clean water and enhanced biodiversity. "
        },
        {
            "heading": 2,
            "text": "A step-by-step approach"
        },
        {
            "text": "The Moorland Rough Grazing Standard is new. We’re publishing it in draft so we can continue working with moorland farmers to develop it. "
        },
        {
            "text": "It currently only has an introductory level of ambition, but there is an extensive offer through Countryside Stewardship for moorland farmers. "
        },
        {
            "text": "We encourage anyone not in Countryside Stewardship to enter into it. Some moorland farmers will be in protected landscapes, and they’re also eligible to apply for funding through our Farming in Protected Landscapes scheme."
        },
        {
            "text": "Intermediate and upper ‘levels of ambition’ will follow in the coming years and should include capital payments if appropriate."
        },
        {
            "text": "All agreements will be for 3 years. "
        },
        {
            "text": "In addition to the Sustainable Farming Incentive, we have the Local Nature Recovery and Landscape Recovery schemes. "
        },
        {
            "heading": 2,
            "text": "Learning from the past and looking to the future"
        },
        {
            "text": "The Sustainable Farming Incentive is a very different land management scheme. I have found it helpful to put out of my head all schemes that have gone before."
        },
        {
            "text": "It is designed to be easy to use with little-to-no external support. Its levels of ambition are modest, particularly for the moorland introductory standard. We will publish guidance and training materials next year."
        },
        {
            "text": "The first rule is that it cannot pay for actions that land managers are already being paid for under existing agri-environment schemes. This has made development of the moorland and rough grazing introductory standard particularly challenging especially as about 75% of moorland and fell is already signed up to agri-environment schemes."
        },
        {
            "text": "These existing schemes obviously try and cover basic but important management practices which leaves little room for an introductory scheme. On the plus side, it means that existing agreement holders can enter into the standards."
        },
        {
            "text": "The objective of the introductory standard is to provide the bedrock of good management practice on the moor by helping land managers to be more aware of the potential their moorland has for maintaining and enhancing the delivery of the public goods that moorlands can offer. It asks managers to verify and record the types of soils and vegetation on their moor and their condition where appropriate."
        },
        {
            "text": "For example: "
        },
        {
            "text": "These types of observation should be made at points representing about 10 hectares of the surrounding area. They should be recorded, perhaps on a map, logged and photographed. These observations should be carried out in the following 2 years at different points to update and improve the maps."
        },
        {
            "text": "No-one is saying that this will produce an accurate record of the soils and vegetation resources of the moor, but its aim is to help managers understand it’s potential for public goods delivery."
        },
        {
            "text": "To help with this, they will also be asked to identify where they think soil and vegetation condition can be improved to maintain or enhance public goods delivery. For example, slowing the flow of rainfall run-off or revegetating eroding areas."
        },
        {
            "text": "This record could be paper or digital. In any case, it will be for their own use and will not need to go to Defra. They should be available for inspection should the Rural Payments Agency asks for them."
        },
        {
            "text": "The introductory level is not asking for any maintenance or enhancement actions that are identified. Those options should be available in the intermediate and advanced levels of the standard when they become available, as well as through other environmental land management schemes."
        },
        {
            "text": "Some moorlands may already have fairly up-to-date and quite detailed maps of their natural resources."
        },
        {
            "text": "Nevertheless, this mapping exercise will still need to be carried out to help managers recognise and think about the environmental benefits that their moorland or fell is already providing and how that can be improved."
        },
        {
            "heading": 2,
            "text": "Common land"
        },
        {
            "text": "Which brings me back to common land. The payments offered for the introductory standard may be attractive for some commons, especially those with a low number of active graziers. We recognise that for larger commons with a high number of graziers the financial incentive may not be so significant. "
        },
        {
            "text": "Additionally, we are aware that the initial introductory standard may awaken the interest of non-graziers as no active livestock management is needed. "
        },
        {
            "text": "We are talking this through with colleagues who work up the payment rates. This is being carried out in consultation with representatives of the commons federations and upland farmers."
        },
        {
            "text": " Carrying out the introductory level should enable graziers to secure considerably higher payments in the intermediate and advanced levels when they are rolled out. "
        },
        {
            "text": "So, in some ways it’s nice to see that the challenges I faced with common land agreements many years ago have not altogether gone away. It’s been great to see the partnerships we’ve built to design schemes that work for everyone. I’m looking forward to continuing work on this interesting, vital piece of work."
        },
        {
            "text": "Subscribe for further updates to our work, and read all about how the Sustainable Farming Incentive will work in 2022 on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Farming Forum Q&A"
        },
        {
            "text": "Programme Director Janet Hughes and the team will be answering questions about the Sustainable Farming Incentive on the Farming Forum over the next few days. You don't have to be a member of the forum to read the questions and responses. You do, however, need to be a member to ask a question."
        },
        {
            "heading": 3,
            "text": "Moorlands by Ian Condliffe"
        }
    ]
}