{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/12/02/promoting-competition-bulletin-december-2021/",
    "title": "Promoting Competition Bulletin December 2021",
    "authors": [
        "Andrea Coscelli"
    ],
    "categories": [
        "Promoting Competition bulletins"
    ],
    "pub_date": "2021-12-02T16:46:54+00:00",
    "content": [
        {
            "text": "Today the Competition and Markets Authority (CMA) has published its draft Annual Plan 2022 to 2023 for consultation. It sets our proposed overall direction and main themes for the coming year. We look forward to receiving your views."
        },
        {
            "heading": 2,
            "text": "Setting our overall direction and main themes for the year ahead"
        },
        {
            "text": "The emergence of the Omicron strain has added to the uncertainty being felt by consumers and businesses about the impact of coronavirus (COVID-19) pandemic. In the run-up to Christmas, we remain vigilant in protecting people across the UK from unfair behaviour and working to ensure their rights are protected."
        },
        {
            "text": "As we look to the future, and as the UK emerges from the worst of the coronavirus (COVID-19) pandemic, promoting competition will be more important than ever before. Competitive markets are essential to creating the conditions for investment and sustainable long-term growth in the UK. They drive innovation, increasing our productivity, meaning we can produce more with less. When markets aren’t competitive, prices go up, quality drops and the cost of living rises, hitting the less well-off households the hardest."
        },
        {
            "text": "The CMA has an important role to play in building trust and confidence when people buy goods and services, and in fostering competition. We will continue to focus on high impact enforcement of competition and consumer law. We will remain alert to the risk of anti-competitive collusion, to mergers seeking to reduce competition and capitalise on the financial distress of businesses, and to attempts to exploit consumers, small and medium-sized enterprises (SMEs) and microbusinesses."
        },
        {
            "text": "During the past year, the CMA has risen to the significant challenges arising from the need to assume substantial additional responsibilities as a result of the UK’s departure from the European Union (EU), while responding quickly and effectively to protect consumers and assist businesses by tackling issues arising from the coronavirus (COVID-19) pandemic. We have launched the shadow Digital Markets Unit (DMU), set up and launched the Office for the Internal Market (OIM), and recommenced our work on the UK’s future subsidy control regime by preparing for the creation of the Subsidy Advice Unit (SAU), each of which brings a new set of powers, functions and responsibilities. We have also published the first Annual State of Competition report. At the same time, the volume of complex, multinational merger and antitrust cases, often with a digital focus, continues to grow."
        },
        {
            "text": "In this context, the CMA will continue to fulfil its duty to promote competition and protect consumers, as well as embedding its new functions, with a focus on the following themes:"
        },
        {
            "text": "We have already made strong progress delivering the commitments we made in this year’s Annual Plan. The highlights are summarised below."
        },
        {
            "heading": 2,
            "text": "Protecting consumers and driving recovery"
        },
        {
            "text": "We have continued to take tough action to protect consumers across each of the nations and regions of the UK to ensure they are not treated unfairly by businesses."
        },
        {
            "text": "The impact of the coronavirus pandemic and the restrictions that were in place for much of the last year has required that we continue to act quickly in response to concerns raised. In 2020 to 21 we secured commitments to refund hundreds of millions of pounds to consumers for package holidays that were cancelled due to the restrictions imposed as a result of COVID-19. We also advised the government on ways to make the PCR testing market work better and opened investigations into two PCR testing firms who may be breaking the law."
        },
        {
            "text": "We have concluded two of our largest Competition Act investigations in the pharmaceutical sector, resulting in a total of over £360 million in fines being imposed on 3 companies for charging excessively high prices in the supply of liothyronine tablets, used to treat thyroid hormone deficiency, and in a separate case, relating to a decade long high prices in the supply of hydrocortisone tablets. Both decisions are currently under appeal to the Competition Appeal Tribunal (CAT)."
        },
        {
            "text": "We continue to use our powers to disqualify directors of companies found to engage in anticompetitive practices. Since 2016 we have secured 24 director disqualifications, covering directors involved in a range of sectors, including construction, pharmaceutical and estate agency. We currently have a number of director disqualification cases in the pipeline, including ongoing proceedings to disqualify a director for his involvement in an information exchange infringement arising out of the CMA’s Nortiptyline investigation."
        },
        {
            "text": "We have taken tough action to ensure that consumers across the UK do not lose out as a result of more concentrated market structures, which can lead to poorer outcomes. We recently accepted undertakings for the completed acquisition by Bellis Acquisition Company 3 Limited of Asda Group Limited after competition concerns were raised. We were concerned that the purchase could lead to higher petrol prices in some parts of the UK. In November, we instructed JD Sports to sell Footasylum after an in-depth investigation identified competition concerns. We have also issued our provisional report, finding competition concerns, in the in-depth phase 2 investigation into Facebook’s takeover of Giphy."
        },
        {
            "text": "We are committed to continue to investigate areas where poorly functioning markets are affecting members of society who may be particularly vulnerable due to their circumstances. We have published the interim report of our market study into children’s social care provision, including children’s homes and fostering, outlining significant concerns about the availability of placements and the profits of private providers. We are now inviting comments on ways to tackle these issues, including recommendations to the UK and devolved governments. Our final report is due to be published in March 2022."
        },
        {
            "heading": 2,
            "text": "Promoting better outcomes for consumers in digital markets"
        },
        {
            "text": "We have continued our work in establishing and embedding the Digital Markets Unit (DMU) which will oversee a new regulatory regime for the most powerful digital firms, promoting greater competition and innovation in the markets in which these firms operate, and protecting consumers and businesses from unfair practices. Powers for the DMU and for the new regulatory regime will require legislation. In the interim, the DMU has been established within the CMA, on a non-statutory basis to focus on operationalising and preparing for the new regime."
        },
        {
            "text": "We have launched a market study into mobile ecosystems in the UK  taking a closer look at whether Apple and Google’s firms’ effective duopoly over the supply of operating systems (iOS and Android), app stores (App Store and Play Store), and web browsers (Safari and Chrome), could be resulting in consumers losing out across a wide range of areas."
        },
        {
            "text": "We are also launching a market study into music streaming to build a view as to whether competition in this sector is working well or whether further action needs to be taken."
        },
        {
            "text": "We have launched an investigation into Apple following complaints that its terms and conditions for app developers are unfair and anti-competitive. We have continued our work on social media endorsements; and in June, we launched an investigation into suspected breaches of competition law by Facebook in parallel with the European Commission (EC). We have continued our work in tackling fake online reviews, with Facebook agreeing to further changes to its systems for identifying, removing and preventing such content on its social media platforms. We also have opened a case looking at fake online reviews on Amazon and Google."
        },
        {
            "text": "We published our recommendations to improve consumer protection on secondary tickets in August 2021. We also secured commitments in October from Groupon to improve customer service and ensure accuracy of descriptions on its website, and offer refunds to certain customers who were previously not offered them."
        },
        {
            "heading": 2,
            "text": "Supporting the transition to a low carbon economy"
        },
        {
            "text": "In line with the CMA’s commitment in the draft Annual Plan 2022/23 (and in the current plan) to support the transition to a low carbon economy, we have published a “Green Claims Code”, to help businesses comply with the law and prevent people being misled by environmental claims, which could erode consumers’ trust. We will carry out a review of misleading green claims early in 2022 and be ready to take action against offending firms."
        },
        {
            "text": "Following the commission from the Secretary of State (BEIS) to provide advice to government on how competition and consumer regimes can better support the UK’s Net Zero and sustainability goals, we have published a consultation on environmental sustainability and the competition and consumer law regimes."
        },
        {
            "text": "We are continuing to prioritise cases where practices could impede the transition to a low carbon economy. As part of the electric vehicle charging market study, we provided clear recommendations to governments designed to ensure that this new and fast-growing sector works well for UK drivers. Following on from the market study, we are also investigating long-term exclusive arrangements between a ChargePoint provider and three motorway service operators. The electric vehicle charging sector is crucial to the roll-out of electric vehicles, so we want to ensure that it works well for consumers as part of our commitment on climate change."
        },
        {
            "heading": 2,
            "text": "Getting closer to consumers"
        },
        {
            "text": "At the beginning of 2020, we set out our ambition to bring the CMA closer to consumers and their needs. Much progress has already been made. We are internalising many of the lessons learned through the process and are adopting these, as best practice for how we engage with consumers. We have committed to doing more to understand the issues facing consumers; to explain our decision-making; and to be a more visible and vocal advocate for consumers."
        },
        {
            "text": "We have extended our outreach to consumers, small businesses, and charities across the nations and regions of the UK. In the coming year, we will expand our presence in the UK's nations and regions, recruiting more staff for our offices in Cardiff, Belfast and Edinburgh and opening new ones in Darlington and Manchester."
        },
        {
            "text": "We would be grateful for your feedback and suggestions. These can be sent to us by email via our webform on the consultation’s webpage or via general.enquiries@cma.gov.uk, by 5pm on 21 January 2022."
        }
    ]
}