{
    "url": "https://ukhsa.blog.gov.uk/2021/12/02/react-the-covid-19-study-helping-piece-together-the-bigger-picture/",
    "title": "REACT – The COVID-19 study helping piece together the bigger picture",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-12-02T16:20:02+01:00",
    "content": [
        {
            "text": "Surveillance studies for COVID-19 have been crucial in helping the Government’s response to the pandemic. They’ve improved our understanding of how and where the virus is spreading, vaccine effectiveness, and helped shape government policy."
        },
        {
            "text": "REACT also identified waves of the virus that enabled the Government to take appropriate steps to safeguard the health of citizens in England and protect the NHS services."
        },
        {
            "text": "At the start of the pandemic we didn’t know basic things about this ‘novel’ coronavirus, such as how it was transmitted or why some people were more likely to have worse outcomes than others.  One of REACT’s key achievements has been its’ finding that up to a third of infected individuals exhibit no symptoms but are still able to spread infection to others."
        },
        {
            "text": "As a result, the UK has rolled out a number of surveillance studies which test a representative sample of the population at regular intervals to:"
        },
        {
            "text": "These studies rely on members of the public participating in this vital research, and close working between scientists and government to ensure that their findings are able to inform policy."
        },
        {
            "heading": 2,
            "text": "The REACT study"
        },
        {
            "text": "In May 2020, 120,000 people received a box containing equipment that could detect if they had been infected with SARS-CoV-2 and test them for antibodies. These participants became the first in what would become of one of the largest COVID-19 studies in the world - the Real-time Assessment of Community Transmission (REACT)."
        },
        {
            "text": "This was right at the start of the pandemic, before at-home testing was rolled out as a normal part of our lives."
        },
        {
            "text": "Over three million people have been involved in REACT to-date, with the research being carried out by Imperial College London in partnership with Ipsos MORI, and funded by the Department of Health and Social Care."
        },
        {
            "text": "The study originally took two approaches to track the virus across the population, as it looked both for current and past infection. REACT 1 is the strand of the study that asks people to take a swab test to establish how many people test positive for SARS-CoV-2, including those who don’t have symptoms, and the respective rate of infection in different demographic groups."
        },
        {
            "text": "REACT 2 (now complete) is the other strand that tested individuals for antibodies. Participants took a fingerprick test, which used a drop of blood to identify if they had SARS-CoV-2 antibodies which told us if they had been infected in the past."
        },
        {
            "heading": 2,
            "text": "What are we learning?"
        },
        {
            "text": "REACT 1 tells us the trajectory of infections, and which parts of England are witnessing the highest rates. By sampling large groups of the population, we also learn why some people are more at-risk of infections than others, how effective the vaccines are at protecting people, and whether there are new variants of the virus in circulation."
        },
        {
            "text": "In addition to other research studies, this data:"
        },
        {
            "heading": 2,
            "text": "Why we need to keep going"
        },
        {
            "text": "Despite the success of the vaccination campaign, it’s important to recognise that the pandemic isn’t over; rates of infection remain high across the UK, vulnerable people require hospitalisation, and high prevalence globally means that new variants may appear (as demonstrated by the recent emergence of Omicron)."
        },
        {
            "text": "Therefore, there is an ongoing need for surveillance studies such as REACT to gather data on how SARS-CoV-2 is circulating in the community. REACT still needs your help and support – in particular, it needs more participants from ethnic minority groups and young people aged between 18 and 35, as the virus is at higher levels in these groups."
        },
        {
            "text": "Furthermore, we know that some ethnic minority groups continue to suffer worse outcomes from COVID-19, seeing higher rates of infection, hospitalisation and death. If more people from these communities take part, we can understand why this is happening and respond to it better."
        },
        {
            "heading": 2,
            "text": "Taking part in REACT"
        },
        {
            "text": "Taking part in REACT is easy. Invitation letters are sent out to people, randomly selected from NHS records, to create a representative sample of the population for each round."
        },
        {
            "text": "If you receive a letter, please do take part, and follow the simple instructions to take your free PCR test."
        },
        {
            "text": "By participating in REACT we’ll continue to improve our understanding of COVID-19 which will support our ongoing fight against the virus, helping protect your family, friends and community. Together we’ll be making a difference that will keep us all safer now and in years to come."
        },
        {
            "text": "More info can be found here."
        }
    ]
}