{
    "url": "https://defrafarming.blog.gov.uk/2021/12/02/sfi-and-tenants/",
    "title": "Making the Sustainable Farming Incentive work for tenants",
    "authors": [
        "Jeanette Richardson"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2021-12-02T13:19:47+00:00",
    "content": [
        {
            "text": "We are developing our new environmental land management schemes so that there is an offer for all farm types. This includes tenants on tenanted land. "
        },
        {
            "text": "In this post, I’d like to share how we’re designing the Sustainable Farming Incentive so that tenants can access the scheme in a fair and straightforward way.  "
        },
        {
            "heading": 2,
            "text": "Working in partnership  "
        },
        {
            "text": "The Sustainable Farming Incentive will initially apply to farmers who claim BPS on more than 5 hectares of land. We will then extend this to more farmers."
        },
        {
            "text": "It will pay farmers for actions they take (beyond basic regulatory requirements) to manage their land in an environmentally sustainable way, to mitigate and adapt to climate change, and to improve animal health and welfare."
        },
        {
            "text": "In designing the sustainable farming incentive to make it work for tenants, we are working closely with a number of organisations including the Tenant Farmers Association (TFA), the  Country Land and Business Association (CLA) and National Farmers’ Union (NFU). "
        },
        {
            "text": "We’re also working with tenants through our pilot, test and trials and user research. "
        },
        {
            "text": "We are grateful for their contributions. They have played a huge part in helping us shape the policy and scheme design of the Sustainable Farming Incentive. "
        },
        {
            "heading": 2,
            "text": "Tenants and the Sustainable Farming Incentive "
        },
        {
            "text": "Within the Sustainable Farming Incentive, we are working to ensure that tenants can enter the scheme and receive payment for their participation through the following new rules:"
        },
        {
            "heading": 3,
            "text": "Agreement length and flexibility "
        },
        {
            "text": "In Countryside Stewardship, agreements are 5+ years long and there is no flexibility once you've entered into an agreement.  "
        },
        {
            "text": "This excludes tenants with agreements shorter than 5 years who aren’t able to make that commitment.  "
        },
        {
            "text": "It also makes the scheme quite risky for farmers as they have to make a 5-year commitment rather than being able to start small and expand their activities over time. "
        },
        {
            "text": "With this in mind, in the Sustainable Farming Incentive, scheme agreements will be 3 years in duration, with the ability to make amendments every 12 months.  "
        },
        {
            "text": "This will provide flexibility for participants to increase their level of ambition, apply for new standards and add more land into the agreement each year. "
        },
        {
            "text": "This flexibility will enable people to gradually increase the scope and scale of their Sustainable Farming Incentive activity over time, rather than committing to a static agreement over a 5-year period. "
        },
        {
            "text": "During early rollout of the Sustainable Farming Incentive in 2022, as a transitional measure, farmers with between 2 and 3 years left on the tenancy term of tenanted land will also be able to enter this land into the Sustainable Farming Incentive. They will be able to exit the scheme after 2 years with no penalty. "
        },
        {
            "text": "We’ve created an exceptions process for those who have an unexpected change in circumstance and need to remove land or reduce the ambition level within their 3-year agreement. There won’t be any penalty for people who need to exit the scheme under these exceptional circumstances. "
        },
        {
            "text": "By doing this, we aim to make environment schemes much more accessible to tenants who often aren’t able to commit to 5-year agreements, whilst also still maintaining a meaningful agreement duration where real outcomes can be delivered. "
        },
        {
            "heading": 3,
            "text": "Landlord permission "
        },
        {
            "text": "The requirement for a tenant to seek permission from their landlord to enter an agri-environment scheme can make it harder for some tenants to join. "
        },
        {
            "text": "We have listened to this feedback and reviewed this requirement. We don’t think it’s necessary, because the terms and conditions of tenancy agreements take precedence over Sustainable Farming Incentive agreements in determining what tenants can do on the land.  "
        },
        {
            "text": "As a result, there will be no requirement for landlord permission for a tenant to enter into the scheme in 2022. Instead, we ask that tenants check their tenancy agreements to make sure they can participate in the scheme before applying. "
        },
        {
            "heading": 2,
            "text": "Next Steps "
        },
        {
            "text": "We will keep our approach to tenanted land under review as we learn about how the scheme is working for tenants both in our pilot and during early rollout of the scheme from 2022. "
        },
        {
            "text": "We are also looking at how Local Nature Recovery and Landscape Recovery should work for tenants, and we will publish more information about this soon, so do subscribe to the Future Farming blog if you’d like to be kept informed."
        },
        {
            "text": "Today, more information on how the Sustainable Farming Incentive will work in 2022  was published on GOV.UK, do give it a read."
        },
        {
            "heading": 2,
            "text": "Farming Forum Q&A"
        },
        {
            "text": "Programme Director Janet Hughes and the team will be answering questions about the Sustainable Farming Incentive on the Farming Forum over the next few days. You don't have to be a member of the forum to read the questions and responses. You do, however, need to be a member to ask a question."
        }
    ]
}