{
    "url": "https://defrafarming.blog.gov.uk/2021/12/02/sfi-standards/",
    "title": "The Sustainable Farming Incentive: what’s new, improved and coming in 2022",
    "authors": [
        "Tom Lewis"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Payments to improve soil health",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2021-12-02T13:03:21+00:00",
    "content": [
        {
            "text": "Today we published further information on the Sustainable Farming Incentive. You can find it, in full, on GOV.UK."
        },
        {
            "text": "In this post, I’ll share a summary of the things that are new, the things we’ve changed following feedback and what you can expect in 2022."
        },
        {
            "text": "There are 3 environmental standards coming in 2022, plus an Annual Health and Welfare Review. This is in line with the plans we published in our update in June."
        },
        {
            "text": "We’ve also published our indicative roadmap for adding in more standards over the next 3 years. These will cover a wider range of actions farmers can take for the good of the environment and to tackle climate change."
        },
        {
            "text": "We’ll launch the scheme and make the first payments next year (2022). The application window will be open for 10 weeks and we’ll confirm the dates for the window early next year."
        },
        {
            "heading": 2,
            "text": "Responding to feedback "
        },
        {
            "text": "We’re taking an incremental, test and learn approach to our schemes. We try things, learn, improve them and repeat."
        },
        {
            "text": "Developing and constantly improving things in this way will help us make sure that they work for farmers and achieve their intended outcomes."
        },
        {
            "text": "We published draft standards for arable and horticultural soil and improved grassland soil earlier this year, and we’ve had plenty of feedback on them since then."
        },
        {
            "text": "We’ve also been going through the application process for the Sustainable Farming Incentive pilot with participants. We’ve been working closely with farmers and other experts to develop a standard for moorlands and rough grazing."
        },
        {
            "text": "We’ve learned a lot from all of these activities, and used what we’ve learned to develop the rules and standards of the Sustainable Farming Incentive scheme for 2022."
        },
        {
            "heading": 2,
            "text": "Scheme rules  "
        },
        {
            "text": "We’ve published the rules of the scheme, setting out who is eligible and how the scheme will work in practice."
        },
        {
            "text": "We’ve designed the rules to make the scheme more accessible, more straightforward, and fairer than previous schemes. For example, we are going to have a much more supportive approach to checks and controls, and we won’t be applying additional penalties for agreement breaches."
        },
        {
            "text": "When the scheme launches, farmers who are eligible for the Basic Payment Scheme (BPS) will be eligible for the Sustainable Farming Incentive. We will expand eligibility in the coming years."
        },
        {
            "text": "We’ve learned that many farmers prefer to adopt new practices and schemes incrementally, not all in one go."
        },
        {
            "text": "Farmers can choose how many of their fields to enter into the Sustainable Farming Incentive – they do not have to enter their whole farm – and they can add more land, standards or levels of ambition into their agreement each year."
        },
        {
            "text": "Tenant farmers are a vital part of our farming community. In the past they have sometimes been excluded from schemes because of lack of flexibility and agreement lengths that are too long."
        },
        {
            "text": "For the Sustainable Farming Incentive, we’ve set the agreement length to 3 years (rather than 5 under Countryside Stewardship), and in 2022 we’ll allow tenants with only 2 years left on their tenancy to enter the scheme too."
        },
        {
            "text": "We’ll also allow people to exit the scheme within their 3 year agreement in exceptional circumstances where they lose management control of their land. Common land is also a hugely important part of our landscape and heritage, and we want commons to be able to take part in the scheme as straightforwardly as possible."
        },
        {
            "text": "We’ve been working closely with commoners and other experts and are hugely grateful for their work with us so far."
        },
        {
            "text": "We’ll be continuing to work with commoners to develop detailed scheme rules and guidance, and we’re looking at how we can support facilitation for commons groups to help them take part."
        },
        {
            "text": "In the Sustainable Farming Incentive pilot, we weren’t able to accommodate parcels that were already covered by Countryside Stewardship. For the main Sustainable Farming Incentive scheme from 2022, we’re now able to allow farmers to have a Sustainable Farming Incentive agreement on the same parcel as a Countryside Stewardship agreement, so long as we’re not paying for the same action twice, and so long as the actions are compatible."
        },
        {
            "text": "We’re designing the scheme to be less prescriptive, allowing farmers to work out the best way to deliver the things we want to see. For example, where we’re asking for green cover, we’ll provide guidance but farmers will be able to choose the right approach for their farm."
        },
        {
            "heading": 2,
            "text": "The Arable and Horticultural Soils Standard and the Grassland Soils Standard"
        },
        {
            "text": "Managing and conserving our soil is something most farmers can do, and which have many benefits and form the basis of many other ecosystem services."
        },
        {
            "text": "We published our 2 soils standards in draft in the summer, and the changes we’ve made are based on the feedback we received. We learned in the pilot that the standards weren’t clear or straightforward enough, and some farmers weren’t sure how aspects of the standards would fit with their farm."
        },
        {
            "text": "We’ve made the standards clearer and applicable to more farms and removed anything that was confusing or unnecessarily complicated. We also learned in the pilot that the standards were too inflexible, requiring farmers to apply the same level of ambition to all parcels entered into the scheme."
        },
        {
            "text": "In 2022, farmers will be able to apply different ambition levels to different parcels on their farm. We’ve also made the standards less prescriptive (in terms of how to deliver the requirements of the standards) to allow farmers more flexibility to work out what’s right for their farm setting."
        },
        {
            "text": "We also heard through the pilot a lot of conflicting views about specific actions in particular minimum tillage / no tillage techniques."
        },
        {
            "text": "We’ve decided that before introducing those elements into the standard, we need to do more testing and learning with farmers in the pilot."
        },
        {
            "text": "To give us time to do this testing, learning and development, we’ll introduce the advanced level of ambition as soon as we can after we launch the scheme, most likely in 2023."
        },
        {
            "heading": 3,
            "text": "Arable and Horticultural Soils Standard specifics "
        },
        {
            "heading": 3,
            "text": " Grassland Soils Standard specifics "
        },
        {
            "heading": 2,
            "text": "Moorland and Rough Grazing Standard "
        },
        {
            "text": "The Moorland Rough Grazing Standard is new. We’re publishing it in draft so we can continue working with moorland farmers to develop it."
        },
        {
            "text": "The standard currently only has an introductory level of ambition as it is focussed on assessing moorland soils and their habitats – this simple assessment will underpin more ambitious delivery of moorland standards in the future."
        },
        {
            "text": "But importantly in the period before 2024 this standard must complement existing schemes but not duplicate them."
        },
        {
            "text": "We encourage anyone not in Countryside Stewardship to enter into it. Some moorland farmers will be in protected landscapes, and they’re also eligible for funding through our Farming in Protected Landscapes scheme."
        },
        {
            "heading": 3,
            "text": "Moorland and Rough Grazing Standard specifics "
        },
        {
            "heading": 2,
            "text": "What we’re working on now "
        },
        {
            "text": "We’re working up the detailed guidance to accompany the standards we’ve published today – we’ll publish that as soon as we can so that people have enough time to plan."
        },
        {
            "text": "We’ve also set out what standards are coming next with nutrient management, integrated pest management and hedgerows planned for 2023 with more to follow in 2024 and 2025 – we’ll share more information soon about how we’re going to co-design these standards with farmers and other experts, so do subscribe to the Future Farming blog."
        },
        {
            "heading": 2,
            "text": "Farming Forum Q&A"
        },
        {
            "text": "Programme Director Janet Hughes and the team will be answering questions about the Sustainable Farming Incentive on the Farming Forum over the next few days. You don't have to be a member of the forum to read the questions and responses. You do, however, need to be a member to ask a question."
        }
    ]
}