{
    "url": "https://dwpdigital.blog.gov.uk/2021/12/02/why-i-joined-dwps-blind-and-visually-impaired-network/",
    "title": "Why I joined DWP’s Blind and Visually Impaired Network ",
    "authors": [
        "Andrew Wilday, Associate Product Manager - DWP Digital"
    ],
    "categories": [
        "Diversity",
        "DWP Digital",
        "Product Design",
        "Product Manager"
    ],
    "pub_date": "2021-12-02T16:05:30+00:00",
    "content": [
        {
            "text": "I want to share my story, because when I have the odd down day there is nothing that motivates me more, than reading and hearing about the success of others in a similar position to me.  "
        },
        {
            "text": "About my visual impairment "
        },
        {
            "text": "I was born with a form of eye cancer call retinoblastoma, which was left undiagnosed for the first 18 months of my life. The warning signs came when my parents took loads of baby photos of me, as is tradition, and in all these photos, only my left eye would appear red. It could be put down to weird lighting, but the trend continued until they knew something wasn’t right. Several specialist check-ups later, I was diagnosed.  "
        },
        {
            "text": "By this stage the cancer was quite progressive, but I am thankful to say, doctors were able to save some of the vision in my right eye, which has enabled me to have the quality of life I have been lucky to lead. I deliberately chose very positive language to tell this story, but equally I could have written that I have lost the vision in my left eye and a lot of the vision in my right eye has been compromised. But I have a ‘glass half full’ way of looking at things. "
        },
        {
            "text": "Despite this setback, I think I’ve led a pretty ‘normal’ life, getting up to the usual mischief a teenage boy does, before graduating from university and landing a role in DWP. I’ve worked here for over 5 years now and have just turned 30. I recently moved into the product management profession and really enjoying it.  "
        },
        {
            "text": "Outside of work, I’m passionate about football, and proud to say that I’ve played in several competitive 11-a-side teams, alongside those who have no visual impairment. I see playing alongside them and being competitive as a huge achievement in itself.   "
        },
        {
            "text": "Assistive technology "
        },
        {
            "text": "Although my stubbornness and determination has done me good in sports, the same can’t be said when it comes to assistive technology, which is used to support and assist individuals with disabilities. I was determined to work in a way that was the same as everyone else, to prove I could do it without the help of fancy tools. I did so for years and regret every week I struggled on. Unnecessarily suffering through headaches and tiredness as a result.  "
        },
        {
            "text": "DWP has lots of networks and many are aimed at supporting colleagues who identify with a particular group. Curiosity got the better of me and I decided to join the Blind and Visually Impaired Network following some work I did on their intranet site and helping to publicise their activity in the lead up to World Site Day.    "
        },
        {
            "text": "Hearing stories from the network members about how important assistive technology was to them and how it impacts their working lives, encouraged me look into it for myself. I would go as far as to say it was life changing. That might seem a bit strong, but it really has allowed me to enjoy my downtime more, as I’m not exhausted at the end of each day. It has also significantly raised the quality of work I’m able to deliver. If it wasn’t for joining the network, I don’t think I would have had the drive or interest to adopt assistive technology.   "
        },
        {
            "text": "For example, I use Zoom Text, which enlarges everything on your screen, and is easy to customise. I can increase the level of magnification to suit my needs. I can fine tune things like contrast and my curser, making little tweaks like that can make a big difference. I use the built-in screen reader, which feeds back where I am clicking and reads text aloud. Everyone, to some extent, reads what they think they have written, rather than what it actually says. I find with my visual impairment, I do this a lot more because my brain fills in the visual blanks. So, the screen reader is incredibly useful when I’m sense checking my work.  "
        },
        {
            "text": "I have been assigned an assistive software buddy, that I can go to troubleshoot any issues, and I was able to load the Zoom Text software onto my current laptop, so it was pretty seamless.  Any updates seem to go on quietly in the background.  "
        },
        {
            "text": "A positive outlook "
        },
        {
            "text": "As I touched on earlier, when the odd dark day does come along, the huge value in being part of the network community is their positive spirit. For every barrier they face, they find a solution or a funny story to share with us all. The best scenario is when they share both. There are now over 100 members, with their own unique challenges and story, but they all share one thing in common, an incredibly positive outlook and determination to succeed. "
        },
        {
            "text": "I have found listening to the stories of others in our community inspirational, and it gives the phrase ‘strength in numbers’ a whole new sense of meaning. That’s the power of the community for me. I was amazed at how many people were going through similar stuff, I was naïve to think I may have been the only one. In a community this large, nobody should ever feel alone. I am a huge advocate for talking about these things and sharing stories. Every story I hear from someone else gives me something new to think about, so please do reach out to me if you want a chat andrew.wilday@dwp.gov.uk "
        }
    ]
}