{
    "url": "https://foresightprojects.blog.gov.uk/2021/10/19/future-proof-policy-a-guide-to-using-foresight-in-policy-making/",
    "title": "Future proof policy: A guide to using foresight in policy making",
    "authors": [
        "helendoran",
        "petermcgowran"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-10-19T09:37:25+01:00",
    "content": [
        {
            "text": "Futures thinking and foresight tools provide policy makers with a structured approach to policy making that is robust and responds to long-term change. Our published Brief Guide to Futures Thinking and Foresight and Futures Toolkit are designed to help policy makers gather intelligence and make sense of possible future change, explore the dynamics and uncertainties of that change and describe what the future might be like. But how can policy professionals and teams apply foresight tools to different parts of the policy making cycle? And when is the right moment to apply some strategic foresight?"
        },
        {
            "text": "Peter’s main task during his internship was to reach out to futures practitioners and policy makers across government to learn which futures tools they use in policy making and to situate these within other strategic approaches. This research and insight led to the development of a Futures x Policy Cycle."
        },
        {
            "heading": 2,
            "text": "The Futures x Policy Cycle"
        },
        {
            "text": "In our guide we map different foresight approaches and futures tools onto the ROAMEF Policy Cycle, from HM Treasury’s The Green Book: appraisal and evaluation in central government (2020). See Figure 1. For each stage of the policy cycle we describe:"
        },
        {
            "text": "Figure 1. Futures tools mapped to the five stages of the policy cycle."
        },
        {
            "text": "We hope policy makers use this guide as a reference point for making better long-term policies. To request a copy of A guide to using foresight in policy making please contact us at futures@go-science.gov.uk. UK government policy makers can also contact the Government Office for Science Futures team for advice using the same email address."
        }
    ]
}