{
    "url": "https://prisonleaversproject.blog.gov.uk/2021/10/19/lessons-from-mojs-first-ever-innovation-challenge/",
    "title": "Lessons from MoJ’s first ever Innovation Challenge",
    "authors": [
        "Daniel Daly"
    ],
    "categories": [
        "Prison Leavers Innovation Challenge"
    ],
    "pub_date": "2021-10-19T11:06:50+01:00",
    "content": [
        {
            "text": "The tech sector is known for bringing new, disruptive solutions to old challenges, as well as the ability to scale them at pace."
        },
        {
            "text": "As part of the Prison Leavers Project, we wanted to inject some of this innovation and dynamism into the way we approach policy challenges."
        },
        {
            "text": "That’s why we launched the first ever Prison Leavers Innovation Challenge – aimed at tech companies and start-ups – where we invited them to develop new tools and solutions that can help deter prison leavers from reoffending."
        },
        {
            "text": "Back in May, we published six ‘challenge statements’. These were open questions based around some of the problems that we know contribute to reoffending, like: “how can we inform, coordinate, and update relevant stakeholders of a prisoner’s day of release details and key appointments?”"
        },
        {
            "text": "We had a fantastic response to the competition – with 57 applications – and we’ve now welcomed 9 tech organisations with innovative ideas onto the programme, who have received up to £25,000 to develop a working prototype of their solution over 8 weeks."
        },
        {
            "text": "Along the way we, alongside our delivery partner PUBLIC, have provided a dedicated programme of hands-on support and mentorship – mirroring the model of start-up “accelerators”– to help get the best out of these novel ideas."
        },
        {
            "text": "This ‘Dragon’s Den’ approach is not necessarily the norm for policy making, so as we approach the end of this phase and prepare to select the ‘winners’ to continue developing their solution and run a full pilot, we’re reflecting on the lessons we’ve learned so far about running a Government Innovation Challenge."
        },
        {
            "heading": 2,
            "text": "1. Getting buy-in from the wider Criminal Justice System"
        },
        {
            "text": "No tech solution – no matter how powerful – could be successful in isolation."
        },
        {
            "text": "Siloed, disconnected or fragmented services could risk doing more harm than good, so we wanted our innovators to have as much buy-in and support from partners across the Criminal Justice System as possible."
        },
        {
            "text": "To do this, we put together a learning offer, which included focus groups with prison leavers; tailored workshops with cross-Government policy officials working in areas relevant to their solution; and teach-ins with key policy, digital and cybersecurity contacts to help suppliers understand where they ‘fit’ within this complex system."
        },
        {
            "text": "What’s more, they were each carefully matched with a dedicated ‘operational guide’ from Regional Probation Director teams with critical knowledge of prisons and probation. The guides have really helped suppliers to identify the practical obstacles to their solutions and to begin to broker the right relationships to overcome hurdles in the next phase."
        },
        {
            "text": "Lived Experience mentors, those from the third sector, as well as subject matter experts from across the MoJ, were also available for dedicated ‘office hours’ ensuring suppliers had access to that important knowledge that can help shape their solution."
        },
        {
            "text": "We’ve hosted internal Show and Tell events, to help innovators refine their pitch and also receive feedback from MoJ colleagues. We’re also preparing to host a Pitch Day where Government Departments and other interested stakeholders can network directly with the suppliers."
        },
        {
            "heading": 2,
            "text": "2. Design principles"
        },
        {
            "text": "Across the Project, our commitment to agile working means starting small with rapidly-built prototypes, leaving space to adapt in response to testing or new information, and scaling up if solutions look promising – or trying something else if they don’t!"
        },
        {
            "text": "The two-phased structure of the PLIC reflects this principle – the most promising prototypes will be further iterated and taken forward to pilot – but how have we reflected our commitment to continuous learning and improvement in the prototyping phase itself?"
        },
        {
            "heading": 2,
            "text": "3. Helping us to understand ‘what works’ in reducing reoffending"
        },
        {
            "text": "Evaluating our impact is one of the core principles of our Project."
        },
        {
            "text": "Each of our innovators has been onboarded with this principle in mind – and they’ve been asked to develop clear plans for how they might collect key data points and measure their impact if their solution were to be rolled out."
        },
        {
            "text": "This will help us to understand not only the impact of a solution on reoffending, but also other outcomes like employment, health, compliance with probation, as well as self-reported measures on wellbeing."
        },
        {
            "text": "We know that this might be new territory for some companies, so to help them embed this into the design of the prototypes, innovators have been matched with dedicated analysts for tailored workshop sessions to help refine their plans and the two will work closely to develop their pilots."
        },
        {
            "text": " "
        }
    ]
}