{
    "url": "https://insidehmcts.blog.gov.uk/2021/10/19/supporting-vulnerable-users-during-covid-19-and-beyond/",
    "title": "Supporting vulnerable users during COVID-19 and beyond",
    "authors": [
        "Louise Hird"
    ],
    "categories": [
        "COVID-19",
        "Customer experience and research"
    ],
    "pub_date": "2021-10-19T16:30:47+01:00",
    "content": [
        {
            "text": "Coming to court can be a daunting experience for anyone, but it can be an even bigger challenge for the most vulnerable in our society, especially during the exceptional circumstances we’ve experienced through COVID-19."
        },
        {
            "text": "When the pandemic started, we quickly changed the way courts and tribunals operated so they could run safely during COVID-19. An important part of this was making sure that vulnerable people could still access justice services."
        },
        {
            "text": "Today we published an updated Vulnerability Action Plan. This sets out how we’ve supported vulnerable people to make sure they've continued to receive accessible and appropriate support."
        },
        {
            "text": "What is the Vulnerability Action Plan?"
        },
        {
            "text": "Our Vulnerability Action Plan details the measures we’ve taken during COVID-19 and what we’ll be doing in the future. We used research with our vulnerable users and worked with groups that represent vulnerable people to make sure the plans we put in place were hitting the mark."
        },
        {
            "text": "From the feedback we received, we identified priority areas, including:"
        },
        {
            "text": "How we supported vulnerable users during the COVID-19 pandemic"
        },
        {
            "text": "We've taken several measures which are detailed in the plan. For instance, across the criminal courts, we accelerated the plans for vulnerable victims and witnesses to give pre-recorded evidence at all Crown Courts (Section 28). We also worked with the court-based Witness Service to ensure witnesses continued to be supported during COVID-19."
        },
        {
            "text": "At the start of the pandemic, we quickly increased the use of remote hearings, including the use of Cloud Video Platform. It was important that we made provisions for vulnerable users, such as setting up the technology so that it protected some parties seeing each other while still being able to see the judge and legal professionals."
        },
        {
            "text": "Recognising the potential impact of national lockdowns on victims of domestic abuse, we quickly made sure that information to support them was visible, accessible and easy to use. This included updates to GOV.UK with information about getting an injunction against violent partners or family members and how to get help to apply online. We also provided new leaflets on how to apply for injunctions without the other party being aware, such as an occupation order, which defines who can live in the family home or enter the surrounding area."
        },
        {
            "text": "Next steps for protecting vulnerable users "
        },
        {
            "text": "We're currently developing a longer-term Vulnerability Action Plan for HMCTS. Our commitment is to ensure that we're listening to our partners who support vulnerable groups, as well as vulnerable people themselves, and adapting and improving our services to meet their needs."
        },
        {
            "text": "We're also working in partnership with the Ministry of Justice and other government departments to make sure we provide the right level of support, so that our vulnerable users can always access the justice system safely and with confidence."
        },
        {
            "text": "To find out more you can read our latest vulnerability action plan. Look out for news of our longer-term action plan which will be published on GOV.UK."
        },
        {
            "text": " "
        }
    ]
}