{
    "url": "https://geospatialcommission.blog.gov.uk/2021/10/19/the-geospatial-scholarship-fund-a-call-to-action-for-the-geospatial-industry/",
    "title": "The Geospatial Scholarship Fund – A call to action for the geospatial industry",
    "authors": [
        "Stuart Bonthrone, Chief Executive, Esri UK"
    ],
    "categories": [
        "Data",
        "Skills"
    ],
    "pub_date": "2021-10-19T12:18:25+01:00",
    "content": [
        {
            "text": "As we focus on education this year for Black History Month 2021- Proud To Be, we are delighted to place a spotlight on geosciences and the importance of diversity in a subject that informs decisions that affect all our lives. "
        },
        {
            "text": "In this blog, we find out more about ESRI UK’s Geospatial Scholarship in supporting Black and Black mixed heritage students to study geosciences at university."
        },
        {
            "text": "Statistics compiled by the Royal Geographical Society and Inspirational Black Geographers organisation show that although the number of Black students taking geography has increased significantly between 2008 and 2018, Black students are still significantly under-represented on geography degrees. More alarmingly, they are significantly less likely to complete their degree; in 2018, 72% of White students studying geography completed their course compared to just 57% of Black students."
        },
        {
            "heading": 2,
            "text": "Improving diversity, equity and inclusion"
        },
        {
            "text": "In January 2021, Esri UK launched the Geospatial Scholarship Fund to improve Diversity, Equity and Inclusion (DEI) within the geospatial sector. Esri UK has partnered with the inspirational Black Geographers organisation to launch the first two scholarships in this fund. These scholarships will focus on encouraging Black and Black mixed heritage students to study geography and related geosciences."
        },
        {
            "text": "The aim of Esri UK’s scholarship is to reduce financial stress so the students can focus on their studies and achieve their full potential. In its first year, Esri UK will be supporting an undergraduate student with £30,000 over the duration of their course and a postgraduate student with £20,000. Esri UK will add at least one undergraduate and postgraduate student each year for the next five years. In addition, the scholars will also receive support and training throughout their time in the programme from Esri UK and Black Geographers."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "The Geospatial Scholarship Fund has been created as a vehicle to promote and encourage diversity and inclusion in the geospatial industry. If you want to find out more information about the fund or to help grow the number and variety of scholarships on offer, please contact scholarships@esriuk.com or visit The Geospatial Scholarship Fund."
        },
        {
            "text": "Sign up to this blog to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}