{
    "url": "https://civilservice.blog.gov.uk/2021/10/19/world-menopause-day-2021/",
    "title": "World Menopause Day 2021",
    "authors": [
        "Angela MacDonald, HMRC Deputy CEO and Second Permanent Secretary"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2021-10-19T09:07:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Angela MacDonald explains that for many women who struggle with health issues approaching, during and after the menopause, it’s good to talk."
        },
        {
            "text": "Yesterday, Monday 18 October 2021, was World Menopause Day (WMD), a day to raise awareness and keep the conversation growing about this important topic.  "
        },
        {
            "text": "I’m proud and delighted to be your new senior sponsor for the Cross-Government Menopause Network and I am looking forward to playing my part in keeping us talking about the menopause across the Civil Service."
        },
        {
            "text": "The menopause is not an illness, it is a natural phase of a woman’s life, but that does not mean it is always easy. Many women, and I include myself in this, find the menopause hugely impactful and, at times, a difficult journey. The menopause can bring about symptoms that are, for some, life-changing, making life harder both at home and at work."
        },
        {
            "text": "Totally unprepared"
        },
        {
            "text": "Unfortunately, my sex education didn’t include conversations about menopause, so I was totally unprepared when I started to experience symptoms. Lots of scare stories and contrasting views on subjects like Hormone Replacement Therapy added to my confusion at a time when I was probably least able to engage with it. "
        },
        {
            "text": "It’s taken me a couple of years to own what’s happening to me and stop being embarrassed to talk about it. My symptoms have had a real impact on my husband too, which is why I believe so strongly that awareness and education needs to extend beyond those people who are directly experiencing it. "
        },
        {
            "text": "World of difference"
        },
        {
            "text": "Having open and honest discussions about the menopause can make a world of difference. When I started to open up about my own difficulties, I realised that I wasn’t the only one and this was also happening to some of my closest colleagues – we just weren’t acknowledging it to each other. I felt able to own the moments when my brain freezes and no sensible words come out or when physical symptoms can’t help but be noticed by others. I fully support the work of the Cross-Government Menopause Network in their ambition to encourage the whole Civil Service to become menopause-friendly, a place where we can all have rich and meaningful discussions."
        },
        {
            "text": "Bone health"
        },
        {
            "text": "The theme for WMD 2021 is bone health - one of the many impacts of menopause can be loss of bone mass as a result of depleting hormone levels, and an increased risk of osteoporosis. This makes it even more important to understand the menopause and the long-term impact it can have on our health."
        },
        {
            "text": "The Cross-Government Menopause Network recently updated the menopause Guiding Principles for Employees and their Managers based on the helpful feedback many colleagues provided."
        },
        {
            "text": "I would encourage everyone to take a look at the products. I am sure we will all find conversations easier when we all understand the menopause a little better. We really want people to use the products to have conversations with colleagues and managers."
        },
        {
            "text": "Many government departments have organised some great events and podcasts to celebrate World Menopause Day, some of which are open to wider Civil Service colleagues. If you have the opportunity, please do get involved."
        }
    ]
}