{
    "url": "https://defrafarming.blog.gov.uk/2021/10/19/your-questions-about-the-future-farming-resilience-fund/",
    "title": "Your questions about the Future Farming Resilience Fund",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2021-10-19T13:24:15+01:00",
    "content": [
        {
            "text": "Last week I wrote a blog post encouraging farmers and land managers to take advantage of the free business support and advice on offer through the Future Farming Resilience Fund. "
        },
        {
            "text": "Some people have been in touch to ask various questions about the fund. I wanted everyone to see the responses, so I thought I’d address them in this blog post. "
        },
        {
            "text": "The fund makes free expert support and advice available to farmers and land managers in England. Any business currently receiving Basic Payment Scheme (BPS) is eligible."
        },
        {
            "text": "The goal is to help agricultural businesses:"
        },
        {
            "text": "The fund is running across 3 phases:  "
        },
        {
            "text": "We previously said that we would run the scale-up phase from April 2022, but we are now looking at a revised go-live date and will let you know when further information is available."
        },
        {
            "text": "If you were involved in the initial phase, you can also take part in the interim phase. "
        },
        {
            "text": "The fund is being paid for by Defra. The interim phase is being delivered by a group of 19 advice providers including consultants, charities, trade associations and academic institutions.  "
        },
        {
            "text": "Different providers offer different kinds of support, in different sectors. Many of them offer 1-to-1 consultations and farm visits, followed up by recommendations in a report. Others provide workshops, webinars, tours and networking opportunities to help farmers get support from their peers. "
        },
        {
            "text": "We encourage you to read through the list of providers, what they are offering and where they are operating then contact them directly. "
        },
        {
            "text": "Each provider is operating on a first-come, first-served basis, so it’s better to sign up sooner rather than later.  "
        },
        {
            "text": "It’s ok to get introductory help and information, or attend opening webinars or workshops, from multiple providers; but you should only sign up for detailed 1-to-1 support from a single provider. "
        },
        {
            "text": "When you sign up with a provider to get free advice, you will usually be asked to provide your name, address, email address, phone number and Single Business Identifier (SBI) number.  "
        },
        {
            "text": "Advice providers will share some of this basic data with Defra, so that we can check that you got the support you needed. You might also be asked to provide details about your business and its finances, so that the advisor can give you the best possible support. That information will always remain confidential between you and your advisor and will not be seen by Defra. "
        },
        {
            "text": "You can change your provider in the early stages, say after an introductory webinar, but it's not possible to change provider once you've agreed to getting more detailed 1-to-1 support. By building a relationship with your provider, you can give them direct feedback about the quality of their advice.  "
        },
        {
            "text": "If you have any complaints or issues with an advice provider that you can't settle with them directly, you can contact the team at Defra by emailing ffcpResilienceFund@defra.gov.uk. "
        },
        {
            "text": "Providers will have access to the latest information from Defra, so they'll be able to give up-to-date advice on topics including lump sum payments and retirement options, if appropriate.  "
        },
        {
            "text": "Farms that straddle borders with Wales and Scotland are eligible to take part in this phase, as long as they have some land in England. "
        },
        {
            "text": "Of course, the Future Farming Resilience Fund isn’t the only source of business advice for farmers and land managers. There’s lots more support available from third parties, including: "
        },
        {
            "text": "If you have any more questions or you've applied for advice and want to let us know how you got on, do leave a comment below."
        }
    ]
}