{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/13/dio-senior-blast-effects-engineer-seo/",
    "title": "DIO - Senior Blast Effects Engineer (SEO)",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-10-13T12:52:41+01:00",
    "content": [
        {
            "text": "Do you want a job where every day is different?"
        },
        {
            "text": "Does providing specialist construction advice about explosives, weapons, ballistics & counter terrorism sound exciting?"
        },
        {
            "text": "If your answer is yes, then DIO is the place for you."
        },
        {
            "text": "Working for DIO and joining an integral part of the UK’s Defence will allow you to support several diverse and unique projects daily. Recently, £200M has been invested into infrastructure to enable the state of the art F-35 Lighting II to take flight, whilst keeping the base full operational. These are once in a lifetime projects where your input can make a real difference."
        },
        {
            "text": "The post holder will be accountable to the Head of the Weapons Effects on Structures (WES) team who holds technical responsibilities in the following 'Weapons Effects' subject areas:\n• To represent MoD on legislative, industry and MoD committees.\n• To produce & promulgate MoD Policy & technical standards\n• To provide specialist input to works Projects in accordance with published Policy.\n• To carry out research & development in support of the above.\n• To carry out Audits & Assurance both internally to MOD and externally.\n• To direct the work of specialist consultants.\n• To maintain MoD’s specialist Library & records concerning weapon effects on building structures.\n• To mentor and lead support staff when required."
        },
        {
            "text": "You can find more information, such as the application process, here. "
        }
    ]
}