{
    "url": "https://actuaries.blog.gov.uk/2021/10/13/financial-support-for-smaller-businesses/",
    "title": "Financial support for smaller businesses",
    "authors": [
        "Jason Ronad - Senior Trainee Actuary"
    ],
    "categories": [
        "Actuary",
        "Finance"
    ],
    "pub_date": "2021-10-13T13:06:41+01:00",
    "content": [
        {
            "text": "Raising finance is important in allowing a business to function. In particular, working capital enables the day-to-day operations of the business. The need for this finance was the main focus for all businesses during the pandemic, especially for the smaller ones."
        },
        {
            "text": "In this blog I begin by outlining what sets smaller businesses apart from larger ones and why they are important to the UK’s economy. Then, I’ll look at the main sources of external finance that are available to smaller businesses."
        },
        {
            "heading": 2,
            "text": "Smaller businesses play a large role"
        },
        {
            "text": "The Department for Business, Energy & Industrial Strategy (BEIS) produces an annual publication that summarises the total UK business population. The latest business population estimates show that at the start of 2021, there were 5.6 million businesses."
        },
        {
            "text": "The cut-off point used to differentiate the business size was the number of employees. Smaller businesses, also known as small-medium enterprises (SMEs), had fewer than 250 employees. The standout statistic was that of the total number of businesses, SMEs made up 99.9%. Moreover, of the total 27 million in employment, SMEs represented a majority at 61%. The figures also showed SMEs with a borderline majority at 52% of the total £4.4 trillion turnover."
        },
        {
            "text": "For each of those 3 key measures, it is clear SMEs form a substantial proportion of their totals. Given their impact on the UK economy, the next concern is how their continued viability is dependent on their ability to raise finance."
        },
        {
            "heading": 2,
            "text": "Sources of finance – types"
        },
        {
            "text": "Businesses have a number of options when it comes to raising finance. Internally, this may involve using cash reserves and retained earnings or even the sale of assets. In the absence of those options or reluctance to use them, they may then look to external sources."
        },
        {
            "text": "Seeking support outside of a business to raise finance commonly falls into 2 categories, debt finance and equity finance.  Through debt finance, the business receives the capital, in exchange for repaying the value borrowed with interest. Whereas for equity finance, the business receives the capital and possibly expertise, in exchange for a portion of their ownership."
        },
        {
            "text": "Sources of debt finance are more commonly used by SMEs as it is relatively difficult to get equity financing at their level. However, for some newer, innovative and fast-growing SMEs, debt finance could be the type that is difficult to access. Seeking sources of equity finance may therefore be a necessary step for such start-up businesses with a higher risk-return profile and less revenue history."
        },
        {
            "text": "There are other sources that do not neatly fall into those 2 categories, such as trade credit and government support. The former is a line of credit, offered from a supplier, allowing the business to generate turnover before making a repayment. The latter may be as direct as a grant or as indirect as the coronavirus loan schemes that were setup to ensure businesses could access the finance they need."
        },
        {
            "heading": 2,
            "text": "Sources of finance – external examples"
        },
        {
            "text": "For the typical sources of external finance, that are most relevant for SMEs, this Venn diagram lists some examples, which are then described further."
        },
        {
            "text": "Bank lending: term loans, overdrafts and credit cards are traditional sources an SME would rely on. Readily available, these sources tend to be the first port of call for an SME to raise finance."
        },
        {
            "text": "Asset-based finance: invoice finance and asset-based lending are other traditional sources. They involve the SME securing a loan by using any asset listed in their balance sheet as collateral."
        },
        {
            "text": "Asset finance: leasing and hire purchase are further traditional sources. Usually for financing the acquisition of equipment, rather than receiving money or credit, the SME exchanges regular payments to receive the asset directly."
        },
        {
            "text": "Peer-to-peer (P2P) lending: an alternative source of debt finance. Rather than borrowing from a bank or building society, P2P platforms pair the SME with willing lenders in the marketplace."
        },
        {
            "text": "Mezzanine finance: another alternative source of finance. Though found in various forms, the commonality is its unique composition of debt finance and equity finance features. For example, the SME could raise finance through a conditional loan, where if the SME was unable to make the interest repayments, equity in the SME would be exchanged instead."
        },
        {
            "text": "Private equity: from a venture capitalist or angel investor, is a traditional source of equity finance. When an SME is not listed publicly, investors may still be interested in providing capital in exchange for an ownership stake."
        },
        {
            "text": "Alternative Investment Market: for an SME looking to the public for equity finance, listing on the Alternative Investment Market of the London Stock Exchange would be a traditional source."
        },
        {
            "text": "Equity crowdfunding: similar to P2P lending offering an alternative to bank lending, equity crowdfunding is another option that allows an SME to exchange equity for capital from public investors."
        },
        {
            "heading": 2,
            "text": "Sources of finance – trends"
        },
        {
            "text": "The British Business Bank  produces an annual publication that reviews the markets for all the sources noted above. A takeaway from the latest Small Business Finance Markets Report was the SMEs growing reliance on alternative sources of finance. One example is the increase, over the past decade, in the use of crowdfunding as a source of equity finance for private businesses."
        },
        {
            "text": "Largely due to the pandemic, there was a surge in demand for external financial support from smaller businesses. Fuelled by government intervention, markets grew to accommodate this higher demand. Even so, there were almost 400,000 fewer businesses at the start of 2021, compared to the previous year. Not only was this the first material decline in over 20 years, but almost all of the decline came from the smallest of businesses – sole proprietorships and partnerships."
        },
        {
            "text": "For an investor, committing funding to debt or equity finance presents different risk and reward trade-offs. The availability and attractiveness of the different options will depend on the outlook for those SMEs seeking finance and the level of competition in the market. As the level of government support through the pandemic changes, the favoured source and cost of financing for SMEs is likely to change."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "For further detail and expertise from GAD, see our Market data insights. The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page. "
        }
    ]
}