{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/13/hazardous-substances-advisory-committee-recruiting-new-members-now/",
    "title": "Hazardous Substances Advisory Committee: Recruiting new members now!",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-10-13T13:02:21+01:00",
    "content": [
        {
            "text": "The Department for Environment, Food and Rural Affairs (Defra) is pleased to announce that it is now recruiting new committee members for the Hazardous Substances Advisory Committee (HSAC), a non-statutory, independent scientific advisory body."
        },
        {
            "text": "HSAC provides expert advice on how to protect the environment, and human health via the environment, from potentially hazardous substances, articles and wastes, including nanomaterials."
        },
        {
            "text": "HSAC plays a vital role in assisting Defra in identifying, analysing, assuring and challenging the evidence that we use in policymaking. The HSAC advises Defra on a broad range of topics, what constitutes ‘good’ evidence, contentious chemicals, prioritising the key chemical issues for the UK, defining evidence gaps and scoping exploratory work on emerging challenges."
        },
        {
            "text": "We are recruiting the following roles:"
        },
        {
            "text": "The recruitment will close on Friday 5 November."
        },
        {
            "text": "Please visit the Cabinet Office website for full details and application forms using the following links:"
        },
        {
            "text": "Chair’s role"
        },
        {
            "text": "Member’s role"
        },
        {
            "text": "Early career researcher’s role"
        },
        {
            "text": " "
        },
        {
            "text": "Webinar"
        },
        {
            "text": "For anyone who would like to learn more about these roles, HSAC are offering an opportunity for potential candidates to join a live webinar on Monday 25 October from 14:00 to 15:00 hrs with a combined Defra and HSAC panel. The link to register is within the links above."
        }
    ]
}