{
    "url": "https://cspl.blog.gov.uk/2021/10/13/reforming-party-funding-arrangements/",
    "title": "Reforming party funding arrangements",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Elections",
        "Party funding"
    ],
    "pub_date": "2021-10-13T15:11:11+01:00",
    "content": [
        {
            "text": "Our report on Election Finance, published in the Summer, made a number of recommendations to modernise and bring greater integrity to party finance, including greater due diligence around the source of donations. At the report’s launch, I was asked why the Committee had not recommended a limit on party political donations as part of its review."
        },
        {
            "text": "Political parties play a vital role in our democracy. The public may be cynical about them, but they provide and support the thousands of individuals who make up the government, the opposition, and the majority of the membership of hundreds of local councils. In order to fulfil their role in the democratic process, political parties require adequate and sustainable funding both locally and nationally. Donations are an essential part of those funding arrangements."
        },
        {
            "text": "Winning elections gives parties the power to take major decisions affecting our economic and social life. It is essential, therefore, that parties obtain funding in ways that are free from suspicion that donors receive favours or improper influence in return."
        },
        {
            "text": "Given the reliance of our major parties on large donations from a limited number of sources and the perception of undue access and influence given to donors, I doubt many would argue that our current system meets this test."
        },
        {
            "text": "Regulation of party funding currently relies mainly on transparency, based on recommendations made by CSPL in 1998. Donations above £7,500 must be declared and published quarterly by the Electoral Commission, allowing public scrutiny of individuals and organisations funding political parties."
        },
        {
            "text": "The Committee last examined the broader issue of party funding in detail in 2011 under Sir Christopher Kelly’s chairmanship. That report, Ending the big donor culture, found that ‘all major parties were reliant on a relatively small number of individuals, trades unions or other organisations and that all party leaders were required to spend time soliciting those individuals or organisations for the fund they need to survive.’  They made a package of recommendations – including a £10,000 cap on donations and an element of additional state funding."
        },
        {
            "text": "To date, neither the Conservative or Labour parties, nor successive governments, have accepted the argument for this kind of change. Public scepticism about party funding – and media stories about favours and access given to donors – continues to damage public confidence in politics."
        },
        {
            "text": "The basic premise of the argument made by our predecessors remains true. If small donations made by party members are unable to match the costs incurred in running a major party, there are only two possible alternative sources of funding: big donors or additional funding by the state. If we want to reduce reliance on the former, then parties – and the public – would have to accept the latter."
        },
        {
            "text": "The Committee did not examine a cap on donations in its recent review because there seems to be little desire today to confront that choice. Without the political will or public appetite for major reform of party finance, due diligence, transparency and scrutiny must continue to act as the first line of defence."
        }
    ]
}