{
    "url": "https://educationhub.blog.gov.uk/2021/10/13/t-levels-everything-you-need-to-know-about-the-groundbreaking-new-technical-equivalent-to-a-levels/",
    "title": "T Levels: Everything you need to know about the groundbreaking new technical equivalent to A levels",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "T Levels"
    ],
    "pub_date": "2021-10-13T16:48:58+01:00",
    "content": [
        {
            "text": "T Levels – the new technical post-16 qualification available in schools and colleges all over the country – may only have been around for one year, but already they are making a huge difference for those that study them."
        },
        {
            "text": "These pioneering new qualifications offer students a mixture of classroom learning and ‘on-the-job’ experience during an industry placement of at least 9 weeks."
        },
        {
            "text": "Here’s everything you need to know about T Levels."
        },
        {
            "heading": 3,
            "text": "What are T Levels? "
        },
        {
            "text": "T Levels are technical qualifications - equivalent to three A Levels – that combine classroom study with industry placements so that students gain the skills and experience they need to progress into work, further study or an apprenticeship."
        },
        {
            "text": "T Levels have been designed so that not only are they of the highest standards, but also so that they equip those who study them with the skills that will help them in the workplace, with content designed with over 250 employers including Fujitsu and Amazon."
        },
        {
            "text": "T Level courses include the following elements:"
        },
        {
            "heading": 3,
            "text": " What subjects are available at T Level? "
        },
        {
            "text": "The first three T Levels in Design, Surveying and Planning for Construction; Digital Production, Design and Development; and Education & Childcare were introduced in 2020."
        },
        {
            "text": "A further seven became available from September in subjects including Healthcare, Science and Onsite Construction - and subjects including Engineering and Manufacturing, Finance, Creative & Design and Legal will be introduced from 2022 and 2023."
        },
        {
            "text": "More T Levels will start in the following years until more than 20 are available, covering everything from agriculture to catering and engineering to science."
        },
        {
            "heading": 3,
            "text": "Where can I find out more information on T Levels?  "
        },
        {
            "text": "You can find a list of available T levels and more information here."
        },
        {
            "text": "The National Careers Service has all the information and advice about your choices to help you find the best path, including T Levels - visit www.nationalcareers.service.gov.uk/careers-advice."
        }
    ]
}