{
    "url": "https://dcmslibraries.blog.gov.uk/2023/06/30/5-months-of-engagement-with-over-100-contributions-libraries-strategy-deep-dive-sessions-completed/",
    "title": "5 months of engagement with over 100 contributions - libraries strategy deep dive sessions completed",
    "authors": [
        "Nicole Agyekum, Libraries Team , DCMS"
    ],
    "categories": [
        "How we work",
        "Research"
    ],
    "pub_date": "2023-06-30T11:46:25+01:00",
    "content": [
        {
            "text": "Since her appointment in September 2022, Baroness Sanderson has been engaging with the libraries sector to support the development of a new government public libraries strategy. She has visited library services and spoken to a wide variety of individuals and organisations. She also held 9 in-depth themed discussion sessions over 5 months, where she heard about successes of the sector as well as the challenges it is facing, and was given some ideas for things that she might recommend that a future strategy looks at. The last one of these was held in June. We tried to get as many different voices as possible to these, from within the sector and beyond - in total there were 101 individuals involved. We are grateful to all the library services across the country who hosted these sessions, as well as to the LGA where we held our final session on blue skies."
        },
        {
            "text": "Reflections on the deep dive sessions"
        },
        {
            "text": "Baroness Sanderson and the DCMS team have been really pleased with, and grateful for, the enthusiasm and commitment of all attendees and contributors to the process. A big thank you to those from within and outside the libraries sector for their readiness to contribute to an open and frank conversation. "
        },
        {
            "text": "The deep dive sessions have been wide ranging and thought provoking. Over the nine sessions we have  seen some clear themes emerge such as the importance of robust data that will support advocacy with government and other public services, and the challenge of raising awareness of the range of things libraries do (to decision makers as well as the public) to encourage more people to use their services. "
        },
        {
            "text": "Having taken some time to reflect on the deep dive sessions along with all the things she learned from her wider visits and meetings, Baroness Sanderson has now begun to write her report which will bring alive the thoughts and ideas she has heard from all her conversations and visits. "
        },
        {
            "text": "Lord Parkinson, the Libraries Minister, expects to receive Baroness Sanderson’s report in the summer which he will then consider and respond to. The DCMS Libraries team will then start drafting the new Government strategy for public libraries. Once a strategy document is drafted then we will then undertake further consultation with the sector from autumn onwards, prior to publication in early 2024."
        },
        {
            "text": "A big thank you!"
        },
        {
            "text": "We want to say a massive thank you to everyone who has contributed to Baroness Sanderson’s report through hosting visits, participating in the deep dive sessions, individual meetings and emailing or writing in with ideas. We look forward to continuing to develop the libraries strategy with the sector and beyond during the next phase of engagement. "
        }
    ]
}