{
    "url": "https://naturalengland.blog.gov.uk/2023/06/30/blueprints-for-natures-recovery-all-systems-go/",
    "title": "Blueprints for nature’s recovery: all systems go! ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environment Act",
        "Landscapes",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2023-06-30T12:37:44+01:00",
    "content": [
        {
            "text": "Last December in Montreal world leaders agreed to a new Global Biodiversity Framework, signing up to halt and reverse biodiversity loss by 2030 and to protect 30% of land and oceans by the same date. A month later the UK government published its Environmental Improvement Plan, to deliver the Government’s target of restoring nature and improve environmental health. Ambitious targets are welcome, they can focus minds and drive action. But they can feel distant and overwhelming.   "
        },
        {
            "text": "That’s what makes this week’s announcement naming the responsible authorities responsible for the development of Local Nature Recovery Strategies (LNRS) supported by £14 million of funding so significant.   "
        },
        {
            "text": "LNRS are a tool that bring together local decision makers with communities, businesses, public bodies, farmers, and landowners and decide together how to tackle the climate and nature crises. The power to agree priorities and coordinate action is placed in local hands and allows the lining up of public and private funding to have most impact. The priorities that LNRS set out won’t just influence future nature projects, they’ll also help bring nature into other local decisions like where to build, or how to manage public open space. Each of the 48 LNRS areas can play a part in creating new wildlife sites, restoring river systems and peatlands, extending forests, and maintaining grasslands. People can be better connected to nature, and communities better adapted to a changing climate.   "
        },
        {
            "text": "Natural England is leading Defra groups’ support for LNRS preparation, with senior advisors working in each of the 48 LNRS areas. Working with colleagues in the Forestry Commission, Environment Agency, and Defra, we’re here to offer the technical expertise and scientific advice to underpin the strategies and help make each LNRS as good as it can be.   "
        },
        {
            "text": "LNRS underpins national ambitions for improving the country’s Nature Recovery Network. We are working with partners to use all the tools at our disposal, including Biodiversity Net Gain, Green Infrastructure standards and the Landscape Recovery Scheme; alongside grant schemes like the £18 million Species Recovery Programme, and the £640 million Nature for Climate Fund, to restore nature across the country. LNRSs will be the way to bring these levers together. "
        },
        {
            "text": "Nature’s decline is well documented, and there are increasing signs of the acceleration of climate change, and real impacts on people’s lives. The BBC’s Wild Isles series reminded us of the spectacular beauty and richness of nature here in England, and the power of nature to inspire people. Two highlights for me were the scenes of acrobatic hobbies chasing dragonflies; and male Purple Emperors tumbling in a dramatic mid-air dogfight to secure supremacy.   "
        },
        {
            "text": "Both were filmed in places where nature has staged a remarkable recovery. Thirty years ago, Shapwick Heath in Somerset, was a landscape almost devoid of nature.  Now it is a National Nature Reserve and a landscape scale Nature Recovery Project, where large numbers of hobbies visit every year to replenish their energy after thousands of miles of flight. Shapwick Heath is now the heart of a wider nature recovery effort across Somerset. The Purple Emperors were filmed on the Knepp Estate in Sussex, which is at the centre of a growing rewilding movement that is inspiring landowners to think differently about their stewardship of the land.  "
        },
        {
            "text": "If we provide the conditions for nature’s recovery, creating more wildlife -rich places that are bigger, better, and connected, these ambitious targets and the delivery of a fully functioning national Nature Recovery Network are not out of reach. Local decision making about where to find that space, and where it will make the most difference to people’s lives is an essential part of this.  "
        },
        {
            "text": "Together the 48 strategies will cover the whole of England and provide the blueprint for the creation of a thriving Nature Recovery Network across the country and in so doing support our livelihoods, our local economies and bring the spectacular scenes from Wild Isles into people’s lives in parishes and villages, towns and cities across the country.  "
        },
        {
            "text": "For more information on LNRS, visit https://www.gov.uk/government/publications/local-nature-recovery-strategies"
        },
        {
            "text": "To view the Responsible Authorities delivering LNRS, click here:"
        },
        {
            "text": "Local nature recovery strategies: areas and responsible authorities - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 4,
            "text": "Matthew Heard, Strategy Director  "
        },
        {
            "heading": 5,
            "text": "Natural England"
        }
    ]
}