{
    "url": "https://healthmedia.blog.gov.uk/2023/06/30/nhs-long-term-workforce-plan-fact-sheet/",
    "title": "NHS Long Term Workforce Plan fact sheet",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-06-30T11:14:23+01:00",
    "content": [
        {
            "text": "The first ever NHS Long Term Workforce Plan was commissioned by the government to set out a series of interventions train, retain and reform the workforce, and put the NHS on a sustainable footing into the future."
        },
        {
            "text": "Backed by more than £2.4 billion in government investment ahead of the health service’s 75th anniversary, it sets out how the NHS will address existing vacancies and meet the challenges of a growing and aging population by recruiting and retaining hundreds of thousands more staff over the next 15 years and reforming the way we work."
        },
        {
            "text": "NHS England's press release can be found here and this fact sheet sets out more detail on the measures contained in the plan."
        },
        {
            "heading": 2,
            "text": "Health and Social Care Secretary Steve Barclay said:"
        },
        {
            "text": "“The NHS is the biggest employer in the country and holds the affection of the British people because of the staff who work around the clock to care for us. The NHS Long Term Workforce Plan, backed by significant government investment, shows our determination to support and grow the workforce."
        },
        {
            "text": "“It sets out how we will deliver the biggest expansion of staff training in NHS history, retain more talented people and harness cutting-edge technology."
        },
        {
            "text": "“As we celebrate the NHS’s 75th birthday, we are marking the occasion with an unprecedented plan that will further boost our drive to cut waiting lists and ensure the service can continue caring for us for generations to come.”"
        },
        {
            "heading": 2,
            "text": "What are the aims of the plan? "
        },
        {
            "text": "The NHS will:"
        },
        {
            "heading": 2,
            "text": "Is the government funding the plan?"
        },
        {
            "heading": 2,
            "text": "How will you improve the way you train the workforce? "
        },
        {
            "heading": 2,
            "text": "How will you improve the retention of the workforce? "
        },
        {
            "heading": 2,
            "text": "How will you reform the way staff work and are trained to improve efficiency?  "
        },
        {
            "heading": 2,
            "text": "How many more doctors and nurses will there be? "
        },
        {
            "heading": 2,
            "text": " How many more enhanced, advanced and associate roles will there be? "
        },
        {
            "heading": 2,
            "text": "What is the difference between these roles and nurses and doctors?"
        },
        {
            "heading": 2,
            "text": "How often will the plan be reviewed?"
        },
        {
            "heading": 2,
            "text": "Why does the plan include ranges for numbers of staff that will be delivered? "
        },
        {
            "heading": 2,
            "text": "How will AI help improve the efficiency of the NHS? "
        },
        {
            "heading": 2,
            "text": "How are we guaranteeing patient safety when training students and apprentices? "
        },
        {
            "heading": 2,
            "text": "What are you doing to grow the workforce in the shorter term?"
        },
        {
            "heading": 2,
            "text": "What are you doing to boost the social care workforce?"
        }
    ]
}