{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/06/30/secondment-opportunities-for-competition-economists-at-the-cma-2/",
    "title": "Secondment opportunities for competition economists at the CMA",
    "authors": [
        "Julie Bon"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2023-06-30T12:06:14+01:00",
    "content": [
        {
            "text": "Following the success of the first two editions of the CMA Economist Secondment Programme, we are now launching a new round of secondment opportunities for competition economists. If you are a competition economist and want to find out more about the CMA, we want to hear from you!"
        },
        {
            "text": "Since its launch in March 2021, ten secondees from a number of firms have already taken part in the programme and found the experience extremely valuable. We are now accepting applications for the next round, with deadline on Friday 28 July 2023 and you can find out more below."
        },
        {
            "text": "Taking part in a secondment at the CMA is an unparalleled experience that will add value to private-sector economists’ portfolio of skills. We believe the CMA experience will offer you and your consulting firm a number of benefits, including:"
        },
        {
            "text": "As a secondee, you will form an integral part of our multi-disciplinary teams just as CMA economists. You will gain hands-on experience in CMA casework which can be mergers, markets, antitrust investigations, subsidy advice, as well as the digital markets unit, depending on need and your preference."
        },
        {
            "heading": 2,
            "text": "Application details:"
        },
        {
            "text": "We are particularly keen to hear from economists with at least three years of competition consulting experience and a master’s degree in economics. Our secondments last for 6 months with usually two intakes annually on a rolling basis. There is flexibility around arranging a start date which would be suitable for both the CMA and the firm."
        },
        {
            "text": "If you are interested, we encourage you to discuss with your employer in the first instance. The CMA will contribute a flat rate to the cost of secondees, with further details available on request. Applicants must be based and eligible to work in the UK."
        },
        {
            "text": "Firms that would like to put candidates forward should email a full CV and a cover letter for each candidate describing their relevant experience and when they could start, by Friday 28 July 2023 to Eugenia Brandimarte (eugenia.Brandimarte@cma.gov.uk) and Lameesa Nelson (lameesa.nelson@cma.gov.uk) and also copy the following email address: ocea@cma.gov.uk. We will invite short-listed candidates for a brief interview to discuss their experience on competition economics projects in greater detail shortly afterwards."
        },
        {
            "text": "Appointed candidates will be inducted into a team of over 100 economists and will have a designated point of contact and receive an induction to provide the tools to support them during the programme."
        },
        {
            "text": "If you would like to discuss or understand more about these opportunities, please contact Eugenia Brandimarte or Lameesa Nelson."
        },
        {
            "heading": 2,
            "text": "Contact details for secondment programme queries:"
        },
        {
            "text": "Eugenia Brandimarte"
        },
        {
            "text": "Economics Adviser, eugenia.Brandimarte@cma.gov.uk"
        },
        {
            "text": "Lameesa Nelson"
        },
        {
            "text": "Personal Assistant to the Office of the Chief Economic Adviser, lameesa.nelson@cma.gov.uk"
        }
    ]
}