{
    "url": "https://environmentagency.blog.gov.uk/2023/06/30/why-we-watch-the-tides/",
    "title": "Why we watch the tides",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-30T10:05:14+00:00",
    "content": [
        {
            "text": "Many parts of the UK are at risk from coastal flooding, either flooding from tidal conditions, or from wave and spray overtopping. This risk is forecast to rise in the future, due to climate change and sea level rise."
        },
        {
            "text": "The Environment Agency is responsible for managing the risk of flooding from main rivers, reservoirs, estuaries and the sea. We and our partners continue to look at ways to mitigate this flood risk, creating a better place for people and the environment. Over the years we have constructed flood alleviation schemes across the country that reduce the risk of flooding to communities that are vulnerable to flooding from the sea."
        },
        {
            "text": "In most cases these schemes are engineered hard defences such as concrete sea walls, wave return walls, stone gabions and rock armoured defences, shingle beaches, tidal embankments and flood gates that can be closed during high tides and high waters."
        },
        {
            "text": "Some of these schemes have structures that are required to be operated prior to a significant high tide or wave overtopping event. The most common structures are flood or tide gates. Some schemes also feature pumping stations which reduce the risk of flooding from the surface water which can build up behind the flood alleviation scheme."
        },
        {
            "text": "When there is no forecast risk of flooding, flood or tide gates are usually locked open. This allows pedestrian or vehicular access through the structure. For example, a gate in the wall of a flood embankment. When a high tide or a wave overtopping event is forecast to reach a level where we need to close the gates to ensure that flood water does not outflank the defences, our field team operatives close these gates as part of their duties when carrying out a tide watch."
        },
        {
            "text": "During a tide watch, our staff will close gates and monitor other parts of the flood alleviation scheme during the period of high water, making sure that the scheme is operating as it should."
        },
        {
            "text": "Our staff usually arrive 2 hours before the forecast high water and remain on site until the high water has receded to an acceptable level."
        },
        {
            "text": "In some situations, gates will be left closed in between high tides. Once the risk of flooding has passed our staff will reopen gates, if safe to do so, and check other parts of the scheme for damage."
        },
        {
            "text": "The Environment Agency only carries out tide watches where there is an Environment Agency flood alleviation scheme or asset that requires an operational response.\nAre you at risk of flooding? Check your long-term risk of flooding and sign up for free flood warnings"
        },
        {
            "text": "Check the long term flood risk for an area in England - GOV.UK (www.gov.uk) \nSign up for flood warnings - GOV.UK (www.gov.uk)"
        }
    ]
}