{
    "url": "https://moderncivilservice.blog.gov.uk/2024/04/18/birmingham-2022-commonwealth-games-delivering-the-highest-quality-global-events-with-big-local-impact/",
    "title": "Birmingham 2022 Commonwealth Games - delivering the highest quality global events with big local impact",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-04-18T10:39:58+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Guest blog by Sam Lister, Director General at DCMS"
        },
        {
            "text": "When thinking about the different kinds of jobs civil servants do, you might be surprised that these include organising a major international sporting event. An evaluation report published in April marked the completion of a cycle of delivering an incredibly complex and ambitious public project. Here is a peak behind the curtain and the huge amount of work that went into organising the Birmingham 2022 Commonwealth Games. "
        },
        {
            "text": "As with many major projects, accurately calculating the benefits of hosting and delivering a big event is a time-consuming business. For anyone watching the 12 days of the Commonwealth Games in Birmingham in the summer of 2022, you could see a vibrant community enjoying the spotlight that it created. From the streams of spectators and queues for merchandise to the new elite performance venues, and the nearly 5,000 athletes from 72 Commonwealth nations and territories coming together in a show of sporting thrills and diplomatic shared purpose. "
        },
        {
            "text": "It was also an important yardstick in how the Department for Digital, Culture, Media and Sport (DCMS) approaches project delivery excellence. The Games came in on time, without compromise of standards, and not only on, but under its £778 million budget — with the £70m underspend reinvested to communities in the West Midlands for future projects. This all ensured it could close with a comfortable ‘green’ Delivery Confidence Assessment (DCA) rating, achieved by 15% of government projects."
        },
        {
            "text": "So was it worth it? The final evaluation report for the Commonwealth Games 2022 was published this month and is a powerful tool for us to assess our impact on both the economy and society. It captures achievements and points to where the impacts will continue to be felt in future years, with the Games contributing:"
        },
        {
            "text": "The backdrop was not one you would choose as a platform for success. The programme had to be delivered in a condensed preparation period of 4.5 years (a consequence of Birmingham stepping in to host after the South African host city, Durban, withdrew with financial and delivery challenges). It then encountered the effects on the labour market post-Brexit; the Covid-19 pandemic, which impacted construction, costs, and workforce; significant global supply chain disruptions; the long-standing budgetary stresses within the city itself; and the wettest winter in the West Midlands for a century (just as the groundworks started on infrastructure projects). And yet despite all of this, the evaluation of the Games shows that the benefits of major event delivery can still stack up.  "
        },
        {
            "text": "The Games budget also helped to unlock a further £85 million in additional funding, to support wider legacy activity, from a range of public and third sector bodies. Over 1.5 million tickets were sold, and 6.9 million people engaged with the Games as athletes, workforce, artists, volunteers, spectators or through community or schools engagement. The reach was further extended to the wider UK and globally, with 834.9 million TV viewers; 215 million digital views and 141 million interactions on social media."
        },
        {
            "text": "As with the most impactful major events, the Games lit the touchpaper for change in many ways, from engaging volunteers, building world-class new elite and community sporting facilities, creating jobs, driving participation in sporting activity, or drawing visitors and investors to the region. "
        },
        {
            "text": "The evaluation has captured the qualitative as well as quantitative, too. Anecdotal feedback tells of volunteers making lasting friendships and gaining new jobs from the skills they learned. The majority of stakeholders reported a substantive impact on residents’ civic pride — that the region could struggle with a sense of identity, and that the Games had shifted this feeling sharply. One reported that the mechanical Bull, which appeared in the Opening Ceremony and now has a permanent home in the midst of Birmingham New Street station, “now marks the place”. “[It] is the icon of the Games, and a reminder of how great it was... This generates civic pride, and it will continue having an impact”. "
        },
        {
            "text": "A vote for what to name the Bull could only ever have one outcome: Ozzy, after Birmingham’s prodigal heavy metal son, who returned to the UK to play a one-off set at the closing ceremony (spurred by watching the opening ceremony on television in Los Angeles)."
        },
        {
            "text": "In terms of wider lessons from the experience, the unique challenges thrown our way meant we had to be:"
        },
        {
            "text": "From the initial Games budget, £70 million of underspend is now being reinvested in the West Midlands to help build on the positive legacy already being felt in the region. Another important legacy is for the DCMS team and the skills and confidence we developed managing major projects whatever the challenges. Many members of the team were redeployed rapidly to support Operation London Bridge, and then took on roles in the team assembled to lead the Coronation, as well as supporting the international AI Summit. "
        },
        {
            "text": "Invest in the skills, build the experience and it shows that time and again the Civil Service, and the wider UK talent pool, can deliver the highest quality global events, whatever the challenges that emerge. "
        }
    ]
}