{
    "url": "https://defradigital.blog.gov.uk/2024/04/18/predicting-emerging-technologies-how-did-we-do-in-2023/",
    "title": "Predicting emerging technologies – how did we do in 2023?",
    "authors": [
        "Jan Murdoch"
    ],
    "categories": [
        "Defra technology",
        "Digital transformation",
        "Robotics automation",
        "Software tools"
    ],
    "pub_date": "2024-04-18T07:00:04+01:00",
    "content": [
        {
            "text": "Jan Murdoch reflects on what the Defra Technology Innovation team got right with their 2023 Emerging Technology radar report, and the lessons they can take as they think about the next iteration."
        },
        {
            "text": "Every year our Technology Innovation team produces an ‘Emerging Technology’ radar. We do this in partnership with a broad range of internal and external stakeholders to gather a wide range of opinions."
        },
        {
            "text": "The purpose of us producing our annual radar is to help us visualise what we think about which emerging technologies are most likely to be of most use to the Defra group - with a focus on the specific business challenges and opportunities we have identified from our horizon scanning."
        },
        {
            "text": "Leveraging our forecasts, we execute Proof of Concepts throughout the year, collaborating with business areas right across the Defra group of organisations. This approach allows us and business colleagues to conduct experiments aimed at addressing real business issues."
        },
        {
            "text": "It also enables us to evaluate the technology and make informed decisions as to whether investment is going to enhance the way in which Defra group delivers its services to end users."
        },
        {
            "heading": 2,
            "text": "AI rules the roost, or does it?"
        },
        {
            "text": "So how did we do last time? We called the 2023 report “The Age of AI”, which tells you a lot about what we were thinking about at that time. Many technologies on the radar were linked to AI, including Advanced Computer Vision and Explainable AI and Generative Artificial Intelligence (GenAI)."
        },
        {
            "text": "We explored GenAI technology initially as a tool to create new and interesting imagery. We utilised the Midjourney tool to create all the imagery in our 2023 emerging technology radar report."
        },
        {
            "text": "However, GenAI applications, exemplified by ChatGPT and BART, surpassed global expectations in 2023, marking a significant surge in adoption and investigation by government organisations for an entire range of use cases to allow humans to focus on design and specification instead of low-level administrative tasks."
        },
        {
            "text": "Unsurprisingly, Generative AI has been the focus of much of our work this year. The team has rapidly explored many different uses for the technology, including:"
        },
        {
            "text": "Our early work on Generative AI has also allowed us to share our learnings with wider government and support other government departments in their adoption of AI tooling."
        },
        {
            "heading": 2,
            "text": "Not the only show in town though"
        },
        {
            "text": "Aside from AI, we predicted virtual reality (VR) had some way to go before being adopted more generally, with headset sizes being one of the issues."
        },
        {
            "text": "We said that Augmented Reality would lead the way for immersive experiences, and we were right. A Google Vision VR headset has recently been launched, with AR a key element of the product."
        },
        {
            "text": "This is also the case for the Meta Quest 3 headsets. We see this “pass through” feature becoming more advanced in the years to come, with better cameras allowing the wearer to be in their “real” environment with complementary digital information overlaid."
        },
        {
            "text": "We’ve now begun the process of building the new 2024 radar for Defra group, picking those technologies that will have most benefit to our organisation. We’re a large and diverse organisation with many challenges and opportunities."
        },
        {
            "text": "So do keep checking back here to see what we have to say about what technologies we believe will have the most impact in the months ahead."
        },
        {
            "text": " "
        }
    ]
}