{
    "url": "https://defraenvironment.blog.gov.uk/2024/04/18/taking-action-for-our-ocean-reflections-from-the-un-ocean-decade-conference/",
    "title": "Taking action for our ocean: reflections from the UN Ocean Decade Conference",
    "authors": [
        "Gideon Henderson",
        "Frances Bird"
    ],
    "categories": [
        "Marine"
    ],
    "pub_date": "2024-04-18T09:26:28+01:00",
    "content": [
        {
            "text": "We are fundamentally dependant on oceans.  "
        },
        {
            "text": "They provide food, energy, and the oxygen we breath. They control our weather and, through their uptake of carbon and heat, our long-term climate. They support our transport and recreation, and they inspire us and our cultures around the world.  "
        },
        {
            "text": "We still have much to learn about the incredible biodiversity the oceans contain, but we do know that human activities alter and damage ocean systems. We must learn to better care for the ocean, while sustainably using the services they provide. "
        },
        {
            "text": "This is the objective of the UN Decade of Ocean Science for Sustainable Development or the ‘UN Ocean Decade’: to provide ‘the science we need for the ocean we want’ and provoke global action to better understand and protect the ocean. "
        },
        {
            "text": "The UN Ocean Decade is a commitment of the UN General Assembly and runs from 2021-2030. Last week, the Decade held its first in-person conference, taking stock of progress of the early years and framing its vision for 2030. We were at the conference representing Defra at several events, including Gideon speaking at one of the opening sessions (pictured below), an event with the International Hydrographic Organisation on seabed mapping, and supporting our work with the All-Atlantic Research and Innovation Alliance. "
        },
        {
            "text": "Background on the UN Ocean Decade "
        },
        {
            "text": "The aim of the UN Ocean Decade is to bring together and inspire national and global efforts to raise awareness, promote scientific research, and put into practice sustainable solutions to protect and preserve our oceans for generations to come. It is focused on ten challenges, including beating pollution, sustainably feeding the world, and growing a fair ocean economy.  "
        },
        {
            "text": "The UK ocean community has been closely engaged with the UN Ocean Decade. Contributions from across the UK’s range of excellent ocean research organisations include leadership of global programmes such as the Global Ocean Decade Programme for Blue Carbon, Ocean Acidification Research for Sustainability, and Nutrient Pollution – Global Action Network. Defra has also helped set up a UK National Decade Committee, with ocean experts bring diverse expertise to inspire and promote Decade action nationally, and to coordinate the UK’s research community.  "
        },
        {
            "text": "UN Ocean Decade Conference in Barcelona "
        },
        {
            "text": "UNESCO’s Intergovernmental Oceanographic Commission, which is in charge of coordinating  the UN Ocean Decade, brought together the ocean community for the UN Ocean Decade Conference in Barcelona, to take stock of progress, set a vision for the rest of the Decade, and spark new partnerships and collaborations. It was a gathering of scientists, governments, NGOs, philanthropists and plenty more, and there was an impressive programme showing off innovative and creative approaches from fundamental science, to technology, and to the arts. "
        },
        {
            "text": "Conference highlights "
        },
        {
            "text": "It's hard to pick out the best parts from such a packed schedule, but some of our standout highlights include: "
        },
        {
            "text": "There were also lots of opportunities for bilateral meetings with partner countries and organisations, as well as lots of great science and innovation to learn about and for the UK to share. "
        },
        {
            "text": "What happens next "
        },
        {
            "text": "The UN Ocean Decade has brought together the work and knowledge of scientists, governments, philanthropy and industry. An important theme of the conference was to go further and make the UN Ocean Decade greater than the sum of these parts. This ‘Vision 2030’ process was a key subject running through the conference and will shape future work. It will continue to be up to individual countries, however, to deliver on the agreed vision and to turn international learning into tangible recommendations that fit their own scientific, policy, and funding goals. "
        },
        {
            "text": "The science of the UN Ocean Decade will provide the evidence base for important ocean and climate policy activities of the coming year, including those supporting new international goals for biodiversity (for example in the Kunming-Montreal Global Biodiversity Framework and the Biodiversity Beyond National Jurisdiction Agreement), supporting UN negotiations to end plastic pollution, and supporting official UNFCCC statements that aim to strengthen ocean-climate action.  "
        },
        {
            "text": "You can get involved "
        },
        {
            "text": "Whether you’re a scientist, activist, or just someone who loves the ocean, there are plenty of ways to make a difference.  "
        },
        {
            "text": "For more information on getting involved with the UN Ocean Decade, visit the UK National Decade Committee website or follow them on Linkedin, to hear more about opportunities including responding to the next Decade ‘Call for Action’ endorsement opportunities which has just launched and will be open until 31st August.  "
        },
        {
            "text": "You can also catch up on the main conference panel events and read a summary of the discussions and announcements made at the conference in the Barcelona 2024 statement. "
        }
    ]
}