{
    "url": "https://educationhub.blog.gov.uk/2025/03/breaking-down-the-digital-divide-in-schools-what-you-need-to-know/",
    "title": "Breaking down the digital divide in schools: What you need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools",
        "School spending",
        "Schools",
        "Secondary schools",
        "SEND"
    ],
    "pub_date": "2025-03-21T13:03:23+00:00",
    "content": [
        {
            "text": "We've just committed £45 million to improve digital connectivity in schools to close the digital divide over the next year. We want to make sure that through this investment, no child is left behind and that we’re supporting teachers to benefit from the advances technology is making in education. But what does this actually mean for teachers and students? "
        },
        {
            "text": "We have announced two key initiatives: a £45 million investment to improve internet connectivity in schools. This includes £25 million for wireless networks and £20 million for fibre upgrades. Alongside this, we have launched a consultation on our long-term vision for narrowing the digital divide focusing on proposals for the future of the digital and technology standards for schools and colleges. "
        },
        {
            "heading": 3,
            "text": "Why does closing the digital divide matter? "
        },
        {
            "text": "Reliable technology is key for making sure children can achieve and thrive at school, and we want to make sure that all students benefit from the opportunities of new technologies. Our aim is that every school should have the right infrastructure to allow them to make the most of modern digital technology. "
        },
        {
            "text": "Research shows that when used effectively, technology can accelerate learning by two to five months. But the reality is that many schools still lack the basics like reliable internet or good cyber security."
        },
        {
            "heading": 3,
            "text": "Which schools will benefit? "
        },
        {
            "text": "So far, 1.3 million pupils across 3,700 schools have benefitted from funding to boost connectivity in their classrooms.  "
        },
        {
            "text": "We are supporting a further 1000 schools who will benefit from the new investment of £45 million. These schools have been selected based on need and in areas where digital infrastructure is currently lacking.  "
        },
        {
            "heading": 3,
            "text": "What are the six digital standards schools need to meet by 2030? "
        },
        {
            "text": "The government is setting a long-term ambition for all schools and colleges to meet six core standards by 2030. These include broadband internet, wireless networks, network switches, digital leadership, filtering and monitoring, and cyber security."
        },
        {
            "heading": 3,
            "text": "What if my school is struggling with digital infrastructure now? "
        },
        {
            "text": "While the 2030 target seems far away, there's help available now. You can use the government's Plan Technology For Your School tool to assess your current tech infrastructure.  "
        },
        {
            "text": "This new digital service helps schools make smarter technology choices, saving time and money when planning and making changes. It supports schools in meeting the Department for Education’s (DfE) digital and technology standards - leading to safer, more cost-effective practices and better decision-making. "
        },
        {
            "text": "The service allows schools to: "
        },
        {
            "heading": 3,
            "text": "How can this help students with SEND? "
        },
        {
            "text": "For students with additional needs, reliable technology can make a significant difference for learning. A strong and secure Wi-Fi connection allows the use of portable devices in classrooms, including those that support students with SEND."
        },
        {
            "text": "Assistive technology (AT), like dictation tools and screen readers, helps remove barriers to learning, giving every child the opportunity to thrive at school. "
        },
        {
            "text": "For example, New Bridge Multi Academy Trust in Oldham has used connectivity funding to create custom 3D-printed assistive devices, develop personalised digital learning tools, and give non-verbal students consistent access to communication technology.  "
        },
        {
            "heading": 3,
            "text": "How can I contribute to the consultation? "
        },
        {
            "text": "The government wants to hear from educators and those supporting the education sector. The consultation is open for eight weeks and specifically asks about your school's readiness to meet the six standards, what additional support you might need, and your experiences with digital technology in teaching. "
        },
        {
            "text": "This is your chance to shape how these standards are implemented. You don't need to be an IT expert to contribute – your classroom perspective is valuable. "
        }
    ]
}