{
    "url": "https://insidehmcts.blog.gov.uk/2025/03/21/building-the-future-of-criminal-justice-our-vision-for-2025-and-beyond-part-2/",
    "title": "Building the Future of Criminal Justice: Our Vision for 2025 and Beyond (Part 2)",
    "authors": [
        "Daniel Flury, Operations Director"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services",
        "General",
        "User experience and research"
    ],
    "pub_date": "2025-03-21T12:15:00+00:00",
    "content": [
        {
            "text": "Following my previous blog on the current state of our criminal courts, I want to share our vision for the future and the steps we're taking to build a more efficient and effective justice system. "
        },
        {
            "heading": 2,
            "text": "2025: a year to build on firm foundations "
        },
        {
            "text": "A significant milestone approaches at the end of the month as the HMCTS Reform Programme concludes. But this marks the beginning of a new phase rather than an endpoint. Drawing on everything we've learned, we're assembling a team of project management and business change experts from across HMCTS and beyond. With their expertise we'll focus on carefully managed, incremental improvements that will allow us to better deliver changes and make the justice system work better for everyone. "
        },
        {
            "text": "For example, we'll improve how the Common Platform criminal case management system connects with the Police National Computer, enabling faster updates and reducing the time spent managing case information. We'll also expand the system to handle more types of cases, including probation breaches and all non-police prosecutors, increasing the capabilities of the system and streamlining more processes. The link between the Crown Court's Digital Case System and Common Platform will be strengthened, further improving the movement of materials between magistrates' and the Crown Court. I'm confident that these changes will help build a more efficient service that works better for everyone who uses it. "
        },
        {
            "text": "Close working between staff in courts and our Service Centres continues to strengthen the service we provide in magistrates' courts. In 2024, Service Centres handled over three-quarters of a million phone calls and emails relating to criminal cases. Last year we migrated all calls from magistrates’ courts in the North West and South West regions to our Service Centres. We’ll be extending these improvements to the remaining 5 regions in the first half of 2025, reducing pressure on court staff and improving services for our court users.   "
        },
        {
            "text": "We're also investing in our greatest asset – our people. We've recently acted on legal advisor pay, doubling their allowance, and launched a successful recruitment campaign to bring 150 new legal advisors into the system. This will allow us to run more sessions and courts in the coming year and beyond. "
        },
        {
            "text": "We'll build on what we've achieved in the Reform Programme, ensuring these changes deliver their full potential while avoiding disruption to vital services. This approach means we can continue modernising our criminal court services while maintaining stability - learning from experience to make each improvement count."
        },
        {
            "heading": 2,
            "text": "Technology and innovation "
        },
        {
            "text": "Common Platform continues to evolve, making daily operation smoother and more efficient, delivering real benefits across the justice system. Every case now has a single unique reference number that can be used by all parties - from police to CPS to courts - making it much simpler to track a case. When cases conclude, police forces receive instant notifications of Crown Court results, enabling faster updates to the Police National Computer. Non-Crown Prosecution Service (CPS) prosecutors are now able to view and upload case materials directly on a case-by-case basis, as well as check in to hearings, streamlining the process further for another of our partners. "
        },
        {
            "text": "For lesser criminal offences prosecuted under the Single Justice Procedure (SJP), digital improvements mean cases can be processed through Common Platform as soon as the plea has been received – a significant improvement from the previous system where cases could not be dealt with until 28 days had passed. We’ve now introduced this to all police forces to prosecute SJP cases in this way. It is enabling them – and a range of other non-police prosecutors – to deliver functions more swiftly and accurately. "
        },
        {
            "text": "Elsewhere, our Digital Audio Visual Equipment programme continues to transform our courtrooms by updating or replacing outdated trial technology like screens and microphones. The latest phase has already successfully upgraded 57 courtrooms. Looking ahead, our next phase will focus on modernising 65 Crown Court rooms and 15 magistrates' court rooms currently operating with end-of-life equipment, ensuring our justice system has the technology it needs to operate effectively. "
        },
        {
            "heading": 2,
            "text": "Supporting vulnerable witnesses "
        },
        {
            "text": "We now have 39 ‘remote link sites’ nationally where witnesses can give evidence away from court, and we're expanding our capability for pre-recorded cross-examination. This technology is helping almost 2,000 vulnerable witnesses each year give their best evidence while feeling safe and supported. "
        },
        {
            "text": "We're particularly proud of our ability to facilitate evidence-giving from bespoke locations, including homes and care facilities, for those who might struggle to attend court. "
        },
        {
            "heading": 2,
            "text": "Collaborative working "
        },
        {
            "text": "Through the Criminal Justice Board, chaired by the Lord Chancellor, senior leaders from across the system including ministers, Police and Crime Commissioners, the Criminal Bar Association, legal professionals and the judiciary, are coming together to create a shared vision and coordinated approach. "
        },
        {
            "text": "Additionally, following its earlier successes, the Senior Presiding Judge will expand the Crown Court Improvement Group (CCIG) to include magistrates' courts, becoming the Criminal Courts Improvement Group, where all key criminal justice agencies will work together to improve efficiency and access to justice across the criminal courts. This cross-system collaboration proved particularly effective during recent challenges such as prison estate capacity and last summer's civil unrest, where our coordinated response enabled swift justice, demonstrating what we can achieve when working together. "
        },
        {
            "heading": 2,
            "text": "Our commitment "
        },
        {
            "text": "As we move into 2025, our mission remains clear: to support people in accessing justice when they need it as a service-led organisation. "
        },
        {
            "text": "While there's no quick fix to current pressures, these coordinated efforts and ongoing improvements give us a clear path forward. The justice system faces unprecedented challenges, but through innovation, collaboration, and dedication, we're building a stronger, more efficient criminal courts system for the people who need it. "
        }
    ]
}