{
    "url": "https://ssac.blog.gov.uk/2025/03/21/reforming-benefits-and-support-echoes-of-our-earlier-advice/",
    "title": "Reforming Benefits and Support: echoes of our earlier advice",
    "authors": [
        "Dr Stephen Brien"
    ],
    "categories": [
        "Disabled People",
        "DWP",
        "Independent advice",
        "social security",
        "SSAC Occasional Papers"
    ],
    "pub_date": "2025-03-21T14:14:18+00:00",
    "content": [
        {
            "text": "It is not uncommon that the Social Security Advisory Committee's recommendations, while not wholly accepted at the time they are made, feature in some shape or form in policy announcements in the years that follow. The Secretary of State for Work and Pensions’ statement to Parliament launching the Pathways to Work: reforming benefits and support to get Britain working Green Paper contains clear echoes of our advice from some of our previous reports."
        },
        {
            "text": "How the Department for Work and Pensions (DWP) involves disabled people when developing or evaluating programmes that affect them"
        },
        {
            "text": "Our 2020 report emphasised the importance of engaging disabled people during the development, delivery and evaluation of policies and practices that directly impact them. We recommended that:"
        },
        {
            "text": "For some of the proposals outlined in the Green Paper, there is a clear commitment to establish ‘collaboration committees’ to further develop reforms. These will “bring together groups of people for specific work areas who will meet to collaborate with civil servants and provide discussion, challenge, and recommendations”. The groups will include both those with lived experience and other experts, with “a genuine ability to influence outcomes” and visibility of their impact. "
        },
        {
            "text": "Out of work disability benefit reform"
        },
        {
            "text": "In our 2022 report, we called on the then Government to de-risk the journey into work. We highlighted claimant concerns that taking up employment could mean:"
        },
        {
            "text": "Our recommendations included:"
        },
        {
            "text": "The Government now proposes to legislate for a ‘right to try’, “guaranteeing that work in and of itself will never lead to a benefit reassessment. Giving people the confidence to take the plunge and try work – without the fear this will put their benefits at risk”."
        },
        {
            "text": "The future of working age contributory benefits for those not in paid work"
        },
        {
            "text": "In 2022 we completed an extensive study into the two long-neglected contributory benefits for out-of-work working age individuals: New Style Jobseeker’s Allowance (JSA) and New Style Employment and Support Allowance (ESA). We offered fifteen recommendations as a starting point for future review.[1]"
        },
        {
            "text": "The Green Paper now confirms plans to consult “on establishing a new, simple and clear “Unemployment Insurance” benefit through the reform of contributory working-age benefits.”  This would provide greater income protection for those who have paid into the system, by replacing contribution-based JSA (and ESA) with “a new single entitlement, paid at the current ESA rate (currently £138pw)” that would be time-limited. It is good that these benefits are being considered as part of these reforms, and we hope that the Government will consider our recommendations as it consults on how best to take this issue forward. "
        },
        {
            "text": "While it is encouraging to see the Committee’s advice having some impact, we recognise that much of the detail will be crucial to the success of these reforms. The Committee will undertake a close examination of the detailed proposals over the coming weeks, and provide advice to the Secretary of State as we deem appropriate under our statutory remit."
        },
        {
            "text": "[1] Our earlier report Jobs and benefits: The Covid-19 challenge (2020), which was produced in partnership with the Institute for Government, also argued that \"Contributory JSA should be strengthened…the rate should not be below that provided by the standard allowance in Universal Credit”."
        }
    ]
}