{
    "url": "https://naturalengland.blog.gov.uk/2025/03/21/shapwick-heath-peat-restoration-bringing-bogs-back-to-somerset/",
    "title": "Shapwick Heath Peat Restoration – Bringing Bogs Back to Somerset",
    "authors": [
        "Louise Treneman"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Ecosystem Services",
        "Natural England",
        "Nature Recovery",
        "Peat",
        "Species recovery"
    ],
    "pub_date": "2025-03-21T09:59:16+00:00",
    "content": [
        {
            "text": "By Louise Treneman, Senior Reserve Manager"
        },
        {
            "text": "Peatlands habitats, such as raised bog, blanket bog and fen, in good condition, are home to a wide range of species and store the largest amount of carbon of all habitats in England. However, most of our peatlands are in poor condition. Emissions from England’s damaged peatlands are estimated to be around 11 million tonnes of carbon dioxide equivalent per year. "
        },
        {
            "text": "Lowland Somerset has a big role to play in this story, boasting the second largest area of lowland peat in England, after the East Anglian Fens. The area draws visitors in from far and wide, and the peatland nature reserves play a key role in connecting people to the natural world. As with many other peatlands, the Levels have a long history of drainage for peat extraction and agriculture, which has shaped the landscape we see today."
        },
        {
            "text": "Shapwick Heath sits right in the heart of the Somerset Levels and Moors landscape, forming part of the Somerset Wetlands National Nature Reserve (NNR). The site was bought by Natural England in the 1990s as part of a wider buy out from the peat extraction industry. Since then, the team through the years have worked to restore peat voids to reedbeds and open water features and restore remaining deep peat to enhance biodiversity on the site."
        },
        {
            "text": "The missing habitat"
        },
        {
            "text": "However, there is one habitat that is still notably absent from the Somerset Levels – raised bog. Prior to drainage, a huge expanse of bog would have stretched across the Brue Valley, with sphagnum moss carpeting the surface, cotton grass bobbing in the breeze and carnivorous plants lurking to catch unsuspecting insect life. Small remnants remain on Shapwick Heath and Westhay Moor but have been declining over the years due to continued impacts of drainage."
        },
        {
            "text": "I started working for Natural England 4 years ago, and shortly after took up the task of figuring out a way to mend our struggling remnant bogs. The team had tried many interventions over the years, yet the bogs were getting ever drier and important plant life was disappearing from the site. Luckily, answers came from northern England, where techniques had been developed to restore raised bogs."
        },
        {
            "text": "Mending the bog"
        },
        {
            "text": "Deep trench bunding was the key to mending our leaky raised bog habitat. This technique blocks up the sub-surface cracks that form as peat shrinks and degrades with drainage, re-establishing the stable water levels needed for the bog plants to thrive. As well as allowing this rare habitat to return, keeping peat soils wet prevents carbon from being released; fixing our peatlands is key for journeying towards a brighter future in this time of joint climate and ecological crisis."
        },
        {
            "text": "There was initially local hesitancy to using this technique, as it is visually quite disruptive in the initial stages, and it had never been seen in Somerset before. But after a field trip to Cumbria and pulling together multiple case studies to show people, everyone agreed that this was the way forwards. The adage ‘you’ve got to break eggs to make an omelette’ was touted more than once, and we took the leap and began clearing vegetation and installing bunds across roughly 30 hectares of Shapwick Heath."
        },
        {
            "text": "Journey to recovery"
        },
        {
            "text": "This winter we have completed the final phase of this three-year restoration project, run in partnership with Somerset Wildlife Trust and funded through the Nature for Climate Peatland Grant Scheme and Natural England Bequest Fund."
        },
        {
            "text": "Already we’ve seen plants returning that had been thought lost to the site, and water levels returning to the splashy conditions we would expect to see on a bog. As ever, given the conditions needed, nature takes over and starts putting things right. "
        },
        {
            "text": "White-beaked sedge, oblong leaved sundew (a carnivorous bog plant) and sphagnum mosses are all plants I had hoped would return, but I expected to be waiting a lot longer than two years to begin to see these bog loving species expand across the area we worked on in phase one of the project. Although there’s still a long way to go to bring back fully functioning raised bog to Somerset, we’ve made a cracking start and hope to see more projects like this popping up across the landscape in coming years!"
        },
        {
            "text": "Finally, if you want to learn more about the project and peat restoration in general, I’ve been working with a colleague, Edd Parrott, to put together a series of short films to share the story of this first-of-its-kind for the South West restoration project. You can find the mini-series on our Instagram page @naturalengland_wessex, and a longer video drawing together all the content from the mini-series on Natural England’s YouTube channel"
        },
        {
            "text": "Huge thanks to peatland restoration contractors, Open Space, who delivered the project over three years, and ecological consultants, Geckoella, who worked with us on protected species mitigation on the final (and most complicated) phase."
        }
    ]
}