{
    "url": "https://defrafarming.blog.gov.uk/2025/12/18/farming-profitability-review-recommendations-published/",
    "title": "Farming Profitability Review: recommendations published",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2025-12-18T10:15:36+00:00",
    "content": [
        {
            "text": "The Farming Profitability Review 2025, an independent review led by Baroness Minette Batters, has been published. "
        },
        {
            "text": "The six-month review examined farm profitability in England. It sets out 57 recommendations for government and industry to strengthen the resilience and viability of farm businesses. "
        },
        {
            "text": "The review highlights the sector's potential to play a central role in the renewal of the country's economy."
        },
        {
            "text": "Baroness Batters, a farmer and former president of the National Farmers Union (NFU), was appointed to lead the review in April 2025."
        },
        {
            "text": "Defra’s Profitability Unit worked alongside Baroness Batters to provide analysis and evidence to support the review. "
        },
        {
            "heading": 2,
            "text": "Stronger partnerships "
        },
        {
            "text": "In the Farming Profitability Review, Baroness Batters emphasises the importance of improving the use of data to boost productivity, simpler and smarter regulation, and more targeted support for innovation. "
        },
        {
            "text": "These priorities complement the government’s Plan for Change.  "
        },
        {
            "text": "Baroness Batters also makes clear the need for government to work in genuine partnership with farmers and the wider food industry.  "
        },
        {
            "text": "In response, government will strengthen the voice of farmers at the heart of government. "
        },
        {
            "text": "The Secretary of State, Emma Reynolds, has today announced the creation of a new Farming and Food Partnership Board, which she will oversee with Farming Minister, Dame Angela Eagle. "
        },
        {
            "text": "The objective of the board will be to strengthen food production at home and ensure policy delivers real change for farmers.  "
        },
        {
            "text": "The board will focus on opportunities across agriculture and the food chain, developing tailored growth plans for sectors including horticulture and poultry."
        },
        {
            "text": "It will bring together leaders from farming, food production, retail, finance and government to help inform decision-making, support investment and address the challenges facing the sector."
        },
        {
            "text": "As part of the government’s wider food strategy, it will complement the work of the Food Strategy Advisory Board (FSAB)."
        },
        {
            "heading": 2,
            "text": "Investing in the future "
        },
        {
            "text": "The Farming Profitability Review underscores the importance of giving farmers the confidence to invest and plan for the long term. "
        },
        {
            "text": "Farmers are both business owners and stewards of the land, and government has committed £11.8 billion to schemes that support productivity and sustainability. More than half of England’s farmland is currently in a scheme. "
        },
        {
            "text": "In response to the review’s findings, changes to planning rules, made in partnership with the Housing Secretary, Steve Reed, will place greater emphasis on food production. This will make it easier for farmers to develop infrastructure such as reservoirs, greenhouses, polytunnels and farm shops. "
        },
        {
            "text": "The Farming and Food Partnership Board will tackle barriers to private finance, bringing together farmers, agri-food businesses and major financial institutions to attract investment into farm transformation, productivity and nature. "
        },
        {
            "text": "Action on supply chain fairness is stepping up. The ‘Contractual practice in the UK combinable crops sector consultation’ launched earlier this month. It seeks views on how contracts operate and whether they are fair."
        },
        {
            "text": "This follows the Fair Dealing Obligations (Pigs) Regulations 2025 coming into force, meaning pig farmers now have better protection against unfair contract terms."
        },
        {
            "text": "Additionally, all milk purchase contracts must now meet the requirements of the Fair Dealing Obligations (Milk) Regulations 2024. "
        },
        {
            "text": "Changes to the oversight of the Groceries Code Adjudicator are being considered. "
        },
        {
            "text": "The review also recognises the role of fair access to markets to improve farm profitability. Agriculture has been protected in trade agreements, and more than £100 million in export deals has been supported this year through the work of the UK’s agriculture attachés. "
        },
        {
            "text": "Further trade missions will focus on supporting farmers to reach new markets. "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The actions summarised in this post represent the government’s initial response to the Farming Profitability Review. A 25-year Farming Roadmap will follow next year. It will set out the long-term direction for farming. "
        },
        {
            "text": "We’ll share updates as this work progresses. Subscribe to the Farming blog for a notification whenever we publish a new post."
        }
    ]
}