{
    "url": "https://ipo.blog.gov.uk/2025/12/18/from-christmas-trees-to-construction-materials-ornas-circular-innovation/",
    "title": "From Christmas trees to construction materials: ORNA and circular innovation",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Business",
        "Environment",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-12-18T11:00:04+00:00",
    "content": [
        {
            "text": "Every festive season, millions of real Christmas trees brighten UK homes - but where do they end up when the season is over? Entrepreneur Hugo Knox asked this question, and founded ORNA®, the start-up business transforming Christmas tree waste into sustainable construction materials with patent-pending technology using a circular process."
        },
        {
            "text": "We caught up with Hugo to explore more about his circular business model - and the role that IP has played in the process."
        },
        {
            "heading": 3,
            "text": "A Christmas tree side job with a purpose"
        },
        {
            "text": "The concept for the startup sprouted out of an existing business. Fresh out of university and between jobs, Hugo launched Tree Brothers® with a friend, delivering Christmas trees door-to-door in Camberwell Green, South London. But it was during those festive rounds that he noticed a troubling pattern."
        },
        {
            "text": "His research revealed a staggering problem. According to Government reports, over 7-8 million Christmas trees end up in landfill each year, emitting over 100,000 tonnes of greenhouse gases and costing local authorities £22 million annually in landfill taxes."
        },
        {
            "text": "This realisation led to the creation of ORNA® - which stands for Optimised Reused Natural Assets."
        },
        {
            "heading": 3,
            "text": "Transforming waste into resources"
        },
        {
            "text": "\"We are developing a process where we can turn Christmas waste into a circular construction material,” Hugo explained."
        },
        {
            "text": "The innovation works through a self-sustaining circular model involving three interconnected businesses. Tree Brothers® delivers Christmas trees during the festive season, CIRCA®, a waste management business launched earlier this year, collects Christmas trees and other waste year-round, then ORNA® processes this collected material into construction materials. Hugo explains how the business is still in the research and development stage, and the ORNA® team has already applied for a patent (GB2633822) for the process of reducing the carbon footprint using waste wood."
        },
        {
            "heading": 3,
            "text": "The team"
        },
        {
            "text": "ORNA® is far from a solo venture. “We have a young team of five workers. ORNA®’s talented technical Co-Founder, Caelo Dineen Vanstone has been taking our outputs from strength to strength. She spends most of her time at Peckham Levels in our studio, whilst CIRCA® and Tree Brothers® Co-Founder Josh Clark is on operations. He's a real doer and problem solver! Rory Langmuir is our Marketing Manager who captures great content across all our businesses. Finally, Dan Cooper is the new kid on the block this year for Tree Brothers®. He’s been doing a brilliant job delivering Christmas trees - top tier customer service always done with a big smile on his face!\" said Hugo. "
        },
        {
            "heading": 3,
            "text": "A fortuitous meeting and patent protection"
        },
        {
            "text": "ORNA®'s path to patent protection began with a humorous encounter while delivering Christmas wreaths. Hugo rang existing customer Matthew, who happened to be a patent attorney, to pitch his new wreath product. Referencing the use that wreaths have at funerals, Matthew quipped \"I'm not dead yet\", which made Hugo laugh so much he decided to give him a free wreath."
        },
        {
            "text": "But, when Hugo arrived at Matthew's house to deliver the freebie, his wife answered the door saying Matthew had suffered a terrible fall. Hugo felt awful, convinced he'd \"jinxed\" Matthew with the wreath joke. When Matthew later called to say he was fine, they laughed about the coincidence, and this chance encounter became the foundation of their relationship. Hugo mentioned Matthew has gone on to become a mentor who’s been not only a great source of knowledge and wisdom but also a great friend,"
        },
        {
            "text": "When Hugo later developed the idea for ORNA®, he pitched the idea to Matthew. Having retired but immediately seeing the potential, he connected Hugo with patent attorney Siân Gill, and they began working to protect ORNA®'s innovative technology. \"Siân at Venner Shipley has been a great help in explaining how to navigate the patent process and how to protect our innovation effectively\" said Hugo. "
        },
        {
            "text": "\n"
        },
        {
            "text": "\n"
        },
        {
            "heading": 3,
            "text": "Why patents matter for innovation"
        },
        {
            "text": "Despite the business still being developed and the patent pending at the time of writing, for Hugo and the ORNA® team, IP protection has already proven beneficial."
        },
        {
            "text": "But the benefits extend beyond investor confidence. Hugo explains that patent protection shows that you’re intentional and care about your idea. “Business is all about first impressions, and if you share that you are serious about your intentions and are thinking big, it's really well received.\""
        },
        {
            "heading": 3,
            "text": "Trade mark protection: covering all bases"
        },
        {
            "text": "Alongside patent protection, Hugo has been strategic about protecting the brand portfolio through trade marks. He has registered trade marks for ORNA®, Tree Brothers® and CIRCA®.  "
        },
        {
            "text": "His advice is practical: \"Whatever names you think of that might land well and be well received, check online and see whether the trade mark is actually available. Then go through the steps of protecting that and making sure you're covered if someone else wants to run with the idea or name.\""
        },
        {
            "text": "\n"
        },
        {
            "text": "\n"
        },
        {
            "heading": 3,
            "text": "Giving back: the ORNA® Project"
        },
        {
            "text": "True to the circular economy principles at the heart of their business, the ORNA® Project works with schools including Southwark College to inspire and support young people interested in sustainable innovation. This programme encourages young entrepreneurs to work in the green sector with a chance to receive mentorship from ORNA®. ORNA®'s scheme connects students with partners such as the Kings Trust and Southwark Pioneers Fund for mutual benefit. "
        },
        {
            "text": "\"We've received so much support ourselves that we want to provide help in the best way that we can,\" Hugo explains. \"Working with young people who still might not know the opportunities that lie within the green sector is really important.\"The message to students is clear: \"You can have a commercial venture, but you can also make a difference. One of the big motivators for me and my team is that what we’re doing is a good use of time and is needed. That's something we want to hit home to the young people who we’re working with.\""
        },
        {
            "heading": 3,
            "text": "Advice for aspiring innovators"
        },
        {
            "text": "For other businesses looking to protect their IP and navigate the sustainable innovation space, Hugo's advice is clear and practical:"
        },
        {
            "heading": 3,
            "text": "The power of partnerships"
        },
        {
            "text": "The business has grown from delivering Christmas trees door-to-door in Camberwell Green to developing technology that transforms festive waste into construction materials. The simple question - \"what happens to all this waste?\" - has evolved into a business model that generates revenue from material collection, creates value from waste, saves money for local authorities, reduces greenhouse gas emissions and provides sustainable construction materials."
        },
        {
            "text": "As Hugo puts it :"
        },
        {
            "text": "ORNA® has partnerships with organisations such as the Bartlett School of Sustainable Construction at UCL, London South Bank University (LSBU), and has received support from Southwark Council, Southwark Climate Collective and Southwark Pioneers Fund in connection with Trampoline CIC. Other key partners include Innovate UK, the King's Trust, ReLondon, OPEN London and the Alliance for Sustainable Building Products (ASBP)."
        },
        {
            "text": "From Christmas trees to construction materials - now that's a festive circular economy worth celebrating!"
        }
    ]
}