{
    "url": "https://defrafarming.blog.gov.uk/2025/12/18/law-changes-strengthen-protection-for-livestock/",
    "title": "Law changes strengthen protection for livestock",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2025-12-18T11:48:18+00:00",
    "content": [
        {
            "text": "Livestock worrying can happen when a dog attacks, chases or is loose among livestock. Dogs don't need to make contact for harm to occur. Fear and stress alone can harm livestock, and, in severe cases, cause them to die. "
        },
        {
            "text": "The impact on livestock keepers can be devastating. They face financial loss as well as personal distress. "
        },
        {
            "text": "Farmers will soon have clearer and stronger legal protection against livestock worrying. "
        },
        {
            "text": "The Dogs (Protection of Livestock) (Amendment) Act 2025 has today received Royal Assent, making it law. It updates the Dogs (Protection of Livestock) Act 1953."
        },
        {
            "text": "It will come into effect three months from today, on Wednesday 18 March 2026."
        },
        {
            "text": "This legislation is only for England and Wales. Scotland and Northern Ireland have their own legislation on this matter. "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "It has long been an offence to allow a dog to worry livestock. However, the legislation was introduced in 1953 and has not kept pace with changes in the countryside. Livestock numbers in England and Wales have doubled since then, and more people visit the countryside with their dogs. "
        },
        {
            "text": "The law now strengthens the tools available to police and the courts so they can respond more effectively when incidents happen. "
        },
        {
            "text": "This change to the law is not about restricting dog walking. It is about making sure people can continue to enjoy the countryside while keeping livestock safe, protecting animal welfare and supporting the work farmers do every day."
        },
        {
            "heading": 2,
            "text": "The changes "
        },
        {
            "text": "The act: "
        },
        {
            "text": "In addition, the law gives police new and improved powers to improve their investigations, including: "
        },
        {
            "heading": 2,
            "text": "What this means for you "
        },
        {
            "heading": 3,
            "text": "Farmers "
        },
        {
            "text": "If livestock worrying or an attack happens, report it to the police. Keep hold of any evidence. Record dates and times and take photos or videos if you can. It may not always be possible, but collecting witness details is useful. "
        },
        {
            "text": "It may be helpful to check whether signs, fencing, dog-control advice or public footpath management needs to be updated."
        },
        {
            "text": "In addition to practical advice on its website, the National Farmers Union (NFU) offers free gatepost signs to its members. It is currently making improvements to the online form, but you can still order by calling the NFU on 0370 845 8458. "
        },
        {
            "heading": 3,
            "text": "Dog owners "
        },
        {
            "text": "Responsible access to the countryside is encouraged. Be aware of your surroundings when walking near livestock."
        },
        {
            "text": "A dog does not need to make physical contact with animals to commit an offence under the new law. Chasing or disturbing livestock can cause harm.  "
        },
        {
            "text": "The Countryside Code advises that dogs should be kept on a lead around livestock. Always check local signs, as some areas require dogs to be on a lead all or part of the year. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "For the latest from the Farming and Countryside team, subscribe to the Farming blog. "
        }
    ]
}