{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/12/18/putting-further-education-teachers-at-the-heart-of-the-design-process/",
    "title": "Putting Further Education teachers at the heart of the design process",
    "authors": [
        "Becky Loftus",
        "Jonathan Thompson"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2025-12-18T12:00:00+00:00",
    "content": [
        {
            "text": "Design is having real-world impact on the UK’s public services. A recent re-design of Further Education teacher recruitment services has saved the public purse over £1million and enabled thousands of additional people to get on the career path to become a teacher in a college or other Further Education provider."
        },
        {
            "heading": 2,
            "text": "Improving services for teacher recruitment"
        },
        {
            "text": "Further Education (FE) colleges are a vital part of the education system run by the UK’s Department for Education, providing young people with the applied technical skills needed to go on into the jobs we desperately need for our economic growth and to support society more widely, such as construction, digital, childcare and healthcare."
        },
        {
            "text": "Teaching in Further Education not only requires a qualification level above those who you are teaching, but also needs real world experience, so recruiting enough good quality and inspiring teachers is a challenge."
        },
        {
            "text": "A communications campaign, Teach in Further Education, has been running for 2 years to help with this challenge, alongside an information website and supporting helpline. The website was designed and built by a communications agency in a relatively short space of time and was proving costly to keep running, difficult to update the content as policy priorities changed, and was no longer meeting new laws coming in about website accessibility."
        },
        {
            "heading": 2,
            "text": "A multidisciplinary re-design"
        },
        {
            "text": "The FE workforce recruitment policy team met with the Customer Experience & Design (Digital) team to discuss alternative options, alongside communications colleagues. Bringing the site in house would both save significant costs but also give the team a chance to bring more user centred design to the site, understanding the needs of people interested in working in FE, and making sure the content, design and layout of the site met their needs."
        },
        {
            "text": "The policy, comms and digital design teams worked together for 9 months to redesign and launch the site based on 40 interviews with prospective and current FE teachers, and college leaders recruiting them, and 6 quantitative surveys with a total of 3,133 prospective FE teachers. The team used the research to understand the needs of the users and to carry out multiple rounds of testing of different designs, layouts and content. The designers had to balance the needs of the users, with the needs of the policy and comms teams to communicate certain information and meet the objectives of the communications campaign."
        },
        {
            "heading": 2,
            "text": "Understanding future teachers"
        },
        {
            "text": "From our research we learned that, unlike school teaching, many people lacked awareness of what Further Education teaching was, what it entailed and whether or not they would be eligible to teach in FE. This led to the development of some very top-level website content on these topics and the development of an “readiness checker” – a simple step-by-step quiz to help people work out whether they might be able to make the move into FE teaching."
        },
        {
            "text": "The biggest barrier to becoming an FE teacher from our surveys was confidence, with 50% saying this was a barrier to them. So the checker and website content tone was carefully written to be encouraging, as well as signposting to support, such as the helpline. Another user need was around clear and trusted information on the steps to becoming an FE teacher, which the team wrote collaboratively with the policy and communications teams."
        },
        {
            "text": "The toughest decision was how to order the information in the way that made sense to users, and a “top tasks” approach was taken, using quantitative testing to prioritise what information most people needed, balanced against the needs of the communications campaign. The site structure was then mocked up into a prototype and A/B tested using a panel survey of people across England. The final result showed a significant improvement versus the existing site in the rating of it being “easy to find the information I was looking for”, as well as being “easy to understand the information on the site”."
        },
        {
            "heading": 2,
            "text": "The return on investment in design"
        },
        {
            "text": "The site was launched on time in November 2024 to meet the campaign spend bursts. It now fully complies with website accessibility laws WCAG2.2. Not only has the site had around 160k sessions so far, but all engagement metrics improved: engagement time per user went up 32%, engaged sessions per active user by 21%, and average engagement time per session by 8.3%. Comparing Jan to March 24 to Jan to March 25 (comparable periods for campaign spend) and adjusting for the changed tracking consent, conversions improved by 120% (11,981 to 26,366), meaning more people clicking through to job boards to take that next step towards becoming an FE teacher. After adjusting for campaign spend, weekly conversions are currently up 194%. The readiness checker the team identified through understanding the user needs saw immediate high use and, to date, has been completed over 34k times, that’s almost a quarter of all sessions."
        },
        {
            "text": "This means that without any additional campaign spend, more people are being engaged and taking steps towards becoming FE teachers. The new site also saves £347k each year in running costs, so despite a £650k initial investment the 5-year savings are just under £1.1M. Most importantly, the site is helping to make potential FE teachers feel more confident about changing their careers. This project shows how taking a user centred design approach, including quantitative and qualitative research and testing, can make measurable improvements towards policy outcomes."
        }
    ]
}