{
    "url": "https://naturalengland.blog.gov.uk/2025/12/18/royal-assent-natural-england-and-the-planning-and-infrastructure-act/",
    "title": "Royal Assent: Natural England and the Planning and Infrastructure Act ",
    "authors": [
        "Marian Spain"
    ],
    "categories": [
        "Development",
        "Growth",
        "Monitoring",
        "Natural England"
    ],
    "pub_date": "2025-12-18T16:17:44+00:00",
    "content": [
        {
            "text": "By Marian Spain, Chief Executive, Natural England"
        },
        {
            "text": "The Planning and Infrastructure Bill received Royal Assent today. The new Act is central to the government's Plan for Change, representing one of the most significant planning reforms in a generation. The Act also represents a milestone for Natural England, giving more opportunities to to deliver the housing and infrastructure this country needs while driving nature recovery on a larger scale than we have seen before. The new measures in the Act will help us to meet the ambitions of Natural England’s new Strategy: Recovering Nature for Growth, Health and Security’. In particular, they will support our ambition to “Build Better Places” to ensure we build the greener homes and infrastructure we need while enabling nature to thrive all around us."
        },
        {
            "text": "We know the current planning system has not always delivered the outcomes we want, either for nature recovery, or for the development of homes and infrastructure that our country needs.  While this system has helped to protect many sites and species, it has not contributed to large scale nature recovery, nor has it worked well in addressing indirect, cumulative and widescale impacts such as pollution and habitat fragmentation, which cannot be dealt with case by case. That’s why we welcome the reforms introduced by the new Planning and Infrastructure Act today."
        },
        {
            "text": "So, what does this mean for Natural England?"
        },
        {
            "heading": 4,
            "text": "1.  A more streamlined process for Nationally Significant Infrastructure Projects (NSIPs)  "
        },
        {
            "text": "The reform of NSIPs requires regular review of national policy statements, a streamlined procedure for updates and a more focused consultation process. The Secretary of State is given the power to direct projects outside of the development consent process. It also introduces a faster procedure for legal challenges.  To play our part in this streamlined process, Natural England will strengthen our efforts into partnering with developers at the pre-application stages for those projects where the environmental risks and opportunities are greatest. Our advice will not just be on how to avoid or make good on harm, but also on how to seize opportunities for nature’s recovery.  "
        },
        {
            "heading": 4,
            "text": "2. A more joined up planning system"
        },
        {
            "text": "The Planning and Infrastructure Act introduces strategic planning at a sub-regional level through Spatial Development Strategies (SDS), to facilitate effective cross-boundary working in some areas. This will complement the ongoing strengthening of local development planning and addresses the reality that the needs of housing, infrastructure and nature don’t always respect local authority boundaries.  Integrating Local Nature Recovery Strategies (LNRS) with SDS and Local Development Plans will be essential, and NE will step up its efforts here, including through our relationship with Mayoral authorities."
        },
        {
            "text": "The Natural Environment and Rural Communities Act 2006 compelled Natural England to respond to all planning cases. The Planning and Infrastructure Act 2025 now allows us to focus our expertise and resources where they can be most useful to nature, to planners or to developers."
        },
        {
            "text": "Natural England will agree a publicly available operational standard with the Secretary of State that defines which cases it will prioritise, continuing to draw on standing advice where appropriate. The Act also introduces the opportunity for Arm’s Length Bodies like Natural England to benefit from a surcharge applied by Local Planning Authorities on planning cases, which could enable us to better meet growing demand and invest in service improvements."
        },
        {
            "heading": 4,
            "text": "3. The introduction of The Nature Restoration Fund (NRF) and Environmental Delivery Plans (EDPs)"
        },
        {
            "text": "Perhaps the most significant change for Natural England are new duties to prepare Environmental Delivery Plans (EDPs)and operate a Nature Restoration Fund (NRF).   Together these will help to make the planning system more streamlined by giving developers a clear and simple way to discharge their obligations to avoid harming protected sites and species, addressing outright any impacts from development. This means removing the need and cost of bespoke assessments for each individual development by giving developers the option to pay a levy. Natural England will use this pooled resource to deliver the strategic actions, as set out in an EDP, to address the impact that development has on a protected site or species."
        },
        {
            "text": "Environmental Delivery Plans"
        },
        {
            "text": "Environmental Delivery Plans (EDPs) are now being developed by Natural England in collaboration with our partners.  The overwhelming majority of EDPs are expected to be voluntary, providing an action plan (up to 10 years) which will establish the conservation measures needed to address the impact of development on a protected site or on a named protected species.  EDPs will be prepared using the best available data, and they will only be used where the science gives confidence that the conservation measures can achieve the required “Overall Improvement Test.”"
        },
        {
            "text": "We will ensure that the conservation measures that EDPs propose are evidence-based and geographically targeted. All EDPs will be subject to public consultation and will then need to be approved by the Secretary of State. Once an EDP is in place in a specific area, developers can choose to meet their environmental obligations for the environmental features covered by that EDP by paying a levy, which Natural England will then use to deliver the conservation measures set out in the plan. Where EDPs are not in place, for example where there are irreplaceable habitats, or developers choose not to use them, existing Habitats and other Regulations will continue to apply. They will also secure join-up, as EDPs will have regard to wider strategic plans and measures, such as Local Nature Recovery Strategies. "
        },
        {
            "text": "Monitoring and evaluation"
        },
        {
            "text": "We will report on the money collected and spent under each EDP on an annual basis and produce reports at the mid and end points of each EDP. These will set out the conservation measures that have been delivered and show whether they are on track to materially outweigh any negative impact of development relying upon the EDP."
        },
        {
            "text": "Additional safeguards include powers for the Secretary of State to amend or, if necessary, revoke an EDP.  If the Overall Improvement Test is not achieved, or if an EDP is revoked, Secretary of State must publish a statement setting out proportionate remedial actions to secure the overall improvement. "
        },
        {
            "text": "To mark Royal Assent of the Planning and Infrastructure Act, a NRF Implementation Plan has been published, providing a collaborative roadmap for NRF development and delivery. This also confirms that the first EDPs will cover nutrient neutrality catchments, where robust evidence already exists to confirm their impact."
        },
        {
            "heading": 4,
            "text": "4. Growth and nature recovery as one"
        },
        {
            "text": "The Planning and Infrastructure Act gives Natural England a welcome package of measures that collectively mean we can use our powers, expertise and resources to ensure that nature can support what the nation needs: new homes, clean energy, sustainable food, healthy soil, clean water and air, resilience to climate change and access to greenspaces."
        },
        {
            "text": "These changes will enable us to go further and faster for growth and nature recovery and build on work already underway, for example District Level Licensing, the Thames Basin Heaths Partnership,  Nature Recovery Projects such as the Tees Estuary and Somerset Coast Levels and Moors. "
        },
        {
            "text": "I hope, like me, you look forward to a growing coalition of nature conservation, planning and development, knowing that by working together, we are stronger and can produce better outcomes for nature while building the homes and infrastructure we need for the future."
        },
        {
            "heading": 4,
            "text": "Notes:"
        },
        {
            "text": "For more information read:"
        }
    ]
}