{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/12/18/the-power-of-early-intervention/",
    "title": "The power of early intervention",
    "authors": [
        "Catherine Bark"
    ],
    "categories": [
        "Domestic abuse",
        "Early intervention",
        "Working in children's social care"
    ],
    "pub_date": "2025-12-18T14:14:50+00:00",
    "content": [
        {
            "heading": 2,
            "text": "From probation to family work"
        },
        {
            "text": "After sixteen years working in probation, I discovered For Baby’s Sake and was drawn to the idea of working holistically with both parents, rather than just working with half the picture. The opportunity to support families for two years felt like an incredible privilege and a genuine chance to break the intergenerational cycle of domestic abuse, whether or not parents remained together. "
        },
        {
            "text": "Eight years later, I haven’t looked back. As a Senior Therapeutic Practitioner, every day is different which is what I love about the job. Sometimes it’s necessary to pause planned sessions to address safeguarding concerns or housing support. Each parent has a separate therapeutic practitioner and we offer a hybrid approach to weekly one-to-one sessions. We explore topics across the two years including healthy and unhealthy relationships, healthy expressions of feelings, self-esteem, assertiveness and parenting modules."
        },
        {
            "heading": 2,
            "text": "Healing childhood trauma"
        },
        {
            "text": "My favourite module is the therapeutic core of the programme called “Inner Child”. This is delivered well after birth once professional relationships are firmly established. This powerful module allows parents to revisit their own early life experiences at their own pace and begin healing the often wounded parts of themselves. Reflecting on how childhood trauma still echoes in the present through persistent insecurities, poor decision making, and self-sabotaging relationship patterns, parents often report this module as a pivotal point of the programme, not only in developing self-understanding but also increasing insight as a parent."
        },
        {
            "heading": 2,
            "text": "Support from pregnancy onwards"
        },
        {
            "text": "Starting work during pregnancy means we can begin rapport building and meaningful work as early as possible. Antenatal sessions focus on supporting parents to learn about the crucial importance of early life experiences from conception. We encourage secure, attachment-focused parenting which is complemented by antenatal and postnatal Video Interaction Guidance (VIG)."
        },
        {
            "text": "VIG work is truly magical – something I think every parent should have access to. Being able to see moments of attuned interaction with their babies by watching short video clips of themselves builds confidence and bonding. It also opens conversations about what they are already doing well and what they feel they could do more to create more of these moments. This approach is especially powerful for young parents, first time parents, care-leavers, parents who have previously lost care of children, and parents who never had love shown to them as children."
        },
        {
            "heading": 2,
            "text": "A best start in life for children"
        },
        {
            "text": "Early intervention equips parents with the potential gift of providing babies with the absolute best start in life. There have been countless moments when the penny has dropped that they have the power to give their children a chance for a different childhood to their own, one that their children won’t have to recover from. I never take for granted the absolute honour and privilege of walking alongside these parents during this incredibly challenging yet hopeful part of their journey."
        },
        {
            "heading": 2,
            "text": "Further information"
        }
    ]
}