{
    "url": "https://space.blog.gov.uk/2025/12/18/uk-space-agency-christmas-card-design-competition-winners-revealed-%f0%9f%8e%85/",
    "title": "UK Space Agency Christmas Card Design Competition winners revealed 🎅",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space",
        "Space sustainability"
    ],
    "pub_date": "2025-12-18T09:00:00+00:00",
    "content": [
        {
            "text": "We are delighted to announce the winners of the UK Space Agency’s 2025 Christmas Card Design Competition. This year, we were overwhelmed by the creativity and passion shown by people across the country, all inspired by the theme of space sustainability. "
        },
        {
            "text": "Our judging panel, made up of colleagues across the UK Space Agency’s Space Sustainability and Communications teams, had the challenging task of selecting the winning designs from an impressive array of entries. We appreciate everyone who took part and helped spread the message of keeping space tidy and safe for future generations. "
        },
        {
            "heading": 2,
            "text": "Winners by Age Category"
        },
        {
            "text": "Ages 0–6: Winner: Keir Lennon "
        },
        {
            "text": "Ages 7–12: Winner: Leo Pickard "
        },
        {
            "text": "Ages 13–17: Winner: Chelise Hayes"
        },
        {
            "text": "Ages 18+: Winner: Pip Holmes "
        },
        {
            "text": "Overall winner: Leo Pickard "
        },
        {
            "text": "Congratulations to all our winners!"
        },
        {
            "heading": 2,
            "text": "Why Space Sustainability Matters"
        },
        {
            "text": "The competition is more than just festive fun – it's a chance to highlight the importance of protecting our space environment. Space debris poses real risks to satellites and space missions. With thousands of satellites in orbit, and an increasing number of missions launching every year, it’s vital to minimise the creation of space debris and to develop technologies that can remove or avoid it. Sustainable practices include designing satellites to deorbit safely at the end of their lives, tracking objects in space to avoid collisions, and international cooperation to set standards for responsible behaviour. "
        },
        {
            "text": "By raising awareness, we hope to inspire the next generation to help protect space for everyone. "
        },
        {
            "heading": 2,
            "text": "Thank You"
        },
        {
            "text": "A huge thank you to everyone who entered, to our judges, and to all the teachers, parents, and carers who encouraged young people to get creative. Please continue to share your designs on social media, tagging the UK Space Agency and using the hashtag #KeepSpaceTidy. "
        },
        {
            "text": "For more information about our work on space sustainability, visit our website. "
        },
        {
            "text": "By Leo Pickard – Winner, age 7-12 category and overall winner."
        },
        {
            "text": "Leo said:"
        },
        {
            "text": "By Keir Lennon – Winner, age 0-6 category "
        },
        {
            "text": "Keir said:"
        },
        {
            "text": "By Chelise Hayes – Winner, age 13-18 category "
        },
        {
            "text": "Chelise said:"
        },
        {
            "text": "By Pip Holmes – Winner age 18+ category "
        },
        {
            "text": "Pip said:"
        }
    ]
}