{
    "url": "https://prisonjobs.blog.gov.uk/2023/06/28/cooking-in-scrubs-a-spotlight-on-working-as-a-prison-caterer/",
    "title": "Cooking in Scrubs - A spotlight on working as a prison caterer",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Prison catering"
    ],
    "pub_date": "2023-06-28T16:55:04+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Working in an industrial-sized kitchen and catering for 1,300 people with a range of dietary requirements, Fiona says her role as a caterer at HMP Wormwood Scrubs is “extraordinary and never dull.” "
        },
        {
            "text": "What did you do before you became a prison caterer? "
        },
        {
            "text": "I taught English for seven years in the prison. I like changing career – I’ve been an editor, an auditor, a practising artist and a teacher over the years – I’ve enjoyed it all. Before Covid, I did 10 years running a night kitchen for the largest homelessness centre in London but cooking two hot dinner options and prepping breakfast for 400 guests is small scale compared to our kitchen at Scrubs.  "
        },
        {
            "text": "Why did you decide to become a prison caterer? "
        },
        {
            "text": "I wanted a change of scene but to carry on working with prisoners, as I really enjoy it. All of life is here! "
        },
        {
            "text": "How does a prison catering job differ to a ‘traditional’ catering role?  "
        },
        {
            "text": "How many kitchens work at the scale that we do, with the resources that we have? It’s a fantastic training in logistics and delivery in a place where challenges can crop up at any moment. Good organisation and teamwork are key in every kitchen but in a prison kitchen, you can see how essential they are. Prisons are disciplined environments, but also very dynamic, and you need to be able to respond to changing needs. Teamwork is paramount. "
        },
        {
            "text": "What are some of your key tasks as a prison caterer? "
        },
        {
            "text": "You’re working across the kitchen sections, catering for the entire prison, from making hot dinners to cold salads and pastries, packing and distribution. The logistics side is fascinating and challenging.\nCatering for 1,300 people a day with a population that changes in size by the hour, with a mass of special medical, cultural and lifestyle dietary requirements, and on a limited budget, is extraordinary – and never dull.  "
        },
        {
            "text": "What involvement do you have with prisoners and what do you like about it? "
        },
        {
            "text": "We work with teams of prisoners, supervising them and training them.  "
        },
        {
            "text": "I like people and their stories. I want to see them learning decent skills that they can employ when they return to their communities. Sometimes that training is the basics of how to be ready for work and put in a decent shift. At HMP Wormwood Scrubs, we’re training bakers now, and some of the prisoners are good cooks so it’s wonderful when they get to show that off and encourage others.  "
        },
        {
            "text": "What do you like most about your job? "
        },
        {
            "text": "I really like working in a prison. Food is so important and has a real impact on morale as well as physical and mental health. So using your skills to create quality, nutritional meals for everyone is key. "
        },
        {
            "text": "One day I might be making a simple pasta salad, but I work hard to make it the very best it can be with what I’ve got. On another day, I’m learning how to make a curry for 500. I’m learning so much from my peers, supervisors and manager. I think I’ve come a long way in six short months, but I’ve got so much more to learn and master. "
        },
        {
            "text": "I enjoy the pastoral side of working with the prisoners – that’s the teacher in me. Working with prisoners and helping those individuals who want to make a positive difference to their lives is satisfying and rewarding. "
        },
        {
            "text": "What are the progression opportunities available to prison caterers? "
        },
        {
            "text": "For many, heading towards a supervisory catering role and kitchen management and above is an excellent route. The joy of being in the Civil Service though is that there are opportunities to move almost anywhere – and that’s the draw for me. There’s a lot of variety, with the stability of a Civil Service career.  "
        },
        {
            "text": "What are some of the benefits of working as a prison caterer? "
        },
        {
            "text": "Being a civil servant is a huge draw as it’s secure and, in my experience, employee care is seen as important. I’ve built up strong relationships with prison officers and other staff around the prison over the years. Because it’s such a challenging but hidden world that we share, there’s great teamwork and humour among the staff.  "
        },
        {
            "text": "Shift-working isn’t for everyone, but it’s been a revelation for me, with rest days and short days during the week being a bonus for working every other weekend.  "
        }
    ]
}