{
    "url": "https://onsdigital.blog.gov.uk/2023/06/28/from-aa-to-obe-king-charles-iii-recognises-ons-digital-employee-in-birthday-honours/",
    "title": "From AA to OBE - King Charles III recognises  ONS digital employee in Birthday Honours",
    "authors": [
        "Martin O'Brian"
    ],
    "categories": [
        "ONS digital people"
    ],
    "pub_date": "2023-06-28T12:19:08+01:00",
    "content": [
        {
            "text": "We are proud to announce that Ceinwen Blake, Deputy Director of Digital, Data and Technology, has been named in the King’s Birthday 2023 Honours list.  She has been awarded an OBE (Officer of the Order of the British Empire), recognising her extraordinary work and IT service at The Office for National Statistics that has significantly contributed towards the service we provide to the nation."
        },
        {
            "text": "Initially joining in the post room 43 years ago, Ceinwen has worked her way up, showing passion in delivering for ONS on IT and people matters. She’s demonstrated aspirational leadership, being the embodiment of a can-do culture and has always made time to help others."
        },
        {
            "text": "Her nomination shines a light on key accomplishments, demonstrating the incredible and positive impact she has had on our organisation. These include:"
        },
        {
            "text": "Ceinwen’s successes during her time at ONS are admirable, and we were extremely proud to hear the news that she was recognised for her contribution to public service.   Ceinwen said:"
        },
        {
            "text": "\"I consider myself very fortunate to have worked at the Business Statistics Office (BSO), Central Statistics Office (CSO) and currently the Office for National Statistics (ONS) – yes it has changed its name several times! I have had (and am still having) a great and varied career. I have grasped lots of opportunities, have had lots of challenges and I still love working as part of DDaT at ONS.  I have been awarded an OBE - Order of the British Empire. What an honour, not just for me but all those I have worked with over the past 4 decades.\""
        }
    ]
}