{
    "url": "https://lifeathmrc.blog.gov.uk/2023/06/28/hmrc-wins-women-in-tech-employer-award/",
    "title": "HMRC wins Women in Tech Employer award for the second year running",
    "authors": [
        "Sarah"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-06-28T06:23:02+00:00",
    "content": [
        {
            "text": "HMRC has won the Best Public Sector Employer category for the second year running at the Women in Tech Employer Awards."
        },
        {
            "text": "The awards celebrate employers and individuals going above and beyond to help close the gender gap within the tech sector. The 2023 event took place in London on 15 June, and our team were delighted to attend the ceremony and take home the trophy."
        },
        {
            "text": "The judges admired HMRC’s initiatives to support female tech employees, from external mentoring to the Women in Tech Network."
        },
        {
            "text": "The Best Public Sector Employer award, for which HMRC was shortlisted alongside the Department for International Trade and the Intellectual Property Office, recognises public sector employers that attract and retain female tech talent into their IT and technology departments."
        },
        {
            "text": "Chief Digital Information Office (CDIO) technology Transformation Director, Nic Harrison, said:"
        },
        {
            "text": "“HMRC has a very strong Women In Technology network and I’m immensely proud to see this has been recognised again."
        },
        {
            "text": "“As a result of their continued hard work HMRC retained the award we won last year and it was a great evening with the team, made even better by winning against very strong competition."
        },
        {
            "text": "“The HMRC Women in Tech Network plays a pivotal role encouraging and supporting our female technology colleagues, carries out mentoring and coaching inside (via a CDIO Hub) and outside the department and is supported widely across CDIO, a truly inspiring group of which I’m delighted to be a member and ally.”"
        },
        {
            "heading": 3,
            "text": "The Women in Tech Network"
        },
        {
            "text": "The Women in Tech Network was formed as part of HMRC’s continuing commitment to gender equality and supporting women in technology. The network provides an open, safe space for shared conversations, networking, collaboration and opportunities to support the women in tech or those who aspire to be."
        },
        {
            "text": "Women in Tech Network Chair, Dena Habashi-Ayub, said:"
        },
        {
            "text": "“Having HMRC’s Women in Tech Network’s commitment to gender equity, diversity and inclusion recognised at a national level at the Women in Tech Employer Awards for the second time running, is a significant achievement!"
        },
        {
            "text": "“It is testament to the passion to drive positive change in this area, by creating a holistic personal and professional development platform and voice to galvanise collaboration, allyship and awareness of the barriers facing women in the IT sector."
        },
        {
            "text": "“As a collective, we strive to improve representation, recruitment, retention and advancement of Women in Tech and ensure we celebrate their successes too. I’m honoured to work with a truly dynamic and inspirational Steering Group, with supporting allies, who through their dedication are helping to make HMRC an even better place to work.”"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "At HMRC, we’re proud to be a diverse and inclusive employer, giving opportunities to people no matter what their background. Visit the HMRC Careers Site to find out more about our culture and values at HMRC."
        },
        {
            "text": "Discover our latest job vacancies on Civil Service Jobs."
        }
    ]
}