{
    "url": "https://educationhub.blog.gov.uk/2023/06/28/how-we-are-keeping-school-buildings-safe/",
    "title": "How we are keeping school buildings safe",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-06-28T00:01:44+01:00",
    "content": [
        {
            "text": "All pupils should be able to learn in buildings that are fit for purpose, and nothing is more important than the safety of pupils and teachers."
        },
        {
            "text": "That’s why we have been investing in keeping schools all over the country in good condition. Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What are you doing to keep school buildings safe? "
        },
        {
            "text": "We have given over £15 billion since 2015 for keeping schools in good working order, including £1.8 billion committed for 2023-24."
        },
        {
            "text": "Included in this funding for 2023-24 is £1.1 billion in School Condition Allocations (SCA). This is funding for local authorities, large multi-academy trusts and academy sponsors, and dioceses, and other large voluntary aided school groups, to invest in maintaining and improving the condition of their schools."
        },
        {
            "text": "Over £450 million has also been made available through the Condition Improvement Fund (CIF) this year to support over 1,000 essential maintenance projects at small and stand-alone academy trusts, voluntary aided schools, and sixth-form colleges."
        },
        {
            "text": "The fund also provides Urgent Capital Support for these schools where there are serious issues that threaten immediate school closure."
        },
        {
            "text": "Also included in the funding this year is over £200 million that has been allocated directly for schools to spend on projects to meet their own priorities. This is called Devolved Formula Capital (DFC)."
        },
        {
            "text": "We are also investing in 500 projects for new and refurbished school buildings through our School Rebuilding Programme. "
        },
        {
            "text": "Our approach with this investment is working - over 95% of school building elements surveyed between 2017 and 2019 were in good or satisfactory condition (condition grade A or B). Only a very small percentage (0.3%) of building components needed replacing straight away (Grade D)."
        },
        {
            "text": "As a department we are most concerned by the grade Ds - which refer to materials that are due to be replaced – for core elements of buildings."
        },
        {
            "text": "Early indications in our successor survey, Condition Data Collection 2, (CDC2), alongside feedback from responsible bodies, shows that in almost every case where a Grade D component was identified it has now been addressed."
        },
        {
            "heading": 3,
            "text": "What about schools where there is Reinforced Autoclaved Aerated Concrete (RAAC)?"
        },
        {
            "text": "The safety of pupils and staff is vital. We have work in progress with schools to identify and manage RAAC. In cases where RAAC is confirmed, we provide speedy support for schools on the advice of structural engineers. This could include capital funding for work to remove any immediate risk and, where necessary, temporary buildings."
        },
        {
            "text": "Our professional surveyors have already carried out over 200 assessments where RAAC is suspected to verify its presence and assess its condition, and we are on track to complete 600 assessments by Autumn."
        },
        {
            "text": "We have been talking to schools about the potential risks of RAAC since 2018 when we first published a warning note with the Local Government Association."
        },
        {
            "text": "Since then, we have published guidance in identifying and managing RAAC and have asked all local authorities, academy trusts and other bodies responsible for schools to share their knowledge of RAAC, its presence in their buildings, and how they are managing it."
        },
        {
            "heading": 3,
            "text": "Whose responsibility is it to maintain school buildings? "
        },
        {
            "text": "It is the responsibility of those who run our schools – typically academy trusts, local authorities, and voluntary-aided school bodies and their schools – who work with their schools’ day-to-day to manage the safety and maintenance of their schools. They should alert us if there is a serious concern with a building they cannot manage."
        },
        {
            "text": "We provide access to funding targeted towards where it is most needed to help them carry out these responsibilities, alongside a package of other guidance and support."
        },
        {
            "text": "We provide additional support on a case-by-case basis if we are alerted to a serious safety issue."
        },
        {
            "heading": 3,
            "text": "What about the old schools that were built in the 1960s, will these be replaced? "
        },
        {
            "text": "31% of the floor area of the school estate is modern – having been built since 2000."
        },
        {
            "text": "The age of a building does not mean it is at the end of its life. While schools can expect reasonable wear and tear, buildings that are well kept can be fit for purpose beyond their original design."
        },
        {
            "text": "To support schools that do need buildings replaced, our School Rebuilding Programme will transform buildings at 500 schools over the next decade, prioritising schools in poor condition and with evidence of potential safety issues."
        },
        {
            "heading": 3,
            "text": "What are you doing to ensure the sustainability of schools? "
        },
        {
            "text": "The difficulty of decarbonising a large estate is not unique to schools and work of this scale takes time."
        },
        {
            "text": "As part of our climate change and sustainability strategy, we are assessing emissions and the risk posed to schools by the impact of climate change, like flooding. This will allow us to set targets and act efficiently, cost-effectively and with least disruption."
        },
        {
            "text": "We have already improved our building specifications so that they are better than national standards."
        },
        {
            "text": "All new school buildings delivered by the Department for Education are designed to be net zero carbon in operation and designed for a 20C temperature rise, and resilient to a 40C temperature rise."
        }
    ]
}