{
    "url": "https://dcmslibraries.blog.gov.uk/2023/06/28/libraries-sector-in-the-kings-birthday-honours-list-2023/",
    "title": "Libraries sector in the King's Birthday Honours List 2023",
    "authors": [
        "Nicole Agyekum, Libraries Team , DCMS"
    ],
    "categories": [
        "Library workforce"
    ],
    "pub_date": "2023-06-28T10:13:19+01:00",
    "content": [
        {
            "text": "The King's Birthday Honours mark the extraordinary contributions and service of people across the UK. Congratulations to the 8 people who were awarded honours in recognition of their contribution to libraries in England. You can read more below about some of the work they have done."
        },
        {
            "text": "Officer of the Order of the British Empire (OBE)"
        },
        {
            "text": "Phil Spence. Chief Operating Officer, The British Library"
        },
        {
            "text": "Phil has led the national library with distinction as Chief Operating Officer (previously Director of Operations and Services) since 2006. He is the engine room that ensures the Library can deliver on its vision, responsible for a wide range of functions, including finance, planning, strategic risk and security, IT, remote customer services, the Reading Rooms, Human Resources, commercial activities, and estates."
        },
        {
            "text": "Catherine Diana Courtney. Project Director, Artists' Lives, British Library. "
        },
        {
            "text": "Catherine’s commitment to National Life Stories (NLS), the oral history fieldwork charity based at the British Library, has made an immense contribution to cultural life in the UK. Her 34 years of service has been instrumental in capturing over 450 audio biographies, which have been archived at the British Library for researchers now and in the future. She has been a pioneer of the long-life story interview technique, has trained and guided numerous interviewers, and has been instrumental to fundraising for NLS to be able to record countless more oral histories. "
        },
        {
            "text": " "
        },
        {
            "text": "Member of the Order of the British Empire (MBE)"
        },
        {
            "text": "Christine Elizabeth Myhill. Libraries and Heritage Manager, Gateshead and Chair, Association of Senior Children's and Education Librarians (ASCEL) "
        },
        {
            "text": "As Chair of the National Association of Senior Children’s and Education Librarians (ASCEL), Christine has worked tirelessly to ensure libraries are strategically placed to contribute to and influence national developments in the delivery of public library services and schools’ library services for children and young people. "
        },
        {
            "text": "Caroline Thomson Rae. Libraries and Community Assets Manager, London Borough of Newham."
        },
        {
            "text": "Caroline has worked in public libraries for over 20 years and is currently the strategic lead for libraries in the London Borough of Newham, having previously worked in Waltham Forest and Essex. Apart from her role in Newham, Caroline has been an executive member of London Libraries (regional branch of Libraries Connected) since 2017, she was president from 2018-22 and has been treasurer since 2022. She is the Libraries Connected Universal Digital Offer Regional Lead for London, a role she’s held since 2017 and Libraries Connected Advisory group member since 2018.  Caroline has also been a strategy group member of The Libraries Consortium (a consortium of 23 library authorities across London and surrounding counties who share books and resources and work to deliver a cost-efficient, quality library service) for over 10 years. Since 2021, Caroline has been a member of The Reading Agency Summer Reading Challenge strategy group."
        },
        {
            "text": "Janet Sally Zmroczek. Lately Head, European and Americas Collections, British Library."
        },
        {
            "text": "Janet has served the British Library for almost 39 years. From 2015-2022 she was the Head of European and Americas Collections, previously holding roles as Cataloguer (of British and Slavonic books), Curator (of Polish, Baltic and Central Asian Collections) and managing Slavonic and East European Collections and European Collections. Among her many achievements at the British Library was the Google Books Digitisation Project, which Janet initially scoped in 2011 and played a key role in leading until her retirement. The project, a partnership between the British Library and Google, involves digitising and making available online out-of-copyright books, music and pamphlets from the 16th to 19th centuries. Over 600,000 volumes have been digitised to date."
        },
        {
            "text": " "
        },
        {
            "text": "British Empire Medal (BEM)"
        },
        {
            "text": "Kimberly Bryans. For services to Community Managed Libraries in the London Borough of Bexley."
        },
        {
            "text": "When the two local libraries were about to close in 2016, Kimberly took the initiative and negotiated with the London Borough of Bexley council for their transformation into Community Libraries to be run by her and up to 25 volunteers from the surrounding area, including mentally challenged adults. Her selflessness in both time and effort, and her resourcefulness (seeking out funding, grants and donations) has meant they not only continue to survive but are successful. "
        },
        {
            "text": "Karolynne Anne Hart. Cultural and Arts Programme Manager, Gateshead Libraries."
        },
        {
            "text": "Karolynne has made an outstanding contribution to the development of Gateshead Libraries as a place for accessible, diverse, and creative activities. She has improved people’s lives by devising and developing ambitious projects. Most recently she secured funding from Arts Council England and the Baring Foundation to develop ‘Art Diamonds’, a three-year creative programme for people of retirement age. "
        },
        {
            "text": "Julia Robinson. Principal Librarian, South Tyneside Council."
        },
        {
            "text": "Julia is passionate about public libraries and the impact they can have on communities. She has been an advocate for libraries, arts and culture regionally and nationally, and has had a huge impact on libraries in South Shields, creating welcoming, inclusive places and services. She leads the delivery of library services in South Tyneside where she has played a key role in developing new libraries including, The Word, Hebburn Central and Jarrow Focus."
        }
    ]
}