{
    "url": "https://dwpdigital.blog.gov.uk/2023/06/28/looking-to-the-future-of-dwp-digital/",
    "title": "Looking to the future of DWP Digital",
    "authors": [
        "Richard Corbridge, CDIO, DWP Digital"
    ],
    "categories": [
        "Digital transformation",
        "Digital With Purpose",
        "DWP Digital",
        "DWP Digital Strategy",
        "Enabling Services"
    ],
    "pub_date": "2023-06-28T15:04:41+01:00",
    "content": [
        {
            "text": "I joined DWP because I believe in its vision of developing and delivering world-class services that benefit society today and improving the lives of future generations. Working with digital experts on innovative projects in an award-winning organisation making a real-life difference is key for me and I truly believe in DWP being able to achieve this through digital."
        },
        {
            "text": "Since I took on the role as Chief Digital and Information Officer for DWP back in April, things have moved quickly. I’ve benefitted from a proper handover with the former CDIO (Chief Digital and Information Officer), Simon McKinnon. I have visited colleagues across the country in Job Centres, Service Centres, and our hub offices. I have brought my leadership team together for a face-to-face planning day where we agreed objectives for the year ahead and how we were going to build towards achieving these with a renewed outcome focus."
        },
        {
            "heading": 2,
            "text": "Our 2023/24 Business Plan"
        },
        {
            "text": "One of the Digital team’s first achievements with me as CDIO is to collaboratively create and launch our new business plan. It’s an ambitious plan that will set us up for future successes, and ensure our positive impact continues to be felt by our customers. It places our objectives at the centre of all that we do, it asks for a customer experience focus and ensures that we have transparency throughout DWP for what digital is here to do."
        },
        {
            "text": "The business plan focuses on five goals:"
        },
        {
            "text": "The expectations of digital around DWP are high, and rightly so. I see my role as a facilitator, easing our progress towards our goals by clearing the way and removing obstacles. I want to join things up, make sure my colleagues have what they need to get the job done, and help them understand how the digital experiences they encounter in their everyday lives can be reflected in the services they offer at work."
        },
        {
            "text": "But I can’t do this alone, and I am extremely grateful to have inherited a team of people that have strong collaboration skills, with a focus on our users, and are clear on what they need to do. A team of people who understand the need for transparency, engagement and being part of the business outcome that our customers need."
        },
        {
            "text": "We will also collaborate with our partners to achieve our goals and provide the best service for our customers. If you’re a supplier and want to join us on our journey we’d like to hear from you."
        },
        {
            "heading": 2,
            "text": "Building the future"
        },
        {
            "text": "As we put our plan into action, I would like to reflect on my CDIO experience so far and some of the challenges we face moving into the next 12 months."
        },
        {
            "text": "We develop and deliver world-class digital services. Building and maintaining these services enables millions of people to access the help, advice, and financial support they need. We deliver large scale projects that have a real impact on lots of people’s lives. We must do all of this with the mantra of making these services as simple as possible and seek to capture information once and apply it across our systems."
        },
        {
            "text": "One of our most significant challenges is data. We manage vast amounts of information, holding data for over 20 million customers. This will underpin our innovation journey, enabling us to make informed decisions at the touch of a button. We need to seize the full potential of data and insight enabling us to join up customer journeys wherever we can. This will begin with a comprehensive review of what we have and what we need."
        },
        {
            "heading": 2,
            "text": "Share. Reuse. Align."
        },
        {
            "text": "Our new Strategic Reference Architecture (SRA) underpins our ambitions for how DWP Digital will increase collaboration across teams and support the transformation of departmental services in line with DWP strategy."
        },
        {
            "text": "The way in which we create and deliver services is changing, and we can no longer work in silos. Over the last year, we’ve broken down some of the barriers, modernised several services and paved the way for further development. It is time to take the next step and accelerate delivery of modern services for DWP’s customers and colleagues powered by SRA."
        },
        {
            "text": "Using SRA as a blueprint for how we work means we share, reuse and align more digital products. As well as providing this consistency in service for customers and colleagues, SRA provides flexibility. It’s our future way of working that critically doesn’t depend on changing economic, social or political circumstances."
        },
        {
            "heading": 2,
            "text": "Connecting with our customers"
        },
        {
            "text": "In my first week I was lucky enough to visit Pudsey job centre, and this opened my eyes to the opportunities we have as an organisation to go ‘back to the floor’ and understand our users on a deeper level. I saw first-hand what their pain points are, and how we can use digital transformation to ease those pains to really connect with our customers."
        },
        {
            "text": "Providing opportunities for our workforce to do this will close the gap between service and user and put the user truly at the heart of our services."
        },
        {
            "text": "I followed up with a visit to a number of service centres, health review centres and Hull job centre as well. Each time seeing more of the systems and building my understanding of the needs of our colleagues and customers."
        },
        {
            "heading": 2,
            "text": "The next 12 months"
        },
        {
            "text": "I am really looking forward to steering the ship over the next 12 months working on projects that will provide real life results for our customers and claimants. I’d like to bring some of my previous experiences and knowledge into the organisation and encourage opportunities to share digital expertise from across the digital arena and public service sector."
        },
        {
            "text": "I look forward to getting to know more about my team both personally and professionally as we get to work on major project design and delivery together."
        }
    ]
}