{
    "url": "https://defrafarming.blog.gov.uk/2023/06/28/protecting-hedgerows-share-your-views/",
    "title": "Protecting hedgerows: share your views",
    "authors": [
        "Leanne Joyce",
        "The Team"
    ],
    "categories": [
        "environmental land management schemes",
        "Payments to support hedgerows"
    ],
    "pub_date": "2023-06-28T12:00:02+01:00",
    "content": [
        {
            "text": "Hedgerows store carbon, support crop pollinators, create habitats for animals, slow water flow and create shade and fodder for animals. Those are just a few of their benefits. "
        },
        {
            "text": "They are a vital feature of the English countryside. "
        },
        {
            "text": "We want to protect the hedges we have, invest in their maintenance and support further planting. "
        },
        {
            "text": "We also want to make sure that hedgerow regulations work for wildlife, the environment and farmers."
        },
        {
            "text": "In the Environmental Improvement Plan, we set out our commitment to support farmers to create or restore 30,000 miles of hedgerows by 2037 and 45,000 miles of hedgerows by 2050. "
        },
        {
            "text": "Today we launched a consultation on hedgerow protections in England and we want your views. "
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "We want to preserve and protect hedgerows through effective, proportionate regulation while working in partnership with industry to deliver our environmental targets."
        },
        {
            "text": "The consultation focuses on domestic regulations for hedgerow protections, as this is an area where we don’t yet have domestic legislation. "
        },
        {
            "text": "In addition to the protections found under the Wildlife and Countryside Act 1981, legislation exists around the removal of hedgerows in The Hedgerows Regulations 1997. It does not, however, cover their management."
        },
        {
            "text": "At the moment, farmers must not remove important hedgerows. They must maintain a buffer strip along their hedgerows and must not cut or trim hedgerows during bird nesting and rearing season — for the good of the hedgerow and the wildlife it supports. "
        },
        {
            "heading": 2,
            "text": "The consultation"
        },
        {
            "text": "The consultation focuses on maintaining and improving existing protections as well as our enforcement approach."
        },
        {
            "text": "The consultation seeks feedback on our proposal to amend existing law to include the following management measures:"
        },
        {
            "text": "We want to know where you think we could focus our ambitions for future hedgerow protections."
        },
        {
            "text": "Finally, we’d like your opinion on a proposal to introduce civil sanctions for the management of hedgerows."
        },
        {
            "text": "We want everyone who cares about hedgerows to respond: from farmers to stakeholder organisations to members of the public."
        },
        {
            "text": "The consultation opened today. It will be open for 12 weeks. It will close Wednesday 20 September 2023 at 23:59pm."
        },
        {
            "text": "This consultation is designed to help us shape what our requirements should be and we'll blog with updates."
        },
        {
            "text": "Read the consultation document and share your views"
        },
        {
            "heading": 2,
            "text": "Hedgerows and environmental land management "
        },
        {
            "text": "We are making sure that our environmental land management schemes recognise the importance of hedgerows. "
        },
        {
            "text": "Through Countryside Stewardship, we already pay for the management of hedgerows by rotational cutting, leaving some hedgerows uncut and restorative pruning of fruit trees.  "
        },
        {
            "text": "There are currently over 49,000 miles of hedgerows with one, or both sides managed under Countryside or Environmental Stewardship options. 8,450 miles of hedgerows have either been created or restored through Countryside Stewardship capital grants. "
        },
        {
            "text": "This year, we will introduce new Sustainable Farming Incentive (SFI) actions for hedgerows. "
        },
        {
            "text": "Actions include assessing and recording the condition of hedgerows, maintaining existing hedgerow trees and establishing new ones."
        },
        {
            "text": "The actions aim to support farmers in managing hedgerows to provide year-round food, shelter and breeding cover for wildlife. "
        },
        {
            "text": "The guidance includes what land is eligible for each action and what you need to do to get paid. "
        },
        {
            "text": "In addition to our environmental land management schemes, innovative finance schemes for hedges are progressing with funding from Defra."
        },
        {
            "text": "For example, through the Natural Environment Investment Readiness Fund, we funded the Allerton Research and Educational Trust to create a carbon calculation tool for hedges, as a basis for a new carbon code for hedgerows. This will support hedgerow planting and maintenance. "
        },
        {
            "text": "We are also partnering with the British Standards Institution to establish a common framework to govern nature market standards like the carbon calculation tool. Doing so will help us to make sure that new codes like this one deliver for nature and implement the principles underpinning the Nature Markets Framework. "
        }
    ]
}