{
    "url": "https://foresightprojects.blog.gov.uk/2023/06/28/vesteg-x-pace-a-hybrid-framework-for-scanning-depths-and-horizons/",
    "title": "VESTEG x Pace: A Hybrid Framework for Scanning Depths and Horizons",
    "authors": [
        "charliewarwick"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-06-28T12:34:00+01:00",
    "content": [
        {
            "text": "PESTO, STEEP, PESTLE, GESTE… whatever your favoured taxonomy for Horizon Scanning [1], these acronyms all work to ensure futurists’ evidence gathering is sufficiently broad, taking into account holistic and macrocontextual change. They help us avoid many research biases and myopia as we lay the evidence-based foundations for futures work. It’s increasingly held wisdom that values (V) should be considered alongside economic (E), sociodemographic (S), technological (T), environmental (E) and governance (G) trends and signals [2]. Sociocultural norms, attitudes and behaviours have just as much influence in shaping our futures as other types of driver and are often underprivileged compared to, say, emerging technologies.  "
        },
        {
            "text": "If VESTEG helps us get our heads around the breadth of change, there is another, perhaps less well-known, framework for making sense of its depth: Pace Layers. Coined by the architect Frank Duffy, Pace Layers was originally an attempt to describe deterioration in the built environment, based on the premise that certain ‘layers’ (the structure, substrate) have longer life expectancies than others (the skin, the stuff inside). After Duffy, Stewart Brand contended that the relationship between differently-paced layers is “how buildings learn after they’re built” [3]. The fast layers are where most innovation and renewal happen, sustained and stabilised by slow layers, which adapt and adopt over longer time periods.  "
        },
        {
            "text": "Futurists became interested in Pace Layers when Brand applied his model to complex systems. In the most adaptable and robust systems, “fast learns and slow remembers, fast proposes and slow disposes”. This is true of healthy civilisations; Brand describes six layers with different change-rates and scales and which together absorb shocks and ensure continuity [4]: "
        },
        {
            "text": "Figure 1. Diagram showing the six layers of civilisations with different change-rates and scales. Adapted from Brand, S. (2018) [4].Each layer should “respect the pace” of the others. When rates of change are confused, the whole system can destabilise. For example, a rapid rather than gradual change in governance and order can bring about catastrophic revolution and disruption in the layers above. If nature is allowed to be driven at a commercial pace, we face the loss of “all-supporting” resources (forests, fisheries etc), which sends destructive shockwaves through all other layers. "
        },
        {
            "text": "Relative and disruptive pace is explored in more depth in the reference materials. Here, I want to explore the value Brand’s model in the context of Horizon Scanning, when combined with whatever scanning taxonomy is being used. Rather than simply asking, “how do we categorise X trend?”, Pace Layers encourage us to consider the longevity, or ‘depth’ of its impact. One might use a hybrid ‘map’ like the below to plot trends, phenomena and signals. "
        },
        {
            "text": " Let’s take a few trends and phenomena as examples, mapped in red: "
        },
        {
            "text": "The point here is not to get to a correct mapping – there’s no such thing. The value of a collaborative mapping exercise lies in sharing rationale and having a deeper conversation about why we would plot a trend or phenomenon a certain way, surfacing assumptions we are holding about both the intensity and the nature of its impact in the world.  "
        },
        {
            "text": "As a starting point for Futures work, including scenario planning, this map shows us the relative dominance and dependence of change. Something plotted closer to the centre has the potential to influence, or set the context for, other changes (it is more ‘dominant’). Things at the outer edges will likely be influenced by many other variables (dependent). One might start to draw connections – actual lines – between points on the map, exploring the direction of influence and related clusters of change across categories. When developing scenarios to a specific time horizon, mapping in this way can help you draw a distinction between relatively certain contexts and productive uncertainties. For example, 2030 futures will all be bounded by a range of natural/climate and demographic/cultural parameters, but uncertainties in the commerce and infrastructure layers would prove fruitful grounds for exploration via scenarios.  "
        },
        {
            "text": "Lastly, there are broader benefits to re-orienting planning and perspectives around Pace Layers, beyond producing enhanced scanning outputs. Anyone in the business of policy- or placemaking can understand their role in ‘a longer now’, taking short-term decisions and action while bearing in mind (and hopefully preserving) the health of slower layers. This map can be a tool for ‘bigger’ storytelling to stakeholders, for setting reasonable expectations about the scope and time frame for returns on investment. Brand uses the example of “education [as] intellectual infrastructure.  So is science.  They have very high yield, but delayed payback”. VESTEG x Pace might prove an antidote to hot and hasty decision-making; we’d be interested to hear how you embed, evolve and experiment with it. "
        },
        {
            "text": "[1] I am using the term ‘Horizon Scanning’ to mean the exercise of gathering evidence and intelligence on what’s changing – including longer-term trends, emerging phenomena and weak signals."
        },
        {
            "text": "[2] Andrew Curry, The Futures Diamond, Next Wave Futures 2019"
        },
        {
            "text": "[3] Stewart Brand, How Buildings Learn: What Happens After They’re Built, 1994 https://openlibrary.org/works/OL823146W/How_Buildings_Learn"
        },
        {
            "text": "[4] Stewart Brand, Pace Layers: How Complex Systems Learn and Keep Learning, MIT Press, 2018"
        }
    ]
}