{
    "url": "https://icsdigital.blog.gov.uk/2025/10/17/how-reusing-technology-and-better-data-collection-helps-climate-change-agreements/",
    "title": "How reusing technology and better data collection helps climate change agreements  ",
    "authors": [
        "Nick Joyce, Head of Data and Development, ICS Digital "
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-10-17T10:40:16+01:00",
    "content": [
        {
            "text": "I run the data management system in ICS Digital, a platform for large scale data collection. It’s part of ICS Digital’s strategy to give our departments access to technology that speeds up delivery and cuts their costs.  "
        },
        {
            "text": "When the climate change agreement team approached me, we had exactly what they needed.  "
        },
        {
            "text": "Why improving the data we collect helps meet Net Zero "
        },
        {
            "text": "Climate change agreements are a voluntary scheme offering tax relief to over 2,600 businesses across 50 industries if they meet a set of energy efficiency or carbon reduction targets.  "
        },
        {
            "text": "The government sets stretching but realistic targets to help achieve industrial decarbonisation. Better data helps ministers to set the right targets. This helps us to meet Net Zero, and ensure value for money for the taxpayer. "
        },
        {
            "text": "Reusing and recycling our technology "
        },
        {
            "text": "When the team approached us for an automated way to collect data from businesses instead of a manual process, time was short.  "
        },
        {
            "text": "With deadlines for submissions for targets looming, starting from scratch would have meant the team couldn’t use the data to deliver their recommendations in time. This is where having a purpose built, reusable, data ingest and storage platform comes in handy.  "
        },
        {
            "text": "We had a working system built in 3 weeks. This meant we had time to focus on the unique customisation challenge: to allow multiple data files to be uploaded at the same time.  "
        },
        {
            "text": "Even doing that was easier since we planned ahead – we put extensions in the data management system infrastructure to make it faster to build those customisations.  "
        },
        {
            "text": "Expectations exceeded  "
        },
        {
            "text": "Automated uploads and an improved user interface thanks to our service and content designers made the process easy for our users. This meant a dramatic increase in data quality.   "
        },
        {
            "text": "With this better data, the team can also use the data to support other net zero and decarbonisation initiatives in the department.  "
        },
        {
            "text": "The system we built will be easily configurable to meet future requirements.  And the team got to bring the project in on time, with cost savings and results that exceeded their expectations.  "
        },
        {
            "text": "Learning as we go  "
        },
        {
            "text": "Every time we work with a new policy team on a delivery project there are lessons to learn. Top of the list is always: we should start working together earlier. "
        },
        {
            "text": "One of our ambitions is to have every policy team start talking to us as soon as they start policy development. Connecting policy design to service design from the start is transformative for everyone, especially the service’s users.  We need to think about how we help our policy teams to think about what digital support they need to deliver their work.  "
        },
        {
            "text": "We also got to learn more about how teams may want to use our platform, helping us to plan how we set ourselves up to meet future requests.  "
        },
        {
            "text": "  "
        },
        {
            "text": "Follow us so you don’t miss out on future blogs.  "
        }
    ]
}