{
    "url": "https://space.blog.gov.uk/2025/10/17/nato-allies-gather-in-uk-to-address-dual-use-space-technology-hurdles/",
    "title": "NATO allies gather in UK to address dual-use space technology hurdles",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities"
    ],
    "pub_date": "2025-10-17T15:42:03+01:00",
    "content": [
        {
            "text": "The UK has played host to space experts from across the NATO alliance to address the technical and regulatory challenges in developing dual-use space technology, for both civil and military use. "
        },
        {
            "text": "Held from 6 - 7 October in the historic city of Bath, the NATO Science & Technology Organization (STO), Systems Concepts and Integration (SCI) Panel Research Specialists’ Meeting on dual-use space technology was led by the Defence Science and Technology Laboratory (Dstl) and the NATO alliance, delivered in partnership with the UK Space Agency. "
        },
        {
            "text": "The meeting, co-chaired by Diana Lunca from the UK Space Agency and Dr Thomas Neff from the German Aerospace Centre (DLR), brought together over 140 people from academia, industry and government, as well as international organisations such as the European Space Agency (ESA) and NATO DIANA (Defence Innovation Accelerator for the North Atlantic), to map out the future requirements for NATO space operations - including Space Domain Awareness (SDA), Intelligence, Surveillance and Reconnaissance (ISR), Space Control, Satellite Communications, and In-Space Servicing, Assembly, and Manufacturing (ISAM). "
        },
        {
            "text": "The UK is taking a ‘NATO First’ approach to defence, stepping up on European security by leading in NATO, using innovative technology to boost collective security. Space has been identified by both NATO and the UK government as an operational domain that is a growing site of global competition. "
        },
        {
            "text": "The UK Space Agency supported with the delivery of the event, facilitated workshop sessions and provided expert contributions, including on the National Space Operations Centre (NSpOC) in tracking and identifying space-based threats, and dual-use projects supported through the National Space Innovation Programme (NSIP). "
        },
        {
            "text": "The outputs from the workshops will form a Technical Evaluation Report, that will inform NATO planning for future space technology requirements. "
        },
        {
            "text": "UK Space Agency CEO, Dr Paul Bate, gave the opening keynote outlining the UK’s approach to civil and defence collaboration at a national and international level. Dr Bate, said:"
        },
        {
            "text": "Bharat Patel, Dstl and UK Principal Member for the NATO SCI Panel, said: "
        },
        {
            "text": "Dstl, alongside Defence Science and Technology (DST), lead the UK’s involvement in all NATO science and technology activity, on behalf of the UK government. "
        },
        {
            "text": "The aim of the Research Specialists’ Meeting is to share cutting-edge research and technological advancements in dual-use space technologies and their exploitation. It will foster collaboration among NATO member states and partner organisations, identify and address challenges in the development and deployment of dual-use technologies, and identify future research requirements to be addressed in NATO STO Collaborative Programme of Work (CPOW). "
        },
        {
            "text": "Investing in dual-use technology at both the instrument and platform level can create a virtuous cycle for NATO members – with commercial demand driving innovation, which in turn benefits defence. At the same time, defence requirements push the boundaries of what is possible, creating new opportunities for industry and academia.   "
        }
    ]
}