{
    "url": "https://marinedevelopments.blog.gov.uk/2025/10/17/navigating-change-together-supporting-fishers-processors-and-exporters-ahead-of-new-eu-requirements/",
    "title": "Navigating change together: Supporting fishers, processors and exporters ahead of new EU requirements",
    "authors": [
        "Nicholas Greenwood, Head of Marine Protection and Operational Services, MMO"
    ],
    "categories": [
        "fisheries"
    ],
    "pub_date": "2025-10-17T10:26:26+01:00",
    "content": [
        {
            "text": "The UK seafood industry is no stranger to challenge. From regulatory, to environmental, economic, and market challenges, our fishers, merchants, processors and exporters have consistently shown their resilience and ability to adapt."
        },
        {
            "text": "As we prepare for another significant change - new export documentation requirements under the EU’s Illegal, Unreported and Unregulated (IUU) fishing regulations - I want to acknowledge the scale of what’s ahead and reassure you, MMO is here to support you."
        },
        {
            "text": "What’s Changing?"
        },
        {
            "text": "From January 2026, the EU will introduce mandatory changes to the documentation they require accompanying exports from anywhere outside of the EU, including exports from the UK. These changes will directly affect the information require to create export documentation through the Fish Export Service (FES), including:"
        },
        {
            "text": "Fishers are the first step in the process and have one of the most important roles to play in ensuring a smooth transition, in particular ensuring that the necessary information is passed down the line to allow exporters to meet the new requirements.  Therefore, I want to encourage you to familiarise yourself with these changes now."
        },
        {
            "text": "These updates are separate from the EU Reset announcements made earlier this year and will apply to all exports to the EU, Northern Ireland and a number of other countries. EU importers will be legally required to use the EU CATCH digital system under the same timeframe."
        },
        {
            "text": "If businesses are not ready, they will not be able to export seafood from the UK from January 2026."
        },
        {
            "text": "Our Approach: Phased, Collaborative, Supportive"
        },
        {
            "text": "We understand these changes come at a difficult time. The industry is already facing multiple pressures, and the additional burden of new regulatory compliance is not easy. That’s why MMO, alongside all UK Fishing Authorities, is taking a phased approach, introducing these updates as voluntary fields now to help you prepare gradually."
        },
        {
            "text": "We’re also not just rolling out updates. We’re rolling out support."
        },
        {
            "text": "Join Us: Industry Readiness Webinar – Wednesday 22 October 2025"
        },
        {
            "text": "To help you get ready, we’re hosting our first industry readiness webinar on 22 October. This online session is open to fishers, merchants, processors and exporters and will walk through the upcoming changes, what they mean for your business, and how to prepare."
        },
        {
            "text": "You can also read our dedicated FAQs."
        },
        {
            "text": "Let’s Work Together"
        },
        {
            "text": "We know this won’t be easy. But we also know that by working together with industry, government and all levels in the supply chain, we can make this transition, and our Fish Export Service, smoother. Which is why we’ve set up a research panel to engage with fishers, merchants and exporters so they can help design and implement the changes. Your insights matter and we can you to please sign up to support this work."
        },
        {
            "text": "Your participation in user research helps shape the tools and processes that will support your business."
        },
        {
            "text": "If you have questions or concerns, please don’t hesitate to reach out:  ukiuuslo@marinemanagement.org.uk"
        },
        {
            "text": "Let’s act now, prepare early, and ensure a prosperous future for the UK seafood industry."
        }
    ]
}