{
    "url": "https://gds.blog.gov.uk/2025/10/17/service-meets-innovation-the-digital-veteran-card-is-here/",
    "title": "Service meets innovation: The digital Veteran Card is here",
    "authors": [
        "Natalie Jones OBE - Director of Digital Identity, Government Digital Service"
    ],
    "categories": [
        "GOV.UK One Login"
    ],
    "pub_date": "2025-10-17T13:11:42+01:00",
    "content": [
        {
            "text": "Today marks an important milestone in the government’s digital transformation journey as the digital Veteran Card is launched."
        },
        {
            "text": "This represents more than just a new digital product; it’s the first step in delivering on our vision for a modern and accessible government that works better for everyone, as set out in the Blueprint for Modern Digital Government, published earlier this year. It’s also an important step towards testing and learning from the credentials we’ve developed to pave the way for future functionality."
        },
        {
            "heading": 2,
            "text": "Putting veterans first"
        },
        {
            "text": "The digital Veteran Card allows those who have served our country to prove their veteran status from their smartphone, giving them a faster and more convenient way to access the services, discounts and recognition they’ve earned."
        },
        {
            "text": "For the nearly 2 million veterans across the UK, this means:"
        },
        {
            "text": "And there are benefits for departments, service providers and taxpayers too, as this digital transformation reduces administrative burden, offers quick checking of veteran status, and makes access to services more efficient – ultimately saving taxpayers’ money."
        },
        {
            "heading": 2,
            "text": "Now, next, later"
        },
        {
            "text": "We’ve worked alongside partners at the Ministry of Defence, Office for Veterans’ Affairs and Defence Business Services to develop a digital Veteran card which will work alongside the physical card. When it is first rolled out, the card will be used for in-person transactions only. This means, for example, a veteran could get access to healthcare services, other local authority services and discounts at selected museums and attractions by showing their digital Veteran Card at the ticketing office."
        },
        {
            "text": "We will introduce ways to use the digital Veteran Card online, and enhance in-person verification through automated digital checks, or ‘programmatic checking’ next year, as we add more credentials over time. It’s all part of our approach to deliver value quickly for our users, while building better digital services."
        },
        {
            "heading": 2,
            "text": "Building the foundations for digital government"
        },
        {
            "text": "The digital Veteran Card is the first digitised credential to be stored and shared from the GOV.UK One Login app. It allows users to securely store government-issued documents on their smartphones and use them easily when needed, which represents our vision for a more accessible, user-centred government."
        },
        {
            "text": "As the first digital document to be stored in the GOV.UK One Login app, this paves the way for us to add more credentials over time, and as we expand this functionality we will move to talk about it as the GOV.UK Wallet. Each addition brings us closer to our vision of reducing bureaucracy and creating public services that are more responsive to people’s needs, and it begins with veterans."
        },
        {
            "text": "As the digital Veteran Card is rolled out across the UK, we’re committed to continuous improvement through user testing and feedback. These insights will directly shape future digitised documents, creating an increasingly seamless experience for users."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "For veterans who want to try the digital Veteran Card, go to gov.uk/veteran-card for more information."
        },
        {
            "text": "If you’re an organisation who accepts the physical HM Armed Forces Veteran Card and wants more information on accepting the digital Veteran Card, visit https://www.gov.uk/guidance/champion-the-digital-veteran-card-in-your-organisation."
        },
        {
            "text": "The future of government is digital, secure and accessible – and it’s beginning now."
        }
    ]
}