{
    "url": "https://defraenvironment.blog.gov.uk/2025/10/17/uk-ready-to-support-north-star-for-nature-securing-30-of-land-and-sea-for-nature-by-2030/",
    "title": "UK ready to support North Star for Nature – securing 30% of land and sea for nature by 2030",
    "authors": [
        "Nicky O’Malley"
    ],
    "categories": [
        "30by30",
        "Land use"
    ],
    "pub_date": "2025-10-17T15:37:36+01:00",
    "content": [
        {
            "text": "This is a guest blog post written by Nicky O’Malley, CEO of non-profit 30x30 UK, which is aiming to mobilise business support for the UK’s 30by30 pledge.   "
        },
        {
            "text": "This government is committed to 30by30, our international target to protect 30% of land and sea for nature by 2030. Last year at COP16, Defra published its vision and criteria for delivering 30by30 on land in England. Defra will soon publish its 30by30 action plan, setting out how we can build momentum and bring farmers, National Parks and National Landscapes, eNGOs and others together to deliver on this important target. We will also share more about the role of businesses and green finance, including our partnerships with organisations like 30x30 UK. Achieving this ambitious target will require urgent and significant action to drive nature’s recovery, and all sectors have a role to play.  "
        },
        {
            "text": "The North Star for nature – creating the conditions for nature to thrive  "
        },
        {
            "text": "The UK is at a pivotal moment as we progress towards 2030. 30by30 is not just an ambitious conservation goal. It’s the North Star that our collective support for Nature has been missing. The goal we can all rally behind our environment, our communities, and our economy. "
        },
        {
            "text": "And now, the UK is uniquely positioned to deliver it. "
        },
        {
            "text": "Time is of the essence for moving from pledge to action and thankfully, the opportunity to do so has never been greater. Research continues to show overwhelming public support, and the government has provided criteria aimed to set a clear and consistent way to ensure areas are effectively conserved and managed. For business, this is a huge opportunity to connect with a cause people truly care about and to act as a catalyst in helping to restore our natural world.  Public support is overwhelming "
        },
        {
            "text": "The British public has spoken with a clear, unified voice. New research conducted by independent insight agency Savanta shows the British public is strongly behind 30by30. Support for the goal cut across all 12 regions of the UK surveyed and was consistent across social grades and ethnicities. It’s a rare example of national consensus. "
        },
        {
            "text": "Even more striking, the research showed that people are twice as supportive of businesses that contribute to 30by30 initiatives than of businesses pledging to achieve net-zero by 2050. That’s a powerful signal for brand leaders and sustainability officers alike: support for UK nature restoration is not a niche cause - it’s a mainstream expectation. Nature is tangible; it evokes an emotional connection, and it brings people and communities together. "
        },
        {
            "text": "A clear framework for action "
        },
        {
            "text": "With Defra publishing the official 30by30 criteria for land in England, we have a credible national framework to determine what counts toward the 30% target. Crucially, this means the private sector can now engage with the goal with confidence. "
        },
        {
            "text": "This is a turning point. It provides a structure through which the private sector, landowners and our National Parks and National Landscapes can align their restoration efforts with both national policy and international biodiversity goals.  "
        },
        {
            "text": "The scale of the task "
        },
        {
            "text": "The benefits of achieving the 30by30 goal are enormous, thriving wildlife, healthier soils that store carbon, reduced flood risks, cleaner air, improved food security, and improved well-being for citizens and communities.  "
        },
        {
            "text": "The current reality, however, shows how much work lies ahead. While nearly 25% of land in England is within designated areas like National Parks and National Landscapes, only around 7.1% is currently managed in a way that meets Defra’s 30by30 criteria.  "
        },
        {
            "text": "This gap represents both a challenge and the opportunity. "
        },
        {
            "text": "The role for business "
        },
        {
            "text": "The 30by30 mission requires substantial funding.  "
        },
        {
            "text": "This is where business can become a vital catalyst. 30x30 UK exists to bridge the gap between ambition and action, making it possible for companies to invest in nature with confidence.  "
        },
        {
            "text": "We offer clear pathways for credible action: engaging teams through local volunteering, building operational resilience by supporting nature-based solutions, and aligning with flagship projects to strengthen reputation. This work moves beyond philanthropy; it is about authentic engagement that delivers a return for both nature and business.  "
        },
        {
            "text": "As a business, you want to connect your investment to high-integrity projects, ensuring it contributes directly to a tangible, national movement and is about authentic engagement.  "
        },
        {
            "text": "Kevin Dunckley, Chief Sustainability Officer at HH Global, saw this when his team were given a choice of sustainability projects to fund. He notes, “Overwhelmingly, nature restoration was the clear winner. The ambition of 30by30 captures our hearts and imaginations in a way that other engagements lack.” "
        },
        {
            "text": "Join the mission "
        },
        {
            "text": "The 30by30 pledge represents an extraordinary opportunity.  "
        },
        {
            "text": "We have the clear public mandate, we have the policy framework in place, and we have the global momentum. The next five years will determine the future of UK nature. This is a collective endeavour, and we can all get behind it, government, communities, and business alike. "
        },
        {
            "text": "Find your role in this story. Discover how your organisation can contribute to credible, high-impact nature recovery projects across the UK by getting in touch.  "
        }
    ]
}