{
    "url": "https://actuaries.blog.gov.uk/2025/11/24/climate-change-and-health/",
    "title": "Climate change and health",
    "authors": [
        "Will Stobbs - Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Climate change",
        "Modelling",
        "Mortality"
    ],
    "pub_date": "2025-11-24T14:49:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why the UK needs a cross-government, cross- sector approach"
        },
        {
            "text": "Climate change as a health issue: Climate change is increasingly recognised not just as an environmental or economic challenge, but as a major public health threat. Indeed, the Office for Health Improvement & Disparities have stated that climate change has been identified as “the most important health threat of the century”. The health of the planet and the health of people are inextricably linked; clean air, safe water, and food security are fundamental determinants of wellbeing."
        },
        {
            "text": "The most recent decade (2015–2024) has been 1.24°C warmer than 1961–1990. As the UK’s climate warms, we are witnessing direct impacts on health such as heatwaves, floods, and new patterns of disease as well as indirect impacts mediated through ecosystems, infrastructure and the economy. In 2024 over 5 million potential labour hours (equivalent to £77.9 million) were lost due to extreme heat and insurers paid out a record £585 million for weather-related damages."
        },
        {
            "heading": 2,
            "text": "How climate affects health"
        },
        {
            "text": "Broadly, climate change can harm human health in 2 ways:"
        },
        {
            "text": "The table below summarises some examples of the transmission mechanisms through which climate can impact health:"
        },
        {
            "text": "The web of impacts is wide. Climate change can affect everything from the ambulance that takes a patient to hospital, to the food on our plates, the diseases we must manage and the mental wellbeing of communities. Importantly, many of these risks are interconnected and can also occur simultaneously. "
        },
        {
            "text": "What’s more, health and climate are both issues that cut across traditional spatial, sectoral and temporal boundaries. This necessitates taking a holistic approach, considering the range of interconnections and potential feedback."
        },
        {
            "heading": 2,
            "text": "Why collaboration is essential"
        },
        {
            "text": "No single department or profession can tackle the health impacts of climate change in isolation. NHS England’s latest Health and Climate Adaptation Report underscores this point clearly. In their joint foreword, NHS England’s Acting Chief Sustainability Officer and the Chief Executive of the UK Health Security Agency emphasise that effective adaptation “requires close collaboration across sectors – including industry, local authorities, the NHS, social care, and the communities they serve.”"
        },
        {
            "text": "Taking a systems view is essential if we are to understand the interconnected risks, build resilience across services, and ensure the health system is equipped to protect communities in a changing climate. Moving beyond organisational silos and adopting a genuinely cross-government, cross-sector approach is crucial for several reasons:"
        },
        {
            "text": "A One Health approach recognises that the health of people, animals, and ecosystems are deeply interdependent, and that effective solutions to climate-related health risks must bridge traditional boundaries between sectors and disciplines . By fostering collaboration, One Health enables a more holistic understanding of how climate change drives complex health-related risks. "
        },
        {
            "text": "To deepen our understanding of the links between climate and health, and the partnerships needed to build resilience, GAD is launching a systems mapping project. This initiative will assess, and where possible strengthen, the evidence base needed to quantify the interactions between climate and health to support long-term planning and actuarial analysis around healthy life expectancy and future mortality trends."
        },
        {
            "text": "We are looking to collaborate with others who share an interest in this work. If you’d like to be involved, please contact us at climate.change@gad.gov.uk."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The views expressed are the author’s own and the opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}