{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/24/consultation-opens-on-antenatal-and-newborn-screening-for-fragile-x-syndrome/",
    "title": "Consultation opens on antenatal and newborn screening for fragile X syndrome",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-24T08:40:12+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to antenatal and newborn screening for fragile X syndrome (FXS). "
        },
        {
            "text": "FXS is one of the health conditions the committee reviews regularly for evidence relating to antenatal screening."
        },
        {
            "text": "Evidence maps are typically the first step in the UK NSC process of reviewing evidence and we are asking individuals and organisations to provide feedback on the findings and conclusions of a 2025 evidence map on screening for FXS."
        },
        {
            "text": "This evidence map was commissioned to review literature on the topic published since a 2019 evidence review.  "
        },
        {
            "text": "The 2025 evidence map reaffirms the conclusions of the 2019 review. It therefore concluded that:"
        },
        {
            "heading": 2,
            "text": "About FXS"
        },
        {
            "text": "FXS is the most common inherited cause of intellectual disability and a leading cause of autism spectrum disorder. It results from a genetic mutation that affects brain development and function. Individuals with FXS can have a range of developmental, behavioural, and physical features, including attention and learning problems, anxiety, seizures, and gastrointestinal problems."
        },
        {
            "heading": 2,
            "text": "The latest evidence"
        },
        {
            "text": "The 2025 evidence map identified a low volume of evidence published since the 2019 review. It found: "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}