{
    "url": "https://defraenvironment.blog.gov.uk/2025/11/24/cop30-and-nature-a-moment-for-vision-and-scale/",
    "title": "COP30 and nature: a moment for vision and scale",
    "authors": [
        "Ruth Davis OBE"
    ],
    "categories": [
        "Climate change",
        "Forestry",
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2025-11-24T15:47:05+00:00",
    "content": [
        {
            "text": "COP30 was always going to be a landmark for nature, set against the backdrop of the Amazon river in Belém, the gateway to the world’s largest tropical forest. But beyond the ‘COP in the forest’ headlines, two things made this summit pivotal for those committed to protecting and restoring critical ecosystems. "
        },
        {
            "text": "Brazil’s leadership and bold global coalitions "
        },
        {
            "text": "First, Brazil’s leadership. They are showing what an ambitious, joined-up strategy for nature looks like in one of the world’s most biodiverse countries. Second, the growing momentum among governments, scientists, communities, banks and businesses to deliver big, bold nature solutions. "
        },
        {
            "text": " For Brazil, nature underpins the economy. Forests act as water tanks, providing the rainfall that sustains crops and global commodity supply chains.  This is why so many institutions and communities are united in tackling illegality and deadly wildfires – drivers of forest loss - why Brazil has achieved a 50% cut in deforestation rates in the Amazon in 2023 compared to 2022. "
        },
        {
            "text": "Financing nature at scale "
        },
        {
            "text": "Brazil’s commitment to large-scale nature finance is clear. The Tropical Forest Forever Facility aims to combine public and private capital to create a permanent revenue stream for forest protection. The Resilient Agriculture Investment for net-Zero Land Degradation (also known as RAIZ) initiative uses government’s de-risking capacity to attract billions in private investment to restore tens of millions of hectares of degraded land. "
        },
        {
            "text": "Combined with support for Indigenous and local community enterprises and Brazil’s agricultural innovation, these efforts are building a thriving bioeconomy; sectors based on sustainable use of biological resources. This offers huge economic opportunities not only for Brazil but globally, including the UK, with our strong tradition of life-sciences and technical innovation. "
        },
        {
            "text": "The UK’s role in driving action "
        },
        {
            "text": "The UK matters in this story. We have quietly and consistently partnered with Brazil to help launch many of these ideas - from early-stage investments in community businesses, to capacity building and policy support for financing mechanisms and research collaborations on forest carbon monitoring and bio-fertilisers. The UK has also helped to keep forests on the agenda through our co-chairing of the Forests and Climate Leaders Partnership. "
        },
        {
            "text": "COP30 showcased the UK’s role in advancing the global ‘nature actions agenda’. For example, the summit saw the launch of the biodiversity credits policy forum, with Indonesia as a founding member and strong interest from other countries seeking frameworks to attract private investment in nature. "
        },
        {
            "text": " We also celebrated the UK’s long-standing partnership with the Congo Basin region, joining a Call to Action, to ensure the world recognises the importance of Congo’s forests and funds solutions developed by Congolese institutions and communities.  "
        },
        {
            "text": "Championing Indigenous leadership "
        },
        {
            "text": "Underpinning all this work is the courage, commitment and knowledge of Indigenous Peoples and local communities (IPLCs). It was vital to join them in marking Phase 2 of the Indigenous Peoples Pledge, building on commitments first made at COP26, and to applaud forest governments for pledging a major increase in tenure-secured Indigenous lands. "
        },
        {
            "text": "Looking ahead: scaling solutions "
        },
        {
            "text": "Across COP30, I saw evidence of UK engagement, technical expertise and partnership; something of which we can all be proud of.  But this is only the start. We must deliver, including for the Congo and IPLCs. We must do more, for example: work with small island states and vulnerable coastal regions to scale the blue economy.  Build on UK agricultural research to create sustainable, resilient food systems worldwide. "
        },
        {
            "text": " There is much to do, but also much to build on - including the dedication of brilliant people across the UK who work tirelessly to protect and restore our fragile, natural world. It was a pleasure to witness that work, and a privilege to represent it. "
        }
    ]
}