{
    "url": "https://gds.blog.gov.uk/2025/11/24/gds-local-goes-live/",
    "title": "GDS Local goes live",
    "authors": [
        "Liz Adams, Service Owner, GDS Local, GDS",
        "Theo Blackwell, Local Government Champion, GDS Local, GDS"
    ],
    "categories": [
        "Digital Centre",
        "Digital engagement",
        "Digital strategy",
        "Digital, Data and Technology",
        "GDS team",
        "GOV.UK",
        "GOV.UK One Login"
    ],
    "pub_date": "2025-11-24T09:15:00+00:00",
    "content": [
        {
            "text": "On 22 November we launched GDS Local: a new specialist unit in the Government Digital Service (GDS) focused on working with and alongside local government to deliver the ambitions we set out in the blueprint for a modern digital government. "
        },
        {
            "text": "Historically, there has been limited engagement between GDS and local authorities in transformation efforts. The blueprint for a modern digital government represents a new chapter - one that recognises digital transformation must work across all levels of government to truly serve citizens. That’s why GDS Local is focused on digital collaboration between central and local government, ensuring local needs are reflected in national digital strategy and delivery."
        },
        {
            "heading": 2,
            "text": "The challenge for local government"
        },
        {
            "text": "Local authorities deliver services that people use day in and day out. When people interact with the government, it's very often through their local council. People’s expectations of services are rightly high. However, councils are limited by a local government technology market that doesn’t support their needs. Local councils across the UK are demonstrating the power of digital innovation by using AI tools and creating services that deliver better outcomes for residents. For example:"
        },
        {
            "text": "Other councils are harnessing data to protect residents: "
        },
        {
            "text": "These approaches are ready to expand to other regions and, with the right support, could transform communities everywhere. The State of Digital Government Review found £45 billion per year of unrealised productivity benefits across the public sector, with a substantial portion in local government. "
        },
        {
            "heading": 2,
            "text": "The opportunity for transformation "
        },
        {
            "text": "Our engagement with over 300 local government digital practitioners between January and April 2025 confirmed the desire for digital transformation and leadership across local government, but also the need for the right platforms, partnerships, and support. The Local Government Association’s successful AI network already demonstrates the power of collaboration and shared expertise."
        },
        {
            "text": "GDS Local will be the strategic link between local government and the digital centre, working with the Ministry for Housing, Communities and Local Government (MHCLG) - building on the foundations already laid by the Local Digital team and the new Artificial Intelligence Directorate - and the Local Government Association (LGA) to give local government teams the support they need to focus on what they do best: understanding local needs and designing services that work for their communities. "
        },
        {
            "text": "This isn't about imposing central government solutions, but about collaboratively extending proven platforms and expertise: bringing in the invaluable skills and experience local government teams bring to the table and addressing problems at scale that individual councils cannot resolve alone. "
        },
        {
            "text": "Alongside this, we are already strengthening collaboration through initiatives like the Government Digital and Data Hub - a new online space bringing together learning, careers, collaboration and community for digital and data professionals across the UK public sector, including in local government. The Hub provides access to world-class learning opportunities, from cutting-edge AI courses to insightful webinars and certifications that build skills and confidence - including flagship programmes such as Get Tech Certified. It supports our shared ambition to grow a more connected, capable and confident digital workforce across central and local government, improving services for the people we serve."
        },
        {
            "text": "The newly established GDS Local will address specific challenges in 3 critical areas:"
        },
        {
            "heading": 2,
            "text": "What to expect in the coming months"
        },
        {
            "text": "This new team, working closely with the LGA, MHCLG, and councils will help identify future needs and ensure local government is part of our innovation pipeline. We've already started with pilots of Minute and Extract in i.AI, MHCLG's discovery work on GOV.UK One Login, and by the end of the year we’ll start work with councils to identify the top use cases for GOV.UK app. This will mean a more seamless way for citizens to access local services directly."
        },
        {
            "text": "We’ll also be hosting webinars and workshops to engage with councils and technology vendors, co-designing a strategic vision that will act as a template for a local government technology stack capable of delivering modern public services, which you can read more about here.  "
        },
        {
            "text": "We strive to be collaborative, innovative, and catalytic in tackling real challenges faced by citizens. Our approach includes a range of initiatives, such as engagement forums and hackathons, to generate solutions in real time. Building on the success of our first local innovation hackathon earlier this year, we are excited to hold a second event on 26–27 November, focused on homelessness, rough sleeping and temporary accommodation."
        },
        {
            "text": "When GDS and local government work together effectively, we can overcome individual technical barriers, giving local teams more time to improve the vital services communities rely on. "
        },
        {
            "heading": 3,
            "text": "For local councils"
        },
        {
            "text": "If you work for a local council and want to get in touch, contact us at GDSLocal-info@dsit.gov.uk. Alternatively, you can register your interest to hear more by completing this form.  "
        },
        {
            "text": "Find out more about GDS Local on GOV.UK."
        }
    ]
}