{
    "url": "https://buyingforschools.blog.gov.uk/2025/11/24/growing-greener-citizens-our-sustainability-journey-at-goldsmith-primary-academy/",
    "title": "Growing greener citizens: Our sustainability journey at Goldsmith Primary Academy",
    "authors": [
        "Jennie Twells, Assistant Headteacher and sustainability lead, Goldsmith Primary Academy"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2025-11-24T09:34:20+00:00",
    "content": [
        {
            "text": "Goldsmith Primary Academy sustainability lead and assistant head Jennie Twells explains how growing greener citizens is also helping to save her West Midlands-based trust money."
        },
        {
            "text": "At Windsor Academy Trust (WAT) one of our ambitions is to become one of the most sustainable school trusts in the country – and I like to think Goldsmith Primary is leading the way."
        },
        {
            "text": "We have taken a proactive approach to environmental awareness that is baked into our curriculum, estate management and involves our wider local community."
        },
        {
            "text": "Things were different when I joined Goldsmith three and a half years ago and I was given the role of sustainability lead. I didn't really know what that meant. I'd been a subject lead before - English, maths, science - tangible, measurable subjects where you can prove success through data and assessments. With sustainability, I didn't really know what I was doing."
        },
        {
            "text": "However, WAT had started its sustainability journey in 2020 and all of the directors and my trust colleagues were, and remain, very supportive of me and all school sustainability leaders."
        },
        {
            "text": "There is also a lot of guidance and support out there from the Department for Education (DfE) and other sources to get you started. The first step I took was applying for an Eco School Green Flag award starter pack, which set us on the way to developing and putting in place our climate action plan."
        },
        {
            "text": "We also recruited a group of pupil eco-warriors, at least one from each class, and we all started thinking about ways in which we could make our school run more sustainably."
        },
        {
            "heading": 4,
            "text": "Digital transformation and energy savings"
        },
        {
            "text": "Over the course of the year, as a trust, we went paperless. All our learning is done digitally. Every child has a personal device; we only use books and paper when it is really necessary and has educational impact. Beyond that, everything is done on a digital learning platform, which has reduced our paper wastage dramatically."
        },
        {
            "text": "We also had solar panels installed on our roof to help with our energy usage. I have a dashboard on my desktop that tells me minute by minute the energy usage of our building - when it peaks, when it dips, when we're using too much and how we can reduce energy usage across the school at certain points during the day."
        },
        {
            "text": "That's something my eco-warriors take on board - they go around school telling people to turn lights off and turn taps off. They are there to make sure that the teacher is turning off the whiteboard at lunchtime, they'll go around the corridors at break times and make sure that computer screens are turned off – just the little things that all add up."
        },
        {
            "text": "With more than 700 tonnes of CO₂ saved, 1.35m kWh of clean energy generated and more than £200,000 of annual energy savings to date trust wide, we are certainly playing our part in creating a more energy efficient organisation and reducing costs."
        },
        {
            "heading": 4,
            "text": "Bringing learning to life through growing"
        },
        {
            "text": "Another key aim was to increase the biodiversity across our site while educating pupils in the benefits of this. Our school lies across a huge site in Walsall but it's very grey - we're in a very deprived area and there's not a lot of greenery around. Most of the pupils don't have outdoor spaces at home."
        },
        {
            "text": "We’ve made extensive use of the DfE-supported National Education Nature Park platform. Its curriculum-aligned resources have helped us deliver engaging sustainability lessons across subjects, and the digital mapping tools allow us to track and enhance the biodiversity of our school grounds."
        },
        {
            "text": "Some of the activities we’ve undertaken have included:"
        },
        {
            "text": "The aim is to develop the allotment into a kitchen-garden facility, providing fresh grown food that can be cooked and eaten at our after-school club."
        },
        {
            "text": "We take lessons straight from the National Education Nature Park website because it's very straightforward and accessible for EYFS, Key Stage 1 and Key Stage 2 pupils. It's brilliant - and it's all resourced as well. Sustainability lessons are now timetabled across our curriculum on a weekly and bi-weekly basis."
        },
        {
            "text": "ClimateEd has also delivered weekly workshops about climate change to our Year 5 students with an immense impact on the pupils’ understanding of how to be greener citizens. These children will be our lead eco-warriors next year."
        },
        {
            "heading": 4,
            "text": "Building local partnerships and supporting our community"
        },
        {
            "text": "What's lovely is how this has become a real community project. When I needed about three tonnes of soil for the planters, one of the dinner ladies got in touch with her husband, who got in touch with a builder who had just removed a load of soil from somebody's back garden. The soil was delivered during the weekend completely for free, voluntarily."
        },
        {
            "text": "Staff have also brought in plants and produce from their own gardens to be planted in school and we have established strong links with Goscote Greenacres Community Gardens, a local not-for-profit company that helped us plant a wildflower border around the perimeter of the school field."
        },
        {
            "text": "We run a Sustainability Swap Shop where children donate their old uniform at the end of the year so it can be re-used. People have really benefited from that, both money-wise and sustainability-wise."
        },
        {
            "text": "We work in partnership with Food for Life to ensure our school canteen works as sustainably as possible - sourcing food from local suppliers and reducing waste through natural waste recycling. We have also reduced our plastic waste by using compostable vessels for any food we possibly can."
        },
        {
            "text": "Sustainability is showcased annually at our WATCOP event, where pupils and staff across the trust come together to create a climate action plan and students take part in various sustainability workshops. Teachers from Goldsmith have volunteered their time to create eco-systems, help children understand what an eco-system needs and encouraged them to build their own in their own environment at home. "
        },
        {
            "text": "Sustainable practice is now embedded in what we do. The children feel passionately about it. We're not doing this just because the government says we have to; we're doing it because we want our children to be greener citizens of the future. I want every child to leave this school knowing how to make the right choices when it comes to looking after our community and our planet."
        },
        {
            "text": "Read the DfE’s sustainability leadership and climate action plan information now for help on your school or trust’s sustainability journey."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ at the top right of this page to subscribe to our blog and receive notifications when we next post.  "
        }
    ]
}