{
    "url": "https://medregs.blog.gov.uk/2025/11/24/innovative-approaches-to-med-tech-regulatory-reform/",
    "title": "Innovative approaches to Med Tech regulatory reform",
    "authors": [
        "Joseph Burt"
    ],
    "categories": [
        "AI Airlock",
        "designated standards",
        "Health Institution Exemption",
        "Med Tech Regulations",
        "Medical Devices"
    ],
    "pub_date": "2025-11-24T15:31:52+00:00",
    "content": [
        {
            "text": "Well, hello again.  Hasn’t time passed by so quickly since my last blog in September. At the MHRA, we have many exciting and pioneering initiatives underway. I was listening to a medical device podcast recently and the podcast host proclaimed the MHRA as being ‘very innovative with their approaches’.  It bought a smile to my face and made me ponder what else we could do to be really innovative in our work to improve medical device regulations so that they deliver for patients and drive growth in the sector."
        },
        {
            "text": "Let me share with you one way we are embracing AI technologies to help deliver our work and ambitions. In the innovative devices team, one of my colleagues collaborated with the MHRA’s Digital and Technology team to develop a chatbot that we now use internally. This clever bit of kit uses large language models to interrogate and provide an initial response to enquiries, drawing on a rich history of previous answers. At the moment, we’re only using it within the team in an active trial where we closely check the responses before going back to the enquirer. My hope is that, after plenty of thorough testing, we’ll eventually be able to share this chatbot more widely with people looking for clarity on published guidance from the MHRA."
        },
        {
            "text": "On a broader note about AI, I was genuinely delighted to attend our AI Airlock phase 2 launch in Westminster in October. I had the opportunity to learn about some truly ground-breaking technologies from Tortus, Numan, Panakeia, Octopath, NHS England, Deep X AI, and Eye2Gene. It’s fair to say I’m looking forward to seeing the outcomes from this phase of the Airlock, because I can already see the huge opportunities these technologies will bring to healthcare – both now and in the future. I’d like to take a moment to personally thank all the representatives from these organisations for the innovative work they’re doing to pave the way for effective and proportionate regulation of transformative AI technologies. And, of course, a heartfelt thank you to the AI Airlock team for being the modern explorers, bravely navigating the future of AI in MedTech. More information is available in our recent AI Airlock blog."
        },
        {
            "text": "Now, putting AI aside for a moment, let me tell you about the progress we're making towards publishing updated guidance for Health Institution Exempted devices. If you’ve been following my blogs, you’ll remember that many NHS organisations are already making good use of this exemption for medical devices and IVDs. Over the summer, we sent out a questionnaire, and I’m genuinely grateful for the 137 responses we received during August and September. A huge thank you to everyone who took the time to share their thoughts – your input will help us shape better guidance in this area."
        },
        {
            "text": "If you’re interested in delving into the details, take a look at the published survey analysis. From all the feedback we’ve received, there are  five areas where health institutions need more information, and we intend to update guidance in the following areas: adopting a robust Quality Management System and following international standards; making sure there’s proper oversight of manufactured devices with good record-keeping and clear identification; proving that devices meet all relevant essential requirements; and keeping technical documentation up-to-date to show compliance and safety."
        },
        {
            "text": "We’re also planning to tidy up some of the definitions in the guidance and remove phrases like ‘in-house manufactured’, which can cause confusion. Keep an eye out for our refined guidance in the coming weeks - I'm excited to share it with you."
        },
        {
            "text": "Speaking about surveys, you might remember that we recently ran another survey focused on Designated Standards. I want to extend a second heartfelt thank you to everyone who took part – your feedback has been genuinely invaluable. Thanks to your input, we’re planning to update the designated standards list, starting with those standards that are most critical. We’ll be rolling these changes out gradually, with the first set of updates expected in late November or early December. Looking further ahead into 2026, the MHRA, together with the Department of Business and Trade, will keep refining the designated standards lists to ensure they stay in step with changing regulatory needs. We are developing a new internal process to make sure the list remains responsive to the emergence of new and updated standards, which is especially important as medical technologies continue to evolve at pace. So, thank you again for helping us shape a system that keeps up with innovation and supports everyone working in this vital field."
        },
        {
            "text": "Let me give you a heads-up about a couple of important things coming up in December and early in the new year. We are making good progress on our Pre-market statutory instrument for medical devices, and we thank our network of Trusted Advisers for your input on recent drafts. The next milestone in the regulatory journey of this piece of legislation is notifying the World Trade Organization of the draft text. As soon as this has been published, we’ll be asking for feedback on the costs to businesses of implementing this regulation, so that we can develop an Economic Impact Assessment which will be required when this regulation is laid in Parliament. We’ll be calling for your feedback at that point – again it will be highly valued. We’ll also be launching a consultation on the proposal to indefinitely recognise CE marked medical devices – something I know many of you are keenly interested in. I’ve heard from so many people just how much anticipation there is around both of these topics, so rest assured we’ll be sharing more details with you as soon as we get closer to publication. Stay tuned!"
        },
        {
            "text": "Before I wrap up this month’s blog, I’d like to take a moment to share a few personal reflections with you. You know, people rarely ask me what truly inspires me in my work. Not long ago, a podcast interviewer asked me about my career journey to the MHRA, and it prompted some genuine soul-searching. When I thought about it, my answer was straightforward: what drives me is the privilege to serve our country in my own way – by helping bring innovative medical devices and diagnostics to all of us, with the goal of sustaining or improving lives. That’s what really inspires me every day. So, let me turn the question to you: what is it that inspires you in your own work?"
        },
        {
            "text": "Until the next blog post, keep safe, keep well and keep smiling."
        }
    ]
}