{
    "url": "https://civilservice.blog.gov.uk/2025/11/24/mission-moments-cutting-through-complexity-how-were-backing-britains-businesses-to-grow/",
    "title": "Mission Moments: Cutting Through Complexity: How We're Backing Britain's Businesses to Grow",
    "authors": [
        "Manisha Gohil"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-11-24T13:53:35+00:00",
    "content": [
        {
            "text": "From 70 stakeholder sessions to 1,200 partner inductions, one civil servant shares how the new Business Growth Service is turning government support for SMEs from a maze into a motorway – and why every simplified application brings us closer to kickstarting economic growth."
        },
        {
            "text": "At a recent event, I met a self-employed electrician who felt completely lost navigating government support for business. Within an hour, I’d walked him through our new Business Growth Service platform. He accessed tailored advice through his local Growth Hub, secured a grant, and started bidding for public contracts. Small intervention, big change, and exactly why this work matters."
        },
        {
            "text": "I’m Manisha Gohil, Senior Policy Advisor on implementation in the Department for Business and Trade’s Business Growth Service team. My job is helping Britain’s 5.5million small and medium sized enterprises (SMEs) access tools, funding and advice they need to start, grow and succeed."
        },
        {
            "text": "The problem we’re solving"
        },
        {
            "text": "Picture running a café in Carlisle or a tech startup in Cardiff. You know government support exists, but finding it feels like navigating a maze blindfolded. That frustration, the runaround, the wasted hours was holding back too many businesses from growing. When small businesses thrive, communities prosper and living standards rise. But complexity was getting in the way."
        },
        {
            "text": "Building something better"
        },
        {
            "text": "Launched in July 2025 as part of 'Backing your Business: Our Plan for SMEs',  business.gov.uk creates a single front door. Firms can access everything from leadership training to finance, as well as mentoring and management support, including trusted programmes like Help to Grow."
        },
        {
            "text": "Since March, I've been working directly with the people who support businesses every day. Over 70 stakeholder consultations later, we've designed something that works for real businesses in real situations. We've inducted more than 1,200 people from 35 partner organisations, including growth Hubs in England, and colleagues in Scotland, Wales and Northern Ireland, ensuring everyone delivers consistent support."
        },
        {
            "text": "My biggest challenge? Balancing SMEs ambitions with limited resources whilst changing the narrative that government help is slow and irrelevant. Many businesses still don’t know where to start and trust peer recommendations over official channels. Once they engage though, they’re often surprised by how practical and personalised the support actually is."
        },
        {
            "text": "Why this matters"
        },
        {
            "text": "This isn't just about tidying up websites. It's about kickstarting economic growth from the ground up. Every hour a business owner saves navigating government support is an hour spent building their dream. Every clear pathway to Help to Grow: Management is a potential step-change in how a business operates. Every simplified application removes a barrier to growth."
        },
        {
            "text": "We’re contributing directly to raising living standards across every part of the UK; a core government mission. When we reduce admin burden while providing clear routes to trusted programmes, we create the conditions for businesses to innovate, create jobs and drive our economy forward."
        },
        {
            "text": "What’s next"
        },
        {
            "text": "We're building a genuinely connected, pro-business environment where SMEs can focus on what they do best. Seeing firms benefit from clearer, joined up support makes every stakeholder session worthwhile."
        },
        {
            "text": "My advice to any SME? Don’t wait for a crisis. Explore support early through business.gov.uk. It’s easier than you think and could make all the difference."
        },
        {
            "text": "Want to know more about the Business Growth Service? Visit business.gov.uk"
        }
    ]
}