{
    "url": "https://defraenvironment.blog.gov.uk/2025/11/24/projects-for-nature-celebrates-a-major-step-towards-mobilising-private-finance-into-nature/",
    "title": "Projects for Nature celebrates a major step towards mobilising private finance into nature ",
    "authors": [
        "Helen Edmundson"
    ],
    "categories": [
        "Green finance",
        "Nature"
    ],
    "pub_date": "2025-11-24T09:22:19+00:00",
    "content": [
        {
            "text": "Following the success of the Projects for Nature pilot, which saw private sector companies award more than £700,000 to nature recovery projects across England, we are delighted to announce the next chapter of programme with SpaceHive leading the platform.  "
        },
        {
            "text": "Building on the work led by The Council for Sustainable Business, Defra, Environment Agency, Natural England, Accenture and Crowdfunder, Spacehive will scale up the online platform. This will help boost corporate donations from the private sector to create bigger, better, and more joined-up spaces for nature. "
        },
        {
            "text": "The evidence is clear that greater access to the natural world can improve both our mental and physical health. Additionally, increasing our societal connection with our landscapes and wildlife can actively improve outcomes for nature in areas where people live and work.  "
        },
        {
            "text": "And that’s why Projects for Nature will continue to play a vital role in supporting our health and protecting our communities up and down the country.  "
        },
        {
            "text": "For more information on Projects for Nature, read our first blog post.  "
        },
        {
            "text": "Learning from the pilot   "
        },
        {
            "text": "Over the past two years, Projects for Nature has connected businesses and donors with nature recovery projects. Projects on the platform are screened by Defra, Natural England and the Environment Agency, helping to ensure that funding aligns with national and local environmental priorities.  "
        },
        {
            "text": "The platform is part of a much broader government effort to stimulate private funding for nature. It offers a credible funding route that complements emerging nature markets like Biodiversity Net Gain, supporting businesses to meet critical commitments not addressed by these markets. Rather than offsetting environmental harm, it enables companies to support additional, high-quality nature recovery projects. "
        },
        {
            "text": "The pilot has also provided valuable insight into business’ motivation in funding nature recovery. What we have discovered is:   "
        },
        {
            "text": "Overall, it is clear from the pilot that business leaders valued the abundance of nature projects to choose from. "
        },
        {
            "text": "The next phase for Projects for Nature "
        },
        {
            "text": "As the programme moves forward, we will be learning from Spacehive’s sector expertise as they lead the creation of a refreshed platform that can meet the needs of both businesses and project suppliers, to scale-up the success of Projects for Nature.   "
        },
        {
            "text": "Misha Dhanak, CEO of Spacehive, said: "
        },
        {
            "text": "“The UK business community increasingly recognises its responsibility to deliver towards nature recovery projects, but challenges remain around where to find the right projects and how to fund them.  "
        },
        {
            "text": "Spacehive offers a swift and tangible way to overcome those barriers, building on the brilliant foundations laid during the pilot phase.  "
        },
        {
            "text": "Our experience supporting nature recovery projects across the UK has shown just how transformative connecting businesses with nature initiatives and local communities can be, turning good intentions into measurable, lasting impact. We look forward to seeing the positive changes and thriving spaces that Projects for Nature will bring.” "
        },
        {
            "text": "If you are interested in championing nature across landscapes in England, follow our LinkedIn page for the most up-to-date information and reach out to the team via our website.  "
        }
    ]
}