{
    "url": "https://forestrycommission.blog.gov.uk/2025/11/24/ready-set-plant-for-a-future-filled-with-trees/",
    "title": "Ready, set, plant! For a future filled with trees",
    "authors": [
        "Asia Aldridge"
    ],
    "categories": [
        "Tree planting",
        "Woodland Ambassadors",
        "Woodland creation"
    ],
    "pub_date": "2025-11-24T09:00:00+00:00",
    "content": [
        {
            "text": "Across England, an inspiring movement is taking root as farmers, landowners, nurseries and businesses are all busy creating tomorrow’s woodlands!"
        },
        {
            "text": "Tree planting season is a time when conditions are just right for planting. The ground has good levels of moisture, saplings are dormant but primed for growth and months of planning can lead to action."
        },
        {
            "text": "At the forefront of this movement are our passionate Woodland Ambassadors, who are making a difference across the country. Their woodland creation projects tell a story of a landscape being transformed, with a future filled with trees. Some are creating new wooded habitats for nature to thrive, while others are reconnecting ancient woodlands that have stood apart for decades."
        },
        {
            "text": "Here are just a few of the inspirational tree planting projects taking place up and down the country, being led by some of our dedicated Woodland Ambassadors."
        },
        {
            "heading": 2,
            "text": "Bradford Estates' ambitious tree planting journey"
        },
        {
            "text": "In the West Midlands, a new 15km walk offering access to both historic and newly created woodlands has opened to the public, thanks to the efforts of the Bradford Estates team. Under the direction of Managing Director Alexander Newport, 195,000 trees have been planted, creating an impressive 240 acres of new woodland."
        },
        {
            "text": "The newly created Bradford Walk grants access to hundreds of acres of previously private and historical woodlands across the estate. The new and existing paths also create one of England’s longest new permissive public paths under the England Woodland Creation Offer (EWCO)."
        },
        {
            "text": "Over the next 10 years, Bradford Estates aim to increase woodland cover across its land to 20% – equating to 2,400 acres of woodland, with a view to capture carbon to help contribute towards the UK’s net zero targets. This includes imminent plans to plant 52 acres of new woodland on land at Church Eaton."
        },
        {
            "text": "Alexander Newport, Managing Director of Bradford Estates, says:"
        },
        {
            "heading": 2,
            "text": "Ground Control's journey to large scale woodland creation"
        },
        {
            "text": "In north Essex, Nature Recovery Director at Ground Control, Chris Bawtree, is the driving force behind the creation of a large-scale woodland."
        },
        {
            "text": "Last winter, Chris and the team completed the planting of Wildfell Centre for Environmental Recovery – that included a new 50-hectare woodland – representing the largest nature recovery project in the organisation’s 50-year history."
        },
        {
            "text": "This site weaves together wildflower meadows, freshwater ponds, hedgerows and a traditional orchard that offer vital wildlife habitats and corridors. The site includes a habitat bank that incorporates 22 hectares of ancient woodland restoration, further supporting nature and biodiversity.  "
        },
        {
            "text": "Chris and the team wanted to find as many sustainable revenue sources as possible to make tree planting at this scale a reality. They secured funding from EWCO to cover planting and establishment costs, while registering the woodland with the Woodland Carbon Code (WCC). The site is predicted to generate 14,000 carbon credits, which can be sold or used to offset their business’ emissions."
        },
        {
            "text": "Looking ahead, the team are exploring how emerging markets might support projects like theirs. They’re developing separate biodiversity net gain focused areas, planning to capture emerging payments for natural flood prevention, improvements to water quality and other ecosystem services as these markets evolve."
        },
        {
            "text": "Chris Bawtree, Nature Recovery Director at Ground Control, says:"
        },
        {
            "heading": 2,
            "text": "The Grower – a pioneering bareroot tree and hedging nursery"
        },
        {
            "text": "On the outskirts of St Agnes in Cornwall, Inez Williams-King and husband Chris help run Presingoll Farm, a family run farm that practices regenerative farming."
        },
        {
            "text": "Drawing on their experience in the tree nursery and landscape industries, the pair decided to seize the opportunity to introduce tree production into the farm’s crop rotation. This led to the launch of The Grower – a bareroot tree and hedging nursery.  "
        },
        {
            "text": "The couple now grow close to two million trees a year and are one of the largest growers of beech in the UK. They grow high-quality bareroot trees at large scale, but in an ecologically sensitive way."
        },
        {
            "text": "Inez and Chris were able to secure funding from the Tree Production Capital Grant and the Farming Equipment and Technology Fund to help establish their tree nursery and purchase essential equipment."
        },
        {
            "text": "The nursery supplies trees to large wholesalers and forestry companies, as well as small and often local landowners. They have planted 5,000 trees since 2021 in unproductive parts of the farm equating to 2.5 hectares of woodland across the 80-hectare mixed farm site, with a view to plant another 5,000 trees across an agroforestry scheme in 2025/26. The Grower have sold 1,750,000 trees as of May 2024, and 58,856 trees have been planted across Cornwall and the south-west."
        },
        {
            "text": "Chris King, Managing Director at The Grower, says:"
        },
        {
            "heading": 2,
            "text": "Newhouse Farm's tree planting ambition for regenerative farming"
        },
        {
            "text": "Andy Bason, Matt Johnson and Sam Ward run Newhouse Farm, which spans 800-hectares of farmland in Hampshire. Their goal is to reduce carbon emissions and enhance biodiversity through tree planting, whilst maintaining combinable crops such as wheat, barley, oats, oilseeds, peas and beans, as well as keeping a range of livestock."
        },
        {
            "text": "Newhouse Farm has 70 hectares of existing woodland, and the trio has planted a further 12.2 hectares of new woodland. The woodland is managed to produce wood and woodchip to heat five houses and various commercial units. They have a 10-year woodland management plan to make the most of the natural resources they have available to them to ensure the farm’s longevity."
        },
        {
            "text": "To create the new woodland, Newhouse Farm secured funding through the Woodland Creation Planning Grant (WCPG) and EWCO. The farm received over £66,000 to cover capital items and will receive over £72,000 in annual maintenance payments over 15 years to ensure successful tree establishment. The farm has also benefitted from a one-off additional payment of £20,000, in recognition of the woodland’s positive contributions to biodiversity and water quality."
        },
        {
            "text": "Before planting, the Newhouse Farm team registered for the WCC. This means the farm can generate long term income if they choose to sell the predicted 3,482 carbon units the woodland stands to make."
        },
        {
            "text": "Together, the Newhouse Farm team champion regenerative agricultural practices, and have developed a trial of agroforestry strips. This has involved planting trees for timber and fruit crops alongside their arable rotation, which has helped to further diversify the farm business."
        },
        {
            "text": "Andy Bason, Farm Manager at Newhouse Farm, says:"
        },
        {
            "heading": 2,
            "text": "High Meadows Farm's tree planting vision"
        },
        {
            "text": "Terry and Tracy Featherstone run High Meadows Farm in south-west Durham. After inheriting the family farm, they decided to transform it into a green energy hub and convert 14 hectares of their farm into woodland."
        },
        {
            "text": "To realise their tree planting vision, Terry and Tracy applied to the WCPG to help cover the costs of scoping and designing High Meadows Wood. This then led to the couple applying to the EWCO grant – to help cover planting and establishment costs for 20,000 mixed broadleaf trees."
        },
        {
            "text": "High Meadows Wood enhances the landscape and enriches local biodiversity and nature, and there has been a noticeable increase in the variety of insects and birds that have since returned. Permitted public access to the woodland benefits the local community, and the couple received additional stackable payments for the woodland’s positive contributions to nature recovery and people’s wellbeing."
        },
        {
            "text": "Having registered their woodland with the WCC and working with Forest Carbon, Terry and Tracy have buyers for the 4,400 carbon credits the woodland is predicted to make. The couple are committed to sustainable practices and conservation, to continue to benefit nature, people and the planet."
        },
        {
            "text": "Terry and Tracy Featherstone, owners of High Meadows Farm, say:"
        },
        {
            "heading": 2,
            "text": "It's time to turn over a new leaf"
        },
        {
            "text": "As the season gets underway, there’s never been a better time to join this growing movement. The months between November and March offer the perfect window – when trees are dormant and less likely to be damaged during planting."
        },
        {
            "text": "Now is the perfect time to start thinking about the next tree planting season. Whether you’re considering planting a small copse or a large landscape-scale project, there are grants available to help support your tree planting ambitions. The Woodland Creation Planning Grant helps you to design your woodland, while the England Woodland Creation Offer provides funding for planting and establishment."
        },
        {
            "text": "Tree planting season offers you the opportunity to create new woodland and to leave behind a living legacy that grows more with each passing year."
        }
    ]
}