{
    "url": "https://space.blog.gov.uk/2025/11/24/wisdom-of-the-trail-nine-years-of-uk-innovation-to-reach-orbit/",
    "title": "\"Wisdom of the Trail\": Nine years of UK innovation set to reach orbit",
    "authors": [
        "Lacuna Space"
    ],
    "categories": [
        "Satellites"
    ],
    "pub_date": "2025-11-24T11:12:10+00:00",
    "content": [
        {
            "text": "As we prepare to launch our “Wisdom of the Trail” satellites at Lacuna Space, we reflect on nine years of quiet innovation and UK-grown collaboration that helped shape a new era of satellite IoT."
        },
        {
            "text": "On 26 November 2025, we will launch four new satellites under our Wisdom of the Trail mission banner. These spacecraft will be our most capable yet, and the world’s most advanced satellite IoT gateways, marking another milestone in a nine-year journey that began with a sketch and a belief that small devices on the ground could one day talk directly to satellites."
        },
        {
            "text": "Lacuna Space co-founder and CEO, Rob Spurrett said:"
        },
        {
            "heading": 2,
            "text": "A trail of innovation"
        },
        {
            "text": "That spirit of exploration runs through our story and even our mission names. Inspired by Jack London’s tales of frontier adventure, Wisdom of the Trail follows earlier missions such as Call of the Wild. They reflect our focus on discovery and perseverance: searching for signals in the world’s most remote places - not for gold, but for data."
        },
        {
            "text": "Our technology enables small, battery-powered sensors to send messages directly to orbiting satellites using low-power, wide-area connectivity based on LoRa® technology. These “whispers from the wild” allow farmers, environmental scientists, and utilities to monitor soil, water and infrastructure in areas far beyond the reach of mobile networks."
        },
        {
            "heading": 2,
            "text": "Doing things differently"
        },
        {
            "text": "From the outset, we took an unconventional approach to building a space business. Rather than manufacturing satellites, we focused on developing payload technology and a network concept that others could adopt."
        },
        {
            "text": "Spurrett adds:"
        },
        {
            "text": "Several UK start-ups gained their first commercial opportunities through our missions, many of which have since grown into established players in the space sector."
        },
        {
            "heading": 2,
            "text": "Learning from experience"
        },
        {
            "text": "Some of our earliest experiments involved high-altitude balloon flights to test how unlicensed radio frequencies behave at extreme ranges."
        },
        {
            "text": "Those tests broke records for long-distance IoT transmissions and showed us just how important it is to understand and optimise spectrum use."
        },
        {
            "text": "That insight led Lacuna to include a spectrum scanner on every satellite we have launched. Over five years, these scanners have built a unique global map of unlicensed spectrum activity, helping us make our system more reliable and efficient."
        },
        {
            "heading": 2,
            "text": "From experiment to ecosystem"
        },
        {
            "text": "Our early work was supported by the UK Space Agency through the ESA ARTES programme, helping us move our concept from the lab bench to launch them into orbit."
        },
        {
            "text": "Nine years later, we’re now championing the Lacuna Network - a collaborative model where partners can fly Lacuna gateways on their own satellites. In return, they share coverage, helping us to build a unified global system."
        },
        {
            "text": "Spurrett said:"
        },
        {
            "heading": 2,
            "text": "Wisdom of the Trail"
        },
        {
            "text": "Looking back as Wisdom of the Trail prepares for launch, we saw a path marked by persistence and quiet innovation. What began as a bold idea in a UK business incubator has grown into a global movement - bringing affordable satellite connectivity to the most remote corners of the planet."
        },
        {
            "text": "Spurrett reflects:"
        }
    ]
}