{
    "url": "https://onsdigital.blog.gov.uk/2023/12/18/designing-content-for-the-ons-an-insight-into-the-whats-wheres-and-whys-of-the-team-and-how-content-they-are-in-their-roles/",
    "title": "Designing content for the ONS - an insight into the whats, wheres and whys of the team and how content they are in their roles",
    "authors": [
        "jacobstarling"
    ],
    "categories": [
        "Content design",
        "ONS digital people",
        "People and skills",
        "Recruitment"
    ],
    "pub_date": "2023-12-18T09:03:38+00:00",
    "content": [
        {
            "text": "Our content designers help to ensure our publications are as well put together as possible, carrying out proof-reading, making sure our writing style is consistent and paying attention to the accessibility of our official written content.   We speak to Cariad Sealey, one of our current content designers who gives us an insight into the whats, wheres and whys of the team and how content they are in their roles."
        },
        {
            "heading": 2,
            "text": "What is your current role, and how long have you been with ONS?"
        },
        {
            "text": "I’m a content designer in Digital Publishing and I’ve been at the ONS for almost a year. It’s absolutely flown by!"
        },
        {
            "heading": 2,
            "text": "What was your background before joining?"
        },
        {
            "text": "Before joining the ONS, I’d worked at universities in Cardiff and St. Petersburg in administrative roles, but I always took the opportunity to write, edit and publish web content within those roles."
        },
        {
            "heading": 2,
            "text": "What are your team like?"
        },
        {
            "text": "My team are fantastic, I’m the most comfortable I’ve ever been in a professional context, and that’s all thanks to the other content designers. Everyone contributes to the psychologically-safe environment we get to work in every day, and we all understand that no question is too insignificant to ask. In fact, we spend a lot of time discussing minute details like the placement of commas and so on; it comes with the territory in content design!"
        },
        {
            "heading": 2,
            "text": "How do your team fit into the wider ONS?"
        },
        {
            "text": "At the ONS, the content design team’s main role is to help authors write their statistical releases in a way that incorporates ONS house style and tone of voice, while keeping in mind important principles of content design, such as accessibility, front loading, conciseness, and high standards of spelling and grammar. Ensuring our web content is accessible is a big part of what we do, this includes writing in plain English and for compatibility with assistive technologies, such as screen readers. This means our content is inclusive and can reach the maximum number of users. We also work on content-improvement projects, whether that’s updating the ONS content style guide or developing new content types to suit user needs. We use evidence and analytics to help inform our user-centred decisions and designs."
        },
        {
            "heading": 2,
            "text": "What are you working on at the moment?"
        },
        {
            "text": "At the moment, I’m working on a 10,000-word article about survivors of domestic abuse and their experiences of temporary safe accommodation. It’s a fascinating and eye-opening read that includes quotes from real people, and my job is to ensure it’s as clear, concise and accessible as possible because this article is likely to be of interest to policy-makers after publication."
        },
        {
            "heading": 2,
            "text": "What piece of work you’ve completed in the role are you most proud of?"
        },
        {
            "text": "I’m proud I was able to help improve one of the daily processes our team use by updating the way we check a web publication’s metadata. This has really sped up part of the publishing process for content design, and for the publishing officers who work with the data we provide them with."
        },
        {
            "heading": 2,
            "text": "What challenges can someone expect in the role?"
        },
        {
            "text": "We work in a dynamic publishing environment, so one of the biggest challenges of the role is being able to manage multiple publications and projects at once to ensure we meet our publishing deadlines. Having a really supportive team means that you’re never on your own and can always ask for help. We have a daily stand up to help us manage our workloads and ensure good communication between the team."
        },
        {
            "heading": 2,
            "text": "What are the three things you spend the most time doing in your role?"
        },
        {
            "text": "Proofreading, editing drafts of upcoming publications, and holding content support meetings with statistical authors to discuss and provide guidelines for future publications."
        },
        {
            "heading": 2,
            "text": "What’s been the most rewarding part of working at ONS for you so far?"
        },
        {
            "text": "For me, the most rewarding part of my role is working closely with authors on a publication and suggesting improvements that they’re really happy with, and which I know will have benefits for our users."
        },
        {
            "heading": 2,
            "text": "What have you learned since joining ONS?"
        },
        {
            "text": "I’ve learned so much about the importance of accessibility and how to create content for users with different needs, such as visual impairment, dyslexia, dyscalculia, and more."
        },
        {
            "heading": 2,
            "text": "What skills are the most important for a content designer?"
        },
        {
            "text": "I think the most important skills for a content designer at the ONS are:"
        },
        {
            "heading": 2,
            "text": "Finally, why should the person reading this apply for a role as a Content Designer at the ONS?"
        },
        {
            "text": "If you want to join a friendly, supportive team who love nothing more than to solve grammatical conundrums and discuss proper punctuation placement then you should definitely consider applying!"
        },
        {
            "text": "Aside from the nurturing culture, you will learn about important design principles to help you publish a high standard of user-centred content for the web. And finally, you’ll be working on publications that go on to serve the public good through informing policy or creating awareness of important subject matter – which is nothing short of exciting!"
        }
    ]
}