{
    "url": "https://grantscommunity.blog.gov.uk/2023/12/18/efficiencies-and-the-power-of-integrating-grant-making-systems/",
    "title": "Efficiencies and the power of integrating grant-making systems",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Apply for a grant",
        "Civil Service",
        "Digital transformation",
        "Efficiencies",
        "Find a Grant",
        "Government Grants Management Function",
        "Spotlight"
    ],
    "pub_date": "2023-12-18T16:09:55+00:00",
    "content": [
        {
            "text": "There is an urgent and continual need to drive improved productivity and efficiency in grant-making. Why? So that grant funding not only realises its intended public good, but also maximises value for money and delivers the greatest return for citizens and the economy.  "
        },
        {
            "text": "So as we come to the end of another productive year, here is a little recap on a few things we have put into place as we get another step closer to delivering the £200m worth of efficiencies savings."
        },
        {
            "heading": 2,
            "text": "Find a Grant"
        },
        {
            "text": "First there was Find a Grant. Launched on 1 April, as a fully fledged service, and mandated by ministers as the place to advertise all government grants - with very few legitimate exceptions. This cross-government digital service has driven efficiencies and improved access to grant funding by standardising the advertising of most government General Grants in a single location. We project that the service will advertise c.£40bn of grants across fifteen departments by the end of 2024/25. So far 179k people have used Find a Grant, and £7.6bn worth of grants have been advertised, and applicants just LOVE it. One place to find and apply for all government grants."
        },
        {
            "heading": 2,
            "text": "Apply for a Grant"
        },
        {
            "text": "Having created Find a Grant to advertise your schemes, we have added on a new integrated feature - we call it Apply for a Grant. \n\nIn short, you can now build your online grant application forms in Find a Grant, to make grant management simpler, faster, fairer and more efficient for grant admins and prospective applicants. As standard, we have included all the mandatory questions you need to run your due diligence checks and you can adapt the form to suit your needs - with a drop down menu for the types of questions you might need to ask. \n\nYou can use this new feature now if you have already registered for a Find a Grant account and asked us to add your admin permissions. "
        },
        {
            "text": "To find this feature just look in the grant scheme detail, just below the grant advert form on your administrator dashboard in Find a Grant. Simply click ‘build application form’. Or leave a comment here and we will be in touch to sort a demo out with you and send you a ‘how to’ video. "
        },
        {
            "text": "We have also added a few new features including enabling you to change the owner of the grant to someone else in your team, and there will be a few more improvements to come in the new year."
        },
        {
            "heading": 2,
            "text": "Spotlight integration"
        },
        {
            "text": "There is no better way to save even more time, cost and reduce error and fraud than by connecting up our grant-making systems and ensuring solid and secure interoperability. "
        },
        {
            "text": "So the first BIG news this month is that all due diligence data for all applications on Find a Grant/Apply for a Grant are now automatically sent to Spotlight, the GGMF’s due diligence checker. So when any application is submitted, it is now immediately ready for checks to be run against it on Spotlight - at any time. There is now no need to download spreadsheets and transfer data manually.\n\nOur colleagues are also continuously improving Spotlight to automate pre- and post-award checks to highlight risk, financial health and potential reliance on grant funding, and inform effective risk-based grant making decisions on the allocation of funding."
        },
        {
            "text": "Again, if you are not sure how this works or if you have a Spotlight licence, leave a comment here and we will get in touch; or get our contact details on the Centre of Excellence."
        },
        {
            "heading": 2,
            "text": "Government Grants Managed Service (GGMS)"
        },
        {
            "text": "The second BIG news is we have secured funding to extend our efficiency portfolio to include a new pilot for a managed service for grant making. This is super exciting. Working with Home Office, DWP, DfT and other departments and ALBs, we are going to explore the feasibility of creating an end-to-end grant administration service. GGMS will be digitally-enabled, using all of the services we’ve just talked about, to create an efficient service, generating greatly improved data insights. In the new year, I will be able to update you some more."
        },
        {
            "heading": 2,
            "text": "New Year - more efficiency savings"
        },
        {
            "text": "So our focus for 2024 is to increase the uptake and utilisation of Find a Grant, Apply for a Grant and Spotlight to drive efficiency and consistency in the grant making processes. And, we will pilot the Government Grants Managed Service to automate even more parts of grant administration; aiming to improve productivity and efficiency, and minimise risk."
        },
        {
            "heading": 2,
            "text": "Calling all government grants administrators"
        },
        {
            "text": "So what should you do now if you are a government grants administrator?"
        },
        {
            "text": "And if you are not sure how to do any of this, just log on to the Centre of Excellence for all the updates and contact details you need; or leave a comment here and we will get in touch. "
        },
        {
            "text": "The benefits of making life simpler, faster, fairer and more efficient are clear - now we must work together to make these a reality for grant makers and grant applicants.  "
        },
        {
            "text": "By this time next year, I know we will be able to report the next bout of significant strides forward. "
        },
        {
            "text": "Here’s to 2024 and a very happy new year to you all. "
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Efficiency Portfolio"
        }
    ]
}