{
    "url": "https://environmentagency.blog.gov.uk/2023/12/18/environment-agency-bathing-waters-storm-overflow-data/",
    "title": "Environment Agency bathing waters storm overflow data",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2023-12-18T16:09:14+00:00",
    "content": [
        {
            "text": "The Environment Agency has analysed Event Duration Monitoring data on storm overflows associated with bathing waters across England for 2023. This data, provided to the EA following the end of the bathing water season (May to September inclusive), is a vital tool for the organisation to plan what work needs to take place ahead of the next season and to work with water companies and local organisations to take action where needed."
        },
        {
            "text": "Bathing water quality has improved significantly over recent decades; 28% of bathing waters were rated as ‘good’ or ‘excellent’ in the 1990s, and 76% in 2010. It is now 90%, with 96% reaching minimum standards. You can read more about the annual results published earlier this month."
        },
        {
            "text": "An Environment Agency spokesperson said: "
        },
        {
            "text": "The data shows that the average number of discharges from storm overflows in a bathing water is 8.4 for an average duration of 3.7 hours. This is an increase from an average of 5.6 spills per overflow and an average duration of 3.2 hours in 2022. This increase is largely explained by the increased rainfall during the 2023 bathing water season (353.7mm, 111% of the long-term average) compared to the 2022 bathing water season (236.5mm, 74% of the long-term average)."
        },
        {
            "text": "Across the whole network the EA has required water companies to fit monitors to storm overflows to increase transparency. This includes any which impact bathing waters – 99% of which (1,037) now have an EDM monitor installed."
        },
        {
            "text": "The data analysed is a sub-set of the EDM data for all storm overflows, which is published in March annually. This data, provided to the EA following the end of the bathing water season (May to September inclusive), is used after the bathing water season to help us plan what work needs to take place ahead of the next season – allowing us to take action where needed."
        },
        {
            "text": "Wider measures from the government and Environment Agency to improve water quality include:"
        }
    ]
}