{
    "url": "https://insidedio.blog.gov.uk/2023/12/18/take-a-look-at-our-christmas-related-creatures-and-plants-on-the-defence-estate/",
    "title": "Take a look at our Christmas-related creatures and plants on the Defence Estate",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Conservation",
        "Defence Estate",
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Wildlife"
    ],
    "pub_date": "2023-12-18T16:37:29+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "It’s the most wonderful time of the year – but that doesn’t stop the hard work that goes on behind the scenes across the Defence Training Estate every day."
        },
        {
            "text": "Our ecology and environmental management teams work tirelessly alongside the military to ensure habitats and species across the training estate can thrive, in balance with military training requirements."
        },
        {
            "text": "The Ministry of Defence’s (MOD’s) estate spans 169 Sites of Special Scientific Interest (SSSIs) across the country, covering over 82,000 hectares."
        },
        {
            "text": "Across these vast and varied landscapes, there’s no  shortage of work to be done year-round to help conserve hundreds of species of plants and animals. Given it’s the Christmas season, we’re taking a celebratory look at some of the most festive flora and fauna that can be found across our estate."
        },
        {
            "heading": 3,
            "text": "Mistletoe"
        },
        {
            "text": "It may be known for the spot to sneak a Christmas smooch, but beware! Mistletoe is poisonous to humans. It contains a toxic substance called phoratoxin, which can be found in the leaves, stems and berries of the plant."
        },
        {
            "text": "It does have benefits for wildlife though, as the white berries can be an important winter food source for birds such as the mistle thrush, and winter visitors like redwings and fieldfares. While it is not an endangered species, a decline has been noted in the UK, so it’s best to enjoy this plant from afar when out on the Defence Estate."
        },
        {
            "heading": 3,
            "text": "Holly"
        },
        {
            "text": "One of the most recognisable festive plants, holly is commonly used to decorate homes around Christmas time. But it also has many benefits to wildlife across our training estate, as the shrub is often used as a shelter for birds and provides hedgehogs with a cosy place to hibernate."
        },
        {
            "text": "Holly branches have been used to decorate homes during winter for hundreds of years, due to the tree being seen as a fertility symbol and a charm against witches, goblins and the devil."
        },
        {
            "heading": 3,
            "text": "Ivy"
        },
        {
            "text": "Ivy is often accused of strangling trees, but it doesn’t harm the tree at all, and even supports at least 50 species of wildlife, being a food source for insects and birds, and providing shelter for birds, bats and other small mammals. Ivy can be found at many of our training areas across the UK."
        },
        {
            "text": "The ancient Greeks and Romans believed that wearing a wreath of ivy leaves around the head would prevent one from getting drunk – with the Roman god Bacchus, the god of intoxication, often depicted wearing a wreath of ivy and grapevines."
        },
        {
            "text": "Historically, both holly and ivy were important symbols during winter as they were both evergreens, hence the Christmas carol ‘The Holly and the Ivy’."
        },
        {
            "heading": 3,
            "text": "Turtle Doves "
        },
        {
            "text": "While our festive forage across the Defence estate may not have located all the birds of the famous 12 Days of Christmas Carol, we did uncover one very special species, the turtle dove, which is finding a haven at MOD Shoeburyness in Essex. In 2012 the RSPB launched Operation Turtle Dove to encourage the return of the birds across Southern and Eastern England, including on parts of the Defence estate."
        },
        {
            "text": "MOD Shoeburyness is particularly well known for breeding turtle doves, with its scrub habitat proving to be ideal for nesting. DIO has been working with the RSPB and QinetiQ to implement scrub management to further benefit the species."
        },
        {
            "heading": 3,
            "text": "Robins "
        },
        {
            "text": "Robins can be found across the UK and the Defence Training Estate is no exception, with the red-breasted bird being spotted all over our training areas."
        },
        {
            "text": "Robins are present all year round, but their link to Christmas actually comes from the Victorian era. The tradition of sending Christmas cards began during the reign of Queen Victoria, and during that time, postmen wore red jackets, earning them the nickname ‘robins’, and as people waited to receive their cards they would welcome the appearance of the ‘robins’."
        },
        {
            "heading": 3,
            "text": "Penguins "
        },
        {
            "text": "While we might not have any penguins  waddling around on the Defence estate in the UK, we do have plenty of these much-loved, flightless flappers on our estate in the Falkland Islands."
        },
        {
            "text": "In fact, five of the world’s 17 species of penguins can be found on our estate, these being the King, Gentoo, Rockhopper, Magellanic and Macaroni species. The Falkland Islands are home to the largest population of Gentoo penguins on Earth."
        },
        {
            "text": " "
        },
        {
            "text": "To discover more about the conservation work taking place across our UK and overseas estate, as well as the MOD’s commitment to sustainability, you can read Sanctuary Magazine, which is published in print and online annually."
        },
        {
            "text": "If you are planning to take a walk on the Defence Training Estate over the Christmas period, please ensure you follow these simple steps to keep yourself and our training personnel safe:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}