{
    "url": "https://defrafarming.blog.gov.uk/2023/12/18/wigan-greenheart-landscape-recovery-an-industrial-past-and-a-thriving-future/",
    "title": "Wigan Greenheart Landscape Recovery: an industrial past and a thriving future ",
    "authors": [
        "Tony Da Silva"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-12-18T15:07:59+00:00",
    "content": [
        {
            "text": "The Wigan Greenheart Landscape Recovery project covers a combined area of approximately 1,446 hectares in Lancashire. I'm the project manager. In this post, I’d like to share an overview of the site, its history and our project."
        },
        {
            "text": "The site includes the Flashes of Wigan & Leigh National Nature Reserve (NNR). It sits at the heart of the Great Manchester Wetlands Nature Improvement Area (NIA)."
        },
        {
            "text": "The site includes the spectacular Bickershaw Country Park with its numerous footpaths and meandering wetlands and Kirkless Local Nature Reserve, an oasis for wildlife featuring relics of its industrial past."
        },
        {
            "text": "The peri-urban setting makes our project truly special, with green space surrounded closely by residential and urban developments. "
        },
        {
            "text": "People and wildlife are linked through Wigan Greenheart’s green corridors and open spaces. 70 per cent of the whole borough designated as green space."
        },
        {
            "text": "Our project partners are Lancashire Wildlife Trust, Wigan Council and Forestry England. We’re also supported by Natural England. "
        },
        {
            "text": "Together, we aim to deliver a novel approach that demonstrates how the principles in Sir John Lawton’s 2012 report, Making Space for Nature, of more, bigger, better and more joined up can be achieved throughout a peri-urban landscape over at least 20 years. Restoring, creating and connecting good quality habitats will aid species recovery."
        },
        {
            "text": "Only some of the site is farmland but the improvements we will make to the landscape will help farmers around us. Through our work, we'll support healthier soils, cleaner water, greater resilience to flooding and more pollinators for crops.    "
        },
        {
            "heading": 2,
            "text": "A history of industry and thriving future  "
        },
        {
            "text": "Much of the local area was dominated by the mining and textile industries. When the mines closed and industries declined, parcels of land were left behind. "
        },
        {
            "text": "Since the 1970s, a huge amount of work has gone into restoring this land. This once industrial landscape has been transformed into a place where wildlife can thrive and people can enjoy. "
        },
        {
            "text": "Largely created through the flooding of partially collapsed deep coal mine workings, it has gradually developed into a wetland mosaic of open water, swamp, reedbed, tall herb fen, wet marshy grassland, meadows and wet woodland.  "
        },
        {
            "text": "Today, much of this landscape is designated for its important habitats and wildlife. It is incredibly close to the hearts of Wigan and Leigh residents, with many having witnessed the change from a once devastated industrial landscape to one of the greenest boroughs in the country. "
        },
        {
            "text": "Landscape Recovery funding will allow us to deliver a real step-change for nature recovery throughout Wigan and Leigh. "
        },
        {
            "text": "Importantly, at 20 years minimum, the funding supports long-term delivery. This will provide better security for our reserves, local jobs and the quality and maintenance of this valuable peri urban greenspace. "
        },
        {
            "text": "So, our project continues a long legacy of restoration and conservation carried out by partners over the last 50 years including the Carbon Landscape partnership, which delivered a package of community, skills, education, heritage, access and habitat restoration projects. "
        },
        {
            "text": "We believe our project provides a mechanism to deliver such long term-targeted management. Most of the project boundary is within walking distance of residential areas, providing us with the perfect opportunity to help communities reconnect with nature that is quite literally on their doorstep. This goes hand in hand with delivering wider socio-economic benefits, such as improved mental and physical health and volunteering opportunities.   "
        },
        {
            "text": "Our project prioritises the recovery and protection of threatened species such as the willow tit and bittern, while benefiting many other important native species including the water vole, reed bunting and great crested newt.  "
        },
        {
            "text": "This can be achieved through landscape-scale habitat improvement, including wide scale grassland restoration, converting species poor, urban grassland to rich wildflower meadows. "
        },
        {
            "text": "Additionally, providing and creating scrubby wet willow-tit woodland and enhancing reedbed habitat to accommodate populations of bittern. "
        },
        {
            "text": "This will all help to deliver knock on-benefits throughout the landscape, including on adjacent sites, by increasing the number of invertebrates and pollinators. "
        },
        {
            "text": "Creating connecting hedgerows and scrubby corridors will increase habitats and enable movement for pest predators, such as hedgehogs.    "
        },
        {
            "heading": 2,
            "text": "Our progress "
        },
        {
            "text": "We're currently in the development phase. Landscape Recovery projects have up to 2 years to agree on the detail and get ready for the implementation phase. "
        },
        {
            "text": "We are in the process of finalising the land area within our project. We've added few parcels of land which will act as stepping-stones, helping to connect habitats and improving the overall contiguity of the project area. "
        },
        {
            "text": "The team has been out in all weather, gathering baseline data, gathering comprehensive species and habitat condition data, also walking many kilometres of surfaced and unsurfaced paths carrying out access assessments. "
        },
        {
            "text": "Colleagues from the University of Manchester have been collecting data year-round, assessing the potential for fen, reedbed and grassland for sequestering carbon. "
        },
        {
            "text": "Building on our baseline data, we're now developing site access and habitat intervention plans. We're also working to identify possible funding streams through the development of a blended finance-model."
        },
        {
            "text": "In addition to the actions we’ve mentioned for species recovery and restoration, we’d also like to explore ways to ensure that our work delivers wider benefits to the landscape, such as mitigating the effects of climate change, reduction of flooding and economic benefits. "
        },
        {
            "heading": 2,
            "text": "Community at the heart of our project "
        },
        {
            "text": "Encouraging more people to visit Wigan’s Greenheart is an important part of our work. We want to give local communities and visitors more opportunities to discover, enjoy and connect with nature in our area. "
        },
        {
            "text": "We have begun this process by speaking and interacting with people and partners at events like the Flashes Festival of Nature, which celebrated the Flashes of Wigan and Leigh’s designation as a National Nature Reserve.  "
        },
        {
            "text": "We also trialled various activities with the Greenheart Summer Club, a series of 6 family-friendly, nature-based events which culminated in a Wildlife Connectivity Festival at Bickershaw Country Park. "
        },
        {
            "text": "The next phase of our community engagement work is to hold a series of consultations with groups and residents of Wigan and Leigh.  "
        },
        {
            "text": "Our project aims to provide an example of how people and wildlife can sit side-by-side, ensuring the protection of sensitive habitats, while encouraging people to explore and enjoy this landscape and make the most of the health benefits it offers. "
        },
        {
            "text": "Engaging with all stakeholders will be part of the work around adaptation to address climate change and biodiversity challenges. "
        },
        {
            "text": "Re-wetting, creating, and managing habitats as a landscape network will help to mitigate the effects of increased flood events, elevated greenhouse gas emissions and rising temperatures. "
        },
        {
            "text": "Landscape Recovery can also help to develop diverse economic opportunities through nature-based enterprises, production, and employment opportunities. Furthermore, improved landscape quality is vitally important for people’s wellbeing. "
        },
        {
            "text": "Better access to nature benefits everyone and a healthy natural environment provides cleaner water, air, food, healthy soils, flood defences and better health. This will all take much imagination and long-term, coordinated action to realise.  "
        },
        {
            "text": "If you have any questions about our project, please leave a comment below."
        },
        {
            "text": "And, if you’d like to read about the other Landscape Recovery projects across the country and how their working to create environments in which people, wildlife and agriculture can flourish, follow the links in the box below."
        }
    ]
}