{
    "url": "https://ruralpayments.blog.gov.uk/2023/12/18/your-grants-introducing-you-to/",
    "title": "Your Grants 'Introducing you to...'",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2023-12-18T11:48:52+00:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants and rural payments to farmers, businesses and local authorities. In this series of blogs, we look at the grants available in more detail, using case studies to showcase those who have taken advantage of these opportunities, as well as highlighting the work of the RPA Grants Service Team in administering them. In this blog we meet Debbie Gray who works on the development of new grants."
        },
        {
            "text": "Hello, I’m Debbie and I work in Grants Service, based in Nottingham. At the moment I’m working on The Improving Farm Productivity grant, which involves grant development, producing the relevant documents and guidance, as well as getting the grant launched."
        },
        {
            "text": "We have just launched Improving Farm Productivity Round 2, so we’ve been very busy getting ready for that, and I’ve written a lot of technical guidance. The grant is open to horticultural and farming businesses and will pay for capital items to improve farm and horticulture productivity. It focuses on the use of robotic and automated equipment and systems to aid crop and livestock production and the installation of solar equipment to increase energy resilience and take-up of renewable energy generation."
        },
        {
            "text": "We do a lot of work behind the scenes before a grant is launched. You have to work out what’s right to make available for the current time, ensure consistency and accuracy of the guidance, as well as consistency with other available grants and schemes. We work with DDTS colleagues on the first stage application ‘online checker’ process.  This involves a lot of testing of the systems so when the grant is launched everything goes smoothly. We reach out through the Customer Insight Team for volunteers, such as farmers, who test for us. It’s also very important that the guidance we produce is straightforward, concise, and clear to make it easy for farmers to understand and apply for the grant.  Customer content colleagues are a great help with this as this has to be the case from the first publishing of information, through the online checker and right up to the full application form and guidance products customers will use."
        },
        {
            "text": "I’ve been at RPA for five years now and have always worked in the Grants Service team, although I’m only a couple of months into this role - I was with the compliance team when I first started and have just moved over to this role. Before joining RPA, I worked on farms when I first left school, and also for North Yorkshire police in the control room. I only came to RPA for a three-month temporary role, but I really enjoyed it and never left. I can’t imagine ever leaving the Grants Service team."
        },
        {
            "text": "I would say that the aspect of my role I enjoy most is the collaboration with colleagues, as well as the complexity and detail of what I do. I don’t deal directly with the customers who are going to be interested in grants, but I deal with everyone else who has a vested interest in the grants such as wider Defra, farming stakeholders and ministers. I used to love talking to customers face-to-face in my previous role, and I do miss that."
        },
        {
            "text": "One of the things I love about working for the Civil Service is the support networks that are available. I’m a member of the Cross-Government initiative  CERAE, that supports those who are care experienced, refugee or estranged. and I’m very passionate about that. Before joining RPA. I was a foster carer for 14 years, along with my husband. We have three sons aged 21, 12 and 10, and over the years we’ve fostered around 30 children both long and short term."
        },
        {
            "text": "Outside of work I love cooking and also enjoy exploring the UK with my family in our touring caravan. I have two Dachshunds, that have to sit either side of me when I’m working, one on a chair and one on her bed."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}