{
    "url": "https://dvladigital.blog.gov.uk/2025/04/08/apply-for-a-new-log-book-and-tax-your-vehicle-in-one-easy-online-journey/",
    "title": "Apply for a new log book and tax your vehicle in one easy, online journey",
    "authors": [
        "Rachel Sargeant"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2025-04-08T13:59:09+01:00",
    "content": [
        {
            "text": "Is it time to tax your vehicle but you can’t find your documents? We’ve got a simple solution!"
        },
        {
            "text": "As a registered vehicle keeper, you can now apply for a new vehicle log book (V5C) and tax online at the same time. This means you can continue to use your vehicle without waiting up to 5 days for your new log book to arrive in the post. It’s quick and simple!"
        },
        {
            "heading": 2,
            "text": "Making things easier  "
        },
        {
            "text": "You must tax your vehicle, even if you don’t have to pay anything. If it’s time to tax your vehicle, you can use a reference number from a recent vehicle tax reminder (V11) or ‘last chance’ warning letter, or your log book. If you don’t have any of these documents, you can apply for a new log book on GOV.UK."
        },
        {
            "text": "After you’ve applied, the service will ask if you need to tax your vehicle. If you do, you’ll be taken to our safe and secure vehicle tax service. You should get your log book within 5 days, but now you won’t need to wait for it to arrive before you can tax your vehicle and hit the road legally, saving you time and letting you get on with your day."
        },
        {
            "heading": 2,
            "text": "Listening to your feedback  "
        },
        {
            "text": "So, why did we introduce this service update?"
        },
        {
            "text": "Your feedback on the vehicle log book service told us many of you were applying for a new log book because you wanted to tax your vehicle but didn’t have any documents. Insight also showed that, because of this, many of you ended up calling our contact centre instead – around 2,500 of you a month in fact!"
        },
        {
            "text": "We asked ourselves how we could improve your journey as a customer. Our answer was to link the online vehicle log book service to the online vehicle tax service, so you can tax your vehicle at the same time. Previously, you would have had to wait for your replacement log book to arrive before you could tax your vehicle. But now, due to this service update, you can continue to use your vehicle instead of keeping it off the road."
        },
        {
            "text": "We’d never linked online registration and licensing services before, but with the support of colleagues across DVLA, it was the logical thing to do."
        },
        {
            "heading": 2,
            "text": "Checking the user journey worked"
        },
        {
            "text": "We wouldn’t introduce a service update without testing it first! Our Customer Insight team brought together a cross-section of volunteers from across the country to try the service. We asked them to apply for a new log book with the end goal of taxing the vehicle. This allowed us to observe how real people naturally interacted with the service, their understanding of the process, and how they felt about the way the services were linked."
        },
        {
            "text": "The volunteers said they found the user journey relatively easy but made a couple of suggestions. No problem! We took that on board, made slight tweaks and tested again with a different set of volunteers. This time, feedback was overwhelmingly positive. Our volunteers especially liked being able to tax without needing to wait for the log book to drop through their letterbox."
        },
        {
            "text": "After the service was introduced, data gathered across a 4-day period showed that all of those who needed to tax and had all the correct documents (such as a valid MOT) were able to do so."
        },
        {
            "text": "When we launch a new service or update such as this one, it doesn’t end there! We continually look at ways to improve the customer experience. Our goal is to always offer a seamless service that enables you to get what you need quickly and easily."
        },
        {
            "heading": 2,
            "text": "In summary…"
        },
        {
            "text": "There’s no need to wait for your new log book to arrive before you can tax your vehicle. You can now easily tax your vehicle at any time, 365 days a year, even if:"
        },
        {
            "text": "Just head on over to the vehicle log book service on GOV.UK and you’re good to go! There’s no need to phone our contact centre, fill out paper forms, pay postage or wait until we process your application (but you can still visit your local Post Office to apply if you’d like to)."
        },
        {
            "text": "Of course, the ideal scenario is to always keep your log book safe and sound. But if you do happen to find yourself with no documents and needing to tax your vehicle, don’t panic. Pick up your chosen device, wherever you are, and get a vehicle log book to sort it out in one easy online journey. "
        }
    ]
}