{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/04/08/calling-all-graduates-grad-scheme-opportunity-at-the-cma-2/",
    "title": "Calling all graduates: Grad scheme opportunity at the CMA",
    "authors": [
        "Will Green"
    ],
    "categories": [
        "Recruitment"
    ],
    "pub_date": "2025-04-08T11:01:47+01:00",
    "content": [
        {
            "text": "Applications for our Delivery Graduate Scheme are open for October 2025! If you’re a university graduate (or expect to finish your studies before September), are interested in delivering better outcomes for consumers, and want to play an important role at the UK’s competition and consumer regulator, then the Competition and Markets Authority (CMA) could be the right place for you."
        },
        {
            "heading": 2,
            "text": "The Scheme"
        },
        {
            "text": "As a Case Officer on the Delivery Graduate Scheme at the CMA, you’ll gain hands-on experience of CMA casework. You’ll be posted to one of our multi-disciplinary project teams, working alongside legal, economic, financial and technical experts."
        },
        {
            "text": "Successful applicants will complete three, 12-month placements in different parts of the CMA, contributing to the delivery of high-quality outputs and assisting major investigations and projects. This could involve writing draft proposals for investigations, planning and executing dawn raids, analysing documents, liaising with external stakeholders, developing strategy, and assisting with project management."
        },
        {
            "heading": 3,
            "text": "Here's what some of our current graduates have to say about the scheme:"
        },
        {
            "heading": 2,
            "text": "Our training programme"
        },
        {
            "text": "During your time at the CMA, you’ll also get to advance your skills and knowledge through regular training. The programme will be spread over the 3 years of the scheme, and is designed to expand your knowledge of the CMA’s role, remit and work, and sharpen your drafting, presenting, and IT skills. CMA staff are able to apply for funding for external courses – ranging from academic qualifications to project management certifications – and you’ll also have access to regular seminars from academics and competition experts."
        },
        {
            "text": "After the completion of the scheme, we expect you’ll have the skills to consider applying for a role as a Principal Case Officer."
        },
        {
            "heading": 2,
            "text": "Application details"
        },
        {
            "text": "Applicants must be based in and eligible to work in the UK. Upon applying, you will have 3 tests to complete, comprising:"
        },
        {
            "text": "If you pass all of these tests, you will be presented with an application form where you’ll give examples of your experience. If you’re successful, you’ll be invited to attend an assessment centre and interview."
        },
        {
            "heading": 3,
            "text": "Apply:"
        },
        {
            "text": "Find out more and apply by 28 April 2025."
        }
    ]
}