{
    "url": "https://naturalengland.blog.gov.uk/2025/04/08/two-more-years-extending-ambitions-for-nature-recovery/",
    "title": "Two more years: extending ambitions for Nature recovery",
    "authors": [
        "Natural England",
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Climate change",
        "Connecting People with Nature",
        "Environment Act",
        "Environmental Improvement Plan",
        "Evidence",
        "Farming",
        "Local Nature Recovery Strategy (LNRS)",
        "Marine environment",
        "National Nature Reserve",
        "Natural England",
        "Nature",
        "Protected sites and species"
    ],
    "pub_date": "2025-04-08T12:56:12+01:00",
    "content": [
        {
            "text": "By Tony Juniper CBE, Chair of Natural England"
        },
        {
            "text": "I was delighted to be invited to serve a third term as Chair of Natural England and look forward to continuing to lead the organisation as it adopts and implements a new strategy. Now is thus a good moment to not only look ahead, but to also offer some reflections on the path we have taken over the past six years towards Nature recovery."
        },
        {
            "text": "The urgency of halting and reversing the decline in our natural world and the break-down of our climate – two crises that are very much entwined – has increased rapidly, even since I came to Natural England in 2019. Catastrophic fires and floods from California to Australia, and from Germany to Pakistan are among the extremes that increasingly accompany rapid global warming. Here in England, the 2022 heatwave, that for the first time ever took temperatures above 40 degrees, caused almost 3,000 excess deaths, while flooding the following year washed away a fifth of farming income – a £1 billion blow to our economy, not to mention the devastating effects on families and their businesses."
        },
        {
            "text": "None of this is going away and is unfortunately set to get worse. As responses are being planned, it is obvious we cannot address global heating without also tackling the loss of Nature, reliant as we are on its ability to provide us with food and water, to sustain public health, to regulate our climate and to help us adapt to what are now inevitable changes. These linkages between climate and Nature were recognised by nations at the landmark COP 26 conference hosted by the UK in Glasgow in 2021."
        },
        {
            "text": "As if this context were not challenging enough, the country faces considerable economic challenges, with this is in turn leading to measures to expand economic growth, including through the building of many more homes and infrastructure. How we square all of this off – reducing emissions, restoring Nature and facilitating growth – is a tough challenge, but at Natural England we are planning for how we can play our most impactful role."
        },
        {
            "text": "Nature for growth"
        },
        {
            "text": "As I prepare for a third term, my starting point is to see growth in Nature as vital for long-term economic growth, not, as some would have us believe, a barrier to development. With ongoing damage being inflicted on the planet’s life support systems, finding ways to grow Nature at the same time as growing communities and the economy really is a prerequisite for a sustainable future."
        },
        {
            "text": "This integrated view of Nature supporting our collective wellbeing and resilience is reflected into the heart of the new Natural England strategy. Recovering Nature for Growth, Health and Security outlines what we plan to do in placing a restored natural world at the heart of the Government’s key priorities. As we look forward and to adopting new ways of approaching our mission via this new strategy, I find huge encouragement from looking back to what we managed to achieve during the past 6 years, working in common cause with such a wide range of partners."
        },
        {
            "text": "We worked closely with government to support the design and introduction of major legislative tools and schemes to support Nature recovery, including via those included in the Environment Act 2021 and the overall commitment to halt species decline by 2030. This was later bolstered by a new Global Biodiversity Framework, that was in some large part achieved by the efforts of the UK, including the need to protect 30 per cent of land and sea by 2030."
        },
        {
            "text": "Farming for Nature"
        },
        {
            "text": "We have seen the development and ongoing implementation of an Agricultural Transition Plan – and at Natural England we have played a leading and on-going role with farmers and land managers in the roll-out of large-scale Landscape Recovery projects. More than 50 of these ambitious programmes are under way across England, with some of the first round now completing their two-year development phase and moving to implementation."
        },
        {
            "text": "Working with multiple partners across large areas of England we have established 13 Nature Recovery Projects, such as Purple Horizons in the West Midlands and Bradford and South Pennines in Yorkshire, where we are working with local people and businesses to help bring thriving Nature into urban areas where everyone can enjoy it. It is a similar story with new Sites of Special Scientific Interest, such as the Dearne Valley in South Yorkshire which is transforming a former coalfield into a place where people can enjoy such rare wonders willow tits."
        },
        {
            "text": "We have supported government in the delivery of the Biodiversity Net Gain policy, enabling Nature-positive built development. This pioneering step has generated interest around the world. Another Environment Act provision was the initiation of Local Nature Recovery Strategies (LNRS), and again Natural England has been working across the country to assist in making these strategies quality plans for the recovery of Nature during the years ahead."
        },
        {
            "text": "Global to local"
        },
        {
            "text": "The ambition for Nature recovery at the local level was very clearly demonstrated last year in Bristol where the first LNRS was launched by the West of England Nature Partnership. It came just after I returned from Biodiversity COP 16 in Colombia and really brought home to me how the high-level discussions there need to be translated into local delivery of the sort displayed by the energetic and committed members of that LNRS."
        },
        {
            "text": "In addition to these new policies, we have during the last six years been making the most of more tried and tested methods. This can be seen in the King’s Series of National Nature Reserves, launched with the support of His Majesty the King in 2023, beginning with the Lincolnshire Coronation Coast NNR which will make 33 sq. km of dunes, marsh and mudflat – and their rich array of wildlife – more accessible to some of the 10 per cent most deprived neighbourhoods in England living within walking distance of the reserve. The Natural England Board has so far approved a total of ten new NNRs in the King’s Series and will add a further 15 during the coming three years. Some of them are large and are taking Nature recovery to a new level in the landscapes where they are located."
        },
        {
            "text": "Much of what we have been able to do during the last six years has helped to deliver on the direction set in Sir John Lawton’s 2010 report Making Space for Nature, which called for more, bigger, better and connected good quality habitats. The new NNRs, plus new SSSIs and new Highly Protected Marine Areas (HPMAs), the Landscape Recovery Projects and Nature Recovery Projects, are all pointing in that direction, while the LNRSs offer more potential for the future."
        },
        {
            "text": "In addition to piloting HPMAs, Natural England’s marine expertise has underpinned the closure of sandeel fisheries, the publication of our English Seabird Conservation and Recovery Pathway, and the development of offshore wind farms that can produce clean energy alongside healthy marine and coastal Nature. I hope that the natural treasures along our shores will encourage many to explore our newest national trails – the King Charles III England Coast Path and the upgraded Coast to Coast Path – which are due to be completed soon."
        },
        {
            "text": "We have also been working to foster stronger collaboration with local government, including National Parks and National Landscapes, and the new mayoral authorities. Tools we have developed to assist in these partnerships include the Green Infrastructure Framework (GIF) and we are supporting the delivery of that in places where people live and work, making their communities greener and bluer and therefore more beautiful, healthy, resilient and attractive to potential investors."
        },
        {
            "text": "Species recovery"
        },
        {
            "text": "Also during the last six years we have made progress with the return of species that were lost to England long ago. One of my personal highlights has been the work we have carried out with a number of government agencies and many partners down the years to establish the science, evidence and regulatory framework needed to enable the careful return of beavers to our waterways, following an absence of more than four centuries. Not only was this policy a seismic moment in our nation’s natural history, it gives one of our most charismatic (and ecologically transformative) species the chance to drive forward Nature recovery across our landscape."
        },
        {
            "text": "Another welcome return is that of the white-tailed eagle. In 2019 Natural England issued a licence to the Roy Dennis Foundation and Forestry England to undertake the careful release of young birds brought from Scotland at the Isle of Wight. In 2023 I was taken to see the first nest of such birds in England for 240 years."
        },
        {
            "text": "While making some progress on Nature recovery, the reasons why we do this work have only become more compelling. This includes in relation to public health. The growing extent to which Nature is acknowledged as being essential for people’s health and wellbeing is now apparent in mainstream thinking and policy. It can be seen, for example, in the work on green social prescribing projects in which the NHS, Natural England and a range of bodies have come together to help put Nature at the centre of improving mental health and tackling health inequalities."
        },
        {
            "text": "Access to Nature"
        },
        {
            "text": "Ensuring communities have access to the natural world is vital in this regard, something that has been notably lacking in more disadvantaged and diverse areas. Targets have been set and work is under way, supported by our GIF, although there remains a long way to go before everyone lives within a 15-minute walk of a good Nature-rich area."
        },
        {
            "text": "Considering what has been achieved during recent years it is evident that progress can be made and during my third term at Natural England our ambition will be undiminished. It won’t be easy, of course, with a rapid reshaping of the world order taking place at the same time as continuing pressures on household and national budgets, all of which will no doubt lead some to conclude that Nature recovery is an unaffordable luxury when increased spending on defence, health and development is needed."
        },
        {
            "text": "However, humanity’s reliance on the web of life and its many benefits means that we must redouble efforts for Nature’s recovery. Natural England’s State of Natural Capital report, published last year, reminded us that 90 per cent of the world’s food is derived from just 20 species, while in this country alone the farming industry is dependent on the £500 million service provided by pollinating insects."
        },
        {
            "text": "Urgent challenges"
        },
        {
            "text": "With hopes of limiting global temperature rises to 1.5 degrees now fading – and even 2 degrees looking increasingly optimistic – there is a growing threat to the pillars of our economic systems. Insurance leaders fear that climate and Nature-based disasters of the scale of the recent fires in California and flooding in Spain are making many properties uninsurable and threatening the entire future of an industry which in turn underpins the banking industry. We also have rising demand for public health services, including for conditions that we know can benefit from access to natural areas. So much for healthy Nature being a luxury."
        },
        {
            "text": "Facing into these urgent challenges, it’s clear that leadership and collaboration are needed to demonstrate to people in this country and around the world that Nature recovery is both imperative and achievable. The Government is setting out the means to enable this to take place, including alongside moves to step up the pace of building homes and infrastructure, via the Planning and Infrastructure Bill, facilitating the kinds of more strategic approaches that could achieve so much for planners, developers, the natural world and – consequently – people."
        },
        {
            "text": "We have achieved a great deal, and with new policies there is the potential for elevated impact as we go forward. There is, however, still a lot to do and we will need to make step changes in the pace of action if we are to meet our national environmental goals. I am looking forward to continuing to work with the Natural England team and our many partners as we strive to do better for the natural world that sustains us, and in so doing assist with our national goals for growth, health and security."
        }
    ]
}