{
    "url": "https://defrafarming.blog.gov.uk/2025/12/23/fipl-at-four-making-a-difference-across-protected-landscapes/",
    "title": "FiPL at four: making a difference across protected landscapes",
    "authors": [
        "Mark Ward"
    ],
    "categories": [
        "Payments to support National Parks, National Landscapes and the Broads"
    ],
    "pub_date": "2025-12-23T10:43:44+00:00",
    "content": [
        {
            "text": "This year marks four years of the Farming in Protected Landscapes (FiPL) programme.  "
        },
        {
            "text": "The programme supports farmers and land managers in England’s National Landscapes, National Parks and the Broads to farm more sustainably, protect nature, restore heritage features and make the countryside more accessible.  "
        },
        {
            "text": "In this post, I’ll share the impact of that work.  "
        },
        {
            "heading": 2,
            "text": "In numbers "
        },
        {
            "text": "Since its launch, FiPL has supported around 11,000 farmers and land managers to deliver nearly 5,500 projects across England’s most treasured landscapes, making a real difference for nature, heritage, and communities. "
        },
        {
            "text": "Some achievements include: "
        },
        {
            "text": "Together, these achievements show how the programme is working with farmers and land managers to support the care of England’s landscapes, heritage and rural communities, and improving access to and enjoyment of the natural environment. "
        },
        {
            "text": "These projects also support the priorities set out in Defra’s Environmental Improvement Plan (EIP). To date, FiPL has helped to create and restore thousands of hectares of wildlife-rich habitat, contributing towards Defra’s long-term target of 250,000 hectares by 2042. "
        },
        {
            "heading": 2,
            "text": "Beyond numbers "
        },
        {
            "text": "The figures are important, but they only tell part of the story. Behind each project, wildlife benefits from new habitats, visitors discover our landscapes and school children learn where their food comes from and how to care for the countryside. "
        },
        {
            "text": "The programme has also strengthened relationships between land managers and protected landscape organisations, helping to build lasting partnerships and a shared sense of purpose. "
        },
        {
            "text": "Strong farm groups are important because they help farmers and land managers work together to deliver change at a scale that individual holdings cannot achieve alone. "
        },
        {
            "text": "By sharing knowledge, skills and experience, these groups support better decision-making, reduce duplication of effort and encourage more joined-up management across whole landscapes.  "
        },
        {
            "text": "This collaborative approach is particularly effective for nature recovery, water management and flood resilience, where coordinated action across neighbouring farms delivers greater and more lasting benefits. "
        },
        {
            "text": "Over time, stronger farm groups also help build confidence, leadership and resilience within the farming community, supporting long-term stewardship of protected landscapes. "
        },
        {
            "text": "For me, the most important outcome is the commitment shown by farmers and land managers involved in FiPL. The programme supports them to develop and deliver well-designed projects, working with trusted advisers. "
        },
        {
            "text": "When I visit FiPL projects, I see work that will last, with people committed to managing and maintaining projects on their land. "
        },
        {
            "heading": 2,
            "text": "Case study"
        },
        {
            "text": "I want to share an example of the programme in action.  "
        },
        {
            "text": "Stag beetles are listed as near threatened and are a priority in Dedham Vale’s Nature Recovery Plan. "
        },
        {
            "text": "A group of farmers and landowners worked with Suffolk Wildlife Trust in the Dedham Vale National Landscape and Stour Valley to create 25 ‘stumperies’."
        },
        {
            "text": "A stumpery is a simple habitat made by burying hardwood timber so it can rot over time, providing the conditions needed by stag beetle larvae. In total, 12 landowners across the Dedham Vale and Stour Valley provided sites for habitat creation, each committing land in the long-term for a species whose larvae can take up to six years to mature. "
        },
        {
            "text": "By coordinating action across a large area, the project created a connected network of habitat at a landscape scale, something no single landowner could have achieved alone. "
        },
        {
            "text": "This approach helps create connected habitat across the landscape, making it more effective than isolated action. Participants included farmers from the Dedham Vale and Stour Valley Farm Cluster, community groups and the Flatford Field Studies Centre. "
        },
        {
            "text": "The project also helped build understanding and support for nature recovery. Landowners took part in a workshop to learn more about the species. Local primary schools also took part, with children learning about the role of stag beetles in the Stour Valley. The public can learn more about the project through interpretation boards along nearby footpaths. "
        },
        {
            "text": "For me, helping people understand why this work matters is just as important as delivering the projects themselves. When members of the public encounter initiatives like the stumperies, it brings to life the role farmers and land managers play as custodians of the countryside, working every day to balance food production with care for nature.  "
        },
        {
            "text": "This visibility helps build understanding and respect between farming and local communities, creating a stronger shared commitment to looking after these landscapes. "
        },
        {
            "text": "It can also encourage people to act themselves, whether that’s supporting local farming, getting involved in community projects, or creating simple habitats such as deadwood piles in their own gardens, so that nature recovery extends well beyond individual sites."
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "The programme is scheduled to run until March 2026, and farmers and land managers in Protected Landscapes can still apply for funding. FiPL is a competitive programme, and applications may close earlier if all available funding is allocated. "
        },
        {
            "text": "FiPL’s journey so far shows what can be achieved when farmers, communities and nature work together to deliver shared benefits."
        },
        {
            "text": "The programme forms part of the government’s wider work to improve the natural environment, including the revised Environmental Improvement Plan (EIP) published on 1 December, which sets out a 5-year approach to tackling the nature and climate crisis, improving public health and supporting sustainable growth. "
        },
        {
            "text": "To keep up to date with the work of the farming and countryside programme and projects like these, you can subscribe to the Farming blog."
        }
    ]
}