{
    "url": "https://mojdigital.blog.gov.uk/2025/12/23/the-small-services-space-one-year-on-learnings-and-ambitions/",
    "title": "The Small Services Space One Year On: Learnings and Ambitions",
    "authors": [
        "Emma Harley"
    ],
    "categories": [
        "collaboration",
        "dog handler records",
        "Our services",
        "Small Services Space"
    ],
    "pub_date": "2025-12-23T10:48:48+01:00",
    "content": [
        {
            "text": "The Shared Infrastructure team in Justice Digital launched an innovative new product (The Small Services Space) just over 12 months ago. It aims to support smaller teams who have a need, and desire, to modernise or mature using digital solutions but don't always have the skills and experience to achieve their vision. The team set out to provide as much end-to-end support as needed from scoping solutions through to deploying a production service as part of the Small Services Space product."
        },
        {
            "text": "The benefits of modernisation are well documented in terms of saving money, reducing man-hours, and improving user experience, but there are much broader benefits in terms of reputation, governance, and assurance. These are benefits the Shared Infrastructure team was committed to helping teams realise."
        },
        {
            "text": "The past 12 months have been a huge learning curve, and it’s a good point to reflect on the value and impact the service has had. Here are some of the things the Small Services Space has enabled teams to achieve by supporting them to solve their problems digitally."
        },
        {
            "text": "Dog handler records"
        },
        {
            "text": "The National Dog Inspectorate has been rolling out a solution to go paperless for all dog handler records using the Small Service Space."
        },
        {
            "text": "The solution is being rolled out over 12 months and is already live in a wide range of dog teams and sections across the Country (from Wales, Hertfordshire, Essex & Suffolk, Bedfordshire, Cambridgeshire Norfolk & the Isle of Wight, to name but a few). It will be everywhere by Christmas. This iterative implementation has allowed collaboration with our supplier ensuring a robust, user-friendly system tailored to operational needs, supported by high quality training & support."
        },
        {
            "text": "Qualitative benefits such as remote access (via any MoJ device over VPN means work can be done anytime, anywhere), enhanced data protection (all data is held to OFFICIAL categorisation standards), business continuity (digitised data can be recovered quickly in case of loss or disaster) standardised data (eliminates repetitive work an enables mass data entry) and searchable records (supporting rapid incident and operational responsiveness) are clear."
        },
        {
            "text": "We have significant quantifiable benefits, too. These figures are conservative estimates based on a small sample size, but they demonstrate a strong return."
        },
        {
            "text": "The National Dog Inspectorate has saved 3,000 hours in staff admin overheads this year, thanks to more efficient assessments. Data can now be accessed from anywhere, eliminating the need to locate a physical record book and search for relevant entries."
        },
        {
            "text": "In each dog section, trainers have eliminated 1,760 hours of admin work over the past year. The software has already been rolled out across 10 sections, that’s an enormous 17,600 hours now freed up to focus on delivering training instead of documenting and reporting it."
        },
        {
            "text": "By bringing hosting in-house rather than using a third-party provider, we have achieved significant annual savings. Moving away from paper-based dog record books has also reduced costs, but the real benefit comes from the time saved. By transforming our ways of working and adopting a digital approach, we have avoided substantial expenditure of staff time."
        },
        {
            "text": "The National Dog Inspectorate can demonstrate savings and cost avoidance many times greater than the cost of hosting and operating the system internally and they are not finished yet"
        },
        {
            "text": "The aim is to be completely paperless, with all dog licences and records fully digitised by January 2026 and paper records archived by June 2026. They also plan to onboard private sector dog records so that staff who need them can access them easily. A comprehensive quality assurance audit will be conducted to ensure data accuracy and appropriate access levels. They are also working directly with the supplier on software changes to further enhance the system's user-friendliness."
        },
        {
            "text": "The collaboration between ORRU National Dog Inspectorate, the Small Services Space, and our supplier has modernised the way we manage dog records and enabled a fundamental transformation of operations. We have been able to work smarter, reduce costs, and strengthen compliance across the board. Together, we are setting a new standard for public service delivery."
        },
        {
            "text": "Visualising Data"
        },
        {
            "text": "The analyst notebook gives additional options for visualising data and identifying links in various pieces of information much more efficiently. It has the potential to significantly reduce time taken on analysis from days to hours."
        },
        {
            "text": "Analysts have been able to identify patterns and gaps much faster and share those insights in formats more consumable and impactful for audiences. It enables experimentation and innovation regarding reporting where a paragraph of text can be accompanied by an engaging visual."
        },
        {
            "text": "The data used has varied from open-source data, case progress and completion times and stakeholder mapping and focus. The ability to test the versatility of the tool and how it fits into the wider transformation programme continues to be invaluable to our usage strategy moving forward."
        },
        {
            "text": "In addition, as a small team, having a direct relationship with the supplier has been incredible in terms of learning and support. The delivery model for the application through the Small Services Space has really met our needs and we wouldn't hesitate to work with them again"
        },
        {
            "text": "And next?"
        },
        {
            "text": "Change isn’t easy. It needs courage, dedication and innovative thinking. Over the past 12 months, we have worked with some amazing teams to deliver real transformation and learned how to do it more efficiently. We’re not stopping."
        },
        {
            "text": "The Small Services Space is currently undergoing changes to meet even more user needs. We aim to support and enable any small team with the vision and courage to do things differently. If you want to modernise, transform, experiment, or innovate, we are here to help make your vision a reality."
        },
        {
            "text": "Don’t hesitate to get in touch: alzdemand@justice.gov.uk"
        }
    ]
}