{
    "url": "https://defrafmp.blog.gov.uk/2025/12/23/two-years-of-fisheries-management-plans-progress-and-whats-next/",
    "title": "Two years of fisheries management plans: progress and what’s next",
    "authors": [
        "FMP policy team, Defra"
    ],
    "categories": [
        "- Defra led FMPs"
    ],
    "pub_date": "2025-12-23T10:00:00+00:00",
    "content": [
        {
            "text": "It’s been two years since the first fisheries management plans (FMPs) were published."
        },
        {
            "text": "With five more Defra-led plans published last week and Scottish Government consulting on their first 11, it is a good time to look back at what has been achieved so far."
        },
        {
            "text": "FMPs are central to how we manage our fisheries more sustainably, balancing the needs of communities and the environment."
        },
        {
            "heading": 2,
            "text": "What’s gone well"
        },
        {
            "heading": 3,
            "text": "A truly collaborative process"
        },
        {
            "text": "Defra and delivery partners have worked closely with fishermen, and other stakeholders across the UK to develop and begin to implement our FMPs."
        },
        {
            "text": "Collaborative working is at the heart of how we are developing and implementing FMPs.  We would like to thank all of you that have been involved."
        },
        {
            "text": "Engagement events, meetings and new stakeholder groups have brought together commercial and recreational fishermen, and environmental NGOs - often for the first time."
        },
        {
            "text": "Discussions in these groups are essential to make sure each FMP is practical, innovative and responsive to real world needs.   "
        },
        {
            "heading": 3,
            "text": "Improving transparency"
        },
        {
            "text": "We introduced our blog as a trusted place to find updates and explanations on how FMPs are being delivered. It has become a key part of how we share updates and stay open with you. Engagement continues to grow with over 9000 visits to the site this year."
        },
        {
            "text": "We recently launched the FMP directory on the blog. This was a big step to bring together information about each of Defra’s plans. You can find ways to get involved or stay updated with groups that are working on, or give updates on, FMPs."
        },
        {
            "heading": 3,
            "text": "Getting on with implementation"
        },
        {
            "text": "Both Defra and Marine Management Organisation (MMO) have led actions across the published FMPs."
        },
        {
            "text": "New legislation was introduced to help manage flyseine effort in the English Channel.  This legislation also increased the Minimum Conservation Reference Sizes (MCRS) for brill, lemon sole, turbot and crawfish to protect the juveniles of these species."
        },
        {
            "text": "For bass we’ve reviewed both the shore based netting provision and the commercial authorisation system to identify improvements that could be made. We also launched the cuttlefish action plan which concluded a number of actions including a report on improving data found in markets."
        },
        {
            "text": "Looking ahead, new minimum conservation reference sizes (MCRS) for brown crab in the South West  and lobster in England will be brought in early next year. These steps follow the recommended measures in the FMPs."
        },
        {
            "text": "In addition, we’re also designing new effort management systems for scallops, crab and lobster."
        },
        {
            "text": "We have also started work with the European Commission to develop a joint UK/EU Multi Year Strategy on king scallop management. An expert group has been established involving UK and EU scientists to offer independent analysis and advice."
        },
        {
            "heading": 3,
            "text": "Building our evidence base"
        },
        {
            "text": "20 scientific research projects are underway to address key gaps in evidence related to FMPs. These projects are informed and prioritised by a Research and Development (R&D) steering group, with members that represent the views of various stakeholder groups."
        },
        {
            "text": "These projects will improve our understanding of how to manage stocks in a sustainable way. For instance, new stock assessments for species with limited data, like crabs, lobsters, and scallops will give us a better understanding of stock status, and whether measures are needed to ensure these stocks are not over-exploited."
        },
        {
            "text": "Our research will also inform how to reduce carbon emissions in the fishing sector, reduce bycatch, increase survival of discards, help us move towards an ecosystem-based approach to fisheries management, and more. These projects are being delivered by bodies including Cefas and MMO, with support from partners including IFCAs, academia and industry."
        },
        {
            "text": "The aim of the R&D work is to deliver research to address current and emerging evidence gaps and support the implementation of FMP measures and goals in accordance with the objectives listed in the Fisheries Act 2020."
        },
        {
            "heading": 3,
            "text": "Preparing for emerging issues"
        },
        {
            "text": "As well as setting direction for long term development of fisheries, FMP implementation allows us to react to emerging issues."
        },
        {
            "text": "When an octopus bloom appeared in the South West, we supported work to understand its immediate and long-term impacts, co-funding a research project with Plymouth City Council which looked to provide early indications of the nature and likely extent of population change. Working with MMO, we were able to quickly bring in octopus ID cards to help fishermen support both the plan and the future of the fishery."
        },
        {
            "heading": 2,
            "text": "The challenges"
        },
        {
            "text": "Bringing about change across diverse fisheries isn’t simple. Some elements need more time and attention than others."
        },
        {
            "text": "FMPs are ambitious so we need to carefully prioritise what actions happen first, and what can happen in the future based on available resource."
        },
        {
            "text": "Better data is crucial. We’re working to fill the gaps on some species, habitats and social economic impacts to improve decision making."
        },
        {
            "text": "Balancing social, environmental and economic priorities is challenging. Not everyone agrees, but we continue to actively involve individuals and groups to deliver the best outcomes under the Fisheries Act."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "Putting the plans into action is key, as is monitoring results and refining as we learn."
        },
        {
            "text": "Collaboration remains vital as we test and adapt the evidence base and management options, and groups will also play a central role in coordinating delivery and tracking effectiveness."
        },
        {
            "text": "We’re looking forward to continuing to work with you in 2026 and beyond."
        },
        {
            "text": "Make sure you subscribe to the FMP blog to get the latest updates by email."
        }
    ]
}