{
    "url": "https://food.blog.gov.uk/2022/10/07/black-history-month-my-journey-in-science/",
    "title": "Black History Month: My Journey In Science",
    "authors": [
        "Priscilla Wanjiru, Regulated Products Risk Assessor"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-10-07T09:58:35+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Priscilla Wanjiru, Regulated Products Risk Assessor, shares her story as part of Black History Month (BHM) at the Food Standards Agency (FSA)."
        },
        {
            "text": "My journey in science is not one of those regular stories where you hear people say they had a \"deep interest in science\", but I was destined to end up here nonetheless. As a young girl, I wanted to be a pilot. I somehow did well in physics as a subject and planes fascinated me. If there was an afterlife, I would come back as an eagle."
        },
        {
            "text": "By the time I finished secondary school my passion for food had overtaken my interest in aviation. This saw me go for Culinary Arts, ending up as a pastry chef and relocating to the UK (I am originally from Kenya)."
        },
        {
            "text": "After 15 years behind the oven, with a husband, two kids in tow and well into my thirties, I had a big itch to go back to school to study Food Safety. In London, the opportunities to take this degree were limited and only came up as an MSc. I applied and failed as I did not have a science first degree. Cooking is science on its own (Heston Blumenthal or Ferran Adrià will convince you) but my qualifications and experience were not considered as such. But this did not deter me. I enrolled on a Food Science BSc and immediately after onto the Food Safety MSc."
        },
        {
            "heading": 2,
            "text": "\"I would advise anyone that it is never too late to pursue what you love\""
        },
        {
            "text": "Going back into full-time education full-time as a mature student with a family was a bigger challenge than the actual studies. Academically, I realised how beneficial my Science, Technology, Engineering, and Mathematics (STEM) subjects were. I had taken science subjects all the way through secondary school, though not by choice (the school I attended mandated all sciences with the option of dropping one in finals). Without these subjects, it is highly unlikely I would have ended up where I am and certainly, I would have struggled with the scientific aspects of the degrees."
        },
        {
            "text": "During my studies, I got great advice from my supervisor to try as much as possible to take up projects that were industry-based. This hands-on approach helped me in applying all the scientific knowledge I was acquiring. I mostly took up projects in New Product Development (of food) and setting up Food Safety Management Systems. The FSA's work came up a lot all through my career and at some point, I knew I wanted to pursue a role within the organisation."
        },
        {
            "text": "Last year I joined the FSA as a risk assessor for regulated products and there’s never a dull moment. My role is to evaluate and ensure that novel food seeking to be authorised for consumption within the UK is safe and is what it says it is. This assessment involves reviewing various data sets ranging from the product's composition to its intended use."
        },
        {
            "text": "I would advise anyone that it is never too late to pursue what you love, even in science. However, encouraging STEM subjects helps cultivate and steer towards achieving this. Having the foundation laid at an early age is helpful."
        },
        {
            "text": "Remember, the field of science is wide with many different pathways. No goal post is fixed."
        },
        {
            "heading": 1,
            "text": "Mis Hanes Pobl Dduon: Fy Nhaith ym Myd Gwyddoniaeth"
        },
        {
            "text": "Priscilla Wanjiru, Asesydd Risg Cynhyrchion Rheoleiddiedig, yn rhannu ei stori fel rhan o Fis Hanes Pobl Dduon yn yr Asiantaeth Safonau Bwyd (ASB)."
        },
        {
            "text": "Nid yw fy nhaith ym myd gwyddoniaeth yn debyg i’r straeon arferol hynny lle mae pobl yn dweud bod ganddynt ddiddordeb mawr yn y maes. Serch hynny, roeddwn i bob amser yn mynd i gyrraedd lle’r ydw i. Pan oeddwn i’n ferch ifanc, roeddwn i eisiau bod yn beilot. Rhywsut, llwyddais i wneud yn dda mewn ffiseg yn yr ysgol, ac roeddwn i’n dwlu ar awyrennau. Pe bai bywyd ar ôl marwolaeth, byddwn yn dod yn ôl fel eryr."
        },
        {
            "text": "Erbyn i mi orffen yn yr ysgol uwchradd, roedd fy angerdd dros fwyd yn drech na fy niddordeb yn y diwydiant awyrennau. O ganlyniad, astudiais i’r Celfyddydau Coginio, gan weithio fel cogydd crystiau a symud i’r DU (rwy’n dod o Kenya yn wreiddiol)."
        },
        {
            "text": "Ar ôl treulio 15 mlynedd y tu ôl i’r popty, ac er fy mod yn fy nhridegau, gyda gŵr a dau o blant, roeddwn i’n ysu am fynd yn ôl i fyd addysg i astudio Diogelwch Bwyd. Yn Llundain, nid oedd llawer o gyfleoedd i ddilyn y radd hon, a dim ond fel gradd MSc. Cyflwynais gais ond gwnes i fethu gan nad oedd eisoes gen i radd mewn gwyddoniaeth. Mae coginio yn fath o wyddoniaeth (bydd Heston Blumenthal neu Ferran Adrià yn eich argyhoeddi), ond ni chafodd fy nghymwysterau na’m profiad eu hystyried felly. Ond ni wnaeth hyn fy rhwystro. Cofrestrais ar gwrs BSc Gwyddor Bwyd, ac ar y cwrs MSc Diogelwch Bwyd yn syth wedi hynny."
        },
        {
            "heading": 2,
            "text": "“Byddwn yn dweud wrth unrhyw un nad yw hi byth yn rhy hwyr i fynd ar drywydd yr hyn rydych chi’n ei garu.”"
        },
        {
            "text": "Roedd mynd yn ôl i fyd addysg fel myfyriwr aeddfed amser llawn gyda theulu yn fwy o her na’r astudiaethau eu hunain. Yn academaidd, sylweddolais pa mor fuddiol oedd fy mhynciau ym maes gwyddoniaeth, technoleg, peirianneg a mathemateg (STEM). Roeddwn i wedi astudio pynciau gwyddoniaeth yr holl ffordd trwy’r ysgol uwchradd, ond nid fy newis i oedd hynny. (Roedd astudio’r holl wyddorau’n orfodol yn fy ysgol, gyda’r opsiwn o ollwng un yn y flwyddyn olaf). Heb y pynciau hyn, mae’n annhebygol iawn y byddwn wedi cyrraedd lle rydw i, ac yn sicr byddwn wedi cael trafferth gydag agweddau gwyddonol y graddau."
        },
        {
            "text": "Yn ystod fy astudiaethau, cefais gyngor gwych gan fy ngoruchwyliwr, sef ceisio ymgymryd â phrosiectau a oedd yn seiliedig ar y diwydiant. Fe wnaeth y dull ymarferol hwn fy helpu i gymhwyso’r holl wybodaeth wyddonol a oedd gennyf. Ymgymerais yn bennaf â phrosiectau a oedd yn ymwneud â Datblygu Cynhyrchion Newydd (bwyd) a sefydlu Systemau Rheoli Diogelwch Bwyd. Daeth llawer o waith yr ASB i’r amlwg trwy gydol fy ngyrfa, ac roeddwn i’n gwybod fy mod am ddilyn rôl o fewn y sefydliad ar ryw adeg."
        },
        {
            "text": "Y llynedd ymunais â’r ASB fel asesydd risg ar gyfer cynhyrchion rheoleiddiedig, ac mae’n ddifyr drwy’r amser. Fy rôl i yw gwerthuso a sicrhau bod bwydydd newydd sy’n ceisio awdurdodiad i’w bwyta yn y DU yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Mae’r asesiad hwn yn cynnwys adolygu setiau data gwahanol sy’n amrywio o gyfansoddiad y cynnyrch i’r defnydd a fwriedir."
        },
        {
            "text": "Byddwn yn dweud wrth unrhyw un nad yw hi byth yn rhy hwyr i fynd ar drywydd yr hyn rydych chi’n ei garu, hyd yn oed ym maes gwyddoniaeth. Fodd bynnag, mae annog astudio pynciau STEM yn helpu i’ch meithrin a’ch llywio tuag at gyflawni hyn. Mae gosod y sylfaen yn ifanc yn ddefnyddiol."
        },
        {
            "text": "Cofiwch: mae maes gwyddoniaeth yn un mawr gyda llawer o wahanol lwybrau. Nid yw unrhyw nod yn sefydlog."
        }
    ]
}