{
    "url": "https://dfedigital.blog.gov.uk/2022/10/07/language-barrier/",
    "title": "Breaking down the language barrier",
    "authors": [
        "Courtney Brightwell, head of insight and service design"
    ],
    "categories": [
        "Agile",
        "design"
    ],
    "pub_date": "2022-10-07T15:40:03+01:00",
    "content": [
        {
            "text": "Do you work in an organisation with a digital department, team or division? Do non-digital colleagues look at you as though you’re speaking a made-up language?"
        },
        {
            "text": "This is a challenge I’ve experienced several times. Especially when I bring user researchers and designers together with other professions for the first time. Not everyone understands, or is familiar with, digital and agile terminology."
        },
        {
            "text": "Recently I blogged about how our design sprint had brought together experts from digital and non-digital fields. Both groups speak in jargon-heavy language, so they have a tendency to stick with colleagues in their profession with whom they feel more comfortable and better understood. This creates siloed working."
        },
        {
            "heading": 2,
            "text": "Manual for me"
        },
        {
            "text": "We wanted to break down silos and the language barrier so we started by creating a ‘Manual for Me’ each."
        },
        {
            "text": "Manuals show what makes a person engaged and excited at work, and what puts them off."
        },
        {
            "text": "I felt it was important for us all to be open about our styles and personalities–this would give us a better idea of how to work with each other, and how to get the best out of the team."
        },
        {
            "heading": 2,
            "text": "Rephrase again and again"
        },
        {
            "text": "Next, with our manuals in mind, we ran a number of collaborative sessions in which we discussed and critiqued each other’s ideas and approaches. We did this in an objective, non-judgemental way."
        },
        {
            "text": "Each session helped us understand what was important to people and why, and how their professional discipline framed the way they looked at a problem. By continually rephrasing different points, team members started to better understand each others’ perspectives."
        },
        {
            "text": "As well as the sprint being a superb way of getting the commercial specialists excited about, and involved in, user-centred design, it was also a brilliant way for designers to fully understand how the commercial aspects will impact their service prototype."
        },
        {
            "text": "By working face to face on a number of tasks during the week, the team’s appreciation and understanding of each other’s roles, style and language deepened. We built a rapport, bridged the language gap, and designed a prototype."
        },
        {
            "text": "It sounds simple, but all of us now recognise the importance of speaking and writing in plain English. As the saying goes - it’s not dumbing down, it’s opening up. I think this is so important for developing an organisation’s potential for user-centred design."
        }
    ]
}