{
    "url": "https://naturalengland.blog.gov.uk/2022/10/07/penwith-moors-site-of-special-scientific-interest-cornwalls-western-most-landscape-receives-further-accolade-of-sssi-designation/",
    "title": "Penwith Moors Site of Special Scientific Interest; Cornwall’s western-most landscape receives further accolade of SSSI designation",
    "authors": [
        "Mark Beard"
    ],
    "categories": [
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2022-10-07T08:56:43+01:00",
    "content": [
        {
            "text": "By Mark Beard - Penwith Moors SSSI designation project manager"
        },
        {
            "text": "The designation of a new Site of Special Scientific Interest (SSSI) is a reminder that, as a society, we value the special place nature plays in enriching our lives, protecting the natural systems which sustain us and underpinning our sense of place. SSSIs represent the finest places for nature in Britain and SSSI designation is a recognition that the rich fabric of our natural world is precious and our most important wildlife sites should be protected for future generations."
        },
        {
            "text": "Penwith Moors, an extensive area of heathland, acid grassland and wetlands is such a place. This wild landscape in the far west of Cornwall is already well recognised for its cultural importance and now its national importance for wildlife has been reflected in its designation as an SSSI."
        },
        {
            "text": "The decision to take forward SSSI designation is not taken lightly by Natural England. It can only happen after a great deal of work to collate, assess and present scientific data and to communicate the findings with people who have an interest in the site."
        },
        {
            "text": "The Penwith Moors SSSI is a wild landscape of heath, bog and rocky hill-tops occupying the brooding granite hills that define the spectacular, wind-swept peninsula of land between Land’s End and St Ives.  This landscape supports one of the largest expanses of lowland heath in Britain, a habitat characterised by ‘dwarf-shrub’ plants such as heather and gorse.  Valley mires (wet acid peat-forming bogs) occupy some of the lower ground and support wetland plants such as cotton-grass, bog asphodel and bog-mosses that are dependent on the supply of clean unpolluted water."
        },
        {
            "text": "This new designation reflects the rich diversity of flowering-plants, lichens, insects and birds that find their home on the Penwith Moors.  One species, coral necklace,  is a rare plant which grows along wet trackways; nationally it’s population has rapidly declined in recent decades but Penwith Moors remains one of its few remaining strongholds.  Over 600 insect species have been recorded including the rare Perkin's mining bee and tormentil nomad bee.  There are over 200 species of beetle and the moors are also home to a nationally important population of nesting Dartford warbler, a bird associated with heathland habitats."
        },
        {
            "text": "This wealth of nature is a product not only of the granite geology and all the weather the Atlantic throws at this exposed peninsula, but also of the tradition of livestock grazing.  The designation of Penwith Moors as a SSSI is a testament to the stewardship of past and present generations of Cornish farmers and small-holders who have shaped the landscape."
        },
        {
            "text": "This is a landscape of great cultural value too.  The hills have been inhabited by people for millennia as evidenced by the bronze-age and iron-age burial chambers and hut circles.  There are medieval field systems along with 19th Century engine houses from mining of tin and copper.  The SSSI designation reflects how people have shaped nature found in this rich historic landscape."
        },
        {
            "text": "The SSSI designation will help protect this special place for current and future generations to enjoy with much of the SSSI already accessible by public rights of way or is open access.  SSSI designation can help promote the management for wildlife to thrive, such as cattle-grazing during the summer months to maintain the open heathland."
        },
        {
            "text": "Unusually, Penwith Moors SSSI also includes some areas of farmland around wetland features.  This is because the valley mires are dependant on rainwater which falls in their catchments.  The inclusion of land within these valley mire catchments within the SSSI reflects the important role this land plays in supplying the clean water on which the ecology of these valley mires depend.  Natural England will work with farmers in these catchments to put in place farming management that protects these fragile and vulnerable wetlands."
        },
        {
            "text": "Natural England has a vision for Penwith Moors SSSI to be a place where nature can flourish and act as a wildlife reservoir from which nature can spread out into the wider landscape, helping stem the biodiversity losses that has affected much of our countryside and enable wildlife to start to recover to the benefit of us all.  We hope others will share that vision but we also recognise that these are challenging times for farming.  In understanding this we aim to work in partnership with local farmers to support them in delivering the best possible management to sustain nature in the SSSI and in the surrounding countryside alongside running their farm business."
        },
        {
            "text": "The designation of any SSSI is the culmination of a lot of work to gather information about the ecology of the site and assess this against the national SSSI selection guidelines to ensure a robust case.  We have also worked hard at engaging with landowners, tenants and other occupiers of the SSSI to ensure they are aware of the SSSI notification and the evidence that supports it, the importance of the site for nature and the possible implications for their land management."
        },
        {
            "text": "Following designation a formal four-month consultation will allow stakeholders to have their say. It is a long overdue recognition of the importance of the Penwith Moors for nature and a valued addition to the SSSI family that should be celebrated."
        }
    ]
}