{
    "url": "https://disabilityunit.blog.gov.uk/2022/10/07/supporting-disabled-people-with-the-cost-of-living-this-autumn/",
    "title": "Supporting disabled people with the cost of living this autumn",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Policy"
    ],
    "pub_date": "2022-10-07T14:59:21+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Countries around the world are facing rising goods and energy prices, inflation and cost of living pressures after the pandemic and the conflict in Ukraine.  "
        },
        {
            "heading": 3,
            "text": "Disabled people in particular, often have additional costs from using extra heating, water use, personal care or needing special equipment in their daily lives. That’s why the government is providing specific support for disabled people this autumn."
        },
        {
            "heading": 2,
            "text": "Getting what you are entitled to"
        },
        {
            "text": "There are already a range of benefits and financial support available if you’re disabled or have a health condition. If you’re not sure what you’re entitled to, or whether you’re claiming the right benefits, you can check here:"
        },
        {
            "text": "If you live in England or Wales:"
        },
        {
            "text": "https://www.gov.uk/browse/benefits/disability "
        },
        {
            "text": "If you live in Scotland:"
        },
        {
            "text": "https://www.mygov.scot/browse/benefits/disability-benefits "
        },
        {
            "text": "If you live in Northern Ireland:"
        },
        {
            "text": "https://www.nidirect.gov.uk/information-and-services/benefits-and-financial-support/disability "
        },
        {
            "heading": 2,
            "text": "Government support for Cost of Living "
        },
        {
            "text": "There are a series of government interventions available for those who need the most help with rising costs, which includes disabled people. These include: "
        },
        {
            "heading": 3,
            "text": "1. £150 Cost of Living Payment for disabled people in September"
        },
        {
            "text": "From 20 September, 6 million people who were paid certain disability benefits on 25 May, or are subsequently found to be entitled to payment for that day, will receive an automatic one-off £150 payment. There is no requirement for you to apply for this payment as it will be made automatically. "
        },
        {
            "text": "This Disability Cost of Living Payment is paid to individuals, so multiple disabled people within the same household will each receive this payment."
        },
        {
            "text": "This £150 disability payment is on top of the £1,200 most low income benefit claimants will also receive and alongside wider support targeted at disabled people, including help with transport and prescription costs."
        },
        {
            "text": "Most of these payments have now been made. "
        },
        {
            "heading": 3,
            "text": "2. £650 Cost of Living Payment for people receiving means-tested benefits in summer and autumn"
        },
        {
            "text": "Disabled people who receive specific means-tested benefits can receive a total of of £650 in two automatic Cost of Living payments."
        },
        {
            "text": "This will be made automatically in two payments, one at £326 in summer and at £324 in the autumn. If you already receive the eligible benefits you do not need to do anything, the payment will be made automatically."
        },
        {
            "text": "To get the first payment you must have:"
        },
        {
            "text": "To get the second payment you must have: "
        },
        {
            "text": "The second payment will be paid from 8th November 2022.  "
        },
        {
            "text": "Check if you’re eligible for Cost of Living Payments"
        },
        {
            "heading": 3,
            "text": "3. Support for all:"
        },
        {
            "text": "In September the Government announced the Energy Price Guarantee, meaning a typical household will pay no more than £2500 a year on their energy bill for the next two years. This will save the average household £1000 a year on energy prices, compared to the forecast price rise before the Energy Price Guarantee was introduced. "
        },
        {
            "text": "This comes on top of other universal support including the £400 for all households to help with energy bills, and an extra £150 for properties in Council Tax bands A to D in England. You do not need to do anything, this payment will be made automatically based on your Council Tax band."
        },
        {
            "text": "The Household Support Fund has also been expanded to help people with food and energy bills. This is planned to run from October 2022 to March 2023. Please visit your local authority to find out more information."
        },
        {
            "heading": 2,
            "text": "Check out help from your energy provider "
        },
        {
            "text": "Many of the main utility companies and regulators are offering extra support to their customers, particularly those with more complex needs. "
        },
        {
            "text": "Depending on your circumstances you may be eligible for extra help with energy bills or services, such as debt repayment plans, payment breaks, emergency credit for prepayment metered customers, priority support and schemes like the Winter Fuel Payment or Warm Home Discount rebate. "
        },
        {
            "text": "You can also get extra help through the Priority Services Register, which is a free support service offered by energy suppliers and network operators to help people in vulnerable situations. To check eligibility and register contact your energy supplier or network operator. "
        },
        {
            "text": "Energy suppliers are also providing tips on how to save on energy, so have a look at the website of your energy provider to see if anything is helpful to you.  "
        },
        {
            "text": "To make sure you are getting all the support on offer and to read more about the government’s cost of living support please go to the Help for Households webpage to find out more."
        }
    ]
}