{
    "url": "https://defradigital.blog.gov.uk/2022/10/07/the-value-of-feedback-part-two-top-tips-on-giving-and-getting-feedback/",
    "title": "The value of feedback: Part Two - top tips on giving and getting feedback",
    "authors": [
        "Leyla Kee-McParlin"
    ],
    "categories": [
        "Defra content design",
        "User centred design"
    ],
    "pub_date": "2022-10-07T07:30:07+01:00",
    "content": [
        {
            "text": "In the second part of her blog on feedback Lead Content Designer Leyla Kee-McParlin shares some top tips for giving and receiving feedback, and the things you can do if you want to explore this topic further."
        },
        {
            "text": "As I wrote in the first part of this blog, I’m not an expert when it comes to giving feedback but here are the top three things I’ve learned in my first year as a civil service leader"
        },
        {
            "heading": 3,
            "text": "Understand your responsibilities"
        },
        {
            "text": "With your feedback, it goes a long way if you consider everything (no matter how small) from timing to delivery, language to how much you give. Be sympathetic, and don’t criticise or condemn. Feedback must be helpful, not overly directive. It shouldn’t contain excessive amounts of information. At best, giving someone an ill-thought-out bit of feedback could interrupt their flow, not be specific enough, or not align well with their values or personality."
        },
        {
            "text": "At worst, it can be clumsy, too tough and sound like heavy criticism. You must take personal responsibility for everything you say, including your non-verbal language. That person is counting on you to support them in receiving a tough message. You need to be sensitive with their emotional wellbeing. Balance the message with positive statements but use words that are neutral and without emotional emphasis."
        },
        {
            "heading": 3,
            "text": "Awake “that eager want” in someone"
        },
        {
            "text": "This term comes from Dale Carnegie, the author of ‘How to Win Friends and Influence People’. Do this by finding out what their strengths and interests are. Keep these interests in mind with everything you say. Their interests will be heavily linked to what they see as their values and contributions."
        },
        {
            "text": "When I worked as an account manager in digital agencies, I’d benchmark my performance against a few key measurable things, including quarterly sales, monthly revenue, monthly profit margins and customer satisfaction scores."
        },
        {
            "heading": 3,
            "text": "Listen more than you talk"
        },
        {
            "text": "Being a good listener is seriously underrated. I started by saying feedback should always be constructive, so how will you be constructive if you do not let them talk about themselves? They may start on a negative point, but you should let this come out. Resist the urge to influence them too much and confuse their flow."
        },
        {
            "text": "Their negativity will reveal more about their challenges, how they see themselves and how they talk about themselves. Remember, their challenges are there to be overcome. I like to use questions to get them to explore their own thoughts: “What do you think is causing this?” “What else is this related to? Gentle enquiry is a much more effective way to influence self-observation and positive reflection. Remember that they could shut down, but this is ok. Respect them and stay sensitive."
        },
        {
            "heading": 2,
            "text": "Getting is as important as giving: three tips"
        },
        {
            "text": "No one is above getting feedback, no matter what level you’re at or what stage in your career. Remember what Adam Grant said in my previous post about strong people and their critics? That’s a crucial ingredient of that famous “growth mindset” recipe!"
        },
        {
            "heading": 3,
            "text": "Make a public commitment to getting feedback"
        },
        {
            "text": "If you’re open to feedback then people will be open with you, especially your teams or the people you support. When I’ve done this myself, one of the results was that my colleagues said I appeared more “normal”!"
        },
        {
            "text": "Younger Leyla would’ve been tough on herself and want to appear like “I’ve got this, no one worry”. But, uttering my imperfections out loud demonstrates that I’m self-aware, I have room to grow, and I want to work on myself. Role modelling humility is incredibly powerful."
        },
        {
            "heading": 3,
            "text": "Ask questions"
        },
        {
            "text": "Feedback needs to be something that you can do something about. If you don't understand exactly what you could do to act on a piece of feedback you've been given, ask. It’s normal to feel anxious about this. Questions help us explore our choices and help us shift our perspective. When perspectives change, other avenues appear."
        },
        {
            "text": "Remember, when you ask questions to the person who has given you feedback, stay clear of arguments and never say “you’re wrong”. Show some respect, thank them for their views and manage your emotions as best as you can. Remember to take responsibility and focus on curbing your frustration or the need to take control."
        },
        {
            "heading": 3,
            "text": "Commit to self-improvement"
        },
        {
            "text": "I’m a huge sports fan (football, Formula 1, you name it I watch it) so sports psychology is a pet passion of mine. Elite athletes are motivated by continuously challenging themselves and smashing personal bests. To do this, they have analysts who give them the facts so they can act on them."
        },
        {
            "text": "Whilst you may not be blessed with a team of personal analysts, you do have the power to push yourself further than you think to learn new skills, take on different responsibilities and make sustainable gains."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "If you’d like to explore this further - talk to me! I want to hear from you! I’m keen to hear about:"
        },
        {
            "text": "Let me know in the comments or feel free to start a conversation with me on Twitter @TheRealLeyla."
        }
    ]
}