{
    "url": "https://space.blog.gov.uk/2022/10/07/the-stem-projects-helping-young-people-reach-for-the-stars/",
    "title": "The STEM projects helping young people reach for the stars",
    "authors": [
        "Phil Weaver"
    ],
    "categories": [
        "Education",
        "Funding"
    ],
    "pub_date": "2022-10-07T14:35:46+01:00",
    "content": [
        {
            "text": "The UK Space Agency has supported eight projects with £65,000 to engage young people across the country in STEM learning and make space careers more accessible, through the 2022 Space for All scheme."
        },
        {
            "text": "One project already completed for the year is STEM Create’s Martian Explorers Mars Rover, which saw key stage 2 and 3 children in Bradford build their own working Mars rover prototypes, giving them an understanding of how exploration robots work and why they are so important."
        },
        {
            "text": "Dave Hudson, STEM Create Education Consultant and Founder explains how the project took off. "
        },
        {
            "text": "We started this programme in 2018 when assembly began on the Rosalind Franklin Mars rover in the UK, with the aim of inspiring young people to engage with science and engineering and make them feel like a part of this exciting, real-world event. "
        },
        {
            "text": "The scheme comprised a package of resources, including a hands-on workshop where student groups could build their own working models of the rover using simple electrical and pneumatic systems, as well as wheels, pulleys and traditional craft materials, such as lolly sticks to recreate the rover’s grabber arm. "
        },
        {
            "text": "With £1,951 UK Space Agency funding, we’ve been able to provide this programme to four schools in the area, but we are keen to reach at least 10. We’ve delivered it to small classes, and to larger group of up to 150 at a time. "
        },
        {
            "text": "The students always really enjoy the project, not just because of the space theme, but the format of the learning as well. "
        },
        {
            "text": "We work with many children who have special educational needs, or who simply learn better through physical activities, so projects like this give those students a chance to develop core practical skills in an educational and social environment. It also gives all students a chance to reconnect and develop team-building skills after so much time lost to the pandemic."
        },
        {
            "text": "Take a look at some of the other projects being funded by the Space for All scheme this year. "
        },
        {
            "text": "University of Wolverhampton: Home is where the habitat is "
        },
        {
            "text": "The award-winning STEM response team from the University of Wolverhampton will create an interactive event that considers how we could live on other planets. This workshop for schools, teachers and public allows discovery of space careers and the STEM subjects involved through creativity and shows that it is not just astronauts that work in the space industry. "
        },
        {
            "text": "Truro and Penwith College: Space Camp Cornwall "
        },
        {
            "text": "This new non-residential summer camp will inspire and inform young people about a career in the space sector through industry visits, hands-on STEM challenges, and talks from experts in the sector. Space Camp Cornwall will focus on pupils in years 10 and 11 in areas less likely to move into higher and further education, to provide them with practical STEM careers advice. "
        },
        {
            "text": "Mangorolla CIC: I’m in Space, get me out of here "
        },
        {
            "text": "This online project will connect school students from diverse backgrounds across the UK with relatable space scientists and engineers, through student-led Q&As and live chats showing young people the exciting science happening in the sector. The virtual format will reach students far from research centres, letting everyone create personal connections with scientists and engineers. "
        },
        {
            "text": "University of Birmingham: Let’s move to the Moon! "
        },
        {
            "text": "Do you want to live on the Moon? This exciting suitcase challenge will invite children aged 11-14 to explore the materials science challenges of space travel. Their missions will include learning how to get to the Moon, deciding what to take with them, and discovering what they can make once there. "
        },
        {
            "text": "UKSEDS: UKSEDS Space Roadshow "
        },
        {
            "text": "The UKSEDS Space Roadshow is taking place over the autumn and is open to audiences across the UK. Families will be given the chance to learn about exciting space topics and potential careers in the space industry. Activities developed for the roadshow will be re-used by the UKSEDS outreach team in the future for engagement with school students through workshops and careers talks. "
        },
        {
            "text": "Inspiron Learning CIC: Climate change: Scientists and engineers needed "
        },
        {
            "text": "This project will demonstrate how a STEM career can contribute to climate action by sharing examples of space exploration programmes that combat climate change and showcasing transferable technologies and practices for a more sustainable Earth, such as recycling systems on the International Space Station and emerging hydrogen technologies. This project will highlight the need for astronauts to be diverse and that space is for all. "
        },
        {
            "text": "Management Networking Ltd: Taking SpaceTeams to the classroom "
        },
        {
            "text": "This inspiring, free online cross-curricular space resource for primary school children and their teachers is fun and easy to use. Pupils will work together as crew on a virtual journey to Mars, completing space themed STEAM challenges on the way with assistance from real space industry professionals, engaging videos and downloadable resources. "
        }
    ]
}