{
    "url": "https://educationhub.blog.gov.uk/2022/10/07/the-school-census-what-you-need-to-know/",
    "title": "The School Census – what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-10-07T16:07:36+01:00",
    "content": [
        {
            "text": "One of our key roles is monitoring the school system to understand how well it is working and how things are changing. A key tool in doing this is the School Census, which is where we gather information about how many young people are in the school system, their backgrounds, their needs and more."
        },
        {
            "text": "Here we answer your questions on the School Census."
        },
        {
            "heading": 3,
            "text": "What is the School Census?"
        },
        {
            "text": "The School Census collects information from primary schools, secondary schools, special schools, maintained nurseries and academies and pupil referral units three times a year. It’s done electronically and private schools are not included."
        },
        {
            "heading": 3,
            "text": "What data do you collect?"
        },
        {
            "text": "The census collects information like pupil’s background details, special educational needs, free school meals eligibility, as well as educational history."
        },
        {
            "text": "It also collects data on absence, exclusions and their reasons, indicators of armed forces or children in care."
        },
        {
            "text": "The data, creates a \"lifetime school record\" of characteristics, testing and tracking to form a single longitudinal record over time."
        },
        {
            "text": "Information about what data items are included in the census is available here."
        },
        {
            "heading": 3,
            "text": "Why do you collect information about children? "
        },
        {
            "text": "Collecting this data is important as it helps us develop a picture of the education sector, including how well it is performing."
        },
        {
            "text": "It also helps determine core school funding, which pupils attract pupil premium, support for disadvantaged students, universal infant free school meals funding and free early years entitlement allocations."
        },
        {
            "heading": 3,
            "text": "Do you publish the information you gather?"
        },
        {
            "text": "No information about individuals is published, but we do publish data on pupil numbers and their characteristics and there are individual releases on absence, suspensions and permanent exclusions and special educational needs. The census also provides contextual data on other releases, such as attainment by pupil characteristics. All of the Department’s statistical releases can be found here."
        },
        {
            "text": "In very limited circumstances organisations can apply to access pupil level data from the National Pupil Database. This only happens where it is necessary and essential. You can find out more here."
        },
        {
            "text": "More information for education settings on the school census is available here: Complete the school census - Data items 2022 to 2023 - Guidance - GOV.UK (www.gov.uk)."
        }
    ]
}