{
    "url": "https://environmentagency.blog.gov.uk/2023/09/20/creating-a-wildlife-corridor-in-the-river-lugg/",
    "title": "Creating a Wildlife Corridor in the River Lugg",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Flood Maintenance"
    ],
    "pub_date": "2023-09-20T15:43:13+00:00",
    "content": [
        {
            "text": "Jude Ward, Biodiversity Technical Specialist, West Midlands"
        },
        {
            "text": "The Environment Agency maintains a number of flood and coastal defence assets across 7000km of river. It’s my job as a biodiversity technical specialist to ensure these assets are maintained, repaired, and created in a way that helps maintain - and ideally improve - the river’s ability to function as a wildlife corridor."
        },
        {
            "text": "Unfortunately, as an organisation we’ve inherited assets which were designed in the 1970s, when a river’s primary function was seen as drainage, and often at the expense of riverine habitat."
        },
        {
            "text": "The River Lugg bypass channel in Herefordshire, with its straight profile and steep and treeless banks, is an example of this. “It’s not just birds that live in trees!”, I exclaim after looking into a section of the river - a watercourse designated as both a Site of Special Scientific Interest (SSSI), Special Area of Conservation (SAC) as well as an important salmonid (brown trout and Atlantic salmon) river."
        },
        {
            "text": "Fish in rivers rely on trees to shade the river, keeping it cool and well oxygenated. Additionally, trees can stimulate habitat formation as their roots and branches interact with flow to scour pools in some areas and sheltered backwaters in others."
        },
        {
            "text": "Leaf litter, fallen limbs and roots of trees also support a range of aquatic invertebrates which form the base of a complex food pyramid for fish, birds, and mammals. Although they obviously don’t build a nest high up in the boughs of a tree, like birds do, many freshwater fish are nevertheless reliant on riparian trees for shelter, food and habitat."
        },
        {
            "text": "I was recently approached by the flood and coastal risk management team to provide ecological advice on a flood wall repair on the Lugg. Together we developed several natural solutions which could be used to both repair the asset and improve the local habitat value of the site."
        },
        {
            "text": "To stimulate the effect of riparian trees in the channel, we used alder trunks coppiced from local tree works and wedged them into the bank before securing them to the bed, to make sure they wouldn’t wash away in high flows."
        },
        {
            "text": "These in-channel deflectors created a series of deeper cooler pools for fish to occupy in high flows, and gravel riffles which provide excellent spawning habitat for salmonids as well as substrate for water crowfoot. The wood also provides a food source for aquatic invertebrates which in turn feed local fish."
        },
        {
            "text": "Although the flood wall repair required elements of hard engineering, the project team were eager to incorporate options which maximised the asset’s habitat value. Using a Geogrow® rootlock system, a vegetated wall seeded with riverine plants was established on the banks of the river."
        },
        {
            "text": "Where a concrete walkway was needed for outfall inspections, the face of this was laid with nature bricks. The random cracks and fissures displayed on each nature brick may seem haphazard however they act to disperse flow and provide shelter for invertebrates such as white-clawed crayfish. Plants can also establish in these crevices, increasing habitat niches which would be absent if smooth concrete was used."
        },
        {
            "text": "This project is a great example of how the Environment Agency, in partnership with landowners, can use natural solutions in maintaining flood defence assets to improve the environment for both people and wildlife."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}