{
    "url": "https://ukhsa.blog.gov.uk/2023/09/20/get-winter-strong-why-having-a-flu-vaccination-matters/",
    "title": "Get Winter Strong: why having a flu vaccination matters",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "flu"
    ],
    "pub_date": "2023-09-20T15:05:51+01:00",
    "content": [
        {
            "text": "Despite the recent hot and sunny weather, winter is coming, and with it comes an increased risk of catching flu.  Flu can leave many of us feeling dreadful and laid up in bed for days, but for certain groups, the effects can be more severe or even life-threatening."
        },
        {
            "heading": 2,
            "text": "Who is most at risk?"
        },
        {
            "text": "People in older age groups, children 2 to 3 years old, pregnant women and those with certain health conditions are most at risk of getting seriously ill with flu. But the good news is they can help protect themselves by getting the flu vaccine."
        },
        {
            "heading": 2,
            "text": "Who is eligible?"
        },
        {
            "text": "If you’re vulnerable to flu you should take advantage of the vaccine to keep yourself well and winter strong."
        },
        {
            "text": "The following groups are eligible for a free flu vaccine:"
        },
        {
            "text": "Find eligibility details on the NHS website."
        },
        {
            "heading": 2,
            "text": "Does the vaccine actually help?"
        },
        {
            "text": "Last winter, getting vaccinated against flu cut the risk of being hospitalised by around:"
        },
        {
            "heading": 2,
            "text": "Can flu harm children?"
        },
        {
            "text": "Flu can be a very unpleasant illness in children, and  for some, flu can lead to hospitalisation, and even death in rare cases."
        },
        {
            "text": "Last winter, over 10,000 children were hospitalised due to flu, and many of these could have been prevented by getting the vaccine."
        },
        {
            "text": "Children are offered the vaccine in the form of a quick and painless nasal spray vaccine, so it couldn’t be easier."
        },
        {
            "text": "Most children get it through their school, so parents should make sure to sign and return the consent form. For pre-schoolers, parents will be invited to bring their child forward in the coming weeks, or alternatively you can contact your GP practice to make an appointment."
        },
        {
            "heading": 2,
            "text": "Does the vaccine protect children against flu?"
        },
        {
            "text": "As well as helping to give children protection against flu, the vaccine also helps stop them passing it to elderly relatives such as grandparents, who will be more vulnerable."
        },
        {
            "text": "Because so many infections can be passed on in school, high vaccination uptake among children can also help prevent the spread of infection in the wider community."
        },
        {
            "text": "After vaccination, some kids may get mild side effects like a runny nose, but the vaccine cannot actually give them flu."
        },
        {
            "heading": 2,
            "text": "Should pregnant women have a flu vaccination?"
        },
        {
            "text": "All pregnant women are encouraged to get vaccinated to protect themselves and their unborn babies. Being pregnant changes how your body fights infections like the flu and catching it while pregnant increases your risk and your baby's risk of complications which may result in a stay in intensive care, or even death."
        },
        {
            "text": "The flu vaccine can be given safely to expectant mothers at any stage of pregnancy, even right from the start. You can speak to your GP practice, pharmacist or midwife now about booking a flu jab appointment."
        },
        {
            "heading": 2,
            "text": "What about those with underlying health conditions?"
        },
        {
            "text": "Individuals with certain underlying health conditions are eligible for a free flu vaccine. Conditions that would make someone eligible include those with:"
        },
        {
            "text": "A full list of who is eligible is available on the NHS website."
        },
        {
            "heading": 2,
            "text": "When can I book?"
        },
        {
            "text": "The National Booking system for flu vaccine will go live in a couple of weeks but some GP practices are already inviting people to attend. The vaccines are delivered in the autumn to provide protection before infection rates rise. Most eligible adults can get their flu vaccine at their GP practice or a local pharmacy now."
        },
        {
            "text": "Even if you were vaccinated last year, it is important to get your jab again this flu season because the viruses can change year to year and protection decreases over time."
        },
        {
            "text": "The best defence is to get your vaccine before the virus starts circulating. If you’re eligible, please take advantage of this preventative measure to keep yourself well and winter strong."
        }
    ]
}