{
    "url": "https://teaching.blog.gov.uk/2023/09/20/how-our-school-is-managing-teacher-workload/",
    "title": "How our school is managing teacher workload",
    "authors": [
        "Aaishah Khan",
        "Elizabeth Whetham",
        "Megan Humphreys"
    ],
    "categories": [
        "Reducing teacher workload",
        "Teacher wellbeing"
    ],
    "pub_date": "2023-09-20T10:46:43+01:00",
    "content": [
        {
            "text": "In this blog post teachers at Westminster Primary School in Bradford share how they’ve reduced workload and improved teacher wellbeing through using the workload reduction toolkit."
        },
        {
            "text": "Culture eats strategy for breakfast. "
        },
        {
            "text": "It's really important that managing workload in school isn’t seen as a tick box exercise. We use the expression at Westminster of ‘doing less better’."
        },
        {
            "text": "We find quick fixes - stop doing tasks that have little benefit to the children and focus staff’s energy on doing things that have the biggest impact. We challenge the status quo - just because something has always been done that way doesn't mean it should be. We look at data and evaluate our policy and practices."
        },
        {
            "text": "Culture eats strategy for breakfast, and all of our practices to reduce workload for staff – managing expectations, communication and most importantly, having good relationships - are embedded in the heart of our school."
        },
        {
            "text": "As an employer, I have a duty of care to my staff. As well as improving outcomes for children, we always consider teachers workload and wellbeing."
        },
        {
            "text": "Elizabeth Whetham, former executive principal at Westminster Primary School"
        },
        {
            "text": "What does ‘doing less better’ look like? "
        },
        {
            "text": "We have a whole school approach to monitoring and evaluating the curriculum. Each week we have a subject leadership afternoon in which we undertake all of our subject monitoring. This takes place within the school day, and we’re able to look at books, progression and undertake pupil voice."
        },
        {
            "text": "We’ve reduced the number of duplicated forms, making sure that when collecting data, there’s always a clear purpose."
        },
        {
            "text": "At the end of each academic topic, the children are given a learning review. Not only does this allow the children to become more reflective, it helps teachers with their workload as they can review the learning of the children in one place."
        },
        {
            "text": "We no longer undertake non-value-added time-consuming activities, like admin tasks that can be undertaken by the admin team."
        },
        {
            "text": "We’ve also reduced the number of emails sent through the day as well as out of school hours."
        },
        {
            "text": "Aaishah Khan, year 5 teacher at Westminster Primary School"
        },
        {
            "text": "What are the benefits of managing teacher workload?"
        },
        {
            "text": "Managing workload helps to improve wellbeing, work-life balance and reduces the anxiety of staff."
        },
        {
            "text": "Our senior leadership team always have an open door, and being able to raise any concerns makes us feel heard. In our workload staff meetings, we also have open conversations about what we feel needs to change. We have a ‘Room 101’ where we write something we want to get rid of in school on a post-It note and add it to a wall."
        },
        {
            "text": "We also have the time to focus on our personal development and career goals, I was given the opportunity to work on my leadership skills and shadow a member of the senior leadership team."
        },
        {
            "text": "When teachers are happy, they're more likely to stay in the profession. Having teachers in different stages in their career, from experienced teachers to new teachers, allows us to all learn from each other and create the best learning environment for the children."
        },
        {
            "text": "The ultimate benefit of reducing workload is to the pupils, teachers can spend more time in the classroom doing what they enjoy best - teaching and making an impact on the children's lives."
        },
        {
            "text": "Megan Humphreys, year 1 teacher at Westminster Primary School"
        },
        {
            "text": "Find out more about the school workload reduction toolkit"
        },
        {
            "text": "The school workload reduction toolkit is a practical resource for school leaders and teachers to help reduce workload, produced by school leaders, teachers and other sector experts together with DfE."
        },
        {
            "text": "Take a look at the school workload reduction toolkit"
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}