{
    "url": "https://digitaltrade.blog.gov.uk/2023/09/20/why-theres-lots-of-design-in-content-design/",
    "title": "Why there’s lots of design in content design",
    "authors": [
        "Andrea Leary, Head of Content Design"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-09-20T10:53:34+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Content Design team meeting at the office (August 2019)"
        },
        {
            "text": "If an object is easy to handle and helps you do things, it’s often thought of as well-designed. You barely notice you’re using it."
        },
        {
            "text": "Similarly, information that’s easy to understand and helps you complete a task is also considered well-designed. You barely notice the information: you just know what to do."
        },
        {
            "text": "Well-designed information is formed by good content design principles and processes - a digital discipline we’re committed to at the Department for Business and Trade (DBT)."
        },
        {
            "heading": 2,
            "text": "Design thinking"
        },
        {
            "text": "Content design isn’t just about copy-writing or editorial techniques applied to information, it’s a way of thinking: design thinking."
        },
        {
            "text": "And that thinking always starts with the question: ‘what problem is the user is trying to solve?’"
        },
        {
            "text": "DBT’s users are mostly businesses in the UK and abroad. They could be a small family-run business, or a multi-million-pound company. They could also be someone working for DBT in one of the UK’s embassies."
        },
        {
            "text": "As you might imagine, the problems they are trying to solve are varied. They could include:"
        },
        {
            "heading": 2,
            "text": "Design decisions"
        },
        {
            "text": "By understanding the problems users are trying to solve, DBT’s content designers can make informed decisions about:"
        },
        {
            "text": "Working with the other User-Centred-Design professions (User Research and Design) helps us work out the answer to these questions."
        },
        {
            "heading": 2,
            "text": "Design standards and structures"
        },
        {
            "text": "Content designers apply standards to the process of creating content as well as the output itself. As DBT begins to move into content operations, or ContentOps as it’s known, codifying standards will be even more important. Think of this as a design system for content."
        },
        {
            "text": "Standardisation of classifications, tagging and the structuring of content will help direct how content components can be fit for purpose across multiple contexts. It also helps when integrating content with data before it’s delivered dynamically to users."
        },
        {
            "text": "Other content standards and conventions that create efficiencies in production and ensure users’ needs are met include:"
        },
        {
            "heading": 2,
            "text": "Design capability"
        },
        {
            "text": "DBT is a new department which means we have a \"clean slate” to improve content design capabilities, processes, and standards, so that users can benefit from the knowledge the department holds."
        },
        {
            "text": "In addition to creating and maintaining content, our content design team is also committed to training others and advocating for the discipline. In fact, you couldn’t find a more enthusiastic bunch - and we’re in a department with one of the most progressive content presences in government."
        }
    ]
}