{
    "url": "https://companieshouse.blog.gov.uk/2023/09/20/why-filing-your-information-on-time-with-companies-house-is-important/",
    "title": "Why filing your information on time with Companies House is important",
    "authors": [
        "Business Information Providers Association"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2023-09-20T12:41:58+01:00",
    "content": [
        {
            "text": "Every limited company must file annual accounts and a confirmation statement with Companies House every year. This information is then made available to the public on the company register. But how is this information used by credit reference agencies? And how will filing late - or not filing at all - affect your business?"
        },
        {
            "heading": 2,
            "text": "Credit reference agencies"
        },
        {
            "text": "Before granting credit facilities, lenders (including businesses offering goods on trade credit terms, banks and loan organisations) want to be confident that the businesses they offer a facility to, will repay the money they lend."
        },
        {
            "text": "To help with this decision making, these organisations may look at the information held by companies called commercial credit reference agencies (CRAs)."
        },
        {
            "text": "These agencies hold information on businesses operating in the UK. This information is usually referred to as 'commercial credit information' and is often contained within a business or credit report."
        },
        {
            "text": "CRAs gather data on businesses from various sources to create a commercial credit information database. This information is accessed by customers most commonly online in a business or credit report."
        },
        {
            "text": "The CRAs databases are built from publicly available sources including:"
        },
        {
            "text": "The Business Information Providers Association (BIPA) is committed to protecting the availability of these public sources, as the data is crucial to identify businesses. It allows CRAs to provide more accurate commercial credit information."
        },
        {
            "text": "CRAs may also gather information from other proprietary sources to supplement the publicly available data. This may include:"
        },
        {
            "text": "CRAs often collate and analyse this information and provide customers with an easy-to-use summary credit rating or credit score. This can represent the creditworthiness, risk of failure or risk of payment default of an individual business. These are created using proprietary statistical risk assessment models."
        },
        {
            "heading": 2,
            "text": "The purpose of commercial credit information"
        },
        {
            "text": "Anybody can purchase commercial credit information."
        },
        {
            "text": "CRA customers might include:"
        },
        {
            "text": "They're usually parties that want to gather information on businesses to make business decisions."
        },
        {
            "text": "Whether through the granting of a credit facility between businesses for the purchase of goods, or the granting of a loan or credit insurance, it’s typical practice for the lending party to get an independent assessment of the business they wish to make a decision on. This usually involves getting a commercial credit report from a CRA."
        },
        {
            "text": "This credit report will not only verify business details within a credit or loan application form, but may also be used within the credit decision process. It’s up to the lender to decide - in line with its own policy and perhaps its own information - whether to grant a credit facility or not. And if so, to what levels and to what terms."
        },
        {
            "heading": 2,
            "text": "Making sure your company's credit information is accurate"
        },
        {
            "text": "As well as paying your bills within agreed timescales, you should provide as much information on the performance of your business in a timely manner to relevant parties, for example filing statutory information with Companies House. We recommend you file full accounts information even if you do not have to."
        },
        {
            "text": "Every company must prepare accounts, even if they’re dormant. Filing your accounts on time is not only beneficial in terms of your company’s credit information, but you'll also avoid paying a late filing penalty."
        },
        {
            "text": "Make sure your credit information is as accurate as possible by filing your company information with Companies House on time. It's very important as this forms a key part of your credit report. This includes:"
        },
        {
            "text": "If you file late, or even request an extension, it can have an effect on how your company’s perceived by a lender or someone wanting to do business."
        },
        {
            "text": "Preparing and finalising annual accounts can take time, especially for larger or more complex companies. Knowing what type of accounts you need to file and when they're due is essential for every business, so plan well ahead."
        },
        {
            "text": "The granting of credit between businesses is fundamental to the health of the economy. It's been estimated that credit between businesses is almost 3 times the size of total bank lending - perhaps as high as £500 billion annually in the UK."
        },
        {
            "text": "CRA information is used by all types of businesses to aid and facilitate their credit decisions."
        }
    ]
}