{
    "url": "https://aphascience.blog.gov.uk/2023/03/15/british-science-week-2023/",
    "title": "Working with European partners to reduce the risk of pathogens entering the food chain",
    "authors": [
        "Richard Smith"
    ],
    "categories": [
        "Bacterial diseases"
    ],
    "pub_date": "2023-03-15T15:00:51+00:00",
    "content": [
        {
            "text": "APHA’s Dr Richard Smith explains how our scientists joined with experts in 12 European countries to reduce the spread of Salmonella and hepatitis E virus in pigs, helping to limit the risk to public health."
        },
        {
            "text": "During my 20 years at the Animal and Plant Health Agency (APHA), I have found that studying on-farm biosecurity is both incredibly important and relevant to the needs of farmers."
        },
        {
            "text": "For the last 3 years I have been working with experts across Europe on a project with the magnificent name of ‘BIOPIGEE'. The project, part of the wider One Health European Joint Programme, aimed to establish which biosecurity measures applied on pig farms were the most important, and most cost-efficient, for controlling Salmonella and hepatitis E virus (HEV) in pigs."
        },
        {
            "text": "Because Salmonella and HEV can also cause illness in people, it is vital that we reduce the risk of them entering the food chain by making sure our food is safe to eat. Although slaughterhouses have processes in place in to minimise the chance of meat products being contaminated with these pathogens, it is best practice to control the pathogens on the farm first."
        },
        {
            "text": "So that we can provide farmers with advice on how to control these specific pathogens, we first need to understand which on-farm biosecurity measures will be most effective in reducing pathogen transmission. Good biosecurity practice can help limit the introduction of pathogens onto an infection-free farm and minimise the transmission of the pathogens between pens and buildings within an infected farm."
        },
        {
            "text": "However, the way individual biosecurity measures interact with one another makes analysing data on biosecurity particularly difficult. For example, you may assume that farms which import new animals will have a higher risk of pathogen presence, but this is not necessarily the case: the risk could be mitigated, or reduced, by strong quarantine and cleaning and disinfection practices. Poor cleaning and disinfection methods, however, can help spread pathogens around, whereas different combinations of practices can effectively reduce pathogen contamination."
        },
        {
            "text": "Research results also rely on us assuming the practices in place on a farm are being followed properly: a farmer may have answered in a questionnaire that staff change their boots, but we cannot be sure that is always the case. Because of these factors, analyses can provide variable and contradictory results."
        },
        {
            "text": "This work was not just about identifying the useful biosecurity measures against HEV and Salmonella. It was also about ensuring that the message about good biosecurity measures was disseminated to farmers, vets, and anyone involved in livestock production so they can make changes locally. One important message we have tried to get across was that although we had highlighted the most effective biosecurity measures, other measures are also important."
        },
        {
            "heading": 3,
            "text": "The BIOPIGEE consortium"
        },
        {
            "text": "The BIOPIGEE consortium, which consisted of 14 institutes from across 12 European countries, agreed the most reliable approach to examining biosecurity methods was to combine evidence from multiple research streams."
        },
        {
            "text": "My APHA colleagues and I contributed to this by reviewing information from previous studies, opinion surveys of world-renowned experts, field sampling and data collection from over 250 British and European pig farms, as well as laboratory studies of disinfectant effectiveness."
        },
        {
            "text": "Carrying out the field studies was particularly challenging: we had to plan sampling visits around COVID-19 lockdowns, fuel shortages and staff being reallocated to work on  . Despite this, the team were able to visit 18 farms from across England and test 20 samples of faeces from each farm for Salmonella and HEV. We also followed a single batch of pigs from birth to slaughter on two farms to understand more about HEV on pig farms."
        },
        {
            "heading": 3,
            "text": "Outcomes of the project"
        },
        {
            "text": "The final results were a combination of all these activities and our outputs represented findings which had been backed up by results from a number of these activities."
        },
        {
            "text": "I was particularly happy with how the study brought together a wide range of expertise and experience from across Europe and how the study team worked hard to provide some practical outputs that will be useful for the livestock industry."
        },
        {
            "text": "We also produced a document on how to correctly apply biosecurity on pig farms, including descriptions and photos of good biosecurity practice. This was shared with veterinary colleges and agricultural schools so they could incorporate the content into their teaching, and we have had some nice feedback so far."
        },
        {
            "text": "I would like to congratulate my team for their hard work on this project. As a result of personnel changes within the European institutes, APHA took on responsibility for leading many parts of the work and this led to us being the lead author on several scientific papers and other outputs from the project. Keep an eye out for our published findings from this study which will be coming out soon!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}