{
    "url": "https://gds.blog.gov.uk/2023/03/15/celebrating-neurodiverse-superpowers/",
    "title": "Celebrating neurodiverse superpowers",
    "authors": [
        "Tony Richards - Product Manager, Government Digital Service",
        "Sarah Crandall - Delivery Manager, Government Digital Service"
    ],
    "categories": [
        "People and skills"
    ],
    "pub_date": "2023-03-15T12:34:40+00:00",
    "content": [
        {
            "text": "This month will be all about celebrating those with neurodiverse superpowers; product leaders like Steve Jobs, entrepreneurs like Richard Branson, top actors like Orlando Bloom and Keira Knightley, influencers like Stacey Machelle and athletes like Simone Biles. This will be an opportunity at GDS to champion our own neurodiverse talent and find out how we can work together to leverage it and at the same time level up for everyone in the organisation."
        },
        {
            "heading": 2,
            "text": "Why we set up the Neurodiversity Network"
        },
        {
            "text": "Tony Richards, Network Chair:"
        },
        {
            "text": "With the official Neurodiversity Celebration Week in March, it is time for us to reflect on how far we have come as a network in GDS over the past year."
        },
        {
            "text": "I was first inspired to re-evaluate my dyslexia as a positive when I went on a Civil Service Fast Stream secondment to neurodiversity employment advocacy organisation Exceptional Individuals. Working closely with the organisation's founder Matt Boyd, I learned to re-frame common misconceptions in society that I had previously internalised about my own neurodiversity and advocate it to others. This experience was so powerful and transformative that colleagues in the Cabinet Office Press Office proactively pushed a piece out to the Financial Times about my experiences."
        },
        {
            "text": "One year ago I decided to put effort into building the network and formalising it, as I felt there was so much neurodiverse potential in our organisation which we hadn’t yet tapped into. What I saw all around me at GDS motivated me to change things. I once had a colleague open up to me and tell me they were dyslexic only on their last day. I realised from instances like this that more work needed to be done to ensure people at GDS were able to feel open about their neurodiversity, and supported from day one. This will ensure we harness the neurodiverse superpowers we have at our disposal to solve the challenging user problems we face. "
        },
        {
            "heading": 2,
            "text": "Neurodiverse superpowers"
        },
        {
            "text": "The Neurodiversity Network was a very small Slack channel a year ago with only 20 or so members (estimated 2.5% of staff). Today it has 90 members (estimated 12% of staff). But there is still more work to do as studies by the National Career Institute suggest the overall neurodiverse population is close to 20%. The network runs a rich programme of events and leads on key work streams to leverage neurodiversity right across the organisation and those close to it."
        },
        {
            "heading": 2,
            "text": "Manual about Me"
        },
        {
            "text": "Last year the focus of celebrating neurodiversity week was all about establishing the network and introducing the concept of neurodiverse superpowers. At GDS we celebrate neurodiversity over a whole month to maximise involvement across the staff body. This year we will be covering the strategy we have developed, with a big focus on trialling ‘Manual about Me’ across the business. We have already incorporated ‘Manual about Me’ into the GDS Smarter working toolkit. During the events this month we will seek to promote widespread testing and trialling of them across delivery and product communities. Some Delivery and Product managers are already using ‘Manual about Me’ and we are working closely with them to help promote trialling of it across the organisation."
        },
        {
            "heading": 2,
            "text": "Our strategy"
        },
        {
            "text": "There are three key pillars to our strategy as a network:"
        },
        {
            "text": "Throughout March our network will host a series of events for staff to flesh out these objectives, with hard actions to empower the organisation and leverage the neurodiverse superpowers of our highly talented staff."
        },
        {
            "heading": 2,
            "text": "Programme of events"
        },
        {
            "text": "Our programme of events mirrors our strategy with each week focusing on a key pillar:"
        },
        {
            "heading": 4,
            "text": "Week 1: Raising awareness "
        },
        {
            "text": "A series of drop in sessions for different types of neurodiversity."
        },
        {
            "heading": 4,
            "text": "Week 2: Making recruitment work for neurodiverse candidates "
        },
        {
            "text": "A series of show and tells on what we are doing with Heads of Community to create a more inclusive recruitment process."
        },
        {
            "heading": 4,
            "text": "Week 3: Leveraging neurodiverse superpowers in the workplace "
        },
        {
            "text": "Showcase the utilisation of Manual about Me to leverage, and level up, neurodiverse talent across GDS."
        },
        {
            "heading": 4,
            "text": "Week 4: Supporting colleagues with neurodiverse family and friends"
        },
        {
            "text": "A range of open sessions requested from across GDS to understand how we can best help."
        },
        {
            "heading": 2,
            "text": "How you can get involved"
        },
        {
            "text": "We have events happening all throughout March:"
        },
        {
            "heading": 4,
            "text": "Wednesday 22 March"
        },
        {
            "text": "12:30 to 1:20pm: Manual about me — find out how to leverage neurodiverse superpowers in your workplace"
        },
        {
            "heading": 4,
            "text": "Tuesday 28 March"
        },
        {
            "text": "12:30 to 1:20pm: ADHD (awareness session)"
        },
        {
            "heading": 4,
            "text": "Thursday 30 March"
        },
        {
            "text": "11:00 to 11:50am: Dyscalculia (awareness session)"
        },
        {
            "text": "12:30 to 1:20pm: The Dyslexic Advantage (awareness session)"
        },
        {
            "heading": 2,
            "text": "Useful resources"
        },
        {
            "text": "Video: Emily - Made By Dyslexia Baby Film"
        },
        {
            "text": "Article: How dyslexic capabilities can help organisations of the future"
        },
        {
            "text": "Autism test for adults"
        },
        {
            "heading": 3,
            "text": "Quotes from neurodiverse leaders"
        },
        {
            "heading": 4,
            "text": "Richard Branson, founder of Virgin"
        },
        {
            "text": "“My dyslexia has shaped Virgin right from the very beginning and imagination has been the key to many of our successes. It helped me think big but keep our messages simple. The business world often gets caught up in facts and figures — and while the details and data are important, the ability to dream, conceptualise and innovate is what sets the successful and the unsuccessful apart.” "
        },
        {
            "text": "Simone Biles, most decorated U.S. women's gymnast "
        },
        {
            "text": "“Having ADHD, and taking medicine for it is nothing to be ashamed of, nothing that I'm afraid to let people know.” "
        },
        {
            "heading": 4,
            "text": "Steve Jobs, founder of Apple and fellow dyslexic"
        },
        {
            "text": "“Everything around you that you call life was made up by people that were no smarter than you and you can change it, you can influence it, you can build your own things that other people can use. Once you learn that, you'll never be the same again.\""
        },
        {
            "text": " "
        }
    ]
}