{
    "url": "https://environmentagency.blog.gov.uk/2023/03/15/major-strategy-milestone-achieved-as-flood-warning-service-expands-to-110000-more-homes-and-businesses/",
    "title": "Major strategy milestone achieved as flood warning service expands to 110,000 more homes and businesses",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2023-03-15T11:29:02+00:00",
    "content": [
        {
            "text": "Flood warnings are now available for 110,000 additional homes and businesses following a major effort to ensure all properties at high risk of flooding can receive them. Many properties previously considered too remote, rural, or difficult to warn of flooding, are now able to take advantage of the service. This significant improvement has been made possible using new technologies developed by the Environment Agency."
        },
        {
            "text": "Flood warnings give people valuable time to prepare, take action and ultimately to save their lives when flooding is predicted. The expansion of flood warnings is a commitment set out in our long term Flood and Coastal Erosion Risk Management Strategy."
        },
        {
            "text": "There are over 1.6 million users registered to receive flood warnings at the touch of a button. These flood warnings are generated from river level data which is collected via an extensive monitoring network across England. The data is combined with weather forecasts, river models and other information to produce location specific flood forecasts."
        },
        {
            "text": "Over 78,000 of these properties have been reached thanks to additional government funding for a dedicated expansion programme. This has focused on delivering flood warnings to those properties which pose challenges for traditional river monitoring and forecasting approaches. This might be due to a rural location; a lack of nearby power supply; inadequate ground conditions for a traditional monitoring station; or if the river is too small to be routinely monitored. New approaches were developed that were suitable for these locations – they are smaller; can be attached to bridges and other structures; are quick and simple to install and run off solar power. Essentially, they reduce the complexity and cost of installation and can be rolled out quickly. More than 180 communities have benefited from this new approach and many more will in the future."
        },
        {
            "text": "Commenting on the expansion, Julie Foley, Director of Strategy and National Adaptation at the Environment Agency, said:"
        },
        {
            "text": "These innovations are one of many ways that we are evolving and improving the way that people are warned and informed about the risks of flooding.  For example, we are developing the next generation flood warning service which will launch to the public in late 2025. It will offer a reliable and efficient, round the clock service during the most extreme weather scenarios. We’re also doing lots of work behind the scenes to make sure that our warnings are accurate, understood by the public, and target the right properties as early as possible. This means that properties are constantly being added to, and removed from, the warning service as we get a better understanding of the changing pattern of flood risk."
        },
        {
            "text": "There are many reasons why flood risk changes, for example, when new homes are built near rivers, or flood defences are constructed to protect homes. Flood risk is also changing in response to climate change. We’re already seeing more frequent and intense rainfall, and in the future, this is expected to worsen. More homes and businesses will become vulnerable.  We are continually refining and improving our flood forecasts and warnings as we gather better knowledge and understanding of these risks."
        },
        {
            "text": "Paul Clements, Director of Incident Management and Resilience at the Environment Agency, said:"
        },
        {
            "text": "These ongoing improvements and efficiencies mean that the work to expand the flood warning service will not just benefit the 110,000 additional homes that can now sign up to flood warnings. It has also opened the doors to new ways of monitoring our river network in the future and will help us to evolve our warning service as flood risk continues to change."
        }
    ]
}