{
    "url": "https://socialcare.blog.gov.uk/2023/03/15/make-time-for-young-carers/",
    "title": "Make time for young carers",
    "authors": [
        "Andy McGowan"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "child protection",
        "Communities",
        "Events"
    ],
    "pub_date": "2023-03-15T07:44:30+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Today is Young Carers Action Day"
        },
        {
            "text": "I'm Andy McGowan, tthe Policy and Practice Manager for Young Carers and Young Adult Carers at Carers Trust, a UK charity working to transform the lives of unpaid carers."
        },
        {
            "text": "Young Carers Action Day aims to shine a light on the pressures and challenges young carers up to the age of 25 face on a daily basis. The UK-wide campaign is designed to raise public awareness of the incredible contribution they make to society. A mix of local and national initiatives are taking place across the country to help their voices be heard."
        },
        {
            "text": "A recent report, conducted by City & Guilds, revealed nearly one in five young people have been, or still are, a carer for a relative, which in turn has resulted in their education and/or employment trajectory being impacted. In addition, Carers Trust research released for Young Carers Action Day has revealed a significant intensification for many young carers with 56% saying the amount of time they spend caring has increased in the past year, and 47% saying they are now caring for more people than before.”"
        },
        {
            "text": "This is why understanding the ways in which employers, educators and government can best support young carers is hugely important."
        },
        {
            "heading": 2,
            "text": "Who are young carers?"
        },
        {
            "text": "Every day, thousands of young people across the UK help look after someone in their family or a friend who is ill, frail, disabled, has a mental health problem or an addiction. Life can be overwhelming for young carers who often struggle to balance their schoolwork with their caring role."
        },
        {
            "text": "Over the past few years, Carers Trust chatted with hundreds of young carers at festivals in Hampshire, Wales and Scotland as well as local young carer organisations.  The one issue that kept coming up was just how important their health and wellbeing is to them."
        },
        {
            "text": "It’s easy for young carers to start feeling overwhelmed because of everything they need to do for their caring role on top of all their schoolwork and revising for exams. What young carers told Carers Trust was that it doesn’t need to be this way. They think the things that would make them feel less overwhelmed, healthier and happier include improved support in schools, more access to breaks and better access to counselling support."
        },
        {
            "heading": 2,
            "text": "Focusing on what matters"
        },
        {
            "text": "This year’s theme, 'make time for young carers', highlights the things that are really important for young carers. There is a need for professionals and responsible adults to make more time to listen to them explain the challenges they face, so they can better understand the support they actually need. Secondly, once they understand the support required, they can then make time to put it in place."
        },
        {
            "text": "In this spirit, Carers Trust has been working alongside local carers' organisations on projects and events, such as webinars and research reports, to help voice the challenges young carers face and how they can be supported."
        },
        {
            "text": "For a third year, Carers Trust has also been working with Create Arts, funding four carers services during February half term to deliver creative projects with young carers, giving them time away from their caring responsibilities."
        },
        {
            "text": "Participants produced art linked to this year’s theme through a mixture of photography, filmmaking, 3D models and visual art."
        },
        {
            "heading": 2,
            "text": "Pivotal moments"
        },
        {
            "text": "Sometimes it only takes ten minutes to change a young carer’s life. Mariam is a young carer who felt overwhelmed at school because she had to spend so much time when she got home looking after her mum, who couldn’t move without feeling severe pain."
        },
        {
            "text": "Because of the constant demands of her caring role, it was really difficult for Mariam to get her homework done. As a result, she always felt unprepared, stressed and behind with her schoolwork."
        },
        {
            "text": "All that changed when a teacher approached her and asked the right question: not why Mariam hadn’t handed in her homework, but instead if there was anything making it difficult to get it done."
        },
        {
            "text": "That one simple question and the teacher’s willingness to make time to listen, was what Mariam needed. She was able to explain why she was struggling and the teacher, who now understood the challenges she faced, was able to help her make a plan for prioritising what needed to be done, so she didn’t feel so overwhelmed."
        },
        {
            "text": "As Mariam says:"
        },
        {
            "text": "Young Carers Action Day may be just one day, but it reminds us all to listen to, understand and support the needs of these amazing young people every day."
        }
    ]
}