{
    "url": "https://environmentagency.blog.gov.uk/2023/03/15/respecting-the-coarse-fish-close-season-and-why-we-enforce-it/",
    "title": "Respecting the coarse fish close season and why we enforce it",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-03-15T10:36:54+00:00",
    "content": [
        {
            "text": "Kye Jerrom, Senior Advisor for Fisheries Enforcement and Engagement, looks back on a year of Environment Agency fisheries enforcement and shares why the coarse fishing close season is vital in protecting fish stocks. "
        },
        {
            "text": "Spring has sprung and with warming rivers and streams, coarse fish are preparing for the spawning season. On rivers this is the ‘close season’ for angling and takes place from March 15th to June 15th inclusive. This three-month closure is a really important time for fish. Many will be preparing to spawn, are spawning or recovering from spawning - adult fish, emerging eggs and juvenile fish or fry are all vulnerable.  This can be both stressful and exhausting for fish but also a precarious time for eggs that are largely exposed and unprotected. Giving them this time to spawn, undisturbed by anglers, recover - and, in the case of eggs, develop - is a vital helping hand and something our fisheries officers will enforce and protect."
        },
        {
            "text": "For some anglers, the close season offers a chance to hang up their rods for a short time and for others, it provides an opportunity to mix up their routine and switch to those canal and lake fisheries not covered by the statutory close season. Some may even dust off their trout rod. I am an angler myself and fish a variety of venues across the country.  I’m a traditionalist at heart and really value fishing small rivers and the fenland drains, but I’m not sorry when my river fishing pauses in spring. This gives me a chance to try new venues, like the fantastic canal network and my local country park lakes as well as maintain my kit ready for the new season."
        },
        {
            "text": "The fisheries service I, and the rest of my colleagues provide, is primarily funded by fishing licence income – that’s income from you buying your fishing licence. Our work not only protects the sport but enhances the wider work we deliver to enhance fisheries and promote fishing. Some of the most valuable work we do links to improving opportunities for fish to spawn which strengthens fish stocks naturally.  Improving spawning habitat (and creating new habitat) and access to it (through the construction of fish passes), and protecting where fish spawn is vital to encouraging strong stocks and better fisheries."
        },
        {
            "text": "Spawning habitat is so important to protecting fish stocks that the law, under Section 2 of the Salmon and Freshwater Fisheries Act, 1975, actually protects fish and their eggs at this stage from disturbance and damage, from both angling and other activities. Anyone carrying out work in rivers that disturbs spawning fish, their eggs or their spawning grounds could be committing an offence."
        },
        {
            "text": "Throughout the close season, myself and other Environment Agency fisheries enforcement officers conduct patrols to enforce it and deter other illegal activities. As part of Operation CLAMPDOWN, we work alongside Angling Trust volunteers who, in the absence of anglers,  support our officers by being our eyes and ears on riverbanks and report incidents to our 24-hour incident hotline 0800 80 70 60."
        },
        {
            "text": "Ensuring rivers are not fished during the close season is a big priority for our teams but it’s not just the close season where we crack down on illegal fishing to protect our fisheries."
        },
        {
            "text": "Throughout the year, our teams are out treading the banks of our rivers and still waters, checking rod licences and targeting poaching hotspots. We have specialist skills, training and enforcement powers to allow us to do this and have developed great relationships with partners like the Police, the Angling Trust and angling clubs to help us be more effective."
        },
        {
            "text": "Since 01st April 2022 we’ve checked 32,955 fishing licences, taking enforcement action against 1692 anglers. 228 offenders were prosecuted in court.  In total £42,455.00 was issued in fines against anglers over the year, the average fine received was £186.21."
        },
        {
            "text": "While we know and welcome the fact that the vast majority of anglers are law abiding, we will take action when we catch the few people that insist on breaking the law – it is our duty to protect fish stocks."
        },
        {
            "text": "Our teams will be patrolling again throughout the close season, so please make sure you don’t get caught out. You don’t have to stop fishing entirely and could, like me, use the time as an opportunity to try something new. Trout fishing, for example, is also covered by your coarse and non-migratory trout fishing rod licence. These fisheries still provide a great chance of an excellent catch without breaking any rules."
        },
        {
            "text": "You can also help us ensure that our fish populations are surviving and thriving at all life stages by spreading the message. If you know anyone that’s just started fishing for the first time, we ask that you not only remind them of the close season dates, but also explain why we enforce it."
        },
        {
            "text": "By respecting the close season break on coarse rivers, we can all look forward to the glorious June 16th when we can get back on the banks.  I’m looking forward to a special opening day on the River Yare in Norfolk."
        },
        {
            "text": " "
        }
    ]
}