{
    "url": "https://extremismcommission.blog.gov.uk/2023/03/15/the-cce-hosts-international-conference-focused-on-extremism-across-europe/",
    "title": "The CCE hosts international conference focused on extremism across Europe",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog"
    ],
    "pub_date": "2023-03-15T11:55:02+00:00",
    "content": [
        {
            "text": "Earlier this month, the Commission for Countering Extremism (CCE) hosted a conference on counterterrorism and counter-extremism threats facing Europe."
        },
        {
            "text": "The keynote speech was delivered by the Home Secretary, Rt Hon. Suella Braverman KC MP, who discussed the recent publication of the Independent Review of Prevent (IRP), the government response, and emphasised her faith in Robin Simcox as Commissioner and the CCE overall in helping lead the country’s efforts to counter extremism."
        },
        {
            "text": "She told the conference:"
        },
        {
            "text": "“I applaud you [Robin Simcox] and your team for organising such an important and timely event. I’m always in awe of your encyclopaedic knowledge of the threat we face and how it has evolved. We are privileged to have you and your team offering the Government independent, expert advice."
        },
        {
            "text": "“It’s essential that we continue to work closely with you and the Commission.”"
        },
        {
            "text": "On the IRP, which had been recently published, she said:"
        },
        {
            "text": "“Prevent’s core mission and first objective will be tackling the ideological causes of terrorism. We must counteract the narratives of extremists, undermine their propaganda, and take on their warped ideologies."
        },
        {
            "text": "“The failings we see in the Prevent referrals stem directly from weaknesses at the heart of the system. The Independent Review found an inability to identify the warning signs of Islamist radicalisation, compounded by an institutional timidity in confronting this threat."
        },
        {
            "text": "“I have accepted all 34 of William Shawcross’s recommendations, as well as the overarching finding that we need a new approach - one that better recognises the nature of the threat we face and takes it more seriously."
        },
        {
            "text": "“We have a blind spot in the system. It has allowed certain Islamist groups to operate under our radar. There can be no place for political correctness in our national security. In fact, I’d like to banish it altogether.”"
        },
        {
            "text": "“The Commission for Countering Extremism will help us rapidly to overhaul our training and strengthen our in-house expertise, so that Prevent is better able to understand, identify, and deal with the wider problem.”"
        },
        {
            "text": "Robin Simcox opened the conference, speaking about the importance of calling upon external expertise to provide insight and challenge to policymakers on a multitude of counter-extremism issues. He also referred to the IRP, which he described as \"a vital contribution to the nation’s ongoing attempts to combat extremism and terrorism.”"
        },
        {
            "text": "In reflecting on the IRP's recommendations, he noted he was looking forward to the CCE’s role in scrutinising how they are now implemented and embedded by government."
        },
        {
            "text": "Following his speech, three panel discussions followed, focusing on:"
        },
        {
            "text": "The key counter-terrorism issues facing Europe\nThe challenge non-violent extremism poses across Europe\nHow and why extremists seek legitimacy through government engagement and funding"
        },
        {
            "text": "Robin reflected on the event: “Today’s conference delivered first-class discussion, insight, and opinion from leading counter-extremism experts and policymakers from across Europe."
        },
        {
            "text": "While the nature of the challenges may differ across Europe, we all have one common goal: to root out extremism across our societies. If we want to make progress it is essential that we bring together expert voices like these to share insights and knowledge."
        },
        {
            "text": "The Home Secretary made it clear how important the Commission for Countering Extremism’s role is in challenging all forms of extremism. I will be working closely with the Home Secretary and our other key partners to make progress in this vital area.”"
        }
    ]
}