{
    "url": "https://ukhsa.blog.gov.uk/2023/03/15/using-science-to-design-out-healthcare-associated-infections/",
    "title": "Using science to design out healthcare associated infections",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-03-15T11:22:31+01:00",
    "content": [
        {
            "text": "This year’s British Science Week theme is “connections” and throughout the week we’re looking at how UKHSA science is carried out in partnership with a wide range of organisations. In this blog Ginny Moore – an expert in applied environmental microbiology research – looks at our work to help hospitals prevent the spread of infections, which involves working with both hospitals and academic partners."
        },
        {
            "text": "An important part of the work we do at UKHSA is about understanding how infections spread in different environments. Being able to reduce the spread of infectious diseases is key to preventing outbreaks and keeping the public safe."
        },
        {
            "text": "An obvious and vital aspect of this work is to study how infections could spread is in hospitals."
        },
        {
            "text": "Hospitals of course have stringent measures in place to prevent infections, but in any location where there are large numbers of sick people in one place (some more vulnerable and prone to a more serious illness than others) we must do everything we can to avoid infections; often referred to as nosocomial or healthcare-associated infections."
        },
        {
            "heading": 2,
            "text": "UKHSA science fact file: Biosafety and environment"
        },
        {
            "text": "To put the best possible advice and guidance in place to reduce healthcare-associated infections, we need to keep studying how microorganisms (like bacteria or viruses) move around spaces like hospital wards."
        },
        {
            "text": "However, we obviously can’t go into a real hospital with live bacteria or a live virus to see how it spreads."
        },
        {
            "text": "So, what do you do if you need to study the exact conditions found in a hospital ward without putting anyone at risk? You build one of course."
        },
        {
            "text": "UKHSA has built a modular ward on our site at Porton Down – a bespoke research facility just for study purposes."
        },
        {
            "text": "Our specialist facility includes single and multiple-bedded rooms, a negative pressure isolation suite and ancillary spaces (for example, a dirty utility room, a laundry, kitchen and office), all built and designed to fit current UK guidelines which inform how real wards are built."
        },
        {
            "text": "The facility has dedicated heating, ventilation, and air conditioning systems. Realistic water and drainage systems are also in place as well as the same surfaces, fixtures, fittings and furnishings you’d find in a real ward."
        },
        {
            "text": "Creating the most life-like hospital ward possible ensures that we can better understand how microorganisms can live and spread in this environment."
        },
        {
            "text": "The research facility allows us to carry out a range of vital activities and studies, such as:"
        },
        {
            "text": "In the past, we had to rely on large scale models to carry out this sort of work (for example tap, sink and drainage systems) but the new ward will help us take this work to the next level."
        },
        {
            "text": "Our ambition is to help “design out” healthcare-associated infections by understanding everything we can about strategies to prevent them in the indoor ward environment: this will both protect people’s health and address the substantial economic costs associated with these infections."
        },
        {
            "text": "The ward presents an exciting opportunity to further this important work and is a great example of how UKHSA’s science is focussed on real-world practical problems. As a microbiologist, it’s rewarding to know that the work we do informs front-line policy and practice and ultimately keeps patients and healthcare professionals safe."
        }
    ]
}