{
    "url": "https://civilservice.blog.gov.uk/2023/03/15/young-carers-action-day-15-march-2023/",
    "title": "Young Carers Action Day - 15 March 2023",
    "authors": [
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-03-15T08:56:55+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Rebecca Sudworth, Deputy Civil Service Carers’ Lead, talks about the experiences of Civil Service young carers "
        },
        {
            "text": "Today is Young Carers Action Day. This year’s theme is Make Time for Young Carers."
        },
        {
            "text": "Many young carers don’t necessarily think of themselves as carers. Their role may have grown as they got older. Or the person they care for, may have become more dependent on their help. "
        },
        {
            "text": "For many people, starting work and hearing about carer networks can be the moment the penny drops. They realise they are a carer and begin to access the support they need."
        },
        {
            "heading": 4,
            "text": "Assumptions"
        },
        {
            "text": "It is easy to assume that young people don’t have responsibilities outside work. This may seem unimportant but it can make it harder for young carers. They may need more flexibilities, so they can make a success of both work and caring. "
        },
        {
            "text": "Young carers tend to be in more junior grades. This doesn’t mean that it’s too early in their career to work part-time or compressed hours and they are options worth considering."
        },
        {
            "text": "False assumptions can stop a young carer talking openly to their line manager about the adjustments they need to help them. Young carers can feel awkward explaining that holidays with family can be tiring, rather than a chance to rest and return to work refreshed."
        },
        {
            "heading": 4,
            "text": "Support"
        },
        {
            "text": "It is really important that, as colleagues and managers, we talk to young carers and understand the challenges they face."
        },
        {
            "text": "I am pleased that there are many examples of young carers in the Civil Service being well supported. We need to build on this. As we implement the Civil Service Carers’ Strategy, we will continue to address the needs of young carers."
        },
        {
            "text": "If you’re a carer or you manage a carer, please make use of the resources available. These include the Carer’s Passport and the Carer Line Manager Toolkit. You may wish to join your department’s carer network. Look out for details on your departmental intranet."
        },
        {
            "text": "Young carers can also join the Civil Service Young Carers’ Network. For more information, please email COCarers@cabinetoffice.gov.uk."
        },
        {
            "text": "Thank you to Charity for sharing her caring journey."
        },
        {
            "heading": 3,
            "text": "‘I’ve never known life without caring’"
        },
        {
            "text": "Charity Pierce, a Grade B with the Department for Digital, Culture, Media and Sport in London talks about growing up with her sibling who has autism, and the challenges it entails."
        },
        {
            "text": "Like many young carers, I’ve never known life without caring. My little sister Isobel has autism, she is non-verbal and can have very challenging behaviour. Isobel is incredibly brave and faces more struggles on a daily basis than many people go through in a year."
        },
        {
            "text": "Growing up, I never thought about ‘caring’ - it was just my life and I didn’t know any different. It wasn’t until my early twenties, when we hit a crisis point in my family, that I realised that I’d always juggled caring responsibilities. This coincided with me joining the Civil Service."
        },
        {
            "text": "My first team in the Civil Service was very understanding. There were times when I’d come into work in the morning feeling like I’d run a marathon because my sister had a meltdown the night before. Other times, I would be distracted from work because I was worrying so much about the problems back home. My team responded in a human, not a corporate way. My experience since then has been extremely positive. "
        },
        {
            "text": "I joined the departmental and Young Carers’ Networks. For the first time, I met people who understood my situation and could steer me to the help available."
        },
        {
            "text": "Being the only young carer in your peer group can be very isolating. The networks have given me a new circle of people who I can talk to about the challenges I face as a young carer."
        },
        {
            "text": "Caring will always be part of my life and I don’t begrudge this. However, having that extra responsibility when you’re young impacts every part of your life – your ambitions, your career, your social life and the way you imagine your future. This is at a time when you’re meant to be carefree and discovering who you are. But you also learn a huge amount about empathy, compassion, prioritisation and the ability to appreciate the little things in life."
        }
    ]
}