{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/06/19/be-inspired-to-try-something-new/",
    "title": "Be inspired to try something new!",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities"
    ],
    "pub_date": "2023-06-19T16:34:49+01:00",
    "content": [
        {
            "text": "Now is a great time to explore government science and engineering. There is so much happening in this space, with ongoing innovation required to assist current and future populations."
        },
        {
            "text": "We are launching two GSE courses shortly, which explore the use of engineering and science advice in the policy making process to improve people’s lives. This is being done through a variety of interactive activities including videos from experts, case studies and scenarios."
        },
        {
            "text": "Understanding and Accessing Science and Engineering Advice, gives you time to reflect on how science and engineering is currently used by your team and wider organisation, as well as across government. It provides helpful hints and tips on how you can develop or improve your relationship with stakeholders, such as technical experts, within and outside government."
        },
        {
            "text": "Alternatively, Communicating Science and Engineering Advice outlines best practice for sharing science and engineering advice with a range of government stakeholders including policy makers and ministers."
        },
        {
            "text": "Word cloud of job titles for roles held by engineers in government"
        },
        {
            "text": "Science and engineering in government covers a broad portfolio of responsibilities, from policy advisers to Heads of Professions, but problem solving is at the core of what they do."
        },
        {
            "text": "We asked some of our engineering GSE members who piloted the new GSE courses for their thoughts on engineering in government and how the courses can increase science and engineering literacy."
        },
        {
            "heading": 4,
            "text": "Testimony 1 – Bethan, Skills Advisor, Environment Agency"
        },
        {
            "text": "Why did you choose engineering as a career?\nI always had an interest in the environment, from playing in a local stream to a love of science at school. When I was young, I was good at maths, so that’s one of the subjects I chose to do for A level, along with geography and computing. Geography was my favourite so that’s what I went on to study at University. Soon after I left, I got a job with the Environment Agency working with lots of engineers. So, I went back to education one day a week to study Civil Engineering."
        },
        {
            "text": "How does your engineering background influence your work now? \n20 years ago, I got a job with the Environment Agency working as a Flood Warning Engineer. I’ve helped design new flood defences, used flood models to show the difference they will make and I’ve set up new flood warning areas, so people can receive a free flood warning to tell them to take action before a flooding event."
        },
        {
            "text": "What is something you would like others to know about engineering in government?\nAnyone who is a problem solver, who looks for options of how to do things and enjoys science could be an engineer!"
        },
        {
            "text": "What is something you think civil, crown and public servants will gain from completing the new GSE courses?\nMy work is mainly around improving people’s working knowledge of uncertainty and the new communicating science and engineering advice course will help people to do this better."
        },
        {
            "text": "For example, when carrying out my incident role as a monitoring and forecasting Duty Officer I use the weather forecast from the Met Office to predict river levels and flows. When thunderstorms are predicted they have vastly different impacts if it happens over a city like Birmingham compared to over rural Warwickshire 20 miles away. Explaining the uncertainty is key to my role. We plan for the worst-case scenario and work with a constantly changing ‘best estimate’ of what is going to happen."
        },
        {
            "text": "Do you have any hints and tips for how to embed what you learn from the courses into your day-to-day work?\nIt would be good to do this course as a team and discuss the sections as a group. I like having sections to refer to, so I tend to screen grab useful images to help me remember the learning."
        },
        {
            "heading": 4,
            "text": "Testimony 2 – Rebecca, Senior Armour Research Engineer, DSTL"
        },
        {
            "text": "Why did you choose engineering as a career?  \nI’ve always enjoyed problem solving, design, physics and mathematics. I see engineering as an applied version of all four. I find it very gratifying to go from a problem/requirement through to something existing in real life."
        },
        {
            "text": "How does your engineering background influence your work now?\nI now work as an armour research engineer, so my engineering background influences everything I do - from fundamental technical research through to design, trials/testing and integration."
        },
        {
            "text": "What is something you would like others to know about engineering in government?\nThere is a lot more variety of expertise within government than you’d expect. For any engineering or science problem there will be a team that knows the answer or can point to industry outside that does – you just need to know where to find them which is exactly what this course helps with."
        },
        {
            "text": "What is something you think civil, crown and public servants will gain from completing the new GSE Courses?\nI believe from the Understanding and Accessing Science and Engineering Advice course; participants will gain a wider appreciation of the vast STEM areas within wider government. It will also give them a good idea of where to start looking for that advice when it’s needed rather than feeling lost. The courses do a great job at informing people about what is out there."
        },
        {
            "text": "The course Communicating Science and Engineering Advice, I believe will give technical staff (especially new starters or people with no prior experience) some good pointers on how to deliver content, articulate their point, the language to use and concepts like uncertainty. With those pointers it gives you a head start and forces you to think about those things upfront rather than having to learn from mistakes."
        },
        {
            "text": "Do you have any hints and tips for how to embed what you learn from the courses into your day-to-day work?\nReferring back to helpful sections would be a good idea."
        },
        {
            "heading": 4,
            "text": "Want to know more?"
        },
        {
            "text": "The courses will be available to civil, crown and public servants on Civil Service Learning and FutureLearn. Find out more about the new GSE courses and their full content on the GSE Science and Engineering Course blog."
        },
        {
            "text": "Do you want to share your experience of working in a Science and Engineering role or your experience working with Scientists and Engineers to make policy decisions? We would love to hear from you!"
        },
        {
            "text": "Want to know more about the GSE Offer including GSE Connect which offers partnering, support, coaching, networking, and co-mentoring for women working in STEM-related roles? Sign up to become a GSE Member  or contact the team at gse@go-science.gov.uk"
        }
    ]
}