{
    "url": "https://buyingforschools.blog.gov.uk/2023/06/19/buying-sustainable-it-hardware-for-your-school-or-trust/",
    "title": "Buying sustainable IT hardware for your school or trust",
    "authors": [
        "Kirsty Bridgland, Commercial Manager, KCS Procurement Services"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-06-19T09:34:33+01:00",
    "content": [
        {
            "text": "Kirsty Bridgland, Commercial Manager at KCS Procurement Services, discusses the options available to schools or trusts looking for a sustainable alternative when sourcing IT hardware through the DfE-approved KCS IT Hardware framework. "
        },
        {
            "text": "You can use our Find a Framework tool to explore the range of DfE-approved frameworks that offer ICT solutions."
        },
        {
            "text": "Sustainability is a topic that most of us have become familiar with over the years, but how can we make sure that sustainability and technology fit together seamlessly? More than ever, schools are committed to sourcing sustainable solutions, with many initiatives not only being led by staff, but also by the pupils themselves."
        },
        {
            "text": "With technology continuously developing and introducing new advances, it makes sense for schools or trusts looking to upgrade and replace IT equipment to consider not only the cost and resource benefits, but also the potential impact on the environment."
        },
        {
            "text": "What sustainable IT hardware options do schools have?"
        },
        {
            "text": "‘Remanufactured’ and ‘refurbished’ IT hardware are both sustainable alternatives and a viable option for schools to take when looking for a cost-effective and environmentally friendly solution. But what is the difference between ‘remanufactured’ and ‘refurbished’?"
        },
        {
            "text": "Remanufacturing returns a used product to at least its original performance, with a warranty that is equivalent or better than that of a newly manufactured product. Remanufacturing equipment is a complete process in which the engineer will use the same specification as when it was originally built, although a combination of reused, repaired or brand-new parts may be used. Component parts that are no longer working will be replaced, along with any elements which are affecting the performance or expected life."
        },
        {
            "text": "Refurbished refers to ‘old’ or used computer equipment that has been restored to like-new working condition and/or appearance. The process itself is less expensive than that of remanufacturing and consists of a thorough check of the IT equipment for defects and restorations. Once the refurbishments have been made, the products will be tested for functionality and defects."
        },
        {
            "text": "The length of warranty varies by manufacturer, ranging from 30 days up to one year depending on whether the products are new, remanufactured or refurbished. You should ask the question during the buying process so that you can be confident it will meet your requirements."
        },
        {
            "text": "Choosing remanufactured or refurbished over new will:"
        },
        {
            "text": "How to turn ideas into action"
        },
        {
            "text": "There is often uncertainty when it comes to taking a new direction in strategic approach, particularly when this involves digital plans. You may need to do some groundwork to shift mindsets."
        },
        {
            "text": "We recently ran a case study webinar in collaboration with Circular Computing (an awarded supplier on the KCS IT Hardware framework), Kent County Council and the East of England Ambulance Service, who discussed the challenges and successes of implementing a sustainable digital strategy into their organisations. Watch the replay for more insights and expert advice around the steps to take to kick-start your sustainable digital plans."
        },
        {
            "text": "Further information"
        },
        {
            "text": "The Schools Commercial Team within the Department for Education lead on the Buying for Schools programme; delivering services to support schools to buy goods and services."
        },
        {
            "text": "The team host free webinars on how using our approved frameworks could save you time and help your school get value for money. You can find the full programme of webinars for the spring term on the Summer 2023 webinar page. Visit the page to find out more and book your place."
        },
        {
            "text": "Make sure you follow our ‘Buying for Schools’ LinkedIn page for all the latest information on buying for your school."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}