{
    "url": "https://deframedia.blog.gov.uk/2023/06/19/coverage-of-the-abolition-of-council-diy-waste-charges/",
    "title": "Coverage of the abolition of council DIY waste charges",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2023-06-19T13:01:24+01:00",
    "content": [
        {
            "text": "There has been widespread coverage in the last couple of days in publications including the Sunday Express, The Times, iNews, letsrecycle.com, Circular and BristolLive of our abolition of charges to dispose of DIY waste at household waste recycling centres (HWRCs)."
        },
        {
            "text": "The announcement made by environment Minister Rebecca Pow on Sunday (18 June) will help householders to dispose of their waste in a responsible manner and encourage recycling."
        },
        {
            "text": "Around a third of local authorities still charge for household DIY waste. The changes outlined yesterday will mean councils treat DIY waste the same as household waste and could save people up to £10 for an individual item – for example, a sheet of plasterboard."
        },
        {
            "text": "This will make it much easier and cheaper for people making home improvements to get rid of their waste – and may reduce the temptation to use waste cowboys who fly-tip rubbish."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "These changes complement wider action we are taking to tackle fly-tipping and waste crime, which is estimated to cost the economy £924m per year in England."
        },
        {
            "text": "Earlier this year we announced grants totalling £775,000 to help councils roll out a range of projects to crack down on fly-tipping."
        },
        {
            "text": "We have consulted on reforming the waste carrier, broker, dealer regime and on introducing mandatory digital waste tracking and we are also developing a fly-tipping toolkit with National Fly-Tipping Prevention Group to help spread best practice on tackling the issue among local authorities."
        },
        {
            "text": " Follow Defra on Twitter and sign up for email alerts here."
        }
    ]
}