{
    "url": "https://educationhub.blog.gov.uk/2023/06/drowning-prevention-week-what-children-learn-about-water-safety-at-school/",
    "title": "Drowning Prevention Week: what children learn about water safety at school",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-06-19T14:19:15+01:00",
    "content": [
        {
            "text": "Swimming and water safety are compulsory parts of the National Curriculum at primary school to make sure that children are well equipped to enjoy swimming and know how to keep safe in and around water.  "
        },
        {
            "text": "As we head into summer, it’s especially important that children are prepared with these skills. "
        },
        {
            "text": "This year, the Royal Life Saving Society UK's Drowning Prevention Week runs from 17 June to 24 June 2023, and aims to raise awareness about water safety.  "
        },
        {
            "text": "Water safety skills are useful to know all year round. Here’s everything you need to know about what is taught in schools.  "
        },
        {
            "heading": 3,
            "text": "What do pupils learn in school about water safety? "
        },
        {
            "text": "To help build children’s confidence in and around water, we work closely with a range of organisations including Swim England, The Royal Life Saving Society UK and the RNLI.  "
        },
        {
            "text": "Water safety is a mandatory part of the curriculum for PE at primary school, with pupils taught to perform safe self-rescue in different water-based situations.  "
        },
        {
            "text": "By the end of primary school, all children should be able to swim at least 25 metres unaided  using a range of strokes. "
        },
        {
            "text": "Schools can also use their Personal, Social, Health and Economic (PSHE) programme to equip pupils with a good understanding of risk to help them make safe and informed decisions.  "
        },
        {
            "text": "Schools can access free resources from the PSHE Association, which have been produced in partnership with the Environment Agency. "
        },
        {
            "heading": 3,
            "text": "How are you supporting schools to teach water safety? "
        },
        {
            "text": "This year, we announced a total of over £600 million across the next two academic years for the PE and sport premium – this is funding which schools must use to make improvements to the quality of the PE, sport and physical activity on offer. "
        },
        {
            "text": "The PE and sport premium can be used by primary schools to support swimming and water safety lessons, including funding teacher training and additional swimming lessons for children who need extra help. "
        },
        {
            "text": "We’re also helping children with SEND (special educational needs and disabilities) to learn to swim about water safety through our Inclusion 2024 programme, led by the Youth Sport Trust. New resources are available on Swim England’s new online inclusion hub. "
        },
        {
            "heading": 3,
            "text": "Where can I find out more? "
        },
        {
            "text": "Resource packs for schools are available on the Swim England website, including guidance on teaching water safety at Key Stages 1 and 2. "
        },
        {
            "text": "Water safety resources are also available for pupils in Key Stages 1 to 3 the Royal Life Saving Society’s website."
        }
    ]
}