{
    "url": "https://teaching.blog.gov.uk/2023/06/19/planning-our-vision-for-music-education/",
    "title": "Planning our vision for music education",
    "authors": [
        "Dr Steven Berryman"
    ],
    "categories": [
        "Inspiring teachers",
        "Uncategorized"
    ],
    "pub_date": "2023-06-19T10:32:26+01:00",
    "content": [
        {
            "text": "Dr Steven Berryman, Director of creativity, music and culture at The Charter Schools Educational Trust explains their vision for music education."
        },
        {
            "text": "Our vision "
        },
        {
            "text": "As the Director of creativity, music and culture across the family of schools in the Charter Trust, I oversee our music strategy. As a former expert panel member for the National Plan for Music Education (NPME), I was keen to work with music leads in our school to champion the ambitions of the plan."
        },
        {
            "text": "As a Trust, we are committed to music. We have primary and secondary schools in the trust who all have a music lead and a range of instrumental teaching, enrichment, ensembles and projects with the local music hub. We are rightly proud that over one third of pupils across the Trust are involved in music lessons outside of the curriculum and attend a musical activity each week."
        },
        {
            "text": "We reviewed music education across our schools by looking at the participation in music beyond the classroom, including taking a closer look at those most at risk of missing out on such involvement (such as those eligible for free school meals). We know it’s important that our schools have timetabled music with high-quality curriculum music for at least one hour a week in key stages 1 to 3, supported by co-curricular learning, and musical experiences."
        },
        {
            "text": "We explored what we valued and wanted to ensure every child could access; this was a discussion had not only with senior leaders but with executive leaders and trustees. These conversations helped to shape our trust-wide vision for music."
        },
        {
            "text": "Sharing practice"
        },
        {
            "text": "Through a music themed network across the Trust, we used the Model Music Curriculum (MMC) as a starting point for discussions about the music curriculum in our schools with a particular focus on developing singing. Music leads have shared examples of singing in their schools and reflected on the journey through nursery to year 6 in how we champion healthy vocal development through a range of curriculum and co-curricular experiences. Through these discussions we were able to agree on future collaborations to develop singing further across our schools."
        },
        {
            "text": "We have a range of excellent music curriculums being taught across our schools that have been designed with care and sequenced to ensure purposeful musical learning. Music leads readily share their work with peers, and where necessary build on the music curriculum offer in the local hub."
        },
        {
            "text": "Partnerships"
        },
        {
            "text": "Working in partnership is vital for a healthy music education. Our schools have formed sustained partnerships with the local hub and with ensembles and musicians in our borough. Recent work has included students performing with the Multi-Story Orchestra and taking part in a song writing workshop in a local cross-sector partnership. Pupils have taken part in orchestral workshops with the hub and have had musicians visit such as a recent opera workshop. As we plan out a programme of activity for the next academic year, we will consider which partnerships can be shared across our Trust to maximise involvement and to bolster collaboration. We are particularly excited that one of our schools will join the Music in Secondary Schools Trust (MiSST) programme in the coming year."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "In the summer term of the current academic year, I have met with music leaders to work on their Music Development Plans (MDP) for the next academic year, seeking to ensure these are in place for September 2023. These plans build on our trust-wide ambitions for music, which exceed the expectations of the NPME. The MDP discussions focus on what is our music education offer in each school, and to refine the priorities for the year ahead and for the next three years. As a Trust, we will seek to achieve our ambitions by working in collaboration across our family of schools to share expertise and resource, but also to consider where we can work with local independent schools and our music hubs."
        },
        {
            "text": "The MDPs help shape our Trust-wide music development plan, something the NPME encourages MATs to create. In my role as Director of Creativity, Music and Culture I will support Music leads to deliver their individual plans and through their work, and our trust-wide collaboration, seek to achieve the broader trust-wide goals in our MAT Music Development Plan."
        },
        {
            "text": "Find more information about how the DfE are ensuring young people have access to great music education: How we are ensuring young people have access to great music education - The Education Hub (blog.gov.uk)"
        }
    ]
}