{
    "url": "https://apprenticeships.blog.gov.uk/2023/06/19/solicitor-apprenticeships-hamzas-journey/",
    "title": "Solicitor apprenticeships: Hamza's journey",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "Legal apprentices"
    ],
    "pub_date": "2023-06-19T10:26:11+01:00",
    "content": [
        {
            "text": "Solicitor apprentices are outperforming those taking the more traditional academic route into law. Apprentice pass rates for the Solicitor Qualifying Examinations (SQE) are, on average, 26% higher than the overall pass rate."
        },
        {
            "text": "Hamza Islam, at Norton Rose Fulbright LLP, shared his experiences as a current level 7 solicitor apprentice and why he chose to do an apprenticeship to progress in his career."
        },
        {
            "text": "Hamza Islam is a solicitor apprentice at Norton Rose Fulbright LLP."
        },
        {
            "heading": 2,
            "text": "How did you learn about apprenticeships?"
        },
        {
            "text": "There was limited scope of my awareness to apprenticeships, I was already leaning towards law via the traditional pathway of university and therefore it made logical sense. My experience with apprenticeships was completely accidental and only occurred through a chance insight experience. I received an email follow-up detailing a firm’s apprentice offering and began using that as a basis to apply to others."
        },
        {
            "heading": 2,
            "text": "What was your apprenticeship experience like?"
        },
        {
            "text": "I have had incredible opportunities through both my employer and my own presence within the apprenticeship space. I value the voice I have been given to speak to bodies, such as IfATE and the Law Society, regarding points of discussion as a legal apprentice. I have represented my firm on a global level as a charitable ambassador, which saw me travel to Cambodia with Save The Children UK."
        },
        {
            "text": "I have been involved in market-leading deals and I’m establishing an organisation alongside apprentices from other providers to to help mitigate the lack of awareness we initially found with the route."
        },
        {
            "heading": 2,
            "text": "Have you any “words of wisdom” for other apprentices or employers of apprentices?"
        },
        {
            "text": "If I had any words of wisdom, it would be: “Being an apprentice often means dancing with the spotlight; I would recommend embracing the light as that’s the only way a path can be established.”"
        }
    ]
}