{
    "url": "https://insideDIO.blog.gov.uk/2023/06/19/staying-safe-and-protecting-wildlife-on-the-defence-training-estate/",
    "title": "Staying safe and protecting wildlife on the Defence Training Estate",
    "authors": [
        "Dean Howard"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Public safety"
    ],
    "pub_date": "2023-06-19T08:36:55+00:00",
    "content": [
        {
            "text": "The Coast and Country Canines team alongside colleagues from DIO's Access and Recreation and ecology teams [Crown Copyright / MOD 2023]As the Deputy Training Safety Officer for the South East Defence Training Estate, my job is to ensure that our Armed Forces have a safe place to train at numerous sites across the region. It’s a varied role that often involves working with local communities and partner organisations to promote safe and responsible public access to our training areas."
        },
        {
            "text": "An excellent example of this was our recent support to a pop-up event run by Coast and Country Canines at Browndown Beach Military Training Area on the south coast of Hampshire. The initiative was set up by Bird Aware Solent and aims to promote safe and wildlife-aware dog walking – something that’s particularly important at MOD sites such as Browndown, where military training takes place in balance with the maintenance of a rich but delicate coastal ecosystem."
        },
        {
            "text": "We were delighted to host Coast and Country Canines at Browndown in May, supported by colleagues in the DIO Access and Recreation Advisory Team and our ecology team. Throughout the day, Coast and Country Canines and DIO staff greeted dog owners and members of the public, and shared friendly advice. There was some great engagement and lots of positive discussions took place about how to keep safe and prevent disturbance to birds and other wildlife that rely on the site’s beach habitat."
        },
        {
            "heading": 2,
            "text": "‘Respect the Range’: public safety at Browndown"
        },
        {
            "text": "A military presence has been at Browndown since 1852, when gun batteries were built on shore to defend the western approach to Portsmouth Harbour. Nowadays, training takes place on Browndown Beach, which, at over a mile long, is ideal for carrying out a variety of amphibious operations and training exercises both day and night."
        },
        {
            "text": "Browndown Beach is used for a variety of military training exercises, including amphibious operations [Crown Copyright / MOD 2023]We welcome dog walkers and members of the public to use the permissive paths through the site when safe to do so. However, there are some important rules to bear in mind. First and foremost of these is to always observe flags and signs which indicate training is taking place – this applies to all of our training areas across the UK."
        },
        {
            "heading": 2,
            "text": "Encouraging responsible dog walking"
        },
        {
            "text": "We know that Browndown offers some great dog walking opportunities, so Coast and Country Canines’ pop up stand was a great opportunity to increase awareness of a couple of additional rules which apply to dog owners."
        },
        {
            "text": "Coast and Country Canines was established by Birds Aware Solent to promote safe, wildlife aware dog walking [Crown Copyright / MOD 2023]We ask that people always keep their dogs under control when on MOD land, as sudden noises from military training can scare them with unexpected consequences. We also politely ask that people remember to pick up after their dogs. In addition, at sites such as Browndown which provide vital habitats for coastal birds, it’s important that dogs are kept on leads during the bird nesting season which runs from 1st March to 31st August."
        },
        {
            "heading": 2,
            "text": "Preserving a unique and nationally important ecosystem"
        },
        {
            "text": "It was great to be supported at the recent pop-up event by a colleague from the DIO ecology team, who shared her expertise about the key importance of the site for birds and other wildlife."
        },
        {
            "text": "Browndown is nationally important as a Site of Special Scientific Interest (SSSI) for its rare and fragile vegetated shingle. The heathland plants, interspersed with small bare patches of shingle, provide a specialised habitat for unusual plants such as the Nottingham Catchfly."
        },
        {
            "text": "The site also provides habitats for rare and endangered invertebrates such as the Spathocera dahlmanni (a small squash bug) and the Gilkicker Weevil, which has only ever been discovered at three other sites in the United Kingdom!"
        },
        {
            "text": "The shoreline itself is important for roosting migratory birds such as ringed plover, dunlin and sanderling. Over the last few years, DIO teams have been working alongside Bird Aware Solent to increase awareness of the importance of the shingle high tide zone for these birds by undertaking monitoring surveys and installing signage."
        },
        {
            "text": "Our DIO ecologists are also delivering a programme of habitat management works to protect, maintain, and where possible enhance the SSSI habitats and supporting habitats for a range of species at Browndown. This work has included habitat management around winter pools, protection of the rare dotted sedge and the creation of specially managed areas to encourage regeneration of shingle vegetation. The works have been carried out as part of the UK-wide MOD Site of Special Scientific Interest Condition Improvement Project, funded by the DIO Conservation Stewardship Fund."
        },
        {
            "text": "The plants and animals at Browndown are vulnerable to disturbance and their continued protection depends on this sensitive management. That’s why making sure to follow the rules and sticking to permitted routes is so important to ensuring we can all continue to enjoy this very special place, while staying safe and supporting military training."
        },
        {
            "text": "If you’re planning to visit Browndown or any of our other publicly accessible training areas this summer, make sure to follow the MOD’s guidance to keep yourselves and your loved ones safe: https://www.gov.uk/guidance/safe-access"
        }
    ]
}