{
    "url": "https://environmentagency.blog.gov.uk/2021/08/04/blue-space-the-final-frontier/",
    "title": "Blue space - the final frontier",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-08-04T09:27:32+00:00",
    "content": [
        {
            "text": "Blue spaces. A phrase we keep hearing at the moment, but what are they, and why are they important? Blue spaces are officially described as ‘outdoor environments–either natural or manmade–that prominently feature water and are accessible to people’. In short - the collective term for rivers, lakes or the sea."
        },
        {
            "text": "The social benefits of the natural environment and green space are well understood and researched, but what about the benefits of blue space?"
        },
        {
            "text": "We set out to find out more. We commissioned some research to find out what information has already been captured, what it tells us, and how the benefits of blue space compare to those of green spaces."
        },
        {
            "text": "The two main aims of the project were to:"
        },
        {
            "text": "We set important selection criteria to ensure we got the right information to help our understanding. We focused on people's sensory exposure to blue spaces, their visits to them, proximity to them and participation in recreational activities on or in blue spaces, such as sailing, windsurfing, swimming etc."
        },
        {
            "text": "Over 3,700 studies were initially looked at but, taking the above criteria into consideration, we whittled these right down to just 77 studies that we then analysed in detail."
        },
        {
            "text": "What we found:"
        },
        {
            "text": "The importance of our natural environment and the role it plays in our wellbeing is only now beginning to be understood as research explores its various components."
        },
        {
            "text": "Everyone knows that water is a critical element of life. But what we now know is just how important blue spaces are for our mental health and wellbeing too. So, we need to take care of them – all of us."
        },
        {
            "text": "If you’re looking after your health and wellbeing at a blue space this summer, whether fishing, canoeing, wild swimming or simply taking a walk along the beach, be a #WaterWarrior and return the favour by protecting the health and wellbeing of the blue space you enjoy. It’s so easy, some simple steps can make a big difference:"
        },
        {
            "text": "Read more about the Environment Agency’s research: The social benefits of Blue Space: a systematic review - GOV.UK (www.gov.uk)"
        }
    ]
}