{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/08/04/electric-vehicle-charging-cma-finds-more-needs-to-be-done/",
    "title": "Electric vehicle charging: CMA finds more needs to be done",
    "authors": [
        "Sabrina Basran"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2021-08-04T15:05:18+01:00",
    "content": [
        {
            "text": "To ensure a smooth transition to electric vehicles (EVs), there will need to be a UK-wide charging network in place by 2030, when new petrol and diesel cars will stop being sold – a network everyone can use and trust in, no matter where they live."
        },
        {
            "text": "Last year, we launched a market study into EV charging – looking at how this critical new sector is developing and people’s experience of using chargepoints. We've now finished the study and have found that while some parts of the sector are developing relatively well, others are facing greater challenges. We’ve also heard that charging can sometimes be difficult and frustrating for drivers."
        },
        {
            "text": "While the private sector plays an important role in this – given the challenges this sector is facing – even greater support from government is needed to push forward the roll-out ahead of demand."
        },
        {
            "heading": 2,
            "text": "A challenge not to be underestimated"
        },
        {
            "text": "For people to easily shift to EVs, it's essential that there is a comprehensive and competitive EV charging network in place – one that people are confident using and can trust. Everyone should be able to access convenient and affordable charging for their EV that's easy to use, no matter where they live."
        },
        {
            "text": "As it stands, the provision of charging facilities is patchy and access to charging can be a ‘postcode lottery’, with significant variation in different parts of the UK."
        },
        {
            "text": "Finding a chargepoint isn’t as easy as it should be. For example, the number of total public chargepoints per head in Yorkshire and the Humber is a quarter of those in London – as shown in the image below."
        },
        {
            "text": "The scale of the shift needed to transition to EVs is huge."
        },
        {
            "text": "Forecasts suggest that up to 480,000 public chargepoints will be needed by 2030. To put that into perspective, there are currently 25,000 public chargepoints in the UK – so at least more than 10 times as many chargers will be needed."
        },
        {
            "heading": 2,
            "text": "Our concerns"
        },
        {
            "text": "Some parts of the EV sector are developing relatively well, like charging at destinations (such as shopping centres),in people’s private parking areas (driveways or garages) or at workplaces."
        },
        {
            "text": "However, we’ve found much greater challenges with the roll-out of chargepoints in other locations such as along motorways, in remote areas, and on-street (ie at the kerbside), where millions park their cars."
        },
        {
            "text": "For many drivers, charging in these places is key, otherwise they will worry about ‘range anxiety’ or not being able to get from point A to B easily."
        },
        {
            "text": "On-street charging will be particularly important for around a quarter of UK drivers without private parking who will need convenient cost-effective charging options."
        },
        {
            "text": "We've found:"
        },
        {
            "text": "We’ve heard from many current EV drivers about some of the problems they currently face when charging. Using and paying for charging needs to be as straightforward as filling up with petrol or diesel – but that’s far from the case right now."
        },
        {
            "text": "We found that people can struggle to find working chargepoints, compare costs or pay for charging. While some of these might be teething problems which will get better over time as the network grows, there is no guarantee and in the meantime, people will be put off."
        },
        {
            "heading": 3,
            "text": "Charging should be as simple as filling up with petrol or diesel:"
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "We’ve set out a package of measures to unlock greater investment, promote competition and boost trust in the sector, building on the significant work already underway in this sector by governments and others."
        },
        {
            "text": "Our key recommendations are summarised below:"
        },
        {
            "text": "We’re also taking action ourselves and have launched a competition law investigation into long-term exclusivity arrangements along motorways following concerns that these may be restricting competition, which could result in poorer service for drivers."
        },
        {
            "text": "Steering the sector in the right direction now will help ensure that people do not lose confidence at this crucial early stage. This report is not the end of our work here. We will continue to work with the governments as well as the industry, to ensure a healthy charging sector develops."
        },
        {
            "text": "Read the CMA’s electric vehicle charging final report."
        }
    ]
}