{
    "url": "https://socialcare.blog.gov.uk/2021/08/04/vaccines-condition-of-deployment/",
    "title": "Our experience of vaccination as a condition of deployment",
    "authors": [
        "Dr Pete Calveley"
    ],
    "categories": [
        "Care and support",
        "coronavirus"
    ],
    "pub_date": "2021-08-04T09:16:02+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Finding our way"
        },
        {
            "text": "Against the backdrop of the constantly evolving COVID-19 situation, here at Barchester Healthcare we have been working tirelessly, in difficult circumstances, to protect and reassure our residents, their relatives and our colleagues."
        },
        {
            "text": "At the beginning of the pandemic, we knew very little about the virus, but as information was gained, we took every opportunity to protect our vulnerable residents."
        },
        {
            "text": "We therefore took the roll out of COVID-19 vaccines very seriously, constantly encouraging and supporting residents and colleagues to take the jab. While we recognised everyone had a choice, we were keen to make sure our staff considered, not just their own safety, but the safety of those for whom they cared."
        },
        {
            "text": "Needless to say, there were some who were very willing from the start, and others who were more reticent and, understandably, had questions about it. We recognised this and spent considerable time, in the early part of the year, explaining the benefits, addressing concerns and encouraging staff to make informed personal decisions."
        },
        {
            "text": "We gathered as much information about the vaccine as possible, the process of developing it, the safety measures around it, and of course the outcomes from taking it."
        },
        {
            "text": "As soon as the vaccine became available in December 2020, we communicated this to our staff through direct emails and our company app. We did this in tandem with 1-2-1 sessions and webinars with a professor of virology who was able to give an external, professional view, taking questions from whoever needed support and guidance."
        },
        {
            "text": "We established a dedicated intranet site providing information about the vaccines, which included staff surveys to help us understand how colleagues were feeling."
        },
        {
            "text": "As Chief Executive of Barchester Healthcare, I made sure I was front and centre of much of the communication, taking questions and seeking to understand any issues. I also took the vaccine as soon as I was eligible, as I felt it was important to lead by example."
        },
        {
            "text": "We were the first social care provider to launch a vaccination policy, as we felt that this was so important for the protection of our residents. We outlined our approach clearly and with plenty of notice to make sure staff had the time and confidence to consider their decision to get vaccinated."
        },
        {
            "text": "This was rolled out in two stages - firstly mandating the vaccine for all new starters and then later for all existing staff."
        },
        {
            "text": "We implemented the full vaccination policy for staff on 24 April 2021, meaning our frontline colleagues would only be offered work if they had committed to being vaccinated. We have been working through the appropriate processes to support those who are now taking up the vaccine and those who have decided it is still not for them."
        },
        {
            "heading": 2,
            "text": "High take up"
        },
        {
            "text": "We are pleased to say we now have 94% of our staff vaccinated with one dose and 87% with both.  Of course, some staff are medically exempt and we respect that. We continue to work with them to see this through. All frontline staff who join us now are required to have had the vaccine or be prepared to do so."
        },
        {
            "text": "We have worked tirelessly to engage and communicate the benefits of the vaccination and are delighted with the results of this."
        },
        {
            "text": "In terms of our advice to others, whilst this has not been an easy process, by showing leadership, demonstrating openness and clear communication, being unrelenting in your support, and explaining the possible health consequences if the vaccine offer is not taken up, it is possible to overcome concerns."
        },
        {
            "text": "Understandably, staff had questions at the beginning; this was something new and some were scared, especially those who distrust authority. Communicating the science and having an independent expert to answer questions certainly helped, but peer to peer support played a part too."
        },
        {
            "text": "As one staff member said: “I think it is amazing we have been offered the vaccine. As someone who has already had COVID-19, I will do everything in my power to persuade staff to get vaccinated’."
        },
        {
            "text": "We have also worked with the DHSC in support of their rollout and provided regular support and insight at their social care stakeholders meetings. We are currently preparing a webinar and look forward to sharing our experiences and learning across the sector."
        }
    ]
}