{
    "url": "https://educationhub.blog.gov.uk/2025/12/5-things-we-are-doing-to-tackle-child-poverty/",
    "title": "5 things we are doing to tackle child poverty",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "breakfast clubs",
        "Families",
        "Free School Meals"
    ],
    "pub_date": "2025-12-05T06:00:00+00:00",
    "content": [
        {
            "text": "Families across the country are feeling the pressure of rising costs. From making sure children have access to nutritious meals to helping with the cost of school essentials, here are five things that we are doing to pull over half a million children out of poverty. "
        },
        {
            "heading": 3,
            "text": "Expanding free school meals to every family on Universal Credit "
        },
        {
            "text": "From the start of the 2026 school year, every pupil in state funded schools, school-based nurseries, sixth forms and further education institutions, whose household is on Universal Credit will be entitled to free school meals. This will put £500 back into parents' pockets per child, every year, and means over half a million more children will benefit from a free nutritious meal every school day. "
        },
        {
            "text": "Since 2018, children have only been eligible for free school meals if their household income is less than £7,400 per year. This meant hundreds of thousands of children living in poverty couldn't access this support. The expansion will lift 100,000 children across England out of poverty. "
        },
        {
            "text": "Research shows that giving children access to a nutritious meal during the school day leads to higher attainment and improved behaviour.  "
        },
        {
            "text": "We are updating the Eligibility Checking System, making it quicker and easier for families to get their children signed up for free school meals.  "
        },
        {
            "heading": 3,
            "text": "Rolling out free breakfast clubs in primary schools "
        },
        {
            "text": "Half a million more children will benefit from free breakfast clubs from September 2026. Applications have opened for the next wave of 500 schools with 40% of pupils on free school meals to benefit from the programme. "
        },
        {
            "text": "The clubs save working parents up to £450 and give back up to 95 hours of time each year. Schools with the highest proportion of pupils on free school meals are being prioritised so support goes first to where it's most needed.  "
        },
        {
            "heading": 3,
            "text": "Creating Best Start Family Hubs across the country "
        },
        {
            "text": "Up to 1,000 Best Start Family Hubs will be created across every local authority in England by 2028, with over £500 million being invested in the programme. These hubs will be local centres where families can access a range of services all in one place. "
        },
        {
            "text": "Whether it's free classes, events and activities, help with your children before they start school, or advice on finance and housing, the hubs will either provide these services directly or connect you to the right local support. Each hub will have a trained professional to support children with additional needs. "
        },
        {
            "text": "Many parents find it difficult to know where to go for help with their children, with services often feeling disconnected and hard to navigate – Best Start Family Hubs will be there to support you with this. A new digital service is also being created to give quick access to trusted advice on parenting and child development. "
        },
        {
            "heading": 3,
            "text": "Scrapping the two child benefit cap "
        },
        {
            "text": "From April 2026, the Government will remove of the two-child limit, which prevents parents from claiming Universal Credit or Tax Credits for third and subsequent children born after April 2017. Most families (6 in 10) affected by the two-child limit are in work."
        },
        {
            "text": "Half had all off their children before coming onto benefits, through a change in circumstances. This change will lift 450,000 children out of poverty by the end of the Parliament.  "
        },
        {
            "text": "In addition, we will support working families with three or more children by increasing the maximum amount of childcare costs they can claim in Universal credit by £736.06 for each additional child above the current maximum cap for two children."
        },
        {
            "heading": 3,
            "text": "Capping the cost of school uniforms "
        },
        {
            "text": "School uniforms can be expensive, particularly when schools require multiple branded items that can only be bought from specific suppliers.  A recent survey by Parentkind found that half of parents feel concerned about the cost of uniforms."
        },
        {
            "text": "The Children's Wellbeing and Schools Bill will ban schools from requiring more than three branded items as part of the school uniform. They will also be allowed a tie as an additional item. This means no school in England will be able to require unnecessarily large numbers of branded items. Currently 24% of primary and 71% of secondary schools still require five or more branded items, with some parents saying they were asked to provide 10 or more. Parents will have more options to shop around for affordable uniform items on the high street or at supermarkets. "
        },
        {
            "text": "Schools should also help make second-hand uniforms available for parents to buy – including ahead of the new school year.  "
        }
    ]
}