{
    "url": "https://moderncivilservice.blog.gov.uk/2025/12/05/from-saving-orangutans-to-tracking-hornets-the-unexpected-world-of-the-operational-delivery-profession-at-apha/",
    "title": "From saving orangutans to tracking hornets: the unexpected world of the Operational Delivery Profession at APHA",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Civil Service Live",
        "Government Reform",
        "Innovation",
        "Join a profession",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2025-12-05T10:16:45+00:00",
    "content": [
        {
            "text": "This blog post has been created in collaboration with the Animal and Plant Health Agency."
        },
        {
            "text": "When people think of the Civil Service, they often imagine policy papers and Whitehall meetings. But out on the front lines, the reality can be very different. The Animal and Plant Health Agency (APHA) provides a perfect example of this. Here are their four stories that show just how diverse and vital the Operational Delivery Profession (ODP) can be!"
        },
        {
            "heading": 3,
            "text": "The race to save Sibu Junior"
        },
        {
            "text": "At the Centre for International Trade in Bristol, paperwork often translates directly into life-saving action. The team recently faced a critical deadline involving Sibu Junior, a baby orangutan at Dublin Zoo whose mother was unable to feed him. To survive, Sibu needed to reach specialist care at Monkey World in Dorset immediately. The team worked relentlessly, collaborating with nature conservation agencies to issue complex CITES permits in under 24 hours. Their rapid operational response meant Sibu could be legally moved to safety, where he is now thriving among other orphan orangutans."
        },
        {
            "heading": 3,
            "text": "Solving the cactus conundrum"
        },
        {
            "text": "Sometimes the role requires deep empathy and problem-solving to help the public navigate complex rules. A collector of rare cacti found himself in significant distress when his imported plants were held at the border for months due to paperwork errors, impacting his mental health. The Plant Health Admin Support Team stepped in, refusing to let the case stagnate in a \"computer says no\" loop. By physically locating the \"lost\" plants at the airport and working pragmatically with the importing agent to correct the errors, they secured the release of the plants and ensured the rare collection survived."
        },
        {
            "heading": 3,
            "text": "Investigation of the illegal furry traveller "
        },
        {
            "text": "Operational delivery often requires detective work. When a cat was discovered in a lorry in Telford, having accidentally hitchhiked 1,200 miles from France via Italy, the Illegal Landings Team sprang into action. Rather than simply following standard procedure, they went above and beyond, trawling through EU pet databases to track the animal's microchip. Their persistence paid off; they identified the cat as a missing pet from France and coordinated with vets and trading standards to arrange a reunion with the delighted owners after a quarantine period."
        },
        {
            "heading": 3,
            "text": "High-Tech hunters in the Bee Unit"
        },
        {
            "text": "Innovation is also a core part of the ODP. The National Bee Unit is currently at the forefront of the fight against the invasive yellow-legged hornet. In a ground-breaking trial, regional inspectors are fitting tiny radio transmitters to live hornets. This technology allows the team to track the insects back to their nests with unprecedented speed, replacing physically exhausting manual tracking with smart tech. It is a prime example of how operational teams adapt and evolve to protect our native ecosystems."
        },
        {
            "heading": 2,
            "text": "The Animal and Plant Health Agency (APHA)"
        },
        {
            "text": "If you have never heard of The Animal and Plant Health Agency (APHA), its role is to safeguard animal and plant health for the benefit of people, the environment, and the economy. They are responsible for identifying and controlling endemic and exotic diseases and pests, while conducting vital scientific research and acting as an international reference laboratory. Beyond disease control, the agency facilitates international trade in animals and plants, protects endangered wildlife through licensing, and manages a programme of apiary inspections. Their remit also includes regulating the safe disposal of animal by-products to reduce the risk of dangerous substances entering the food chain."
        },
        {
            "text": "Richard Lewis, APHA’s Chief Executive Officer and the recently appointed Head of Operational Delivery Profession for Defra Group, says:"
        },
        {
            "heading": 3,
            "text": "Join the Operational Delivery Profession to read more stories like this"
        },
        {
            "text": "These stories are just a snapshot of the incredible work happening right now across the ODP. You can learn more about it, read similar stories and connect with other ODP professionals by becoming a member of the Operational Delivery Profession (ODP) . This is an \"open membership\" profession, requiring no qualifications or HR processes to join, and you can even become a member as a secondary profession. Sign up here!"
        }
    ]
}