{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/05/international-volunteer-day-making-a-difference-in-our-communities/",
    "title": "International Volunteer Day: making a difference in our communities",
    "authors": [
        "Jaimella Espley, Senior Delivery Manager, Common Tools",
        "Gideon Goldberg, Lead Developer, Funding Service",
        "Emma Crowe, Head of Communications, Digital Planning"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2025-12-05T09:53:57+00:00",
    "content": [
        {
            "text": "Every year, International Volunteer Day highlights the important role volunteering plays in strengthening communities and supporting positive change. In this post, 3 of our colleagues reflect on their volunteering experience: what motivates them, how their contributions support the people and places around them, and how it connects to their professional values. "
        },
        {
            "heading": 2,
            "text": "Jaimella Espley, Senior Delivery Manager, Common Tools "
        },
        {
            "text": "I’m a senior delivery manager working across programmes in the Common Tools team. We build reusable tools for the department, helping teams be more efficient. "
        },
        {
            "text": "I’m a volunteer bird surveyor for the British Trust for Ornithology (BTO), Royal Society for the Protection of Birds (RSPB), National Trust and Derbyshire Wildlife Trust. Living in the Peak District National Park, I monitor sites close to my home. I do regular counts of wetland birds, breeding birds and rare upland species such as curlew, lapwing and snipe. The data generated helps map long-term population trends and inform conservation strategies. "
        },
        {
            "text": "I believe spending time in nature and watching birds supports all the 5 ways of wellbeing, helping us connect, learn and grow. I love being able to play a tiny part in helping preserve local species and wild places for future generations. Learning to identify a bird in flight by a song or call is an intellectual challenge. Learning to make nest boxes takes me out of my comfort zone. "
        },
        {
            "text": "Getting up in the dark can sometimes be a struggle. It’s always worthwhile, when I hear the dawn chorus start in an ancient woodland or a curlew calling as the sun rises over the moorland. "
        },
        {
            "heading": 2,
            "text": "Gideon Goldberg, Lead Developer, Funding Service "
        },
        {
            "text": "I’m currently a lead developer working on the Funding Service; you can find out more about what I do and my experience in my role in this blog post.  "
        },
        {
            "text": "I volunteer with the careers education charity Inspire. Their mission is to inspire children and young people across London and beyond through encounters with employers. Most recently I took part in their ‘Pathways to Professionalism’ day.   "
        },
        {
            "text": "It was great to be able to share my professional experience, especially with a diverse group of girls at Plashet School in Newham (one of the most deprived boroughs in London according to the Ministry of Housing, Communities and Local Government's (MHCLG’s) own data). Anything we can do to inspire these students to improve their social mobility is doubly valuable.  "
        },
        {
            "text": "The Year 7 students were incredibly engaged, always putting their hands up and got fully involved with the varied activities we facilitated throughout the day. It was particularly rewarding when I asked the students if they knew what a civil servant was (a question that usually gets a stunned silence) and one girl responded her sister was a civil servant and that she had a cool job! "
        },
        {
            "text": "I’ll let the students have the last word with their feedback on what they learned during the day: "
        },
        {
            "heading": 2,
            "text": "Emma Crowe, Head of Communications, Digital Planning  "
        },
        {
            "text": "I work in the Digital Planning team at MHCLG, focused on transforming England’s planning system to enable more homes to be built for our communities. "
        },
        {
            "text": "For almost 3 years I’ve been volunteering with GoodGym, a nationwide community that helps you get fit by doing good. We’re runners, walkers and cyclists, who combine regular exercise with making a difference in our communities. I’m a member of my local group in Kingston upon Thames.  "
        },
        {
            "text": "My family now know Tuesday is my Group GoodGym night when we run 2.5km to a task, spend an hour doing a good deed, then run back to our meeting place. It's far better than spending an hour in the gym in my opinion!  "
        },
        {
            "text": "What motivates me is simple: I get to meet local people of all ages and backgrounds, work on a range of rewarding tasks helping my local community whilst getting fit.  "
        },
        {
            "text": "The variety of tasks never ceases to amaze me. Recently, we've completed a deep clean of Kingston Foodbank, cleaned graffiti near a community centre, helped move planters and sheds for a community garden, and created seasonal window displays for the British Heart Foundation! We've also cleaned bikes for Full Cycle, a community bike project which supplies refurbished bikes to refugees and those on low incomes.  "
        },
        {
            "text": "One of my favourite tasks took place this week – putting up Christmas decorations at a supported living home for young people. Many hands really do make light work – it’s incredible what a small group of us can achieve in an hour."
        },
        {
            "text": "As a civil servant, volunteering where I live with a charity like GoodGym connects directly to my professional values. I see firsthand how local initiatives strengthen communities and how small contributions create real impact. "
        }
    ]
}