{
    "url": "https://food.blog.gov.uk/2025/12/05/join-us-for-the-fsa-open-board-meeting-10-december/",
    "title": "Join us for the FSA open Board meeting – 10 December",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-12-05T10:25:11+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The FSA’s final board meeting of the year will take place next Wednesday (10 December) at Victoria Hall, Reading. This is your opportunity to hear first-hand how we’re tackling issues that affect your food."
        },
        {
            "text": "We're discussing a range of topics including Precautionary Allergen Labelling (PAL) – an important issue for more than two million people affected by food hypersensitivity in the UK. The focus will be on the UK’s position on new international proposals for a global standard for PAL. The Board will review evidence gathered from businesses and allergen charities and decide whether to support the introduction of a new allergen threshold. This is a move intended to improve consistency and clarity for people with food hypersensitivity while balancing safety, practicality, and food choice."
        },
        {
            "text": "Future support for smaller abattoirs is also in the spotlight. The Board will consider proposals for a revised approach to the discounts we give to some businesses on our charges for meat inspection. The aim is to create a fairer, more transparent system that supports smaller abattoirs, which play an important role in maintaining diversity in farming and consumer choice. The discussion will cover the revised model of support and plans for a public consultation on these changes."
        },
        {
            "text": "Also, this month we’re urging diners to check food hygiene ratings before booking their festive meals out. Our Food Hygiene Rating Scheme is now marking its 15-year anniversary and covers more than 430,000 businesses. Ratings can be checked on our website. This is part of our wider Christmas food safety campaign aimed at both consumers and food businesses.  There are Christmas food hygiene tips and cooking advice on our website, and keep an eye out for more of our Christmas campaign communications on our social media channels."
        },
        {
            "text": "If you’re interested in watching the Board meeting on 10 December, you can watch it live online – sign up now to join us virtually."
        },
        {
            "heading": 2,
            "text": "Dewch yn llu i gyfarfod agored Bwrdd yr ASB – 10 Rhagfyr"
        },
        {
            "text": "Bydd cyfarfod olaf Bwrdd yr Asiantaeth Safonau Bwyd (ASB) eleni yn cael ei gynnal ddydd Mercher nesaf (10 Rhagfyr) yn Neuadd Fictoria, Reading. Dyma eich cyfle i glywed yn uniongyrchol sut rydym yn mynd i’r afael â’r materion sy’n effeithio ar eich bwyd."
        },
        {
            "text": "Byddwn yn trafod amrywiaeth o bynciau, gan gynnwys Labelu Alergenau Rhagofalus (PAL) – mater pwysig i fwy na dwy filiwn o bobl yn y DU sydd â gorsensitifrwydd i fwyd. Byddwn yn canolbwyntio ar safbwynt y DU mewn perthynas â chynigion rhyngwladol newydd ar gyfer safon fyd-eang ar gyfer PAL. Bydd y Bwrdd yn adolygu tystiolaeth gan fusnesau ac elusennau alergenau ac yn penderfynu a ddylid cefnogi cyflwyno trothwy newydd ar gyfer alergenau. Mae’r newid hwn yn ceisio gwneud pethau’n fwy eglur a chyson i bobl sydd â gorsensitifrwydd i fwyd, wrth gydbwyso diogelwch, ymarferoldeb a dewis bwyd."
        },
        {
            "text": "Bydd cefnogaeth yn y dyfodol i ladd-dai llai hefyd yn cael ei thrafod. Bydd y Bwrdd yn ystyried cynigion ar gyfer dull diwygiedig mewn perthynas â’r gostyngiadau rydym yn eu rhoi i rai busnesau ar gyfer ein taliadau am arolygu cig. Y nod yw creu system decach a mwy tryloyw er mwyn cefnogi lladd-dai llai, gan chwarae rhan allweddol wrth gynnal amrywiaeth mewn ffermio a rhoi mwy o ddewis i ddefnyddwyr. Bydd y drafodaeth yn ymdrin â’r model cymorth diwygiedig a chynlluniau ar gyfer ymgynghoriad cyhoeddus ar y newidiadau hyn."
        },
        {
            "text": "Hefyd, y mis hwn, rydym yn annog y cyhoedd i wirio sgoriau hylendid bwyd cyn penderfynu ble i fwyta dros gyfnod y Nadolig. Mae ein Cynllun Sgorio Hylendid Bwyd bellach yn dathlu ei ben-blwydd yn 15 oed, ac mae’n cwmpasu mwy na 430,000 o fusnesau. Gallwch wirio sgoriau ar ein gwefan. Mae hyn yn rhan o’n hymgyrch diogelwch bwyd ehangach dros y Nadolig sydd wedi’i anelu at ddefnyddwyr a busnesau bwyd. Mae cyngor coginio ac awgrymiadau ar sicrhau hylendid bwyd dros y Nadolig ar ein gwefan, a chofiwch gadw llygad am fwy o’n negeseuon Nadoligaidd ar ein sianeli cyfryngau cymdeithasol."
        },
        {
            "text": "Os oes gennych ddiddordeb mewn gwylio cyfarfod y Bwrdd ar 10 Rhagfyr, gallwch ei wylio’n fyw ar-lein – cofrestrwch nawr i ymuno â ni’n rhithwir."
        }
    ]
}