{
    "url": "https://planninginspectorate.blog.gov.uk/2025/12/05/making-the-planning-inspectorate-a-great-place-to-work/",
    "title": "Making the Planning Inspectorate a great place to work",
    "authors": [
        "Hayley Kelly"
    ],
    "categories": [
        "Equality Diversity and Inclusion",
        "Recruitment"
    ],
    "pub_date": "2025-12-05T12:59:31+00:00",
    "content": [
        {
            "text": "Chief People Officer Hayley Kelly talks about the inspiration she has drawn from the recent CIPD Annual Conference and Exhibition and her pride in helping make PINS a great place to work."
        },
        {
            "text": "Attending the CIPD (Chartered Institute of Personnel and Development) Annual Conference and Exhibition (ACE) is always a highlight of my professional calendar."
        },
        {
            "text": "It's more than just a series of sessions – it's an opportunity to step away from the day-to-day, recharge, and immerse myself in fresh thinking.  At ACE 2025 I connected with colleagues of old, alongside meeting new and inspiring HR professionals; I certainly left with my battery charged and have shared much of my learning with my fellow HR professionals in the Planning Inspectorate – or PINS as we call ourselves."
        },
        {
            "text": "A particular highlight for me was hearing Professor Kevin Fong share his lessons on teamwork and decision-making under pressure. His advice on leadership resonated deeply – “Most people can do most things. Your job is to make people do it better than they believe they can.”  I also left with one of the CIPD’s theme’s – Together we can make work work for all – circling my mind. There are so many examples of ‘together’ in the Inspectorate with our senior leaders, trade unions, employee networks, and so many colleagues across the organisation working together to make the Planning Inspectorate great."
        },
        {
            "text": "Events like this remind me why continuous learning and connection matter and that we should all lead with curiosity, creativity, courage, and care. They also remind me of the great things we already have to offer our colleagues here in the Planning Inspectorate."
        },
        {
            "heading": 3,
            "text": "Our offer"
        },
        {
            "text": "We're very proud that the Inspectorate’s work is at the heart of the government’s Plan for Change with its aims to build 1.5 million homes​ and make 150 infrastructure decisions​ in this parliamentary term.  We have so many dedicated colleagues across the organisation, working hard and enabling us to step up to this challenge, and we continue to seek new talented people to meet the demands.​"
        },
        {
            "text": "Last year we launched our Strategic People Plan setting out our ambitions to make the Planning Inspectorate ‘an even better place to work.’  The views of our colleagues were crucial to that plan which ultimately sets the course to ensure that working for the Inspectorate means:"
        },
        {
            "text": " Our recent recruitment activities have shown that we are attracting incredibly talented people, and they have been warmly welcomed across the organisation."
        },
        {
            "heading": 3,
            "text": "A warm welcome"
        },
        {
            "text": "Our new Welcome Day events have been one of highlights of my year. Built on the foundations of ‘The PINS Way’ which sets out clearly the values and behaviours that we hold dear, the events are an opportunity for new colleagues to come together to be curious about the whole organisation, form connections with fellow new joiners, all guided by the expertise of longer serving colleagues, kindly offering their time to share their friendship and knowledge."
        },
        {
            "text": "Here's just a small example of their feedback."
        },
        {
            "text": "‘I’ve never seen this happen anywhere else before and think it was a brilliant and well organised event.’ "
        },
        {
            "text": "‘Was great to meet the Executive Team and hear directly from them – and I think really useful for those that have come from outside the Civil Service.’ "
        },
        {
            "text": "‘I appreciated the opportunity to talk to a wide range of people including other new starters, senior colleagues and members of various teams I might not otherwise interact with much.’ "
        },
        {
            "text": "The Welcome Day is just one example of our culture, and ‘The PINS Way’ in action. We want to be an organisation where we challenge and support each other to be the best we can be, where we are respectful to one another both as individuals and professionals and are curious about how we can make our organisation even better. There are so many inspiring stories across the organisation of ‘The PINS Way’ in action. Living by our values and consistently demanding and demonstrating the right behaviours is crucial to our success."
        },
        {
            "heading": 3,
            "text": "Why not join us?"
        },
        {
            "text": "I'm always inspired and full of ideas after the CIPD annual conference and this year was no different. Our conversations allowed us to draw on our shared experiences and challenges and see how we can use them to help make our respective organisations even better places to work."
        },
        {
            "text": "Please have a look in greater detail about a career at the Planning Inspectorate and I look forward to seeing you at one of our welcome days soon."
        },
        {
            "text": "PINS – Hub | Civil Service Careers"
        }
    ]
}