{
    "url": "https://marinedevelopments.blog.gov.uk/2025/12/05/new-guidance-published-the-consenting-lifecycle-of-marine-geological-co%e2%82%82-stores-2/",
    "title": "Strategic Planning – there’s a lot of it about!",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-12-05T10:47:34+00:00",
    "content": [
        {
            "text": "Compared to the process that produced marine plans published in 2021, let alone the preparation of the first marine plan (for the East) in 2014, there are now other strategic and spatial planning initiatives and projects in play. Notable examples include the Defra-led cross-government Marine Spatial Prioritisation programme (MSPri), the Strategic Spatial Energy Plan (SSEP) commissioned by UK, Scottish and Welsh governments and led on by National Energy System Operator, and The Crown Estate’s Marine Delivery Route map (MDR).  All of these are relevant to statutory marine planning and vice versa. In the interests of avoiding duplication and optimising synergies, the MMO is closely involved in the different initiatives. Here, we highlight just a couple of examples."
        },
        {
            "text": "Marine Delivery Routemap: the MMO joined a panel at a large cross-sectoral stakeholder event in October for the emerging Routemap initiative, to discuss “Navigating the Future - Collaboration in a Sea of Complexity”. This provided an opportunity to talk about the MMO’s role in ensuring an integrated approach to marine management. The MMO also sits on the relatively new Steering group for the Routemap.  Whilst we and The Crown Estate have different roles, it is in the interests of government, stakeholders and ‘UK PLC’ to work together where it makes sense. Another example is considering together how to enable an efficient, as well as effective, process for progressing sustainable offshore wind projects from inception to operation across stages such as planning, leasing, and consenting. In support of effective collaboration, the MMO and The Crown Estate are in the process of updating their joint ‘Statement of Intent: Ways of Working’ document."
        },
        {
            "text": "The MMO Marine Planning team and Strategic Renewables Unit are also engaging in the development of the Strategic Spatial Energy Plan (SSEP). We are engaging in relevant working groups, in discussions with the National Energy System Operator (NESO) regarding the join up with English marine planning, and sharing data with them from MMO evidence projects to inform the SSEP. These discussions have supported with the development of the methodology, scenarios, defining the ‘marine zones’ the SSEP will use, and the assurance methodology for spatial evaluation. This close working will enable join up across marine planning and the SSEP, so that they can both work together to deliver the plans’ objectives and the government’s goals."
        }
    ]
}