{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/12/05/spotlight-on-our-2025-gse-award-winners/",
    "title": "Spotlight on our 2025 GSE Award winners! ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Profession Updates"
    ],
    "pub_date": "2025-12-05T14:34:20+00:00",
    "content": [
        {
            "text": "The Government Science and Engineering (GSE) Profession recently celebrated the second annual GSE Awards on 20 November recognising the outstanding achievements and contributions of individuals and teams across the profession. Organised by a dedicated group of volunteers from various departments, with support from the GSE Profession team and valuable input from the wider GSE community, the awards highlight the impact of science and engineering in public service. "
        },
        {
            "text": "This year, eight prestigious awards were presented by Professor Dame Angela McLean the Government Chief Scientific Adviser, each shining a spotlight on excellence, collaboration, leadership, and innovation within the GSE Profession. We are delighted to introduce and congratulate this year’s exceptional winners, whose work continues to advance science and engineering in government. "
        },
        {
            "heading": 3,
            "text": "GSE Award winners "
        },
        {
            "heading": 6,
            "text": "Use of Science & Engineering Award "
        },
        {
            "text": "Emily Cheek – UKHSA Environmental Hazards and Emergencies Department "
        },
        {
            "text": "This award recognises those who use science or engineering in their day-to-day role for the benefit of others.    "
        },
        {
            "text": "Emily Cheek provided outstanding scientific expertise and public health advice during a major incident in Bramley, Surrey, where a petrol leak contaminated drinking water for over 600 properties. Emily’s rapid, informed response included regular briefings to stakeholders, dynamic risk assessments, and clear communication with the local community. She supported the NHS with advice for managing health concerns and worked proactively across organisations to protect public health. Emily’s ability to interpret complex science for diverse audiences and her dedication to public service make her a true asset to the civil service. "
        },
        {
            "text": "Collaboration in Science and Engineering Award "
        },
        {
            "text": "NHS AI Lab Team – National Health Service England, Department of Health and Social Care "
        },
        {
            "text": "This award recognises collaboration on specific pieces of work or projects for the benefit of furthering science and engineering.   "
        },
        {
            "text": "The NHS AI Lab Team united government, NHS bodies, academics, regulators, and suppliers to accelerate ethical AI adoption in health and care. Amidst COVID-19 and organisational change, they delivered a national programme that tested technologies, shaped policy, and fostered collaboration. Their workstreams, including the AI Awards and Ethics, supported over 86 AI project, built a knowledge hub which has over 7000 members and encouraged public involvement and dialogue. Their efforts positioned the UK as a global leader in health AI, delivering measurable benefits and inspiring future innovation. "
        },
        {
            "text": "Diversity and Inclusion in Science and Engineering Award "
        },
        {
            "text": "Philip Lawrence – Intellectual Property Office "
        },
        {
            "text": "This award is for those who have supported, promoted or inspired diversity and inclusion in their organisation or within science and engineering in the wider public.  "
        },
        {
            "text": "Phillip Lawrence championed women in Science, Technology, Engineering, and Mathematics (STEM) by organising the “Extreme Women in STEM” webinar series, highlighting diverse female role models in challenging roles. He managed logistics, speaker outreach, and promotion, attracting over 1,400 attendees. The series featured inspiring stories from women working in extreme environments, fostering inclusion and encouraging others to work in STEM. The event received positive feedback for its insight, engagement, and positive impact, with a commitment to diversity and inspiring everyone in the GSE community. "
        },
        {
            "text": "The GCSA GSE Ambassador Award "
        },
        {
            "text": "Laura Dod – Home Office "
        },
        {
            "text": "This award is for the GSE member who goes above and beyond for the profession.  "
        },
        {
            "text": "Laura Dod identified the need for better integration of science and innovation in the Home Office’s Homeland Security Group. She created and led the Research, Development and Innovation (RDI) Champion Network, building it from scratch to empower teams to engage with science and technology. Laura secured senior support, developed engagement models, and provided training, embedding the network into strategic planning. Her leadership has laid the foundation for a culture of innovation, improving decision-making and enabling science-led solutions across the organisation. "
        },
        {
            "text": "Science and Engineering Leadership Award "
        },
        {
            "text": "Melanie Jans-Singh – Department for Energy Security and Net Zero "
        },
        {
            "text": "This award acknowledges the great leadership skills our profession requires, and someone who has supported and inspired colleagues to grow.   "
        },
        {
            "text": "Melanie Jans-Singh addressed gaps in policy on construction emissions by bringing together stakeholders across government, academia, and international bodies. Through passionate leadership and clear communication, she established initiatives and working groups, upskilled colleagues, and ensured accountability. Melanie’s efforts led to the inclusion of construction emissions in the Warm Homes Plan and the creation of impactful domestic and international initiatives. Her ability to motivate teams and drive change has been widely praised. "
        },
        {
            "text": "Rising Star in Science and Engineering Award "
        },
        {
            "text": "Hannah Hayes – Department for Environmental and Rural Affairs "
        },
        {
            "text": "This award celebrates the rising stars of the GSE Profession – those early in their careers who are already making a meaningful impact.  "
        },
        {
            "text": "Since joining the Floods Research team, Hannah Hayes has delivered high-impact research on property flood resilience and led evidence synthesis for policy support. She demonstrated leadership by designing and delivering projects, leading cross-cutting programmes, and creatively engaging colleagues through workshops and innovative communication. Hannah’s contributions have benefited both her immediate team and the wider directorate, marking her as a future science leader. "
        },
        {
            "text": "The Infinity Award"
        },
        {
            "text": "Abigail Garner – Department for Business and Trade "
        },
        {
            "text": "The Infinity Award aims to recognise the breadth of roles represented by the members of the GSE Profession. It would be impossible to capture all the profession’s achievements in just a few categories, so this is an open category. "
        },
        {
            "text": "Abigail Garner tackled a critical skills gap in Legal Metrology at the Office for Product Safety and Standards by developing a three-year apprenticeship with the National Physical Laboratory. Her collaborative approach aligned business needs with long-term workforce planning, transforming technical recruitment and safeguarding expertise. Abigail’s leadership has ensured resilience in operational functions and created opportunities for future technical leaders, setting a benchmark for strategic workforce development. "
        },
        {
            "text": "The Innovation Award"
        },
        {
            "text": "Dr Chloe Park – Department of Health and Social Care "
        },
        {
            "text": "This award recognises those who utilise and embed innovation within their ways of working in the public sector.  "
        },
        {
            "text": "Dr Chloe Park was pivotal in developing the AI Research Screening Platform (AIR-SP), addressing barriers to AI adoption in the NHS. By collaborating across organisations, Chloe secured funding and delivered a platform that accelerates AI study setup, reduces costs, and enables multiple research projects. AIR-SP positions the UK as a leader in AI health research, supporting evidence-based adoption and advancing national AI ambitions. "
        },
        {
            "text": "Further information "
        },
        {
            "text": "Sign up to become a GSE member.  "
        },
        {
            "text": "For any questions about the GSE Profession please email us at GSE@go-science.gov.uk  "
        }
    ]
}