{
    "url": "https://defrafarming.blog.gov.uk/2023/04/19/apply-for-a-water-management-grant/",
    "title": "Apply for a Water Management grant",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-04-19T11:27:36+01:00",
    "content": [
        {
            "text": "You can now apply for a Water Management grant. "
        },
        {
            "text": "Earlier this month, we published the manual for the Water Management grant on GOV.UK. We wanted to give people time to plan and consider their options before opening the application window. The guidance in the manual explains what the Water Management grant is for, who is eligible and the application process. "
        },
        {
            "text": "I'm pleased to say that, from today, you can apply."
        },
        {
            "text": " In this post, I'll give a recap of the grant and the links you'll need to get started."
        },
        {
            "text": "We’re hosting a webinar tomorrow for you to find out more and for you to put your questions to us. I'll add the link for you to register at the end of the post. "
        },
        {
            "heading": 2,
            "text": "Quick recap "
        },
        {
            "text": "Part of the Farming Investment Fund, the Water Management grant is open to horticultural and arable businesses growing, or intending to grow, irrigated food crops, ornamentals, or forestry nurseries."
        },
        {
            "text": "This is the second time we've offered the grant. The first round opened in November 2021. "
        },
        {
            "text": "The minimum grant is £35,000, with a maximum grant available of £500,000 per applicant per funding round.  "
        },
        {
            "text": "The grant is designed to help improve farm productivity through more efficient use of water for irrigation, by adopting best practice irrigation application equipment and to secure water supplies through construction of on-farm reservoirs.  "
        },
        {
            "heading": 2,
            "text": "How to apply "
        },
        {
            "text": "If you haven't already, take a look at the manual for the Water Management grant on GOV.UK."
        },
        {
            "text": "As with the first round, there is a 2-step application process for this round.   "
        },
        {
            "heading": 3,
            "text": "1. Online checker"
        },
        {
            "text": "The process starts with an online eligibility checker.  "
        },
        {
            "text": "The checker is designed to determine your eligibility and whether your project fits the funding priorities. This is one of the changes we’ve made in response to feedback. "
        },
        {
            "text": "You will be asked various questions, including the water sources you will use to fill your new reservoir and the types of crops you will grow and irrigate as a result of the project. "
        },
        {
            "text": "It will take roughly 20 minutes to complete and you will learn the outcome instantly.  "
        },
        {
            "text": "Depending on the outcome of the checker, you will be invited to make a full application. "
        },
        {
            "text": "The checker is now live, and it will remain open for 12 weeks. "
        },
        {
            "text": "This means the deadline to use the checker is 12 July 2023. "
        },
        {
            "heading": 3,
            "text": "2. Full application "
        },
        {
            "text": "Those invited to make a full application will have until 31 October 2024 to do so."
        },
        {
            "text": "Before you submit your full application, you will need to secure any planning permission and abstraction licences. "
        },
        {
            "text": "This is a change from the first round. We did this to improve both the customer journey and support quicker decision making."
        },
        {
            "heading": 2,
            "text": "Join our webinar "
        },
        {
            "text": "As I mentioned, tomorrow we're hosting a webinar for you to learn more about the Water Management grant. You’ll be able to put your questions to the team. "
        },
        {
            "text": "Sign up to attend the online webinar tomorrow, Thursday 20 April. "
        },
        {
            "text": "It will begin at 2.30pm and finish at 3.45pm. "
        },
        {
            "text": "The webinar will be recorded, so if you can’t make it, visit this post again later. We'll post a link to the video here soon. "
        }
    ]
}