{
    "url": "https://healthmedia.blog.gov.uk/2023/04/19/covid-spring-booster-2023-everything-you-need-to-know/",
    "title": "Covid spring booster 2023: Everything you need to know",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "Public Health"
    ],
    "pub_date": "2023-04-19T11:29:29+01:00",
    "content": [
        {
            "text": "Five million eligible people, including over 75s and those aged five and over with a weakened immune system, are now able to book their spring Covid vaccine booster."
        },
        {
            "text": "Here’s everything you need to know about the rollout."
        },
        {
            "heading": 2,
            "text": "Am I eligible for a spring Covid booster?"
        },
        {
            "text": "People being offered a spring Covid vaccine booster include:"
        },
        {
            "text": "This is because Covid can be more serious in older people and in people with certain underlying health conditions."
        },
        {
            "heading": 2,
            "text": "When is the booster available and how do I book an appointment?"
        },
        {
            "text": "We are already offering appointments to eligible people."
        },
        {
            "text": "Invitations are being issued through the NHS App, where you can book an appointment."
        },
        {
            "text": "Text messages, emails and letters are being sent to those without the app or not actively using it, including details of how to book an appointment."
        },
        {
            "text": "You can also book a Covid booster appointment online now."
        },
        {
            "heading": 2,
            "text": "Which vaccine will I receive?"
        },
        {
            "text": "You will be given a booster dose of a vaccine made by Pfizer, Moderna or Sanofi and approved in the UK."
        },
        {
            "text": "These vaccines have been updated since the original vaccines and target different Covid variants."
        },
        {
            "text": "A small number of people may be advised by their doctor to get another vaccine product."
        },
        {
            "text": "The updated vaccines boost protection well and give slightly higher levels of antibodies against the more recent strains of Covid, such as Omicron, than the original vaccines."
        },
        {
            "text": "All vaccines being used in the UK have undergone robust clinical trials and have met the Medicines and Healthcare products Regulatory Agency’s (MHRA) strict standards of safety, effectiveness and quality."
        },
        {
            "text": " "
        }
    ]
}