{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/04/19/gse-leadership-values-decisive/",
    "title": "GSE Leadership Values: Decisive",
    "authors": [
        "Dr Jane Williams"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Talent & Leadership"
    ],
    "pub_date": "2023-04-19T16:35:47+01:00",
    "content": [
        {
            "text": "As a scientist whose career has primarily been to lead innovative activities in academia, industry and government, where there is often a multitude of alternative directions you could take, being decisive and taking a course of action has been critical to progress.  "
        },
        {
            "text": "Decisions come in all shapes and sizes; some are more tactical and others more strategic. My leadership decisions have ranged widely, including: "
        },
        {
            "text": "I have identified some common themes that I have found important to being a decisive leader. Firstly, being focused on your desired leadership outcome when making decisions i.e. considering how your decisions will get you closer to your goal. Secondly, understanding the time window in which your decision can have impact i.e. a perfect decision made too late for impact is not good. Thirdly, weighing up the evidence and testing your decision i.e. welcoming challenge from others to inform your decision. Fourthly, learning from your decision i.e. with hindsight not every decision will be right but learning from bad decisions will help you to progress.  "
        },
        {
            "text": "In 2020, with a background in medical research, I volunteered to support the COVID-19 response where I set up and led multidisciplinary teams, that delivered advice to Ministers. This advice was required on a daily basis over a long period of time, often with little notice, to inform the domestic interventions that would reduce the impact of the rapidly evolving pandemic. Remaining calm and considered under this pressure, while making rapid but informed decisions on prioritisation and direction, was essential to ensure that my teams were as well prepared as possible to give advice at any point in time without burning out.  "
        },
        {
            "text": "Given globally we were still learning about the new SARS-CoV-2 virus and how it spread, the information available to underpin our advice was incomplete, captured in many different formats (qualitative and quantitative) and from multiple national and international sources. To allow us to have impact immediately, I was clear that we should develop simple analytical methodologies using the information available and build from there. I ring-fenced resources to focus on continuously improving these methodologies, to incorporate additional data, information, and analysis as it became available. I also ensured that we had the right external partnerships with government, industry, academia and internationally to ensure we were capturing diversity of thought and wider context, sharing best practice, and encouraging challenge. Through this decisive approach I was able to lead my teams to evolve mature and published methodologies, incorporating multiple data/information sources, endorsed by experts including UK Chief Medical Officers. These methodologies allowed me to provide impartial evidence-based advice to Ministers which stood up to challenge and wider political views.  "
        },
        {
            "text": "As I hope this example has shown, there is more to being a decisive leader than just making decisions. To make good decisions it is essential to combine being decisive with the wider leadership values of integrity, collaboration and inclusiveness. "
        },
        {
            "text": "Dr Jane Williams "
        },
        {
            "text": "Deputy Director / Head of National Security Technology and Innovation Exchange (NSTIx) "
        },
        {
            "text": "Related Link "
        },
        {
            "text": "GSE Leadership Values "
        }
    ]
}