{
    "url": "https://marinescience.blog.gov.uk/2023/04/19/how-can-uk-fisheries-achieve-net-zero-by-2050/",
    "title": "How can UK fisheries move towards Net Zero by 2050?",
    "authors": [
        "Georg Engelhard"
    ],
    "categories": [
        "adaptation",
        "Climate Change",
        "Fisheries",
        "Policy",
        "Science",
        "Technology"
    ],
    "pub_date": "2023-04-19T11:16:46+01:00",
    "content": [
        {
            "text": "How can UK fisheries achieve Net Zero by 2050?"
        },
        {
            "text": "With the Fifth Symposium on the Effects of Climate Change on the World’s Oceans (ECCWO5) underway this week in Norway, Cefas Scientist, Georg Engelhard tells us about his new report looking at the impact of the UK fishing industry on climate change and how technological, operational and policy changes are key to driving progress towards the UK Government’s Net Zero target."
        },
        {
            "text": "It is now abundantly clear that, as a society, we need to reduce our greenhouse gas emissions if we are to tackle climate change. So, it was widely welcomed when the UK Government announced its commitment to reaching Net Zero by the year 2050. But how to get from where we are now, to where we would strive to be to achieve these ambitious targets?"
        },
        {
            "text": "For the UK fishing fleet, you could argue that this is a particularly challenging question. This is because fishing vessels typically use fossil fuels for propulsion, and for many other activities."
        },
        {
            "text": "In our new report 'Carbon emissions in UK fisheries: recent trends, current levels, and pathways to Net Zero’, we found that total emissions by the UK fishing fleet are still substantial, estimated as 702 kt carbon dioxide-equivalent in 2020 (about 0.7% of UK domestic transport emissions, or very approximately 1.2 kg of emissions per kg of fish landed). However there has been progress, with significant reductions in total emission levels by the UK fleet of about 32% over a period of 15 years. Over the same period, total fisheries landings showed some fluctuations but generally remained stable."
        },
        {
            "text": "So the key question recognised by the Department for Environment, Food and Rural Affairs (Defra) is – How can UK fishing fleets move towards Net Zero by 2050? –. Achieving the aim of reducing emissions to Net Zero carbon is likely to require major changes to the way that UK fisheries operate. Important changes in technology and management practices will be needed; some of these will be achievable in the short term but others will require mid to long term solutions."
        },
        {
            "text": "Towards Net Zero Carbon Fisheries"
        },
        {
            "text": "In 2021, Georg Engelhard, Olivia Harrod and John Pinnegar of the Cefas Climate Change Team started work on a  new Defra funded project, titled Towards Net Zero Carbon Fisheries, that was designed to specifically address this challenging question."
        },
        {
            "text": "The team looked at both present and past trends in carbon emissions released by UK fishing fleets. Based on desk-based studies and interviews with many participants in the fishing industry, they also provided a forward look: proposing a set of potential pathways to aid reducing emissions from fisheries in future years."
        },
        {
            "text": "This week, the findings will be presented at the “Fifth Symposium on the Effects of Climate Change on the World’s Oceans (ECCWO5) – one of the world’s most important conferences on marine climate change. Scientists, policy makers and NGOs from around the world will come together to discuss some of the most pressing problems facing our oceans. This year, there is greater emphasis on reducing emissions and climate change mitigation as many look towards how we can achieve Net Zero by the year 2050."
        },
        {
            "text": "A pathway to progress"
        },
        {
            "text": "While recent trends in emission reductions do indicate that significant progress can be achieved, major changes will still be needed to fully reach Net Zero. The report provides several recommendations or a ‘roadmap’ of pathways for reducing emissions in fisheries. These include:"
        },
        {
            "text": "The report highlights the importance of the ‘Participatory approach’ to ensure that policy outcomes are developed in partnership between industry, science, and policy. The report has benefited from extensive engagement with industry where fisheries representatives shared their knowledge and provided examples of the existing initiatives and challenges in using new technologies. For example, the Thanet Fishermen's Association in Kent are operating a subsidiary fuel company, offering marine biodiesel (made from reused cooking oil) to their members, and in the southwest, a skipper has been trailing a lighter, more efficient wing trawl system (known as a ‘Sumwing beam trawl’) to help reduce fuel consumption."
        },
        {
            "text": "“Our findings and messages, and the roadmap of adaptive pathways are not only relevant for the UK fishing fleet – they are equally important to fisheries and fleets around the world. It is only through close collaboration with all stakeholders involved, that we can successfully achieve carbon neutrality, whilst also maintaining sustainability and prosperity in the fishing fleet,” said lead scientist, Georg Engelhard."
        },
        {
            "text": "The findings were presented to the Seafish Fisheries Management and Innovation Group, which is a regular meeting of stakeholders to discuss key challenges facing the UK fishing industry."
        }
    ]
}