{
    "url": "https://ipo.blog.gov.uk/2023/04/19/world-ip-day-2023-improving-the-representation-of-women-in-ip/",
    "title": "World IP Day 2023: Improving the representation of women in IP",
    "authors": [
        "Nicola Smith"
    ],
    "categories": [
        "Inclusion and diversity",
        "International",
        "IPO",
        "STEM career"
    ],
    "pub_date": "2023-04-19T10:30:58+01:00",
    "content": [
        {
            "text": "The role of the IPO is to make life better through IP.  But to fully unleash the potential of innovators and creators, the IP framework must work effectively for everyone engaging with it.  "
        },
        {
            "text": "   "
        },
        {
            "text": "On 26 April 2023, we are joining WIPO to celebrate the women in IP and their role in accelerating innovation and creativity for World IP Day. The IPO is also part of an international taskforce set up by the USPTO to improve the representation of women in IP. The taskforce includes representatives from over 25 IP offices, with the shared ambition of diversifying IP by sharing best practice.  "
        },
        {
            "text": "Put simply, inclusivity matters. We are working hard to promote diversity and inclusion in STEM – and by extension IP - where women remain under-represented. The IPO is seeking to lead by example.  Not only is that the right thing to do as an organisation, but the right thing for the customers we are here to serve.  "
        },
        {
            "text": "In March, I was invited to meet taskforce colleagues at a conference at The United States Patent and Trademark Office (USPTO) headquarters in Virginia, USA. This gave me the opportunity to learn, network and share ideas with colleagues from across the world.   "
        },
        {
            "text": "At the conference we covered three main issues:   "
        },
        {
            "text": "The power of affinity networks  "
        },
        {
            "text": "Affinity networks are crucial to creating  an environment where everyone feels supported, included and valued.  At the IPO, they are the link between our people and our inclusive culture and policies.  "
        },
        {
            "text": "The taskforce heard from the affinity networks that serve the 13,000 people working for the USPTO.  Discussing these affinity networks’ achievements and challenges helped smaller IP offices understand how to turn the USPTO’s ideas into realistic solutions.   "
        },
        {
            "heading": 4,
            "text": "Understanding the data"
        },
        {
            "text": "The USPTO, US Copyright Office, CIPO and WIPO presented on how they use data to understand their customers. This allows these offices to better reach under-represented groups through targeted campaigns.   "
        },
        {
            "text": "IP offices across the taskforce wanted to find the right balance between capturing data to understand customers and ensuring the application process remains straightforward. Continued consultation with experts provides the means to share best practice and get this right.   "
        },
        {
            "text": "International mentoring  "
        },
        {
            "text": "The taskforce defined goals and principles for an international mentoring scheme to support our people. Together, we workshopped ideas and committed to taking this work forward.  "
        },
        {
            "text": "I left feeling inspired by the stories shared and the passion displayed by each IP office and I look forward to future opportunities for such international collaboration.   "
        },
        {
            "text": "Closer to home, the IPO is already taking concrete steps to promote diversity within IP. We have played an active role in IP Inclusive since its inception, worked to embed IP into curriculums, invested in IT development opportunities through Code First Girls, and supported those wanting to return to work through our STEM Returners Programme.   "
        },
        {
            "text": "The shared, global ambition to support female innovators and creators is instrumental in building new practices to improve the representation of women. As a woman in IP, I feel privileged to be able to contribute towards creating an environment where women in IP can thrive. "
        }
    ]
}