{
    "url": "https://forestrycommission.blog.gov.uk/2022/04/20/better-biosecurity-for-nurseries-and-our-future-woodlands/",
    "title": "Better biosecurity for nurseries and our future woodlands",
    "authors": [
        "Joe Harrison"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2022-04-20T08:50:30+01:00",
    "content": [
        {
            "text": "From June 2022 the new initiative will ensure that plant health management standards are in place for nurseries supplying trees for the England Woodland Creation Offer and Tree Health Pilot restocking grants."
        },
        {
            "heading": 2,
            "text": "Why does tree health and better biosecurity matter?"
        },
        {
            "text": "Did you know that the value of all the economic, environmental, and social benefits that our plants and trees provide each year in the UK is estimated at £15.7 billion? Healthy plants and trees benefit us all, which is why it is so important that we work together to look after our trees, woodlands, and forests."
        },
        {
            "text": "Biosecurity refers to the precautions we can take that help to prevent the introduction and spread of harmful organisms. For plants and trees, these can include non-native pests, such as insects, and disease-causing organisms called pathogens, such as some viruses, bacteria and fungi. The impact these pose is enormous. Ash dieback alone is predicted to kill anywhere up to 100 million trees, costing the economy up to £15bn over the coming decades."
        },
        {
            "text": "Although these tree pests and diseases can spread naturally, one of the major risk pathways is through trade, which has increased significantly through globalisation of trade and travel over the last few decades."
        },
        {
            "text": "People often suggest that simply banning imports would be the best solution to help protect our plants and trees. However, many pests and pathogens can enter the country by other means including people bringing plants back from abroad, while some pests and pathogens arrive here on the wind. Consumer demand for choice, food security and environmental resilience to climate change are other reasons why a simple ban wouldn’t be practical and demonstrate why we need to get the balance right."
        },
        {
            "heading": 2,
            "text": "Why does all of this this matter right now?"
        },
        {
            "text": "As part of the England Trees Action Plan, government aims to increase tree cover in England to 12% by 2050. This means trebling tree planting rates by the end of this Parliament and planting 30,000 hectares of trees across the UK per year by 2025. To help achieve these targets the Forestry Commission launched the England Woodland Creation Offer (EWCO) last year, with £15.9 million available to landowners to plant and manage trees in the first year alone."
        },
        {
            "text": "With this significant increase in funding available for tree planting, the demand for biosecure trees from UK suppliers is expected to rise dramatically over the coming years. Planting and establishing more domestically grown trees will play an important role in this, meaning now more than ever there is a need to ensure we continue to lead and improve our world class biosecurity standards."
        },
        {
            "heading": 2,
            "text": "How is the UK leading the charge in better plant biosecurity?"
        },
        {
            "text": "A few years ago, the UK horticulture and forestry sectors led the development of the Plant Health Management Standard in response to the threat posed by an organism called Xylella. Xylella can affect a huge range of plants and trees, including several species of broadleaved trees grown in the UK, such as oak and elm. Xylella has devastated olive groves in Puglia, Italy, although it hasn’t reached the UK yet."
        },
        {
            "text": "The Plant Health Management Standard sets out a number of practical requirements for businesses to help protect the plant supply chain. The standard is regarded as the benchmark biosecurity standard and forms the basis of the Plant Healthy Certification Scheme."
        },
        {
            "text": "Plant Healthy is a voluntary initiative designed to drive up biosecurity standards across the ornamental horticulture, forestry and amenity plant and tree supply chains, regardless of whether they import stock, source, and grow only in the UK, or both. To date, 14 major UK nurseries are fully certified and there are several more in the pipeline."
        },
        {
            "heading": 2,
            "text": "What is the Biosecure Procurement Pilot?"
        },
        {
            "text": "Also included in the England Trees Action Plan is our commitment to introduce a new biosecure procurement criterion for suppliers of plants and trees to government contracts. As we talked about above, this is because we know strong biosecurity relies on everyone playing their part and being committed to ensuring that plants and trees are always sourced from reputable suppliers with high biosecurity standards."
        },
        {
            "text": "From June 2022, Defra and the Forestry Commission will introduce a 12-month pilot to test a new biosecure procurement requirement as part of the England Woodland Creation Offer and the Tree Health Pilot grant schemes. This means suppliers will need to demonstrate that they can meet the biosecurity requirements set out within Plant Health Management Standard."
        },
        {
            "heading": 2,
            "text": "What will suppliers of trees need to do from June 2022 onward?"
        },
        {
            "text": "For suppliers providing trees as part of a EWCO or Tree Health Pilot grant, they will need to provide one of two types of evidence:"
        },
        {
            "text": "Nurseries who are already a member of the Plant Healthy Certification Scheme, don’t need to do anything. Nurseries who aren’t members of the Plant Healthy Certification Scheme will either need to apply to the scheme, or apply to Fera Science Ltd for a Ready to Plant Assessment for the stock they supply to each grant."
        },
        {
            "text": "The Ready to Plant Assessment is a way for businesses who are not Plant Healthy certified to demonstrate they can meet the requirements set out in the Plant Health Management Standard and also looks at the biosecurity of the stock they are supplying. The Ready to Plant Assessment only applies to the planting stock for a specific grant agreement, so suppliers will need to apply for an assessment for each grant agreement they wish to fulfil."
        },
        {
            "heading": 2,
            "text": "What do suppliers need to do to become Plant Healthy certified?"
        },
        {
            "text": "Suppliers can visit the Plant Healthy website where they will find useful information about plant health, including a self-assessment tool to help assess how 'Plant Healthy' their business is. There are pointers on how their business can improve based on the Plant Health Management Standard - a set of practical requirements for businesses to help protect the plant supply chain."
        },
        {
            "text": "Once the supplier is ready to apply they can contact one of the appointed Certification Bodies who will provide help and guidance before conducting an audit against the requirements set out in the Plant Health Management Standard."
        },
        {
            "heading": 2,
            "text": "What do suppliers need to do to obtain a Ready to Plant certification?"
        },
        {
            "text": "Suppliers must complete an application form which provides details of the consignment of trees and the biosecurity protocols suppliers have in place. The application will be evaluated by Plant Health and Biosecurity experts at Fera Science Ltd against the requirements of the Plant Health Management Standard. If successful, applicants will receive a unique Ready to Plant (RtP) reference number which can be provided to the purchaser of the trees as evidence of compliance."
        },
        {
            "text": "A risk-based selection of consignments will also receive a post-planting inspection by the Plant Health and Seeds Inspectorate, to ensure the plants are pest and disease free."
        },
        {
            "text": "More information can be found on the Ready to Plant website."
        },
        {
            "heading": 2,
            "text": "What does this mean for land managers planting trees?"
        },
        {
            "text": "To be eligible for a EWCO or Tree Health Pilot restocking grant, for all applications received from June 2022, land managers will need to obtain their trees from suppliers who are either Plant Healthy certified or have a valid Ready to Plant Assessment for the stock they have ordered and can provide them with this evidence at the point in which they supply the trees. Land managers will then be asked to provide this evidence at point of grant claim."
        },
        {
            "text": "Even if land managers aren’t purchasing trees as part of a EWCO or Tree Health Pilot grant, then from June 2022 onwards, as more suppliers will meet the biosecurity requirements set out within the Plant Health Management Standard, land managers can have increased confidence that trees sourced from UK suppliers are better protected against pests and disease, and that they are also helping to protect existing trees and the wider environment for future generations."
        }
    ]
}