{
    "url": "https://educationhub.blog.gov.uk/2022/04/how-weve-improved-choices-for-young-people-when-they-leave-school/",
    "title": "How we’ve improved choices for young people when they leave school",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Further education",
        "Higher Education",
        "Schools",
        "Universities"
    ],
    "pub_date": "2022-04-20T18:51:17+01:00",
    "content": [
        {
            "text": "We’ve long known that a one-size-fits all approach to education doesn’t work. That’s why we don’t accept that there should be a simple quota-based approach to how many people go down certain routes – like going to university for example – after they finish school."
        },
        {
            "text": "Our universities have an important role to play in our education system, but this pathway is not always in the best interests of the individual or nation. Our focus is on making sure that young people are given high quality options that allow them to flourish and gain the skills they need to get fulfilling jobs. This means that we’re not only making sure young people have options that suit them, but also that those options plug skills gaps, meet employers’ needs and ultimately lead to good jobs."
        },
        {
            "text": "Here we look at how we’re making sure that all the routes available to young people once they leave school provide them with high quality options that suit both them and their future employers."
        },
        {
            "heading": 3,
            "text": "University"
        },
        {
            "text": "University is a well-established route into employment. We have record rates of 18-year-olds getting into university, including those from disadvantaged backgrounds, but it’s important that we continue to make sure it remains useful and rewarding for those that choose that route."
        },
        {
            "text": "We’re carrying out a consultation that looks for people’s views on how to ensure young people are encouraged to pursue the right path for them, and receive a fair deal for their investment if they choose to go to university."
        },
        {
            "text": "This includes considering the introduction of minimum eligibility requirements, to ensure students aren’t being pushed into higher education before they are ready, and student number controls, so that poor-quality, low-cost courses which lead to poor outcomes for students, aren’t incentivised to grow uncontrollably."
        },
        {
            "text": "You can read more about these plans here."
        },
        {
            "text": "Alongside this we’re investing nearly £900m over the next three years to support high-quality teaching and world-class facilities in our universities, focusing on STEM, medicine, and degree apprenticeships that deliver real benefits for students and the economy."
        },
        {
            "text": "We are taking forward the biggest reforms to post-18 education in a decade, alongside introducing a more rigorous quality regime with the Office for Students. We aim to further improve graduate outcomes and continue to drive up quality to deliver the highest-quality education for students from all walks of life, equipping them with the skills to succeed and meet the needs of nation."
        },
        {
            "heading": 3,
            "text": "T Levels"
        },
        {
            "text": "T Levels – the new technical post-16 qualification equivalent to three A levels – are now available in schools and colleges across England."
        },
        {
            "text": "These pioneering qualifications offer students a mixture of classroom study and ‘on-the-job’ experience during industry placements of at least 9 weeks, so they gain the skills and knowledge they need to progress into work, further study, or an apprenticeship."
        },
        {
            "text": "With course content designed with over 250 employers including Fujitsu and Amazon, students can be sure these high-quality qualifications will set them on the path to a rewarding career."
        },
        {
            "text": "Click here to find out more about T Levels."
        },
        {
            "heading": 3,
            "text": "Traineeships"
        },
        {
            "text": "Traineeships offer a fantastic opportunity for young people aged 16-24 to develop skills on the job, splitting their time between the classroom and practical learning."
        },
        {
            "text": "These programmes last between 6 weeks and a year (although most are shorter than 6 months) and give students the chance to get a real feel for a particular profession."
        },
        {
            "text": "Whether students are considering a career in business administration, web development or the beauty industry, these programmes bridge the gap between school,  further study or work – giving them the chance to make sure this is the right career path for them, and helping them build up confidence before committing to a longer-term course, apprenticeship or job."
        },
        {
            "text": "Traineeships help young people build goals on their terms while giving employers the skilled workforce they need to succeed. Find out more here."
        },
        {
            "heading": 3,
            "text": "Apprenticeships"
        },
        {
            "text": "Apprenticeships are paid jobs, which give thousands of people the opportunity to gain the skills and on-the-job experience needed to hit the ground running in their chosen profession."
        },
        {
            "text": "There have never been so many great apprenticeship options available in a diverse range of industries, including digital, construction, nursing, fashion, teaching or film and TV. There are options to train at every level right up to degree level, offering the chance to work in some of the country’s top companies."
        },
        {
            "text": "Alongside on-the-job training, apprentices spend at least 20% of their time in off-the-job training with a training provider, such as a college or university, learning skills and building confidence for the workplace."
        },
        {
            "text": "Click here to find out more about apprenticeships."
        },
        {
            "heading": 3,
            "text": "Where can I find support and information?"
        },
        {
            "text": "For more information on the choices available to people leaving school visit these resources:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}