{
    "url": "https://ruralpayments.blog.gov.uk/2022/04/20/introducing-you-to-3/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Introducing You To",
        "Rural Payments service"
    ],
    "pub_date": "2022-04-20T12:44:46+01:00",
    "content": [
        {
            "text": "Hi, I’m Ellen and I’m a Complaints Caseworker in the Complaints Resolution team at the Rural Payments Agency (RPA). I’m based in Cumbria and joined the RPA in 2017. "
        },
        {
            "text": "My role focuses on resolving issues for customers and providing great customer service. This involves working on complaints relating to current schemes such as the Basic Payment, Environmental and Countryside Stewardship Schemes. As a caseworker, I talk to the customer or agent to understand the reasons for the complaint, and then investigate, liaising with multiple departments across RPA. I also refer to our specialist guidance, before making a recommendation based on the complaint outcome. This is discussed with my manager and, if necessary, higher management. I then inform the customer or agent of the outcome."
        },
        {
            "text": "I manage the whole process and we have a department target of 30 working days for update or resolution of complaints. Where it’s not possible to resolve to the customer or agent’s satisfaction, I’m responsible for managing expectations and, where necessary, taking it further."
        },
        {
            "text": "My work is always varied and no two complaints are the same. However, a typical day for me starts with checking emails and reviewing any case updates. I will further investigate any open cases and contact departments for any cases on-hold. Importantly, I provide updates to customers and agents via phone, email or letter."
        },
        {
            "text": "As part of my role, I provide feedback to RPA on why a case became a complaint and if, and how, it could have been prevented. It’s important to understand any lessons learnt or improvements we can make for the future to ensure the same issue doesn’t happen again. I believe continuous feedback and learning, combined with great customer service, has the greatest impact on our customers."
        },
        {
            "text": "Before joining the complaints team, I worked in BPS assisting processors with their queries. This operational experience stood me in good stead for the challenges of my current role."
        },
        {
            "text": "I live with my fiancé and cat, and outside work I regularly go swimming and enjoy going to exercise-based trampoline classes. I live close to the Lake District so of"
        },
        {
            "text": "ten visit to go for walks and stop at one of the lovely cafes. I enjoy spending time with friends and family, and love going for trips away, eating out and going to the cinema."
        },
        {
            "text": "I was proud to recently receive an RPA commendation for my work on high priority cases. It gives me great pleasure to resolve an issue for a customer and provide feedback that puts measures in place to ensure the same doesn’t happen again."
        }
    ]
}