{
    "url": "https://actuaries.blog.gov.uk/2022/04/20/should-the-uk-have-a-chief-risk-officer/",
    "title": "Should the UK have a Chief Risk Officer?",
    "authors": [
        "Colin Wilson - Deputy Government Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Risk management"
    ],
    "pub_date": "2022-04-20T12:53:05+01:00",
    "content": [
        {
            "text": "There have been several calls recently for the UK government to appoint a Chief Risk Officer (CRO)."
        },
        {
            "text": "For example, this was recommended by both the:"
        },
        {
            "text": "The pandemic has also led to suggestions the UK needs to re-examine the trade-off between shorter-term efficiency (‘just in time’) and longer-term resilience (‘just in case’). And whether the UK is sufficiently well-prepared to address ‘extreme risks’."
        },
        {
            "text": "Extreme risks are defined by the Lords Select Committee as: “High-impact events that, if they materialise, would cause widespread damage to many aspects of our society and compromise the achievement of the strategic objectives set by the Government. They can impact at global, national or regional levels and could cause significant loss of life, loss of value, or a substantial and detrimental societal impact.”"
        },
        {
            "text": "Between them the committees drew attention to the challenges represented by risks that are whole-system or cross-cutting, interconnecting or cascading, or have not been encountered before."
        },
        {
            "heading": 2,
            "text": "Government risk management"
        },
        {
            "text": "Mechanisms already exist within government for managing risk."
        },
        {
            "text": "Risks to the government’s own operations or the achievement of its policy objectives are departmental responsibilities. These are generally managed by members of the finance profession on behalf of departmental Accounting Officers. We might call these ‘internal risks’."
        },
        {
            "text": "Conversely ‘external risks’ - risks to the country - are identified by the government’s Civil Contingencies Secretariat in producing the National Risk Register (NRR) and classified National Security Risk Assessment. Lead responsibility for each risk in the NRR is allocated to an individual government department, where it will normally be addressed by policy officials."
        },
        {
            "text": "Actions are underway to review and enhance these mechanisms, partly in response to the challenges identified in the November 2021 National Audit Office report which informed the PAC. Examples include:"
        },
        {
            "heading": 2,
            "text": "The role of a CRO"
        },
        {
            "text": "Views on what a CRO would do differ."
        },
        {
            "text": "The PAC recommended someone to “consider cross-cutting risks in government and proactively manage the identification and resolution of system-wide concerns”."
        },
        {
            "text": "The Lords Select Committee recommended someone to head a new Office for Preparedness and Resilience. This office would “be responsible for producing independent analysis of UK preparedness and monitoring Government preparedness. It would produce assessments of UK resilience, set resilience standards, and conduct audits of UK preparedness.”"
        },
        {
            "text": "Although different, these perspectives have some important features in common. A CRO would not be responsible for actually managing any risks. Ultimate responsibility for managing risks would remain with Accounting Officers as at present. This is consistent with the so-called ‘3 lines of defence’ model typically used to separate out risk management, independent oversight, and assurance."
        },
        {
            "text": "A CRO would also be more concerned with ‘external risks’ facing the UK rather than ‘internal’ government risks. In this capacity they could initiate or oversee implementation of another recommendation from the Lords Select Committee, specifically that: “The Government should work with the UK insurance industry to explore mechanisms which allow for the transfer, management and mitigations of risks which are too large for the private sector to address alone and for which the Government is the insurer of last resort, but may in fact find itself the insurer of first resort.”"
        },
        {
            "heading": 2,
            "text": "Discussion"
        },
        {
            "text": "It is encouraging to see a growing conversation about national risk and resilience."
        },
        {
            "text": "A key component of this concerns the enhancement of institutional capability to recognise and manage crises. There is an important role for all sections of society in preparing for, adapting to and recovering from the effects of risk."
        },
        {
            "text": "A CRO could help to maintain attention on this vital topic.\nBut there is also a need to facilitate resolution of important political questions. Ultimately as a society we need to answer questions such as:"
        },
        {
            "text": "And these must be answered in the context of many competing spending priorities and short-term budget pressures."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        },
        {
            "text": " "
        }
    ]
}