{
    "url": "https://space.blog.gov.uk/2023/09/08/a-comet-newcomer-and-autumn-returns-the-night-sky-in-september/",
    "title": "A comet newcomer and autumn returns: the night sky in September",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-09-08T14:01:49+01:00",
    "content": [
        {
            "text": "While the summer stars and constellations remain (much like the summer weather recently!), the autumn constellations and some of the beautiful celestial objects they host are returning.  It’s a great month to see the planets Jupiter, Saturn and Venus, and there’s also a chance of spotting a newly discovered comet!"
        },
        {
            "heading": 2,
            "text": "The Autumn Equinox"
        },
        {
            "text": "Our planet is tilted in its orbit around the Sun and our seasons are determined by the extent to which our northern hemisphere is leaning more toward or away from it."
        },
        {
            "text": "On 23 September we pass the second point in the year where, in the orbit around our star, neither the north or south pole leans closer to the Sun, and the days and nights are equal in length."
        },
        {
            "text": "This point in time is called an ‘equinox’, which is derived from the Latin words ‘equi’ (equal) and ‘nox’ (night) and this month’s marks the start of ‘astronomical autumn’."
        },
        {
            "heading": 2,
            "text": "The Milky Way Galaxy"
        },
        {
            "text": "September is a great month to see the bright band of our Milky Way galaxy."
        },
        {
            "text": "From darker skies away from towns and cities, you can see it rise from its bright core in the south-westerly constellations of Sagittarius, Scorpius and Scutum, pass high overhead through the constellations of Aquila and Cygnus and arc down into the north-east though Cassiopeia, Perseus and Auriga."
        },
        {
            "text": "You can use the sky-map below and read our recent blogs to find these constellations."
        },
        {
            "heading": 2,
            "text": "The Moon and planets"
        },
        {
            "text": "This month’s full Moon falls on 29 September, and will be another super-moon, appearing slightly larger and brighter in our night skies because the fully illuminated phase coincides with the Moon being near its closest point to Earth on its slightly elliptical orbit around us."
        },
        {
            "text": "Saturn can be seen shining brightly in the southern sky throughout the night, and Jupiter rises in the east soon after dark, an unmistakably bright point of light that appears just to the right of the Pleiades star cluster."
        },
        {
            "text": "Those with binoculars or a telescope can find Uranus, sixth planet from the Sun, almost directly between Jupiter and the Pleiades this month."
        },
        {
            "text": "Early risers may spot brightest planet Venus rising in the east before dawn, where it will be joined later in the month by Mercury."
        },
        {
            "heading": 2,
            "text": "A newly discovered comet in our skies"
        },
        {
            "text": "Astronomers are tracking Comet C/2023 P1 Nishimura, named after the astronomer who discovered it just a few weeks ago, to see if it will become bright enough to see with the naked eye this month."
        },
        {
            "text": "The comet, which is believed to orbit the Sun around once every 400-500 years, will pass closest to Earth on 12 September, and will then have a close encounter with the Sun on 17 September."
        },
        {
            "text": "This can make comets flare significantly in their brightness, but the forces upon the comet from passing so close to our star could also cause it to disintegrate."
        },
        {
            "text": "It’s currently visible with binoculars, low in the north-east, just left of Venus in the hour before dawn."
        },
        {
            "text": "If it survives its passage around the Sun, it’ll reappear low in our twilight skies for a few days in the constellation of Virgo and near to the planet Mars."
        },
        {
            "heading": 2,
            "text": "Space Exploration"
        },
        {
            "text": "The Indian Space Research Organisation (ISRO) successfully landed their Chandrayaan-3 mission near the Moon’s south pole last month."
        },
        {
            "text": "The lander has since deployed a rover that has been running a series of experiments on rock samples to establish the mineral composition of the surface there."
        },
        {
            "text": "With the onset of two weeks of lunar night, the pair have been set to sleep mode, and while the primary objectives of the mission have been completed, it is hoped the solar-powered vehicles will re-awaken when the Sun returns to recharge the batteries later in the month."
        },
        {
            "text": "You can find out more about this mission here."
        },
        {
            "text": "NASA’s ‘Osiris-Rex’ mission is set to return a sample from asteroid ‘Bennu’ this month.  Launched in 2016, the mission collected rocks and dust from the asteroid in 2020 before starting the return journey to Earth that will see a capsule land safely in the Utah desert on 24 September."
        },
        {
            "text": "The samples it captured will provide scientists with pristine material from the time when the solar system was forming around 4.5 billion years ago."
        },
        {
            "text": "You can find out more about this mission here."
        }
    ]
}