{
    "url": "https://planninginspectorate.blog.gov.uk/2023/09/08/a-day-in-the-life-of-an-infrastructure-inspector/",
    "title": "A Day in the Life of an Infrastructure Inspector",
    "authors": [
        "sarahburgess"
    ],
    "categories": [
        "Examinations",
        "nationally significant infrastructure projects",
        "People",
        "Recruitment"
    ],
    "pub_date": "2023-09-08T12:14:22+01:00",
    "content": [
        {
            "text": "Have you ever wondered what it's like to be an Infrastructure Inspector at the Planning Inspectorate?  We’re currently recruiting for Band 2 and Band 3 Infrastructure Inspectors. "
        },
        {
            "text": "We’re on the hunt for accomplished professionals with enthusiasm, relevant skills from all sorts of backgrounds, to do a challenging job working for a highly regarded organisation. Two of our inspectors, Menaka and Jason, shed light on the exciting challenges and responsibilities that come with this role. "
        },
        {
            "text": " "
        },
        {
            "text": "\n "
        },
        {
            "heading": 3,
            "text": "Menaka Sahai, Inspector Manager for National Infrastructure Projects"
        },
        {
            "text": "“I've had quite a varied career. Crucially, I worked with Highspeed 2. My experience with High Speed 2 got me interested in national infrastructure. In all my dealings with PINS and all that I worked with, the calibre always seemed incredibly high and was something I always felt I aspired to.  "
        },
        {
            "text": "For me, I was able to see national infrastructure as an integral part of people's day to day lives, something that everyone is affected by, rather than national infrastructure being something that's purely utilitarian.  That’s when a job at the Planning Inspectorate became a career aspiration."
        },
        {
            "text": "The training was a very rigorous process, and the readiness interview was very challenging, but I felt supported throughout the process, whether it was before being appointed or after. I never felt alone. I always knew that I could ask somebody for advice or help. And that's true even today."
        },
        {
            "text": "I feel every job I've had and all the educational training that I've received so far has led me to this role. While I rely heavily on the professional expertise and the vast intellectual capacity of my colleagues, as panel chair I need to have an overview of some extremely complex technical areas. I also need good knowledge of legal areas. I also need to apply my project management skills every day. I really enjoy this part of my role."
        },
        {
            "text": "I feel I deliver a very important public service in my role at the Planning Inspectorate, and my favourite part of my job is that I get to do that while striking a really good work-life balance. I work from home, so a work day is actually exactly 9 a.m. to 4:30 p.m. with a lot of flexibility that works either to my benefit or to the benefit of the inspectorate when needed. I'm never isolated because examinations require me to work with panel members, case team members, environmental services team, government lawyers, and other colleagues.” "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Jason Rowlands,  Planning Inspector for nationally significant infrastructure projects"
        },
        {
            "text": "\"I'm a chartered civil engineer, a chartered environmentalist, and a member of the Association for Project Management. I have been involved in major civil engineering projects during the development stage, the detailed design, and being on construction sites. "
        },
        {
            "text": "Why did I join the Planning Inspectorate? Well, the nature of my work meant I had to be away from home for long periods and had to travel long distances. However, the Planning Inspectorate has given me the opportunity to still be involved with nationally significant infrastructure projects, but I can work from home. That means I have a better work-life balance."
        },
        {
            "text": "During my time here at the Planning Inspectorate, I've come across like-minded people who are professional in their work and act with impartiality and integrity."
        },
        {
            "text": "So if all of these things that I've described and the values that I've mentioned are dear to you, please put in an application to join the Planning Inspectorate and have the chance to make a difference.”  "
        },
        {
            "heading": 3,
            "text": "\nDelving into the roles of Infrastructure Inspectors"
        },
        {
            "text": "In the multifaceted world of infrastructure, the role of inspectors stands paramount. These professionals, differentiated into Band 2 and Band 3, bear significant responsibilities in ensuring the robustness of our nation's infrastructure planning process. "
        },
        {
            "text": "Both bands oversee projects under the Planning Act 2008, operating in an inquisitorial manner with a focus on written processes, supplemented by hearings that may draw significant media and political attention. Their work is timely, adhering to statutory timescales, with reports submitted to government departments such as BEIS, DfT, DLUHC, and Defra. "
        },
        {
            "text": "For a Band 2 Inspector, the role entails examination as a single examiner, progressing applications with efficiency and pace, aiming to provide timely recommendations whether development consent should be granted. Key to their role is the ability to make impartial recommendations grounded in sound judgement and evidence. These inspectors work autonomously yet thrive in collaborative settings, often participating in panels alongside fellow professionals. Handling public casework events, they conduct their work with sensitivity and authority, balancing high-profile cases with genuine enthusiasm for their work. "
        },
        {
            "text": "Band 3 Inspectors lead panels of fellow inspectors, driving the direction and resolution of discussions. They bear the weightier responsibility of not just recommending but ensuring that applications progress efficiently. In cases of panel disagreements, they are the linchpin, responsible for achieving resolution and providing a clear, robust recommendation, even making casting decisions if necessary. These lead inspectors not only require the skills to manage complex cases but also the acumen to support and challenge fellow panelists. Their role demands impeccable interpersonal skills, particularly when directing high-profile public casework events. "
        },
        {
            "text": "In essence, both roles seek motivated, inquisitive individuals with a flair for communication and a genuine enthusiasm for infrastructure development. Whether in Band 2 or Band 3, these inspectors are central to the evolution of our national infrastructure landscape. "
        },
        {
            "heading": 3,
            "text": "Want to find out more? "
        },
        {
            "text": " We’re hosting Q&A sessions on 12/09/2023 and 13/09/2023 at 12 noon.  "
        },
        {
            "text": "Speak directly to our Planning inspectors about their experiences. Get in touch at pins.recruitment@planninginspectorate.gov.uk for joining info. "
        }
    ]
}