{
    "url": "https://ukhsa.blog.gov.uk/2023/09/08/a-parents-guide-to-keeping-kids-healthy-this-school-year/",
    "title": "A parent’s guide to keeping kids healthy this school year",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people"
    ],
    "pub_date": "2023-09-08T10:24:38+01:00",
    "content": [
        {
            "text": "As the new school year begins, children, teenagers and their parents prepare for new schedules, homework, friends, and activities. But the autumn also brings common illnesses that can keep children and teenagers away from their classmates and studies."
        },
        {
            "text": "This blog post covers steps you can take now and throughout the coming term to help protect your family from seasonal illnesses. We’ll explore available vaccinations, how to recognise symptoms of common illnesses, and how to make informed decisions on whether a sick student is well enough to attend school or college."
        },
        {
            "text": "Teach good hygiene habits "
        },
        {
            "text": "Good hygiene stops infections from spreading, which means less disrupted learning time."
        },
        {
            "text": "Teach your child to wash hands properly for 20 seconds, use tissues for coughs and sneezes, and stay away from others when sick. Our e-bug resources for all ages can help you to explain and discuss hygiene habits – and why they are important - to your child or teenager."
        },
        {
            "text": "Know when to keep your child at home"
        },
        {
            "text": "The start of a new term is a good time to familiarise yourself with the symptoms of common illnesses. For some, but not all, illnesses, it will be important to keep your child at home to stop their infection spreading to others."
        },
        {
            "text": "For example, it's fine to send your child to school or nursery with a minor cough or common cold if they are otherwise well and does not have a high temperature. But if they have diarrhoea and/or vomiting, they should stay home for at least 48 hours after the last episode."
        },
        {
            "text": "The NHS has a useful guide here to help parents decide whether a child is well enough to go to school, based on their symptoms."
        },
        {
            "text": "Know how to spot the signs"
        },
        {
            "text": "There are other types of infections to watch out for at this time of year, including bacterial infections such as scarlet fever. Although we see cases throughout the year, cases usually peak in the late winter and early spring."
        },
        {
            "text": "The most common symptoms of scarlet fever include sore throat, fever, swollen neck glands, a bumpy rash on the chest and tummy with a sandpaper-like feel, flushed cheeks and “strawberry tongue”. If you suspect your child has scarlet fever, contact your local GP or NHS 111. Stay away from nursery or school for 24 hours after the 1st dose of antibiotics."
        },
        {
            "text": "Viral infections such as chickenpox can also spread in schools at any time of year and are highly contagious. An itchy, spotty rash is the main symptom of chickenpox. It can be anywhere on the body."
        },
        {
            "text": "Ensure your child is up to date with vaccinations."
        },
        {
            "text": "Vaccines provide the best protection against many common illnesses. Since the COVID-19 pandemic began, fewer children are getting routine vaccines, leaving schools vulnerable to outbreaks and increasing pressure on the NHS."
        },
        {
            "text": "If your child is up to date on their NHS vaccination schedule, they should already be protected against diseases like whooping cough, measles, mumps and rubella throughout their school career, as most provide lifelong immunity."
        },
        {
            "text": "Unvaccinated children are at higher risk of contracting these illnesses and having more severe symptoms than vaccinated classmates. Check your child’s red book or contact your GP surgery to ensure they are current on all vaccines."
        },
        {
            "text": "For many vaccines, such as the Measles Mumps and Rubella vaccine (MMR), it is never too late to catch up. Contact your GP practice if your child has not had one or both doses of MMR."
        },
        {
            "text": "School-age children and young people are offered vaccinations such as: "
        },
        {
            "text": "Through these preventative measures, and by recognising illnesses promptly, you can help your child stay healthy and keep school absences to a minimum this term."
        },
        {
            "text": " "
        }
    ]
}