{
    "url": "https://deframedia.blog.gov.uk/2023/09/08/coverage-of-start-of-work-on-major-flood-risk-management-scheme-in-bewdley/",
    "title": "Coverage of start of work on major flood risk management scheme in Bewdley",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2023-09-08T11:28:34+01:00",
    "content": [
        {
            "text": "Environment Minister Rebecca Pow attended a sod-cutting event yesterday (7 September) to celebrate the start of construction on a major flood risk management scheme at Beales Corner in Bewdley, Worcestershire."
        },
        {
            "text": "There has been widespread positive regional coverage of the event on BBC Midlands Today and in online including the BBC: ‘Work starts on new £6.2m flood defences for Bewdley’, The Kidderminster Shuttle: ‘Beales Corner: Work begins on new Bewdley flood barriers’ and Express & Star: ‘Delight from all as ground is broken on new flood defences’."
        },
        {
            "text": "Construction is helping to support jobs and stimulate the economy by employing British companies, including Arup as lead designer and Jackson Civil Engineering as lead contractor. The new protection consists of a combination of demountable flood barriers and permanent raised walls with glass panels on top to maintain views across the river."
        },
        {
            "text": "Once complete, the scheme will provide decades of invaluable service to the community, reducing flood risk for more than 50 properties and maintaining access to 160 businesses, as well as schools and other public services in the town."
        },
        {
            "text": "Meanwhile, Minister Pow also announced at the event that the Bewdley scheme will be one of three in the area to share £9.3 million in additional funding, reallocated from economic recovery funding. The Beales Corner scheme will receive £1.5 million, Tenbury Wells £4 million and Greyfriars in Hereford £3.8 million."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "The Environment Agency’s new flood defences have ensured the better protection of 374,000 homes since 2015. We continue to do more, delivering a record £5.2 billion investment to protect better hundreds of thousands of properties and the National Flood and Coastal Erosion Risk Management Strategy for England will prepare us for more extreme weather and build a more resilient nation."
        },
        {
            "text": "You can find out if you are at risk of flooding by checking your postcode on the government’s website and you can also sign up for flood warnings. You will be alerted by phone, email or text when flooding is expected."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}