{
    "url": "https://socialcare.blog.gov.uk/2023/09/08/digitisation-is-the-power-to-improve-care/",
    "title": "Digitisation is the power to improve care",
    "authors": [
        "Mark Sutton",
        "Peter Skinner"
    ],
    "categories": [
        "Care and support",
        "Information sharing",
        "Innovation",
        "Workforce"
    ],
    "pub_date": "2023-09-08T09:53:09+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Speed matched with safety, security and efficiency"
        },
        {
            "text": "High-quality care planning is at the heart of delivering safer, more personalised, care. Moving care plans into a digital format, called a digital social care record (DSCR), makes it easier for care providers to manage care and respond to people’s needs more rapidly."
        },
        {
            "text": "The Digitising Social Care programme is funded by the Department of Health and Social Care (DHSC) and delivered through a joint DHSC/NHS England team. The Care Quality Commission (CQC) supports the programme, which aims to encourage and support adult social care providers registered with us to adopt digital social care records."
        },
        {
            "text": "DSCRs also provide a platform for sharing information such as discharge notes, changes in medications and reporting to regulators. And as an added bonus they make the lives of care staff easier by reducing the time spent recording and recovering information about the care they provide."
        },
        {
            "text": "An important focus of our collective work is to support and encourage the sector to adopt these DSCRs."
        },
        {
            "heading": 2,
            "text": "What’s CQC’s view of digitisation?"
        },
        {
            "text": "The Care Quality Commission (CQC) recognises the power of digitisation in achieving good outcomes for people who draw on care. We think of it as putting in place the “beautiful basics”; implementing systems to support care professionals in their work by giving them access to the information they need, when they need it."
        },
        {
            "text": "In guidance published this year, we laid out the fundamental role of good records in underpinning safe, effective, compassionate, high-quality care. This includes sources of best practice and guidance."
        },
        {
            "text": "With the new single assessment framework due to be launched later this year, there’s a growing emphasis on the importance of managing good quality care record systems in the delivery of person-centred care."
        },
        {
            "text": "And as the power of digital care planning outstrips the limited functionality offered by traditional paper-based record systems, it will become increasingly difficult for providers to maintain an outstanding or good rating without having an effective and safe digital social care record solution in place to enable better outcomes for people."
        },
        {
            "text": "CQC will increasingly expect a good provider to comply with the Data Security and Protection Toolkit (DSPT) or equivalent, as a minimum. This also applies where you use a combination of digital and paper record systems."
        },
        {
            "text": "Delivering person-centred care relies on good communication and collaboration between providers, local authorities and integrated care systems (ICSs). Digital social care records will allow information to move seamlessly between health and care systems, supporting care professionals to spend less time on administrative tasks and more time delivering personalised care. Which means better quality, more efficient and safer care."
        },
        {
            "heading": 2,
            "text": "What support is available to providers going digital?"
        },
        {
            "text": "CQC encourages  providers to take advantage of the support and funding that’s on offer through the Digitising Social Care programme. Local support is available, administered by integrated care systems (ICSs), to help providers digitise. This  includes some match funding to implement a DSCR from a list of assured solutions. The suppliers of these assured solutions are committed to meeting all the relevant standards to support information sharing across the health and social care sector."
        },
        {
            "text": "You can find information on the funding available together with details of the digital lead for your ICS here."
        },
        {
            "text": "The Digitising Social Care programme will be launching a brand-new website soon to provide a central hub of information, support and guidance to help providers at every point of their digital journey."
        },
        {
            "text": "Our joint message to providers is that with the new CQC single assessment framework’s emphasis on person-centred care and sustainability, it’s the right time to make the most of the support and help available to progress from paper-based care plans to DSCRs."
        }
    ]
}