{
    "url": "https://naturalengland.blog.gov.uk/2023/09/08/homes-england-plays-an-active-role-in-delivering-biodiversity-net-gain/",
    "title": "Homes England plays an active role in delivering biodiversity net gain",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Natural England"
    ],
    "pub_date": "2023-09-08T10:37:22+01:00",
    "content": [
        {
            "text": "In this blog, we explore what biodiversity net gain means to some of our stakeholders and how they overcome issues they encounter. Lisa Palframan – Senior Technical Manager with Homes England (HE) explains how HE are building experience in delivering BNG through their schemes."
        },
        {
            "text": "As the Government’s housing and regeneration agency, our role is to support the delivery of quality housing and placemaking, help create jobs and drive local economic growth. Our Strategic Plan has a strong focus on ensuring the environmental impact of the new homes we support is minimised and their contribution to the natural environment is maximised. We’re achieving this by planning and delivering biodiversity net gain (BNG). BNG is an approach that leaves more nature after development than before and where possible, on the same site."
        },
        {
            "text": "Our BNG experience"
        },
        {
            "text": "We see BNG as an opportunity to create and enhance habitats for wildlife. At the same time ensure communities can enjoy natural, high quality green spaces. The People and Nature survey found 94% of adults who visited a green and natural space felt spending time outdoors was good for their physical health. 92% felt it was good for their mental health."
        },
        {
            "text": "BNG helps achieve the Building for a Healthy Life standard. This standard is a tool that we use to drive up design quality. Nature is integral to its criteria, it promotes:"
        },
        {
            "text": "Brownfield sites like former airfields support extensive areas of ‘medium distinctiveness’ grassland habitats – which are important for wildlife. Historically, habitats like these received little protection in the planning system. However, the Biodiversity Metric gives them a relatively high value, increasing the site baseline score."
        },
        {
            "text": "We use the Mitigation Hierarchy to avoid impacts on valuable habitats as far as possible, this is more challenging where the habitats cover much of the site which can make achieving BNG more challenging."
        },
        {
            "text": "We’ve experienced some practical challenges. Many schemes we are currently taking through planning were acquired prior to consideration of BNG obligations."
        },
        {
            "text": "How we are delivering BNG"
        },
        {
            "text": "We’ve already started building up our experience in delivering BNG through several schemes in England before BNG is expected to become mandatory."
        },
        {
            "text": "On Brookleigh in West Sussex, HE are delivering 3,500 homes along with an outdoor sports centre, 12ha of public parks and an extension to Bedelands nature reserve. The scheme is predicted to deliver 23% biodiversity net gain, with 45% of the site being maintained as open space which incorporates significant areas of biodiverse planting."
        },
        {
            "text": "It's difficult to ‘retrofit’ BNG after a planning application is submitted, such as if subject to a new local planning authority BNG requirement. By factoring BNG into scheme design as early as possible (before site acquisition), we can protect and enhance biodiversity while still delivering new homes."
        },
        {
            "text": "Our key to success"
        },
        {
            "text": "Our experience has shown that starting early and promoting collaboration between different technical disciplines delivers the best BNG outcomes. Master-planning a high-quality new community requires solutions that deliver for biodiversity. The best solutions have wider benefits:"
        },
        {
            "text": "Careful planning is needed to avoid conflicts between biodiversity and recreational objectives. For example, people’s need for high quality greenspace and access to nature can damage sensitive habitats."
        },
        {
            "text": "A robust stewardship strategy is essential to secure benefits for the long term."
        },
        {
            "text": "The introduction of mandatory BNG will help to ensure that new homes can be delivered along with achieving habitat restoration and species recovery targets. I’m really excited to play an ever more active role in nature recovery and the opportunity to work with Natural England and development organisations. Find out more about Home’s England developments."
        }
    ]
}