{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/09/08/systems-thinking-for-policymaking/",
    "title": "Systems thinking for policymaking",
    "authors": [
        "Alyx Slater"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2023-09-08T12:00:45+01:00",
    "content": [
        {
            "text": "What have you done today that’s had an impact on someone else?"
        },
        {
            "text": "Most policy problems occur within a complex system that is constantly changing with levels of uncertainty and a variety of cause-and-effect loops. Systems have multiple elements, interconnections, stakeholders and drivers, and stakeholders’ views often do not align. Sometimes even defining the policy problem can be complex and hard to understand, let alone exploring possible solutions to that problem. Rather than understanding a system as the sum of its individual parts, systems thinking seeks to view every part as an element of the whole and it’s the connections between these elements that are critical."
        },
        {
            "text": "Just like in our day to day lives, where all the actions we take can have an impact (either known or unknown) on our surroundings, other people and objects, the solutions we find and implement to policy problems have an impact on other parts of the system. All policy areas have connections with other policy areas, and it is seeing these interconnections across a whole system that helps us to understand complex situations and come up with well thought through solutions."
        },
        {
            "text": "Systems thinking offers a way to break problems down into smaller, discrete parts to identify how those parts interrelate and to help improve the chances of positive, planned outcomes being delivered. Taking a systems thinking approach can help you source and understand the root causes of the problem and the impacts that any solutions will have on the rest of the system. There will still be the inevitable possibility of unintended consequences, however through systems thinking this possibility can be minimised. When thinking about the whole system, and understanding the interconnections between different parts, it is easier to design policies with sufficient flex and adaptability that they can cater for future changes within the system."
        },
        {
            "heading": 2,
            "text": "Making policy for authorising food products"
        },
        {
            "text": "I am a Senior Policy Official working in the Food Standards Agency’s (FSA) Reform and Innovation team. The FSA makes sure food is safe and what it says it is. At the FSA we work to ensure that people can trust that the food they buy and eat is safe and what it says it is, and food is healthier and more sustainable. In the Reform and Innovation team we are responsible for exploring reform opportunities across food and animal feed policy. As you can imagine, this interconnects with the work of all other teams in the FSA, some other government departments, and also external stakeholders such as enforcement bodies, researchers and the food industry. Most importantly, any reforms that we make to policy must continue to protect consumers of food. It is therefore vital that we take a systems thinking approach to all the policy problems we encounter when identifying reform opportunities. The reform opportunities we seek will improve the way policy works for stakeholders, for example, making processes easier for businesses and those in research and development, or providing consumer choice benefits."
        },
        {
            "text": "A reform opportunity that I am currently investigating is our suite of legislation and regulatory processes concerning regulated products, which includes regimes such as novel foods, food and feed additives and food contact materials. These are certain food and animal feed products that require authorisation before they can be sold in the UK. 3’‐SL sodium salt is a recently authorised regulated product produced by fermentation of an E. coli strain and is authorised for use in a variety of foods, including infant and follow-on formula. I am exploring ways in which we can streamline the process to make the service better for applicants and the food industry whilst ensuring consumers have food that is safe and what it says it is. Creating a modern, streamlined, and effective regulated products service will bring benefits to both businesses and consumers as new products come to market more quickly, including those with the potential to bring health and environmental benefits."
        },
        {
            "heading": 2,
            "text": "Navigating complex systems in service design"
        },
        {
            "text": "Whilst reform in this area will require legislative and policy changes, it is also effectively re-designing a service. Having very little experience in service design, I recently participated in a workshop about going deeper into the systemic design of services. This really got me thinking about how to use systems thinking when designing (or re-designing) a service and the opportunity to influence two parts of the system, both the policy and the service."
        },
        {
            "text": "An important lesson for me is that whilst factoring in feedback and demands from all stakeholders is important, the key to systems thinking for service design is to start by looking at the demands from the customer. This will often help you to find the root cause of any problems and set you up best for developing strong solutions."
        },
        {
            "text": "Stakeholders will all have a different perspective on a policy problem, and knowing these differences can help civil servants understand the complexity of the problem. I had already factored stakeholder engagement into the policy development phase of my project. However, I am now placing much greater emphasis on this and plan to utilise stakeholder engagement earlier in the process to increase my understanding of the parts of our regulatory processes that are currently difficult for stakeholders to navigate."
        },
        {
            "heading": 2,
            "text": "Complex situations often require complex solutions"
        },
        {
            "text": "Working in policy at the FSA, I have learned that we cannot fix problems alone and that getting stakeholders on board is essential, not just for finding solutions but also for defining the policy problem. We need to accept messy situations, value the knowledge and understanding that others in the system can bring to the table, and not reach for the first conventional solutions. Complex situations often require complex solutions that are not easy to come by. All solutions will have an effect on the rest of the system, so we need input from the whole system to minimise the possibility of unintended consequences."
        },
        {
            "text": "Send a smile someone’s way today, it is sure to have an impact that ripples throughout the system that is your community."
        },
        {
            "heading": 2,
            "text": "Resources for systems thinking"
        }
    ]
}