{
    "url": "https://aphascience.blog.gov.uk/2023/09/08/tackling-invasive-species/",
    "title": "Invasive species: A global problem we can tackle together",
    "authors": [
        "Lucy Cornwell"
    ],
    "categories": [
        "Invasive Species"
    ],
    "pub_date": "2023-09-08T12:26:45+01:00",
    "content": [
        {
            "text": "Invasive non-native species, sometimes known as invasive alien species, are one of the top threats to global biodiversity. In the United Kingdom they harm the environment and native wildlife, cost the economy almost £2bn a year and can even harm our health."
        },
        {
            "text": "This week, a major new report on invasive species was published by the Intergovernmental Platform on Biodiversity and Ecosystem Services (IPBES). It highlights the seriousness of the threat posed by invasive non-native species but shows that by working together with greater coordination and resources we can successfully tackle the threat."
        },
        {
            "text": "The report is extremely timely, given tough targets to tackle invasive species that have recently been agreed internationally as part of the Convention on Biological Diversity, and domestically in the Environmental Improvement Plan and GB Invasive Non-native Species Strategy."
        },
        {
            "heading": 3,
            "text": "The Assessment"
        },
        {
            "text": "The Assessment of Invasive Alien Species and their Control was prepared over four years, with input from over 200 experts worldwide, including staff from APHA. Three co-chairs led the assessment, including Professor Helen Roy from the UK Centre for Ecology and Hydrology. The final report provides a state-of-the-art review of the impacts of invasive species across the world, and what can be done to tackle them."
        },
        {
            "text": "Over 13,000 sources of invasive species knowledge are referenced, including scientific articles, government reports, and indigenous and local knowledge."
        },
        {
            "text": "Invasive non-native species had already been identified as one of five main drivers of biodiversity loss in the IPBES Global Assessment (2019), and the key findings available in the IAS Assessment only underline their importance:"
        },
        {
            "text": "While it highlights the serious threat posed by invasive species, a key finding of the report is that invasive species can be tackled with enhanced resources, ambitious policies, and greater international coordination."
        },
        {
            "heading": 3,
            "text": "APHA’s involvement"
        },
        {
            "text": "APHA colleagues reviewed the IPBES assessment numerous times on behalf of the UK government and last week attended the World Conference Centre in Bonn, Germany, to negotiate and agree the final text as part of the Defra-led UK delegation."
        },
        {
            "text": "Despite tough negotiation into the night for almost a week, the plenary was finally able to approve the assessment on behalf of all 143 IPBES member states."
        },
        {
            "heading": 3,
            "text": "Tackling invasive species in the UK"
        },
        {
            "text": " The UK is already leading initiatives to tackle invasive species through the UK Biological Security Strategy, GB Invasive Non-native Species Strategy, and biosecurity improvements in our highly biodiverse Overseas Territories. In APHA, the GB Non-native Species Secretariat plays a critical role in developing and delivering these strategies, most recently through the establishment of a dedicated Non-native Species Inspectorate, and provides critical biosecurity support to our Overseas Territories."
        },
        {
            "heading": 3,
            "text": "GB Non-native Species Secretariat"
        },
        {
            "text": "The GB Non-native Species Secretariat (NNSS) coordinates work on invasive non-native species in GB and takes a leading role in delivering the GB Invasive Non-native Species Strategy. It is responsible to a Programme Board and statutory Committee for invasive species which represent the relevant governments and agencies of England Scotland and Wales. The NNSS works across numerous areas including managing introduction pathways, risk analysis, rapid response and contingency planning, awareness raising, stakeholder coordination, policy support and providing support to the UK Overseas Territories."
        },
        {
            "heading": 3,
            "text": "Non-native Species Inspectorate"
        },
        {
            "text": "Until recently, there was no dedicated inspectorate to detect and stop the introduction of invasive non-native species at the border or post-border. That changed in 2021, when the new Non-native Species Inspectorate (NNSI) was established."
        },
        {
            "text": "While still at an early stage, and only a small team of 10, the NNSI has already made a substantial contribution to protecting GB from invasive species. They have conducted thousands of inspections, bringing those that trade in, import, and keep invasive species into compliance with the law."
        },
        {
            "text": "The Inspectorate have also provided rapid responses to eradicate populations of invasive ants and plants from GB and have substantially helped to raise awareness of invasive non-native species among key stakeholders."
        },
        {
            "heading": 3,
            "text": "How you can help"
        },
        {
            "text": " Everyone has a part to play in protecting the environment from the impacts of invasive non-native species. Here are five simple things that you can do:"
        },
        {
            "text": "For more information on non-native species, visit the NNSS website."
        }
    ]
}