{
    "url": "https://cddo.blog.gov.uk/2024/01/26/civil-service-data-challenge-shortlist-announced/",
    "title": "Civil Service Data Challenge shortlist announced",
    "authors": [
        "Sue Bateman, Chief Data Officer, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "DDaT events"
    ],
    "pub_date": "2024-01-26T12:16:16+00:00",
    "content": [
        {
            "text": "The shortlisted entries for 2024’s Civil Service Data Challenge, the data competition designed to find a data-led solution to a technical or societal issue, has been announced this week."
        },
        {
            "text": "Proposed project ideas range from optimising prison space, to border control queue control, and energy consumption mapping. "
        },
        {
            "text": "The shortlist has been chosen by the 2024 judging panel, which includes Vicki Chauhan, Head of Public Sector, NTT DATA UK (Chair of Judges); Simon Bourne, Chief Digital, Data and Technology Officer, Home Office; Gina Gill, Chief Digital and Information Officer, Ministry of Justice; Alison Pritchard, Deputy National Statistician and Director General for Data Capability, ONS; Aydin Sheibani, Chief Data Officer, HMRC; John Quinn, CIO, NHS England; and myself."
        },
        {
            "text": "The competition, which attracted over a hundred entries, was launched by Minister Alex Burghart, Parliamentary Secretary for the Cabinet Office in October 2023, and includes eight shortlisted ideas, which have been submitted by a diverse range of civil servants, in different departments and at all grades. "
        },
        {
            "text": "From the hundreds of entries we received this year, the shortlisted project ideas stood out for their originality, potential to improve productivity, and benefit to UK citizens through responsible and innovative use of data and AI."
        },
        {
            "text": "The shortlist includes:"
        },
        {
            "text": "The shortlisted entries will now go on to take part in a Dragon’s Den-style semi-final pitch on 21 March 2024, and the competition will conclude with a grand final on 4 July 2024."
        },
        {
            "text": "Minister Alex Burghart, Parliamentary Secretary for the Cabinet Office, commented:"
        },
        {
            "text": "“It’s very encouraging to see so many dynamic, innovative and exciting data-led project ideas submitted by professionals working on the ground across the Civil Service and NHS. Digital and technology solutions like these have the potential to improve public services in the long-term and offer real life, fresh ways of managing data, whether it’s in prisons, at border control or across the NHS and Department for Work and Pensions.”"
        },
        {
            "text": "Vicki Chauhan, Head of Public Sector at NTT DATA UK&I, said:"
        },
        {
            "text": "“The success of the Civil Service Data Challenge is thanks to our sponsors and mentors who invest time and energy into supporting each project team, as well as the range of talented civil servants, who bring original and exciting ideas to the competition every year."
        },
        {
            "text": "“The creativity and innovation on show this year has been truly outstanding and it has been very difficult for judges to draw-up a shortlist. We are very much looking forward to seeing how these proposals are developed in the coming months, and wish all teams the best for the semi-finals.”"
        },
        {
            "text": "David Vinnicombe, Tax Compliance Officer, in HMRC, and a member of Project Heyrick, the winner’s of Civil Service Data Challenge 2023, said:"
        },
        {
            "text": "“My inspiration for Project Heyrick comes from my role in HMRC, where I make unannounced visits to businesses. Modern slavery is always a possibility, and I wanted to use my experience working with data to develop a platform to take a more proactive approach."
        },
        {
            "text": "“A year on from winning the Civil Service Data Challenge, the dedicated and passionate Heyrick team is conducting an in-depth data discovery focused on developing a cross-government tool to help tackle modern slavery throughout the UK. The Civil Service Data Challenge is a prime example of collaboration and innovation across government, and I’m excited to learn more about new ideas for maximising how we use data.”"
        },
        {
            "text": "Over the past two years, the challenge has seen 400 ideas submitted, and 16 semi-finalists. Last year’s winners, Project Heyrick, was made up of a team of civil servants from multiple departments. Their idea centred on using a modern data-driven approach to detect incidents of modern slavery. "
        },
        {
            "text": "By combining government and open source data sets and applying advanced analytics, the team has been able to identify locations and organisations with an elevated risk of modern slavery. Enforcement departments, such as Policing, the Home Office, or the National Crime Agency, can then use this information to more effectively identify potential crimes."
        },
        {
            "text": "The winner of the Civil Service Data Challenge 2024 will receive funding to help bring the project to life, as well as the endorsement of senior leadership within the Civil Service and technical expertise from NTT DATA."
        }
    ]
}