{
    "url": "https://dluhcmedia.blog.gov.uk/2024/01/26/coverage-of-devolution-deal-with-devon-county-council-and-torbay-council/",
    "title": "Coverage of devolution deal with Devon County Council and Torbay Council",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-01-26T17:33:44+00:00",
    "content": [
        {
            "text": "There is widespread regional coverage reporting favourably on Minister Young’s visit to Paignton yesterday , where he signed a historic devolution deal with Devon County Council and Torbay Council."
        },
        {
            "text": "Press office issued a press release ahead of the signing event, which was covered positively online by Greatest Hits Radio – also highlighting our wider announcement that 60 per cent of the English population now lives in a place covered by a devolution deal - up from 41% in two years."
        },
        {
            "text": "Press office also invited media to cover the signing event and interview Minister Young, which has generated prominent coverage across Devon’s regional titles."
        },
        {
            "text": "The Western Morning News/Devon Live has splashed on the story today, reporting that the Levelling Up Minister visited Paignton to “rubber stump the devolution deal” and bring together 10 councils to “unlock cash and powers” for the new Combined County Authority. It also highlights the millions of pounds in government cash given to the councils as part of the deal, hailing it “a new chapter in an epic story”."
        },
        {
            "text": "This front page story also features online in the Devon Live, quoting Minister Young’s speech to local politicians and business leaders, that this “is another important step forward in our national mission to level up economic growth opportunities and create a better quality life for all”. The piece also mentions that the local councils will now have more power to tackle issues around adult education, net zero ambitions and housing."
        },
        {
            "text": "Similarly, the Mid-Devon Advertiser, Radio Exe, Torbay Weekly, Holsworthy Today, Mid Devon Advertiser, Cornish Times and Dawlish Today also report on the devolution deal, again quoting Minister Young’s speech saying that this is an example of “local and central government working hand in hand” and that it gives local leaders the “money and power they need to unleash this area’s great potential”. Greatest Hits Radio also posted a video on their social channels."
        },
        {
            "text": "ITV West Country ran the story on its Thursday evening news programme, which reported on the signing and included a pre-recorded piece from Minister Young‘s interview yesterday, while the MJ, LocalGov and Local Government Chronicle also report on what the new signing will mean for local people and the benefits of a new Combined County Authority."
        },
        {
            "text": "DLUHC also posted a video on our social channels to announce that the deal had been signed."
        },
        {
            "text": "Levelling Up Secretary Michael Gove said:"
        }
    ]
}