{
    "url": "https://ipa.blog.gov.uk/2024/01/26/how-can-we-be-world-class/",
    "title": "How can we be world-class?",
    "authors": [
        "alicecipolat"
    ],
    "categories": [
        "Construction",
        "digital infrastructure",
        "Infrastructure",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2024-01-26T16:03:10+00:00",
    "content": [
        {
            "text": "The third Transforming Infrastructure Performance (TIP) Live summit took place on 27 November 2023 at the Institute of Civil Engineers (ICE) headquarters in London, hosted in collaboration with the ICE, the Construction Leadership Council (CLC), the Infrastructure Client Group, and the National Infrastructure Commission. "
        },
        {
            "text": "The day brought together nearly 300 leaders, representing over 100 organisations from across government and industry, to discuss the accelerated action that needs to be taken to achieve the IPA’s mission of world-class project delivery by making TIP business as usual in 2025. "
        },
        {
            "text": "The urgency to drive TIP principles forward"
        },
        {
            "text": "TIP Live opened with remarks from the Rt. Hon. John Glen MP, Minister for the Cabinet Office. In the minister’s first speech since assuming office, he outlined the principal importance of TIP BAU 2025 to the wider government agenda, remarking that “now is the time for the UK to be at the forefront of creativity, innovation, and a green future”."
        },
        {
            "text": "Nick Smallwood, Chief Executive Officer at the IPA, also spoke to set out the significant progress that the government has made on our mission to embed TIP as BAU by 2025. He also emphasised that it is now crucial for government and industry to step up a gear to continue progression, as we still have a long way to go. Nick highlighted the need for all delivery to become ‘digital-by-default’, optimising all of our operations through the use of more sophisticated technology, data analytics, and AI. He added that with sector productivity lagging and the impacts of climate change amplifying, we must “start to collaborate differently, work differently, take carbon out of infrastructure-build in significant amounts, and do things significantly more productively”."
        },
        {
            "text": "Cat Little, Second Permanent Secretary to the Treasury, shared her reflection on the Autumn Statement and where infrastructure investment sits in the public sector. She set out the need for long-term planning and investment by both industry and government and the need for a focus on openness."
        },
        {
            "text": "Dr Jo Jolly, IPA Deputy Director for Project Futures, gave an inspiring session explaining the TIP BAU 2025 mission and galvanised the audience to act with purpose, in a value-led way, to realise our critically important ambition. Jo zoomed in on the human factors that are crucial to achieving this, such as psychological safety in teams, as well as results from a pilot looking into the use of novel AI technology in understanding and interpreting data."
        },
        {
            "text": "Driving carbon out of projects"
        },
        {
            "text": "The conference also heard from Matt Palmer, Executive Director for the Lower Thames Crossing (LTC), on how LTC is a pioneering project for carbon-neutral construction."
        },
        {
            "text": "“If we want to continue building things, we need to start changing how we build them”, Matt told delegates. Matt highlighted that LTC is the first project in the UK to put carbon in contracts, with the team also making carbon ‘a leadership conversation’. As a result, they are confident in working towards a 75-85% reduction against a National Highways 2020 baseline."
        },
        {
            "text": "Delegates saw an excellent range of informative sessions, including modern methods of construction (MMC) in practice from the Ministry of Justice, the role of data and AI from No.10’s Data Science Unit, and much more. We are grateful to all the departments and agencies across government and industry partners for their continued support of TIP."
        },
        {
            "text": "Driving action on the day"
        },
        {
            "text": "At this TIP LIVE, we ran roundtables for the first time, each of which focused on the following different objectives of TIP: MMC and platforms, delivering value, productivity, and PAS 2080 (a standard for managing carbon in building and infrastructure). These roundtables brought together leading changemakers from across government and industry, with TIP LIVE acting as a platform through which journeys of collective action were launched. Since TIP LIVE 3, roundtables have been setting and assigning key actions, with progress updates anticipated at Interchange, an annual transport conference, in February. If you are interested in learning more about the roundtable workstreams, please reach out to: projectfutures@ipa.gov.uk."
        },
        {
            "text": "If you would like to learn more about TIP, please read our Roadmap to 2030 and consider coming along to future TIP LIVE events. A post-event survey showed that 92% of delegates had a better understanding of TIP as a result of the event, showing the value in attending our events. "
        },
        {
            "text": "Several presentations from TIP LIVE London have been uploaded here. In addition, Bentley published a flip book on the TIP LIVE Singapore event that we supported in October 2023."
        },
        {
            "heading": 5,
            "text": "All image credits: Ollie Rudkin"
        }
    ]
}