{
    "url": "https://educationhub.blog.gov.uk/2024/01/26/how-we-ensure-young-people-continue-to-be-taught-about-the-holocaust-and-the-lessons-it-teaches-us-today/",
    "title": "How we ensure young people continue to be taught about the Holocaust and the lessons it teaches us today",
    "authors": [
        "media officer"
    ],
    "categories": [
        "bullying",
        "Schools"
    ],
    "pub_date": "2024-01-26T16:45:24+00:00",
    "content": [
        {
            "text": "Every January we stop to reflect on Holocaust Memorial Day."
        },
        {
            "text": "Education has a vital role in eradicating antisemitism and making sure young people are aware of the atrocities of the Holocaust."
        },
        {
            "text": "Unless we all actively try to understand the horrors of the past, why they happened and apply that understanding to today, we risk not spotting signs of hatred and the seeds of further atrocities."
        },
        {
            "text": "Here we look at what is being done to teach about the Holocaust in schools and combat antisemitism."
        },
        {
            "heading": 3,
            "text": "Are children taught about the Holocaust in schools? "
        },
        {
            "text": "Every young person should learn about the Holocaust to help understand why and how it happened, and how that is relevant today."
        },
        {
            "text": "In recognition of its significance, the Holocaust is the only historic event which is compulsory within the history curriculum. Pupils must be taught about it at Key Stage 3 (usually when pupils are aged 13-14)."
        },
        {
            "text": "The Holocaust has been a named topic within the history curriculum since the first curriculum of 1991."
        },
        {
            "heading": 3,
            "text": "Are there other projects available to help support teaching of the Holocaust?"
        },
        {
            "text": "We also support school pupils’ and teachers’ understanding of the Holocaust by providing funding for the following:"
        },
        {
            "heading": 3,
            "text": "What else do you do to help combat antisemitism and bullying more widely in schools? "
        },
        {
            "text": "The Department has published advice and guidance on preventing and tackling bullying in schools."
        },
        {
            "text": "This is supported by Respectful School Communities, a self-review and signposting tool to support schools to develop a whole-school approach."
        },
        {
            "text": "We also continue to support schools through our anti-bullying grants worth over £1million and regularly publish information on the Against Hate website, providing teachers with resources and tools to identify, challenge and prevent radical, extremist and unlawful views."
        },
        {
            "heading": 3,
            "text": "What about universities?  "
        },
        {
            "text": "Following the attacks by Hamas on 7 October 2023 in Israel, Ministers wrote to university leaders to remind them that they should act swiftly against any threats to Jewish students’ safety and welfare and reminded them that support for Hamas, a proscribed terrorist organisation, is a criminal act. "
        },
        {
            "text": "The letter also reiterated university leaders’ obligations under the UK’s Prevent counter-extremism programme. "
        },
        {
            "text": "Discrimination of any kind, including antisemitism, will not be tolerated on university campuses. It is vital that all students feel safe and secure while they learn. "
        }
    ]
}