{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/26/rpa-grants-and-rural-payments-2/",
    "title": "RPA grants and rural payments",
    "authors": [
        "Rural Payments Agency"
    ],
    "categories": [
        "Farming Investment Fund"
    ],
    "pub_date": "2024-01-26T14:36:36+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "RPA offers a wide range of grants rural payments to farmers, businesses and local authorities. In this series about grants and the team that delivers them on the RPA blog we look at the grants available, using case studies to showcase those who have taken advantage of these opportunities, as well as highlighting the work of the RPA Grants Service Team in administering them. In this blog, Donna Medd from Grants Service talks about a recent trip the team made to LAMMA."
        },
        {
            "text": "LAMMA is the UK’s premier farm machinery show which connects farmers across a range of sectors with pioneering companies offering cutting edge agricultural machinery, technology and equipment. Last week, myself and a number of colleagues from Grants Service attended the show at the Birmingham NEC."
        },
        {
            "text": "Our visit gave us an opportunity to explore the show and see real life farming equipment; in particular items which are grant funded through our Farming Equipment Technology Fund (FETF) and Farming Transformation Fund (FTF)."
        },
        {
            "text": "The show floor was filled to the brim with over 22,000 attendees from all corners of the country, demonstrating the support for the agricultural sector. It was a remarkable sight to be part of the enthusiasm and passion of those who gathered to witness the latest launches and experience first-class equipment demonstrations."
        },
        {
            "text": "At the show we were given a guided tour by some of our grants scheme experts to visit some of the main manufacturers of farming equipment that we provide funding for."
        },
        {
            "text": "We had the opportunity to meet with manufacturers and subject matter experts who were able to give us in-depth information on how their equipment works and what it’s used for. We had some great discussions with manufacturers on a number of FETF funded items including a dribble bar (used for the application of slurry), a closed transfer system (used to manage crop protection and nutrition), a cattle squeeze crush and a hydraulic crush (used for the safe handling of cattle) a direct drill (used to place seed directly into the residues of the previous crop with minimal soil disruption). All of these items are funded via our FETF programme."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "The day itself was a success and a good use of our time being able to see the equipment up close and getting expert information from the manufacturers."
        },
        {
            "text": "It was also really interesting to see that some of the manufacturers when they were showcasing their equipment, were explaining that buyers could get grant funding!"
        },
        {
            "text": "The show runs each year in January and we hope that in the future more of the Grants Service team will be able to attend."
        },
        {
            "text": "What are the Farming Equipment Technology Fund (FETF) and Farming Transformation Fund (FTF)?"
        },
        {
            "text": "Both the FETF and the FTF are part of the Farming Investment Fund (FIF) which offers funding for equipment, technology, and infrastructure that improves farm productivity and benefits the environment. This fund provides grants to farmers, foresters and growers, including contractors to these sectors, so they can invest in the things they need to improve productivity and enhance the natural environment."
        },
        {
            "text": "The FETF provides grants between £1,000 and £25,000 towards the cost of equipment and technology to improve productivity, the environment and animal health and welfare. We’ve had two rounds of this scheme – Round 1 was for general items and Round 2 was split into two application windows with items relating to Productivity and Slurry and items on Animal Health and Welfare. All are currently closed for applications, but we expect there will be further FETF opportunities launched this year, including new items."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "The FTF provides grants of £25,000 to £500,000 towards large capital items to help businesses improve productivity, profitability, and environmental sustainability. There are currently five competitive grants available through the FTF:"
        },
        {
            "text": "What’s coming in the future?"
        },
        {
            "text": "Further rounds of these schemes, and any new schemes under the Farming Transformation Fund, will be announced in 2024."
        },
        {
            "text": "Please visit https://www.gov.uk/guidance/funding-for-farmers  regularly for more information as this page sets out every payment on offer, with links to learn more."
        }
    ]
}