{
    "url": "https://rpc.blog.gov.uk/2024/01/26/rpc-chair-gives-evidence-to-the-secondary-legislation-scrutiny-committee/",
    "title": "RPC Chair gives evidence to the Secondary Legislation Scrutiny Committee",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-01-26T15:52:20+00:00",
    "content": [
        {
            "text": "Stephen Gibson (RPC Chair) met with the House of Lords Secondary Legislation Scrutiny Committee (SLSC) on Tuesday 23rd January to discuss the RPC’s views on the new Better Regulation Framework (BRF) and how the changes may impact Parliamentary scrutiny of new regulatory proposals."
        },
        {
            "text": "The Committee raised a number of questions for Stephen, covering the RPC’s role, how it produces opinions, the transparency of the process, and post-implementation reviews."
        },
        {
            "text": "Stephen described how the RPC was involved with the development of the new Framework and that the RPC welcomes the changes – particularly the earlier scrutiny of departments’ options analysis, so that our opinions have a greater opportunity to influence policy development, as well as the increased emphasis on monitoring and evaluation plans which should support better and more considered Post Implementation Reviews (PIRs)."
        },
        {
            "text": "Stephen explained that the Better Regulation Framework is currently in a 12 month, ‘transition’ period, where departments can choose whether to submit measures through the old or new frameworks, however as yet no measures have been submitted through the new BRF. He said that the RPC would monitor the operation of the BRF to see that it is achieving its objectives."
        },
        {
            "text": " "
        },
        {
            "text": "When asked about potential weaknesses of the new BRF, Stephen identified three areas:"
        },
        {
            "text": "Stephen last met SLSC in 2022 and the Committee was keen to understand if departments had improved their impact assessments (IAs) in the interim. Stephen flagged that in 2023, the RPC issued ‘Initial Review Notices’ for around 40% of Final IAs, although when resubmitted the vast majority of these were then assessed as fit-for-purpose. In addition, Stephen noted that departments are still failing to produce PIRs on time, with less than 4 in every 10 regulations having a timely PIR (if they have one at all)."
        },
        {
            "text": "The RPC will continue to work closely with the SLSC and hope that our opinions will continue to support them in their important scrutiny role."
        },
        {
            "text": "The full session can be watched here."
        },
        {
            "text": " "
        }
    ]
}