{
    "url": "https://moderncivilservice.blog.gov.uk/2024/01/26/the-innovation-book-club-great-reads-to-give-a-hoot-about/",
    "title": "The innovation book club: great reads to give a hoot about!",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-01-26T15:30:50+00:00",
    "content": [
        {
            "text": "What are the best books to read on innovation? We asked a range of leaders across the Civil Service for favourite literary recommendations to inspire innovative thinking, from popular guides to to inspirational novels, with a few videos and podcasts to boot."
        },
        {
            "text": "Ruth Newrick - Deputy Director of Transformation, Department for Energy Security and Net Zero"
        },
        {
            "text": "The 7 Habits of Highly Effective People, Stephen Covey. Primarily because of Habit 1: Be Proactive. Innovation is, at its core, about not accepting the 'way things are', and doing something about it. The book is a bit dated now (and management buzzword heavy... ‘synergise’, anyone?) but I believe its core messages stand the test of time."
        },
        {
            "text": "The Martian by Andy Weir. Yes, it's a fiction book about astronauts, but it reminds me that innovation is all about using the tools around you in ways they were never intended. In this case, that's in order to survive on Mars, which is not so applicable to me at the moment, but who knows what the future holds? "
        },
        {
            "text": "Simon King - Deputy Director, Digital Strategy and Innovation, DWP Digital"
        },
        {
            "text": "The book I most commonly recommend is Non-Bullshit Innovation: Radical Ideas from the World’s Smartest Minds. This is not a theoretical or management consultancy book on innovation but a collection of lived experiences of delivering innovation in a range of context written in an engaging and readable format. I think anyone involved in delivering innovation within a complex organisation will find something of use in this book. "
        },
        {
            "text": "Dave Smith, National Technology Adviser "
        },
        {
            "text": "I like this TED talk, Where good ideas come from, as a clear introduction to innovation.  It explains that ideas and innovation evolve, often non linearly, often slowly, then quickly, then slowly, and that it is most likely when different brains combine freely, sharing insight and information. It does not tend to flourish when someone sits in a darkened room pondering their own precious thoughts.  The message is that it is good to talk and don’t expect to leap out of the bath very often."
        },
        {
            "text": "Resolving Conflict by Shay and Margaret McConnon. Incidentally, I also swear by this book. This is certainly not about innovation, but to innovate one needs a mixture of human beings, inevitably they will have different needs and so conflict is reasonably likely to arise.  Letting conflict grow is destructive, running away from it will force people into comfortable bubbles and neither is ideal for innovation. I love this set of techniques as an underpinning innovation skill."
        },
        {
            "text": "Rupert Cryer, Head of Practice Innovation, Government Legal Department"
        },
        {
            "text": "This brilliantly simple Venn diagram captures the fundamentals of innovation:  can we afford it (viability), is it possible (feasibility) and do people need or want it (desirability)."
        },
        {
            "text": " And moving from idea to implementation, how can we drive engagement and take up to make the new product or service really fly?  This short HBR article, written by IDEO who we worked with to create SKYroom, sets out the importance of driving engagement and uptake, creating something so compelling that people buy-in not because they have to but because they want to."
        },
        {
            "text": "Gabriella Cox, Deputy Head, Defence Innovation"
        },
        {
            "text": "Think Again, by Adam Grant. Think Again teaches you how to unthink, test knowledge and test the ‘but we have always done it like this’ mentality and pushes us to be more scientific and diverse in our thinking including doubting your own assumptions. Plus, it’s a nice easy read and written well by an occupational psychologist."
        },
        {
            "text": "Simon Baugh, Chief Executive Officer, Government Communications Service"
        },
        {
            "text": "What can Katy Perry, Britney Spears and Taylor Swift teach us about innovation? They've all had chart-topping hits co-written with Swedish songwriter and producer Max Martin. In fact, Max Martin has written more No1 songs than anyone other than Lennon and McCartney. What's his secret? This podcast explores the role of collaboration and diversity in spurring creativity and innovation. "
        },
        {
            "text": "Andrew Wheeler, Deputy Director, Department of Health and Social Care"
        },
        {
            "text": "I enjoyed reading Immunity to Change, by Robert Kegan and Lisa Lahey, because it frames resistance to innovation in compassionate terms that I think hold a lot of truth. It finds that the behaviours that impede change often serve other important interests, such as assuaging deep-set anxieties — a bit like an overactive immune system. Making sustainable changes requires teams and individuals to address these root causes of resistance, and the book gives some useful guidance on how to do so."
        }
    ]
}