{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/11/13/building-trust-through-independent-accredited-conformity-assessment/",
    "title": "Building trust through independent, accredited conformity assessment",
    "authors": [
        "John Peart",
        "Livia Ralph"
    ],
    "categories": [
        "Certification",
        "Digital identity",
        "UK digital identity and attributes trust framework"
    ],
    "pub_date": "2025-11-13T10:45:21+00:00",
    "content": [
        {
            "text": "The United Kingdom Accreditation Service (UKAS) has granted accreditation to Kantara Initiative; making it the first UKAS-accredited conformity assessment body (CAB) certifying under the UK government’s Digital Identity and Attributes Trust Framework.  "
        },
        {
            "heading": 2,
            "text": "A robust quality framework to underpin the digital economy "
        },
        {
            "text": "UKAS’s decision to award accreditation to Kantara Initiative is a major milestone in the development of the UK’s digital verification services (DVS) ecosystem. It provides a robust, internationally-recognised basis for building trust in those services. "
        },
        {
            "text": "Commenting on the accreditation decision, the Minister for Minister for Digital Government and Data, the Rt Hon Ian Murray MP, said: "
        },
        {
            "heading": 2,
            "text": "How accreditation is awarded "
        },
        {
            "text": "UKAS is the national accreditation body for the United Kingdom. Appointed by government, it independently assesses the technical competence and impartiality of organisations that provide certification, testing, inspection calibration, validation and verification services. "
        },
        {
            "text": "UKAS and DSIT have worked together for several years as part of a pilot programme for digital verification services certification. Kantara Initiative is one of two CABs currently participating in the pilot process, alongside BSI Assurance UK which is working towards accreditation. "
        },
        {
            "text": "The purpose of the pilot has been to develop a robust set of rules for evaluating digital verification services, and to independently assess whether bodies providing conformity assessment are able to implement those rules in line with international standards. "
        },
        {
            "text": "To obtain accreditation, CABs go through a rigorous, three-stage assessment, led by independent assessors with deep technical expertise. "
        },
        {
            "text": "The decision to start granting accreditation reflects that: "
        },
        {
            "text": "Commenting on its grant of accreditation, Andrew Fletcher, Executive Director at UKAS, said: "
        },
        {
            "heading": 2,
            "text": "What this means in practice "
        },
        {
            "text": "Now that CABs have started to be accredited, the government can proceed with commencing the DVS measures in the Data (Use and Access) Act. "
        },
        {
            "text": "All of Kantara’s clients that are presently listed on the non-statutory register of digital identity and attribute services will now be able to apply to join the statutory register when it is published upon commencement. We have already published details of how to get onto the statutory register on GOV.UK.  "
        },
        {
            "text": "With the first CAB now accredited, the pilot phase led jointly by DSIT and UKAS will conclude in due course as focus shifts to scheme maintenance and further development. "
        },
        {
            "text": "We are looking forward to the next stage, after 4 years of developing a certification scheme that supports delivery of digital verification services that are compliant with the UK DIATF and can command trust of individuals and businesses across the UK.  "
        }
    ]
}