{
    "url": "https://naturalengland.blog.gov.uk/2025/11/13/celebrating-25-years-of-the-countryside-and-rights-of-way-act-2000-and-20-years-of-public-access-rights/",
    "title": "Celebrating 25 Years of the Countryside and Rights of Way Act 2000 – and 20 Years of Public Access Rights",
    "authors": [
        "David Drake"
    ],
    "categories": [
        "Coast and access",
        "Connecting People with Nature",
        "Countryside Code",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2025-11-13T12:44:21+00:00",
    "content": [
        {
            "text": "By David Drake, People and Nature Director"
        },
        {
            "text": "This year marks a double milestone in the history of outdoor access in England and Wales: 25 years since the Countryside and Rights of Way Act 2000 (CROW Act) was passed, and 20 years since the public gained access rights under the Act. These anniversaries offer a moment to reflect on how far we've come in opening up the landscape for everyone to enjoy, and remind us that these rights shouldn’t be taken for granted."
        },
        {
            "text": "A landmark in outdoor access"
        },
        {
            "text": "Enacted on 30 November 2000, the Countryside and Rights of Way Act 2000 was a transformative piece of legislation.  Before the Act, access other than on public rights of way was limited and often contested.  The CROW Act changed that by giving the public a legal right of access to designated areas of land (mountain, moor, heath, down and registered common land) for open-air recreation.  It was the result of decades of campaigning, starting with the mass trespass at Kinder Scout in 1932, by people who believed that the beauty of the countryside should be shared by all.  In England and Wales there are approximately 1.3 million hectares of access land."
        },
        {
            "text": "The Act also strengthened protections for wildlife, improved the management of public rights of way, and laid the groundwork for the creation of the King Charles III England Coast Path with its unique access rights in the coastal margin. As it nears completion, it will offer a continuous walking route around the entire English coastline, opening up new vistas and opportunities for exploration."
        },
        {
            "text": "Mapping the land"
        },
        {
            "text": "Maps of open access land are one of the significant outcomes of the Act.  Mapping involved working through reams of habitat and landscape data, ground-truthing, and local and national consultation.  Talking to some of the team that carried out the work, they recall lively town hall meetings, rolls of unwieldy paper maps and visits to disputed parcels of land on windswept hillsides before apps, sat nav and Google maps were a thing!  These maps, maintained by Natural England in England and Natural Resources Wales in Wales, set out where people can walk, and can be found online at PRD_Natural England - Open Access maps and Natural Resources Wales / Map of places to visit."
        },
        {
            "text": "With great rights come great responsibility"
        },
        {
            "text": "Following the mapping, the rights of public access came into effect across all of England and Wales in 2005, allowing people to walk, run, climb and watch wildlife on access land without sticking to paths or needing permission."
        },
        {
            "text": "The Act has some important requirements such as requiring walkers to keep dogs on short leads around livestock and during the bird breeding season.  We take great care to balance the needs of land managers, wildlife and our sensitive habitats with our duty to encourage public enjoyment of the natural environment.  Using evidence to help us understand where people like to walk and what attracts them to an area, we can manage access appropriately."
        },
        {
            "text": "The Forestry Commission dedicated nearly all of the freehold land in the nation's forests managed by Forestry England for Open Access, making it the single largest manager of CRoW access land in the country. These forests had an estimated 313 million visits last year. Forestry England are now working to create new woodlands, adding 859ha freehold land since 2021, with funding from Defra’s Nature for Climate Fund. These will become open access once the trees are established and Forestry England has ambitions to continue creating open access woodlands, adding around 1000ha of new freehold woodland per year over the next few years."
        },
        {
            "text": "Natural England-owned National Nature Reserves were also included, drawing on the expertise of our senior reserve managers to enable access on some of the country’s most special site for nature, through informal management and formal restrictions.  We also incorporated over 20km of new linear access for cyclists and horse riders."
        },
        {
            "text": "Public access rights 20 years on: a legacy of connection"
        },
        {
            "text": "Access land isn’t just in the remote uplands – your nearest patch may be closer than you think.  Manchester, Sheffield and Birmingham have areas within easy reach.  Accessing the outdoors enriches lives, boosts tourism and deepens our connection to nature.  For many, the ability to walk freely in nature is not just a leisure activity, it’s a lifeline. "
        },
        {
            "text": "During the COVID-19 pandemic, the important contribution that access to green spaces can make to everyone’s physical and mental well-being became increasingly recognised.  This contribution is now reflected in things like neighbourhood health and community programmes, education provision and employment schemes. Open Access has played a vital role here, in opening up so many new areas of land for everyone to explore, and in relieving the pressure on highly-visited hot spots by offering a much wider choice of places in which to “get off the beaten track” and enjoy the outdoors"
        },
        {
            "text": "I witnessed this first hand in my own community in the South Pennines, where the restrictions of the pandemic prompted so many more people to take time to explore and build a stronger connection to the landscapes that surround us, and with it an appreciation of how these environments change through the seasons.    "
        },
        {
            "text": "Other legacies from the CROW Act"
        },
        {
            "text": "The Act was also a landmark for countryside protection in England and Wales, establishing Conservation Boards to oversee National Landscapes (AONBs) and introducing the Duty of Regard. Boards in the Chilterns and Cotswolds now lead efforts to conserve and enhance these areas. The Duty of Regard was updated by Section 245 of the Levelling-up and Regeneration Act 2023, requiring authorities to actively ‘seek to further’ the statutory purposes of Protected Landscapes - making conservation a core part of relevant authorities decision-making."
        },
        {
            "text": "A moment to celebrate"
        },
        {
            "text": "As we celebrate 25 years of the CROW Act and 20 years of public open access rights, it’s worth acknowledging the visionaries who made it happen. Their efforts have changed access and protected landscapes, literally and figuratively, for the better.  Whether you're a seasoned rambler, a weekend walker, or someone discovering the joy of nature for the first time, these anniversaries are a reminder for us all to enjoy and explore our diverse landscapes."
        }
    ]
}