{
    "url": "https://moderncivilservice.blog.gov.uk/2025/11/13/finding-my-professional-home-henriettas-journey-into-the-operational-delivery-profession/",
    "title": "Finding my professional home: Henrietta’s journey into the Operational Delivery Profession",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "Join a profession",
        "Operational Delivery",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-11-13T10:23:22+00:00",
    "content": [
        {
            "text": "Henrietta Ozono-Okeri, a passionate ODP professional from Nigeria, tells us about her journey into a new country, career and professional culture."
        },
        {
            "heading": 2,
            "text": "From Nigeria to the UK: My journey into the Operational Delivery Profession "
        },
        {
            "text": "Moving to a new country is often filled with excitement and uncertainty, but when you’re also starting a new career, the challenges multiply. For me, transitioning from a career in Nigeria to working in the UK Civil Service has been both challenging and rewarding. This journey led me to discover the Operational Delivery Profession (ODP), which has been transformative for my career and a source of inspiration for me and my colleagues. "
        },
        {
            "heading": 3,
            "text": "Navigating the cultural shift "
        },
        {
            "text": "Before moving to the UK, I had built my career in a multinational company in Nigeria, Schlumbeger. I worked in a fast-paced corporate environment with a tightly knit community of colleagues, friends and family. In Nigeria, workplaces often feel like extended families, with a shared sense of responsibility and support.  Working in the UK however, presented a different culture - one focused on collaboration, inclusivity and structured development opportunities. While this shift presented opportunities for independence, it also meant finding ways to build connections and create a sense of belonging."
        },
        {
            "heading": 3,
            "text": "Discovering the Customer Service Group (CSG) Inclusion Partnership "
        },
        {
            "text": "An email about the CSG Inclusion Partnership Group became a turning point in my career. I applied and was paired with Claire, a Senior Learning and Development Lead with over 40 years of Civil Service experience. From our first conversation, Claire’s wealth of knowledge and mentorship opened doors I hadn’t imagined. Claire introduced me to ODP and shared insights about development programmes, qualifications and the Civil Service Success Profiles. I began to find the community that I was searching for. Claire encouraged me to join ODP Fest 2024, a virtual festival which brings together ODP colleagues from the breadth of Civil Service. This is where I connected with inspiring professionals and gained invaluable insights into the ODP’s resources. Through Claire’s guidance, I explored the City and Guilds Level 3 Certificate programme, which I eventually enrolled on to add depth to my skills and knowledge. Claire has also connected me with an HMRC colleague who is currently on the Tax Specialist Programme (TSP), to help me determine if it was a path I wanted to explore."
        },
        {
            "heading": 3,
            "text": "Paying it forward "
        },
        {
            "text": "My journey into ODP has not just been about personal development but about creating opportunities for others. By sharing what I learned, several colleagues have enrolled in development programmes, and our team is more engaged than ever. Claire’s ongoing support includes running a Future Engage Deliver (FED) leadership event for me and others, further preparing us for success in our roles.  I get the most joy from sharing what I’ve learned with other people and seeing that spark of interest ignite. I shared these opportunities with my manager and colleagues. My efforts led to several colleagues applying for development programmes. Two have since joined the AA-SEO programme, and three others are exploring ODP qualifications. This ripple effect has created a culture of continuous learning and professional growth within teams, inspiring everyone to be the best they can be at whatever they choose to apply themselves to.  My journey from a Debt Advisor to a Data Analyst and an ODP advocate has been shaped by curiosity, partnership and a willingness to share knowledge. The Operational Delivery Profession has given me tools to grow, adapt and thrive in the UK Civil Service. To anyone exploring development opportunities, I would implore you to seek mentorship on LISTR, attend events like ODP Fest and be open to growth. The benefits go far beyond personal achievement - they transform teams, create cultures of learning, and inspire others to reach their full potential. "
        },
        {
            "text": "To find out more about what the Operational Delivery Profession does and how you can get involved, visit the A Modern Civil Service hub."
        }
    ]
}