{
    "url": "https://defradigital.blog.gov.uk/2025/11/13/how-we-are-building-a-more-connected-content-community-at-defra/",
    "title": "How we are building a more connected content community at Defra",
    "authors": [
        "Lauren Stewart"
    ],
    "categories": [
        "Careers in Digital",
        "Community",
        "Defra content design",
        "Defra digital"
    ],
    "pub_date": "2025-11-13T14:12:34+00:00",
    "content": [
        {
            "text": "Lauren Stewart, Lead Content Designer, Farming, on behalf of the content design community and wellbeing working group."
        },
        {
            "text": "The Defra content design community wants to be a welcoming, inclusive, and fun place to work. A community that knows and supports each other works better together."
        },
        {
            "text": "In 2024, we ran a team stress risk assessment. It showed that people felt isolated and wanted more opportunities to connect. We’ve always prided ourselves on having a strong and supportive community - something that comes up regularly in staff surveys and exit interviews. So, we set to work on how to improve this."
        },
        {
            "heading": 2,
            "text": "Creating a wellbeing working group"
        },
        {
            "text": "The content leadership team discussed options and had the idea to set up a working group focused on improving social and wellbeing outcomes for the community. There’s been lots of change over the past year, and this felt like something positive and within our control. We did some research with different disciplines across digital who had done something similar, to explore what worked well and any lessons learned."
        },
        {
            "text": "We asked for volunteers from across the community to join the group, which would contribute to their community objective. Our community is large and based across England and Wales, so we wanted the group to be representative of regions. We looked at both virtual and in-person events and optimising existing meet-ups."
        },
        {
            "text": "Once we had our first group of volunteers, we set out our principles, objectives, and ways of working. We created a dedicated Slack channel and held regular Teams meetings to plan inclusive activities. We also committed to collecting feedback and researching what kinds of events would best support wellbeing."
        },
        {
            "heading": 2,
            "text": "Optimising in-person events"
        },
        {
            "text": "At each away day, we included a \"get to know your colleagues\" session. At our first event, we ran a short ‘similarities’ icebreaker, where small teams raced to find things that had in common, to promote sharing and connection. This was followed by speed networking after lunch. There was a real sense of connection and fun, and feedback from the day showed a real enthusiasm and gratitude for the opportunity to get to know colleagues more face to face, and calling for similar sessions in the future. We gathered anonymous feedback, as we do with all away days. The response was overwhelmingly positive and clearly met the objectives we set. People enjoyed getting to know each other in an informal way and this helped to feel a part of the community."
        },
        {
            "text": "We iterated activities after analysing the feedback and introduced activities with a content twist. We ran a teambuilding event where participants were split into small groups and given a series of creative and competitive challenges to complete. We designed each activity to encourage collaboration and quick thinking while  strengthening teamwork and building our sense of community."
        },
        {
            "heading": 2,
            "text": "Supporting virtual connection"
        },
        {
            "text": "With colleagues based across the UK and a mix of office and home working, we knew virtual events were just as important. While some regular, ongoing sessions had low attendance, we found that seasonal or themed events worked better as it was easier for people to make time for them. These had higher engagement and more positive feedback, so we shifted our approach to more tailored events."
        },
        {
            "heading": 2,
            "text": "Six months in... time for a retro"
        },
        {
            "text": "After six months, we held a retro facilitated by one of our user researchers. We revisited our goals and reviewed feedback. We’d achieved our aim of helping people get to know each other and building a kind, caring community. Many people said they’d made genuine friendships and felt a stronger sense of belonging. The People Survey results also show more people in the community want to stay in the organisation, and fewer want to leave quickly."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Looking ahead, we decided to focus the next six months on health and wellbeing - something that had emerged as a theme in recent feedback."
        },
        {
            "text": "At our next away day, we introduced short wellbeing activities like guided meditation and stretch breaks. We also launched a wellbeing challenge, encouraging people to share photos of things that made them smile. As the darker months approach, we’re now focusing on winter wellbeing and how to stay well through the season."
        },
        {
            "text": "We’ll continue to listen, learn, and adapt to the community’s needs - because we believe that when people feel supported and connected, they do their best work."
        }
    ]
}