{
    "url": "https://civilservice.blog.gov.uk/2025/11/13/mission-moments-how-comms-officer-ellie-helped-deliver-a-10bn-win-for-britain/",
    "title": "Mission Moments: How comms officer Ellie helped deliver a £10bn win for Britain",
    "authors": [
        "Ellie Genower"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2025-11-13T14:29:21+00:00",
    "content": [
        {
            "text": "When Communications Officer Ellie Genower only got notice of a posting to Oslo with just three weeks to prepare, she couldn’t have anticipated the scale of what lay ahead. But her work proved crucial in helping to secure the biggest warship export deal in British history. Here's how she did it. "
        },
        {
            "text": "The call that changed everything"
        },
        {
            "text": "March 2025. It was another working day for me as a communications officer on the Growth Campaigns brief at the Ministry of Defence in Whitehall when the call came: four months in Oslo with three weeks to pack. "
        },
        {
            "text": "My mission? To lead the communications campaign for the UK’s bid to export BAE Systems’ Type 26 frigates to the Norwegian government in a £10 billion-pound partnership deal. No pressure."
        },
        {
            "text": "If Norway chose the UK, it would mean the biggest warship export deal in history. More than that, it would pump billions into the UK economy, sustain 4,000 jobs (including 2,000 in Scotland) until well into the 2030s and support one of the government’s key missions to kickstart economic growth."
        },
        {
            "text": "However, we faced tough competition from France, Germany and the U.S. With Norway likely to decide in the summer I needed to hit the ground running - in the end, my stay ended up being seven months!"
        },
        {
            "text": "Culture clash"
        },
        {
            "text": "There was just one problem. Although my job at the MOD and journalistic background meant I had a good grasp of British media, I knew absolutely nothing about the Norwegian press or culture. "
        },
        {
            "text": "Enter the British Embassy comms lead in Oslo, who became my cultural translator. He helped me make media contacts and educated me about Norwegian values, introducing  me to 'Janteloven' – a social code that emphasises collective accomplishments and a disdain for showing off."
        },
        {
            "text": "Janteloven became the foundation of my media strategy. I decided we would run a positive campaign, focusing on Type 26's world-class capabilities and the UK’s strong military partnership with Norway, in a high stakes and highly competitive environment. "
        },
        {
            "text": "It sounds simple but it wasn’t. As negative stories emerged, sticking to the positive approach proved challenging, but I held firm, concentrating instead on finding the best media opportunities to showcase our bid."
        },
        {
            "text": "Making waves"
        },
        {
            "text": "What followed was a whirlwind campaign. In just a few months, I set up a series of interviews, met an array of key Norwegian media at ship receptions and military background briefings with the aim to showcase not just our world class ship, but our deep historical ties with Norway from World War II to the present day. Highlights included: "
        },
        {
            "text": "Cross-government teamwork"
        },
        {
            "text": "But I knew success couldn’t come from communications alone. I worked closely with key stakeholders across government -  Royal Navy, Foreign, Commonwealth & Development Office and the Cabinet Office ensuring everyone was pulling in the same direction.  "
        },
        {
            "text": "As ‘Decision Day’ approached, we needed to be prepared. Win or lose, I created media plans, working hard to brief all stakeholders. "
        },
        {
            "text": "Moment of truth"
        },
        {
            "text": "Late August 2025. The call came: Norway announced they had chosen the UK. Job done? Not quite. I then spent a hectic 48 hours working with my brilliant MOD comms colleagues back in London to ensure the news got the coverage it deserved. "
        },
        {
            "text": "The result? Near 100% positive coverage in the UK press and top story on BBC News at Ten."
        },
        {
            "text": "What this means for our missions"
        },
        {
            "text": "This isn’t just a great comms story, it’s a perfect example of how strategic communications directly delivers government missions. The £10bn Norwegian partnership represents the kind of transformational economic impact outlined in the Plan for Change, where economic growth is the top mission. "
        },
        {
            "text": "Even the Norwegian government congratulated us on our campaign, recognising that this wasn’t just effective advocacy, but professional engagement that enhanced international relationships."
        },
        {
            "text": "The takeaway"
        },
        {
            "text": "For me, the campaign’s success came down to the hard work and dedication of an aligned core team across government - a true team effort. It really was one of the most valuable and fulfilling experiences I’ve ever been a part of."
        }
    ]
}