{
    "url": "https://gdsgeospatial.blog.gov.uk/2025/11/13/open-sourcing-elements-of-nuar/",
    "title": "Open-sourcing elements of NUAR ",
    "authors": [
        "Dr Neil Brammall, NUAR Technical Product Owner",
        "Paul Schagen, Deputy Director, Geospatial Data Assets and Contracts"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2025-11-13T11:43:49+00:00",
    "content": [
        {
            "text": "NUAR has taken a highly cautious approach to open-sourcing due to the security impacts it could have. We’ve been making good progress on selectively open-sourcing some elements and artefacts from the programme though, and this blog describes that initiative. "
        },
        {
            "text": "Security has always been at the heart of the delivery of the National Underground Asset Register (NUAR). Obviously, a service like NUAR needs to consider potential impacts to digital and physical infrastructure, and we’ve worked very closely with the relevant agencies to ensure a strong security posture across cyber, physical and personnel threats. "
        },
        {
            "text": "This has had an understandable impact on our ability to fully adhere to the Government Digital Service’s (GDS) Service Standard and in particular item 12 – “Make new source code open”. We have taken a deliberately very cautious approach to publishing NUAR code and artefacts, as fully open-source code would inevitably expose elements of the system security controls, and the methods employed to protect sensitive data. Providing hostile actors with a greater understanding of these measures could make them easier to circumvent. "
        },
        {
            "text": "We’ve tried to make up for this with other examples of working in the open, including running Sprint reviews with our stakeholders every three weeks over the last four years and strong adherence to item 13 – “Use and contribute to open standards, common components and patterns”. We’d like to think that the NUAR programme has been something of an exemplar in this respect. We have fully adopted the standard user interface components used for GOV.UK services, we’ve had a particular focus on the use of open-source software to reduce the impact of vendor lock-in, and most notably we have built NUAR upon a harmonised data model which is based on international open standards, and which is itself open-sourced. In fact, NUAR is the first implementation internationally of the OGC MUDDI Conceptual Data Model and has contributed significantly to the development of that standard. "
        },
        {
            "text": "Having led the way with the open publication of the NUAR data model, we are excited to announce some further examples of where we’ve been able to safely provide open access to curated elements of the NUAR service which we hope will support others in various aspects of their work. This isn’t just about opening up source code either, but also include principles, specifications and other useful material. "
        },
        {
            "text": "The elements of the service which we have been able to open source to date can be found on GitHub "
        },
        {
            "text": "As well as the NUAR Data Model and lots of supporting documents about it, we have also published: "
        },
        {
            "text": "We’re excited to bring these items into the open sphere. In many cases they represent early iterations, and we’ll be doing more work and adding to them over time, but part of truly working out in the open is sharing work in progress as well as finished products, and we hope that you will find some use and interest in the items outlined here. "
        },
        {
            "text": "We’re also keen to hear feedback of course, and examples of any work that you may do to extend and improve these offerings. "
        },
        {
            "text": "Please reach out to geospatial@dsit.gov.uk  if you have any comments on this article or the items it covers. "
        },
        {
            "text": "You can also sign up to get an email notification every time we publish a new blog post. More information about NUAR can be found on gov.uk or follow us on LinkedIn.  "
        }
    ]
}