{
    "url": "https://planninginspectorate.blog.gov.uk/2025/11/13/programme-officer-training-a-reflection/",
    "title": "Programme Officer Training – a reflection",
    "authors": [
        "Louise Gibbons"
    ],
    "categories": [
        "Local plans",
        "programme officers"
    ],
    "pub_date": "2025-11-13T16:05:34+00:00",
    "content": [
        {
            "text": "Louise Gibbons talks about the most recent programme officer training offered by the Planning Inspectorate, and the importance of the role within the local plans examination process."
        },
        {
            "text": "Programme officers play a crucial role in the examination process. With a genuinely plan-led framework, getting a plan ready for examination from local planning authorities takes time, effort and community. This is a long and careful process - once the plan comes to us at the Planning Inspectorate, we  aim to run examinations as quickly and efficiently as possible."
        },
        {
            "text": "The programme officer, or PO plays a central role in this process, acting as the vital communication channel between inspectors, local planning authorities, and all examination participants."
        },
        {
            "heading": 2,
            "text": "Equipping programme officers for planning excellence"
        },
        {
            "text": "It's vital that programme officers understand the essential duties of their role and their relationship to the inspector’s role as much as possible. To help with this, we recently held programme officer training, attended by 11 people, for soon to be and existing programme officers alike."
        },
        {
            "text": "The role requires exceptional organisational skills, attention to detail, but most importantly, the ability to communicate effectively across different channels and groups of people, whilst being as objective and calm as possible. Attendees wishing to get training come from various backgrounds ,  with a wide range of experience including project management and working in various roles in local authorities.  Everyone’s unique background brings transferable skills, like communication and process management."
        },
        {
            "text": "The key training covered the programme officer guidance for local planning authorities – but mostly the event was designed to be interactive and discussion-based  - with the group collectively answering questions and sharing their lived experiences and tips for best practice."
        },
        {
            "heading": 2,
            "text": "Why is programme officer training offered?"
        },
        {
            "text": "With the government’s push for full local plan coverage, those who attended noted that the role of programme officer is a growing profession and that the role – and training in turn – is more vital than ever."
        },
        {
            "text": "This was the second round of training this year, and with the expected increase of local plans submitted, there will be more to come – with the next session likely to happen in early spring.As a conduit between the local authority and the inspector, a programme officer’s role is invaluable to the time saved and effective running of the examination. A job that sits in the heart of different areas of planning roles, it’s rewarding, flexible and a fascinating way to see the planning process in action from all perspectives.  If you are interested in programme officer training, contact: plans.admin@planninginspectorate.gov.uk  for more details."
        }
    ]
}