{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/11/13/shop-smart-bag-a-bargain/",
    "title": "Shop smart, bag a bargain – a consumer expert’s guide to Black Friday",
    "authors": [
        "Hayley Fletcher"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2025-11-13T12:00:20+00:00",
    "content": [
        {
            "text": "Black Friday is all about big savings, but beware – some ‘deals’ may not be as good as they seem."
        },
        {
            "text": "The CMA helps people, businesses and the UK economy by promoting competitive markets and tackling unfair behaviour. When you’re hunting for bargains this Black Friday, we have your back. We want you to feel confident that you:"
        },
        {
            "text": "We’ve pulled together some quick, practical tips to help you shop smart, avoid being misled, and skip those post-sale regrets. You’ll also find direct links to the relevant parts of consumer law – perfect if you need to stand your ground or raise an issue."
        },
        {
            "heading": 2,
            "text": "AI can help you hunt down deals, but take care"
        },
        {
            "text": "AI can be brilliant for scouting out bargains fast, comparing prices across retailers and even checking price history to spot genuine savings."
        },
        {
            "text": "But AI isn’t foolproof. It can sometimes generate incorrect or misleading results, and can miss things like fake reviews."
        },
        {
            "text": "To get the most accurate results:"
        },
        {
            "heading": 2,
            "text": "Your consumer rights don’t disappear in a sale"
        },
        {
            "text": "Under the Consumer Rights Act 2015, items bought in a sale must still be of a satisfactory quality (not broken or damaged), fit for purpose, and match the original description. If this isn’t the case, they can be returned for a refund, repair, or replacement."
        },
        {
            "text": "For more information about the law go to:"
        },
        {
            "heading": 2,
            "text": "If it’s faulty, get a refund"
        },
        {
            "text": "If the item you buy turns out to be faulty, or doesn’t match how the seller described it, then you have 30 days to request a full refund – even if you bought the item on sale."
        },
        {
            "text": "If the fault appears after 30 days, the seller must offer a repair or replacement, and if that doesn’t work, you can still request a refund. Equivalent rules apply to services and digital products too – so if something’s wrong with your game, app or subscription, the seller should fix the problem or give you a refund."
        },
        {
            "text": "Remember that you have rights under the Consumer Rights Act 2015:"
        },
        {
            "text": "Citizens Advice also has a handy guide to refund processes."
        },
        {
            "heading": 2,
            "text": "Even in a sale, it pays to shop around"
        },
        {
            "text": "It might sound obvious, but shopping around can make a big difference. Prices can vary significantly, even during major sales, so it’s worth checking several retailers to help get the best possible deal."
        },
        {
            "text": "Price comparison sites can help – but beware, some companies can pay to bump their products up the rankings, even if they aren’t the cheapest, so it’s worth doing your research."
        },
        {
            "heading": 2,
            "text": "Don’t panic – take a moment before hitting ‘buy’"
        },
        {
            "text": "Take a moment to check when the sale actually ends – some may be very short, but others continue for several weeks beyond Black Friday. Claims like ‘Lots of people looking at this!’ or ‘Only a few left!’ should be taken with a pinch of salt – the item might not be about to sell out. "
        },
        {
            "text": "We’ll continue to take action to crack down on practices like these where we have concerns they risk being misleading, but it’s still a good idea to have a wish list and budget to keep you on track and avoid being pressured into purchasing."
        },
        {
            "heading": 2,
            "text": "Know your payment protections"
        },
        {
            "text": "If you pay by credit card for items over £100, you have legal protection that means you can claim for a refund if the company goes bust or your item doesn’t arrive, or if there are certain other problems such as an item being faulty or not as described."
        },
        {
            "text": "For smaller purchases, chargeback can help recover your spends, but it’s not a legal right and usually doesn’t apply to app payments like PayPal or Klarna (which have their own limited protection schemes)."
        },
        {
            "text": "Citizens Advice has a helpful guide to getting your money back if things go wrong – and see Section 75 of the Consumer Credit Act 1974 for what the law says."
        },
        {
            "heading": 2,
            "text": "Scams spike during Black Friday, so stay alert"
        },
        {
            "text": "Black Friday is prime time for scammers, but luckily, there are ways to protect yourself."
        },
        {
            "text": "Avoid clicking on links in unexpected emails or texts. Instead, go directly to the retailer’s website. Use tools like Get Safe Online to check if a website is legit."
        },
        {
            "text": "And beware of QR codes – they can hide malicious links that take you to phishing scams. Use a secure app on your phone to preview the link before clicking go."
        },
        {
            "text": "Importantly, if you think you’ve been scammed, don’t panic. Contact your bank or credit card provider: you may be entitled to a refund via chargeback or Section 75 protection (as explained above)."
        },
        {
            "text": "Report the scam to Action Fraud as soon as possible. Action Fraud is the reporting centre for fraud and online scams in England, Wales and Northern Ireland. You can report online or call them on 0300 123 2040. If you’re in Scotland, report the crime to Police Scotland."
        },
        {
            "heading": 2,
            "text": "If you change your mind, cancel the purchase"
        },
        {
            "text": "You have 14 days after receipt to cancel online purchases if you change your mind, even if it isn’t faulty. The Consumer Contracts (Information, Cancellation and Additional Charges) Regulations 2013 give you a cooling-off period for online, phone or mail orders – but be aware, you could have to pay for the cost of the return."
        },
        {
            "text": "Read more about cancelling goods or services."
        },
        {
            "heading": 2,
            "text": "If your delivery is late or missing, the seller (not the courier) is responsible"
        },
        {
            "text": "Contacting the courier is a great first step, but if problems persist then speak to the seller."
        },
        {
            "text": "Under the Consumer Rights Act 2015, sellers must deliver goods within 30 days unless agreed otherwise – and they’re legally responsible if things go wrong."
        },
        {
            "text": "For more information about the law, go to Part 1, Chapter 2, Section 28.3b of the Consumer Rights Act 2015."
        },
        {
            "heading": 2,
            "text": "If you spot something dodgy, report it"
        },
        {
            "text": "Tell Citizens Advice about misleading discounts, dodgy claims, unsafe products, and problems resolving issues with a retailer. They can offer advice on what to do and advise on your rights. They can also pass serious cases over to Trading Standards, who have legal powers to investigate."
        },
        {
            "text": "The CMA works with both organisations to tackle consumer issues that are widespread or particularly damaging."
        },
        {
            "text": "We’re serious about cracking down on illegal practices that give false information to consumers, or risk misleading shoppers. With our new legal powers, we will be able to decide whether consumer protection laws have been broken, and to sanction businesses that fail to comply. We will also help businesses to comply with the law."
        },
        {
            "heading": 2,
            "text": "Find more advice"
        },
        {
            "text": "The CMA offers a lot more help for consumers, including guides to your rights in specific areas."
        },
        {
            "text": "For help with your problem, contact the relevant consumer advice organisation where you are."
        },
        {
            "text": "We also have guidance to help businesses comply with consumer law when selling goods and services, including on treating customers fairly and on giving refunds."
        }
    ]
}