{
    "url": "https://ipo.blog.gov.uk/2025/11/13/were-consulting-on-designs-ip-law-why-should-you-respond/",
    "title": "We’re consulting on designs IP law – why should you respond?  ",
    "authors": [
        "Leah Jobling-Purser"
    ],
    "categories": [
        "Design",
        "Design right"
    ],
    "pub_date": "2025-11-13T14:26:54+00:00",
    "content": [
        {
            "text": "Time is ticking! The government’s consultation on changes to the UK designs framework closes on 27 November and we’re on a mission to reach out to designers across the UK and find out how you think the UK designs system could work better for you."
        },
        {
            "text": "Intellectual Property Office's (IPO) Head of Designs Policy, Leah Jobling-Purser tracks the designs IP system from its beginnings, and explains how designers of today can help guide where it needs to go from here to protect the designers of the future.   "
        },
        {
            "heading": 3,
            "text": "Registered designs – where it all began "
        },
        {
            "text": "From the moment you get up in the morning to the time you go to bed at night, you’ll notice that design is everywhere. Your toothbrush, your mobile phone, your favourite coffee mug and even the pattern on your duvet, can all be registered as designs.  "
        },
        {
            "text": "Design has a long history dating back to the latter part of the 18th century. Originally introduced in the Designing & Printing of Linen Act in 1787 to protect, as you would imagine, the designing and printing of linens and cottons, design law has been extended over the years to cover the appearance of functional aspects as well as decorative articles. "
        },
        {
            "text": "The Designing & Printing of Linen Act was the first Act to tackle the issue of copyright in industrial designs. It offered limited protection for the design itself and for subsequent reprinting of the designs on fabrics such as linen, cotton, calico and muslin.  "
        },
        {
            "text": "Then followed the Registered Designs Act 1949 which came into force over 70 years ago, a law that allows for the appearance of a product to be protected against copying or using the same design.  "
        },
        {
            "heading": 3,
            "text": "Why are we consulting now on proposed design law updates? "
        },
        {
            "text": "Since 1949 there have undoubtedly been huge advancements in technology. Here at the IPO, we are keen to ensure that designers can protect their designs to support their creativity and innovation, while also bringing the system up to date to reflect current and future technological advances."
        },
        {
            "text": " That’s why we’ve published our consultation on the UK Designs Framework – a once-in-a lifetime opportunity for you to have your say on the changes that may benefit you or your business. "
        },
        {
            "heading": 3,
            "text": "What questions is the consultation asking? "
        },
        {
            "text": "The consultation covers different aspects of design registration, asking how we can simplify the designs system, improve the validity of registered designs, and ensure that  the system protects emerging forms of design  including virtual and animated designs.  "
        },
        {
            "heading": 3,
            "text": "No prior knowledge needed! "
        },
        {
            "text": "You don’t need any expert knowledge to fill in our consultation. You only need to fill in the parts that relate to you and your work. We’ve broken each area of the consultation down into simple video explainers, designed to guide you through the process. "
        },
        {
            "text": "We want to make sure that designers, creators and those with interests in IP are given a clear, simple and robust way of protecting their hard work, and that’s where you come in!"
        },
        {
            "text": "Here is your opportunity to help frame the future of design protection in the UK. "
        },
        {
            "text": "But be quick! The consultation closes at midnight on 27 November and the IPO really wants to hear your views on how we can shape the UK designs framework so that it really works for those who use it. "
        }
    ]
}