{
    "url": "https://defrafarming.blog.gov.uk/2024/10/30/budget-2024-maintaining-momentum/",
    "title": "Budget 2024: maintaining momentum",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-10-30T15:25:49+00:00",
    "content": [
        {
            "text": "Farming and food security are the foundations of our economy, our communities and our environment. "
        },
        {
            "text": "The government has made it clear that its priorities are food security, sustainable farming, and environmental restoration. Their goals include cleaner water, reducing waste, protecting biodiversity, and improving climate resilience to support a productive and healthy natural environment. "
        },
        {
            "text": "Yesterday, spending on farming in future financial years was confirmed as part of the government’s Spending Review.  "
        },
        {
            "text": "The Spending Review and the Budget work together to set out government spending. The Spending Review allocates funding to departments over several years, focusing on long-term priorities. "
        },
        {
            "text": "The Budget, announced annually, provides the economic outlook and sets out tax and spending plans for the coming year, based on the Spending Review’s framework. Together, they ensure spending aligns with the government’s goals and supports economic stability. "
        },
        {
            "text": "As outlined in the Chancellor’s announcement, we have secured a budget of £2.4 billion for the next financial year.  "
        },
        {
            "text": "This means we can maintain the momentum of our environmental land management (ELM) schemes, which will rise to the highest funding levels ever by 2025/26.  "
        },
        {
            "text": "Through this investment, we’re helping to secure a healthy and resilient future for English farming and restore our natural landscapes for generations to come.   "
        },
        {
            "text": "In this post, we’ll give a roundup of yesterday's announcement and a top-line view of what it means for our schemes. In the coming months, we’ll go into more detail. "
        },
        {
            "heading": 2,
            "text": "Environmental land management schemes"
        },
        {
            "text": "As mentioned, support for our environmental land management schemes (The Sustainable Farming Incentive, Countryside Stewardship Higher Tier and Landscape Recovery) continues. "
        },
        {
            "text": "We’ll continue to develop them so that they work well for farmers and nature.  "
        },
        {
            "heading": 3,
            "text": "The Sustainable Farming Incentive"
        },
        {
            "text": "The Sustainable Farming Incentive (SFI) pays farmers and land managers to manage land sustainably for the benefit of the environment and food production. The scheme is open, and all eligible farmers can apply.  "
        },
        {
            "text": "Through the SFI, farmers can access the support needed to make their businesses more sustainable and resilient, contributing to food security and environmental health. "
        },
        {
            "text": "Find out how SFI can work for you. "
        },
        {
            "text": "Update: as of 12 November 2024, you can now apply for the expanded SFI offer without needing to complete the expression of interest survey."
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship  "
        },
        {
            "text": "Countryside Stewardship Higher Tier is designed to support farmers and land managers in England who are committed to advanced environmental practices on their land. "
        },
        {
            "text": "The scheme provides funding for complex, long-term projects that protect and enhance natural habitats, improve water quality, and foster biodiversity, benefiting both the environment and agricultural productivity. "
        },
        {
            "text": " It's especially valuable because it supports initiatives tailored to unique local landscapes and specific environmental needs, such as managing woodlands, conserving rare species, or restoring historical features. "
        },
        {
            "text": "This targeted, place-based approach encourages sustainable farming, promotes resilience against climate change, and enhances the beauty and diversity of the countryside, making it a win for both the environment and rural communities. "
        },
        {
            "text": "We’re pleased to say that when Countryside Stewardship Higher Tier opens, it will have a rolling application window with a streamlined application process to increase accessibility. More information about the timing and content of the expanded Higher Tier scheme will be published in December.  "
        },
        {
            "text": "Farmers with expiring HLS or Higher Tier agri-environment agreements this year will be offered an extension to their existing agreement to give them time to move into new agreements in an orderly way. Next year, we will make it much easier for farmers in legacy HLS agreements and those farming on commons to transfer into new schemes smoothly, as and when they wish. "
        },
        {
            "heading": 3,
            "text": "Landscape Recovery "
        },
        {
            "text": "Landscape Recovery offers farmers important opportunities to enhance biodiversity, protect landscapes, and address environmental challenges.  Rounds 1 and 2 will continue and we will share more about future rounds of Landscape Recovery in due course. "
        },
        {
            "heading": 2,
            "text": "Flood recovery "
        },
        {
            "text": "Recognising the impact of recent severe weather, the government will honour the £60 million Farming Recovery Fund to support those affected by Storm Henk and other severe weather last winter. The Rural Payments Agency (RPA) will contact eligible farmers directly.  "
        },
        {
            "text": "In addition, our Flood Resilience Taskforce is working on long-term solutions to manage flood risks as part of our commitment to improve flood risk management.  "
        },
        {
            "text": "This week, we’ll publish a post which goes into more detail about the approach to allocating funding, so do subscribe to the Farming blog for an alert as soon as it's live.  "
        },
        {
            "heading": 2,
            "text": "Delinked payments "
        },
        {
            "text": "Further reductions are being made to delinked payments for next year. This is to ensure that funding is targeted where it can have the greatest impact.  "
        },
        {
            "text": "The fastest subsidy reductions will apply to those who historically received the largest payments. For example, the top 4% of recipients — who received over £100,000 in subsidies in 2020 — will receive no more than £8,000 by 2025. In contrast, most farmers, who began with less than £10,000 in payments, will see a gradual reduction in their delinked payments but will continue to have access to funding through SFI and other schemes. "
        },
        {
            "text": "For 2025, we plan to apply a 76% reduction to the first £30,000 of a payment, while making no payments for any portion of a payment above £30,000.  "
        },
        {
            "text": "For example, a payment of £40,000 would have a 76% reduction applied to the first £30,000 of the payment (a reduction of £22,800). A 100% reduction would be applied to the next £10,000 (a reduction of £10,000). The payment would be reduced by £32,800 to £7,200.  "
        },
        {
            "text": "It is the intention that this approach will enable more farmers to access funding for environmental land management, focusing on those who are dedicated to sustainability and environmental stewardship.  "
        },
        {
            "text": "Farms with greater resources in particular are encouraged to pursue ways to improve productivity and diversify without expecting the same level of direct state support. "
        },
        {
            "heading": 2,
            "text": "Grants  "
        },
        {
            "text": "We will simplify and rationalise our grants offer to prioritise the initiatives that deliver the most critical support for food security and environmental goals in England. We will confirm the plans for our grant rounds in due course.  "
        },
        {
            "heading": 2,
            "text": "Animal Health and Welfare "
        },
        {
            "text": "The Animal Health and Welfare Pathway continues to actively invest in on-farm actions, to strengthen the partnership between farmers and their vets, reduce endemic diseases and conditions, increase animal productivity, and improve animal welfare. "
        },
        {
            "text": "Additionally, £208 million has been allocated for 2024-26 to upgrade the Weybridge biosecurity facilities. This investment will significantly improve our ability to respond to disease outbreaks, safeguard animal health, food security and the farming economy. "
        },
        {
            "text": "With these targeted efforts, the government is committed to supporting British farmers, helping them achieve greater resilience and sustainability, and ensuring that the benefits of farming are enjoyed by communities across the country. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "We’re working through the details of the budget announcement and what it means for farmers. Our commitment to the farming community remains firm, and we’ll continue to work closely with farmers to support a sustainable, healthy and resilient future. "
        },
        {
            "text": "When there is more detail, we will share it and where there are opportunities to shape our work with your insight, we’ll let you know.  "
        },
        {
            "text": "Please subscribe to the blog for the latest from our team.  "
        }
    ]
}