{
    "url": "https://environmentagency.blog.gov.uk/2024/10/30/how-the-ea-uses-its-enforcement-powers-to-hold-water-companies-to-account/",
    "title": "How the EA uses its enforcement powers to hold water companies to account",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity",
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2024-10-30T14:04:09+00:00",
    "content": [
        {
            "text": "Since 2015, we have successfully concluded 63 prosecutions against water and sewerage companies for pollution offences securing fines of over £151 million. The most recent of these include a £2 million fine for Severn Trent Water after allowing huge amounts of raw sewage to pollute the River Trent in Staffordshire."
        },
        {
            "text": "Last summer, Thames Water was fined £3.3m for polluting two rivers near Gatwick Airport with sewage, killing several thousand fish, and misrepresenting to Environment Agency investigators about the cause of the pollution. This case also featured on BBC’s Defenders programme."
        },
        {
            "text": "While we will take water companies to court where necessary, prosecutions aren’t the only way we hold water companies to account for causing environmental harm."
        },
        {
            "text": "Our Water Industry Regulation Transformation Programme was launched in June 2023. It is transforming the way we regulate the water industry to uncover more non-compliance and drive better performance. This means we’ll identify more offences and take appropriate enforcement action."
        },
        {
            "text": "There isn’t a one size fits all approach when it comes to enforcement. Our response is proportionate."
        },
        {
            "text": "Civil sanctions"
        },
        {
            "text": "We have available a range of civil sanctions including enforcement undertakings and Variable Monetary Penalties which can be used as an alternative to prosecution."
        },
        {
            "text": "Variable Monetary Penalties"
        },
        {
            "text": "For more serious offences, we can use Variable Monetary Penalties (VMPs), which have been unlimited since December 2023. Although fines handed out by the courts through prosecutions are unlimited, these can be a lengthy and costly process. Using VMPs imposed directly by the EA rather than the courts can offer a quicker method of enforcement."
        },
        {
            "text": "Enforcement undertakings"
        },
        {
            "text": "Another option we can use to secure compliance, restore and improve the affected environment, compensate impacted third parties and prevent further offending is by enforcement undertakings. This is where a voluntary offer is made by companies or individuals to make amends for their offending, and usually includes a payment to an environmental charity to carry out environmental improvements in the local area. We will only consider accepting an enforcement undertaking if:"
        },
        {
            "text": "Since 2014 we have successfully used enforcement undertakings for offending by water companies to contribute over £15million for environmental projects to restore and enhance the environment."
        },
        {
            "text": "In November 2023 Yorkshire Water paid a record £1million to charities after polluting the Hookstone Beck in Harrogate – it was the largest we’d ever accepted."
        },
        {
            "text": "It paid £500,000 to Yorkshire Wildlife Trust and £500,000 to Yorkshire Dales Rivers Trust. It also completed a significant £1.85million sewer network upgrade in the area as part of the enforcement terms."
        },
        {
            "text": "While they are not appropriate in every case, using enforcement undertakings avoids lengthy court cases, holds the water company to account and prevents future environmental harm."
        },
        {
            "text": "Why do cases take so long to get to court?"
        },
        {
            "text": "Criminal prosecutions can be lengthy. Some cases in court this year relate to offences dating back as far as 2018."
        },
        {
            "text": "There are many reasons why cases take a long time to get to court. The impact of Covid and the subsequent closure of the courts lead to a backlog of cases. The most challenging and difficult cases are the ones in court for prosecution, so gathering evidence and the level of complex analysis that is required takes time and expertise."
        },
        {
            "text": "Water companies also have a role to play and their level of co-operation in providing timely information and data during a criminal investigation can lengthen the time taken even further."
        },
        {
            "text": "The future of enforcement"
        },
        {
            "text": "Over the next three years, £15.8 million will be prioritised for water company enforcement. With both an increase in funding and additional funding from water"
        },
        {
            "text": "company charges, we are bringing in an additional legal team, hundreds of additional staff and are already significantly increasing water company inspections, up to 10,000 inspections a year by March 2026. As a result, there will be a rise in enforcement action and a quicker, more efficient response to water company offences and environmental harm. However, there won’t be an overnight increase in enforcement action as transformation takes time while we embed new ways of working, increase inspections, recruit and train our staff."
        },
        {
            "text": "Our Water Industry Regulation Transformation Programme is giving us more resources to implement the current powers we have. The Water Special Measures Bill will also give us more powers to protect water quality and quantity, to better hold water companies to account and ensure the polluter pays. It will enable us to speed up our enforcement response and close the justice gap for both water quality and water resources offending by imposing faster and more predictable civil penalties for the less serious level of offending. More serious cases will still take necessary time."
        },
        {
            "text": "It is likely we will see greater use of enforcement powers such as automatic penalties, VMPs and prosecutions for the most serious offences."
        },
        {
            "text": "In March this year we also launched a whistleblowing portal that allows water industry workers to confidentially report potential environmental wrongdoing by companies regulated by the Environment Agency. This intelligence will be used in our regulatory role to prevent, guide, or enforce where environmental harm is happening. Whistleblowing: reporting serious wrongdoing to the Environment Agency - GOV.UK"
        },
        {
            "text": "Enforcement alone is not our long-term solution. We aim to identify the root causes of environmental harm and non-compliance with water companies to prevent it from occurring in the first place."
        }
    ]
}