{
    "url": "https://defrafmp.blog.gov.uk/2024/10/30/insights-from-commercial-fishing-pilot-event-in-cornwall/",
    "title": "Insights from commercial fishing pilot event in Cornwall",
    "authors": [
        "Claire Dyer, Policy Advisor, Defra"
    ],
    "categories": [
        "Bass FMP",
        "Celtic Sea and Western Channel demersal FMP",
        "Crab and lobster FMP"
    ],
    "pub_date": "2024-10-30T10:26:36+00:00",
    "content": [
        {
            "text": "Between 16 and 18 October, a fisheries management engagement pilot event was held in St. Ives, Cornwall.  It brought together commercial fishers, regulators and government. "
        },
        {
            "heading": 3,
            "text": "A milestone in fisheries management  "
        },
        {
            "text": "The event was the first of its kind, organised in partnership with the Cornish Fish Producers’ Organisation (CFPO), the National Federation of Fishermen’s Organisations (NFFO), the UK Association of Fish Producer Organisations (UKAFPO), the Marine Management Organisation (MMO) and Defra.  "
        },
        {
            "text": "As a pilot, it was a true test of new ways of working, where attendees worked through a number of issues on topics important to Cornwall.  These included talking through: "
        },
        {
            "text": "These formal discussions were supplemented by informal discussions, important for building relationships, and a tour of the fish lofts and harbour. "
        },
        {
            "text": "One of the key successes of the event was the strong level of engagement and energy from all attendees.    "
        },
        {
            "text": "This event has reinforced the importance of trust between government, regulators and industry. Many attendees appreciated the opportunity to engage face-to-face, which helped dispel some common misconceptions and allowed for more empathetic conversations.  "
        },
        {
            "heading": 3,
            "text": "What’s next?  "
        },
        {
            "text": "Looking ahead, all those involved in the organisation of the event are committed to using the discussions to help shape next steps in fisheries management So, we’re already preparing a report from the event, which will be published.   "
        },
        {
            "text": "We will consider whether, and how, we might roll this sort of event out, by considering the feedback received.  In the meantime, there will be plenty of other opportunities for other stakeholders from all sectors and in other locations to get involved in the future as we develop FMPs.    "
        },
        {
            "text": "Find details of the in-person coastal engagement to support the consultation on the next five Defra-led FMPs ​on Book your place on one of our consultation events – Fisheries Management Plans. ​"
        },
        {
            "text": "REMINDER – our Joint Fisheries Statement consultation also remains live until 21 November please submit your views here – Joint Fisheries Statement: proposed amendments to Annex A - GOV.UK"
        }
    ]
}