{
    "url": "https://geospatialcommission.blog.gov.uk/2024/10/30/nuar-legislation-what-does-the-data-use-and-access-bill-mean-for-you/",
    "title": "NUAR legislation: What does the Data Use and Access Bill mean for you? ",
    "authors": [
        "David Hodkin, NUAR policy lead"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2024-10-30T17:22:52+00:00",
    "content": [
        {
            "text": "Dr David Hodkin, NUAR Policy Lead, explains the Data Use and Access Bill's role in establishing the National Underground Asset Register to enhance underground work safety and efficiency. "
        },
        {
            "text": "On 23 October 2024 measures were tabled in Parliament as part of the Data (Use and Access) Bill (Data Bill) which sets out a new legal framework, among other things, that will put the National Underground Asset Register (NUAR) on a statutory footing for England, Wales and Northern Ireland. The proposed measures build upon and modernise the existing legislative framework relating to the sharing and use of data on underground assets – specifically, the New Roads and Street Works Act 1991 for England and Wales, and the Street Works Order 1995 for Northern Ireland.  "
        },
        {
            "text": "As the NUAR policy team, we wanted to take this opportunity to share as much information as we can at this stage with interested stakeholders about what this means for NUAR and you. In particular we know that asset owners will be curious about what it means for them, and what to expect in the coming months. "
        },
        {
            "text": "The contents of the Data Bill are available to view on the UK Parliament website. Further context of the measures included can be found in the explanatory notes (NUAR specific pages are 12, 21, 25, 57 to 66, 115 to 116) which accompany the Data Bill. To summarise, the NUAR measures seek to achieve five key aims, they: "
        },
        {
            "text": "The proposed NUAR legislation has been informed by our extensive work alongside asset owners and other stakeholders since 2019, as well as the public consultation carried out in 2022. "
        },
        {
            "text": "As we noted in our recent series of webinars which introduced the overall legislative process: now that the Data Bill has been introduced to Parliament, it will progress through both Houses of Parliament (Commons and Lords). The progress of the Data Bill will be published on the Parliament website. This will include any information about the dates for each stage as these are announced.  "
        },
        {
            "text": "During this time, we will run a series of focus groups and discussions to inform our future legislative plans, including the future charging model, and how these will be implemented. Our intent is to follow these with a more formal consultation.  "
        },
        {
            "text": "If the Data Bill achieves Royal Assent, the government will work towards making detailed provision with respect to the matters set out above through secondary legislation. During this process we will engage with the sector to seek views and feedback on the legislative proposals. Details on the differences between primary and secondary legislation and relevant examples are included in the section below. "
        },
        {
            "text": "There may also be a period before measures are commenced and take effect. With regards to any NUAR measures, these would be communicated prior to allow sufficient time for businesses to adapt. "
        },
        {
            "heading": 2,
            "text": "Introduction to the legislative process "
        },
        {
            "text": "What is legislation? "
        },
        {
            "text": "There are two types of legislation: primary and secondary. While both go through multiple stages of detailed scrutiny, primary and secondary are two distinct types of legislation that have different purposes and processes. Primary and secondary legislation are typically both needed together in order to realise a legislative change. "
        },
        {
            "text": "What is primary legislation? "
        },
        {
            "text": "Primary legislation are the main laws passed by the UK Parliament such as an Act of Parliament. A bill becomes an ‘Act’ once it has progressed through Parliament and been signed by the Monarch. "
        },
        {
            "text": "Primary legislation establishes a framework for governance and can give powers. For example, under the Data Bill, the NUAR provisions give the Secretary of State the power to specify the form and manner in which asset owners are required to share their data with NUAR. "
        },
        {
            "text": "How does a bill become an Act? "
        },
        {
            "text": "The process for primary legislation starts by securing a bid for a bill slot in the legislative programme. Once this has been achieved, a bill goes through five stages of intense scrutiny and debate in either the House of Commons or the House of Lords (it may be introduced into either house). It then will repeat these five stages in the other House (i.e. if introduced in the House of Lords it will then go through the five stages in the House of Commons). "
        },
        {
            "text": "If the other House makes amendments to a bill, it will need to go back to the first House for their approval. This process is known as ‘ping pong’. Once both Houses are happy with the content of a bill, the final stage is Royal Assent. This is where a bill finally becomes an ‘Act’, in other words, an enforceable law. "
        },
        {
            "text": "What is secondary legislation? "
        },
        {
            "text": "Secondary legislation is law created by ministers (or other bodies) under powers given to them by an Act of Parliament. Secondary legislation may be known as ‘statutory instruments’, ‘delegated legislation’, simply ‘secondary legislation’ and the form of which it is issued may be called ‘orders’, ‘rules’, ‘regulations’, ‘schemes’ or ‘codes’ etc.   "
        },
        {
            "text": "Secondary legislation provides additional detail to enable the implementation of primary legislation. As set out in the example above, the Data Bill (primary legislation) sets out the power to specify the form and manner but does not go so far as to specify the details of how this will be implemented. "
        },
        {
            "text": "Such details will be provided through the secondary legislation which is better adapted to changing technology and user requirements. Continuing with the above example from the Data Bill, secondary legislation could include the detail of what format the data would need to be provided in, by which process it would need to be submitted, and how the amount that asset owners would need to pay to fund NUAR’s running costs would be calculated. We will also need to work through the detail of how secondary legislation will be implemented with stakeholders.  "
        },
        {
            "text": "How does secondary legislation come into force? "
        },
        {
            "text": "The implementation of secondary legislation will follow the format and parliamentary process set out in the parent Act. It may be exercisable by both Houses or, if the secondary legislation relates to financial matters, by the House of Commons alone. "
        },
        {
            "text": "Secondary legislation can be negative or affirmative. Affirmative procedures mean that each House has to approve the secondary legislation. It normally means that it is seen as more significant or sensitive, therefore requiring a higher level of scrutiny. "
        },
        {
            "text": "When laid, it is analysed by committees and then may be debated. If the legislation is approved, it will be signed (usually by the minister) and come into effect.   "
        },
        {
            "text": "A Statutory Instrument laid under the negative procedures will become law on the day the Minister signs it and will remain as law, unless either House introduces a negative resolution (known as a ‘prayer’) and the resolution is agreed to by means of a vote. "
        },
        {
            "heading": 2,
            "text": "NUAR legislation FAQs "
        },
        {
            "text": "The NUAR policy team recently hosted a series of webinars to outline the legislative process. We would like to take this opportunity to summarise the key questions raised in those webinars. "
        },
        {
            "text": "How will the new Data Bill affect utilities and surveying? "
        },
        {
            "text": "If the Data Bill reaches Royal Assent, it will not require any immediate changes in the way utilities and surveyors operate. However, it will ensure NUAR’s sustainable future and signal the path to secondary legislation. The Data Bill shows the government’s commitment to NUAR and will enable the continued development and operation of the service. Legislating for NUAR will help realise the maximum benefit of the service. Accidental strikes put workers’ safety and lives at risk, as well as cause disruption to the public and businesses - costing the UK economy £2.4 billion a year. "
        },
        {
            "text": "NUAR intends to provide a comprehensive, interactive, standardised and immediate view of buried assets. This will be available via a secure, auditable and trusted platform, initially to asset owners and their supply chain. It will be significantly more efficient and bring over £400 million per year of economic benefits. It will also help to reduce inadvertent asset strikes on apparatus already buried underground and to reduce disruption for citizens and businesses. "
        },
        {
            "text": "This will mean that workers in the field will have instant access to a complete and rich view of buried assets - this will help them make more informed decisions on how to carry out works safely and efficiently. "
        },
        {
            "text": "Whilst better access to data will improve worker safety through improved knowledge about what is beneath the surface, it is important that this data is used correctly in line with safe working practices, including HSG47 and organisational safe working practices.  "
        },
        {
            "text": "We are committed to working closely with stakeholders to ensure that NUAR will be adopted by organisations effectively, to improve worker safety and organisational efficiency. "
        },
        {
            "text": "What will the NUAR charging model be? "
        },
        {
            "text": "It is important that NUAR remains free at the point of use to ensure there are no barriers to the access of data for the purposes of safe digging. "
        },
        {
            "text": "As NUAR will lead to efficiency benefits for asset owners, it is intended that the owners of underground assets will collectively cover the cost of running NUAR instead of the government. Fees levied on asset owners will be limited to covering the costs of running the service. We anticipate that the service could be significantly cheaper to current costs incurred by asset owners in making their data available to others for the purposes of safe digging. "
        },
        {
            "text": "Detail of the NUAR charging model will be established in secondary legislation, which would follow primary legislation. We are planning a series of focus groups and discussions over the coming months to inform, amongst other things, the development of the NUAR charging model. This engagement will inform early development of the charging approach and we intend to also conduct more formal consultation activities on the charging model in due course.  "
        },
        {
            "text": "Who will be able to access NUAR? "
        },
        {
            "text": "NUAR is currently operating as a minimum viable product, which is accessible, free at the point of use, to asset owners who operate in England, Wales and / or Northern Ireland that have signed the NUAR Data Distribution Agreement (DDA) and agreed a Data Ingestion Specification (DIS), and those authorised street works contractors working on behalf of these asset owners. "
        },
        {
            "text": "Access to the data is granted in accordance with the agreed use cases and legally enforceable data access agreements. All access is subject to protective monitoring. "
        },
        {
            "text": "Through listening to feedback, we have identified a number of potential opportunities to deliver additional value through access to NUAR data, for example by making NUAR data available to other user groups for safe digging purposes (e.g. surveyors, landowners, members of the public); making NUAR data available to support other use cases (e.g. electric vehicle chargepoint rollout, flood risk planning, emergency response, conveyancing, property development, etc.); and exploring whether the use cases could be met via NUAR data being accessed via an API (application programming interface) or intermediaries.  "
        },
        {
            "text": "We are assessing the evidence underpinning these different opportunities and in due course will take forward those which are technically feasible, of value, and in the public interest, taking into consideration the views of stakeholders including asset owners.  "
        },
        {
            "text": "You can also  sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our  website, or follow us on  LinkedIn  and  X (formerly Twitter). "
        }
    ]
}