{
    "url": "https://gfie.blog.gov.uk/2024/10/30/this-job-has-given-me-stability-as-well-a-sense-of-purpose/",
    "title": "This job has given me stability as well a sense of purpose",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Care Leavers",
        "Life Chances",
        "National Care Leavers Week"
    ],
    "pub_date": "2024-10-30T10:00:00+00:00",
    "content": [
        {
            "text": "This week (28th October - 3rd November) marks National Care Leavers Week, with a theme this year of ‘All of Us, We are One’. Chosen by care experienced young people, it highlights the need to create connections and build stronger communities for care experienced individuals. "
        },
        {
            "text": "National Care Leavers Week encourages us all to ‘CARE’ - Celebrate, Amplify, Raise and Encourage. In this blog, we take a moment to reflect on each of these words and what they mean to Going Forward Into Employment"
        },
        {
            "heading": 3,
            "text": "Celebrate care leavers / care experienced individuals"
        },
        {
            "text": "There are currently three GFIE Pathways specifically focused at supporting care experienced individuals - the Department for Education Care Leaver Internship Scheme,  Cabinet Office Life Chance Scheme for Care Leavers and the Welsh Government Support for Care Leavers Scheme.   Working with Departments across the Civil Service, the schemes aim to offer opportunities to people who may not otherwise have considered a career in the Civil Service."
        },
        {
            "text": "We often hear from candidates, including those with experience of care, that they are not sure what a career in the Civil Service looks like or whether it would be for them. By working in partnership with Local Authorities and organisations supporting care experienced individuals, we aim to show that the Civil Service welcomes the perspectives they can bring, both as colleagues but also as shapers of future public services and policy. "
        },
        {
            "text": "We have seen the impact that care experienced individuals can have and want to build on this brilliant work."
        },
        {
            "heading": 3,
            "text": "Amplify their voices"
        },
        {
            "text": "GFIE aims to bring new voices and lived experiences into the Civil Service. We want care experienced individuals to be heard, which is why this is an opportunity to hear from a candidate from one of the schemes:"
        },
        {
            "heading": 3,
            "text": "Raise awareness of challenges"
        },
        {
            "text": "Research has shown that ‘Life outcomes for people who spent time in the care of the state as children (‘care-experienced’) are known to be significantly lower, on average, than for the general population. The reasons for this are complex and multidimensional, relating to social upheaval, disrupted schooling, mental and physical health issues and societal stigmatisation’ (Harrison, N., Baker, Z. & Stevenson, J. (2022)."
        },
        {
            "text": "Having an awareness of challenges that care-experienced individuals might face is the starting point for conversations about how we might tackle some of these barriers."
        },
        {
            "heading": 3,
            "text": "Enjoy a career in the Civil Service"
        },
        {
            "text": "If you are a care experienced individual wondering how you can make an impact, take a look at the Civil Service Careers GFiE Schemes page to find out more about the different opportunities that might be of interest to you. "
        }
    ]
}