{
    "url": "https://educationhub.blog.gov.uk/2024/10/top-tips-how-child-healthy-school/",
    "title": "Top tips on how to keep your child healthy at school",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Returning to school",
        "Schools"
    ],
    "pub_date": "2024-10-30T16:37:18+00:00",
    "content": [
        {
            "text": "For many, the start of the school term will mean mixing with different groups of people, which is why the autumn term is also known for its colds and bugs."
        },
        {
            "text": "While it’s usually safe for parents and carers to send their children to school with mild illnesses, like a minor cough, runny nose or sore throat, there are steps you can take to ensure your child is better protected against illnesses, so they don’t miss out on vital time in school."
        },
        {
            "text": "Here we take you through what you can do to reduce the chances of your child getting ill."
        },
        {
            "heading": 3,
            "text": "Make sure your child is up to date with their vaccinations"
        },
        {
            "text": "Childhood infections like measles and whooping cough are rising, with outbreaks across the country."
        },
        {
            "text": "These infections can have a huge impact on your child’s life, including missing out on school due to illness, being hospitalised, and even experiencing life-long complications and disability."
        },
        {
            "text": "The best protection you can give your child is to get them vaccinated. If your child isn’t vaccinated, they’re not protected."
        },
        {
            "text": "It is important for parents to take up the offer of the NHS’ free childhood immunisation programme as soon as they are offered ensure your child has the best protection."
        },
        {
            "text": "However, if you or your child have missed a vaccine, it’s never too late to find out if you can catch up."
        },
        {
            "text": "Parents and guardians should check their child’s Red Book to find out if they have missed any vaccines or contact their GP if they are unsure."
        },
        {
            "heading": 3,
            "text": "Remind your child of basic hygiene measures"
        },
        {
            "text": "Some basic hygiene practices go a long way in preventing infections. Remind your child to:"
        },
        {
            "text": "You can use the free e-Bug resources to explore hygiene topics with your child."
        },
        {
            "heading": 3,
            "text": "Know when your child is too ill for school"
        },
        {
            "text": "It’s usually safe for you to send your child to school with mild illnesses, like a minor cough, runny nose or sore throat. However, children should stay at home if they have a high temperature of 38C or above."
        },
        {
            "text": "The NHS has published guidance to help you decide whether your child is well enough to attend school, including information on a range of common childhood illnesses and conditions, such as coughs, colds, chickenpox, measles and headlice."
        },
        {
            "heading": 3,
            "text": "What can schools do to ensure they’re prepared for seasonal illness?"
        },
        {
            "text": "Basic hand, respiratory and cough hygiene measures have a big impact on reducing the spread of illness. You can find more detail on these in the guidance on preventing and controlling infections."
        },
        {
            "text": "This autumn term, all school children in England (from reception to year 11) will be offered a flu vaccination in school."
        },
        {
            "text": "This can help protect children against flu, reduce absence and reduce transmission within the community – including the likelihood of teachers catching flu from pupils."
        },
        {
            "text": "Here’s where you can find the updated flu guidance for primary and secondary schools."
        },
        {
            "text": "Secondary pupils are also offered the HPV vaccine in year 8, MenACWY vaccine in year 9, three in one teenage booster in year 9 and MMR for children who haven’t already been vaccinated."
        },
        {
            "text": "These vaccines help protect young people and the wider community against serious illness at a time when we are seeing the return of vaccine preventable illnesses circulating amongst the unvaccinated."
        },
        {
            "heading": 3,
            "text": "Should I be worried about Mpox?"
        },
        {
            "text": "Mpox (previously known as monkeypox) is a rare infection most commonly found in parts of west, central and east Africa. Like many diseases caused by a virus, mpox has different types or ‘clades’. There are two major clades of mpox, known as clade I and clade II."
        },
        {
            "text": "Clade I mpox may be more serious and so far, has mainly been found in countries across west, central and east Africa. There has been one confirmed case of this type of mpox in the UK."
        },
        {
            "text": "Clade II mpox is thought to be milder. There have been a small number of patients with clade II mpox in the UK since 2022."
        },
        {
            "text": "The infection doesn’t spread easily between people unless there is close person-to-person contact with someone who has the infection or with infected animals and through contact with contaminated materials."
        },
        {
            "text": "The overall risk to the UK population of mpox remains low."
        },
        {
            "text": "Unless your child has been to an affected region, or had contact with someone with mpox, it’s highly unlikely that they have the disease. NHS 111 can tell you what to do if you have a rash."
        },
        {
            "text": "There is existing guidance for dealing with mpox, including UKHSA guidance for education settings on managing mpox cases."
        },
        {
            "text": "The NHS guidance on mpox provides more information on symptoms, how it’s spread and who’s at a higher risk of infection."
        }
    ]
}