{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/30/wage-rises-ensure-a-proper-days-work-gets-a-proper-days-pay/",
    "title": "Wage rises ensure 'a proper day's work’ gets ‘a proper day's pay'",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2024-10-30T17:22:52+00:00",
    "content": [
        {
            "text": "Over 3.5 million workers will receive a pay boost next year thanks to new increases to the National Living Wage and National Minimum Wage rates. This move confirmed by the Chancellor in the Budget has attracted widespread press coverage, being a significant step towards the government’s commitment of making sure the UK’s minimum wage is a genuine living wage."
        },
        {
            "text": "Writing in the Mirror, the Deputy Prime Minister spoke of her own experiences on low pay and why the government is focused on raising living standards for millions of people and protecting the lowest paid workers. She said these wage increases, which now factor the cost of the living and give 18 to 20 year-olds a record pay boost, are the 'next decisive step in Making Work Pay' because 'everyone deserves a fair day’s pay, for a fair day’s work'."
        },
        {
            "text": "The Express, Guardian and Financial Times also highlight these wage rises and how they build on new protections in the Employment Rights Bill which could save people in insecure work up to £600 a year in lost income."
        },
        {
            "text": "The Independent highlights the inflation-busting pay increase meaning workers on a full-time national living wage get an annual boost of £1,400. The Telegraph focuses on the £2,500 annual boost for young workers, thanks to new increases bringing them in line with all adults."
        },
        {
            "text": "Supportive commentary also features across the coverage, including the BBC online which reports the Resolution Foundation described the reforms as ‘sensible’. The general secretary of the TUC Paul Nowak is also quoted supporting the rises, in the light of the cost of living."
        },
        {
            "text": "The BBC News headlines last night also led with the announcement, highlighting this boosted financial support for millions of low-paid workers. Chief Secretary to the Treasury Darren Jones featured on the bulletins stating the increase is part of the ‘pro-worker, pro-business approach to the economy’ that will boost productivity."
        },
        {
            "text": "Deputy Prime Minister, Angela Rayner, said: "
        },
        {
            "text": "“A proper day’s work deserves a proper day’s pay. "
        },
        {
            "text": " “Our changes will see a pay boost that will help millions of lower earners to cover the essentials as well as providing the biggest increase for 18 to 20-year-olds on record.” "
        }
    ]
}