{
    "url": "https://mhclgdigital.blog.gov.uk/2024/10/30/what-might-a-policy-standard-in-government-look-like/",
    "title": "What might a Policy Standard in government look like? ",
    "authors": [
        "Sean Peacock, User Research Lead"
    ],
    "categories": [
        "Innovation",
        "Policy design"
    ],
    "pub_date": "2024-10-30T11:13:32+00:00",
    "content": [
        {
            "text": "Government is becoming more familiar with doing user-centred policy design, whether in creating programmes, support interventions, funding or even legislation. The Ministry of Housing, Communities and Local Government (MHCLG) plays a key role in understanding the needs of different communities and fostering the right conditions for growth and opportunity.  "
        },
        {
            "text": "As a user researcher embedded in a policy team responsible for delivering funding and skills to local authorities, I understand just how important it is to design effective tools, policies and services. In this blog post, I discuss the potential for a Policy Standard in government, built on the broader application of service design principles beyond digital services.  "
        },
        {
            "heading": 2,
            "text": "Designing ‘front-to-back’  "
        },
        {
            "text": "Since 2012, designers in government have been guided by clear principles for creating and running public services. The Service Standard now increasingly acts as a shared language for digital and design professionals who know what is needed for designing, delivering and evaluating effective government services.  "
        },
        {
            "text": "As Clara Greo and Kara Kane have argued, both services and policy decisions should start with user needs. Government services are the result of policy decisions, and do not operate in a vacuum. But when designers collaborate with policymakers, they may find that they are alone in their familiarity with the Service Standard. Those who create policy are not required to follow it or understand its importance to designers. "
        },
        {
            "text": "But this is unsurprising when the Service Standard makes only 4 mentions of the word ‘policy’, mostly in relation to the need for teams to engage with policymakers as subject matter experts. This puts the onus on designers to follow these principles, rather than on policymakers to create the necessary conditions for well-designed services. "
        },
        {
            "heading": 2,
            "text": "What’s in a standard?  "
        },
        {
            "text": "Policies are the result of complex considerations of data, priorities, interests, commitments and challenges. Meanwhile, important checks and balances, such as Public Sector Equality Duty assessments, ensure that the impacts of policies on all groups are properly considered. "
        },
        {
            "text": "Yet standards within the Policy Profession work very differently to the Service Standard. For a start, its pillars and practices are closer to professional principles rather than desired outcomes. Policymakers are far less likely to reference these standards in their work or check against them.  "
        },
        {
            "text": "This means that while designers of services benefit from a reliable structure, clear instructions and mature guidelines to ensure services meet a wide range of needs, designers of policy must approach their task relying on experience, negotiation and intuition.  "
        },
        {
            "text": "It also leaves policymakers more exposed and without a clear line of defence when faced with external pressures to change, compromise or abandon their task altogether.  "
        },
        {
            "heading": 2,
            "text": "Starting with first principles "
        },
        {
            "text": "What if we were to approach policy design in government using a similar framework to how we design services? There are 3 clear rationales for this.  "
        },
        {
            "text": "Policies take significant time and resources to create. Knowing that they have been designed to agreed standards could save policymakers time and energy: for example, through getting buy-in from users from the beginning and reducing the chance of needing to change direction later in the process. "
        },
        {
            "text": "Like services, policies are often complex, sitting within a much larger system and requiring joined-up thinking. Approaching policy design with the aim of solving a whole problem for users could help reduce siloed working by alerting policymakers to systems-level challenges, opportunities to synergise, or unintended consequences. "
        },
        {
            "text": "Finally, the transparency of a standard could increase trust in our ability to deliver for users and communities. Jonathan Slater has expertly articulated the benefits of opening up policymaking – iterating policies like how we test and iterate services could help realise this and signal more inclusive approaches to policymaking.  "
        },
        {
            "heading": 2,
            "text": "Standardising policy design  "
        },
        {
            "text": "A Policy Standard could allow officials to build a clearer picture of needs, motivations and challenges over time, increasing the chances that policies will land in the ways hoped by elected officials, and achieve the outcomes desired by users.  "
        },
        {
            "text": "Meanwhile, robust guidelines could also help designers new to the field and prepare those more experienced for moving into policy arenas. It could also support policymakers themselves in navigating competing priorities, and government leaders in arguing for improved policy processes.  "
        },
        {
            "heading": 2,
            "text": "Towards a Policy Standard  "
        },
        {
            "text": "Creating a Policy Standard will not be an easy task: this would represent a significant change in how we approach policy design. Nor is this about achieving perfection: taking a user-centred approach can make things better without creating new blockers or slowing things down.  "
        },
        {
            "text": "But we can start the task of shaping more user-centred policy today.  "
        },
        {
            "text": "Opening a dialogue between policymakers and designers about the Service Standard could be one place to start. There are already tools to support these conversations, such as the Open Policy Making toolkit, and things we can learn from the Service Manual beyond the Service Standard, such as guidance on understanding and meeting policy intent. "
        },
        {
            "text": "We can also draw on the collective wisdom of our community. For example, we have a thriving Policy Design Community in government, and numerous examples of where designers and policy makers have delivered change. "
        }
    ]
}