{
    "url": "https://dwpdigital.blog.gov.uk/2024/02/14/celebrating-national-apprenticeship-week-2024/",
    "title": "Celebrating National Apprenticeship Week 2024",
    "authors": [
        "Aesha Zafar, head of capability"
    ],
    "categories": [
        "Apprenticeships",
        "Digital Academy",
        "Digital With Purpose"
    ],
    "pub_date": "2024-02-14T09:34:58+00:00",
    "content": [
        {
            "text": "Aesha Zafar, head of capability, DWP Digital "
        },
        {
            "heading": 2,
            "text": "Developing Wonderful People"
        },
        {
            "text": "This year, the theme for National Apprenticeship Week was ‘Skills for Life’. We took the opportunity to shine a spotlight on our incredible apprentices with a week of events, awards and talks from our current cohort."
        },
        {
            "text": "The week culminated in ‘Celebration Friday’ – an opportunity for the support networks surrounding our apprentices to celebrate their successes and reflect on the overall programme."
        },
        {
            "text": "Everyone at DWP Digital makes a difference to millions of people. Whether we’re leading innovative projects, writing code, or providing support to our colleagues, our work has an impact. We all contribute to our organisational goals, and we’re all directly involved in our core mission of making sure that people can access the help, advice, and financial support they need."
        },
        {
            "text": "To achieve our mission, we need a skilled, driven and diverse workforce who aren’t afraid to put our users at the heart of everything they do. Apprenticeships, which give people ways to change career paths as well as supporting those at the start of their careers, are a key part in us achieving that."
        },
        {
            "text": "We’re committed to supporting people who want to make a difference to society by learning new skills in tech and applying them to projects with real-world impact. We currently have 274 apprentices working across 23 different programmes, from level 3 to level 7. Our apprentices work in a variety of roles, including software engineering, DevOps, data analysis and project management."
        },
        {
            "text": "We invest time to ensure we provide the optimum overall experience, with managers, mentors and Communities of Practice all playing a key part."
        },
        {
            "text": "The 2023 apprenticeship survey told us that a massive 96% of our apprentices are satisfied with the support they receive from their line manager. More than 80 of our apprentices have gained a promotion during or in the 12 months following their apprenticeship."
        },
        {
            "text": "Apprentices are supported by their line managers in a number of ways:"
        },
        {
            "text": "At DWP Digital, apprenticeships help us nurture and grow new and existing talent and create meaningful change.  They are real jobs with formal and informal learning and allow people to achieve their career goals in a supported way, and they enable us to meet our business needs."
        },
        {
            "text": "We offer a place to develop in an innovative and collaborative environment and whether someone is new or established in their role, our apprenticeships can allow people to flourish and truly shape their careers."
        }
    ]
}