{
    "url": "https://moderncivilservice.blog.gov.uk/2024/02/14/connecting-to-communities-through-policy-making/",
    "title": "Connecting to communities through policy making",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Government Reform",
        "Modernisation and Reform",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-02-14T14:55:48+00:00",
    "content": [
        {
            "text": "Sheffield is home to the first government Policy Campus outside of Whitehall. As part of the Places for Growth programme, the Civil Service is delivering a range of Government Hub sites across the UK as well as relocating 22,000 roles and 50% of all UK based Senior Civil Service outside of London. So what better way to celebrate the Sheffield Policy campus than with a policy event?"
        },
        {
            "text": "Policy colleagues based in South Yorkshire attended the Civil Service Live Policy event in Sheffield on 8 February 2024, joined by colleagues across the UK online. Through a series of interactive panels and a policy quiz, leaders and policy professionals shared their advice on how to make excellent policy, the role of the policy campus model in supporting place-based policy and inclusive policy making. Market stalls organised by policy and cross-government teams were also available to engage colleagues in different policy themes."
        },
        {
            "heading": 2,
            "text": "The importance of developing policy"
        },
        {
            "text": "Susan Acland-Hood, Permanent Secretary at the Department for Education and Deputy Head of the Policy Profession, talked about the Policy Campus in Sheffield as the second largest concentration of policy professionals outside Whitehall, as well as its role in helping to make Sheffield a powerhouse for policy making and talent development. "
        },
        {
            "text": "Susan talked about three anchors for policy making: strategy, democracy and delivery. Panellists talked about the importance of developing policy in multidisciplinary teams with colleagues in operations and finance and testing policy with impacted public and stakeholders. Simon Case, Cabinet Secretary, encouraged policy makers to leave their desks, go out and explore, ask questions and listen. "
        },
        {
            "text": "Panellists shared three different place based policy models - Darlington, Leeds and Sheffield. Chris Wormald, Permanent Secretary at the Department for Health and Social Care, talked about the Leeds model as a unique collaboration with NHS, the universities and Leeds Council. "
        },
        {
            "text": "He spoke about how they have created a Health and Social Care Hub with clear career pathways for professionals and students in the area. Kate Josephs, Chief Executive of Sheffield City Council, talked about their partnership with Sheffield Policy Campus and how it shapes the local skills market, highlighting the importance of developing policy in a collaborative way."
        },
        {
            "text": "In an interactive policy quiz, panellists shared tips like using driver trees for policy making, the importance of systems thinking and emphasised some of the guidelines policy makers need to consider as they formulate policy. They also talked about the role of documenting lessons learnt and knowledge management."
        },
        {
            "text": "Civil Service Live Policy event was organised by Sheffield Policy Campus, Policy Profession Unit and Sheffield Hallam University. "
        }
    ]
}