{
    "url": "https://companieshouse.blog.gov.uk/2024/02/14/improving-the-accuracy-of-the-companies-house-register/",
    "title": "Improving the accuracy of the Companies House register",
    "authors": [
        "Sarah Whitehead - Director of Strategy, Policy and External Communications"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2024-02-14T16:32:20+00:00",
    "content": [
        {
            "text": "The Economic Crime and Corporate Transparency Act will introduce a number of changes to UK company law."
        },
        {
            "text": "In our last blog post, we shared more information about new rules for registered office addresses, the registered email address, and the new lawful purpose statements."
        },
        {
            "text": "This time, we’re focusing on our new and enhanced powers to query information and request supporting evidence."
        },
        {
            "text": "We expect these powers to come into effect on 4 March 2024. The introduction of these changes needs secondary legislation so this date is still dependent on parliamentary timetables."
        },
        {
            "heading": 2,
            "text": "Registrars’ objectives"
        },
        {
            "text": "Our powers to query information and request supporting evidence are strongly linked to the new objectives introduced by the act for the 3 company registrars:"
        },
        {
            "text": "These new objectives will help shape our decisions when we receive information, and our new and enhanced powers will give us the tools we need to act on these decisions. Over time this will improve the accuracy and integrity of the information on the register and safeguard against misleading or unlawful activity."
        },
        {
            "heading": 2,
            "text": "What this means  "
        },
        {
            "text": "Companies House currently has limited powers to correct or query information. From 4 March 2024, we’ll take a more robust approach to dealing with information that’s provided to us:"
        },
        {
            "text": "We’ll also be able to query information that was already on the register before these measures come into effect."
        },
        {
            "text": "Queries may arise from our own investigations or because we’ve had information from elsewhere which raises questions about the accuracy of the information."
        },
        {
            "text": "A ‘query’ will start with a request for more information and supporting evidence. For example, we could ask more questions about a share capital figure that seems too high or the age of a director that seems unusual."
        },
        {
            "text": "Our powers to query information will not necessarily stop false, misleading or incorrect information being accepted and published on the register, as this type of activity is not always obvious. However, we can still ask for more information and supporting evidence after the information has been published."
        },
        {
            "text": "Once we identify false, misleading or incorrect information, we’ll be able to remove it more quickly than we can at the moment. We’ll also have more powers to share information with law enforcement agencies and other government departments from 4 March 2024. This will make a big difference to the integrity of the information of the register – and to individuals and companies who have been impacted by false, misleading or incorrect information."
        },
        {
            "text": "We will not be able to act on all the information we receive, and we’ll prioritise those cases that pose the biggest risk to the integrity of the register – using the registrars’ objectives to help us to prioritise."
        },
        {
            "text": "Additional changes, such as identity verification, will come into effect later and will strengthen these earlier measures."
        },
        {
            "heading": 2,
            "text": "What to do if we ask you for more information  "
        },
        {
            "text": "It’s important that you respond quickly when we ask you for more information so that we can decide the next steps. If your case escalates to a formal query for information and you still do not respond, this is a criminal offence and there could be serious consequences including:"
        },
        {
            "text": "We’ll give you 14 days to respond to a formal query."
        },
        {
            "text": "This is a brand new approach for Companies House which will grow and evolve as we introduce new processes and ways of working. We’ve already spent 24,000 hours training 730 colleagues to make sure we’re ready to deal with the opportunities ahead. We're confident that, over time, these new powers will make a difference to the accuracy and integrity of the information on the register."
        },
        {
            "text": "Read the GOV.UK factsheet about the role and powers of the registrar of companies."
        }
    ]
}