{
    "url": "https://cspl.blog.gov.uk/2024/02/14/making-sense-of-the-standards-landscape/",
    "title": "Making sense of the standards landscape",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "Ethical standards",
        "Nolan Principles"
    ],
    "pub_date": "2024-02-14T16:38:12+00:00",
    "content": [
        {
            "text": "Earlier this month, Professor Gillian Peele and I gave evidence to the House of Commons Standards Committee as part of their current enquiry into the House of Commons Standards landscape. "
        },
        {
            "text": "We welcome their interest in helping explain the complex standards landscape to the public. Not least the difference between the House of Commons Standards Committee and the Committee on Standards in Public Life (CSPL)."
        },
        {
            "text": "CSPL is an independent advisory Committee, independent of government, Parliament and the Civil Service. Its role is to advise the Prime Minister on arrangements for upholding ethical standards of conduct across public life in England. It’s not a regulator and cannot investigate individual complaints. The Committee has been described as a ‘workshop for running repairs’ to the system."
        },
        {
            "text": "As we said in our evidence session, the current standards map is complex because it maps onto our particular form of public life and democracy - something that has evolved over centuries. On top of this, parts of the standards landscape were developed quickly, often following a scandal, and there are gaps and anomalies."
        },
        {
            "text": "Having taken over as the Chair of CSPL, I have looked back at how and why the standards landscape in the UK has evolved as it has. That reading quickly highlights the major role that the Committee has played in establishing much of the standards scene that we now take for granted."
        },
        {
            "text": "For example, in its first review in 1995, Lord Nolan, our first Chair, recommended the establishment of key regulators - the independent Parliamentary Commissioner for Standards and the Commissioner for Public Appointments and restated the important Principles that underlie public service. The Committee’s later work led to the post of the Adviser on Ministers’ interests and the establishment of the statutory Electoral Commission. Other reports such as MPs’ expenses in 2009 and Intimidation in Public life in 2017 helped frame difficult debates in our public life."
        },
        {
            "text": "The Committee also tries to look ahead. Its 2020 report on Artificial Intelligence and Public Standards was ahead of the curve in thinking about the challenges and opportunities presented by this wave of new technology."
        },
        {
            "text": "Of course, the Committee itself never has all the answers: it relies on the evidence and experience shared with us by experts, politicians, academics and others. Its open and evidence-based approach helps influence debate and build consensus. It is also important to acknowledge the work of the media in scrutinising and highlighting issues. A free press is a vital plank in the UK standards landscape."
        },
        {
            "text": "Lord Nolan talked about three common threads to standards - codes of conduct, independent scrutiny, and guidance and education. I was struck while talking to the Standards Committee and seeing the recent report by the Jo Cox Civility Commission that there is more work to do on education - both in terms of making people aware of the 7 principles and how to live them once in public life and a more general, wider political literacy about how our system of government and politics works."
        },
        {
            "text": "The Nolan Principles underpin public life, guiding those who are elected or appointed to ensure they keep public interest in mind when making decisions on the public’s behalf. What the principles mean in a specific context is demonstrated in the codes and culture of each organisation. Codes require regular review, ensuring they remain relevant and effective. They also need socialising, so that people understand what is expected in their specific role. The rules covering the conduct of a police officer and those of an MP are different by necessity, but the overarching values are the same. Each office holder has to familiarise themselves with both the rules and the principles and organisations need to build the culture and processes that support high standards of behaviour."
        },
        {
            "text": "Maintaining standards requires vigilance and leadership. As I begin my Chairmanship, I hope that I can continue CSPL’s work with regulators, academics, parliamentarians and others to keep the debate and discussion about high standards front and centre. They matter."
        }
    ]
}