{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/07/28/better-services-consigning-silos-to-the-bin/",
    "title": "Better services: consigning silos to the bin",
    "authors": [
        "Alec Steel"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research",
        "Thought leadership"
    ],
    "pub_date": "2022-07-28T12:00:02+01:00",
    "content": [
        {
            "text": "How many times when working on policy have you thought ‘we’re just asking people to do a simple task, how hard can it be?’, or at the other end of the scale ‘this is all so complex it’s a wonder that anyone bothers using this service?’. Perhaps both are familiar. Perhaps you’ve had both thoughts only a short time apart when working in the same policy area."
        },
        {
            "text": "In my role at the National Audit Office, I’m privileged to work with many parts of government. One minute I’m seeing how hospitals run Accident and Emergency departments and the next how the Army recruits new soldiers. Different settings, but both have complex challenges to get right."
        },
        {
            "text": "I recall one hospital visit where I saw how they discharge patients. A bewildering number of things to arrange including transport, in-home physiotherapy, meal service, and follow-up GP appointments. All managed and provided by different organisations across central government, local government, healthcare and sometimes charity or private providers."
        },
        {
            "text": "It made me think about how policy worlds collide where people do the work, and in such unexpected ways. The simple task of getting GPs to provide medical history for people applying to join the Army, keeping applicants interested and moving them through the recruitment process, suddenly didn’t seem so easy. Why and how should a GP prioritise dealing with a request for medical history over providing information to discharge a patient from hospital? That’s on top of all the other considerations in their in-tray such as referrals from local opticians, dealing with practice recruitment, as well as seeing today’s patients."
        },
        {
            "text": "So how do you unpick the challenge of competing policy goals when the temptation is to focus on what’s best for our own service users. It’s definitely not easy, but huge benefits if you get it right."
        },
        {
            "heading": 2,
            "text": "A shared understanding of intent "
        },
        {
            "text": "Government’s policy goals are rarely in the gift of one organisation. Success often depends on people inside and outside of government coming together. From climate change to employment, to social care and economic growth – our work repeatedly shows that it requires a whole host of people to work together. Getting it wrong is often most visible in social and health issues – whether that be integrated care systems or supporting vulnerable people. Inevitably, it’s those that most need help that find themselves pulled in different and confusing directions by unintended policy consequences."
        },
        {
            "text": "In all these policy areas, individually good but misaligned intent can end up adversely impacting the people that government is trying to help. The result is disconnect between the purpose of policy areas and how parts of the system work together. Our own work shows that outcomes for people using services are the sum of the connections of the parts, rather than sum of the parts."
        },
        {
            "text": "There’s no easy or single answer. Building shared purpose needs awareness of the alignment, or not, of objectives, funding, governance and accountability arrangements between the organisations involved. The last three of these are big influences on what people and organisations do. There is less chance of achieving a shared purpose if decisions on what work to invest in, and how we oversee and measure its progress, pulls the people and organisations involved in different directions."
        },
        {
            "text": "It’s perhaps obvious, but start with that shared understanding of purpose, who contributes and how, as a foundation. If everyone gets ‘why we’re doing something’ and can see how their part contributes, it’s easier to have meaningful conversations about how to work together. That makes it easier to work out where to invest and, crucially, how to hold each other to account. Clarity on who contributes and how is a precondition for accountability for what happens next."
        },
        {
            "heading": 2,
            "text": "Understanding what’s important for people using services"
        },
        {
            "text": "Alignment doesn’t mean people will agree on everything, but they do need to be able to raise and deal with issues in a conscious and informed way. A way that achieves a trade-off between individual organisation’s policy objectives. That requires a true understanding of the lived experience of people impacted by the different policy areas. For example, the Department for Work and Pensions and the Department for Education might compete to attract the same group of young people for apprenticeships and return-to-work programmes. So what does a change in one policy area really mean for mean for experience of the young person looking for work in Leeds, Dover, Truro or Penrith? And what’s the likelihood of both departments achieving their objectives as a result of a policy change?"
        },
        {
            "text": "It’s not easy, but worth the investment. Particularly as all systems adapt and change over time, often responding and evolving in ways you wouldn’t predict. You need to need to be comfortable with that. It’s unlikely there will be a clear linear path to success that’s neatly laid out in front of you. You need to remain responsive to what you discover along the way."
        },
        {
            "text": "It takes effort to bring together the strategic management perspective and an understanding of the operational impact of policy changes. And as our work on Improving operational delivery in government shows, there are many more practical challenges to making a difference to the lived experience of service users – which I’ll return to in future blogposts."
        },
        {
            "text": "In the meantime, if your GP is late to your appointment, have a think about what they might have been wrestling with that morning. Maybe there’s more to helping solve their in-tray issue than simply more GPs."
        }
    ]
}