{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/07/28/head-of-design-g6-defra/",
    "title": "Head of Design- G6- DEFRA",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-07-28T13:50:06+01:00",
    "content": [
        {
            "text": "​If you share our vision, are excited by the prospect of the challenges and opportunities it will bring and want to make your mark in building the UK’s scientific capability, we want to hear from you. Join us, and together we will create a great place for living, and a green and healthy future for all.​"
        },
        {
            "text": "Defra group’s mission is to protect and enhance the environment – with policies and actions that are also key to sustainable national growth. Defra group is responsible for safeguarding our natural environment, supporting our world-leading food and farming industry, and sustaining a thriving rural economy. Our broad remit means we play a major role in people's day-to-day life, from the food we eat, and the air we breathe, to the water we drink."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Role"
        },
        {
            "text": "The purpose of this role is to lead Design quality assurance whilst ensuring performance requirements are met across DgP (Defra group Property), Critical works, Operations and SCAH programmes. The post Holder will be a member of the intelligent client function, working within DgP (Defra group Property) reporting to the Deputy Director of Critical Works."
        },
        {
            "text": "The post holder will Chair the Technical review panel and act as a senior stakeholder across various business areas, applying design standards, bio-safety, delivery and commissioning quality assurance to ensure that all proposed and operational design and engineering requirements of buildings, plant, utility and infrastructure are designed and delivered to appropriate standards, ensuring compliance with all applicable regulatory and safety regulations. To enable this the post holder will be responsible for Technical Design and Performance Standards."
        },
        {
            "text": "They will manage a team of specialists namely consultants. They will be responsible for leading technical design assurance to ensure that Capital projects are delivered to meet the needs of the business and are aligned with industry best practice. The value of capital projects investment to be design assured will ramp up from circa £50m/annum to >£100m/annum."
        },
        {
            "text": "The function provides assurance to DgP, APHA, HSE, licence authorities and the programme board that engineering works are designed to appropriate performance standards, installed and commissioned in a safe and secure manner, that engineering solutions support environmental sustainability, and that all works are carried out to meet regulatory and compliance standards."
        },
        {
            "text": "For more information including a full job description and how to apply, please click here"
        },
        {
            "text": "Apply before 11:55 pm on Wednesday 17th August 2022"
        }
    ]
}