{
    "url": "https://vmd.blog.gov.uk/2022/07/28/my-placement-experience-working-with-the-vmds-amr-surveillance-team/",
    "title": "My placement experience working with the VMD’s AMR surveillance team",
    "authors": [
        "Kudzaishe Vhoko-Tapesana"
    ],
    "categories": [
        "Anthelmintic Resistance"
    ],
    "pub_date": "2022-07-28T13:38:23+01:00",
    "content": [
        {
            "text": "Kudzaishe Vhoko-Tapesana at the offices of the VMD"
        },
        {
            "text": "Why I’m here"
        },
        {
            "text": "Hi, my name is Kudzaishe Vhoko-Tapesana. I am a veterinarian from Zimbabwe, and a Fleming Fund fellow for antimicrobial resistance (AMR) and surveillance, being hosted by the London School of Hygiene and Tropical Medicine. My recent two-week long placement at the Animal and Plant Health Agency (APHA) and the Veterinary Medicines Directorate (VMD) was an eye-opening and life-changing experience in so many ways."
        },
        {
            "text": "Serious work behind the warm and smiling faces"
        },
        {
            "text": "Focusing on the VMD placement; the visit commenced with a very warm welcome by members of the International team. Fair warning: a lot of serious and impactful work is carried out by warm and smiling faces."
        },
        {
            "text": "My engagements at the VMD were a mixture of face-to-face and virtual meetings due to the current Covid pandemic. I appreciated the one-on-one meetings which allowed me to explore the work of each expert and engage with them directly without the comfort of numbers."
        },
        {
            "text": "The meetings, some of which were delivered by the CEO and deputy CEO of the VMD, included an overview of the VMD and AMR work in the UK. Instruments used to guide this work such as the National Action Plan (2019-2024), and “Contained and controlled: 20-year vision for AMR” were introduced. One meeting highlighted the three areas that underpin drafting policy related documents, mainly using scientific evidence, political engagement and consideration for the method of delivery."
        },
        {
            "text": "A collaborative AMR team"
        },
        {
            "text": "The work carried out by the residues team in monitoring antimicrobial residues in the food chain, the enforcement team in ensuring that the regulations that exist are adhered to, the regulation of biologicals such as vaccines and the work in pre/post authorization of pharmaceuticals were explored. Antibiotic stewardship programs, supply chain regulation, and pharmacovigilance work were also explained and explored."
        },
        {
            "text": "Parallels with Zimbabwe"
        },
        {
            "text": "Engagement with the AMR Surveillance & Evidence team brought to light some parallels that exist between Zimbabwe and the UK with regards to trying to control AMR, and highlighted differences for lesson learning. AMR surveillance in the UK falls into two broad categories, namely harmonized monitoring (VARSS report, Chapter 3); and clinical surveillance (VARSS report, Chapter 4). The focus of harmonized monitoring is human health, assessing zoonotic microorganisms and indicator bacteria such as E. coli, Campylobacter, Salmonella; and of late they are trialing enterococci. It is harmonized across European countries and laboratory methods are standardized."
        },
        {
            "text": "Clinical surveillance"
        },
        {
            "text": "Clinical surveillance (VARSS report, Chapter 4) is more focused on animal health. Sampling is passive, with samples submitted for diagnostic purposes, and the surveillance system is devolved. Veterinary antimicrobials are used for susceptibility tests. Clinical surveillance provides a snapshot of AMR in organisms causing disease in animals, including zoonotic organisms. It also assists in stewardship programs.  A system known as ResAlert is used across both programmes, which is a risk-based management system for new or unusual AMR threats arising from animals."
        },
        {
            "text": "Take home messages"
        },
        {
            "text": "The biggest take-home messages included the value of behavioral science in health sciences. Knowing and understanding your stakeholders can be the difference between them complying or not complying with good practices. There needs to be a balance between using the carrot and the stick. If the carrot works, the stick is not always necessary for regulators to use. The UK is championing this with regards to industry-led optimization of antimicrobial usage in several species."
        },
        {
            "text": "Using practical and free software is also a starting point in data management and analysis. It is not always necessary to use complicated systems; it is better to start from what is easily understandable, usable, and available to get the message across. In other words, scientific evidence is evidence; no matter the tools used to bring it out. The implementers can build and develop more robust systems as time goes on."
        },
        {
            "text": "Besides cross-sectoral collaboration; within sector collaboration is also important in strengthening AMR surveillance and control. This can be through public- private partnerships or finding ways of complementing efforts being made by other departments within the agriculture sector such as those involved in medicines control and field surveillance of diseases."
        },
        {
            "text": "My one regret is that I visited the VMD by myself; and have no in-country support for whatever important messages I may have missed during the placement. It was an insightful visit, which I would recommend to any professional involved in medicines regulations and AMR surveillance. The scope of the work is immense and based on science. My deepest gratitude goes to the VMD for opening their doors for me to learn from them. I hope to make a difference in my country and in my “One Health” career; using the lessons I learnt."
        },
        {
            "text": " "
        }
    ]
}