{
    "url": "https://extremismcommission.blog.gov.uk/2022/07/28/robin-simcox-appointed-as-commissioner-for-countering-extremism/",
    "title": "Robin Simcox appointed as Commissioner for Countering Extremism",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog",
        "Commissioner opinion",
        "Latest news"
    ],
    "pub_date": "2022-07-28T15:56:40+01:00",
    "content": [
        {
            "text": "Robin Simcox has been appointed as the substantive Commissioner for Countering Extremism. "
        },
        {
            "text": "Robin reflects on the achievements of the CCE during his time as Interim Commissioner and looks forward to the future."
        },
        {
            "text": "Our remit at the Commission for Countering Extremism (CCE) is simple: support society in fighting all forms of extremism."
        },
        {
            "text": "In its short history, the CCE has made a good start. But I also know that there is much more to do."
        },
        {
            "text": "The first order of business when I was appointed Commissioner on an interim basis was to provide the Home Secretary with a vision and a structure for the CCE’s next phase of operations, building upon the work done by my predecessor, Sara Khan."
        },
        {
            "text": "This next phase must be built upon maximising the CCE’s ability to advise and scrutinise the government’s approach to countering extremism. The CCE must do so while helping lead the conversation on contentious topics – whether that is terrorism, freedom of speech, or integration and cohesion – both inside and outside of government."
        },
        {
            "text": "During my Interim tenure, the CCE has helped shape policy and advice on counter extremism work in an unprecedented manner. We have engaged with partners in the public sector, academia, and experts from think tanks and civil society groups. Via the first CCE Conference, we brought together policy officials, academics, and public sector practitioners to discuss extremism in the UK and how we should be responding."
        },
        {
            "text": "We have grown our Academic and Practitioner Counter Extremism Network (APCEN), which plays a vital role in connecting policy officials and practitioners with leading academics specialising in the study of extremism. APCEN’s membership has widened, and we have explored new avenues for sharing expertise and knowledge."
        },
        {
            "text": "Elements of this work have focused upon improving our evidence base for how best to understand various forms of extremism. Gathering this evidence, then advising on how best it can shape policy, will remain a core part of CCE’s work."
        },
        {
            "text": "Yet this has to just be the start. I was honoured to be appointed on a three-year term by the Home Secretary in July 2022, with the expectation that the scrutiny provided by an independent body such as the CCE will improve the response to extremism not only by government but also by wider society."
        },
        {
            "text": "To serve as Commissioner for Countering Extremism is a daunting task, but also a privilege. I will work as hard as I can over the next three years to ensure that our collective understanding of how to combat extremism is in a better place at the end of my term than it was at the start."
        }
    ]
}