{
    "url": "https://insideDIO.blog.gov.uk/2022/07/28/supporting-nature-recovery-on-the-mod-estate-in-south-wales/",
    "title": "Supporting nature recovery on the MOD estate in South Wales",
    "authors": [
        "John Black"
    ],
    "categories": [
        "Conservation",
        "Environment and Ecology",
        "Land Management"
    ],
    "pub_date": "2022-07-28T14:06:25+00:00",
    "content": [
        {
            "text": "The orchid discovered in July. [Copyright Richard Pryce]As an ecologist in DIO’s Environmental Support and Compliance Team, I work in the Wales and West region of the UK Defence estate, which is home not only to numerous military training areas but also a diverse range of wildlife, as well as rare flora and fauna."
        },
        {
            "text": "Amongst the various Sites of Special Scientific Interest (SSSI) encompassed by the MOD’s Welsh estate is Laugharne-Pendine Burrows, situated within MOD Pendine. It was here that a very exciting re-discovery was recently made, with the rare and elusive Fen Orchid spotted growing for the first time in just under twenty years!"
        },
        {
            "heading": 2,
            "text": "MOD Pendine "
        },
        {
            "text": "MOD Pendine is located on the southwest coast of Wales, within the village of Pendine itself. The site has a land area of 20.5km² and is operated by QinetiQ on behalf of the MOD. It is used for Test and Evaluation (T&E) and training support services, helping to ensure that the equipment used by our Armed Forces is fit for purpose and that military personnel have the training needed for the job they do."
        },
        {
            "text": "Laugharne-Pendine Burrows is an area of the site that’s classified as an SSSI and is distinct for its sand dune ecology. Since 2005, DIO ecologists have been working with QinetiQ to implement a detailed programme of conservation management work at Pendine as part of the UK-wide MOD Site of Special Scientific Interest Condition Improvement Project. This project supports the management of the 82,000ha of SSSI across the Defence estate."
        },
        {
            "heading": 2,
            "text": "The re-discovery of the Fen Orchid"
        },
        {
            "text": "In light of these long-term conservation efforts, we were delighted when the Fen Orchid – known as the ‘crown jewel’ of sand dunes – was rediscovered on the burrows by a young botanical enthusiast."
        },
        {
            "text": "11-year-old Tristan Moss was out conducting a survey with the Botanical Society of Britain and Ireland (BSBI) when he spotted a Fen Orchid, in flower and seed, at the beginning of July."
        },
        {
            "text": "Tristan Moss, who found the Fen Orchid. [Copyright Chris Cheffings]Other members of the society then went on to find five further Fen Orchid plants – a spectacular result considering the orchid hadn’t been seen on the site since 2003."
        },
        {
            "text": "What’s more, several other rare species were recorded during the BSBI survey, including the Fragrant Orchid, Dotted Sedge, and Adder’s-tongue Fern."
        },
        {
            "heading": 2,
            "text": "Protecting and enhancing sand dune ecologies "
        },
        {
            "text": "Work to restore the Fen Orchid started with excavations, known as ‘scrapes’, to remove nutrient-rich material from several dune slacks back in 2005. This process helps to reduce competition from more aggressive and invasive plants, and maintains a high water table with periodic flooding in the dune slacks – low lying areas in the dune system which provide habitats for rare and specialist species."
        },
        {
            "text": "In recent years, further carefully planned restoration works have been completed, including scrub clearance and the re-blocking of a large ditch to help restore the sand dunes’ hydrology. Since 2019, the Sands of LIFE (SoLIFE) project, led by Natural Resources Wales, has been responsible for renewed scrub clearance to clear recolonising invasive species and control scrub along the area’s boundary to allow the dune slacks to remain open."
        },
        {
            "text": "Another of the Fen Orchids rediscovered in July. [Copyright Kevin McGinn]The recent recovery of the Fen Orchid represents the culmination of many years of work delivered by DIO and QinetiQ, in partnership with Natural Resources Wales and the Sands of LIFE project. In addition, the support of local volunteers including members of the BSBI has played a vital role. It’s an exciting success story, and a great example of the long-term commitment needed to support nature recovery at wildlife sites throughout the UK."
        },
        {
            "text": "Continuing management will seek to further enhance the habitat at MOD Pendine, to protect the Fen Orchids and encourage the colony to expand in future years. In the meantime, be sure to check our blog regularly for more about the work DIO ecologists are carrying out across the Defence estate."
        }
    ]
}