{
    "url": "https://socialcare.blog.gov.uk/2022/07/28/the-joy-of-homeshare/",
    "title": "The joy of Homeshare",
    "authors": [
        "Deborah Fox"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities"
    ],
    "pub_date": "2022-07-28T08:47:44+00:00",
    "content": [
        {
            "text": "Homeshare programmes across the UK work and support people in their local area to live sociably and affordably, whatever their age. We know that loneliness, living alone and poor social connections are bad for your health, and many people are being priced out of towns and villages, when looking for an affordable place to live. The Homeshare UK team work with our network of providers to tackle these issues, whilst bringing joy to people's lives."
        },
        {
            "heading": 2,
            "text": "Support and kindness"
        },
        {
            "text": "There are 23 Homeshare UK network members delivering programmes across the country. Florence, a 95-year-old householder is partially sighted, an RAF veteran, and used to be a keen tennis player. She has a homesharer called Alexandra. When Florence’s husband died, she “desperately needed company”. She was one of nine million adults in the UK who say they are often, or always, lonely. Homeshare is a way of supporting people to help each other."
        },
        {
            "heading": 2,
            "text": "Life is better when it's shared"
        },
        {
            "text": "Kind gestures and day-to-day practical support are the foundations of sociable living, which underpin the model’s ethos. Homeshare is a simple concept. It brings together people with a spare room with people who are happy to chat and lend a hand around the house in return for affordable, sociable accommodation."
        },
        {
            "text": "There have been a multitude of benefits reported as a result of this model of shared living. For example, 96% of householders reported feeling less lonely since their homesharers moved in and 86% reported feeling happier. Householders feel safer and comforted with an overnight presence in the home and homesharers enjoy giving back to the local community (Homeshare UK, 2021, sector survey)."
        },
        {
            "text": "There can never be a state-driven solution to loneliness, which only personal relationships can remedy, however there are ways in which it can be beneficial to bring professional input to personal interactions. A unique advantage of Homeshare is the matching process, in which the Homeshare programme carefully vets, screens and assesses applicants for compatibility. Company is one thing, but good company is another."
        },
        {
            "heading": 2,
            "text": "Expanding Homeshare"
        },
        {
            "text": "The last two years have posed many challenges for Homeshare, but the innate resilience and flexibility of the model has seen it bounce back and enjoy a steady growth in the number of people choosing to homeshare, rather than more traditional forms of support and housing."
        },
        {
            "text": "Homeshare UK is part of Shared Lives Plus – the UK membership charity for more than 6,000 Shared Lives carers, 150 Shared Lives programmes, and a growing network of Homeshare providers. Our vision is for a kinder, stronger society built around people sharing their lives, skills, and homes."
        },
        {
            "text": "The Homeshare UK team are driving forward an ambitious five-year growth strategy to make this model accessible for all. It will bring locally based Homeshare programmes to many new towns and cities."
        },
        {
            "text": "Our in-house programmes, Homeshare UK North East and Homeshare UK Merseyside, will launch at the end of July 2022. In conjunction with the development of our social franchise model, we are aiming to work with socially-minded individuals, community and voluntary organisations as well as existing social care providers, to establish 40 new Homeshare programmes in locations currently not serviced across the whole of the UK, bringing the joy of support and companionship to many more thousands of people in the coming years."
        }
    ]
}