{
    "url": "https://civilservice.blog.gov.uk/2022/07/28/top-tips-on-delivering-digital-projects-with-global-partners/",
    "title": "Top tips on delivering digital projects with global partners",
    "authors": [
        "Liz Lutgendorff, Liz Lutgendorff, Lead Insight and Analysis Advisor, Government Digital Service"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-07-28T14:18:13+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Digital transformation is hard, but the UK’s Government Digital Service experience helps countries around the world with this challenge."
        },
        {
            "text": "UK expertise in digital and technology transformation is much in demand across the world. Some of the lessons learned from COVID-19 were that everyone had improvements to make when it came to their internal technology and services, and - more importantly - the services and information they provided to citizens, residents and visitors."
        },
        {
            "heading": 4,
            "text": "COVID-19 problems"
        },
        {
            "text": "One of the areas where governments faced challenges was that government technology lacked resilience. Existing online services experienced a huge increase in demand and sometimes could not scale up to meet the increase in traffic. Some critical services weren’t digitised at all, or relied on people being physically present in government offices in order to provide services. "
        },
        {
            "text": "Some countries set up websites to coordinate COVID-19 guidance and information, as many national portals only provide services but not information, unlike GOV.UK which does both."
        },
        {
            "heading": 4,
            "text": "GDS International Team"
        },
        {
            "text": "The Government Digital Service International Team has engaged with other governments since 2016, and most recently with countries such as Singapore, Cyprus, Japan and the Kurdistan Regional Government. We also represent the UK government on digital at multilateral forums such as Digital Nations, the Organisation for Economic Co-operation and Development (OECD) and World Bank. At first, we hosted delegations and talked about our transformation efforts in the UK, but soon we were asked to help even more."
        },
        {
            "text": "In 2019, we decided to see what help we could practically offer and began working with funding partners to help other nations with their digital transformation goals. Even though we were working 100% remotely from 2020, the demand for UK expertise in digital transformation didn’t slow down. "
        },
        {
            "text": "As we start to travel again, we’ve reflected on our top five lessons learned from working on digital transformation projects with governments across the globe."
        },
        {
            "text": "There’s a reason why organisations struggle to make digital projects work when they don’t change anything about how they work themselves. Senior leaders must be more than enthusiasts for digital; instead, they need to be equally ambitious to change how they work as an organisation. Crucially, they need to give their staff time to learn new skills or take on critical digital projects. These sorts of changes can’t be tacked onto existing roles, they need dedicated people to unravel thorny legacy technology and organisational challenges."
        },
        {
            "text": "This often takes the form of spend controls, where a finance ministry or digital agency can scrutinise and make interventions in how the government spends its money. It also involves rethinking what a ministry focussed on government technology might do, moving its function closer to the centre of government to affect systematic, cross-government change. Equally, it requires really close coordination at a cross-ministerial level to make those really important transformation decisions. Clear ownership also needs to be established to implement those ambitions."
        },
        {
            "text": "Most digitally mature countries we’ve talked with over the years have all moved to an agile delivery model. ‘Agile’ means that you prioritise your user needs, testing throughout the development of your product or service, rather than waiting until the very end to test it with users. This helps minimise the risk of building the wrong thing or not delivering the desired outcome, while meeting users' expectations of how a service should work. There’s a whole variety of ways countries manage this, from in-sourcing teams to having strategic supplier relationships, but no matter the arrangement, they always work in an agile way."
        },
        {
            "text": "One thing we’ve learned from reading countless digital strategies is that transformation evolves slowly. It’s measured in decades, not years. So we try to be honest and say how long things will take and that none of it is easy and Governments can be slow to change. Not only do you have to be ambitious, digital agencies or departments have to be prepared for a long-term commitment, constantly challenging the status quo."
        },
        {
            "text": "5. Change happens when you cooperate across organisational boundaries "
        },
        {
            "text": "Collaboration and meeting government objectives, not just departmental objectives, means you can get maximum value from digital transformation. Some agencies hold valuable data that other departments need to streamline their delivery. There needs to be a whole of government approach to making the right decisions to drive user-centred services. By doing so, the potential of big data and automation can be unlocked. No one can succeed alone and collaborative efforts are rewarded with a sustainable digital transformation."
        },
        {
            "text": "We’ve worked best with countries that recognise these five points and commit their time and people to tackling their transformation ambitions. The best thing about working internationally is that it creates a community of people with similar experiences, so we can learn, share knowledge and tackle the next challenges together."
        },
        {
            "text": "Contact the team"
        },
        {
            "text": "Get in touch if you have any questions about our work, or if you want to connect with digital peers in other countries. "
        },
        {
            "text": "We’d also love to hear if you’re working on digital projects with international partners. The civil servants in the countries we work with really value deep expertise in specific sectors, so we can connect them with those departments who can give them the best advice."
        },
        {
            "text": "You can contact us at international@digital.cabinet-office.gov.uk."
        }
    ]
}