{
    "url": "https://ruralpayments.blog.gov.uk/2023/01/18/an-update-on-countryside-stewardship-capital-payment-rates/",
    "title": "An Update On Countryside Stewardship Capital Payment Rates",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2023-01-18T13:00:13+00:00",
    "content": [
        {
            "text": "On 5 January 2023, the Rural Payments Agency (RPA) announced the Countryside Stewardship (CS) Capital grants payment rates for 2023."
        },
        {
            "text": "We have listened to feedback from farmers and landowners and have now amended the scope of the updated payment rates to allow more farmers to benefit from the higher rates."
        },
        {
            "text": "Changes to these payment rates for capital items will now be applied to all CS and SFI pilot capital grant agreements which began on and after 1 January 2023 in addition to all applications for Capital offers that we receive from January 2023 onwards."
        },
        {
            "text": "This widens the number of customers eligible to receive the higher payment rates by nearly five thousand customers.  We will make the changes needed to increase the capital payment rates for these customers as soon as we can."
        },
        {
            "text": "Where your CS or SFI pilot agreement began in 2022 or earlier, customers will receive the payment rates within your agreement when you submit a claim.  ."
        },
        {
            "text": "If your CS or SFI pilot agreement began in 2022 or earlier, you do have the option to withdraw individual capital works from CS agreements which began in 2022 or earlier or to withdraw whole agreements and reapply for them if the works have not been started.  However, you can only withdraw individual options where capital works have not been started or where materials have not already been ordered."
        },
        {
            "text": "If you wish to reapply for these options, then you will be required to source any relevant new endorsements or consents."
        }
    ]
}