{
    "url": "https://civilservice.blog.gov.uk/2023/01/18/cutting-the-queue-at-the-chemist/",
    "title": "Cutting the Queue at the Chemist",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-01-18T09:55:57+00:00",
    "content": [
        {
            "heading": 3,
            "text": "DWP’s data ninjas invent a genius passport benefit checker to instantly solve the pesky issue of whether you qualify for free meds."
        },
        {
            "text": "The winners of this year's Best Use of Data and Technology category at the Civil Service Awards succeeded in addressing a very specific problem: what happens when those collecting medicines are uncertain about whether they pay for their medication?"
        },
        {
            "text": "Team Phoenix, a DWP digital team based in the north-east of England and at DWP's Newcastle digital hub, have sought to make this uncertainty a thing of the past through the piloting and then national rollout of a new Passport Benefit Checking Service."
        },
        {
            "text": "By offering a real-time DWP benefit check at the point of dispensing medication, NHS pharmacies across England are now able to quickly confirm an individual is entitled to free prescriptions."
        },
        {
            "text": "This is a double-win, Jacqui Leggetter explained, after she and her team-mates picked up the award at Lancaster House in London."
        },
        {
            "text": "It's good for those who are a little nervous about claiming their free prescriptions, but it's also good for the taxpayer and the NHS."
        },
        {
            "text": "That's because the £240 million spent each year in administration costs chasing fraud and error can instead go back into healthcare."
        },
        {
            "text": "\"It feels amazing to win,\" Jacqui said. \"It's great recognition for the team - not just for the technology but also the way this project was delivered.\""
        },
        {
            "text": "As well as working within the department, Team Phoenix also had to reach out across government as they rolled out the real-time checks across the north-east."
        },
        {
            "text": "Jacqui added: \"Working with the NHS shows the power of collaboration and the difference it can make to citizens.\""
        },
        {
            "text": "Team Phoenix is primarily an integration engineering team that builds connections across systems, using cutting-edge technology to help citizen data deliver better outcomes for UK citizens."
        },
        {
            "text": "So it is no surprise it came out on top in winning the Best Use of Data and Technology Award, which is for recognising excellence in the application of data or digital technology to solve problems or make improvements that create measurable outcomes."
        },
        {
            "text": "Find out more about the awards and the nominations at www.civilserviceawards.com."
        }
    ]
}