{
    "url": "https://onsdigital.blog.gov.uk/2023/01/18/how-the-new-ddat-academy-is-helping-to-build-our-talent-pipeline-of-business-analysts/",
    "title": "How the new DDaT Academy is helping to build our talent pipeline of business analysts",
    "authors": [
        "soniaunsted"
    ],
    "categories": [
        "Business analysis",
        "DDaT academy",
        "ONS digital people",
        "People and skills"
    ],
    "pub_date": "2023-01-18T17:21:43+00:00",
    "content": [
        {
            "text": "The digital sector talent shortage in the UK is well reported in the news and the continuous DDaT vacancies on civil service jobs suggests there are more roles than there are skilled people to fill them. So how do we bridge this gap?"
        },
        {
            "heading": 2,
            "text": "Introducing the ONS DDaT academy"
        },
        {
            "text": "The Office for National Statistics (ONS) has setup a Digital, Data and Technology (DDaT) Academy to implement talent pipelines to provide opportunities for people from all backgrounds to join the ONS.  We have used a variety of approaches to attract new talent  since the academy was launched 6 months ago, developing a \"grow our own\" programme and welcoming:"
        },
        {
            "text": "This blog focuses on one of the ‘grow our own’ initiatives - the Business Analyst (BA) Development Programme."
        },
        {
            "heading": 2,
            "text": "The ONS Business Analyst development programme"
        },
        {
            "text": "It’s an 18-month programme where participants are recruited for their aptitude to be a BA and join at EO Executive Officer level.  They are paired with an experienced BA and complete three 6-month placements across various technical and business areas to learn about and practice the full range of BA services and skills. We also put them through the BCS International Diploma in Business Analysis."
        },
        {
            "heading": 2,
            "text": "Why are we doing this?"
        },
        {
            "text": "ONS was in an almost constant round of recruiting BA’s and feedback from previous recruitments and our own staff, indicated that people wanted an entry route into this DDaT specialism. This is where the DDaT academy stepped in and, working in collaboration with the Head of Business Analysis Practice and Community of Practice leads, put a proposal together for a BA development programme in July 2022."
        },
        {
            "heading": 2,
            "text": "Learning from other government departments"
        },
        {
            "text": "The ONS digital team has a network of connections with other government departments, and we were aware that the DVLA had run a similar successful scheme. We learnt from their experience and designed a similar programme that suited the requirements of ONS."
        },
        {
            "heading": 2,
            "text": "A great response and result"
        },
        {
            "text": "There were 262 applications for 10 posts and we filled all of them. The cohort started with us on the 5th of December and is a mix of internal and external people, so we’ve got a good blend of existing business knowledge and new perspectives from other experiences and sectors."
        },
        {
            "text": "Their first week was an intensive introduction to the Civil Service, ONS and business analysis, and they were all still smiling at the end of the week. They have now joined their teams and are working on their first projects."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "In true agile fashion, there will be retrospectives on all aspects of this programme. We will take the learnings - the good, the bad and the ugly - and use this knowledge to inform the development of other initiatives on the DDaT Academy launch pad which will be shared in future blogs."
        },
        {
            "text": "If this programme proves to be as successful as early indications are showing, we would love to do it all again in a year’s time until all our BA vacancies are filled."
        }
    ]
}