{
    "url": "https://space.blog.gov.uk/2023/01/18/ignite-space-2023-tickets-now-available/",
    "title": "Ignite Space 2023: agenda now available",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2023-01-18T09:00:37+00:00",
    "content": [
        {
            "text": "Tickets are now sold out for the UK Space Agency's Ignite Space event, which will be held at Aerospace Bristol on Tuesday, 7 March 2023."
        },
        {
            "text": "If you have booked a ticket and can no longer attend, please release it for others on the waitlist. Thank you."
        },
        {
            "text": "The agenda for the day can be seen below."
        },
        {
            "text": " "
        },
        {
            "text": "Ignite Space is an SME-focused event that provides an interactive forum to showcase emerging businesses in the UK space sector and highlights the support available."
        },
        {
            "text": "Get your tickets here: ignitespace2023.eventbrite.com"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Who is Ignite Space for?"
        },
        {
            "text": "All those working in, or who seek opportunities in, the UK space sector are welcome. We especially encourage SMEs in the space sector and businesses from sectors with space-applicable technologies to come along."
        },
        {
            "heading": 2,
            "text": "What can I expect from Ignite Space?"
        },
        {
            "text": "On the day, ‘zones’ will provide interactive spaces for delegates to get involved in discussions and engage with activities. There will be panel sessions on advancing solutions, and discussions around some of the key challenges facing UK businesses in the sector."
        },
        {
            "text": "Each zone will present a mainstage session on topics that will interest and add value to SMEs"
        },
        {
            "heading": 3,
            "text": "Business Zone: How industry and the insurance community are supporting the sector – Innovative changes "
        },
        {
            "text": "The session will include discussion how industry and insurance bodies are supporting SMEs to develop and grow their businesses and supporting the development of new partnerships and regulatory and insurance approaches that benefit industry and position the UK in a leadership role."
        },
        {
            "heading": 3,
            "text": "Clusters Zone: Find Your Place in Space - Regional Clusters and the UK Ecosystem"
        },
        {
            "text": "This session will give you the who, what, where, when, and how of the space clusters that make up our UK space innovation landscape. We will explore lessons to be learned from other sectors, how they support opportunities for collaboration, and how businesses can get involved."
        },
        {
            "heading": 3,
            "text": "Government Zone: How To Pitch Your Space Business for Export"
        },
        {
            "text": "This session will include the opportunities and challenges of international export and discussion will focus on the considerations companies should have in preparing to pitch to potential investors.  It will also signpost the various avenues of support that are available or have been particularly successful."
        },
        {
            "heading": 3,
            "text": "Skills Zone: Igniting your growth through people"
        },
        {
            "text": "This session will introduce the Space Skills Advisory Panel, the new UK Space Agency's Skills lead and their objectives, and the MOD Space Academy. Discussions will explore the future direction for skills and talent needed to support the growth and innovation of the UK space industry, the challenges and how to address them."
        },
        {
            "text": "Delegates will be able to continue the conversation in separate workshops and activities throughout the day. We are also working with the European Space Agency’s Business Incubation Centre and business support provider Anchored In to deliver an Ignite Investment Launchpad Apply- Ignite Investment Launchpad. We are also intending to attract representatives from some of the biggest UK Aerospace companies to Ignite Space to engage with SMEs."
        },
        {
            "text": "We are delighted that TV presenter Dallas Campbell will be our Master of Ceremonies for the day, and back by popular demand, AstroAgency will be hosting their SpaceBar Live at an evening networking session."
        },
        {
            "text": "Delegate tickets are free of charge and are limited so please only book your place if can attend in person. Registration will take place from 08:45 with the keynote speeches from 09:30.  The main event will close by 17:00 and the evening networking will close at 19:30."
        },
        {
            "text": "We look forward to seeing you at Aerospace Bristol for Ignite Space 2023!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Ignite Space 2023 Agenda"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}