{
    "url": "https://openpolicy.blog.gov.uk/2023/01/18/launching-manifest-our-new-initiative-to-evaluate-the-role-of-art-in-policy/",
    "title": "Launching MANIFEST, our new initiative to evaluate the role of art in policy",
    "authors": [
        "Stephen Bennett",
        "Kyna Gourley",
        "Emily Riddle"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2023-01-18T10:26:08+01:00",
    "content": [
        {
            "text": "Policy Lab has an eight year history of testing innovative approaches to policymaking. Central to this story is collaboration between different disciplines, whether they be from the social sciences, sciences, humanities or arts. Some of the methods, such as design and film ethnography, have been increasingly integrated into mainstream policymaking whilst others, such as Collective Intelligence, are still emergent. "
        },
        {
            "text": "In Spring this year we wrote about eleven new methods we consider to be at the forefront of policy innovation. We are pleased to announce the launch of a pilot initiative to test one of these methods. MANIFEST is funded by the Arts and Humanities Research Council (AHRC) to evaluate artistic approaches and effects relevant for policy, and how artists can work with policymakers to channel those dimensions to improve the process of policymaking."
        },
        {
            "text": "The work builds on previous interdisciplinary projects run from Policy Lab. For example in 2019 we created and displayed speculative autonomous marine flags on board RFA Lyme Bay. Around the same time we used physical artefacts to help citizens and policymakers develop better street design whilst in 2018 we borrowed from participatory art to help map interdependencies between critical national infrastructure and satellite services. "
        },
        {
            "text": "Our approach has been informed by the Artist Placement Group (APG), an interesting British innovation from the 1960s and 1970s. The APG was formed in 1966 by artists including Barbara Steveni and John Latham, initially working in the UK’s public and private industries such as National Coal Board and ICI Fibres Ltd. In 1972 Steveni negotiated the Whitehall Civil Service Memorandum with the UK government to expand the role of the APG to government organisations including the Department of Health and Social Security and the Scottish Office."
        },
        {
            "text": "MANIFEST will look to these historical precedents, arranging and supporting placements for artists within policy teams. By doing so we will explore and evaluate whether and how art can play a role in policymaking, including:"
        },
        {
            "text": "We are working with three artists in the first iteration of MANIFEST. Christopher Samuel is a multi-disciplinary artist whose practice is rooted in identity and disability politics, often echoing the many facets of his own lived experience. Seeking to interrogate his personal understanding of identity as a disabled person impacted by inequality and marginalisation, Christopher responds with urgency, humour, and poetic subversiveness within his work. This approach aims to make his work accessible to a wider audience, allowing others to identify and relate to a wider spectrum of human experience."
        },
        {
            "text": "Semiconductor is UK artist duo Ruth Jarman and Joe Gerhardt. Over twenty years they have become known for an innovative body of work, which explores the material nature of our world and how we experience it through the lenses of science and technology. They occupy a unique position in the art world, blending, in philosophically compelling ways, experimental moving image techniques, scientific research and digital technologies."
        },
        {
            "text": "Dryden Goodwin through drawing, film and sound, explores individual and group identities and narratives, the infrastructure of the city and its effect on human dynamics. His work uses still and moving image, sound and installation, in galleries and public spaces, centring on people’s personal, social and working lives. Contexts include transport networks, hospitals, airports and prisons - seeking to capture people’s physical appearances and reflect upon aspects that remain out-of-sight - revealing desires, philosophies, vulnerabilities, experiences and motivations."
        },
        {
            "text": "A range of other partners have been critical to getting MANIFEST off the ground. King’s College London has provided curatorial and programmatic support to bring a connection to academic research. CVAN England, as a national network for contemporary arts, has supported the development and approach to commissioning and used its network and knowledge to access artists across the country. The University of the Arts London are working on the evaluation of the pilot programme. Finally, the Civil Service Policy Profession Unit has supported the programme within government and provides access to resources and networks across the wider profession of 32,000 policymakers in government."
        },
        {
            "text": "Kristine Zaidi, Associate Director of Programmes at the AHRC said: “I am very excited to see the launch of MANIFEST, a programme that will test new methods to push the boundaries of innovation in policy. I am confident that the pilot will help us better understand how creativity can improve the way decisions are made and demonstrate the power of artistic approaches”."
        },
        {
            "text": "Do you think cross-disciplinary artistic practices could help your team develop more effective, resilient and engaging policy? If so please get in touch. We would love to work with more teams across the public sector as we continue to test and evaluate different models for policy innovation and improving the effectiveness of public services. "
        },
        {
            "text": "Image of Dryden Goodwin updated 10am Wednesday 18 Jan 2023"
        }
    ]
}