{
    "url": "https://onsdigital.blog.gov.uk/2023/01/18/the-business-analysis-mindset-are-we-born-or-are-we-made/",
    "title": "The business analysis mindset – are we born or are we made?",
    "authors": [
        "chrispenner"
    ],
    "categories": [
        "Business analysis",
        "DDaT academy",
        "ONS digital people",
        "People and skills"
    ],
    "pub_date": "2023-01-18T10:31:17+00:00",
    "content": [
        {
            "text": "This is aimed at an audience thinking of going into the Business Analysis (BA) profession, rather than someone who is already established in their career."
        },
        {
            "heading": 2,
            "text": "Where do business analysts come from?"
        },
        {
            "text": "It is my experience that business analysts rarely (though there are exceptions) come from nowhere; they usually emerge either from within a business function where they have been at the sharp end of business process, or they come from the technical function where they have been engaged in building and supporting business applications. Let’s call these Business Stream BAs and Technical Stream BAs."
        },
        {
            "heading": 2,
            "text": "Asking “why?” more often than others"
        },
        {
            "text": "I came up through the business stream. If you are like me, you will have realised that you were gravitating towards the technical side of your job. You probably spend more time than your colleagues working out how you can improve the day to day, create tools to help everyone do their jobs in things like spreadsheets, ask “why” more often than everyone is comfy with, and you are trying to understand the context in which you work so that you can de-clutter it and do the fun bits of your job better. You may have found yourself becoming a subject matter expert in the systems and processes around you and are finding yourself drawn towards business change programmes where you can make things better."
        },
        {
            "text": "If you are from the technical stream you will have worked on a few application development or enhancement projects and found that your interest was not so much how to solve the tricky logical code problem in front of you, but in how the thing you are building is actually going to be used. You will have searched out users to have a chat, tried to understand the business context of what you are doing and probably made suggestions to make your product more useful. You will have looked over the top of your silo and seen that there might be different or better ways of doing things, and you will find yourself interested in projects where you can make a difference and impact more of the links in the software development or Agile lifecycle."
        },
        {
            "heading": 2,
            "text": "The business analysis mindset"
        },
        {
            "text": "Wherever they come from what links these two types of BAs is a strong business analysis mindset, and you can see some of the themes of this emerging from the previous paragraphs. So what is a business analysis mindset? From our point of view, when entering the profession it really helps if you come with at least some of the following:"
        },
        {
            "text": "Many of the above can be taught, but you will already know if that is the kind of thing that gets you up in the morning. If you have this as a baseline then there are lots of routes into business analysis where you can build up a toolkit of techniques which will help you become awesome at what you do."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "So, how to take your next steps? Many departments are adopting a grow-your-own strategy to technical skills so look at what is going on in your own DDaT business analysis function – for instance at the ONS we have started a programme for entry level business analysts to learn on the job. Also, it is worth volunteering within your own organisation to get more involved in change projects and build both your skill set and exposure."
        }
    ]
}