{
    "url": "https://defencedigital.blog.gov.uk/2023/01/18/the-top-3-things-you-need-to-know-about-d2s-in-2023/",
    "title": "The top 3 things you need to know about D2S in 2023",
    "authors": [
        "Hayley P"
    ],
    "categories": [
        "Digital Foundry"
    ],
    "pub_date": "2023-01-18T13:22:41+00:00",
    "content": [
        {
            "text": "Over the past year, the Defence DevSecOps Service (D2S) has focused on delivering value for our users and the wider Defence community. "
        },
        {
            "text": "As the D2S Service Owner, I am proud of what we have accomplished in partnership with our user community. We always knew that launching a new service would be tough; a DevSecOps service is not novel, not for industry nor for other parts of Defence, but as an enterprise-wide solution, it is unique for Defence. We’ve faced many obstacles and we’ve learned a lot which we can take forward as we develop the service. "
        },
        {
            "text": "As we look ahead to 2023, I am so excited to share some upcoming milestones and reflect on our progress. Although I don’t have a crystal ball, I am confident that D2S will continue to deliver valuable solutions for our users and the Defence community."
        },
        {
            "heading": 2,
            "text": "D2S Impact in 2022"
        },
        {
            "text": "As I reflect on what we have achieved over the last year, the key things that stand out are:"
        },
        {
            "heading": 2,
            "text": "Top 3 things to know about D2S in 2023:"
        },
        {
            "text": "1. Public Beta Launch of the D2S platform at OFFICIAL"
        },
        {
            "text": "In early 2023, D2S will be moving into public beta which means we will be opening our friendly door to more application teams for Defence teams and their industry partners. To enable this, and to fulfil one of our principles on easy adoption, we have created a Self Serve Portal. "
        },
        {
            "text": "2. Self Serve Portal Launch"
        },
        {
            "text": "The Self Serve Portal has been designed and co-created with our users to deliver an excellent user experience. Currently delivered as an MVP for the Developer and Team Leader journeys, it will allow the user to navigate their way through the onboarding process without manual intervention. Users will find all the information they need on the service and it will allow users to sign-up, view learning and access the D2S platform all in one place. This new addition will provide significant value to our users by reducing onboarding times from 10 days to just 48 hours."
        },
        {
            "text": "3. Discovery for D2S at Deployed"
        },
        {
            "text": "We’ll also be kicking off a discovery activity to understand the user needs in Defence for DevSecOps in the deployed space. During our engagements with the Front Line Commands in Defence, this was flagged as a current pain point so we are keen to explore how D2S might be able to meet this need. If you are interested in taking part, please contact the team."
        },
        {
            "heading": 2,
            "text": "Looking Ahead"
        },
        {
            "text": "As D2S moves towards public beta and beyond, we are likely to face more hurdles as we open the door to more users. But there will also be greater opportunities for collaboration, re-use and improvement of D2S. And we can’t wait to continue meeting our users’ needs for a pan-Defence DevSecOps service."
        },
        {
            "text": "Please contact the D2S team if you would like to register your interest in the above opportunities and discuss what they could mean for your application teams. You can find out more about D2S on our Service Page. "
        },
        {
            "text": "Thank you to everyone that has been involved in our journey so far – the future is very bright. "
        }
    ]
}