{
    "url": "https://educationhub.blog.gov.uk/2023/01/18/ucas-applications-deadline-what-you-need-to-know/",
    "title": "UCAS applications deadline – what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2023-01-18T11:07:33+00:00",
    "content": [
        {
            "text": "The deadline for UCAS applications is fast approaching. Here we provide everything you need to know about UCAS applications."
        },
        {
            "heading": 3,
            "text": "When is the UCAS application deadline?"
        },
        {
            "text": "The deadline for most undergraduate UCAS applications is 6pm UK time on Wednesday 25 January 2023, which is one day earlier than last year. This deadline is known as the ‘equal consideration’ deadline."
        },
        {
            "text": "The equal consideration deadline means course providers must consider all applications received by this time equally. Universities and colleges do not have to consider applications received after the deadline, although they can if they have spaces available once the on-time applications have been considered."
        },
        {
            "text": "If you were thinking of applying to Oxford or Cambridge or a medicine, dentistry or veterinary course, then the deadline was 15 October 2022 for 2023 entry."
        },
        {
            "text": "If you are unsure of when the deadline for your course is, you can use UCAS’ search tool: Search - UCAS."
        },
        {
            "heading": 3,
            "text": "What’s included in a UCAS application?"
        },
        {
            "text": "When filling out your application, it’s important to read through each section clearly."
        },
        {
            "text": "Courses have different entry requirements that you need or that you are working towards in school or college. You can check these in the UCAS course finder tool."
        },
        {
            "text": "You will need your:"
        },
        {
            "text": "If you are due to take exams in 2023, more information on the examination process this year can be found here: Exams in 2023 – everything you need to know - The Education Hub (blog.gov.uk)."
        },
        {
            "text": "Further information on the university application process can be found here: Applying to University - learn about everything involved (ucas.com)."
        },
        {
            "heading": 3,
            "text": "What happens if I change my mind about my course after I’ve applied?"
        },
        {
            "text": "If you have changed your mind about your choices, you may be eligible to apply for different course or university through UCAS Extra."
        },
        {
            "text": "UCAS Extra is another chance for you to gain a place at university or college, between 23 February and 4 July."
        },
        {
            "text": "It’s available for prospective students who included five choices on their application, have received decisions from all five, and weren’t accepted, or if they declined the offers they received."
        },
        {
            "text": "More information on UCAS extra is available here: UCAS Extra | No Offers? Add More Choices With Our 'Extra' Service."
        },
        {
            "heading": 3,
            "text": "What about Clearing – can I apply for a place through Clearing now?"
        },
        {
            "text": "Not yet. Clearing comes later in the year so if you want to go to university it’s important to focus on your UCAS application now. From 5 July – 17 October 2023, you can apply for a course using Clearing if you’re not already holding an offer from a university or college, and the course still has places."
        },
        {
            "text": "You can use Clearing if:"
        },
        {
            "text": "You can find out more about clearing here: Clearing | UCAS."
        }
    ]
}