{
    "url": "https://valuationoffice.blog.gov.uk/2023/01/18/updating-your-property-details-correctly/",
    "title": "Updating your property details correctly",
    "authors": [
        "Kevin Pound - Head of Valuation Assurance"
    ],
    "categories": [
        "Business Rates",
        "Digital"
    ],
    "pub_date": "2023-01-18T16:16:57+00:00",
    "content": [
        {
            "text": "You can tell us if you have made changes to your business property or if you think your rateable value is too high. "
        },
        {
            "text": "This process is called a Check. You can do a Check yourself or you can appoint an agent to do it for you. "
        },
        {
            "text": "If you make a Check there are some important things to keep in mind so you give us the correct information. You will find out more about these below.  "
        },
        {
            "text": "Common mistakes "
        },
        {
            "text": "We randomly review cases where a Check has been made.  "
        },
        {
            "text": "We have found some common mistakes that people make when updating the details we have about their property.  "
        },
        {
            "text": "These can include providing incorrect information about a property’s: "
        },
        {
            "text": "Here we tell you more about these common mistakes so you can avoid making them yourself.  "
        },
        {
            "text": "Rooms and their size "
        },
        {
            "text": "Around half of all incorrect information provided at Check relates to the confirmation of the number of rooms and their size.  "
        },
        {
            "text": "Our inspections have also uncovered examples of alterations and extensions that have not been declared. "
        },
        {
            "text": "Heating and air conditioning "
        },
        {
            "text": "Almost one in five inaccurate confirmations at Check relate to heating or air conditioning.  "
        },
        {
            "text": "This could be incorrectly removing heating from the survey data when the property is still heated. Another mistake is failing to declare heating when it has been installed. "
        },
        {
            "text": "Shop widths "
        },
        {
            "text": "The shop width is the wall-to-wall measurement taken across the shop.  "
        },
        {
            "text": "A common error occurs when the measurement is incorrectly taken to the internal fittings. "
        },
        {
            "text": "Car parking "
        },
        {
            "text": "We’ve found cases where the number of car spaces confirmed at Check has been fewer than the number on site. Sometimes parking spaces have been redeveloped.  "
        },
        {
            "text": "If a parking space has become something different, such as an extension or a new property, this should be explained as part of the Check submission.   "
        },
        {
            "text": "Floor levels "
        },
        {
            "text": "An unexpected error relates to the confirmation of correct floor levels in offices. In the UK, the floor that is level with the ground is the ground floor. But in other countries this is referred to as the first floor. "
        },
        {
            "text": "Other "
        },
        {
            "text": "There are a range of other issues we’ve identified where errors can occur. Many of these relate to industrial buildings. These include failing to declare things like: "
        },
        {
            "text": "Why we need the right information "
        },
        {
            "text": "We need the right property information from our customers so:  "
        },
        {
            "text": "We regularly review a random sample of cases. "
        },
        {
            "text": "Where we believe we may have been given inaccurate information, we will inspect a property.  "
        },
        {
            "text": "We take action to correct rateable values if they’ve been reduced based on inaccurate information. This includes backdating increases where appropriate.  "
        },
        {
            "text": "We need to treat all ratepayers fairly. This is so that those who follow the requirement to provide correct information are not disadvantaged over those who do not. "
        },
        {
            "text": "There are cases where the person making the Check has changed our data or has provided information that has later been found to be incorrect.  "
        },
        {
            "text": "We work from the assumption that ratepayers or their representatives will not knowingly want to do the wrong thing.  "
        },
        {
            "text": "We want to help you provide the right information in the first place. However, where we find errors we will take corrective action and we will not accept any deliberate non-compliance. "
        },
        {
            "text": "Using an agent "
        },
        {
            "text": "Regulation requires the person making a Check confirm that the information we hold about the property is accurate and up to date.  "
        },
        {
            "text": "If you use an agent to do a Check it is your responsibility to make sure the information they provide is accurate.  "
        },
        {
            "text": "If the information an agent provides is not accurate, you might have to pay a penalty and pay any additional rates you owe. "
        },
        {
            "text": "Find out more "
        },
        {
            "text": "Watch our video on how we measure properties for business rates. https://www.youtube.com/watch?v=J1eeK9cuIEs  "
        },
        {
            "text": "Watch our video on how we use retail zoning for business rates. "
        },
        {
            "text": "https://www.youtube.com/watch?v=xyvM0HfVHrY "
        },
        {
            "text": "You can read more about appointing an agent for business rates. You can manage your business rates yourself. You do not have to use an agent or ask someone to help you. "
        },
        {
            "text": "https://www.gov.uk/guidance/appoint-an-agent  "
        },
        {
            "text": "We have information about the release in November 2022 of the updated rateable values of all business, and other non-domestic, property in England and Wales. These future rateable values will take effect from 1 April 2023. "
        },
        {
            "text": "https://www.gov.uk/government/news/business-rates-revaluation-2023 "
        }
    ]
}