{
    "url": "https://despatch.blog.gov.uk/2025/03/25/an-update-on-customer-account-managers-now-and-in-the-future/",
    "title": "An update on customer account managers now and in the future ",
    "authors": [
        "Leighton Burman"
    ],
    "categories": [
        "Motorcycle trainers",
        "Uncategorized",
        "Vocational trainers"
    ],
    "pub_date": "2025-03-25T13:23:31+00:00",
    "content": [
        {
            "text": "DVSA introduced Customer Account Managers in response to vocational and motorcycle training providers saying they needed a better way to communicate with DVSA. The role started in October 2021.   There have been some changes since they were introduced. So, this seems a good opportunity for an update. "
        },
        {
            "heading": 2,
            "text": "A new head account manager  "
        },
        {
            "text": "One of the recent changes to the team has been my recent appointment as head account manager, so allow me to introduce myself.   I've been in the role for a couple of weeks, but I’ve been with DVSA since 2017. I started out as a Vehicle Standard Assessor inspecting HGVs, PSVs and dangerous goods vehicles for their annual test. I then held a number of leadership roles, before starting this role.As you can imagine, I’m still finding my feet and am looking forward to the challenge. One of the first things I want to do was to make sure you all understand what the team does and how we can support you and your business. "
        },
        {
            "heading": 2,
            "text": "We are here to help  "
        },
        {
            "text": "The team and I are your main point of contact for any business customer enquiries. This could be from something as simple as a query about using our booking system, but we can also help with: "
        },
        {
            "heading": 2,
            "text": "Helping us improve  "
        },
        {
            "text": "We are always looking for ways to improve the service we offer and would love you to tell us what we could do better. One of the easiest ways to do this is to complete the regular customer satisfaction surveys. This is a chance for you to tell us what you think about the service DVSA provides and led to the original introduction of customer account managers.  "
        },
        {
            "text": "Many of you have completed the current survey already, but if you’ve not had your say yet you can find the survey using the right link below: "
        },
        {
            "text": "The deadline is 31 March 2025. It’s really important to hear back from you so we can continue to improve the service we offer.  We have exciting plans for the year ahead and beyond, focused on being visible and accessible to you. But you can use the surveys to let us know what you’d like to see.  "
        },
        {
            "heading": 2,
            "text": "Contacting your customer account manager "
        },
        {
            "text": "I hope that all vocational trainers will know their local customer account manager and are already in regular contact with them. "
        },
        {
            "text": "As the team has not been supporting motorcycle trainers for as long, some of you might not have had the chance to meet your customer account manager or even find out who they are. If that’s the case, then please have a look through the table below;  "
        },
        {
            "text": "To contact the team or to find out which area you are covered by please send an email using the addresses below. The inboxes are monitored daily.  "
        },
        {
            "heading": 2,
            "text": "What are our plans for the year ahead?  "
        },
        {
            "text": "We are currently working on a programme of visits to enable us to see as many trainers as possible. We want to continue to develop strong client relationships with you through regular contact.  We will also be focusing more on the monitoring of trainer booking and work with individual trainers to look at how you are using the system in line with the booker agreements. Your local account manager will be in touch soon to demonstrate how this data can improve our joint performance and give better access to test availability for all.  The next 12 months are shaping up to be busy for the customer account manager team and I am determined that we will continue to support you and your businesses moving forward."
        }
    ]
}