{
    "url": "https://stratcommand.blog.gov.uk/2025/03/25/from-hands-on-problem-solver-to-strategic-infrastructure-leader/",
    "title": "From hands-on problem solver to strategic infrastructure leader",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-03-25T09:03:02+00:00",
    "content": [
        {
            "text": "Gary Ireland shares his journey from hands-on estate management to leading long-term projects."
        },
        {
            "text": "Interviewer: Can you tell us about your current role and responsibilities within the Infrastructure Team?"
        },
        {
            "text": "Gary: I’m Gary Ireland, and I work in Strategic Command Infrastructure (Infra) as part of the Major Projects and Programme (MPP) Team. My focus is looking at Strategic Command Sites in Bedfordshire and Cambridgeshire."
        },
        {
            "text": "Interviewer: How did you start your career in infrastructure?"
        },
        {
            "text": "Gary: My journey into infrastructure stems from my previous role before joining Strategic Command’s Infra Team. I worked in Defence Infrastructure Organisation (DIO) as an Estate Facilities Manager, handling infrastructure on a day-to-day basis. My responsibilities included supporting Army establishments with issues such as fixing heating problems and managing delivery tasks on site."
        },
        {
            "text": "That hands-on experience gave me a strong background in infrastructure. Eventually, I joined Strategic Command Infra as part of the Optimisation Team. From there, I seized the opportunity to move into my current role, which aligns better with my experience and interests."
        },
        {
            "text": "The transition has been a learning curve. Previously, I focused on day-to-day operational issues, but now, in the MPP Team, I’m tackling large-scale, long-term projects. It’s been a fascinating shift."
        },
        {
            "text": "Interviewer: You mentioned your work on MPP. Are there other projects you’re involved in?"
        },
        {
            "text": "Gary: Yes, I’m also the Infra Lead for a transformation project, which involves relocating units from Greater London to Cambridgeshire. Currently, the Cambridgeshire site is undergoing major refurbishment."
        },
        {
            "text": "Interviewer: That must have been a proud moment—seeing a project go from planning to reality."
        },
        {
            "text": "Gary: It certainly was! Walking past the site now and seeing the progress is incredibly rewarding. It’s satisfying to know that I’ve been part of making it happen."
        },
        {
            "text": "The nature of infrastructure projects means it can take years to see tangible results, but that’s part of the journey. Moving from daily operations to long-term initiatives has been fulfilling, and I’m excited about the challenges ahead. It’s rewarding to know these projects will have a lasting impact for years to come."
        },
        {
            "text": "Interviewer: What common misconception would you like to dispel about Defence infrastructure projects?"
        },
        {
            "text": "Gary: A lot of people see infrastructure projects as just providing buildings and places for military personnel to live or work. But it’s much more than that. It’s about ensuring that the spaces we create are safe, compliant, and meet the users’ needs for years to come."
        },
        {
            "text": "A key part of my job is working with customers to capture their requirements. This involves sitting down with them, understanding their needs, and making sure the assets they receive are fit for purpose. It’s a collaborative process, not just about bricks and mortar."
        },
        {
            "text": "Interviewer: What would you say to someone considering a role in infrastructure projects within Strategic Command?"
        },
        {
            "text": "Gary Ireland: It’s a role where you truly learn on the job. It’s collaborative and people-focused—understanding needs and figuring out how to deliver on them."
        },
        {
            "text": "Infrastructure work is unpredictable, and that’s part of its appeal. Every project brings its own challenges, but the key is how you engage with those challenges and find solutions."
        },
        {
            "text": "It’s a dynamic field where you’re constantly learning. While it can be tough at times, reaching a milestone or completing a project is incredibly rewarding. One of the things I enjoy most is getting a glimpse behind the curtain and seeing how everything comes together."
        }
    ]
}