{
    "url": "https://defraenvironment.blog.gov.uk/2025/03/25/government-publishes-first-pesticides-national-action-plan-in-a-decade/",
    "title": "Government publishes first Pesticides National Action Plan in a decade ",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Chemicals and pesticides",
        "Pollinators"
    ],
    "pub_date": "2025-03-25T15:06:40+00:00",
    "content": [
        {
            "text": "Last week, the Government published the Pesticides National Action Plan, the first in a decade. The Action Plan sets out a clear direction for the sustainable future of pesticide use in the UK. "
        },
        {
            "text": "Pesticides play an important role in protecting our crops, supporting food production, preserving our natural landscapes and maintaining important public spaces such as our roads and sports pitches. However, overuse or incorrect use of pesticides can contribute to the loss of vital biodiversity and can cause risks to human health.  "
        },
        {
            "text": "We have already committed to taking decisive action to protect bees and other pollinators by ending the use of three bee killing neonicotinoids —clothianidin, imidacloprid, and thiamethoxam – in England. The publication of the Action Plan presents another step in protecting our environment and promoting food security for the future.  "
        },
        {
            "text": "The Action Plan sets out how all four UK governments will support farmers, growers and other land managers to increase their use of nature-based techniques, reducing the potential harm from pesticides, while still controlling pests effectively.  "
        },
        {
            "text": "The Plan has three key objectives:  "
        },
        {
            "text": "We’ve explained these objectives in more detail in the sections below. "
        },
        {
            "text": "Integrated Pest Management  "
        },
        {
            "text": "Integrated pest management (known as IPM) is a holistic and sustainable approach that uses all available methods to prevent, monitor, and control pests, weeds and diseases, which can help to reduce the need for conventional pesticides. We recently published guidance for farmers and growers to help them use IPM in their work.  "
        },
        {
            "text": "Innovation is key to make sure farmers and growers have the most effective IPM tools at their disposal. We have already committed £150 million for industry-led research and development via the Farming Innovation Programme. In the Action Plan, we outline how we will make it easier to get biopesticides – which tend to be lower risk than chemical pesticides – to market and support innovation in precision application – including the use of drones.   "
        },
        {
            "text": "A UK target for reduction of pesticides  "
        },
        {
            "text": "We are introducing a domestic reduction target for pesticides in the UK, to reduce the potential harm caused by pesticides to the environment by at least 10% by 2030. The actions in the National Action Plan set out how we will deliver against this aim while supporting food production.  "
        },
        {
            "text": "Our target is measured using the Pesticide Load Indicator, which is a UK-specific metric made up of 20 different indicators, and the target requires a 10% reduction against each.  "
        },
        {
            "text": " These indicators include measures of both acute and chronic harm across 10 different species, as well as measures of how a pesticide behaves in the environment. By driving action across these measures, we are taking a holistic approach rather than, for example, making progress on reducing potential harm to fish but not paying attention to bees. "
        },
        {
            "text": "Our target must drive sustainable change. Achieving this will require action by Government, manufacturers, and farmers and growers. The package of actions outlined in the National Action Plan are designed to deliver this action. "
        },
        {
            "text": "For more information, you can read the GOV.UK target explainer.   "
        },
        {
            "text": "Supporting safe pesticide use  "
        },
        {
            "text": "We want everyone using pesticides to do so safely and responsibly. "
        },
        {
            "text": "We'll help people understand the legal rules for using pesticides - from safe storage to equipment maintenance - through updated guidance. "
        },
        {
            "text": "We'll also use information from inspections and other sources to provide targeted support to pesticide users. "
        },
        {
            "text": "For more information on the safe use of pesticides you can read the HSE code of practice, and if you are a professional pesticide user you can watch our video on how to register as a professional user of plant protection products. "
        },
        {
            "text": "Read the full Action Plan for more information "
        },
        {
            "text": "The National Action Plan will help support a sector where restoring nature is not in competition with the sustainable production of food, but is essential to it. "
        },
        {
            "text": "For more information on everything we’ve mentioned above, read the UK Pesticides National Action Plan itself.  "
        }
    ]
}