{
    "url": "https://mattersoftesting.blog.gov.uk/improving-mot-site-reviews-heres-what-you-need-to-know/",
    "title": "Improving MOT site reviews – here’s what you need to know ",
    "authors": [
        "Chris Price"
    ],
    "categories": [
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2025-03-25T10:20:11+00:00",
    "content": [
        {
            "text": "This blog provides an update from our MOT Enforcement team on changes we are making to our reviews process from 1 April 2025.The lion’s share of our work is targeted enforcement. This is led by intelligence sent to us from garages and the public, and data from assessing MOT garages. This assessment is known as a “site review” – which can either be onsite or offsite. We’ve done site reviews for many years. It helps us to keep test stations operating as they should and allows us to “risk rate” – helping us target our efforts at garages that are most likely to have problems. The site review process also provides opportunity for advice and guidance."
        },
        {
            "heading": 2,
            "text": "Changing onsite reviews"
        },
        {
            "text": "For most garages, we will do an onsite review. However, these full onsite reviews can be time-consuming for our examiners and your teams. They don’t always tell us if vehicles tested are receiving the correct result, which is the most important bit."
        },
        {
            "text": "With that in mind, we’re amending onsite reviews to make the process a bit slicker. This will help us focus on improving poorly performing garages and minimising disruption to your businesses. "
        },
        {
            "heading": 2,
            "text": "What has changed?"
        },
        {
            "text": "Following a review and with feedback from industry, we are changing the onsite review to a more basic compliance check.  We will still be visiting garages for these, but rather than doing a deep dive into the systems and processes of running the garage, our aim is to focus more on the test results."
        },
        {
            "heading": 3,
            "text": "Why we're making these changes to site reviews"
        },
        {
            "text": "The change means less preparation time for garages and less time undertaking onsite reviews for us. This means we can visit more garages and provide support.  For Authorised Examiners (AEs), streamlining this should mean our visits are less disruptive, focusing on managing the quality of testing in garages. At a minimum we will check that: "
        },
        {
            "heading": 3,
            "text": "Streamlining our approach "
        },
        {
            "text": "Of course, we still expect good systems to be in place to manage people, quality control and the site. These are the basics that help ensure good quality MOT standards. So we may assess these to make sure they’re in place, checking that managers are taking this responsibility seriously. Where garages don’t provide information or have adequate systems, we will take action. "
        },
        {
            "text": "Our streamlined approach means we can carry out this basic compliance check whenever we visit a Vehicle Testing Station (VTS). Even if we are there to sign off a new tester or carry out an appeal, we can quickly check the site is well-run.  "
        },
        {
            "text": "This new approach does not mean a reduction in the support we give to garages. In fact, with more focus on the test we hope that our examiners will be able to support and advise garages even more. "
        },
        {
            "heading": 2,
            "text": "Off-site review to “VTS Self Assessments” "
        },
        {
            "text": "Where garages have a positive record with DVSA, in some cases we will conduct an offsite review instead of visiting the garage."
        },
        {
            "text": "Following AE feedback, we are making some changes to the offsite review  which will now be know as a “VTS Self Assessment”.   "
        },
        {
            "heading": 3,
            "text": "Moving to a self assessment form"
        },
        {
            "text": "As you may know, offsite reviews are currently carried out by phone calls. Often, the designated staff member isn’t available or the timing of the call is inconvenient resulting in a poor assessment for the VTS or it being cancelled.  "
        },
        {
            "text": "To correct this, we will now email a self-assessment form to the nominated Authorised Examiner Designated Manager (AEDM). They will have 14 days to return the form, which DVSA will assess. This will make the process more flexible.  "
        },
        {
            "text": "If there is no cause for concern this will result in no further action or where we have serious queries, it could trigger an on-site follow up visit.  "
        },
        {
            "text": "This change will also help free up examiners to focus on other areas that demand their attention, such as new tester signoffs and garage approvals. It will provide more education and advice where needed and allow us to take action on non-compliant garages, so that MOT testing remains a level playing field for all.  "
        },
        {
            "heading": 2,
            "text": "Lowering the disciplinary points threshold so points don’t make surprises! "
        },
        {
            "text": "When we were researching what changes to make, we found that some low-level cases (where minor non-compliances were found through some type of DVSA visit or investigation) could have been resolved with advice and education. "
        },
        {
            "text": "To solve this, we are increasing the threshold for triggering consideration of  disciplinary action from 30 to 40 points from 1 April 2025.   "
        },
        {
            "text": "This helps us identify the best course of action and consider whether additional training is needed before we escalate matters to a disciplinary case. "
        },
        {
            "text": "Our aim is to foster a culture where we can help rectify issues and learn from them, rather than always taking action.  Any common areas for retraining we identify will help us prepare better training materials for all VTSs.  "
        },
        {
            "heading": 2,
            "text": "Fit for the future  "
        },
        {
            "text": "These changes will allow you to improve the quality of the test for your customers, identify issues as they arise, and help us to help you when we’re on-site.  "
        },
        {
            "text": "We know that your priority will be to provide the best service possible to your customers and make sure their vehicles are safe to drive, and we want to help you maintain the high standards that you strive for.    "
        },
        {
            "text": "However, this doesn’t mean DVSA won’t take enforcement action if we identify material issues, especially if they reoccur.  "
        },
        {
            "text": "By focusing on support and streamlining these reviews, we can make the process quicker and provide exactly what’s needed – allowing us to concentrate on solving problems and for you to focus on running the garage well.  "
        }
    ]
}