{
    "url": "https://vets.blog.gov.uk/2025/03/25/join-us-for-a-lunch-and-learn-session-about-working-in-gvs/",
    "title": "Join us for a Lunch and Learn session about working in GVS",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services",
        "Professional development"
    ],
    "pub_date": "2025-03-25T15:50:54+00:00",
    "content": [
        {
            "text": "Have you ever wondered what roles there are for vets in government? "
        },
        {
            "text": "Did you know vet roles exist in 9 government departments? "
        },
        {
            "text": "Join us for a conversation with Government Veterinary Service (GVS) colleagues on Tuesday 22nd April 12:30-13:15, to hear an overview of their careers and their hopes for the future of GVS. "
        },
        {
            "text": "This is a great opportunity to ask questions and have a discussion, including picking up tips about getting into the GVS and understanding some of the challenges or opportunities about working in GVS. "
        },
        {
            "text": "Our panellists include "
        },
        {
            "text": "Jorge Martin-Almagro is the Deputy Chief Veterinary Officer for international and trade affairs in the Department for Environment, Food and Rural Affairs (Defra). "
        },
        {
            "text": "Lévon Stephan is a Senior Veterinary Advisor and Assessor in the UK Office for Sanitary and Phytosanitary Controls (SPS), in Defra, where he provides veterinary advice and assessment of animal health, welfare and veterinary public health to the UK. "
        },
        {
            "text": "Fin Twomey is the Head of the Animal and Plant Health Agency (APHA) Surveillance Intelligence Unit, with responsibility for Scanning Surveillance across a wide range of species, including farmed and wildlife, in England and Wales. "
        },
        {
            "text": "Natalie Sampson is the Head of Veterinary Advisory Services, UK & International Affairs Directorate at the Food Standards Agency (FSA). She is also a council member at the Veterinary Public Health Association. "
        },
        {
            "text": "This session can count as part of our CPD, so remember to log it!"
        },
        {
            "text": "Contact gvs@defra.gov.uk if you would like more information!"
        }
    ]
}