{
    "url": "https://ukhsa.blog.gov.uk/2025/03/25/priority-pathogens-the-disease-families-which-require-urgent-scientific-research/",
    "title": "Priority Pathogens: The disease families which require urgent scientific research",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health security"
    ],
    "pub_date": "2025-03-25T09:54:22+01:00",
    "content": [
        {
            "text": "The UK Health Security Agency (UKHSA) was set up to protect health from infectious diseases and environmental hazards. We prepare for future threats to prevent health and socioeconomic impacts and although there are hundreds of pathogens that can cause disease in humans, we now are in a better position than ever thanks to increased development of diagnostics, therapeutics and vaccines (DTVs). "
        },
        {
            "text": "There is always more that we can do, and we are not alone in this fight, the scientific community, which includes partners from academia and industry, play a vital role in boosting our resilience through increased research and development into DTVs – addressing any gaps we might have in our knowledge."
        },
        {
            "text": "But how do scientists know which infectious diseases to focus on? Attempts to ‘prioritise’ pathogens have become even more common since the Covid-19 pandemic, and lists generated by the likes of the World Health Organization (WHO) and the Coalition for Epidemic Preparedness Innovations (CEPI) are helping to support the co-ordination of global preparedness efforts."
        },
        {
            "text": "UKHSA has now published its own perspectives. Through its Priority Pathogen Families reference tool, the agency is highlighting 24 pathogen families where it believes further research is most needed in the interests of biosecurity – uniquely, this tool includes pathogen families of a global concern, as well as those already impacting on the nation’s public health (endemic disease).  "
        },
        {
            "text": "In this blog post we take a look at the new Priority Pathogen Families reference tool and how it will help focus and guide preparedness efforts against some of the top threats to public health."
        },
        {
            "heading": 2,
            "text": "What the priority pathogen list is for"
        },
        {
            "text": "The Priority Pathogen Families reference tool has been produced to guide and support decisions of research funders and scientific organisations in England; specifically, for work related to research and development into DTVs."
        },
        {
            "text": "There has been great progress made in recent years, but there are still significant gaps where we need DTVs. With so many bacteria and viruses having the potential to cause disease in humans, the scientific community needs an easily accessible tool to help determine their priorities and advance preparedness against infectious diseases. "
        },
        {
            "text": "This tool is UKHSA’s first attempt at highlighting those families where, should there be a lack of DTVs for us to combat an impending pandemic or epidemic, strong research and development may be extra important."
        },
        {
            "heading": 2,
            "text": "How the pandemic/epidemic level was decided"
        },
        {
            "text": "For the 24 pathogen families, a relative high/medium/low categorisation of “pandemic and epidemic potential” is suggested. This assessment is based on the pathogen family as a whole; individual pathogens within a family may have a higher or lower potential to lead to pandemics and epidemics."
        },
        {
            "text": "The ratings are the opinion of UKHSA experts, who have considered how known pathogens within a family have previously led to epidemics or pandemics, as well as routes of transmission and severity of disease from known pathogens within a family."
        },
        {
            "text": "However, UKHSA would advocate for active DTV research across all families included in the tool (even those with a relative “low” categorization) given the risk of emergence of new pathogens that may represent 'disease X'. "
        },
        {
            "heading": 2,
            "text": "The diseases which need increased scientific resource most"
        },
        {
            "text": "Among the pathogen families where UKHSA is keen to see greater scientific strides are the coronaviridae family, which includes Middle East Respiratory Syndrome (MERS) and of course SARS-CoV-2; the paramyxoviridae family which includes Nipah virus; and the orthomyxoviridae family which includes avian influenza. "
        },
        {
            "text": "All of these families are considered by UKHSA to have relative high pandemic or epidemic potential. Other families which feature in the list include Filoviridae (which includes Ebola virus, and as an overall family is suggested to have a high epidemic potential) and Poxviridae (which includes mpox, also suggested to have a high epidemic potential)."
        },
        {
            "text": "For the 8 families of bacteria in the list (such as Enterobacteriaceae, which includes Klebsiella pneumoniae), we have highlighted where there are concerns around anti-microbial resistance. The need for effective diagnostics and therapeutics to identify and treat resistant infections or the need for new vaccines to prevent spread are key reasons why some have been prioritised."
        },
        {
            "text": "Importantly, it should be noted that the reference tool is not a detailed threat assessment and the list of families included in this tool is not exhaustive and are not ranked."
        },
        {
            "heading": 2,
            "text": "How the list will boost biosecurity"
        },
        {
            "text": "The list of 24 pathogen families has been created to drive scientific investment and research, helping to strengthen the UK’s ability to respond to pathogen families that may impact on national biosecurity. It’s the first list designed to focus on both global public health threats and the diseases most relevant to our population."
        },
        {
            "text": "By identifying these key pathogen families and encouraging targeted research, the goal is to boost the development of more effective diagnostics, vaccines, and treatments. This means that if a future outbreak occurs, the UK will be in a stronger position to respond quickly and effectively, reducing the impact on public health and the economy."
        },
        {
            "text": "The list reflects where the UKHSA sees the greatest potential for research to improve pandemic preparedness and biosecurity. However, research into other pathogen families not included on the list remains important to ensure a broad and resilient response to emerging health threats."
        },
        {
            "text": "By focusing resources and expertise on these priority areas, the UK can stay ahead of potential outbreaks and protect public health more effectively in the years to come."
        },
        {
            "heading": 2,
            "text": "What UKHSA is doing to prevent the next pandemic"
        },
        {
            "text": "The tool is part of the UK’s Biological Security Strategy and is one of several measures UKHSA is using to protect public health. Both UKHSA’s Vaccine Development and Evaluation Centre and Diagnostic Accelerator are working closely with universities and industry partners to identify and prepare for potential disease threats, with the Priority Pathogens tool now helping to steer these efforts."
        },
        {
            "text": "In addition to vaccine and diagnostic development, UKHSA is strengthening the UK’s ability to detect and respond to emerging health threats. Through enhanced pathogen surveillance and genomic sequencing, UKHSA works with international partners to identify new risks and implement swift responses. These efforts ensure that the UK is well-prepared to tackle future pandemics."
        },
        {
            "text": "By combining research, development, and global collaboration, UKHSA is building a flexible and coordinated approach to public health, ready to respond to future infectious disease challenges with speed."
        }
    ]
}