{
    "url": "https://ukhsa.blog.gov.uk/2025/03/25/whos-eligible-for-the-2025-covid-19-vaccine-or-spring-booster/",
    "title": "Who’s eligible for the 2025 COVID-19 vaccine, or ‘Spring Booster’?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Immunisation and vaccination"
    ],
    "pub_date": "2025-03-25T15:52:00+01:00",
    "content": [
        {
            "text": "As we move into spring, protection from any earlier COVID-19 vaccination you may have had will be starting to wane."
        },
        {
            "text": "COVID-19 can still be very dangerous and even life threatening, particularly for older people and those with a weakened immune system."
        },
        {
            "text": "Thankfully, for those who are more likely to become seriously ill from COVID-19, the NHS offers a free vaccine in the spring to top up their protection. This was previously known as the ‘Spring Booster’."
        },
        {
            "text": "The vaccine has saved countless lives, prevented thousands from needing to go to hospital and helped us to live with the virus without fear or restrictions."
        },
        {
            "text": "UKHSA surveillance data relating to last spring’s programme shows that those who received a vaccine were around 45% less likely to be admitted to hospital with COVID-19 from 2 weeks following vaccination, compared to those who remained unvaccinated."
        },
        {
            "heading": 2,
            "text": "Eligibility for the COVID-19 vaccination this spring"
        },
        {
            "text": " The eligibility criteria is the same as for spring 2024, and similar to spring 2022 and spring 2023, with the addition of immunocompromised people in younger age groups:"
        },
        {
            "text": "The eligibility is the same across the 4 nations of the UK (England, Scotland, Wales and Northern Ireland)."
        },
        {
            "heading": 2,
            "text": "Age-based criteria"
        },
        {
            "text": "Those who are aged 75 and over can come forward to top up their protection this spring. If you are 74 but turn 75 years old by 17 June 2025, you don’t have to wait for your birthday to come forward."
        },
        {
            "heading": 2,
            "text": "Eligibility for residents and staff in care homes"
        },
        {
            "text": "Those who are resident in care homes for older adults are also eligible. Carers and staff in care homes are not eligible, this is because the vaccination programme this spring is targeted towards providing protection to those most vulnerable to severe disease."
        },
        {
            "heading": 2,
            "text": "Those with a weakened immune system"
        },
        {
            "text": "We understand that having a weakened immune system (immunosuppression) is a lot less straightforward than the other criteria. Looking online can cause even more confusion, as people might see themselves (and be considered by others) as immunosuppressed but might not fit the immunosuppression criteria for vaccination."
        },
        {
            "text": "So, what are the immunosuppression criteria? Eligibility is outlined in Chapter 14a of the Green Book, a document published by UKHSA specifically for public health professionals. It can be a complicated document for non-experts, so we've listed some of the groups here:"
        },
        {
            "text": "While this list summarises some major groups, it does not cover everything. Please check online at nhs.uk/get-vaccine to see if you are eligible."
        },
        {
            "heading": 2,
            "text": "Booking the spring COVID-19 vaccine"
        },
        {
            "text": "You should come forward rather than waiting for the NHS to contact you this year. The National Booking System opens on 25 March to book appointments from 1 April: nhs.uk/bookcovid. If you or someone you know can’t get online, book by calling 119 free of charge, where a translator is available if needed."
        },
        {
            "text": "Getting your COVID-19 vaccine is very convenient, with thousands of appointments available across the country every day, usually at pharmacies and GP practices."
        },
        {
            "text": "While having your spring vaccine around 6 months after your last dose is the usual timeframe, you can have it as soon as 3 months after a previous COVID-19 vaccine dose. If you are eligible, you can get protection from a spring COVID-19 vaccination even if you have not taken up a COVID-19 vaccine offer in the past. Most people do not need extra vaccinations to make up for any they have missed, but your doctor may advise a further dose if you have a severely weakened immune system."
        },
        {
            "text": "It is important that everyone who is eligible takes up the offer this spring before the vaccination programme closes on 17 June 2025."
        }
    ]
}