{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/03/25/why-clear-and-accurate-pricing-matters-and-how-businesses-can-get-it-right/",
    "title": "Why clear and accurate pricing matters – and how businesses can get it right",
    "authors": [
        "Sarah Cardell"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2025-03-25T15:15:22+00:00",
    "content": [
        {
            "text": "It’s vital that shoppers can access clear pricing information. Knowing how much you’ll pay is fundamental to making good decisions – working out which product is best for you, and where to buy it."
        },
        {
            "text": "When firms don't display their prices accurately or leave out essential pricing information that people need to know, it can make products appear cheaper than they are. That can undermine people’s trust when they find out the real cost, and prevent businesses from competing on a level playing field."
        },
        {
            "text": "Access to clear and accurate pricing information is a priority for the CMA. Our work over several years – on the price of everything from a family holiday to a cycle of IVF treatment, from buying a mattress to writing a will – shows the CMA’s commitment to supporting businesses to comply with the law, and to act where we see bad practice."
        },
        {
            "text": "New and innovative pricing systems, including those using the latest technology such as AI, can offer real benefits to consumers, businesses and the wider economy. To ensure consumers maintain trust and confidence in how pricing works, businesses need to help people understand how they work. What determines the price they pay? How can prices change over time?"
        },
        {
            "text": "If consumers understand how new pricing systems work, they can be confident that they are being treated fairly and are more likely to remain loyal which helps businesses to grow."
        },
        {
            "heading": 2,
            "text": "Our recent work on pricing"
        },
        {
            "text": "We've been busy over recent weeks on several projects related to pricing:"
        },
        {
            "heading": 3,
            "text": "Ticketmaster investigation"
        },
        {
            "text": "The CMA has been investigating Ticketmaster, following concerns about the sale of tickets for the UK leg of the Oasis Live ‘25 concert tour. We reached an important milestone in that investigation today, sending Ticketmaster a ‘consultation letter’ setting out the CMA’s concerns and seeking changes to Ticketmaster’s processes."
        },
        {
            "text": "We have 2 main concerns. "
        },
        {
            "text": "Firstly, we don't think customers were given clear and timely information about how the pricing of certain tickets would work. In particular, we don't think it was clear that there were 2 categories of standing tickets at different prices, with all of the cheaper standing tickets sold first before the more expensive standing tickets were released. As a result, many fans may have waited in a long queue without understanding what they would be paying and then having to decide quickly whether to pay a higher price than they expected."
        },
        {
            "text": "Secondly, we’re concerned that Ticketmaster labelled certain seated tickets as ‘platinum’ and sold them to fans for around 2.5 times the price of equivalent standard tickets, without sufficiently explaining that they didn't offer additional benefits and were often located in the same area of the stadium. We’re concerned that this may have misled fans into thinking they were getting better tickets when that wasn’t necessarily the case."
        },
        {
            "heading": 3,
            "text": "Dynamic pricing"
        },
        {
            "text": "We’re also looking at how ‘dynamic pricing’ is being used across different sectors of the economy. Dynamic pricing generally involves prices changing in a relatively short period of time because of changing market conditions, like a high level of consumer demand or a shortage of availability. In some cases that can involve complex algorithms, with prices changing frequently and at great speed."
        },
        {
            "text": "There is often considerable confusion about what dynamic pricing is and how it is used. For example, in our Ticketmaster investigation, many fans were under the impression that Ticketmaster used an algorithmic pricing model to adjust its prices in real time. However, we did not find evidence that was the case. Instead, Ticketmaster used a different pricing model where it released a number of standing tickets at a lower price and, once they sold out, released remaining standing tickets at a much higher price."
        },
        {
            "text": "We're examining how dynamic pricing is used by businesses, why they use it and what benefits it has, including whether it varies by sector – for example, business practice and consumer expectations may be different for holiday pricing as compared to tickets. "
        },
        {
            "text": "We want to understand both the benefits and potential risks for consumers and competition. We have engaged with a number of businesses and consumer groups who have helped us develop a richer understanding of dynamic pricing. We'll publish our findings by the end of April. "
        },
        {
            "text": "We’ll also be providing our findings to the government to help inform its consideration of the issues raised by dynamic pricing, including in the live events sector."
        },
        {
            "heading": 3,
            "text": "Ticket resale"
        },
        {
            "text": "We’ve responded this week to the government’s consultation on proposals to strengthen consumer protection in relation to ticket resale for live events. The consultation drew on previous CMA work highlighting that typical price mark-ups in the ticket resale market are around 50%, and that bulk buying of tickets by professional ticket touts can drive these inflated prices."
        },
        {
            "text": "The government wants to protect consumers from ‘excessive resale pricing’, and we’ve made clear in our response to the consultation that we support its proposal for a price cap on resold tickets to deliver that objective."
        },
        {
            "text": "Our response also sets out a number of considerations to help the government successfully implement such a price cap, including:"
        },
        {
            "heading": 2,
            "text": "What businesses can do to help build consumer trust and confidence in their pricing systems"
        },
        {
            "text": "Great businesses put their customers front and centre of what they do and they innovate to use pricing strategies that serve their customers and drive growth. The work we’ve described above highlights the importance of thinking through a customer journey. For example, what information do consumers need to make informed choices throughout the purchasing process, whatever pricing strategy a business uses?"
        },
        {
            "text": "Businesses use dynamic pricing in lots of different ways, but here are some overarching steps businesses can take to help ensure compliance and build trust about their pricing in the areas I’ve described above:"
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "You might be interested in:"
        }
    ]
}