{
    "url": "https://ukhsa.blog.gov.uk/2024/11/20/how-the-science-of-snakebites-is-taking-on-superbugs/",
    "title": "How the science of snakebites is taking on superbugs",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance"
    ],
    "pub_date": "2024-11-20T10:03:07+01:00",
    "content": [
        {
            "text": "Patients in British hospitals with serious, antibiotic-resistant gut infections have little in common with snakebite victims overseas. But when scientists made an unlikely connection in 2018, it led to trials for a potential new treatment for antibiotic-resistant infections. In this blog post we explore the science behind the discovery."
        },
        {
            "text": "In 2018, UKHSA (then Public Health England) began working with a small Welsh pharmaceutical company which produces a range of antivenoms to treat snakebites worldwide."
        },
        {
            "text": "When the team looked into the science behind the antivenom, they started to wonder if that same principles could be applied to treatments for hard-to-treat infections."
        },
        {
            "text": "Clostridioides difficile, or C. diff, is a type of bacteria that can normally live harmlessly in a person’s gut along with lots of other types of bacteria, often called the ‘microflora’. "
        },
        {
            "text": "Sometimes, however, when antibiotics are given to patients being treated for something else, this microflora can become unbalanced leading to a C. diff infection that is difficult to treat with antibiotics and produces harmful toxins."
        },
        {
            "text": "This can cause gut infections that are life-threatening for the individual, but it’s also highly contagious, putting other people at risk, particularly in hospital settings. Antibiotics are often ineffective at treating C. diff infections, so it is important to look at non-antibiotic therapies."
        },
        {
            "text": "Through the opportunity to look at the development of the antivenom technology, UKHSA developed a novel preventative treatment for C. diff, which could stop patients in hospital settings from getting an infection, and has now received funding for Phase 2a clinical trials."
        },
        {
            "text": "If successful, the treatment has the potential to save lives and prevent cases of antibiotic-resistant C. diff infection in hospitals each year."
        },
        {
            "text": "Developing antivenoms"
        },
        {
            "text": "Antivenoms work inside the human bloodstream by rapidly mopping the venom out of the blood and preventing the person from getting sick."
        },
        {
            "text": "The treatment for snake bites was being developed by putting a very small amount of snake venom into a sheep, causing it no harm, but stimulating the sheep to produce the antibodies required to immobilise the snake venom."
        },
        {
            "text": "These antibodies were then extracted, stored, and later administered to snakebite patients."
        },
        {
            "text": "Applying this science to preventing C. diff"
        },
        {
            "text": "C. diff is very difficult to grow in laboratory conditions, so it is a challenge to produce enough of the toxins in a laboratory to adopt the same approach as for snake venoms."
        },
        {
            "text": "To overcome this problem the team developed a method of inserting modified (non-toxic) versions of the important genes from C. diff into an easier-to-grow bacterium, before harvesting the proteins which cause the severe intestinal infections."
        },
        {
            "text": "These modified proteins could then be injected into the sheep without causing disease, but stimulate the sheep's immune system to produce antibodies that can neutralise C. diff toxins."
        },
        {
            "text": "The sheep made antibodies in large enough volumes that they could be extracted and developed into a treatment for human consumption."
        },
        {
            "text": "Targeting C. diff in the gut"
        },
        {
            "text": "The treatment is a pepperminty drink that looks just like a health juice shot or a probiotic. Only a small amount is required for each dose. Because it is egg-white based, the antibodies can also be delivered, unaltered, straight to a patient’s gut – a hostile part of the body other treatments struggle to work in."
        },
        {
            "text": "Importantly, this straightforward approach means that hospitals can give their patients the drink on arrival and then daily for the duration of their stay, stopping a patient from becoming ill from C. diff caught from others who may be infected, or from the C. diff in their own gut getting out of control."
        },
        {
            "text": "The science behind treating C. diff without using antibiotics could become a hugely significant alternative therapy for treating bacterial infections, and a critical development in the UK government’s plan to tackle the growing threat of antibiotic resistance (AMR)."
        }
    ]
}