{
    "url": "https://opss.blog.gov.uk/2024/11/20/opss-2025-2026-year-in-industry-programme/",
    "title": "OPSS 2025 - 2026 Year in Industry Programme",
    "authors": [
        "Simone King"
    ],
    "categories": [
        "Careers at OPSS",
        "Civil Service Applications",
        "Early Careers",
        "Placement",
        "Placement Students",
        "University Placements",
        "Year In Industry"
    ],
    "pub_date": "2024-11-20T18:37:25+00:00",
    "content": [
        {
            "text": "Are you studying Data Science, Computer Science, Economics, Mathematics, English, History, Politics, Electrical and Mechanical Engineering, Chemical Science or Law with the option to undertake a year out in industry to start in September 2025?"
        },
        {
            "text": "If so, we would love to hear from you!"
        },
        {
            "text": "As a placement student, there will be exciting opportunities for you to collaborate with specialists, undertake research and contribute to a range of different projects that have real world impact. "
        },
        {
            "text": "This may include, testing products, drafting briefs, undertaking literature reviews, analysing data, and providing evidence-based insights. You will also gain experience of working for the OPSS, and the wider Civil Service."
        },
        {
            "text": "Please refer to the team and role profiles pack for more details on each of the teams and examples of work you may be involved in."
        },
        {
            "text": "We would love to hear from you if you are in your penultimate year of university with the option to undertake a year out in industry. We have a wide range of placement opportunities available and are particularly keen to hear from students studying Data Science, Computer Science, Economics, Mathematics, English, History, Politics, Electrical and Mechanical engineering, Chemical Science, and Law."
        },
        {
            "text": "Applicants will need to specify which roles they would like to be considered for from the following:"
        },
        {
            "text": "Hybrid Working"
        },
        {
            "text": "The role will be based in either Birmingham, London or Teddington.  You will be asked to express a location preference during the application process."
        },
        {
            "text": "Please be aware that this role can only be worked from within the UK and not overseas."
        },
        {
            "text": "Informal hybrid working arrangements will be available as agreed with the vacancy manager and in line with the requirements of the role."
        }
    ]
}