{
    "url": "https://ruralpayments.blog.gov.uk/2024/11/20/using-geospatial-data-and-technology-as-part-of-world-gis-day/",
    "title": "Using geospatial data and technology as part of World GIS Day ",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2024-11-20T17:27:07+00:00",
    "content": [
        {
            "text": "Today is the 25th anniversary of World GIS Day, created to celebrate the power of Geographic Information Systems (GIS). GIS is a tool that links data to maps, integrating location data with other descriptive information. It allows people to create maps and analyse data and is used in almost every industry."
        },
        {
            "text": "We use GIS across our agency to improve our advice and guidance to help farmers get the most from their environmental agreements. We use it to control our schemes and to evidence whether environmental improvement goals are being met. Geospatial data and technology are fundamental to the success of RPA’s land management schemes, making it possible to preserve the environment while still producing the food we need.  "
        },
        {
            "text": "RPA’s Data, Insights and Outcomes Team leads this work, while the Geospatial Services Team manages the land management system, which holds information on cover and boundaries of around 2.7m land parcels and 75% of land across England. Our earth observation specialists use high frequency, high resolution satellite imagery to overlay what is currently happening on land parcels with what has happened previously."
        },
        {
            "text": "Our Field Officers also use geospatial data in the field to monitor scheme compliance and capture any changes in land parcel boundaries or land cover types. They do this by using highly accurate Global Navigation Satellite System (GNSS) kit and their Land Inspection Devices.    "
        },
        {
            "text": "Supporting wider habitat monitoring "
        },
        {
            "text": "Our earth observation work also supports wider habitat monitoring. Alongside Forest Research we are currently developing a hedge and tree map product for the whole of England. This new product will determine the length, width and height of hedges across rural and urban areas, identifying their presence, location and area of coverage. It will be used further to measure treescape diversity and connectivity, as well as conditions for the Tree Health Resilience Strategy. "
        },
        {
            "text": "Within RPA, the hedge and tree product will enable us to deliver our hedgerow regulations and monitor hedgerow schemes. This two-year cycle habitat map product will be accessible from 2025 under open-government licence to aid in further research work in England’s soil and carbon sequestration. "
        },
        {
            "text": "Farming recovery payments Geospatial data was also used by RPA to support farmers affected by Storm Babet and Storm Henk after the severe wet weather during this period. RPA was able to provide a one-off Recovery Payment to around 13,000 farmers to help cover the uninsured costs of restoring farmland. Environment Agency and Met Office data was used to identify which farm businesses received the recovery payment. Data on river flooding and exceptional rainfall allowed us to pinpoint affected land and make payments directly to eligible farms. There was no need for farmers to apply for funding and using the data meant payments could be made quickly, without further evidence. "
        },
        {
            "text": "Providing food for birds in winter Another example of how RPA uses GIS is Countryside Stewardship option AB9: winter bird food. This option focuses on providing food for birds over winter. Farmers in AB9 plant certain types of plants in spring which flower in the summer, release seeds in autumn and which then provides food for birds in winter. "
        },
        {
            "text": "RPA’s earth observation specialists can monitor this by looking at the soil. The team track satellite images of the features we want to assess, whether that’s bare soil, or different types of vegetation or stubble. This information is then used to identify what RPA Field Officers, in a partnership approach, can do to better support farmers with their agreements. This involves providing advice, support and guidance, so farmers can have greater confidence delivering their agreement options. The use of GIS across government is broad and you can find some examples that were recognised in the Geography in Government Awards, from informing national policy, to delivering public services at a local level. "
        }
    ]
}