{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/20/young-people-experiencing-homelessness-this-christmas/",
    "title": "Young people experiencing homelessness this Christmas",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness",
        "Housing"
    ],
    "pub_date": "2024-11-20T10:35:48+00:00",
    "content": [
        {
            "text": "There is media coverage of data from the charity Centrepoint, who estimate almost 23,000 young people could face homelessness across England this Christmas."
        },
        {
            "text": "This has been reported in outlets including the Independent, LBC, Free Radio and the Express and Star."
        },
        {
            "text": "The predictions for England are lower than last year’s estimate of around 24,400 young people, and the 29,500 estimate for winter 2022."
        },
        {
            "text": "A spokesperson for the Ministry of Housing, Communities and Local Government said:"
        },
        {
            "text": "“These figures are simply unacceptable. We have inherited record levels of homelessness which is having a devastating impact on young people. This has to change – which is why we are taking urgent action to end homelessness for good."
        },
        {
            "text": "“We have introduced an emergency £10 million fund to protect rough sleepers from the cold this winter and in the Budget announced an additional £233 million for homelessness services, taking total spending to nearly £1 billion in 2025-26.”"
        },
        {
            "text": "More widely, the Deputy Prime Minister convenes a dedicated Inter-Ministerial Group to develop a long-term strategy to end homelessness, and we will continue to engage with partners and charities as we tackle this important issue."
        },
        {
            "text": "We are also committed to delivering 1.5 million homes this Parliament and the biggest increase in social and affordable homebuilding in a generation, to ensure people can access the housing they need. "
        }
    ]
}