{
    "url": "https://deframedia.blog.gov.uk/2022/02/04/coverage-of-update-on-investigation-into-the-deaths-of-crab-and-lobster-in-the-north-east/",
    "title": "Coverage of update on investigation into the deaths of crab and lobster in the North East",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-02-04T17:10:09+00:00",
    "content": [
        {
            "text": "On the 8th of February, we provided a update on the joint investigation carried out by Defra and partner agencies, looking into the deaths of crabs and lobster found washed up on the North East coast between October and December 2021."
        },
        {
            "text": "There has been widespread straight coverage on the update among leading regional titles, including BBC Tees, ITV News Tyne Tees, Wales Online, Hartlepool Mail, Sunderland Echo, Yorkshire Post, Yorkshire Live, The Northern Echo, Darlington & Stockton Times, and The Sun."
        },
        {
            "text": "The joint investigation was carried out by Defra and partner agencies including the Environment Agency, Centre for Environment, Fisheries and Aquaculture Science (Cefas), North Eastern Inshore Fisheries and Conservation Authority (NEIFCA), the Marine Management Organisation (MMO), Food Standards Agency (FSA), UK Health Security Agency (UKHSA)."
        },
        {
            "text": "The update outlines key findings of the investigation, notably that the deaths are considered to have potentially resulted from a naturally occurring algal bloom – and that it is unlikely that chemical pollution, sewage or infectious aquatic animal diseases were the cause of the deaths."
        },
        {
            "text": "All coverage listed above carries key messaging from our press release that the results point to “a naturally occurring algal bloom” being the potential cause. The vast majority of titles underline that the findings follow “significant testing and modelling” and that the investigation has found it to be “unlikely that chemical pollution, sewage or infectious aquatic animal diseases were the cause”."
        },
        {
            "text": "Leading outlets including BBC Tees and ITV News Tyne and Tees carry our lines on dredging and the chemical pyridine which had been speculated as potential causes. ITV underlines that “some theories linked the issue to dredging in the area, but the review found no evidence of a link between the disposal of dredged sentiment and the deaths”."
        },
        {
            "text": "BBC states that “while the chemical pyridine was initially identified in crabs in the affected areas, further investigation established that it was not present in water and surface sediment samples collected off the Tees”, and that “as it was also found in crabs from other areas, its presence was believed to be linked to \"biological processes\"."
        },
        {
            "text": "Many of these regional titles carry further key messages, with The Northern Echo noting that “follow up survey work carried out by the Environment Agency on the 18th and 19th of January 2022 has also shown live healthy crabs present in the area, albeit in reduced numbers”. The Yorkshire Post carries our lines on there being “no evidence linking any reports of dead seals to the investigation on crab and lobster deaths” – and further that there was no evidence found of a food safety risk from healthy fish and crustacea, including crabs and lobsters caught off the North East coast."
        },
        {
            "text": "The majority of outlets also note that we are encouraging the public to report any further incidents and provide relevant contact details for the public and industry. BBC notes that “Defra would continue to work with the local fishing industry and would remain on standby if it happened again”."
        }
    ]
}