{
    "url": "https://ruralpayments.blog.gov.uk/2022/02/04/driving-environmental-sustainability-leadership-across-the-department-for-the-environment-and-rural-affairs/",
    "title": "Driving Environmental Sustainability Leadership across the Department for the Environment Food and Rural Affairs",
    "authors": [
        "Rural Payments Agency"
    ],
    "categories": [
        "Rural Payments service"
    ],
    "pub_date": "2022-02-04T14:09:48+00:00",
    "content": [
        {
            "text": "The Rural Payments Agency (RPA) is embarking on an innovative programme to build leadership in environmental sustainability across the Department for the Environment Food and Rural Affairs (Defra)."
        },
        {
            "text": "Tamara Finkelstein, Defra Permanent Secretary and Civil Service Apprenticeship Champion, said: “Our people, and all Civil Servants, have a huge role to play in supporting the UK to be at the forefront of driving the green agenda. This is why building the environmental sustainability leadership skills of our people is critical to ensure climate action is an organisational priority, as well as an imperative for the planet."
        },
        {
            "text": "“This will also support us in our own commitments on the environment through ensuring sustainability runs through everything we do across the Defra Group and our mission of restoring and enhancing the environment.”"
        },
        {
            "text": "The speakers on the programmes will include Microsoft, the United Global Sustainable Development Group Index Institute, and others from a range of industries and sectors leading on environmental sustainability."
        },
        {
            "text": "Jake McClure, RPA’s Director of Organisational Capability, said: “Leadership in environmental sustainability is essential at all levels as it will impact our performance towards the achievement of sustainability."
        },
        {
            "text": "“Through developing the first Chartered Management Degree Apprentice in environmental sustainability leadership with the University of Cumbria, we are laying the roadmap for sustainability leadership to support climate action and Net Zero commitments."
        },
        {
            "text": "“The environmental sustainability landscape is complex, so we are building our leadership capabilities in this area. We will iterate the course learning, as we move forwards, so our people are aware of the latest thinking and approaches to environmental sustainability in organisations and can build skills and leadership in agile and critical thinking."
        },
        {
            "text": "“We are investing in people now through this transformative learning and development for our people, individually and collectively, as ‘green leaders’ are agents of change. In addition, the future of leadership will require people who can bring together multiple perspectives and co-create solutions that address our environmental sustainability challenges hence our future development on new programmes for our team leaders and operational managers."
        },
        {
            "text": "Jake McClure added: “Leaders have always needed to be visionaries but with environmental sustainability, it's a critical skill. We're teaching scenario planning, scenario thinking, as well as critical thinking to enable leaders to anticipate the environmental sustainability leadership challenges they will face and when.”"
        },
        {
            "text": "“Building visionary capacity in environmental sustainability leadership is just one piece of the new skills-based degree programme, which is also part of the Defra Group’s strategic workforce planning for the future. The environmental sustainability leaders will learn how to develop a business case for their efforts, how to drive the sustainability mindset through their work and across the Defra Group, and how to perform quantitative analyses to show organisational impact and to those they serve.”"
        },
        {
            "text": "Participation in the programme, taught by leadership experts, will include classroom learning, discussion, and team exercises, as well as executing what has been learnt in job roles. It will also help the participants develop a peer group to support leverage insights from the learning well into the future as environmental sustainability leadership grows across the RPA and the Defra Group."
        },
        {
            "text": "University of Cumbria Vice Chancellor, Professor Julie Mennell said: “We are excited to be working with the Rural Payments Agency to develop the environmental sustainability leadership Chartered Management Apprentice Degree for the Defra group."
        },
        {
            "text": "“As Cumbria’s university, we both understand and embrace our responsibilities to protect the environment and the lives and livelihoods of future generations. This new collaborative programme is an important demonstration of our commitment to do so.  I have no doubt that the students engaged in this programme will be further equipped to play their important role in achieving long lasting and positive change."
        },
        {
            "text": "“With the theme for National Apprenticeship Week this year being ‘Build the Future’ it is timely for us to be launching this new environmental sustainability leadership Chartered Management Apprentice Degree.”"
        }
    ]
}