{
    "url": "https://marinedevelopments.blog.gov.uk/2022/02/04/get-help-with-catch-recording/",
    "title": "Get Help with Catch Recording",
    "authors": [
        "Claire Turner, MMO Digital Manager"
    ],
    "categories": [
        "Coastal"
    ],
    "pub_date": "2022-02-04T15:02:01+00:00",
    "content": [
        {
            "text": "We are hosting a series of drop-in sessions to help fishers with under-10m vessels with their catch recording obligations."
        },
        {
            "text": "We want to support and enable a profitable, sustainable fishing industry. So improving understanding of how much and which species of fish are being taken from which areas of our seas is vital for better management of stocks for the benefit of fishers and the environment."
        },
        {
            "text": "Catch recording was introduced two years ago to provide this essential data for the first time from this significant section of the English fleet. From 28 February 2022, we will begin enforcing the associated licence condition, in line with our Compliance and Enforcement strategy."
        },
        {
            "text": "As part of our continuous support for fishers to comply with the catch recording licence condition, Marine Officers are hosting a series of quayside drop-in sessions so fishers can raise their questions and get advice on using the catch recording service."
        },
        {
            "text": " "
        },
        {
            "text": "Check out the dates and locations below for the session most convenient to you:"
        },
        {
            "text": "Friday 11th February "
        },
        {
            "text": "West Bay Harbour 10:00 – 12:00"
        },
        {
            "text": "Shoreham port - car park adjacent to Nicholsons boat yard 13:00-15:00"
        },
        {
            "text": "Mevagissey 10:00-12:00"
        },
        {
            "text": "Salcombe 12.00-13.00"
        },
        {
            "text": "Looe  9:00 -12:00"
        },
        {
            "text": " "
        },
        {
            "text": "Saturday 12th February "
        },
        {
            "text": "Poole, Fishermen’s Dock 10:00 – 12:00"
        },
        {
            "text": " "
        },
        {
            "text": "Tuesday 15th February "
        },
        {
            "text": "Exmouth 10.30 – 12.00"
        },
        {
            "text": " "
        },
        {
            "text": "Sunday 20th February "
        },
        {
            "text": "Lyme Regis, The Cobb 10:00 – 12:00"
        },
        {
            "text": " "
        }
    ]
}