{
    "url": "https://ace.blog.gov.uk/2022/02/04/impact-lab-unlocking-the-power-of-data-for-law-enforcement-innovation/",
    "title": "Impact Lab: unlocking the power of data for law enforcement innovation",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Data",
        "Law enforcement"
    ],
    "pub_date": "2022-02-04T15:14:37+00:00",
    "content": [
        {
            "text": "When we created Impact Lab as a way to rapidly solve digital and data problems facing frontline law enforcement, we knew it would probably push people out of their comfort zones."
        },
        {
            "text": "That’s often the effect when you set out to ‘do different’. But we didn’t seek to push boundaries – and make anyone uncomfortable – for the sake of it. Necessity is the mother of invention, after all."
        },
        {
            "text": "The core concept of Impact Lab is to invite the most innovative minds from industry and academia to work on the real data from a real police investigation to find solutions to those frontline problems."
        },
        {
            "text": "After an in-depth briefing event, participants from ACE’s Vivace industry and academia community have around a month to work on potential solutions. The best are selected to pitch to a panel of expert judges, including the police team that brought the case to Impact Lab in the first place. The winner’s solution then progresses into an ACE commission that ultimately delivers the required frontline impact."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Real solutions to real problems need real data"
        },
        {
            "text": "Where the comfort zone tends to get breached is in the use of real data, and for good reason. Ensuring compliance with data protection legislation underpins every aspect of how an Impact Lab is run."
        },
        {
            "text": "We work closely with the data protection officers at the police forces involved and, when needed, consult with the Information Commissioner’s Office (ICO). Participants from industry and academia sign stringent data protection agreements and the whole process is overseen by ACE technical assurers."
        },
        {
            "text": "The point here is that while navigating the safe, compliant and ethical use of data is not easy, that doesn’t mean that the many challenges of doing so cannot be overcome."
        },
        {
            "text": "The benefit of using real operational data is immense. It’s something that hasn’t been possible before and the results can be profound."
        },
        {
            "text": "Instead of being described third hand in a set of procurement requirements, the problems faced by those on the front line become starkly immediate."
        },
        {
            "text": "What tends to follow an initial Impact Lab briefing is a lot of very animated conversations as participants quiz those on the mission front line – the investigating team, the analysts, the force leadership – to really dig into the detail."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Feeling the impact"
        },
        {
            "text": "There is a palpable sense of excitement as possibilities crystallise, of relief that problems are not as difficult as imagined, and of optimism that solutions are within reach."
        },
        {
            "text": "So far, we have used Impact Lab to explore solutions to processing vast amounts of data in an international human trafficking and modern slavery case, and to find ways of identifying suspects and evidence from an encrypted messaging system used by criminals in a major drug importation and distribution operation."
        },
        {
            "text": "The next one will focus on ways to improve the effectiveness of investigations of rape and serious sexual offences."
        },
        {
            "text": "With Impact Lab, we had identified an area where the urgency of those frontline problems and the ability to access the best industry innovation for solutions fell outside traditional procurement mechanisms."
        },
        {
            "text": "Quite often they are not that difficult to fix and those who ‘own’ these problems are aware that products probably exist in the market that can help them – it’s just a question of finding them."
        },
        {
            "heading": 2,
            "text": "Shared understanding, mutual benefits"
        },
        {
            "text": "Sometimes they are very difficult indeed, but those at the cutting edge of disciplines such as data science, software, artificial intelligence and machine learning tend to love a challenge that stretches them, particularly ones from the real world."
        },
        {
            "text": "And we have found that, as well as finding a winning solution, each Impact Lab creates a long tail of benefits. Numerous solutions and ideas – not just the winner – find traction with law enforcement and other stakeholders in the room. Relationships are forged, new products are conceived, new markets seeded."
        },
        {
            "text": "Most importantly, everyone goes away with a much deeper understanding – of the kinds of challenges facing the front line, of the innovative technology available across industry and academia, and of what is possible when the two come together."
        },
        {
            "text": " "
        }
    ]
}