{
    "url": "https://traderemedies.blog.gov.uk/2022/02/04/its-all-talk-why-talking-to-people-is-one-of-the-most-important-things-we-do/",
    "title": "It’s all talk: why talking to people is one of the most important things we do",
    "authors": [
        "Sarah Avery, Industry, Government and Parliamentary Affairs Lead"
    ],
    "categories": [
        "engagement",
        "pre-application office"
    ],
    "pub_date": "2022-02-04T12:05:03+00:00",
    "content": [
        {
            "text": "In June 2021, the Trade Remedies Authority (TRA) became an independent arm’s length body of the Department for International Trade. It’s really important for us to talk to people who need to use our services or understand our work. We want to ensure that the UK’s trade remedies regime is easy to understand and accessible to everyone. After all, trade remedies are new to the UK and our manufacturing industries may not be familiar with how they work and can protect domestic manufacturers against unfair imports. Even for those who have previously used the EU system, the UK’s regime differs in some ways."
        },
        {
            "heading": 2,
            "text": "Supporting you: the TRA’s Pre-Application Office"
        },
        {
            "text": "The TRA’s Pre-Application Office (PAO) was created to support UK producers who may want to apply for a trade remedies investigation. If you’re a producer, or your company supports producers who may want to make an application (such as a legal firm, trade adviser or consultancy), we’re here if you need to discuss your concerns and to help you understand trade remedies and the TRA’s processes and procedures."
        },
        {
            "heading": 2,
            "text": "Come and talk to us"
        },
        {
            "text": "We do have plenty of guidance which is available on GOV.UK, but over the last few months, we have found that ‘in person’ discussions over MS Teams have proved really helpful for many stakeholders. We also run informative events, open to all interested party groups, to help provide clarity around what we do, how we do it and why we take the approach we do."
        },
        {
            "text": "We’re also talking to trade remedy authorities in other countries to share best practice, what is going well, and lessons learnt. We want to ensure that processes around trade remedies in the UK are efficient, effective, and as accessible as possible for everyone. To help us with this, we have had fascinating conversations with our devolved adminstrations, such as Scotland and Wales and with our counterparts in Canada, New Zealand and Australia and we have more exciting international engagement planned. And of course as COVID restrictions relax, we’re keen to get out and about in person and meet people in the field as much as possible too."
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        }
    ]
}