{
    "url": "https://forestrycommission.blog.gov.uk/2022/02/04/new-wader-zonal-maps-helping-to-ensure-new-trees-are-put-in-the-right-place/",
    "title": "New wader zonal maps - helping to ensure new trees are put in the right place.",
    "authors": [
        "Neil Riddle"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2022-02-04T09:15:36+00:00",
    "content": [
        {
            "text": "Ambitious targets have been set for forest expansion across England which will provide opportunities for woodland birds but, if established/planted in the wrong place, may impact negatively on species reliant on open habitats."
        },
        {
            "text": "The key will be putting the right trees in the right place."
        },
        {
            "text": "Breeding waders, such as the Curlew and Golden plover, which are reliant on open habitats during the breeding season, are of conservation concern because of their declining populations and the international significance of some of their UK populations."
        },
        {
            "text": "The Forestry Commission have been working with the British Trust for Ornithology (BTO), Natural England and others to develop wader zonal maps which help identify important areas for the recovery of breeding waders based on scientific modelling of Bird Atlas and environmental data sets."
        },
        {
            "text": "The wader zonal maps have been refined further with a bird survey carried out in 2021 funded by the Forestry Commission in northern England. The wader zonal maps, along with other decision-making tools will help to guide and inform woodland expansion in England that works with breeding wader conservation."
        },
        {
            "text": "The maps are not a definitive map of wader populations or distribution, instead they use the best available information to provide a broad indication of areas of likely importance for waders."
        },
        {
            "text": "John Calladine, Senior Research Ecologist at the BTO, said,"
        },
        {
            "text": "He added,"
        },
        {
            "text": "Neil Riddle, Principal Adviser – Natural Environment at the Forestry Commission, said"
        },
        {
            "text": "Sarah Anthony, Senior Environmental Specialist – Ornithology, Natural England, said"
        },
        {
            "text": "This project to develop the wader zonal maps was a partnership between the British Trust for Ornithology, Scottish Forestry, Forestry Commission, the Cairngorms National Park Authority (CNPA) and Working for Waders."
        }
    ]
}