{
    "url": "https://socialcare.blog.gov.uk/2022/02/04/protecting-the-adult-social-care-sector/",
    "title": "Protecting the adult social care sector",
    "authors": [
        "Sir David Pearson"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Guidance"
    ],
    "pub_date": "2022-02-04T13:40:16+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Best practice for booster vaccination"
        },
        {
            "text": "The adult social care sector has worked exceptionally hard over the past two years to protect staff and the people who rely on social care services during the pandemic."
        },
        {
            "text": "I am inspired by the resilience you have shown, individually and collectively, in challenging circumstances and the countless examples of innovation and determination to provide the best and safest services possible."
        },
        {
            "text": "The care sector continues to work tirelessly to drive the rollout and uptake of booster vaccinations, to maintain protection from COVID-19, especially in the wake of Omicron’s emergence."
        },
        {
            "text": "Despite these efforts, challenges remain in achieving the staff booster vaccination levels we reached for doses one and two. We know vaccination continues to have a critical role in protecting and preserving the health and wellbeing of those who use social care services and those who care for them."
        },
        {
            "text": "In those areas which are achieving the highest uptake, the key has been local organisations working together effectively to develop models that work for their community and their specific circumstances. This means local systems forging strong partnerships to create the right environment for success."
        },
        {
            "heading": 2,
            "text": "Sharing what works"
        },
        {
            "text": "To promote and harness this learning, the Adult Social Care Booster Taskforce has published a new paper, written for adult social care and vaccine leads from Local Authorities, Integrated Care Systems, and providers."
        },
        {
            "text": "I am delighted to share this with you. By bringing local learning into one place, Protecting the Adult Social Care sector – Good Practice for Local Booster Vaccination aims to share and replicate good practice across the country. The paper also contains a selection of informative, and insightful case studies, which shine a spotlight on some of the effective approaches being taken to drive booster vaccinations across different regions."
        },
        {
            "text": "The paper is designed, not to undermine the existing work local systems are doing or ask them to adopt approaches that aren’t suitable for their area, but rather pull together the varied, inspiring practices across the country to be adapted and replicated where appropriate."
        },
        {
            "text": "I hope you can use the paper to review your arrangements and find it beneficial to your crucial work. Please forward and share with your colleagues and with vaccination and adult social care leads in your networks."
        }
    ]
}