{
    "url": "https://mojdigital.blog.gov.uk/2022/02/04/sum-of-all-the-strategies/",
    "title": "Sum of all the Strategies",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "Agile",
        "Data",
        "our users",
        "strategy"
    ],
    "pub_date": "2022-02-04T12:30:19+01:00",
    "content": [
        {
            "text": "Just before Christmas last year, after 10 months of being Interim CDIO for the MoJ, I was offered the post on a permanent basis. While I certainly wasn’t acting as “caretaker” in the role, it has definitely given me certainty and the mandate to really drive forward the agenda that my team and I were already starting to set out. "
        },
        {
            "text": "First in that agenda is setting out what our strategy is for the next 3 years. I have been a Civil Servant for over 4 years, and this is the first time that I’m getting to experience a 3 year spending round (read planning round) which means we get to properly look at where we want to be by 2025. We don’t have the luxury of starting from a blank page. We have over 800 services, a lot of in-flight work and 40 different strategies across the MoJ, its agencies and government more broadly that set expectations upon us. "
        },
        {
            "text": "So we’re taking the opportunity to look at what the sum total of all of that work and those strategies means for the organisation – what will have changed by 2025? "
        },
        {
            "text": "There are two (unsurprising) emerging themes and a third that I think we need to embrace if we are going to affect real change. "
        },
        {
            "text": "The first of those themes is data. We have a lot of it. It’s sat in our many, many systems; it’s sat in warehouses, offices and courts in physical form across the country; it’s sat in colleague’s mailboxes. And, like many other organisations, we are not able to harness the power of that data to drive decisions and the way we do things. So, the first thing that needs to be different in 2025 is that we understand what data is most important to us, have one source of the truth for that data and have the capabilities in place to be able to leverage that data. "
        },
        {
            "text": "The second is about our organisational flexibility, or how nimble we are.  We need to enable the organisation to be more responsive to changes in policy – it takes far too long today. This means improving or getting off some of our legacy systems, but it also means automating where it’s appropriate to do so. Therefore, the second thing that needs to be different in 2025 is that we have less reliance on legacy systems, less reliance on paper based processes and are therefore more nimble and efficient as an organisation. "
        },
        {
            "text": "And lastly, and for me the most important theme is around orienting ourselves around our users. This isn’t about making sure we do user research or that we’ve got design capabilities. But about fundamentally changing the way in which we operate as an organisation. The way we’re working today is creating complexity in our technology landscape, and if we can’t change that then we will always be in a technical debt cycle. We need to break the cycle of creating complex policy then complex processes to deliver that policy and then complex systems to support those processes. So the third thing that needs to be different in 2025 is the way that we work – we need to be working in a truly multidisciplinary way with policy and operational colleagues from the inception of a policy idea. It’s not new, we’re not the only people who have this issue, but I haven’t seen very many (that’s not to say there aren’t any) great examples of large, complex organisations where this has truly successfully been achieved."
        },
        {
            "text": "So there we have it. The emerging themes for our 2025 strategy. In the coming weeks I will talk about what that means in terms of delivery priorities to bring this to life, and some of the challenges that we face in delivery. "
        },
        {
            "text": "But in the meantime, I’d love to hear your thoughts."
        }
    ]
}