{
    "url": "https://teaching.blog.gov.uk/2022/02/04/texting-parents-our-key-to-success-in-tackling-absence/",
    "title": "Texting parents: our key to success in tackling absence",
    "authors": [
        "Louisa Munton"
    ],
    "categories": [
        "Attendance",
        "Pupil wellbeing and behaviour",
        "School-led research"
    ],
    "pub_date": "2022-02-04T17:34:45+00:00",
    "content": [
        {
            "text": "Louisa Munton is headteacher of Shirehampton Primary School, a large school, including a Nursery (taking children from 2 years old) and Specialist Resource Base (for children with EHCPs and a primary need of SEMH), situated on the outskirts of North Bristol. In this blog she talks about how they have reduced persistent absences by introducing a new way of communicating with parents."
        },
        {
            "text": " "
        },
        {
            "text": "Keeping an open mind to new methods"
        },
        {
            "text": "After some careful thought, I decided to put Shirehampton forward to participate in the Behavioural Insights project being trialled in Bristol. A Local Authority colleague had suggested it may be something that could further support our ongoing efforts to improve attendance and reduce persistent absence."
        },
        {
            "text": "The project allowed us to trial different methods of communicating with parents via text to boost pupil attendance. It gave us template text messages that enabled us to communicate with parents in a different but effective way. This was brilliant and immediately reduced the time needed to carefully craft messages regarding absences. It also helped us to be more proactive, identifying and focusing on the families most in need of help."
        },
        {
            "text": "Communicate, communicate, communicate"
        },
        {
            "text": "Each week we sent out messages to the parents and guardians of children whose attendance was below 95%, where we were not aware of the reasons for their absence. These text messages created an open channel for us to communicate with parents and allowed us to discuss the importance of good attendance."
        },
        {
            "text": "Responses from our parents have been positive and they are receptive to exploring the best ways that they could support their child's attendance."
        },
        {
            "text": "By talking about attendance in the number of days absent, rather than using percentages, parents better understand the impact of missing school on their child’s education. These open conversations also allowed us to see the difficulties families were facing and meant we could signpost them to avenues of support both inside and outside of school."
        },
        {
            "text": "Work in partnership"
        },
        {
            "text": "We ensure we are fair and consistent with all parents and work hard to support them to ensure that their children regularly attend school. By actively listening to them, we can work together to improve their child’s attendance. We also celebrate even the smallest improvements in attendance. Acknowledging these successes is key, and results in their children being more regularly in school, enjoying learning and benefitting from the social interaction that school brings."
        },
        {
            "text": "Complement the existing and the new"
        },
        {
            "text": "These text messages complemented our existing approach allowing us to work in partnership to identify the barriers to good attendance and finding solutions that worked for all. Our attendance levels have improved and are more stable. We’re particularly proud of the difference this has made for our target groups of children eligible for pupil premium and those with special educational needs."
        },
        {
            "text": "We still use the same text messages, and they continue to yield positive results; parents now appreciate the attendance communication rather than dread it."
        },
        {
            "text": " "
        },
        {
            "text": "Get support to improve and maintain attendance"
        },
        {
            "text": "Find out more  in the Behavioural Insights Team’s how-to guide for increasing attendance with parent messages. For general information and guidance on how schools, trusts and local authorities can maintain high levels of school attendance, you can read our guidance on school attendance, as well as our attendance best practice framework. "
        },
        {
            "text": " "
        }
    ]
}