{
    "url": "https://ace.blog.gov.uk/2022/02/04/welcome-to-the-ace-blog-making-mission-led-innovation-a-reality/",
    "title": "Welcome to the ACE blog: making mission-led innovation a reality",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Data",
        "People and skills"
    ],
    "pub_date": "2022-02-04T15:22:39+00:00",
    "content": [
        {
            "text": "Technology and data are evolving at an exponential pace, reaching ever further into almost every aspect of our lives. But while progress and innovation bring us new devices, apps, software and services, it can be a challenge to keep up with all the opportunities — and threats — they present."
        },
        {
            "text": "The Accelerated Capability Environment (ACE) — was established to solve that problem for public sector organisations, initially those responsible for public safety and law enforcement. It’s a fact that some of the earliest adopters of new technology are criminals and others wishing to do harm. And traditional mechanisms for developing or procuring systems and tools to meet such threats struggle to move fast enough."
        },
        {
            "text": "So in 2017, ACE was launched within the Office for Security and Counter Terrorism (OSCT) in the Home Office, and is now part of the Homeland Security Group."
        },
        {
            "heading": 2,
            "text": "An experiment in innovating at pace"
        },
        {
            "text": "It began as something of an experiment — to find new ways to address the fast-moving and complex challenges arising from this relentless march of tech and data and to match its pace in doing so."
        },
        {
            "text": "The experiment was a success and the ACE model has since been applied to diverse challenges from customers ranging from the Maritime and Coastguard Agency to HMRC and the NHS."
        },
        {
            "text": "At its heart, ACE is a partnership between the public sector and industry, academia and the third sector. We describe ACE and being ‘powered by Vivace’ which refers to our supplier community which brings the latest thinking, capabilities and expertise to bear on the problems customers bring to us."
        },
        {
            "text": "This community has grown to more than 300 organisations, each selected for its ability to meet the ever-changing needs of novel solutions to those problems and to do so rapidly."
        },
        {
            "text": "Pace is a watchword for ACE. Working to agile methods, we aim to provide tangible results within 12 weeks of starting a piece of work, or commission as we call them."
        },
        {
            "heading": 2,
            "text": "Collaboration and diversity of thinking"
        },
        {
            "text": "Innovation and collaboration are our other key watchwords. ACE is not a shop — if a customer knows exactly what they want and just needs a means of building or procuring it, we’re not the right vehicle for them. If a piece of work doesn’t meet the right criteria for using ACE, we won’t take it on."
        },
        {
            "text": "We strive for true innovation, both in terms of really challenging the problem presented to us and thinking creatively about how to address it, and in how we bring together and mobilise the right talent and capabilities to do that."
        },
        {
            "text": "More often than not, we put together a ‘rainbow team’ drawn from multiple suppliers to create the right blend."
        },
        {
            "text": "We explore the art of the possible, developing proofs of concept and taking solutions through to alpha and beta stages. We then explore opportunities for exploitation — the right mechanisms for taking those solutions on into procurement and live service."
        },
        {
            "text": "Driving the tempo of this innovation, collaboration and pace is the ACE core team which spans delivery and project management, technical expertise and assurance, operations, finance, supply chain, events and communications."
        },
        {
            "text": "This blog will explore in more depth how ACE operates, the work we do and, crucially, the people, culture and ways of working that make it such an effective way of delivering mission-led innovation at pace."
        },
        {
            "text": "We’ll also look at what we mean by innovation, particularly ‘mission-led innovation’, how our customers play a crucial role in commissions, and how new customers can engage with ACE."
        }
    ]
}