{
    "url": "https://traderemedies.blog.gov.uk/2022/02/04/working-life-at-the-trade-remedies-authority-our-hybrid-working-pilot/",
    "title": "Working life at the Trade Remedies Authority: our hybrid working pilot",
    "authors": [
        "Steve O'Donoghue, Director of Corporate Services"
    ],
    "categories": [
        "hybrid working"
    ],
    "pub_date": "2022-02-04T12:49:25+00:00",
    "content": [
        {
            "text": "As a newly created non-departmental public body established on 1 June 2021, our Board and leadership team are determined to build a culture where everyone enjoys coming to work."
        },
        {
            "text": "Now that the UK is an independent trading nation, the Trade Remedies Authority (TRA) has been established to defend UK economic interests against unfair international trade practices. Our vision is to be a globally respected trade remedies body.  We’re therefore focused on building our workforce and expertise to achieve that, underpinned by good terms and conditions and a positive work-life balance for our people. You can read more about what we do on gov.uk."
        },
        {
            "text": "We’re a small Authority, of around 150 staff.  We want to ensure a strong staff voice in the big decisions we make, so we set up a Staff Voice Forum. The Forum consists of representatives from across all business areas of the Authority."
        },
        {
            "text": "As with many other organisations and businesses, currently top of the people agenda is hybrid-working in a post-coronavirus (COVID-19) world. Should we revert to a predominantly office-based way of working, or should we find new ways of working, learning from our lockdown experiences? That is the question we posed to our Staff Voice Forum back in June last year, with a request to report back to our senior team in September with a set of proposals for future ways of working."
        },
        {
            "text": "Our Staff Voice Forum did a phenomenal job! They researched externally, looked at what were doing, what other businesses and organisations were doing, and what wider research was saying. They engaged extensively internally too, through team meetings, all-staff café conversations, a survey and talking with our senior managers’ group. From all that engagement, the Forum created a set of hybrid-working principles. The principles seek to find the perfect balance between delivering impressive results and caring for the individual needs of each and every colleague at the TRA."
        },
        {
            "text": "All teams have agreed a Hybrid Working Charter, setting out their commitments as a team to work to those principles. The Forum developed a range of supporting tools with HR to help embed working to the principles, such as an intranet page, Q&As, team charter tips, and a range of training materials (such as leading inclusive teams, resilience and top tips for line managers)."
        },
        {
            "text": "Unlike some organisations, we are not currently setting a minimum expectation for office working – say 2 or 3 days a week in the office – but instead have empowered each team to determine what will best work for them and the work they need to deliver, taking account of how they need to engage with others, internally and externally, too."
        },
        {
            "heading": 2,
            "text": "TRA Hybrid Working Principles"
        },
        {
            "text": "As a cohesive TRA, we will…"
        },
        {
            "heading": 3,
            "text": "Our People"
        },
        {
            "heading": 3,
            "text": "Our Culture"
        },
        {
            "heading": 3,
            "text": "Our Workplaces"
        },
        {
            "text": "We are piloting this approach as we feel it is too early to set in stone any long-term policy changes about how we work without fully understanding the impact of such changes. COVID-19 safety remains an important factor that continues to influence decisions about how to work, so we’re taking a very considerate approach to staff anxieties and concerns around it."
        },
        {
            "text": "We’re going to learn as we go through the pilot: colleagues can use a dedicated intranet page to post feedback, questions or suggestions on how it’s going. We’ll be experimenting with a few different approaches, such as how we use our office space in Reading and what equipment we use to support hybrid meetings."
        },
        {
            "text": "You’ll see from the principles that providing an inclusive, safe and supportive working environment is fundamental to us. We’ve agreed some evaluation mechanisms, such as the feedback loop, staff surveys, and staff retention levels, and above all, asking ourselves whether the approach we’ve chosen helps us to achieve our purpose in an efficient and effective way."
        },
        {
            "text": "As a UK-wide authority, it’s that we’ve been able to attract people from all countries of the UK to work here. We’re very conscious that research is saying that workplace flexibility is key to attracting and retaining top talent, and that providing this flexibility is more likely to support a more diverse workforce."
        },
        {
            "text": "That brings us full circle to the start of this post – we’re building expertise in work that hasn’t been done in the UK for almost 50 years. To undertake that work in the best possible way, we must be able to attract, develop and retain a diverse workforce, where our people enjoy coming to work, whether that’s in the office, at home, on a site visit or elsewhere. And that’s what our hybrid-working approach is all about – supporting our great TRA people to deliver great TRA business."
        },
        {
            "heading": 2,
            "text": "Join us!"
        }
    ]
}