{
    "url": "https://educationhub.blog.gov.uk/2023/07/turing-scheme-record-successful-applications/",
    "title": "Turing Scheme – record successful applications",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Schools",
        "Skills",
        "Universities"
    ],
    "pub_date": "2023-07-15T09:15:57+01:00",
    "content": [
        {
            "text": "The Turing Scheme is the UK government’s work and study programme, helping students and pupils to benefit from lifechanging overseas opportunities."
        },
        {
            "text": "It gives pupils, learners and students in UK schools, colleges, and universities the chance to learn new skills, travel the world, and boost their employability, all while learning about different cultures."
        },
        {
            "text": "The Turing Scheme also aims to widen access to international opportunities. This academic year, almost two thirds of the applicants due to take part in the scheme are from disadvantaged backgrounds."
        },
        {
            "heading": 3,
            "text": "Who will be participating in The Turing Scheme this year?"
        },
        {
            "text": "The Turing Scheme is open to a wide range of eligible organisations including schools, colleges and universities. Projects that provide opportunities for those from a disadvantaged background are especially encouraged."
        },
        {
            "text": "This year, there were more applications to the Turing Scheme than ever before. Schools, colleges and universities across the UK will share almost £105 million to fund placements around the world for more than 40,000 pupils, learners and students. This is up from last year’s 38,000 participants and 60% of the placements are planned for participants are from disadvantaged backgrounds."
        },
        {
            "text": "The full list of successful organisations including higher education providers, schools, and further education and vocational education and training providers who have been awarded funding is available on the Turing Scheme website."
        },
        {
            "heading": 3,
            "text": "What will participants do with Turing Scheme funding?"
        },
        {
            "text": "Funding from the Turing Scheme will allow pupils, learners and students to take up study or work placements in over 160 destinations across the world including Tanzania, Fiji, South Korea and Australia – alongside European destinations like Spain and France."
        },
        {
            "text": "Work and study placements allow participants to experience other cultures and learn vital skills for life and work, regardless of their background."
        },
        {
            "text": "Find out more about what participants have done in previous years here."
        },
        {
            "heading": 3,
            "text": "How do I apply for Turing Scheme funding next year?"
        },
        {
            "text": "Schools, colleges, and universities apply for projects on behalf of their students and receive funding per participant."
        },
        {
            "text": "Information on Turing Scheme funding for 2024-25 will be made available later this year."
        },
        {
            "text": "Organisations can take a look at the Programme Guide here to find out more about whether to apply and what your project could involve."
        }
    ]
}