{
    "url": "https://educationhub.blog.gov.uk/2022/02/02/education-secretary-nadhim-zahawi-what-levelling-up-means-to-me/",
    "title": "Education Secretary Nadhim Zahawi: What levelling up means to me",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Families",
        "Schools",
        "Skills"
    ],
    "pub_date": "2022-02-02T00:01:39+00:00",
    "content": [
        {
            "text": "This week the Government launched its plan to level up the country so that every person can have exactly the same opportunity to make the most of their abilities and succeed in life. Education plays a key part in that and you can read more about what we're doing here. "
        },
        {
            "text": "Education Secretary Nadhim Zahawi has written about why levelling up is so important to him. "
        },
        {
            "text": "This country is one of the greatest in the world. Inch for inch, pound for pound, it has always punched far above its weight. Our athletes, our inventors, our artists, our businessmen and women, all of them mark this country out as a very special place which can transform lives."
        },
        {
            "text": "I haven’t had what you’d call a traditional background for a government minister, having arrived in this country as an 11-year-old boy who fled Iraq under Saddam Hussein with my family. I was unable to speak a word of English and hid at the back of the classroom."
        },
        {
            "text": "The support I received from my teachers was life changing and I want to make sure that no matter where that young boy from Iraq goes to school, he has the chance to succeed."
        },
        {
            "text": "Put simply, while talent is equally spread, the same can’t always be said for opportunity. That is why this government has been so committed to levelling up."
        },
        {
            "text": "I want everyone to have a chance to see their potential flourish."
        },
        {
            "text": "The Levelling Up White Paper sets out how we are going to achieve it. It is going to set new targets to raise school standards and outcomes for skills, schools, and families across the country."
        },
        {
            "text": "It is everyone’s right to have a great, world-class education and schools have a key role to play in levelling up."
        },
        {
            "text": "We are setting the bar higher for schools: we want  90 per cent of children in England to reach the expected standard in reading, writing and maths by 2030 – making sure pupils leave primary school with knowledge and skills needed to excel at secondary school and beyond."
        },
        {
            "text": "We have identified 55 cold spots, like Suffolk, Isle of Wight and County Durham, where children are just not achieving what they should be and we will target intensive investment, support and action into these areas."
        },
        {
            "text": "Schools that have been judged less than Good in their previous two successive Ofsted inspections could be moved into strong multi-academy trusts. In this way they can get the support they need to improve, and that includes attracting the best teachers."
        },
        {
            "text": "Many of our skills reforms are already well under way. Apprenticeships, T levels, Institutes of Technology are all part of this skills revolution. We are building one of the best technical education systems in the world that is going to drive prosperity at a local level as well as a national one."
        },
        {
            "text": "But to make sure our skills mission hits its mark, we have set ourselves a target of  200,000 more people successfully completing high-quality training each year by 2030. This includes 80,000 more people completing courses in areas of England with the lowest skills levels."
        },
        {
            "text": "Skills are the great leveller and I am setting up a new Unit of Future Skills, which will act on data and evidence of where skills gaps exist and in what industries. Data will be our great ally."
        },
        {
            "text": "On top of this, thousands more adults will be able to access free, flexible training and get the skills needed in sectors that are booming, like green technologies, digital and construction. This is part of an additional boost to expand Skills Bootcamps to support employers across the country, particularly SMEs, to get the skilled people they need to grow."
        },
        {
            "text": "For those children with special educational needs and disabilities, levelling up must be even more ambitious. Our £18 million Supported Internship scheme will help more people into sustained paid employment. We are also making better respite care available for those who care for children with SEND."
        },
        {
            "text": "Councils will get an extra £30 million for the next three years to set up more than 10,000 additional respite placements for vulnerable children, giving families some much-needed short-term relief and a bit of a rest in their caring responsibilities."
        },
        {
            "text": "By investing in people, we are going to reverse the postcode lottery of life. In future we will see opportunity spread more equally across the country. Everyone has a part to play in our national success story and we are committed to unleashing each child’s potential."
        },
        {
            "text": " "
        }
    ]
}