{
    "url": "https://naturalengland.blog.gov.uk/2022/02/02/greener-farming-advice-during-the-agricultural-transition-period/",
    "title": "Greener farming advice during the agricultural transition period",
    "authors": [
        "Rob Cooke"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2022-02-02T09:22:48+00:00",
    "content": [
        {
            "text": "I’m fortunate to be the Director of the Greener Farming and Fisheries Programme in Natural England. There’s a wide remit under the greener farming umbrella but one area that I want to focus on here is Natural England’s role in delivering advice to farmers and landowners for nature’s recovery."
        },
        {
            "text": "January 2021 saw the start of the seven-year transition away from EU rules and the end of the Common Agricultural Policy (CAP). The Government has set out how Basic Payment Scheme direct payments will be phased out over the period to 2027-28 and delinked from the need to farm in 2024. Evidence shows that agricultural businesses rely heavily on these payments to remain profitable. Instead of these direct payments, incentives will be introduced to encourage more environmentally friendly practices based on public money for public goods."
        },
        {
            "text": "Farming activity covers 70% of England’s land - all our natural and semi-natural habitat (at least 2m hectares including 39% of Sites of Scientific Interest) is either managed or affected by the way it is farmed. In turn, this directly links to the quality of our landscapes, the health of our ecosystems and the benefits they bring to society."
        },
        {
            "text": "As part of the biggest change to English agricultural policy in decades, by 2024, Defra will have fully introduced three new environmental land management schemes that will be open for applications:"
        },
        {
            "text": "• the Sustainable Farming Incentive (SFI)\n• Local Nature Recovery (LNR)\n• Landscape Recovery (LR)."
        },
        {
            "text": "Undoubtedly, this means transforming the way we manage and deliver advice in Natural England, so we are ready for the future. This is a big change for farmers and land managers, as well as our farm advisers in Natural England."
        },
        {
            "text": "Natural England has a key role during the transition period. Over the next two years, we will continue to advise farmers and land managers on their existing Higher Level Stewardship and Higher Tier agreements until they expire. We’ll also be advising new Countryside Stewardship applicants, improving support to existing agreement holders to deliver more for nature recovery, evolving the advice offer to cover new schemes and emerging priorities such as air quality, flood risk mitigation, net zero and wider carbon management, and by expanding Catchment Sensitive Farming."
        },
        {
            "text": "Defra is testing and piloting different approaches including the balance of commercial and public sector advice to support the changes. Given the scale of the work and the resulting need for advice, there is unlikely to be sufficient capacity within the commercial sector to meet this need in the short- to medium-term."
        },
        {
            "text": "Natural England is keen to explore with partners, farmers and land managers, potential training and accreditation options to support ‘farmer-to-farmer’ advice, share evidence and knowledge and help the commercial advice sector grow."
        },
        {
            "text": "Natural England’s role in delivering advice for future schemes"
        },
        {
            "text": "First, we know that we won’t have an advice role in delivering the SFI as this will be supported through written guidance alone. We are, however, using our expertise to design and shape that guidance so that it’s easy to understand and simple for farmers to deliver on the ground."
        },
        {
            "text": "Secondly, our advice role for LNR may see more of a focus on agreements that include protected sites/species and other high priority or complex challenges where the statutory adviser role is key. We will need to work differently, providing a greater focus on landscape scale change and supporting partnership working to deliver and benefit from government reforms. A ‘mixed economy’ of commercial and agency advisers is likely to deliver advice for LNR and NE welcomes the opportunity to work in partnership with industry."
        },
        {
            "text": "Thirdly, we will be a delivery partner for Landscape Recovery (species recovery element). We are working through the full detail on how we will work with Defra on this. We aim to establish a local approach to scheme delivery, strongly aligned with our leadership in establishing the Nature Recovery Network. We will use our experience of setting up the successful CS Facilitation Fund agreements to bring people together to share best practice and deliver at scale and will continue to deliver at landscape scale through advice on CSF and agri-environment scheme delivery."
        },
        {
            "text": "The policy landscape is shifting significantly and advice to support the agricultural transition and beyond also needs to adapt and evolve. Natural England has considerable experience and depth of expertise in terms of frontline advice delivery backed up by national specialists."
        },
        {
            "text": "The likely scale of demand for advice needed to deliver Government ambitions exceeds that which Natural England can deliver alone. While we will invest further in our capability and capacity, new and existing partnerships will be vital to develop and grow the advisory capacity sufficiently, to ensure that farming and land management businesses receive the best advice to deliver nature recovery. And that, ultimately, achieves thriving nature for people and places."
        },
        {
            "text": " "
        },
        {
            "text": "Rob Cooke is the Director of the Greener Farming and Fisheries Programme in Natural England."
        }
    ]
}