{
    "url": "https://digitaltrade.blog.gov.uk/2022/02/02/how-were-building-our-service-assessment-function-in-dit/",
    "title": "How we’re building our service assessment function in DIT",
    "authors": [
        "Monica Beaton, Service Assessment and Assurance Manager"
    ],
    "categories": [
        "Culture",
        "People and Skills"
    ],
    "pub_date": "2022-02-02T11:48:23+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introducing service assessment to DIT"
        },
        {
            "text": "The Central Digital and Data Office (CDDO) at the Cabinet Office sets the cross-government Government Service Standard and procedures. Central government departments working on a transactional service are required to get their services assessed against these standards before they can proceed to the next stage of development."
        },
        {
            "text": "As CDDO only assess services likely to handle more than 100,000 transactions or serve staff in more than one organisation, many of the Department for International Trade (DIT)’s services do not fall in scope. So, we recently introduced a service assessment model into our governance process to deliver the Digital, Data and Technology (DDaT) team’s commitment to building great services which meet user needs. It also means we can share best practice with other government departments and learn if problems have already been solved, ensuring we reduce duplication."
        },
        {
            "text": "CDDO has made a lot of guidance and support available to departments and teams. We are also lucky as many government departments already have internal assessment functions that we have been able to learn from. This has made developing our function much easier."
        },
        {
            "text": "Service assessments are peer reviews of products and services by DDaT specialists. As part of this process, we encourage interactive and open discussion. We use service assessments to continue to build and maintain services to a high standard and add value. Assessments are transactional. ‘Information’ is exchanged to assess if the service is following the standards and the result is a ‘met,’ ‘met with conditions’ or ‘not met’ decision. It seemed appropriate to follow agile methodology to build our own function."
        },
        {
            "text": "To start the process, we conducted an eight-week discovery phase which included:"
        },
        {
            "text": "The approach we have agreed for DIT is to follow the Government Service Standards, but with an additional focus on how we work with data and value for money, because these are priorities for us."
        },
        {
            "text": "Now in private beta, we are testing the approach with some of our services. We are assessing six services from our five DDaT portfolios, all at different phases of the project lifecycle. In total we will assess one service in discovery, two in alpha, one in private beta, and two in public beta. We are already starting to gain valuable insight into what our public beta for service assessment could look like."
        },
        {
            "heading": 2,
            "text": "Learning opportunities"
        },
        {
            "text": "Introducing service assessment to DIT is a great learning opportunity. Panel members gain insight into the DDaT function of DIT and the services and products it delivers, support other teams to build great services, and learn skills needed across all Government departments. To date, we have trained around 40 new service assessors. Some are already taking part in assessments and others awaiting observation opportunities before they take on roles as panel members."
        },
        {
            "text": "Learning from colleagues in other Government departments, we are taking steps to embed service assessment into our ways of working. These include:"
        },
        {
            "heading": 2,
            "text": "Putting users first"
        },
        {
            "text": "Our first service assessment using this approach was in December 2021. Ensuring we meet user needs is difficult, as assessment adds time and complexity to service development. However, the feedback received so far is generally positive. Service teams want independent peer review, support, and guidance and this process provides that. Assessment panels learn about other DDaT teams and can re-use the ways of working and processes, so it’s a win-win."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We are still at the beginning of our service assessment journey. We would be interested to hear from others who have completed any assisted digital or accessibility testing on a service assessment process. Most of our assessments are currently ‘virtual’ and we want to make sure everyone who needs to take part, can. If you are a service assessor in another government department and are keen to help us in an assessment, please get in touch."
        },
        {
            "text": "There is still a lot to do and there will be more blogs to keep everyone up to date and share our lessons learned."
        }
    ]
}