{
    "url": "https://civilservice.blog.gov.uk/2022/02/02/inside-policy-unlocking-the-potential-of-young-people/",
    "title": "Inside Policy: Unlocking the potential of young people",
    "authors": [
        "Debbie Alder"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-02-02T10:34:30+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Since 2014, the Civil Service has provided around 6,000 work placements every year to jobless youngsters. Here, Debbie Alder explains how Movement to Work helps crack the vicious ‘no experience - no job’ cycle to help youngsters nail their first step on the job ladder."
        },
        {
            "text": "Young people have had it tough during COVID-19 – opportunities halted, social lives curtailed and in DWP we saw a 115% rise in young people claiming benefits at the height of the pandemic. While things have improved economically since 2020, there remains a significant gap in youth unemployment compared to the national picture. Supporting this important group, supporting those who are the future of our country, the future of our country’s success, has never been more important as an aspiration. "
        },
        {
            "text": "Movement to Work (MtW) as an organisation supports employers to provide work placements that combine employability skills training with on-the-job experience. "
        },
        {
            "text": "I got involved seven years ago, representing the Civil Service on the Steering Group along with the CEOs of M&S, BT, Centrica, Accenture, BAE Systems, Princes Trust, CBI and a senior TUC leader. "
        },
        {
            "text": "Abuse, addiction and poverty"
        },
        {
            "text": "Over the years, I’ve seen the impact we can have in providing structured and quality work experience for a young person on benefits. I’ve talked to young people facing significant barriers, such as abuse, addiction, poverty and mental health issues, who have been supported by partners such as the Princes Trust and DWP Jobcentres to help link them to placements and into permanent jobs and careers. It is both humbling and inspiring to hear their stories. "
        },
        {
            "text": "Vicious circle"
        },
        {
            "text": "The ambition is to break the vicious circle of ‘no job – no experience’ that prevents young people who currently aren’t in education, employment or training from stepping onto the career ladder. This is vitally important, as it is well documented that there’s a scarring effect of unemployment, if experienced at the early stages of a young person’s career.   "
        },
        {
            "text": "Lasting social change"
        },
        {
            "text": "By supporting organisations in providing quality vocational employment and work experience placements, MtW helps both to drive business performance and bring about lasting social change. While MtW works with some of Britain's leading employers, the Civil Service has been very much involved since MtW was created. "
        },
        {
            "text": "Since 2014, the collective Civil Service commitment to this national programme has historically been around 6,000 MtW placements a year across departments, with each placement lasting four to six weeks. "
        },
        {
            "text": "Pandemic pause"
        },
        {
            "text": "Unfortunately, in March 2020, MtW placements across government were paused due to the pandemic and face-to-face delivery ceased to be a viable option. That had really difficult consequences because, despite a move to virtual delivery and the increasing need for these crucial placements, the number of placements delivered reduced dramatically."
        },
        {
            "text": "However, MtW has continued to deliver and recently celebrated the milestone of enabling 135,000 placements for young people with a success rate of 56% of participants moving into education, training or employment. The Movement is now keen to build on this success and set an ambitious target for future delivery. "
        },
        {
            "text": "Life-changing opportunity     "
        },
        {
            "text": "For some young people, MtW is a genuinely life-changing opportunity which develops new skills, improves job prospects and can lead to full-time and permanent employment.  "
        },
        {
            "text": "Bridge into work"
        },
        {
            "text": "As the Director General for People, Capability & Place in DWP, I’ve seen first-hand how MtW can make a difference to the lives of young people as well as being of benefit to the department. "
        },
        {
            "text": "MtW is a fantastic way of reaching further into society and helping young people bridge into work.  It strengthens the policy thinking and insight we have if we’re delivering through partners, so it’s not just about big operational departments; it’s about bringing in that diversity of experience to really strengthen and ensure our relevance as departments of state – part of levelling up."
        },
        {
            "text": "Huge thanks"
        },
        {
            "text": "I’d like to take this opportunity to say a huge thank you to those who continue to work hard to find opportunities for young people and make MtW a success.  And of course personally, I’d like to extend my thanks to the courageous and determined work coaches within DWP who do a very valuable role in challenging circumstances.   "
        },
        {
            "text": "There’s more to do and I believe passionately that across the Civil Service we can play a vital role as we come out of the pandemic, and life and our work begins to return to some degree of normality."
        },
        {
            "text": "I’d like to encourage you – everyone across the Civil Service, be this at departmental, executive agency or directorate level – to consider virtual, face-to-face, or hybrid MtW placements within your area as the need to help young people into work remains paramount."
        },
        {
            "text": "Together, we can make a real difference. We transform lives every day in the Civil Service and this is our chance to give just a little bit more, at a time when the challenges young people face remain high.        "
        },
        {
            "text": "If you would like to offer a placement or require more details about running a virtual MtW placement, please contact the central DWP MtW team at MOVEMENTTO.WORKSCHEMEADMIN1@DWP.GOV.UK"
        }
    ]
}