{
    "url": "https://ruralpayments.blog.gov.uk/2022/02/02/the-rural-payments-agency-rpa-supporting-rural-mental-health/",
    "title": "The Rural Payments Agency (RPA) supporting rural mental health",
    "authors": [
        "Carrie Smith"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Getting online and support"
    ],
    "pub_date": "2022-02-02T14:11:14+00:00",
    "content": [
        {
            "text": "We can all play a part in helping people whose mental health is at risk. The smallest act can go a long way. Here at the RPA we are taking this seriously and looking at what we can do to support farmers. We know stress is a real concern in the industry and that there are many factors which contribute to this, some of which are linked to agricultural transition and uncertainty over the future of farming. Some of this is practical about how we engage, and some is about how we communicate."
        },
        {
            "text": "How we plan to help reduce stress and improve the mental health of our customers"
        },
        {
            "text": "In practical terms the changes to how we approach inspections for domestic agreements will make our interactions more open. The chance for farmers to respond to findings earlier and getting rid of penalties should reduce some of the anxieties around regulation and compliance. We know the Covid-19 pandemic had a huge impact on farmers and the knock-on effects continue to be a cause of stress. We’re continuing to review our processes ahead of the opening of the BPS application and Countryside Stewardship and Environmental Stewardship claim window, to make sure we have support in place so that no one is disadvantaged."
        },
        {
            "text": "We’re listening to feedback from groups we work with and are working closely with colleagues in Defra to provide information and clarity around future farming and opportunities."
        },
        {
            "text": "We are looking at our communication, so expect to see more videos, podcasts and direct customer contact, all with a view to setting out options as clearly as we can and encouraging farmers to plan for the future."
        },
        {
            "text": "Support from farming help organisations"
        },
        {
            "text": "We work with some great organisations who support farmers. Through the Royal Agricultural Benevolence Institution – or RABI – members of farming communities across England and Wales can access a new, completely free counselling service. Accessed by a free 24/7 confidential helpline, they will put you in touch with a counsellor within 24 hours, without the need for a clinical referral. They know that talking to someone who understands the challenges and pressures of farming can really help, and this support is available over the phone, via video or in person."
        },
        {
            "text": "You can contact them on 0800 188 4444 or email them at help@rabi.org.uk  - Contact us – RABI"
        },
        {
            "text": "The Farming Community Network also have an established helpline. They run a confidential, national helpline and e-helpline which is open every day of the year from 7am to 11pm. Volunteers provide free, confidential, pastoral and practical support to anyone who seeks help, including those experiencing stress, depression or isolation. Again, speaking to someone who understands can make a real difference and we encourage anyone who needs to, to reach out to us or one of these organisations."
        },
        {
            "text": "You can contact them on 03000 111 999 or email them at  help@fcn.org.uk  -  Contact FCN - Farming Community Network"
        },
        {
            "text": "The national Farming Help Charities have recently launched new awareness raising sessions with a focus on stress management, succession and planning for the future of the farm business. You can read more on their blog here."
        },
        {
            "text": "It’s OK to ask for more support to get you through a difficult time. There is help available and RPA are keen to do everything we can to enable you to access information, and make decisions on what’s right for you and your business as you navigate the transition."
        }
    ]
}