{
    "url": "https://educationinspection.blog.gov.uk/2022/02/02/what-to-expect-on-a-primary-deep-dive-some-guidance-for-subject-leaders/",
    "title": "What to expect on a primary deep dive – some guidance for subject leaders",
    "authors": [
        "Heather Fearn",
        "Jonathan Keay"
    ],
    "categories": [
        "curriculum",
        "deep dives",
        "schools"
    ],
    "pub_date": "2022-02-02T11:23:25+00:00",
    "content": [
        {
            "text": "Heather Fearn and Jonathan Keay, Her Majesty’s Inspectors from Ofsted’s curriculum team, discuss some key points about what primary subject leaders (especially small primary schools) can expect from deep dives. This blog builds on our previous blog about the simple focus of deep dives."
        },
        {
            "heading": 2,
            "text": "Do leaders of a subject need to be specialists?"
        },
        {
            "text": "In primary schools, particularly small ones, we know that staff wear lots of hats. In small schools, it may be the headteacher who oversees all subjects. It often isn’t possible or realistic to develop detailed expertise in multiple subject areas – neither do we expect you to. What is important is that, as a collective, staff give careful thought to the content they want pupils to be taught and to remember."
        },
        {
            "text": "To overcome the challenges of expertise in multiple curriculum areas, lots of schools work with other local schools to design their curriculum. Schools also make use of schemes of work that are developed by subject specialists. Ofsted does not consider it necessary for schools to design their curriculums themselves. Whatever it is you do, it hasn’t got to be all singing and dancing. Your curriculum just needs to be ambitious and coherent."
        },
        {
            "heading": 2,
            "text": "What about small primary schools?"
        },
        {
            "text": "In a typical year, Ofsted inspects around 1,300 primaries."
        },
        {
            "text": "Our inspectors will be aware of the impact of an inspection visit on teachers in a small school. Right from the first contact with the school, our lead inspectors will work with the headteacher to organise the inspection to manage the demands on each teacher."
        },
        {
            "text": "We also know that small schools won’t necessarily have the capacity to provide the same resources and experiences as larger schools. That is why the deep dive will focus on what matters most for the quality of each pupil’s education: whether pupils are learning the knowledge they need to achieve the goals of their education."
        },
        {
            "heading": 2,
            "text": "What will we talk to leaders of a subject about?"
        },
        {
            "text": "We’re likely to want to talk to whoever leads a subject as close to the start of a deep dive as possible. This helps us have a sense of the ‘big picture’. We’ll understand if the subject isn’t an area of specialism for you. What matters most is what you want pupils to learn and why. We don’t have any expectations about what paperwork schools provide and you can bring any notes you might wish to refer to during the discussion. It is up to you how you record and set out your curriculum expectations. We’ll ask questions and consider things like:"
        },
        {
            "text": "After exploring the overarching curriculum content with questions like the ones above, we’ll explore how you choose to teach and assess the content. During the discussion, we’re also likely to ask specifically about any lessons we are able to see as part of the deep dive. This helps us see your intended curriculum in action. We’ll hopefully be able to see the chunks we talked about being taught and practised. We’ll start to understand how well pupils are remembering the content and using it to understand more complex ideas or answer more complex questions. Remember that, if we do visit lessons, it isn’t to judge teaching."
        },
        {
            "heading": 2,
            "text": "Where can I find out more information about the education inspection framework, deep dives and subjects?"
        },
        {
            "text": "We’ve produced a number of videos that are available on our YouTube channel. The videos explain our thinking about curriculum and how this might translate to subjects. If you do take a look at our subject videos, remember that Ofsted doesn’t expect the language or principles that we share to be replicated in schools. Schools have the flexibility to organise their curriculums as they want to – and to adopt the language as they see fit. We hope that these additional resources prove useful in helping you determine what it is you want pupils to know and remember over time."
        }
    ]
}