{
    "url": "https://foresightprojects.blog.gov.uk/2025/03/27/how-merging-creative-design-and-futures-at-defra-led-to-collaborative-strategic-insights/",
    "title": "How merging creative design and futures at Defra led to collaborative strategic insights",
    "authors": [
        "mikeaskew"
    ],
    "categories": [
        "Trend Series"
    ],
    "pub_date": "2025-03-27T14:52:49+00:00",
    "content": [
        {
            "text": "By Emma Mutch, Defra"
        },
        {
            "text": "Introduction"
        },
        {
            "text": "Defra, in collaboration with Andthen, shares insights into how it developed a new horizon scanning capability and emerging trends and global megatrends outputs. Unique approaches and methods were used in this work, notably a highly diverse horizon scanning practice, the use of ‘future artefacts’ to bring emerging trends to life and developing a methodology for determining the origin points of global megatrends."
        },
        {
            "text": "Context"
        },
        {
            "text": "Defra wanted to build their evidence base on weak signals of change, emerging trends, and global mega trends. This could then be used to provide actionable insights on emerging opportunities and risks to inform decision-making at both executive and programme levels. Another aim was to raise awareness and literacy around strategic futures work, embed long-term thinking into policy and strategy and enhance practices in horizon scanning and trend development."
        },
        {
            "text": "Defra procured Andthen’s services via the GO-Science Futures Procurement Framework to deliver the following:"
        },
        {
            "text": "Beyond these products, the focus was on building a system for futures thinking that could evolve beyond Andthen’s involvement and be sustained by Defra. The products needed to be memorable, engaging and policy-relevant. "
        },
        {
            "text": "Horizon scans"
        },
        {
            "text": "The horizon scans were built from weak signals, identified by a diverse team of scanners covering various regions globally. Weak signals were captured daily, and each fortnight, six of the most novel signals were selected and developed into formal Horizon Scans with brief analysis."
        },
        {
            "text": "While scanning is a well-established futures method, this project intentionally aimed to significantly broaden the scope of its sources. Andthen brought together a team of scanners across three global regions and engaged additional scanners for focussed periods to source materials from places where information was more challenging to extract. The team also intentionally targeted fringe areas looking at subcultures, as well as the worlds of art and design to help source a diverse set of data."
        },
        {
            "text": "To make the insight effective and useable for Defra, scans were tagged with a key use case to help Defra colleagues quickly identify whether a scan was for information only, whether it spoke to an opportunity or risk, or whether it might give insight into an area for research prioritisation."
        },
        {
            "text": "Emerging Trends"
        },
        {
            "text": "As the horizon scans were created, they were clustered and tagged with recurring topics on an ongoing basis. This created the foundation for the generation of a set of ‘trends’ every six months. These trends would be longlisted, researched further, and then shortlisted before a final set of six would be selected based on their relevance to Defra’s priority outcomes and key active policy areas. These six trends were then developed into a six-monthly emerging trends publication."
        },
        {
            "text": "A crucial innovation was the use of futures artefacts —objects, behaviours, or situations which made the (sometimes abstract) trends more tangible. Rather than simply describing the emerging trends through analysis and weak signals, these artefacts allowed people to visualise representations of what the future might hold, and reflect on how these trends might appear in their everyday experiences."
        },
        {
            "text": "This was achieved through creatively extrapolating each emerging trend into future scenarios. The team identified opportunities and moments in these scenarios for future artefacts, and then often chose to visualise moments which might help a viewer consider key questions around the trend. This encouraged more active discussion about what these changes could mean for Defra’s work."
        },
        {
            "text": "Global Megatrends"
        },
        {
            "text": "The global megatrends (external version will be found on Science Search from mid-April 25) focussed on much larger drivers of change, orders of magnitudes larger than the emerging trends. These global megatrends were identified using a literature review (including Defra’s past research into global megatrends) and then were refined through a series of 12 challenge sessions with 44 international subject matter experts. The emerging trends were mapped against each global megatrend, indicating whether they were likely to support (i.e. speed up) or oppose (i.e. slow down) the respective megatrends."
        },
        {
            "text": "Rather than simply mapping out where trends are heading, the team developed a new methodology to determine the ‘origin points’ of each. Using a tight definition of ‘global megatrend’ was key to this, as we were able to argue that the point of ‘origin’ for each megatrend was the point from which a sustained change over time was visible in at least two continents, across at least two sectors or systems. Through using this origin point methodology, we were surprised to find that many of the global megatrends weren’t just measured in decades (as we expected), but in centuries or even millennia."
        },
        {
            "text": "If you are a civil servant and want to know more about Defra’s horizon scans, emerging trends and global megatrends, please reach out to futures.defra@defra.gov.uk."
        }
    ]
}