{
    "url": "https://ipo.blog.gov.uk/2025/03/27/uncorking-innovation/",
    "title": "Uncorking innovation ",
    "authors": [
        "Sara Jones",
        "Meg Davies"
    ],
    "categories": [
        "Patents"
    ],
    "pub_date": "2025-03-27T10:00:00+00:00",
    "content": [
        {
            "text": "As the nights get lighter and the weather gets a little warmer, perhaps your mind is starting to turn towards summer evenings spent outside enjoying a glass of white, red or rosé. Wine, like everything else, has plenty of hidden intellectual property (IP). From its branding, protected by trade marks, to ornate labels registered as designs, IP flows with each pour. My colleague Sara recently explored the origins of the corkscrew, the key that opens your favourite bottle, so today, we're diving into a key part of its IP and how it changed the game. It turns out that just like a good bottle, this invention has increased in value throughout time… "
        },
        {
            "heading": 3,
            "text": "The man behind the bottle "
        },
        {
            "text": "Believe it or not, the person wine enthusiasts have to thank for being able to open a bottle of their favourite tipple with ease this summer, is a member of the English clergy. Cheshire-born Reverend, Samuel Henshall, was granted the first patent for the corkscrew in 1795, and his patent, No. 2061 issued on 24 August 1795, represented a significant innovation in wine access technology. "
        },
        {
            "text": "Henshall's design wasn't the first corkscrew ever created - earlier versions had existed since the mid-17th century when cork became the standard bottle stopper, but his was the first to receive formal intellectual property protection. This was thanks to his clever addition of a disk that prevented the worm (spiral section) from going too far into the cork. This became known as the Henshall button, and the seemingly small invention made the device patentable, paving the way for the future of innovation in corkscrews.  "
        },
        {
            "heading": 3,
            "text": "From Georgian gamble to modern patent opportunity "
        },
        {
            "text": "The patent system of the late 18th century differed significantly from today's IP landscape. The application process was less rigorous and considerably more expensive in relation to average incomes, and protection lasted for 14 years rather than the 20 that modern innovators receive.  "
        },
        {
            "text": "This meant that for Henshall, securing a patent represented a substantial financial investment with uncertain returns, and for the Reverend, the patent for his corkscrew didn't lead to fortune. He dealt with financial debt throughout his life, and it's reported that upon his death in 1807, he was buried with the remaining stock of his corkscrews - a poignant symbol of an invention that, while revolutionary, failed to provide its creator with the financial rewards of his IP. "
        },
        {
            "text": "Although his patent may not have brought personal wealth, it certainly aged well over the centuries. To this day, the Henshall corkscrew remains a rare and valuable culinary device, and it has helped to shape the future of wine innovation. "
        },
        {
            "heading": 3,
            "text": "The twists and turns of modern innovation "
        },
        {
            "text": "Henshall's pioneering patent sparked a revolution in wine access technology that continues to this day. The simple button mechanism he introduced became the foundation for countless future innovations, including the double-helix \"waiter's friend\" corkscrew, patented in 1883 by Carl Wienke (US283731)  "
        },
        {
            "text": "In the modern day, wine opening technology showcases remarkable diversity, with designs ranging from electric models that remove corks at the touch of a button, to air-pressure systems that inject gas into bottles. One modern wine opening technology even allows users to pour wine from a sealed bottle without even popping the cork. The Coravin system, protected by a plethora of patents, including EP2844606, allows wine to be extracted without removing the cork at all - an innovation that may have seemed like pure magic to Henshall. "
        },
        {
            "heading": 3,
            "text": "Why IP protection matters – raising a glass to patents "
        },
        {
            "text": "Next time you pop open a bottle of wine, spare a thought for Reverend Henshall. While his patent may not have brought him personal fortune, his IP has enriched wine culture worldwide for over two centuries, and his innovation demonstrates the profound impact that protected ideas can have across generations. "
        },
        {
            "text": "Whether you're working on the next revolutionary corkscrew or an innovation in an entirely different field, protecting your IP is the first step toward ensuring your idea makes its mark on history.  "
        },
        {
            "text": "So, raise a glass to the corkscrew and the power of patents – and consider how protecting your own innovations might change the future! You can read more about applying for a patent in our guidance Apply for a patent: File your initial application - GOV.UK "
        }
    ]
}