{
    "url": "https://environmentagency.blog.gov.uk/2025/03/27/what-are-the-2024-edm-annual-returns/",
    "title": "What are the 2024 Storm Overflow EDM Annual Returns?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "EDM",
        "Environment Agency",
        "Rivers",
        "storm overflows",
        "Water"
    ],
    "pub_date": "2025-03-27T09:30:47+00:00",
    "content": [
        {
            "text": "Today, we published water company Event Duration Monitoring (EDM) Annual Return data for 2024, which can also be viewed on a map via the Storm Overflow portal, showing the frequency and duration of spills from storm overflows in England. EDM tracks the number of times a storm overflow is used (spill count) and for how long (spill duration)."
        },
        {
            "text": "The data for 2024 shows:"
        },
        {
            "text": "The data also shows that in 2024:   "
        },
        {
            "text": "What’s clear from this data is that storm overflow spill counts and duration remain at unacceptably high levels again in this year’s EDM Annual Returns. This is a result of longstanding underinvestment and poor asset maintenance, but this year marks the start of positive long-term changes."
        },
        {
            "text": "Why do water companies have storm overflows?"
        },
        {
            "text": "Without storm overflows, sewage and rainwater could back up into our homes through sinks, baths, showers and toilets."
        },
        {
            "text": "What’s the Environment Agency’s role?"
        },
        {
            "text": "We put permits in place for storm overflow operation to ensure they are only used when they should be – during times of rainfall and snowmelt. If storm overflows operate when they shouldn’t, they can affect the water quality in our rivers and coasts. EDM data helps to inform our inspections – we use it to identify which overflows have unusually high spill counts or durations to inform where to investigate.   When we find that water companies have broken the law, we take a wide range of actions – including prosecutions for the most serious offences."
        },
        {
            "text": "Our role is to take action which brings about the best outcome for the environment, and make sure those who pollute pay – depending on the severity and circumstances of a spill this can range from warnings to criminal prosecutions. For example, last year Severn Trent Water were fined £2million for raw sewage discharges; and Yorkshire Water paid £1million to two environmental and wildlife charities following an investigation by the Environment Agency."
        },
        {
            "text": "Crucially, we also always provide our expert advice and guidance to water companies on the issue to hold them accountable for their actions and to drive improvements. Take, for example, at a wastewater pumping station in Hampshire. Using EDM data, our officers could see that it was discharging an unusually high number of times. During their inspection of the station, they found that the site was breaching its permit and identified lots of other risks which could affect the storm overflow use. Southern Water is now addressing the concerns and non-compliances during our inspection to reduce the impact on the environment."
        },
        {
            "text": "What is EDM data used for?"
        },
        {
            "text": "Through our requirement on water companies to install event duration monitors on storm overflows, there is more monitoring in place than ever before, more than any other country in the world – which means that we are uncovering more spills than ever. Undoubtedly, the results from this year’s returns show that the current situation is far from where we want it to be; but what this data gives us is greater transparency, enabling greater scrutiny about the scale of the issue. It’s the evidence we need to drive tougher actions and underpin future planning, which will ultimately see spill counts reduce and support wider economic growth."
        },
        {
            "text": "The water industry is at the starting point to move towards real, positive change. However, while the trajectory for improvement related to planned investment will be long-term, we expect water companies to work hard to ensure the assets they have now are maintained and operated properly. Looking to the future, landmark changes this year include:"
        },
        {
            "text": "So, what does this all mean? From this year, water companies must ensure that they are prepared for changes which affect the pressure and demand on their sewage systems. "
        },
        {
            "text": "In order to do this, and make other environmental improvements, we have secured a record level of water company investment for storm overflow improvements. "
        },
        {
            "text": "As the EA, we’re tightening the rules around storm overflows so water companies must investigate poor performing overflows sooner. We will soon have increased legal powers which means we can take tougher actions against water companies which break the law."
        },
        {
            "text": "Reducing the use of storm overflows is vital to achieving cleaner, healthier waterways for both people and the environment. This is a long-term process, and we won’t see effects from these improvement changes overnight; but we’ve got the investment, mechanisms and legal powers in place to move closer towards a considerably better future.  "
        }
    ]
}