{
    "url": "https://defrafarming.blog.gov.uk/2022/08/08/common-land-findings-from-the-field/",
    "title": "Common land: findings from the field",
    "authors": [
        "Professor Julia Aglionby"
    ],
    "categories": [
        "environmental land management schemes",
        "Guest post",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-08-08T13:43:01+01:00",
    "content": [
        {
            "text": "Over the past 2 years, the Foundation for Common Land, in collaboration with the Federation of Cumbria Commoners, delivered a tests and trials project to look at commons. "
        },
        {
            "text": "Together, they explored how our environmental land management schemes should be developed to support commons.  "
        },
        {
            "text": "The work included how to assess public goods on commons, how to encourage collaboration and the advice and guidance required. In this post, I'll share more."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Commons are land owned by one person over which others hold rights of common, usually for grazing."
        },
        {
            "text": "This means multiple people are involved in a single scheme and this makes reaching and delivering an agreement more complex.  "
        },
        {
            "text": "Commons are only 3% of England but comprise 21% of England’s Sites of Special Scientific Interest by area and 39% of all open access land. "
        },
        {
            "text": "12% of all scheduled ancient monuments are found on commons and 82% of all common land is in National Parks or Areas of Outstanding Natural Beauty (AONBs)."
        },
        {
            "text": " It is essential that the future environmental land management schemes work well on commons to achieve the objectives of the 25 Year Environment Plan. "
        },
        {
            "text": "We worked with 6 Commons Associations to deliver the trial, assisted by local facilitators. Over 270 farmers and land managers participated. "
        },
        {
            "text": "The commons involved were Peter Tavy (Dartmoor), the New Forest, Minchinhampton & Rodborough (Gloucestershire), Brendon (Exmoor), Nether Wasdale (Cumbria) and Westerdale (North York Moors). "
        },
        {
            "text": "We held 4 national webinars attended by over 650 people, half of which were farmers.  I'll share the links to the webinars at the bottom of this post."
        },
        {
            "text": "We worked closely with the Rural Payments Agency (RPA), Ordnance Survey and Land App to explore better ways of mapping public goods on commons. "
        },
        {
            "heading": 2,
            "text": "Our findings"
        },
        {
            "text": "The main 3 findings were: "
        },
        {
            "text": "Commons require upfront investment to be ready for the future schemes. This is required for work ranging from data collection on environmental assets to up to date information on property rights and development of governance mechanisms. This funding requirement could range from a few thousand up to tens of thousands of pounds. Whatever the situation of the common, this will be needed and is significant. Quality data is key to planning how to enhance public goods. "
        },
        {
            "text": "Facilitation is essential for multi-partite agreements such as commons. We concluded independent facilitation is vital, both during application but also for delivery of agreements. Based on discussions, our facilitators observed that only a small number of highly experienced association secretaries and chairs would be confident and willing to lead an application themselves. Our workshops corroborated this. Facilitation underpinned the processes we tested helping a common prepare for the future schemes.  "
        },
        {
            "text": "Public goods outcomes will improve with advice and guidance. We tested a mixture of online and in-person guidance and commissioned specialist advice to fill gaps. We also developed a commons toolkit, which you can explore commons toolkit. Feedback suggested needs vary from common to common depending on skills and experience. Commons may be able to undertake some work themselves but will also need to commission specialist surveys and advice, which will need funding.  "
        },
        {
            "text": "We are continuing to support the design of future schemes through a current trial in which we work with lowland commons in the New Forest and the Malverns. "
        },
        {
            "text": "This trial explores how to incentivise farmers to participate and collaborate to deliver Landscape Recovery projects and test how payment might work, including how to construct long term agreements. "
        },
        {
            "heading": 2,
            "text": "Webinar links"
        },
        {
            "text": "Environmental land management and commons: what does the future hold? "
        },
        {
            "text": "Tests and trials: a progress update"
        },
        {
            "text": "Tests and trials: commons update and governance and financial management webinar"
        },
        {
            "text": "Environmental land management and commons: tests and trials conclusions and other scheme updates"
        }
    ]
}