{
    "url": "https://lifeathmrc.blog.gov.uk/2022/08/08/managing-together-part-5-discover-what-its-like-to-be-one-of-hmrcs-13000-managers/",
    "title": "Managing Together (part 5) - discover what it’s like to be one of HMRC’s 13,000+ managers",
    "authors": [
        "Nicola Barson"
    ],
    "categories": [
        "General",
        "Management"
    ],
    "pub_date": "2022-08-08T13:16:04+00:00",
    "content": [
        {
            "text": "In the fifth and final blog in our 5-part series on core manager functions, we hear from Ellie Gibson, who explains why measure and assure is essential in her team.  "
        },
        {
            "heading": 2,
            "text": "Measure and assure is crucial in everything we do "
        },
        {
            "text": "I work in CFO Shared Services dealing with all aspects of service and change including contact into Shared Services using iforms, telephony and web chat. I also lead the Onboarding team which takes the admin away from managers when new joiners start at HMRC. The team orders IT kit, keeps in touch with the joiner and manager, gets essential forms signed, signposts mandatory learning, confirms take up of duty and organises a digital ambassador session to help the new joiner get familiar with their IT kit. "
        },
        {
            "text": "When HMRC introduced the ‘5 core functions of a manager’ I was keen to start using these in my everyday role. These core functions were introduced for all managers across the organisation (at every grade, in every location) to offer clarity about their role and to showcase best practice.  "
        },
        {
            "text": "One of the core functions is ‘measure and assure’ which is about ‘measuring performance through output and outcomes and providing appropriate management assurance’.  "
        },
        {
            "text": "Within my team, measure and assure is not only about quantity and quality of the team’s work, but also about providing a great experience for our new joiners, making sure they have enough contact time with their colleagues to give them the best possible start in their new role.  "
        },
        {
            "text": "Measurement in our team is both numerical and quality driven. We have a ‘Purpose Statement’ which helps us all to understand what we should be aiming for. I like to take the time to discuss with the team, and with individuals, what these statements mean for each of us, to ensure we are all aware of what is expected. Being able to measure individual and team contributions helps the team to understand what works well and what doesn’t.  "
        },
        {
            "text": "As part of my role, I get a lot of insight into the experiences of our new joiners, including the data from a formal survey which is sent to new starters at the end of the onboarding process. We take these insights very seriously as it helps to inform me and the team on what we’re doing well and where we can improve.  "
        },
        {
            "text": "For example, from the feedback we’ve received, we’ve made changes to guidance and have added more detail on roles and responsibilities to help new joiners understand who does what within HMRC. "
        },
        {
            "text": "We also use productivity and quality measures such as how many people have been onboarded, and the quality of this experience on an ongoing basis. As feedback improves, we see evaluation of outputs and outcomes are making a difference. Using this core manager function is crucial to everything we do on this team. "
        },
        {
            "text": "If you haven’t already, catch up with our previous editions in the series where Kyle, Carol, Kian and Kinga talk about how they own, and initiate, engage and lead, support and develop and plan and organise within their teams."
        }
    ]
}