{
    "url": "https://space.blog.gov.uk/2022/08/08/moon-to-mars-workshop-brings-global-space-agencies-to-london/",
    "title": "Moon to Mars workshop brings global space agencies to London",
    "authors": [
        "Mariam Mufti"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2022-08-08T16:55:29+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Sharing NASA objectives "
        },
        {
            "text": "The Moon to Mars objectives workshop, hosted by the UK Space Agency at the Royal Institution on behalf of NASA, was held in July alongside development of the Artemis mission, which aims to send astronauts back to the Moon for the first time in decades. "
        },
        {
            "text": "As well as bringing a woman and person of colour to the lunar surface and returning them safely to Earth, Artemis is a stepping-stone to support future human exploration on Mars.  NASA is on the verge of launching Artemis 1 and has announced three placeholder launch dates for this year.  "
        },
        {
            "text": "The Moon to Mars workshop covered 50 high-level objectives under the categories of Transport and Habitation, Lunar and Martian Infrastructure, Operations, and Science. "
        },
        {
            "text": "NASA sought input on the draft objectives from across US industry and academia, and will use feedback from the workshop to finalise the objectives that will inform the Moon and Mars mission architecture and operational delivery. "
        },
        {
            "text": "Sharing the objectives with the international community helps NASA understand it has identified them correctly, and gives other global space agencies the opportunity to see NASA’s long terms plans and think about the roles they can play.  "
        },
        {
            "heading": 2,
            "text": "Connecting with global space agencies "
        },
        {
            "text": "Dr Bate said in his address: “We are very pleased and honoured to be hosting the Moon 2 Mars workshop…and looking forward to identifying shared challenges and objectives for the joint exploration of our Solar System.” "
        },
        {
            "text": "“The Moon to Mars initiative is important for giving us a clear vision and a credible plan. We are grateful to NASA for their leadership. Without a bold vision we will not secure public support for our science and exploration goals, nor spark the imaginations of the next generation.” "
        },
        {
            "text": "Approximately 100 technical experts attended the event, representing the European Space Agency (ESA) and national space agencies, such as Italy, Germany, Japan, Canada, and Brazil. "
        },
        {
            "text": "NASA Deputy Administrator and former astronaut, Pam Melroy, attended alongside NASA Director of Space Architectures Dr. Kurt “Spuds” Vogel, NASA Associate Administrator for the Exploration Systems Development Mission Directorate Jim Free, and NASA ESDMD Deputy Associate Administrator Catherine Koerner.  "
        },
        {
            "text": "Pam Melroy said: “Discussing our Moon to Mars objectives with space agencies around the world has been tremendously helpful to NASA as we move forward to finalize them later this year. "
        },
        {
            "text": "“NASA is leading the efforts to send humans back to the Moon through the Artemis program to get the knowledge and capabilities we need to send humans to Mars in the future, but we aren’t doing it alone. "
        },
        {
            "text": "“Our international partners’ valuable inputs to the objectives will ensure strong partnerships as we go out into the solar system together.” "
        },
        {
            "heading": 2,
            "text": "Innovative ideas "
        },
        {
            "text": "Ideas raised included developing a scalable lunar power grid to support human and robotic operations, building a laboratory on the lunar south pole to conduct science, establishing systems and process for managing experiments, and understanding the long-term impact of exposure to lunar atmosphere on human physiology and disease.  "
        },
        {
            "text": "After a fascinating two days of discussions, UK Space Agency’s Deputy CEO Ian Annett closed the event, saying: “It was fantastic to hear about the hard work and see the impressive detail that has been covered in just two short days.” "
        },
        {
            "text": "“The conversations which have taken place in the last couple of days show that we do not have to look far for inspiration for what is possible. The James Webb photos from last week are a testament to what is possible when space agencies all across the world collaborate…and now we have a set of objectives to do so with Moon to Mars.”  "
        }
    ]
}