{
    "url": "https://defradigital.blog.gov.uk/2022/08/08/plant-exports-five-ways-to-communicate-user-research-findings/",
    "title": "Plant exports: Five ways to communicate user research findings",
    "authors": [
        "Neil Johnson",
        "Juliette Fournier"
    ],
    "categories": [
        "Defra digital",
        "User research"
    ],
    "pub_date": "2022-08-08T08:00:23+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The ‘Apply for plant export certificates and inspections’ service has been in Public Beta since August 2021. Neil Johnson and Juliette Fournier from our Major Projects and Digital Delivery team explain how user research has been instrumental in enabling exporters applying for certificates and more to move plant goods abroad (e.g., house plants, seeds, fruits, vegetables, etc.). "
        },
        {
            "text": "When you export regulated plants and plant products from Great Britain and Northern Ireland to other countries, you need to carry out a series of checks, including whether you need a phytosanitary certificate and/or whether your products require any laboratory tests to ensure they are free of pests or disease."
        },
        {
            "text": "We wrote last year about how our Plant Health Export Service (PHES) was originally scoped to focus solely on the end-to-end journey for getting a phytosanitary certificate, and how we wanted to fully understand user needs to ensure that the new service provides a solution for the complexities of the wider plant export process."
        },
        {
            "text": "Since then, we’ve learned a great deal, due in large part to the user insights that we’ve gained. Our service team has taken a user-centred approach to designing the service, carrying out continuous user research to ensure that the service meets the needs of its users. This has allowed us to expand the service to allow for producers and exporters to apply for a Horticultural Marketing Inspectorate Certificate of Conformity alongside a phytosanitary certificate where required."
        },
        {
            "text": "A key part of this process has been to share our research findings with a view to helping the broader service team and business leaders understand and empathise with users. This enables the whole team to make informed design decisions."
        },
        {
            "heading": 2,
            "text": "Five steps to success"
        },
        {
            "text": "We’ve identified five ways you might communicate insights from user research more effectively, whilst also building empathy across your team:"
        },
        {
            "heading": 2,
            "text": "Other things to watch out for"
        },
        {
            "text": "Consider the research holistically, end to end. Avoid letting one research session carry more weight than others. This is particularly important when your teammates may only join some of the sessions, as they may be tempted to focus on what they have heard first-hand."
        },
        {
            "text": "Always be mindful of data protection and safeguarding. Participant information should always remain confidential, and sensitive data not shared outside of what has been outlined in the consent sheets."
        },
        {
            "text": "This is especially important if you are adding audio snippets of research sessions. You can easily modify your participants’ voices on iMovie.  Remember to also check every screen for usability test recording; even if you crop out the video of the participant, they can still enter personal information on the screen."
        }
    ]
}