{
    "url": "https://teaching.blog.gov.uk/2022/08/08/supporting-families-and-communities-through-the-holiday-activities-and-food-programme/",
    "title": "Supporting families and communities through the Holiday Activities and Food programme",
    "authors": [
        "Tracey Cleverly"
    ],
    "categories": [
        "Community support"
    ],
    "pub_date": "2022-08-08T15:22:45+01:00",
    "content": [
        {
            "text": "Tracey Cleverly, trust lead at the Learning Academy Partnership, shares how the Holiday Activities and Food (HAF) programme is helping provide support to its pupils and their families across the local community. "
        },
        {
            "text": "As a trust, we know that children are in the best position to learn when they are happy, healthy and well supported. A key part of this is ensuring that they can achieve this both inside and outside the classroom and the HAF programme is vital in enabling schools to provide essential support to pupils and their families outside of term time."
        },
        {
            "text": "Supporting families"
        },
        {
            "text": "Through the HAF programme, we can provide essential support to families who may be struggling. Over the school holidays, and especially during the summer, not having access to school support can be detrimental to parents and carers who may otherwise feel as if they have nowhere else to turn."
        },
        {
            "text": "HAF provides parents with a point of contact during holiday periods that is vital for accessing support and services. This is particularly important this year, with some of our families facing a wide range of challenges. For example, many of our schools have created family support rooms for any parent or carer to utilise, which were introduced as a 'home away from home' for pupils and parents to access support, resources and advice."
        },
        {
            "text": "Meeting your communities needs "
        },
        {
            "text": "To maximise the impact of HAF, we would encourage schools to fully consider the needs of the distinct communities in which they serve and then tailor the support available to these needs. Different aspects of the HAF programme will be more impactful and helpful for certain communities than others."
        },
        {
            "text": "For example, families based in large cities may struggle to provide their children with access to safe green spaces to exercise and enjoy fresh air. Schools can use the HAF programme to offer free outdoor and safe activities that will support a child’s physical and mental health. On the other hand, families in rural locations for example, may instead require support for children to socialise during the holidays and HAF clubs can also meet these needs."
        },
        {
            "text": "Community engagement"
        },
        {
            "text": "Additionally, we believe it’s important to create HAF opportunities in collaboration with our local community. For example, last Christmas, we partnered with a range of local businesses that enabled us to provide families with healthy and locally sourced produce, which has encouraged them to think more about the food they eat. We would encourage other HAF providers to consider similar partnerships for any future delivery periods."
        },
        {
            "text": "This has also helped us as a trust to strengthen our relationship and links with our local community as a way to showcase our support for sustainable businesses who offer valuable benefits to the health of our children and their families."
        },
        {
            "text": "At the Learning Academy Partnership, we believe that a school should be at the very heart of its community and a part of that is supporting parents in ensuring their child gets the very best start to life."
        },
        {
            "text": "Impact of HAF "
        },
        {
            "text": "The HAF programme has helped our schools support children and their families to eat more healthily, be more active over the school holidays, have a great knowledge of health and nutrition and be more engaged with school and other local services."
        },
        {
            "text": "This is alongside providing activities such as helpful games or educational projects to help parents/carers bond with their children and foster healthy relationships. If other schools or trusts are considering getting involved with HAF in future, we would encourage them to do so."
        },
        {
            "text": "Ensuring pupils' time off from school is happy and fulfilling is crucial to their wellbeing, and this vital support helps our pupils returns from the holidays in the best position to learn and flourish."
        }
    ]
}