{
    "url": "https://deframedia.blog.gov.uk/2022/06/17/38-million-upgrade-to-foss-barrier-officially-opened-in-york/",
    "title": "£38 million upgrade to Foss Barrier officially opened in York",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-06-17T16:03:43+01:00",
    "content": [
        {
            "text": "There has been positive coverage today of the official opening of the £38 million upgrade to the Foss Barrier in York which will help to better protect 2,000 properties in the city and make it more resilient to the impacts of climate change."
        },
        {
            "text": "BBC News Online and York Press both report on the upgrades, which included replacing the old gate and its structure, improvements to the mechanical and electrical equipment needed to control the barrier and installing eight new high-powered pumps, increasing the pumping capacity from 30 to 50 cubic metres per second."
        },
        {
            "text": "The Yorkshire Post also carries an op-ed from Floods Minister Rebecca Pow in which she highlights her delight at seeing these upgrades completed – just one part of the significant ongoing investment in flood schemes across Yorkshire and the Humber, with over £500m invested across the region since 2015."
        },
        {
            "text": "Emma Howard Boyd, Chair of the Environment Agency, said:"
        },
        {
            "text": "Floods Minister Rebecca Pow said:"
        },
        {
            "text": "Government has provided £45 million in funding toward flood defence work in the city since the devastating Boxing Day flood of 2015, in addition to £38 million to upgrade the Foss Barrier to provide better flood protection to properties along the Rivers Ouse and Foss."
        },
        {
            "text": "The Foss Barrier protects properties by stopping flood water from the River Ouse backing up along the dRiver Foss after heavy rainfall and was originally built in 1987."
        },
        {
            "text": "The upgrade of the Foss Barrier, completion of new flood defences around Memorial Gardens and North St, Lower Bootham, Marygate, the village of Bishopthorpe, and the roll out of flood resilience products means that over 2,000 properties are now better protected against the risk of flooding. Many more are to be protected through the year with the completion of flood defence work near Clementhorpe."
        },
        {
            "text": "With the majority of inner-city work near completion, attention will focus on major construction work on flood schemes at Clifton and Rawcliffe and the Foss flood storage area which will hold up to a million cubic metres of water during severe weather and protect a further 630 properties."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}