{
    "url": "https://disabilityunit.blog.gov.uk/2022/06/17/diabetes-and-me-1975-to-2022/",
    "title": "Diabetes and me: 1975 to 2022",
    "authors": [
        "Helen Lazarus"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-06-17T13:57:05+01:00",
    "content": [
        {
            "text": "I started Diabetes Week with a 5 kilometre jog, had a roast beef dinner in the middle and ended with a lovely evening in the pub with friends. A normal Sunday – except I spent it making sure there were jelly babies in every bag; with tubing into my stomach giving me insulin via a pump that I regularly have to adjust; a glucose sensor attached to my arm; and I had to wake up in the middle of the night to scan and calculate the value of everything I’d eaten and drunk that day. "
        },
        {
            "text": "October 1975 saw a low-key boxing match called the Thrilla in Manila, the birth of Kate Winslet and the dawn of a political dynasty through the wedding of Hillary Rodham and Bill Clinton. Meanwhile, in a small Yorkshire market town, a worried Mr and Mrs Lazarus took their skinny, tired little girl to the family doctor, commencing a 45-year duel against my non-functioning pancreas. "
        },
        {
            "text": "I remember a week in the hospital learning how to inject myself with a glass and steel syringe, having a chemistry set to test my urine, weighing all my food. Through my regular visits to the local hospital, I got to know the staff, ended up making great friends and getting a hospital radio show!"
        },
        {
            "text": "For the first 25 years of diagnosis, I was “treated” for my diabetes. I turned up to hospital 4 times a year to have my wrists slapped, suffered terrible night hypoglycaemia (low blood sugar) and was repeatedly warned of the risks of going blind and getting amputated. The idea of being “trained” in the management of my condition wasn’t offered and never occurred to me and, therefore, I did the minimum necessary. Moving my care to a central London hospital was a revelation. I was introduced to carb-counting and the potential of medical technology, and I learnt that (contrary to my long-held beliefs) the more attention I paid to my diabetes, the more freedom and flexibility I gained. Now, I wouldn’t swap my insulin pump for all the proverbial tea and I love my glucose sensor."
        },
        {
            "text": "The rise of Type 2 diabetes and largely inaccurate reporting by the mainstream press has led to a growth in stigma. Now, comments such as “but you’re not that fat” are commonplace and there’s an assumption that my lifestyle has caused my condition. I did encounter some teasing when I was young for being different, but it must be very tough these days for child Type 1 diabetics and their parents to have to deal with that growing social stigma. Whilst Type 2 is often related to weight and diet, they are only increased risk factors, not causes themselves. "
        },
        {
            "text": "One of the difficult aspects to explain to a non-diabetic is the unrelenting nature of our condition. It’s not something we treat twice a day then forget about. It is an intrinsic part of me, affected by stress, hormones, exercise. It’s difficult to imagine not having Type 1 diabetes. I would gain time every day, have more room at home, be less friendly with my local chemist and travel lighter. But, my mental arithmetic ability would decline, I’d have to find something else to be vocal about on Twitter and sales of jelly babies would inevitably suffer."
        },
        {
            "text": "So, if I say I’m going low in a Zoom meeting, suddenly start swiping my arm with my phone, or grab some jelly babies, you might understand that I’m just managing my hidden disability. The better I get at paying my diabetes the attention it deserves, the better my diabetes treats me  – a normal life possibly, but definitely not ordinary."
        }
    ]
}