{
    "url": "https://homeofficemedia.blog.gov.uk/2022/06/17/julian-assange-statement-and-extradition-factsheet/",
    "title": "Julian Assange statement and extradition factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet",
        "Reactive statements"
    ],
    "pub_date": "2022-06-17T10:07:29+01:00",
    "content": [
        {
            "text": "A statement and factsheet below:"
        },
        {
            "text": "A Home Office spokesperson said:"
        },
        {
            "text": "“Under the Extradition Act 2003, the Secretary of State must sign an extradition order if there are no grounds to prohibit the order being made. Extradition requests are only sent to the Home Secretary once a judge decides it can proceed after considering various aspects of the case."
        },
        {
            "text": "“On 17 June, following consideration by both the Magistrates Court and High Court, the extradition of Mr Julian Assange to the US was ordered. Mr Assange retains the normal 14-day right to appeal."
        },
        {
            "text": "“In this case, the UK courts have not found that it would be oppressive, unjust or an abuse of process to extradite Mr Assange. Nor have they found that extradition would be incompatible with his human rights, including his right to a fair trial and to freedom of expression, and that whilst in the US he will be treated appropriately, including in relation to his health.\""
        },
        {
            "text": " "
        },
        {
            "text": "EXTRADITION FACT SHEET"
        },
        {
            "text": "Extradition process"
        },
        {
            "text": "Extradition is an important tool in our fight against transnational crime."
        },
        {
            "text": "Once the UK has received an extradition request and it has been certified, it is sent to court, where the judge must decide whether to issue an arrest warrant."
        },
        {
            "text": "Should they do so, the warrant will be sent to the relevant authorities who will seek to arrest the individual."
        },
        {
            "text": "Following arrest, an extradition hearing is held before the District Judge at Westminster Magistrates’ Court."
        },
        {
            "text": "A Judge decides whether the case raises any human rights issues and whether the case passes the five statutory bars to extradition."
        },
        {
            "text": "These are:"
        },
        {
            "text": "If a judge finds that it passes the five bars, it is sent to the Home Secretary."
        },
        {
            "text": "In this case the UK courts have conclusively found that it would not be oppressive, unjust or an abuse of process to extradite Mr Assange. Nor would it be a breach of his right to a fair trial or freedom of expression and that whilst in the US he will be treated appropriately, including in relation to his health. Mr Assange has the right to apply to the High Court for leave to appeal against the decisions of both the District Judge and the Secretary of State’s decision to order extradition. An application must be made within 14 days of Mr Assange being notified of the Home Secretary’s decision."
        },
        {
            "text": "Provisional arrest"
        },
        {
            "text": "A country may submit a request for provisional arrest on the basis of which an appropriate judge can issue a warrant. Once arrested on the basis of this request the requested person is brought before the judge. The requesting country must then send full extradition papers which must be certified by the Home Office and received by the judge within the deadline set out in law."
        },
        {
            "text": "Home Secretary’s role in extradition"
        },
        {
            "text": "Under the 2003 Act, the Home Secretary’s role is to sign extradition orders. The Home Secretary is bound by law to sign the order unless one of the following grounds for refusal are met:"
        },
        {
            "text": " "
        },
        {
            "text": "Individuals have the opportunity to submit representations to the Secretary of State on these grounds."
        },
        {
            "text": "If none of the above four tests provide grounds to refuse the request, the Home Secretary must order extradition. The Home Secretary cannot, by law, consider any other grounds"
        },
        {
            "text": "If the Secretary of State orders extradition, the individual has the right to apply to the High Court for leave to appeal against the decisions of both the District Judge and the Secretary of State."
        },
        {
            "text": "What happens next for Julian Assange"
        },
        {
            "text": "Mr Assange has the right to apply to the High Court for leave to appeal against the decisions of both the District Judge and the Secretary of State’s decision to order extradition. An application must be made within 14 days of Mr Assange being notified of the Home Secretary’s decision."
        },
        {
            "text": "Mr Assange will only be surrendered to the requesting state when all avenues of legal challenge are exhausted."
        },
        {
            "text": "Forum"
        },
        {
            "text": "The Extradition Act 2003 was amended by the Crime and Courts Act 2013 to introduce the forum bar, which ensures that the possibility of a domestic prosecution has been properly explored."
        },
        {
            "text": "Forum allows a court to bar an extradition where a substantial measure of the requested person's conduct was performed in the UK and where it is in the interests of justice to do so."
        },
        {
            "text": "The Home Secretary has no power to bar extradition under forum."
        },
        {
            "text": "Human rights considerations"
        },
        {
            "text": "The Home Secretary may not consider human rights or health issues in extradition cases. It is for a judge to decide whether or not extradition breaches an individual’s human rights, or whether their health makes it unjust or oppressive to extradite them."
        },
        {
            "text": "The Extradition Act 2003 was amended by the Crime and Courts Act 2013 to remove the Home Secretary’s ability to consider human rights issues. This followed the independent review of extradition led by Sir Scott Baker which recommended that the courts are better placed to make decisions on human rights grounds."
        },
        {
            "text": "US/UK extradition"
        },
        {
            "text": "The US are an important extradition partner. It is in our national interest to have a balanced, effective extradition relationship which prevents criminals evading justice and the UK becoming a haven for fugitives."
        },
        {
            "text": "The US has refused one UK extradition request. Conversely, the UK has refused 25 extradition requests from the US."
        },
        {
            "text": "All individual extradition requests are subject to the Extradition Act 2003, which requires a UK judge to decide whether the requested person's extradition would be appropriate based on the safeguards and protections included in the Act. This UK law ensures all individuals who find themselves requested for extradition are subject to the same criteria regardless of where the request is from or the terms of any international legal framework that is in place. The UK-US Extradition Treaty does not guarantee that every person sought by the US will be extradited, or vice versa."
        },
        {
            "text": "The US do not get special treatment under the Extradition Act 2003. All extradition requests are subject to the Extradition Act, 2003 – which provides safeguards and protections. This is UK law, before British courts and ensures all individuals are subject to the same criteria."
        },
        {
            "text": "Multiple requests"
        },
        {
            "text": "The Extradition Act provides that where there are requests for a particular individual from two countries, the Home Secretary may order proceedings on one of the requests to be deferred until the other one has been disposed of."
        },
        {
            "text": "In making the decision on which request to defer, he must take into account in particular:"
        },
        {
            "text": "The Home Secretary’s consideration is not limited to these factors, but they must be taken into account."
        },
        {
            "text": "Where one extradition request has already been made, a competing request can be made, and the Secretary of State may defer one set of proceedings at any time prior to the individual being extradited on either request."
        },
        {
            "text": "ENDS"
        },
        {
            "text": "*Updated 17 June 2022"
        }
    ]
}