{
    "url": "https://deframedia.blog.gov.uk/2022/06/17/minister-churchill-visits-air-quality-monitoring-site-to-support-clean-air-day/",
    "title": "Minister Churchill visits air quality monitoring site to support Clean Air Day",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-06-17T16:57:16+01:00",
    "content": [
        {
            "text": "Clean Air Day is the UK’s largest air pollution campaign aiming to promote a shift in air quality awareness and to showcase that a future with cleaner air is both possible and desirable. Coordinated by Global Action Plan, Defra has remained a key and active partner of the campaign since 2017."
        },
        {
            "text": "To mark the occasion, Agri-innovation and Climate Adaptation Minister Jo Churchill visited the Defra-funded Imperial College air quality supersite on the London Marylebone Road to learn about the site’s advanced monitoring technology and its use in informing the public about air pollution and the significant risks it poses for public health."
        },
        {
            "text": "The Minister met with Dr David Green, Senior Research Fellow at Imperial’s Environmental Research Group, Dr Ian Mudway, Senior Lecturer in the School of Public Health, and Imperial PhD student William Hicks who discussed his research on non-exhaust emissions impacting air quality."
        },
        {
            "text": "Agri-innovation and Climate Adaptation Minister Jo Churchill said: "
        },
        {
            "text": "Dr David Green, Senior Research Fellow at Imperial’s Environmental Research Group, said:"
        },
        {
            "text": "Yesterday, the National Audit Office published its report on the Government’s approach to air quality."
        },
        {
            "text": "In response, a Government spokesperson said:"
        },
        {
            "text": "Photos credit: Imperial College London"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}