{
    "url": "https://videosurveillance.blog.gov.uk/2022/06/17/professor-sampson-praises-government-on-a-decent-job-but-warns-its-only-half-done/",
    "title": "Professor Sampson praises government on a 'decent job', but warns it's 'only half done'",
    "authors": [
        "katiescotton"
    ],
    "categories": [
        "Biometrics",
        "Biometrics and Surveillance Camera Commissioner",
        "ICO",
        "IPCO",
        "Regulation",
        "Surveillance cameras"
    ],
    "pub_date": "2022-06-17T17:10:31+01:00",
    "content": [
        {
            "text": "The Biometrics and Surveillance Camera Commissioner Professor Fraser Sampson has praised the government on a sensible decision not to hand oversight of police use of DNA and fingerprints to the Information Commissioner’s Office (ICO) but warned it’s a job only half done."
        },
        {
            "text": "The government today revealed that it had scrapped plans to move several key functions of the Biometrics and Surveillance Camera Commissioner’s role into the hands of the powerful ICO data regulator."
        },
        {
            "text": "The plan to move oversight of police use of biometrics appeared late last year in a major government consultation called: Data: A New Direction."
        },
        {
            "text": "Several respondents, including Professor Sampson, told the government that, for various reasons, it was a bad idea. See OBSCC formal response to Data: A New Direction. "
        },
        {
            "text": "Today, in its formal response to that consultation (see section 5.8), the government said:"
        },
        {
            "text": "Professor Sampson said:"
        },
        {
            "text": "The government response says it will explore whether the existing Investigatory Powers Commissioner, can instead take on some of the Biometrics Commissioner’s functions."
        },
        {
            "text": "Professor Sampson said:"
        },
        {
            "text": "The government’s policy in this area continues to be one of ‘incremental steps’ to simplify regulation in this arena."
        },
        {
            "text": "Professor Sampson continued:"
        },
        {
            "text": "The government’s consultation response also said it would seek to remove “duplication” between the ICO and Surveillance Camera Commissioner aspect of Professor Sampson’s dual role."
        },
        {
            "text": "The Professor said:"
        }
    ]
}