{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/06/17/science-and-evidence-protecting-people-and-places/",
    "title": "Science and evidence protecting people and places",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities",
        "Guest Blog"
    ],
    "pub_date": "2022-06-17T23:18:10+01:00",
    "content": [
        {
            "text": "Every year, the Health and Safety Executive (HSE) publishes its Science Review which illustrates ways science and evidence is being used to protect people and places, helping everyone lead safer and healthier lives. The Review contains case studies from a huge variety of our recent work. It also introduces some of our diverse range of specialist scientists, engineers and analysts, and celebrates the awards, honours and achievements obtained by our colleagues."
        },
        {
            "text": "This year’s review illustrates the mix of activities that helped ensure HSE’s response to the pandemic was informed by the best available evidence and provided the information to help our organisation build back better."
        },
        {
            "text": "Some of the things it covers include:"
        },
        {
            "text": "The review also highlights the range of studies HSE scientists are working on to protect people and places by managing workplace health and safety risks and helping to maintaining Great Britain’s record as one of the safest countries to work in. This includes:"
        },
        {
            "text": "The Review shows how we bring people and organisations together, and how we share knowledge, expertise and data, makes a real impact on reducing death, ill health and injury. This includes:"
        },
        {
            "text": "Join us for our lunchtime Annual Science Review launch seminar to hear first-hand from some of our scientists and engineers about their work. In a series of ‘lightning’ talks they will briefly introduce you to their work on: COVID-19, supporting and enabling a safe transition to hydrogen in the gas network, building safety, The Biopesticide Network, and asbestos exposures (see event page for more details)."
        },
        {
            "text": "This event will be held via Teams on Wednesday 22nd June 13.00 to 13.45."
        },
        {
            "text": "Please register for free in advance for the seminar using this link: https://www.eventbrite.co.uk/e/hse-2022-annual-science-review-seminar-tickets"
        },
        {
            "text": "The 2022 HSE Annual Science Review will be launched shortly at this link in tandem with our seminar: HSE - Science, engineering and evidence"
        },
        {
            "text": "In the meantime, to give you a taste of what we do, watch this video: Trailer for Health and Safety Executive (HSE) Annual Science Review 2022"
        },
        {
            "text": "Jillian Swan, Science Information, Dissemination and Engagement Team\nChief Scientific Adviser’s Office, HSE and Government Science and Engineering Profession member."
        },
        {
            "text": "The HSE’s Science and Research Centre, Buxton."
        }
    ]
}