{
    "url": "https://deframedia.blog.gov.uk/2025/01/16/coverage-following-the-import-ban-of-cattle-pigs-and-sheep-from-germany-following-foot-and-mouth-case/",
    "title": "Coverage following the import ban of cattle, pigs and sheep from Germany following Foot and Mouth case",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Borders and trade",
        "Farming",
        "Food",
        "Protect"
    ],
    "pub_date": "2025-01-16T11:56:27+00:00",
    "content": [
        {
            "text": "There has been widespread media coverage following the announcement that we have introduced an import ban of cattle, pigs and sheep from Germany to protect farmers after a Foot and Mouth disease (FMD) case was detected in Germany."
        },
        {
            "text": "The commercial import of cattle, pigs, sheep, deer, buffaloes and their products such as meat, and dairy from Germany will now be banned to protect farmers and their livelihoods."
        },
        {
            "text": "Publications including the BBC, Guardian, PA, Financial Times, Sky News, The Telegraph and Politico amongst others have covered the announcement which marked decisive action being taken to prevent the incursion of FMD to the UK."
        },
        {
            "text": "As of 15 January it is also no longer permitted for travellers to bring unpackaged meat, meat products, milk and dairy products, certain composite products and animal by products of pigs and ruminants into Great Britain from the EU,  EFTA states,  Faroe Islands and Greenland. Additionally, these products may not be brought to Great Britain from Germany, even if commercially packaged.  These products can be placed in the secure bins provided in ports and airports."
        },
        {
            "text": "The loss of disease freedom covers the whole of Germany and therefore the restrictions apply to the country as a whole. The EU’s most recent FMD outbreak happened in 2011 in wild boar in Bulgaria, with the last case of FMD in the UK occurring in 2007"
        },
        {
            "text": "The UK’s risk level for FMD has been increased to medium. This is the first time that the risk has increased since the system was introduced in 2006."
        },
        {
            "text": "The diseases poses no risk to human or food safety, but is a highly contagious viral disease of cattle, sheep, pigs and other cloven-hoofed animals. Livestock keepers should therefore be absolutely rigorous about their biosecurity."
        },
        {
            "text": "UK Chief Veterinary Officer Dr Christine Middlemiss said:"
        },
        {
            "text": "Farming Minister Daniel Zeichner said:"
        },
        {
            "text": "The Farming Minister also updated the House earlier in the week."
        },
        {
            "text": "Foot and Mouth Disease is a legally notifiable disease and must be reported. If you suspect a notifiable disease in your animals you must report it immediately by calling the Government Helpline. Failure to do so is an offence."
        }
    ]
}