{
    "url": "https://dragonsden.blog.gov.uk/2025/01/16/dragons-den-ip-blog-series-22-episode-2/",
    "title": "Dragons’ Den IP Blog- Series 22 Episode 2",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Business",
        "IP",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2025-01-16T21:00:00+00:00",
    "content": [
        {
            "text": "From mystery football shirts on your doorstep to Italian pizza in pubs, the second episode of series 22 was full to the brim with keen entrepreneurs ready to pitch their business to the Dragons. The panel of business moguls were, as always, full of questions to keep them on their toes. In this episode, I tuned into all things Intellectual Property (IP) whilst taking notes of a few businesses that would certainly be useful in my own life! "
        },
        {
            "heading": 3,
            "text": "Seeing double"
        },
        {
            "text": "When twins Luke and Owen headed into the Den, the Dragons were in for a tasty surprise. The boys were looking for £90,000 in return for a 5% stake in Doughboys Group Limited, a frozen pizza brand disrupting the market with its tasty Italian sourdough pizzas, designed to add some flavour to the wholesale market. "
        },
        {
            "heading": 3,
            "text": "Eye-catching eats "
        },
        {
            "text": "One of the first things that struck me was the eye-catching branding across Doughboys’ products. Their logo and colours really capture the artisan and Italian feel. After a quick search on our ‘Search for a trade mark’ tool, I was delighted to see that they have wisely registered a trade mark for their logo.  "
        },
        {
            "text": "As the Dragons tucked into their Doughboys treats, the boys explained that they had seen poor quality frozen pizzas being the only option to a busy pub kitchen and thought there must be a better solution. Having worked in busy hospitality settings myself, I can see the need for easy and tasty food options to please customers. I certainly hope they’ll continue to roll their products out to more retail venues so I can give it my very own taste test. "
        },
        {
            "text": "As the Dragons continued to devour the pizza, it had me wondering what makes their pizza so special. According to the website, one of the things that sets them apart from their competitors is their sourdough base. If their recipe is unique, the boys may consider protecting it with a trade secret. For this to apply, the recipe would need to be well protected and must derive value from its secrecy. If the duo choose to do this, they should ensure that anyone involved - suppliers, manufacturers, employees - sign a non-disclosure agreement (NDA) to prevent them from disclosing the recipe. To learn more, check out our NDA guidance page which includes example NDAs. "
        },
        {
            "heading": 3,
            "text": "As good as it tastes"
        },
        {
            "text": "Sara Davies was a little dubious - if it tastes this good, can the figures match up? She did, however, eat her words, and the Dragons were all impressed when the boys revealed that they had reached more than 1000 hospitality venues across the UK and secured a retail deal with Ocado.  "
        },
        {
            "text": "Touker Suleyman and Steven Bartlett didn’t fancy a slice of the (pizza) pie, but Deborah Meaden loved it. Putting her money where her mouth is, she was the first Dragon to make an offer for the full £90,000 in exchange for 10% of the business. Sara Davies also jumped in, but as Peter Jones played on the fact that they all lived in the same town, his offer stood out and the Doughboys walked away from the Den with the longest standing Dragon on their side.  "
        },
        {
            "heading": 3,
            "text": "He shoots, he scores? "
        },
        {
            "text": "The final pitch to enter the Den was from Alex Street, a self-proclaimed London geezer who was looking for £50,000 in exchange for 10% of his business, Mystery Jersey King. The Dragons loved the concept of his subscription model, that sees mystery football jerseys from across the globe delivered to the doorsteps of subscribers. While they were charmed by Alex’s passion and personality, they were disappointed when he couldn’t deliver the figures they were asking for. In the end, it was Sara Davies who decided to take a punt on the entrepreneur despite, in her own words, the “dog’s dinner” Alex made of his figures. She offered him all the money in exchange for a 15% stake of the business, with the addition that she would drop her stake to 10% once she had earned back her money.  "
        },
        {
            "text": "It’s great to read on Mystery Jersey King’s website that their shirts are all genuine and that they take steps to ensure this is the case. There’s no place for counterfeit kits in football and for the 2022 FIFA World Cup, the IPO ran an educational campaign to raise awareness of the harm counterfeits pose to the football community, consumers and the wider UK economy. You can read more about it in our blog. "
        },
        {
            "text": "Disclaimer: "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}