{
    "url": "https://mhclgmedia.blog.gov.uk/2025/01/16/inaccurate-reporting-of-grant-funding-based-on-council-tax-levels/",
    "title": "Inaccurate reporting of grant funding based on council tax levels",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance"
    ],
    "pub_date": "2025-01-16T16:35:40+00:00",
    "content": [
        {
            "text": "There has been inaccurate reporting in The Telegraph, The Telegraph and I news that the government plans to redistribute grant funding to benefit areas with higher council tax levels."
        },
        {
            "text": "This is not true.  These proposals will not see grant funding for councils decided based on their council tax levels. We are taking an approach proposed by the previous government to set grant funding levels based on the number and value of houses locally, not the level of council tax set by each council."
        },
        {
            "text": "Individual local authorities are responsible for setting their council tax and are free to keep council tax levels low without it reducing the amount they receive in grants. We are maintaining the previous government’s referendum threshold for council tax at 3%, with 2% for the adult social care precept, to protect local taxpayers."
        },
        {
            "text": "The ability to raise revenue from council tax is determined by the number of properties in a local authority and the value of those properties in 1991. This means places with a higher number of more valuable properties are able to raise more than an area with lower value properties despite setting the same council tax level."
        },
        {
            "text": "As part of fixing the foundations of local government and ending this outdated system, the government has proposed changes to create a fairer funding system by adjusting for councils' differing ability to generate council tax income when allocating grant funding. "
        },
        {
            "text": "The Telegraph have also reported on Bradford Council proposing council tax increases above 5%. This would require either a local referendum or the council to be granted exceptional financial support from the government. It would not result in increased grant funding. Ministers have been clear protecting taxpayers will be central to considering any requests for additional rises from councils that require exceptional financial support. In line with the previous government’s approach, we will consider requests – but this government will be putting working people at the forefront of our decisions and only agreeing in exceptional circumstances."
        },
        {
            "text": "An Ministry of Housing Communities and Local Government spokesperson said:"
        },
        {
            "text": "“These claims are inaccurate. These proposals will not see grant funding for councils decided based on their council tax levels, in line with the previous government’s position.”"
        }
    ]
}