{
    "url": "https://aphascience.blog.gov.uk/2025/01/16/supporting-beekeepers-in-ghana/",
    "title": "From hive to honey: UK expertise supporting beekeepers in Ghana ",
    "authors": [
        "Nadja Howton"
    ],
    "categories": [
        "Bee health",
        "International"
    ],
    "pub_date": "2025-01-16T14:58:58+00:00",
    "content": [
        {
            "text": "A past blog post highlighted the importance of APHA’s collaborative efforts to promote bee health and honey production in Ghana. Honeybees are crucial to agriculture across Ghana, with key crops like shea, cashew, and citrus oil palm relying heavily on them for pollination. Beyond their ecological importance, beekeeping initiatives in Ghana are also focused on creating jobs and generating wealth, contributing to the economic empowerment of local communities. Find out how the APHA continues to develop role models to champion best beekeeping practices throughout Ghana."
        },
        {
            "text": "In August 2024, as part of APHA’s Animal Health Systems Strengthening (AHSS) project, our National Bee Unit (NBU), hosted eight participants from Ghana for a week-long intensive training on honeybee health, husbandry and honey production in the UK. The attendees represented a diverse mix of non-governmental organisations and commercial apiculture enterprises. Participants gained both practical and theoretical knowledge to support the maintenance of healthy and productive colonies. This initiative funded by The UK Foreign, Commonwealth & Development Office through their Official Development Assistance (ODA) programme. This is crucial for Ghanaian beekeepers, as it promotes the adoption of best practices in beekeeping, which they can share and implement across their communities."
        },
        {
            "heading": 3,
            "text": "Insights from industry leads"
        },
        {
            "text": "The training was both informative and engaging, with visits to commercial apiaries, honey production facilities and suppliers of beekeeping equipment. Participants also explored the educational resources available to UK beekeepers, during a visit to the National Beekeeping Centre - headquarters of the British Beekeepers Association (BBKA). The BBKA is a national umbrella organisation for beekeeping associations and represents around 30,000 beekeepers across the country."
        },
        {
            "heading": 3,
            "text": "Practical hive inspection training"
        },
        {
            "text": "One of the highlights of the training was the hands-on apiary inspection workshops. Participants received practical training on how to conduct a full disease inspection, with an emphasis on good biosecurity measures. They learned how to dismantle the hives, examine the individual frames containing brood and carefully check the sealed and unsealed cells. The process involved identifying common pests such as the Varroa destructor, a parasitic mite that is the leading cause of colony collapse globally. Management of Varroa has now become a routine and essential part of bee husbandry. To everyone’s surprise, and perhaps a bit of relief, the UK bees were notably calmer than their African counterparts!"
        },
        {
            "heading": 3,
            "text": "Supporting women in Ghanaian apiculture "
        },
        {
            "text": "The training also focused on addressing gender imbalances in the Ghanaian beekeeping sector, by ensuring that a female representative from each organisation attended. In Ghana, these imbalances exist not only among those practicing beekeeping, but also among trainers, leaders and change agents. Three of the attendees are currently undertaking an apprenticeship, led by Bees for Development Ghana, to become Professional Women Beekeeping Trainers in Ghana."
        },
        {
            "text": "Martha Adjorlolo, Programmes Director at Bees for Development Ghana, provided the following feedback after the visit:"
        },
        {
            "heading": 3,
            "text": "Forward look"
        },
        {
            "text": "The visit was a buzzing success, sparking important discussions on best practices for Ghana’s beekeeping industry and strategies to boost honey production. APHA will continue to monitor the effectiveness of the training provided and collaborate with female representatives of Bees for Development, Ghana, to raise awareness of the challenges women face in beekeeping. This training aligns with our project’s broader mission to strengthen animal health systems, through a One Health, all-hazard approach."
        },
        {
            "heading": 3,
            "text": "Find out more"
        }
    ]
}