{
    "url": "https://educationhub.blog.gov.uk/2025/01/the-uk-ukraine-school-partnerships-programme-how-can-i-get-involved/",
    "title": "The UK-Ukraine school partnerships programme: How can I get involved?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-01-16T14:00:00+00:00",
    "content": [
        {
            "text": "Schools across the UK and Ukraine are coming together in an exciting new partnership focused on sharing stories and promoting reading for pleasure. The programme, part of the 100-Year Partnership between the two countries, aims to create connections between school communities, and encourage learning about other cultures. "
        },
        {
            "text": "What is the programme? "
        },
        {
            "text": "The programme will start by pairing 50 schools across the whole of the UK with 50 Ukrainian schools for a year-long reading project. Students will be encouraged to share their favourite stories from their cultures. "
        },
        {
            "text": "Why is reading for pleasure important? "
        },
        {
            "text": "Evidence shows that reading for pleasure helps children understand the views of others and feel more connected to the world. It also helps them feel more able to deal with difficult emotions and feel more confident. The National Literacy Trust found that children who read are three times more likely to have higher levels of mental wellbeing.   "
        },
        {
            "text": "Stories teach children to be curious and they introduce them to people, viewpoints and events that stretch their imaginations and challenge their perceptions. It does so safely, building resilience to face the world. "
        },
        {
            "text": "Through reading, children can experience different perspectives and build empathy for people who are different. It can help children facing adversity make sense of their own experiences and give others an understanding of the battles others face.  "
        },
        {
            "text": "But reading is in decline. The National Literacy Trust  found that the number of children aged 8 – 18 who enjoy reading in their spare time has halved since 2019. "
        },
        {
            "text": "Many children are starting school having never picked up a book. It is too important to ignore – and for children from disadvantaged backgrounds it’s even more crucial to ensure they don’t miss out on the benefits of improved literacy - from employability to earnings.  "
        },
        {
            "text": "How is this linked to the UK and Ukraine 100-Year Partnership? "
        },
        {
            "text": "The UK-Ukraine Schools Partnership is one of many programmes being launched across government to bring our societies closer, as part of the 100-Year Partnership. "
        },
        {
            "text": "We will build on our position as Ukraine’s most-trusted ally, supporting them to build a more resilient and sustainable society for generations to come.  "
        },
        {
            "text": "It will be a two-way street, working together to deliver our Plan for Change by increasing economic and trade cooperation to boost growth. It will also strengthen our socio-cultural ties, with closer collaboration across education a key driver in bringing our societies closer. "
        },
        {
            "text": "Delivering change at home means we must build robust international partnerships for the future.  We are creating a strong economy that works for the British people, a safe country that protects our interests at home and abroad, and a prosperous society that advocates for cultures, heritages and national identity.   "
        },
        {
            "text": "How can I sign up? "
        },
        {
            "text": "Applications are open to all state-funded primary and secondary schools across the four nations in the UK, focused on students aged 7-14 years.   "
        },
        {
            "text": "Schools can register their interest in January 2025, and the programme will launch in late spring 2025. The scheme particularly welcomes applications from: "
        },
        {
            "text": "Is it open to all schools in the UK? "
        },
        {
            "text": "Yes, all state funded primary and secondary schools in the UK can apply to take part. While the initial stage will be 50 schools, we hope to expand the programme in future years. "
        },
        {
            "text": "How will it work with different languages? "
        },
        {
            "text": "The programme has been built with language differences in mind. It will help enhance English language skills among Ukrainian students while also helping young people understand different cultures.  "
        },
        {
            "text": "The programme will support language and communication skills by promoting communication in English in Ukraine, in support of the Ukrainian Ministry of Education’s goal to raise the level of English language ability across the country.    "
        },
        {
            "text": "We welcome applications from Welsh and Gaelic speaking schools and will provide translated training materials. Participation from these schools will provide an opportunity to celebrate the rich breadth of UK culture.    "
        },
        {
            "text": "Why get involved? "
        },
        {
            "text": "This partnership offers a unique opportunity to: "
        }
    ]
}