{
    "url": "https://nationalscreening.blog.gov.uk/2025/01/16/uk-nsc-meeting-welcomes-findings-of-review-into-effectiveness-of-aaa-screening-in-the-uk/",
    "title": "UK NSC meeting welcomes findings of review into effectiveness of AAA screening in the UK",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-01-16T09:02:29+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee’s (UK NSC’s) November 2024 meeting enjoyed an excellent presentation on the effectiveness of the national abdominal aortic aneurysm (AAA) screening programme."
        },
        {
            "text": "Former NHS AAA Screening Programme clinical director Jonothan Earnshaw presented the findings of a detailed review into the first decade (April 2013 to March 2023) of the screening programme’s full implementation across the UK."
        },
        {
            "text": "The effectiveness review of those 10 years found that:"
        },
        {
            "text": "The review concluded that the national NHS AAA screening programmes in the UK are effective and contribute substantially to the ongoing reductions in AAA-related deaths."
        },
        {
            "text": "The full report of the 10-year effectiveness review will be published shortly on GOV.UK."
        },
        {
            "text": "The UK NSC thanked Jonothan and the team. The committee noted the excellent quality of the report and agreed that it could help inform future effectiveness reviews of other national screening programmes."
        },
        {
            "heading": 2,
            "text": "Committee recommends against screening for dental disease in children"
        },
        {
            "text": "Committee members also discussed the latest review of evidence into screening for dental disease in children. The review found insufficient evidence to support population screening for dental disease, a conclusion that was agreed by the meeting. Committee members also acknowledged that prevention of dental disease is very important for schoolchildren, but that it falls outside the scope of the UK NSC’s responsibilities. "
        },
        {
            "text": "They asked the committee’s secretariat to engage with experts from the Department of Health and Social Care (DHSC) dental public health team to see whether they agreed with the committee’s decision, especially given that oral health inequalities remain a significant public health problem in the UK. Dental public health experts agreed with the committee’s decision and advised that there is no evidence to suggest that the introduction of school-based screening for dental diseases would reduce those inequalities.  "
        },
        {
            "text": "Members therefore agreed with the recommendation not to introduce a population screening programme for dental disease, and to remove the topic from the list of conditions that the UK NSC regularly reviews. The DHSC supports a preventative approach to tackling dental caries in children. Delivering better oral health: an evidence-based toolkit for prevention sets out interventions for tooth decay and other oral health issues, as well as the evidence base for those interventions. A range of other resources to improve children’s oral health are also published on GOV.UK. "
        },
        {
            "text": "Committee members also approved an update to the UK NSC informed choice principles publication which describes best practice for the application of informed choice principles in nationally managed and delivered screening programmes. The publication has been updated following a 2023 review of relevant literature. The principles emphasise the importance for screening programmes of clear, concise, and accessible information, and evidence-based, timely, and respectful communication."
        },
        {
            "text": "Other topics discussed at the November 2024 UK NSC meeting included an update on progress with plans to implement national newborn screening for hereditary tyrosinaemia. The UK NSC made the recommendation to screen for this rare condition in 2023 and its recommendation was endorsed by ministers last year."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}