{
    "url": "https://defraenvironment.blog.gov.uk/2025/03/24/englands-major-landowners-to-work-together-to-drive-nature-recovery/",
    "title": "England’s major landowners to work together to drive nature recovery.",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "30by30",
        "Community",
        "Land use",
        "Nature"
    ],
    "pub_date": "2025-03-24T11:55:37+00:00",
    "content": [
        {
            "text": "A group of landowners – who collectively own 10% of England’s land – met last week to accelerate nature’s recovery."
        },
        {
            "text": "The National Estate for Nature group brings together England's most significant landholders from across the public, private and third sectors. The group's aim is to help tackle one of our greatest challenges with limited land and competing demands like food supply and housing development - to restore and enhance nature."
        },
        {
            "text": "Working together for environmental delivery"
        },
        {
            "text": "England faces a land use crisis. We need to build 1.5 million homes, construct vital energy infrastructure, grow food sustainably and reverse decades of nature decline - all on our limited landmass. For too long, these competing priorities have been approached in a fragmented, uncoordinated way."
        },
        {
            "text": "The National Estate for Nature aims to change this by connecting England's major landowners to drive delivery for Environment Act targets and nature recovery objectives like 30by30 (protecting 30% of land for nature by 2030) on their estates."
        },
        {
            "text": "As significant landowners themselves, the Defra Group will be active members of the landowners group, leading by example and supporting the group with guidance, resources and co-ordination."
        },
        {
            "text": "By working collectively, the group's members have enormous potential to make meaningful environmental improvements at scale."
        },
        {
            "text": "Sharing knowledge, building understanding"
        },
        {
            "text": "One of the most valuable aspects of the landowners group will be the exchange of experiences, knowledge and action on land management and change. Every estate has its unique challenges and innovations, and sharing these insights will help inform better environmental decisions for all members."
        },
        {
            "text": "By discussing challenges and opportunities together, the group aims to develop more consistent, effective approaches to nature recovery to take forward. This collaborative mindset represents a significant shift from the traditional siloed approach to land management."
        },
        {
            "text": "At the first meeting, members began co-creating the group's objectives, including establishing minimum standards for land management plans with clear milestones for nature restoration and protection, to help meet statutory nature targets and 30by30."
        },
        {
            "text": "Taking accountability for progress"
        },
        {
            "text": "The landowners group isn't just about good intentions. Defra will actively encourage members to make positive environmental improvements and regularly review progress across agreed actions - setting the standard for collective responsibility."
        },
        {
            "text": "This accountability process will help ensure that commitments translate into real-world impact."
        },
        {
            "text": "Supporting the Land Use Framework"
        },
        {
            "text": "The formation of the National Estate for Nature Group comes at a critical time, with the Government's Land Use Framework consultation closing on 25 April 2025. This consultation sets out a vision for land use change including the principles that should inform policy, the type and scale of change needed, and the actions Government could take to support land managers."
        },
        {
            "text": "The Government has committed to introducing a Land Use Framework that will transform how we use land to support economic growth and deliver on our Plan for Change. Major landowners have great potential to make a difference and lead the way forward as this framework develops."
        },
        {
            "text": "Join the conversation"
        },
        {
            "text": "We want to hear your views on the Land Use Framework consultation before it closes at on 25 April 2025."
        },
        {
            "text": "Together, we can develop a more coherent, strategic approach to land use that meets our environmental goals while supporting economic growth and enhancing our food security."
        },
        {
            "text": "And if you’d like to hear more on the group, please subscribe to our blog to stay up to date."
        }
    ]
}