{
    "url": "https://gott.blog.gov.uk/2025/03/24/key-takeaways-from-the-gottcon-2025-panel-discussion-risk-and-innovation/",
    "title": "Key takeaways from the GOTTCon 2025 panel discussion: Risk and Innovation ",
    "authors": [
        "avneetkaur"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-03-24T14:41:28+00:00",
    "content": [
        {
            "text": "Authors: Joanna Rodin and Rachel Egan, Deputy Director job-share, Strategy and Implementation, GOTT."
        },
        {
            "text": "Last week we chaired a panel discussion on the subject of \"Risk and Innovation\" which brought together a wide range of different experts from various sectors to explore the critical aspects of risk-taking in the pursuit of innovation. "
        },
        {
            "text": "Our panellists were Sumitra Varma, Head of Engineering at the Medicines and Healthcare products Regulatory Agency (MHRA), Joe Torjussen, Head of Innovation in the Cabinet Office’s Civil Service Strategy Unit and Sakura Holloway, Investment Director at UKi2s. "
        },
        {
            "text": "Below are the three key takeaways from this insightful discussion. "
        },
        {
            "heading": 2,
            "text": "Differentiating between good and bad risks "
        },
        {
            "text": "One of the central themes of the discussion was the importance of distinguishing between good and bad risks. Joe emphasised that good risk taking involves being clear about the potential outcomes and communicating the risk appetite effectively. This approach provides teams with the confidence to innovate while ensuring that decisions can be justified if things go wrong. He highlighted four barriers to innovation: skills, incentives, attitudes to risk, and time, space, and money. "
        },
        {
            "text": "Sumitra added that emerging and innovative technologies inherently carry more risk, which needs to be understood and mitigated through controlled experimentation. She stressed the importance of piloting new technologies to understand their risks before full-scale implementation. "
        },
        {
            "text": "Sakura, speaking from an investor's perspective, noted that early engagement with investors is crucial. She pointed out that many projects fail to engage investors early enough, missing out on opportunities across different sectors. By removing the stigma of not being ready to showcase to investors, organisations can benefit from active conversations and potentially additional funding. "
        },
        {
            "heading": 2,
            "text": "Creating a supportive culture for innovation"
        },
        {
            "text": "The panellists agreed that a supportive culture is essential for fostering innovation. Sumitra emphasised that leadership-driven cultural shifts are necessary to support and take balanced risks. She noted that teams often come up with innovative ideas but lack the momentum due to insufficient support. Incentives for innovation should be aligned with making a difference, rather than just ticking boxes. "
        },
        {
            "text": "Sakura highlighted the importance of people in driving change. She advocated for giving individuals the opportunity to step into leadership roles and backing them as founders. This approach ensures that the right people are in place to drive innovation forward. "
        },
        {
            "text": "Joe stressed the need for creating a safe space where teams can challenge ideas and raise new concepts. He pointed out that the hierarchical nature of the public sector can add layers of risk aversion, making it crucial to embed a culture that encourages innovation and risk-taking. "
        },
        {
            "heading": 2,
            "text": "Balancing risk profiles "
        },
        {
            "text": "The discussion also touched on the challenges of getting the risk profile right. Sakura mentioned that there is never a scenario with no risk, but the biggest fear is not achieving a return on investment or missing out on the next big thing, so you have to take risk. She emphasised the importance of doing thorough homework and using all available resources to make informed decisions. "
        },
        {
            "text": "Joe reflected on a previous role where an innovative idea failed due to lack of user engagement. He underscored the importance of not brushing off failures quickly but instead reflecting and learning from them. Sharing lessons learned can help the rest of the organisation avoid similar pitfalls."
        },
        {
            "text": "By differentiating between good and bad risks, creating a supportive culture, and balancing risk profiles, organisations can enhance their innovation efforts. This is now essential to succeed in supporting our Mission-led government which has set a bold vision for change. "
        }
    ]
}