{
    "url": "https://insidehmcts.blog.gov.uk/2025/03/24/modernising-courts-and-tribunals-what-weve-achieved-and-learned/",
    "title": "Modernising courts and tribunals: what we've achieved and learned",
    "authors": [
        "Nick Goodwin - Chief Executive, HMCTS"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services",
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2025-03-24T09:42:42+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Access to justice underpins the democratic rights, responsibilities and freedoms from which we all benefit. It’s been a longstanding principle for many centuries - protected and cherished by governments, the independent judiciary, civil servants and citizens."
        },
        {
            "text": "Over the last few years, while preserving the fundamentals of our justice system for all those who use and need it, we’ve transformed lots of the technical infrastructure and systems we use to administer courts and tribunals."
        },
        {
            "text": "The end of March 2025 marks the formal conclusion of our reform programme. Launched in 2016 by ministers and judges, it set out to modernise our courts and tribunals, making services faster, simpler and far more accessible."
        },
        {
            "text": "We’ve achieved a huge amount  and I’m immensely proud of the programme’s legacy. This quiet revolution has moved us from paper to digital, combined local knowledge with national resilience, stabilised and secured our systems, and set us up for the 21st century."
        },
        {
            "text": "We’ve developed 14 modern digital services, which reach far and wide. They enable access to justice for victims and defendants, separating couples, grieving families, employers and their employees, refugees, vulnerable children, businesses and their customers, among others. Over 4.1 million cases have been digitally submitted since April 2019."
        },
        {
            "text": "As the programme officially concludes, we remain committed to continuing to modernise the system - to ensure easier access to justice for those who rely on our services and value for money for taxpayers."
        },
        {
            "heading": 2,
            "text": "Benefits of modernised services"
        },
        {
            "text": "Our digital transformation has delivered significant improvements across the justice system. Here are the some of the main benefits to our users and wider society:"
        },
        {
            "text": "Faster, simpler services"
        },
        {
            "text": "Our online services are faster and easier to use. In probate, for example, our data shows that probate applications which are made online using our digital service, from submission to grant of probate, are processed four times quicker than using the paper service."
        },
        {
            "text": "In crime, between April 2017 and January 2025 we received over 267,000 online pleas through the Single Justice Procedure, providing faster access to justice for lesser offences such as speeding, driving without insurance, TV license evasion and evading train fares."
        },
        {
            "text": "We’re proud of our consistently high user satisfaction rates. Over 75 per cent of people were satisfied with the single justice service, 80 per cent with online divorce and 85 per cent with appeals for social security and child support."
        },
        {
            "text": "Improved data and resilience"
        },
        {
            "text": "Our digital systems provide quality insights and data we can use to improve services, including identifying any hidden barriers to access for those using them. Digital services will also provide greater resilience in the event of future unexpected crises, as demonstrated during the pandemic."
        },
        {
            "text": "Technology and accessibility"
        },
        {
            "text": "The use of video technology has been transformational as it allows parties to join hearings remotely, when approved by a judge. It’s available in over 70 per cent of our courtrooms, including over 90 per cent of Crown courtrooms."
        },
        {
            "text": "Greater virtual attendance means fewer parties are required to travel, saving costs and reducing environmental impacts. Indeed, a 2021 review estimated the impact of moving hearings online to be 3.2 million kilograms of carbon dioxide equivalent annually, which equates to taking 1,485 cars off road for a year."
        },
        {
            "text": "Under the guiding framework of our Welsh Language Scheme, we’re ensuring that our reform programme provides equal accessibility in the Welsh language."
        },
        {
            "text": "Operational efficiency"
        },
        {
            "text": "Reformed systems have also driven efficiency in data sharing and accuracy between criminal justice partners across crime, civil, family and tribunals. And our five modern industry standard service centres and national business centres used the latest technology to answer over 2.8 million calls during 2024, providing a dedicated service to the public with queries about cases."
        },
        {
            "text": "Financial benefits"
        },
        {
            "text": "The reform programme will deliver significant financial benefits too and we're working with the judiciary to validate the impact of those changes. We'll take into account the impacts of greater digitisation, property savings and savings from decommissioning old IT systems."
        },
        {
            "text": "While these benefits demonstrate the programme's success, achieving them hasn't been without its challenges."
        },
        {
            "heading": 2,
            "text": "Learning from experience"
        },
        {
            "text": "The reform programme has undoubtedly delivered much-needed changes but completing a programme of this scale in a large operational environment has proved challenging. Originally due to conclude in 2022, the programme has taken longer which incurred more cost and we haven’t been able to deliver everything envisaged at the outset."
        },
        {
            "text": "Whilst the pandemic caused major disruption, it underlined the importance of modernised services and enabled us to operate when other justice systems closed around the world. Strike action and rising demand for many services added to the challenges. It is also clear, though, that the original scope was too ambitious."
        },
        {
            "text": "We have been open about lessons we’ve learned from trying to do too much, too quickly and improved our feedback processes throughout the journey. We’re hugely grateful for that feedback and the support we continue to have from legal professionals, public users, the media and other partners across the justice system."
        },
        {
            "heading": 2,
            "text": "A future built on firm digital foundations"
        },
        {
            "text": "As we reach this major milestone and look forward to the year ahead, in crime we will continue to focus on improving existing functionality of our systems and progressing the most impactful changes. In civil, we will prioritise the functionality which will digitise the highest volume of cases, driving the greatest user and financial benefits."
        },
        {
            "text": "We’ll publish blogs next week outlining in more detail what this means in specific jurisdictions."
        },
        {
            "text": "Looking beyond the reform programme, we must – and will – take the lessons we have learned and apply them to our ongoing modernisation journey as we continue to improve. In April, we will embark on our new strategic plan towards our longer-term vision, building on what we have already accomplished. Further modernising the justice system remains the right ambition. We will do this in a careful, managed way that focuses on incremental improvements that drive efficiency, productivity and higher quality services, without major disruption to the justice system."
        },
        {
            "text": "In doing so, I know I can count on the support of my colleagues, the judiciary, legal professionals and our many partners across the justice system. I am immensely proud of what we’ve achieved together already. Sincere thanks to all of you who have been part of the achievement of this historic milestone for the justice system."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Moderneiddio llysoedd a thribiwnlysoedd: yr hyn yr ydym wedi'i gyflawni a'i ddysgu"
        },
        {
            "text": "Mae mynediad at gyfiawnder yn sail i'r hawliau, y cyfrifoldebau a’r rhyddid democrataidd yr ydym i gyd yn elwa ohonynt. Mae wedi bod yn egwyddor hirsefydlog ers canrifoedd lawer - wedi'i warchod a'i werthfawrogi gan lywodraethau, y farnwriaeth annibynnol, gweision sifil a dinasyddion."
        },
        {
            "text": "Dros y blynyddoedd diwethaf, tra'n cadw hanfodion ein system gyfiawnder i bawb sy'n ei defnyddio ac sydd ei hangen, rydym wedi trawsnewid llawer o'r seilwaith technegol a'r systemau rydyn ni'n eu defnyddio i weinyddu’r llysoedd a’r tribiwnlysoedd."
        },
        {
            "text": "Mae diwedd mis Mawrth 2025 yn nodi diweddglo ffurfiol ein rhaglen ddiwygio. Wedi'i lansio yn 2016 gan weinidogion a barnwyr, roedd yn ceisio moderneiddio ein llysoedd a'n tribiwnlysoedd, gan wneud gwasanaethau yn gyflymach, yn symlach ac yn llawer mwy hygyrch."
        },
        {
            "text": "Rydyn ni wedi cyflawni llawer iawn ac rwy'n hynod falch o etifeddiaeth y rhaglen. Mae'r chwyldro tawel hwn wedi ein symud o’r oes bapur i’r oes ddigidol, cyfuno gwybodaeth leol â gwytnwch cenedlaethol, sefydlogi a diogelu ein systemau, a'n paratoi ar gyfer yr unfed ganrif ar hugain."
        },
        {
            "text": "Rydym wedi datblygu 14 o wasanaethau digidol modern, sy'n ymestyn ymhell ac yn agos. Maent yn galluogi mynediad at gyfiawnder i ddioddefwyr a diffynyddion, cyplau sy’n gwahanu, teuluoedd sy'n galaru, cyflogwyr a'u gweithwyr, ffoaduriaid, plant sy’n agored i niwed, busnesau a'u cwsmeriaid, ymhlith eraill. Mae dros 4.1 miliwn o achosion wedi'u cyflwyno'n ddigidol ers mis Ebrill 2019."
        },
        {
            "text": "Wrth i'r rhaglen ddod i ben yn swyddogol, rydym yn parhau i fod yn ymrwymedig i barhau i foderneiddio'r system - er mwyn sicrhau mynediad haws at gyfiawnder i'r rhai sy'n dibynnu ar ein gwasanaethau a gwerth am arian i’r trethdalwr."
        },
        {
            "heading": 2,
            "text": "Manteision gwasanaethau wedi'u moderneiddio"
        },
        {
            "text": "Mae ein trawsnewidiad digidol wedi cyflawni gwelliannau sylweddol ar draws y system gyfiawnder. Dyma'r prif fanteision i'n defnyddwyr a'r gymdeithas ehangach:"
        },
        {
            "text": "Gwasanaethau cyflymach a symlach"
        },
        {
            "text": "Mae ein gwasanaethau ar-lein yn gyflymach ac yn haws i'w defnyddio. Yng nghyd-destun y gwasanaeth Profiant, er enghraifft, mae ein data yn dangos bod ceisiadau profiant sy'n cael eu gwneud ar-lein gan ddefnyddio ein gwasanaeth digidol, o'r adeg gwneud y cais, yn cael eu prosesu bedair gwaith yn gyflymach na defnyddio'r gwasanaeth ar bapur."
        },
        {
            "text": "Yn y maes troseddol, rhwng Ebrill 2017 a Ionawr 2025 cawsom dros 267,000 o bledion ar-lein trwy'r Weithdrefn Un Ynad, gan ddarparu mynediad cyflymach at gyfiawnder ar gyfer troseddau is fel goryrru, gyrru heb yswiriant, peidio talu am drwydded deledu a pheidio talu am docynnau trên."
        },
        {
            "text": "Rydym yn falch o'n cyfraddau boddhad defnyddwyr cyson uchel. Roedd dros 75 y cant o bobl yn fodlon â'r gwasanaeth un ynad, 80% gydag ysgariad ar-lein ac 85% gydag apeliadau am nawdd cymdeithasol a chynnal plant."
        },
        {
            "text": "Gwell data a gwytnwch"
        },
        {
            "text": "Mae ein systemau digidol yn darparu mewnwelediadau a data o safon y gallwn eu defnyddio i wella gwasanaethau, gan gynnwys nodi unrhyw rwystrau cudd o ran cael mynediad i'r rhai sy'n eu defnyddio. Bydd gwasanaethau digidol hefyd yn darparu mwy o wydnwch rhag ofn i unrhyw argyfyngau annisgwyl ddigwydd yn y dyfodol, fel yr hyn a ddigwyddodd yn ystod y pandemig."
        },
        {
            "text": "Technoleg a hygyrchedd"
        },
        {
            "text": "Mae'r defnydd o dechnoleg fideo wedi bod yn drawsnewidiol gan ei fod yn caniatáu i bartïon ymuno â gwrandawiadau o bell, pan gaiff ei gymeradwyo gan farnwr. Mae ar gael mewn dros 70% o'n hystafelloedd llys, gan gynnwys dros 90% o ystafelloedd Llys y Goron."
        },
        {
            "text": "Mae mwy o bresenoldeb rhithiol yn golygu bod angen llai o bartïon i deithio, gan arbed costau a lleihau’r effaith andwyol ar yr amgylchedd. Yn wir, amcangyfrifodd adolygiad 2021 fod effaith symud gwrandawiadau o fod yn wyneb yn wyneb i fod ar-lein yn arbed 3.2 miliwn cilogram o garbon deuocsid bob blwyddyn, sy'n cyfateb i dynnu 1,485 o geir oddi ar y ffordd am flwyddyn."
        },
        {
            "text": "O dan fframwaith arweiniol ein Cynllun Iaith Gymraeg, rydym yn sicrhau bod ein rhaglen ddiwygio yn darparu hygyrchedd cyfartal yn y Gymraeg."
        },
        {
            "text": "Effeithlonrwydd gweithredol"
        },
        {
            "text": "Mae systemau diwygiedig hefyd wedi llywio effeithlonrwydd mewn rhannu data a chywirdeb rhwng partneriaid cyfiawnder troseddol ar draws meysydd trosedd, sifil, teulu a’r tribiwnlysoedd. Ac mae ein pum canolfan wasanaeth safonol diwydiant modern a'n canolfannau busnes cenedlaethol wedi defnyddio'r dechnoleg ddiweddaraf i ateb dros 2.8 miliwn o alwadau rhwng Ebrill a Rhagfyr 2024, gan ddarparu gwasanaeth pwrpasol i'r cyhoedd gydag ymholiadau am achosion."
        },
        {
            "text": "Manteision ariannol"
        },
        {
            "text": "Bydd y rhaglen ddiwygio yn darparu manteision ariannol sylweddol hefyd ac rydym yn gweithio gyda'r farnwriaeth i ddilysu effaith y newidiadau hynny. Byddwn yn ystyried effeithiau mwy o ddigideiddio, arbedion eiddo ac arbedion a ddaw o ddatgomisiynu hen systemau TG."
        },
        {
            "text": "Er bod y manteision hyn yn dangos llwyddiant y rhaglen, nid yw eu cyflawni wedi bod heb ei heriau."
        },
        {
            "heading": 2,
            "text": "Dysgu o brofiad"
        },
        {
            "text": "Mae'r rhaglen ddiwygio heb amheuaeth wedi cyflawni newidiadau mawr a oedd eu hangen ond mae cwblhau rhaglen o'r raddfa hon mewn amgylchedd gweithredol mawr wedi bod yn heriol. Yn wreiddiol, roedd disgwyl i'r rhaglen ddod i ben yn 2022, ac mae'r rhaglen wedi costio mwy nag yr oeddem wedi ei ddisgwyl ac nid ydym wedi gallu cyflawni popeth a ragwelwyd ar y dechrau."
        },
        {
            "text": "Er bod y pandemig wedi achosi aflonyddwch mawr, roedd yn tanlinellu pwysigrwydd gwasanaethau moderneiddio ac yn ein galluogi i weithredu pan gaeodd systemau cyfiawnder eraill ledled y byd. Ychwanegodd y streicio a’r galw cynyddol am lawer o wasanaethau at yr heriau. Mae hefyd yn amlwg, fodd bynnag, bod y cwmpas gwreiddiol yn rhy uchelgeisiol."
        },
        {
            "text": "Rydym wedi bod yn agored am y gwersi yr ydym ni wedi'u dysgu o geisio gwneud gormod, yn rhy gyflym ac wedi gwella ein prosesau adborth trwy gydol y daith. Rydym yn hynod ddiolchgar am yr adborth hwnnw a'r gefnogaeth rydyn ni'n parhau i gael gan weithwyr proffesiynol cyfreithiol, defnyddwyr cyhoeddus, y cyfryngau a phartneriaid eraill ar draws y system gyfiawnder."
        },
        {
            "heading": 2,
            "text": "Dyfodol wedi'i adeiladu ar sylfeini digidol cadarn"
        },
        {
            "text": "Wrth i ni gyrraedd y garreg filltir fawr hon ac edrych ymlaen at y flwyddyn i ddod, byddwn yn parhau i ganolbwyntio ar wella ymarferoldeb presennol ein systemau a symud ymlaen â'r newidiadau mwyaf effeithiol. O ran gwaith sifil, byddwn yn blaenoriaethu'r ymarferoldeb a fydd yn digideiddio'r nifer uchaf o achosion, gan lywio’r buddion mwyaf i ddefnyddwyr a’r buddion mwyaf o ran gwerth am arian."
        },
        {
            "text": "Byddwn yn cyhoeddi blogiau yr wythnos nesaf yn amlinellu'n fanylach beth mae hyn yn ei olygu mewn awdurdodaethau penodol."
        },
        {
            "text": "Wrth edrych y tu hwnt i'r rhaglen ddiwygio, mae'n rhaid i ni – a byddwn ni – yn cymryd y gwersi rydyn ni wedi'u dysgu a'u cynnwys yn ei taith foderneiddio barhaus wrth i ni barhau i wella. Ym mis Ebrill, byddwn yn cychwyn ar ein cynllun strategol newydd tuag at ein gweledigaeth tymor hwy, gan adeiladu ar yr hyn yr ydym eisoes wedi'i gyflawni. Mae moderneiddio'r system gyfiawnder ymhellach yn parhau i fod yr uchelgais. Byddwn yn gwneud hyn mewn ffordd ofalus, a reolir sy'n canolbwyntio ar welliannau cynyddol sy'n llywio effeithlonrwydd, cynhyrchiant a gwasanaethau o ansawdd uwch, heb aflonyddu mawr ar y system gyfiawnder."
        },
        {
            "text": "Wrth wneud hynny, rwy'n gwybod y gallaf ddibynnu ar gefnogaeth fy nghydweithwyr, y farnwriaeth, gweithwyr proffesiynol cyfreithiol a'n partneriaid niferus ar draws y system gyfiawnder. Rwy'n hynod falch o'r hyn rydyn ni wedi'i gyflawni gyda'n gilydd eisoes. Diolch yn ddiffuant i bawb ohonoch sydd wedi bod yn rhan o gyflawni'r garreg filltir hanesyddol hon i'r system gyfiawnder."
        }
    ]
}