{
    "url": "https://ukhsa.blog.gov.uk/2025/03/24/with-tuberculosis-tb-on-the-rise-again-how-can-we-prevent-further-spread/",
    "title": "With tuberculosis (TB) on the rise again, how can we prevent further spread?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection",
        "Tuberculosis"
    ],
    "pub_date": "2025-03-24T10:06:34+01:00",
    "content": [
        {
            "text": "UKHSA’s most recent data on tuberculosis (TB) revealed a rise in reported numbers in England by 13% in 2024 (5,480) compared to 2023 (4,850). This signals a rebound to above the pre-COVID-19 numbers, despite significant progress towards a decline in TB over the last few decades."
        },
        {
            "text": "In this blog post, we outline the trends and patterns healthcare professionals should remain alert for, to help prevent the disease spreading further."
        },
        {
            "heading": 2,
            "text": "Causes and symptoms of TB"
        },
        {
            "text": "Tuberculosis is an infection caused by bacteria. It mainly affects the lungs, but it can affect any part of the body, including lymph nodes (glands), bones and the brain, causing meningitis. The infection is spread when a person with TB in their lungs or throat coughs or sneezes."
        },
        {
            "text": "Symptoms include a cough that lasts more than 3 weeks, high temperatures, drenching night sweats, loss of appetite and unexplained weight loss. It is a potentially fatal condition but can be cured if it's diagnosed early and treated promptly with the right combination of specific antibiotics. Early diagnosis is essential for the most successful outcome."
        },
        {
            "heading": 2,
            "text": "Rates of TB in England"
        },
        {
            "text": "The incidence of TB has remained low in England for a long period of time. However, data for 2023 and 2024 shows that a previous downward trend has been reversed and rates now sit above pre-COVID-19 numbers."
        },
        {
            "text": "TB remains most common in urban areas, including London. However, we have recently seen increases in parts of the country where TB incidence has historically been lower, such as the South West and North East."
        },
        {
            "text": "This latest data set confirms England is moving further away from the trajectory required to meet World Health Organization (WHO) 2035 elimination targets. These targets include reaching 90% of people with TB treatment, providing access to healthcare services and using a WHO-recommended rapid test as the first method of diagnosing TB."
        },
        {
            "heading": 2,
            "text": "Groups at highest risk"
        },
        {
            "text": "In England, we know the highest incidence is among people born outside the UK (81.5%). In instances where the person was born in the UK (18.5%), research has shown a clear link between TB and deprivation, including those who experience homelessness, drug and alcohol dependence, and have had contact with the criminal justice system."
        },
        {
            "heading": 2,
            "text": "How frontline healthcare professionals can help reduce TB"
        },
        {
            "text": "It is essential that at risk groups and healthcare workers know the signs and symptoms of TB and seek out a timely diagnosis – treating TB early reduces the risk of transmission to others and improves outcome for individuals."
        },
        {
            "text": "It’s not uncommon for early symptoms of TB, such as a persistent cough and high temperature, to be confused with flu or COVID-19. For this reason, it’s important healthcare professionals keep local communities aware of TB symptoms, especially that a persistent cough with mucus and lasting longer than 3 weeks could be signs of the infection.   "
        },
        {
            "text": "Timely notification of a positive diagnosis must also be a priority, as it will inform subsequent public health action."
        },
        {
            "heading": 2,
            "text": "Breaking down barriers to treatment"
        },
        {
            "text": "We know that many people diagnosed with TB face barriers to accessing the interventions required to limit onward transmission. An array of factors such as awareness and geographical access to healthcare services, language and cultural barriers, and lack of support to attend screening appointments can all play a part. They also experience difficulties self-administering treatment and attending follow-up appointments. Consequently, 25% of individuals with TB and social risk factors do not complete treatment within the expected duration."
        },
        {
            "text": "UKHSA recently published a toolkit for tackling TB in inclusion health groups (IHGs). This toolkit provides local systems with support to lead the development, improvement, and delivery of services to tackle TB using an integrated approach across IHGs with healthcare services. The toolkit is evidence-based and showcases best practice and learning from across the country, demonstrating the impact of outreach, providing patient-centered care and using accessible communication. Its recommendations include:"
        },
        {
            "heading": 2,
            "text": "Genomic surveillance"
        },
        {
            "text": "UKHSA’s world-leading genomic sequencing capabilities are tailoring the antibiotics used to treat and cure an individual with TB. As a result, the time from TB detection to understanding the effective drugs has halved from 6 to 12 weeks to approximately 2 to 4 weeks in the vast majority of treated infections – helping reduce onward transmission in the community."
        },
        {
            "text": "With TB cases rising, we need to maintain collective action and vigilance. UKHSA is working with partners across the healthcare system to understand how we can best refocus efforts to eliminate this preventable and treatable infection."
        },
        {
            "text": " "
        }
    ]
}