{
    "url": "https://aphascience.blog.gov.uk/2025/03/24/world-tb-day-2025/",
    "title": "If you go down to the woods today",
    "authors": [
        "Siân Powell"
    ],
    "categories": [
        "Bovine Tuberculosis",
        "Diagnostics & testing",
        "Surveillance",
        "Uncategorized"
    ],
    "pub_date": "2025-03-24T11:18:06+00:00",
    "content": [
        {
            "text": "Nestled on the western edge of the Cotswolds Area of Outstanding Natural Beauty is Woodchester Park, a steep, wooded valley containing a network of pasture, lakes and waterways with a renowned Victorian Gothic mansion at its heart. Most visitors remain unaware that this Site of Special Scientific Interest is home to two long-running mammal studies: one focuses on the famous greater horseshoe bats, which began in 1959, while the other, the subject of this blog, centres on badgers and tuberculosis, a study that started in 1976."
        },
        {
            "text": "In 1971, a Gloucestershire based dairy farmer found a badger that was infected with Mycobacterium bovis – the bacterium that causes bovine tuberculosis and that currently costs UK taxpayers around £150 million a year. This set off a chain of events that led to the commissioning of what was meant to be a short project to investigate the significance of tuberculosis in a wild badger population."
        },
        {
            "text": "The first badger in our database was a deceased adult male (a road traffic collision victim) which was diagnosed with tuberculosis by post-mortem examination on 13 December 1975. Following this discovery, the study site was founded to monitor the nearby badger population in Woodchester Park. The project was directed by an ecologist, Dr. Chris Cheeseman, and under his tenure it evolved into a research hub for pioneering innovative approaches to better understand how badger behaviour influences disease dynamics.  "
        },
        {
            "text": "So far, the researchers at Woodchester have had the privilege of getting to know nearly 3,200 badgers. Some of these individuals have been monitored for their entire lives, which is up to 14 years in this population (though typically less). The badgers have, for the most part, lived in relatively stable social groups and occupied distinct territories which have been mapped annually. This has shown that despite a high level of stability, some groups do merge or split over time, and some individuals move between groups. These changes are particularly interesting as they provide opportunities for the spread of infection amongst social groups."
        },
        {
            "text": "In recent years, we have been able to use radio-collars with GPS capability to monitor the movement of individuals, allowing us to track when and where they go. The collars also include proximity loggers which can tell us when two collared animals come into close contact. This data will be used to build social networks which may reveal how disease can spread through the population and provide insights into how to control it.  "
        },
        {
            "heading": 2,
            "text": "Advances in diagnostics"
        },
        {
            "text": "As well as advances in our understanding of badger behaviour and ecology, our diagnostic capabilities have improved dramatically over the decades."
        },
        {
            "text": "M. bovis is a very slow growing bacterium, and so the culture of samples takes weeks to yield results. Culture has other limitations: it relies on obtaining a sample when the animal is shedding bacteria, contamination can occur from other faster growing micro-organisms, and the mycobacteria in the sample need to be in an active/replicating state."
        },
        {
            "text": "Therefore, the study has benefited from the addition of a range of other complimentary tests, the first of which was an enzyme-linked immunosorbent assay (ELISA) for the detection of antibodies produced in response to infection. This significantly increased test sensitivity beyond that which bacterial culture alone could achieve."
        },
        {
            "text": "Since then, research in diagnostics has progressed resulting in the development of two further antibody detection assays (StatPak and DPP), and an interferon gamma release assay (IGRA)."
        },
        {
            "text": "By 2024 we were routinely using three different assays to determine disease status and progression: culture for the isolation of live bacteria, the IGRA, and the DPP assay, while also evaluating the field performance of a new antibody-based test – the IDEXX. In addition, we are now able to routinely subject any isolated bacteria to whole genome sequencing which allows us to infer transmission amongst our badgers and the local cattle."
        },
        {
            "text": "Using samples from our study area and this important epidemiological tool, conclusively demonstrated that infection can be transmitted in both directions between badgers and cattle. "
        },
        {
            "heading": 2,
            "text": "The ongoing journey"
        },
        {
            "text": "Our database now includes over 16,000 data points—and that does not even scratch the surface of the additional research being conducted. From genetic studies on the bacteria and badgers to explore transmission, health, and relatedness, to radio collaring, camera trapping, and social network analysis to uncover the behaviours driving these dynamics, our research continues to expand in scope and impact."
        },
        {
            "text": "Forty plus years after the project was meant to end, the insights gained from this interdisciplinary team continue to inform disease control options and advance our knowledge of badger ecology and TB dynamics. Whether through improving biosecurity strategies, developing and validating diagnostic assays, establishing successful and safe vaccination programmes, or understanding how disease naturally fluctuates within a wild animal population, the Woodchester Park study has had real-world impact."
        },
        {
            "text": "As we approach our 50th anniversary in 2026, we look forward to celebrating the wealth of science produced over the past five decades, the policy and practical outputs we have helped to shape… and of course, all the exciting new discoveries and partnerships yet to come.  "
        }
    ]
}