{
    "url": "https://moderncivilservice.blog.gov.uk/2024/05/01/an-ambitious-civil-service-introducing-the-policy-system-framework/",
    "title": "An Ambitious Civil Service: introducing the Policy System Framework",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Modernisation and Reform",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-05-01T09:47:57+01:00",
    "content": [
        {
            "heading": 6,
            "text": "A guest blog by Serena Nüsing, Senior Service Designer in the Policy Profession Unit"
        },
        {
            "text": "Are you a civil servant who’s passionate about improving policy capability at an organisational level? Do you want to know if your organisation is best set up to design and deliver good policy — both now and in the future? "
        },
        {
            "text": "The Policy System Framework was designed to help you as a civil servant to better understand the system in which your organisation develops and delivers policy, and identify areas for improvement."
        },
        {
            "text": "Policy leaders across government are interested in building organisational capability. As a profession, we are interested in building high-performing policy systems that support and enable good policy-making. "
        },
        {
            "text": "Often improvement efforts are driven by enthusiastic individuals without a shared framework to guide the conversation and process. As a result, they can struggle to know where to start and miss the opportunity to learn from each other. "
        },
        {
            "text": "Introducing the Policy System Framework"
        },
        {
            "text": "By stimulating reflective conversations and capturing the experience of policymakers on the ground, the Policy Systems Framework acts as a vehicle to shift our focus towards a wider system approach to capability building. It provides a common language for teams and organisations to reflect on their policy system and a structure to facilitate conversations about improvement. "
        },
        {
            "text": "The framework encompasses four main pillars of the policy system as identified through our research with over 100 civil servants from across government:"
        },
        {
            "text": "A new but familiar concept"
        },
        {
            "text": "Our research showed that looking at organisational capability, instead of individual skills, is sometimes a new and unfamiliar concept for many people. After interviewing policy makers and running workshops with them, it was clear that they recognised a system approach is needed to help improve our policy capabilities and to keep pace with current and emerging policy challenges."
        },
        {
            "text": "How the framework can help you"
        },
        {
            "text": "The Policy System Framework provides a common language for organisations and teams in the public sector to facilitate improvement conversations about their policy system while being flexible enough to consider different political operating contexts. The framework can help you, your teams, and your department to:"
        },
        {
            "text": "Our team in the Policy Profession Unit is working with departments across government to test the framework and to identify areas for improvement. You can download the framework here. If you’d like to discuss this framework further, we’d love to hear from you — please get in touch."
        }
    ]
}