{
    "url": "https://educationhub.blog.gov.uk/2024/05/01/how-reducing-the-cap-on-faith-school-admissions-will-help-to-raise-standards/",
    "title": "How reducing the cap on faith school admissions will help to raise standards  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "SEND"
    ],
    "pub_date": "2024-05-01T09:14:49+01:00",
    "content": [
        {
            "text": "Faith groups run some of the best schools in the country, including in some of the most disadvantaged areas.  "
        },
        {
            "text": "Current rules mean that religious free schools are only allowed to offer 50% of places to pupils based on faith. Some providers say this cap discourages them from opening new academies.  "
        },
        {
            "text": "To make sure as many children as possible can access the quality school places religious schools offer, we’re launching a consultation on whether to lift the faith cap to support faith school providers to open new schools."
        },
        {
            "text": "The consultation is open to anyone who wants to have a say, and will last for 7 weeks. You can access it here on Gov.uk."
        },
        {
            "text": "We've launched it alongside proposals to open new special faith-based academies to create more places for children with special educational needs and disabilities (SEND). "
        },
        {
            "text": "This is because faith school providers often deliver high quality education and run some of the best performing schools across the country.  "
        },
        {
            "heading": 3,
            "text": "What does the consultation mean for faith schools?  "
        },
        {
            "text": "Currently, the 50% faith cap means that if a new faith or church free school is oversubscribed, it can only prioritise pupils based on faith for half of the places. This means that at least half of the school's available places must be allocated without reference to faith-based admissions criteria.  "
        },
        {
            "text": "As a result, some faith groups have felt unable to open new free schools and discouraged about bringing existing schools into academy trusts.  "
        },
        {
            "text": "The consultation will look at lifting this cap meaning new free schools would be able to offer more places to pupils based on faith."
        },
        {
            "text": "Building on our work to improve standards, the consultation will also explore how faith providers can use their expertise to open special faith-based academies for the first time."
        },
        {
            "text": "This will support faith school providers to open more schools across the country, creating more places for all children. "
        },
        {
            "heading": 3,
            "text": "How will our plans help SEND schools?  "
        },
        {
            "text": "We want to make sure that all children and young people who need specialist support have access to it, so it’s important that all strong providers, including faith schools, can open schools for children with SEND to help meet the need for places.  "
        },
        {
            "text": "Currently, faith-based providers can’t open special schools. The consultation will look at how we could change this to maximise the benefits offered by high quality academy trusts, including by opening special faith-based academies for children with SEND for the first time.  "
        },
        {
            "text": "These schools would admit pupils on the basis of their need, not their faith.  "
        },
        {
            "text": "Changing our policy to allow special academies to be designated with a religious character would encourage high quality faith school providers to apply to establish new special academies and free schools within their multi-academy trusts, helping us to meet the increased need for places for children with SEND. "
        },
        {
            "heading": 3,
            "text": "What is an academy?  "
        },
        {
            "text": "Academies are state-funded schools.  "
        },
        {
            "text": "However, unlike other state-funded schools, they’re independent from local authorities, and are instead run by academy trusts. Trusts are not-for-profit companies and can be multi academy trusts (MATs) – which run several academies – or single academy trusts that run just one.  "
        },
        {
            "text": "They have more flexibility around what they teach, teachers’ pay and conditions, the length of the school day and term dates.  "
        },
        {
            "text": "Some academies used to be local authority-maintained schools, and while and others are brand new schools known as free schools, which are established to create more school places in a local area.  "
        },
        {
            "text": "New data shows that over half of state-funded schools are now academies. "
        },
        {
            "heading": 3,
            "text": "How are academies helping to raise standards?  "
        },
        {
            "text": "Our analysis shows that, on average, academy schools improve standards quicker than equivalent local authority-maintained schools.  "
        },
        {
            "text": "Being part of an academy trust helps to improve standards because the best leaders can take responsibility for supporting more schools. This develops great teachers and allows schools to focus on what really matters – teaching, learning and a curriculum that is based on what works.  "
        },
        {
            "text": "A survey found more than 75% of recently converted schools reported that the overall impact of joining a multi-academy trust was positive. Around 9 in 10 of these felt that the positive impact either met or exceeded their expectations.  "
        },
        {
            "text": "High quality multi-academy trusts have been key to the increase in standards in schools since 2010. The best trusts have transformed the life chances of their pupils, including thousands of children from disadvantaged backgrounds.    "
        }
    ]
}