{
    "url": "https://ofsi.blog.gov.uk/2024/05/01/ofsi-launch-faqs/",
    "title": "OFSI launch FAQs",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2024-05-01T10:21:54+01:00",
    "content": [
        {
            "text": "On 1 May, the Office of Financial Sanctions Implementation (OFSI) introduced Frequently Asked Questions (FAQs), a new form of additional guidance aimed at providing technical support to industry partners and the public. "
        },
        {
            "text": "Our FAQs are designed to offer easily accessible responses to commonplace compliance questions. Whether you're navigating sanctions related to specific countries or industries, or operating in high-risk jurisdictions, our FAQs provide the extra support you need. "
        },
        {
            "text": "Accessible directly from the OFSI guidance page on GOV.UK starting today, our FAQs offer concise answers to your specific inquiries, complementing our existing guidance. "
        },
        {
            "text": "We strongly recommend reviewing FAQs alongside our existing guidance and legislation, which take precedence. For specific cases, OFSI also advises to seek independent legal advice.  "
        },
        {
            "text": "Here are some key details to know about our new FAQs: "
        },
        {
            "text": "Can I request FAQs?  "
        },
        {
            "text": "OFSI does not generally accept individual requests for new FAQs. However, OFSI will look to publish FAQs when they would benefit a significant portion of industry or the public. Our engagement team also continue to work closely with industry and the public to identify specific issues where additional guidance may be of benefit. "
        },
        {
            "text": "How often will OFSI publish FAQs?  "
        },
        {
            "text": "OFSI will release FAQs on an as-needed basis, focusing on areas where new guidance would be beneficial to a substantial audience. OFSI may publish FAQs to support a significant policy change, new general licences, enforcement actions or wider implementation problems. Any new FAQs will be announced through OFSI’s E-Alert service. "
        },
        {
            "text": " What happens to FAQs that are withdrawn?  "
        },
        {
            "text": "Occasionally, OFSI may withdraw FAQs at its discretion. All withdrawn FAQs will be transparently listed on GOV.UK, along with their withdrawal dates, to ensure continued clarity and support for users of our guidance. "
        },
        {
            "text": "Visit our FAQs on GOV.UK today. "
        }
    ]
}