{
    "url": "https://ssac.blog.gov.uk/2024/05/01/professor-stephen-hardy-reflects-on-joining-ssac-with-an-insider-view/",
    "title": "Professor Stephen Hardy reflects on joining SSAC with ‘an insider view’",
    "authors": [
        "Professor Stephen Hardy"
    ],
    "categories": [
        "About the Committee",
        "DWP",
        "Independent advice",
        "Legislation",
        "social security"
    ],
    "pub_date": "2024-05-01T10:20:42+01:00",
    "content": [
        {
            "text": "As an academic, researching into employment and social security law, I often found myself looking at the wealth of work undertaken by the Social Security Advisory Committee (SSAC) from the outside. Therefore, when they advertised for new Committee members with legal expertise in social security, I thought why not take a look from the inside. I certainly have not been disappointed by my boldness to venture inside the SSAC, given my experiences to-date."
        },
        {
            "text": "I applied, in the first instance, because I wanted to utilise my academic social security legal knowledge to-date in an applied setting. I considered that my involvement with social security law since 1990, firstly as a pro bono legal representative (through the Free Representation Unit in London) regularly appearing before the then Social Security Appeal Tribunal; thereafter, as a Barrister, and latterly, sitting as a Fee Paid Tribunal Judge, would bring some experience to the discussion at Committee. However, I have soon learned, through SSAC, that legal analysis without the full social context is by itself quite inert. Hence, the richness and value of a much wider, diverse debate which SSAC enables from a range of perspectives and experiences."
        },
        {
            "text": "First and foremost, since its inception in 1980, the SSAC has had a breadth of people, in terms of both backgrounds and experience, in order to provide impartial advice to the UK Government on social security issues. To that end, I have now joined a team of highly experienced people who are adept at effectively scrutinising social security regulations. It is reassuring to see from the inside, how SSAC works rigorously and independently at assessing newly proposed legislation and manages to reach a collective view on recommendations to be out forward for the Secretary of State to consider. The breadth of SSAC membership, from charity leaders, housing, disability and welfare rights experts to academics, including covering most devolved nations, makes SSAC an incredibly stimulating and enjoyable Committee to work within."
        },
        {
            "text": "From my own perspective, it is fascinating to see how draft regulations are formed from a principle and/or policy objective; are then, discussed through a multi-faceted lens of experiences and opinions; and, agreed enhancements are then proposed. Whilst SSAC gives me an opportunity to influence legislative drafting and change. It also serves to remind me how effective independent scrutiny makes for better legislation. For example, upon reflection, much of my experience to-date has been scrutinising some highly technical and complex social security regulations which impacts on fellow citizen’s lives. Consequently, it is not a task taken lightly, given the consequences. However, being able to discuss with such experienced colleagues means that when SSAC advises a Secretary of State, the Public can be reassured of the thoroughness and rigour of the debate underlying the proposed legislation. Furthermore, I have gained invaluable insights being on SSAC already, such as talking with work coaches in a Job Centre about their pivotal role and the needs of claimants."
        },
        {
            "text": "Above all, I am pleased to be able to give something back through such public service, using my knowledge to improve people’s lives. Whilst every Committee brings a group of diverse people with an array of different skills around a table, the sheer quality and depth of the debate around the SSAC table when the committee scrutinises new legislation or DWP programmes is a privilege to be ensconced in. Amidst the everyday headlines about what goes on in Westminster and Whitehall, I see first-hand – with an insider view now - how the challenges and opportunities from a legislative perspective plays out behind closed doors in an effective systematic and strategic way for the betterment of benefits’ claimants."
        },
        {
            "text": "Therefore, thus far, my own SSAC journey has been enjoyable, albeit at times a lot of intense hard work under a short timescale. In any event, I would recommend to all of those with an interest in our nation’s social security issues to mindful of the important work that SSAC does and to think about getting involved when the next opportunity arises."
        }
    ]
}