{
    "url": "https://nda.blog.gov.uk/three-trends-shaping-the-future-of-engineering/",
    "title": "Three trends shaping the future of engineering",
    "authors": [
        "Eleanor Thursby, corporate communications Officer"
    ],
    "categories": [
        "Engineering",
        "Mission delivery",
        "Recruitment"
    ],
    "pub_date": "2024-05-01T13:34:10+01:00",
    "content": [
        {
            "text": "For head of asset management at Sellafield Ltd, Gary Dixon, harnessing the latest technology and applying them on an industrial engineering level is something that he gets to do every day."
        },
        {
            "text": "Here he explains what the top 3 trends shaping the future of engineering are and how his engineering team is harnessing them to push the boundaries of innovation within the nuclear industry."
        },
        {
            "text": "Engineering is an industry that is constantly evolving. The transformation of the engineering landscape from when I first started out to now is astonishing."
        },
        {
            "text": "The pace of technological advancement within our sector is only getting faster and with that comes vast opportunity."
        },
        {
            "text": "For us at Sellafield Ltd, this acceleration is an opportunity to adapt, upskill and develop the latest innovations in the context of an industrial environment."
        },
        {
            "text": "This not only helps us to solve some of the most complex nuclear challenges in the world but further drives the advancement of these technologies in the wider engineering landscape."
        },
        {
            "text": "Here are the top 3 trends I believe will continue to shape the future of engineering and how we are driving these innovations in our industry."
        },
        {
            "heading": 3,
            "text": "Virtual reality (VR)"
        },
        {
            "text": "When Facebook (now Meta) bought the Oculus VR company for $2 billion in 2014, VR has been an immersive technology that has gained a lot of attention."
        },
        {
            "text": "Although it has been around for just over 10 years now, the predominant use and development of VR has been within the world of gaming."
        },
        {
            "text": "It is only in recent years that the engineering sector, has started to explore and harness VR in the context of industry. The potential benefits VR has for engineering is incredibly powerful - improvements from the perspectives of time, cost, safety and environment, to name a few."
        },
        {
            "text": "Here at Sellafield Ltd we really are leading the way with the application of VR in the nuclear industry. Through the use of digital twins and virtual replicas we are able to simulate, analyse and optimise."
        },
        {
            "text": "In doing we can upskill our engineers from a technical and leadership position."
        },
        {
            "text": "The key areas we are harnessing the power of VR are:"
        },
        {
            "heading": 4,
            "text": "Site event replication "
        },
        {
            "text": "With every situation on the Sellafield site, be that a problem that needs solving or an improvement we’ve engineered, we must produce a brief to talk our teams and supply chains through it."
        },
        {
            "text": "By using VR we can create a virtual replica of the onsite event, object or process in a digital version of the Sellafield site environment. Our teams can then be immersed in simulation situations and their outcomes. This provides us with a greater context and understanding of each situation and allows us to can make better and more informed decisions."
        },
        {
            "text": "We are currently testing this with a built scenario for our electrical engineers."
        },
        {
            "heading": 4,
            "text": "Virtual learning environment"
        },
        {
            "text": "As we use VR for onsite event replication, we are also able to use the technology in a similar way for training purposes by creating real time isolation events in a virtual plant environment."
        },
        {
            "text": "This digital representation allows our trainee engineers to learn and practice in a practical setting, ensuring they can make mistakes in a safe setting, before applying their skills in the real-life plant. This means we can upskill our work force at a faster pace."
        },
        {
            "text": "We are trialling this with our electrical engineers to speed up their nominations process."
        },
        {
            "heading": 4,
            "text": "Realtime communication"
        },
        {
            "text": "Using VR headsets we are able to connect our craftspeople on plant and in workshops with our office-based engineers in real-time. With a craftsperson wearing the headset on the Sellafield site, our engineers can see the equipment, annotate and explain tasks to the onsite team in an interactive, clear manner without going on the Sellafield site."
        },
        {
            "text": "This means we could have engineers all over the world ‘virtually’ working on our plants. This is fantastic from a time, cost and environmental perspective."
        },
        {
            "heading": 4,
            "text": "Experiential leadership training"
        },
        {
            "text": "Within our team, we have lots of young leaders. We want to ensure we create a development environment that is as supportive as possible to build essential leadership qualities."
        },
        {
            "text": "There are some human behaviour scenarios that you can’t train for. With VR, we can build replica scenarios to allow our young leaders to make mistakes in a safe place. Doing so ensures we build confident and quality leaders."
        },
        {
            "heading": 3,
            "text": "Robotics"
        },
        {
            "text": "Robotics and automation continue to advance, driven largely by the development of supporting technologies. Robots can now be integrated with accurate sensors, AI, high-performance motors and the development of robust algorithms means we can use robots for mapping, localization, motion planning, and waypoint navigation."
        },
        {
            "text": "Where robots used to be able to perform just basic tasks, we are now seeing robots them intuitively adapt, learn and interact with their environments and people."
        },
        {
            "text": "Scary? Not at all. Robots won’t be taking over the world but instead utilised in various industries to collaborate with humans. Collaborative robots (or ‘cobots’ as they are now known) are assisting with tasks in industries such as healthcare and transportation to improve precision, strength and safety."
        },
        {
            "heading": 4,
            "text": "Driving robotics and automation in the nuclear industry"
        },
        {
            "text": "At Sellafield, we are required to operate in one of the most complex and challenging nuclear sites in the world."
        },
        {
            "text": "We need to decommission the Sellafield site at pace whilst ensuring we keep our people and environment safe. The advancement in robotics and automation is game-changing in ensuring we can achieve our mission."
        },
        {
            "text": "We have been at the forefront of driving the innovation and advancement of robotics in the nuclear industry. We are part of The Robotics and Artificial Intelligence Collaboration (RAICo) alongside the UK Atomic Energy Authority (UKAEA), Nuclear Decommissioning Authority (NDA) and the University of Manchester."
        },
        {
            "text": "Based out of RAICo1 in Whitehaven, West Cumbria alongside our supply chain partners, we are developing robotics and AI technologies for use in hazardous nuclear decommissioning environments like Sellafield. Using robotics in this environment means we can move faster and be safer."
        },
        {
            "text": "The learnings from the research and development for decommissioning will also develop essential expertise that our supply chain can apply to the wider nuclear industry (and beyond)."
        },
        {
            "heading": 4,
            "text": "Quadrupeds: separating the human and the hazard"
        },
        {
            "text": "One of the biggest challenges we face is accessing high hazard areas safely to understand a) what we are working with and b) how we can start to decommission these active areas."
        },
        {
            "text": "Enter, Spot the dog. Our very own self-learning quadruped that we can deploy into active areas, operated by a remote human."
        },
        {
            "text": "We've started to deploy spot into various active areas on the Sellafield site to start inspections which is completely transforming the way we work. It takes humans out of the hazardous areas, ensures we can work faster, has halved the predicted costs of missions and has significantly reduced the waste generated from protective gear."
        },
        {
            "text": "And that is just for inspections…now that we have the ‘vessel’ of a robot, it opens up a realm of possibilities via the integration and attachment of other technologies."
        },
        {
            "text": "We could be using it for radiological characterisation and radiological surveys -  both key activities in the nuclear decommissioning process – without putting humans at risk. We of course could also teach the robots how to use certain tools so we can perform certain tasks remotely."
        },
        {
            "text": "One of the most exciting opportunities in my eyes is combining our robotic developments, VR capabilities and 3D mapping facilities to create virtual simulations of high-hazard buildings that have been inaccessible to us for years."
        },
        {
            "text": "We could be using robots to explore the unknown-risk areas, provide us with data about radiation and scan the area."
        },
        {
            "text": "This information can be used to create virtual 3D replica environments to allow us to see what it looks like, plan strategies for decommissioning and even allow us to plan work to minimise human time these radioactive specific areas."
        },
        {
            "heading": 4,
            "text": "Bi-peds on the horizon"
        },
        {
            "text": "The innovation we have driven with our work on quadrupeds is informing our work with bi-peds. We are currently in in the early-stages of this and still have a while to go, but as with our current quadrupeds, we aim to have self-learning bi-peds that we can utilise in our onsite operations. So watch this bi-ped shaped space."
        },
        {
            "heading": 3,
            "text": "3D printing"
        },
        {
            "text": " 3D printing is one of the fastest moving advancements in engineering. It is no understatement to say 3D printing is absolutely revolutionising our industry by allowing for rapid prototyping and manufacturing and custom design solutions."
        },
        {
            "text": "It’s not just good for efficiency either, it’s good for the planet too. By using 3D printing, we are able to reduce waste materials."
        },
        {
            "text": "3D printing is being used on a relatively small scale currently but in engineering this technology is only going to continue to evolve. Printers will become faster, will start being able to print more complex parts and in a range of materials."
        },
        {
            "heading": 4,
            "text": "The solution to ageing engineering"
        },
        {
            "text": "One of our biggest challenges at Sellafield is keeping obsolete systems in some of our plants working order until they can be decommissioned. Often these systems make use of older technologies that are no longer utilised in modern day engineering."
        },
        {
            "text": "That means when we a part needs to be replaced – it can’t be because it is no longer manufactured."
        },
        {
            "text": "At the moment, the solution to this is to manually design a new part and have it bespoke-manufactured. Due to the complex nature of the task and system, this is a process that can take months."
        },
        {
            "text": "With 3D printing we could be doing this in a matter of days. We could 3D map the part, build drawings to incredible detail and get a 3D printer to print it for us in a few hours."
        },
        {
            "heading": 4,
            "text": "Printing polymers to metals"
        },
        {
            "text": "We are already using a polymer printing here at Sellafield with great success but the next step for us is larger scale metal 3D-printing. This isn’t something that is currently seen on a larger scale in the nuclear industry."
        },
        {
            "text": "We currently have 3 metal 3D printers but in time, the hope is that we’ll have a warehouse of 40 doing jobs that currently take us months, in just a few hours."
        },
        {
            "text": "If you’re interested in joining us to drive these engineering innovation trends, apply for one of our engineering and maintenance roles here at Sellafield."
        },
        {
            "text": "You can find our latest opportunities here."
        }
    ]
}