{
    "url": "https://mhclgmedia.blog.gov.uk/2024/05/01/voter-id-requirements-for-voting-in-person/",
    "title": "Voter ID requirements for voting in person",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Local government"
    ],
    "pub_date": "2024-05-01T11:39:18+01:00",
    "content": [
        {
            "text": "The Government has introduced identification for voting in person across Great Britain. Voter identification has been recommended by the Electoral Commission since at least 2014 and is in line with the longstanding arrangements in Northern Ireland, which has had the requirement for photographic identification to vote in elections since 2003. Most European countries also require some form of identification to vote, as well as countries like Canada."
        },
        {
            "text": "Showing photographic identification to vote is a reasonable approach to combat the inexcusable potential for voter fraud that existed in our electoral system. The chair of the Commission set out at the Levelling Up, Housing and Communities Committee in October 2022 that the Commission was the first organisation to propose introducing photographic identification."
        },
        {
            "text": "During the local elections in England in May 2023 the vast majority of voters in the polling station - 99.75% - cast their vote successfully, following a number of successful pilots of this process in previous elections."
        },
        {
            "text": "Our research shows that 96% of electors already own one from the broad list of accepted photographic identifications. We have also introduced the free Voter Authority Certificate, which is accepted as a form of identification at polling stations, so that anyone who is eligible to vote can continue to do so. Electors could apply online, on paper, or in person until 5pm, six working days before polling day."
        },
        {
            "text": "Accepted forms of identification include passports, driving licences, Blue Badges, Voter Authority Certificates. Expired documents are also accepted, as long as the photo remains a good likeness to the voter. A full list can be found here."
        },
        {
            "text": "Following the elections in May 2023, officials undertook a thorough review of the list of accepted forms of identification and could not identify any additions that would succeed in significantly increasing coverage. The list must strike the right balance between security and accessibility as well as being manageable for staff in polling stations."
        },
        {
            "text": "We are continuing to work closely with local authorities and other partners to raise awareness both of the requirement to show identification in the polling station and of the types of identification which are accepted, including a widespread public information campaign led by the Electoral Commission."
        },
        {
            "text": "We have always been confident in the ability of local authorities to implement the voter identification changes, whilst continuing to deliver our elections robustly and securely."
        }
    ]
}