{
    "url": "https://charitycommission.blog.gov.uk/2024/05/01/why-become-a-charity-interim-manager/",
    "title": "Why become a charity Interim Manager?",
    "authors": [
        "Angela Ascroft"
    ],
    "categories": [
        "News"
    ],
    "pub_date": "2024-05-01T10:35:31+01:00",
    "content": [
        {
            "text": "Interim Managers can play a crucial role in turning around a charity that has encountered problems."
        },
        {
            "text": "The Charity Commission is looking for more firms to join our list of approved practitioners whose nominated individuals will be considered for future Interim Manager appointments. If you and your colleagues have the skills and experience to help a struggling charity, we want to hear from you by 31 May."
        },
        {
            "heading": 3,
            "text": "Why we need Interim Managers"
        },
        {
            "text": "When things go seriously wrong in a charity, the Commission will respond robustly so the public can continue supporting the charity sector with confidence."
        },
        {
            "text": "In serious cases of abuse and regulatory concern, we might appoint an Interim Manager to manage the property and affairs of a charity. This may be necessary in a number of scenarios, including where we have concerns about a charity’s ability to operate in accordance with legal requirements, or if there is a need to protect its property and assets."
        },
        {
            "text": "As an Interim Manager, you could play a key role in addressing problems in a charity – and in doing so, you can also help protect trust and confidence in the sector as a whole."
        },
        {
            "heading": 3,
            "text": "What is an Interim Manager?"
        },
        {
            "text": "An Interim Manager might be appointed to work alongside or to the exclusion of the existing trustees. Dependant on the scope of the appointment, they may have the same duties and responsibilities as a trustee in relation to the management and administration of a charity and be responsible for everything from securing property, managing staff and ensuring the continued delivery of charitable services."
        },
        {
            "text": "The role is not the same as being a professional adviser – it is a unique challenge that will probably feel very different from your day job. It can involve making and implementing difficult and sometimes unpopular decisions. You may find yourself at an animal sanctuary looking at financial misconduct, running an election at a membership charity, conducting a governance review, or improving safeguarding practices at a school."
        },
        {
            "text": "Interim Managers will usually have specialist experience in a relevant field such as charity law, financial management, safeguarding, housing or cyber security. We maintain a list of approved practitioners from which appointments are usually made – and we are now looking to expand this list to ensure that the right people are available to step up and serve when needed."
        },
        {
            "heading": 3,
            "text": "Why you should sign up"
        },
        {
            "text": "Serving as an Interim Manager can be a challenging position. By definition, you will be going into a charity where problems have emerged or risks have been identified that need to be put right. But it can also be hugely rewarding. You can take satisfaction in using your professional skills and experience to help a troubled charity get back on track, ensuring that it can continue to help its beneficiaries for many years to come."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "If you think you have the skills and experience to serve as an Interim Manager, we’d love to hear from your firm. We require at least two applicants per firm. Applications to join our approved list are open until 31 May."
        },
        {
            "text": "Find out more and how to apply."
        }
    ]
}