{
    "url": "https://companieshouse.blog.gov.uk/2023/02/21/companies-house-is-hiring-commercial-professionals/",
    "title": "Companies House is hiring commercial professionals",
    "authors": [
        "Anna Ellis - Senior Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2023-02-21T10:51:16+00:00",
    "content": [
        {
            "text": "Companies House is hiring commercial professionals to join us in Cardiff. You’ll help us deliver digital transformation and legislative reform. It’s an exciting time to be working in the commercial profession, and we’d love you to come and join us."
        },
        {
            "text": "The commercial profession across the Civil Service supports procurement and contract management. It also analyses markets and develops commercial strategies, which provide value for money for the taxpayer."
        },
        {
            "text": "At Companies House, our commercial function includes:"
        },
        {
            "text": "Claire Heath, Head of Commercial Delivery, and Rhys Mitchell, Head of Supplier Performance, tell us a bit more about their teams and career opportunities."
        },
        {
            "heading": 2,
            "text": "Commercial delivery"
        },
        {
            "text": "The commercial delivery team manages the first stages of the commercial life cycle from end-user requirements to market tender and contracts with our suppliers."
        },
        {
            "heading": 3,
            "text": "Claire’s experience"
        },
        {
            "text": "\"I’ve worked at Companies House as Head of Commercial Delivery for about two and a half years. I came from another government department, and I’ve held several commercial roles over my fifteen-year career. I’ve seen the profession develop significantly during this time."
        },
        {
            "text": "\"I’m passionate about building relationships, driving high performance, developing the team and continuously improving our ways of working.  I really enjoy the varied work and challenge that our transformation and legislative works bring to the commercial team. There are great opportunities to get involved in project teams and use our procurement and commercial expertise to help Companies House achieve its strategic goals."
        },
        {
            "text": "\"Work-life balance is important to me, and Companies House supports me in achieving a healthy balance so I can perform at my very best.\""
        },
        {
            "heading": 2,
            "text": "We’re hiring a commercial lead"
        },
        {
            "text": "Companies House is hiring a commercial lead. This role is an integral part of the commercial delivery team, which has overall responsibility for activity in the procurement cycle and business partnering responsibilities across Companies House. It’s a role where commercial professionals can use their expertise to deliver support and guidance to the business. It’s also a great opportunity to build networks across the organisation."
        },
        {
            "text": "Our commercial leads’ work includes:"
        },
        {
            "text": "Commercial leads also work within a project team. They influence the commercial process, ensure compliance, draft supporting commercial business cases, and conduct market analysis, engagement and other commercial activity."
        },
        {
            "heading": 2,
            "text": "Contract management"
        },
        {
            "text": "The contract management team makes up the second part of the life cycle. It manages contract implementation, in-life contract management, disputes, exit and everything else in between."
        },
        {
            "heading": 3,
            "text": "Rhys’ experience"
        },
        {
            "text": "\"I’ve worked at Companies House as Head of Supplier Delivery for just over two and half years, with the last 18 months in my current commercial role."
        },
        {
            "text": "\"I’m passionate about contract management, and how our role brings our agreements to life and makes sure we work with our supply chain for the benefit of both parties. We manage around £50m of annual spending. My team build solid relationships across our organisation as well as with suppliers, forming partnerships that deliver critical services for the UK economy."
        },
        {
            "text": "\"Our team works closely, and we’ve developed an excellent and friendly culture so everyone can flourish. We’re looking for someone who’s a team player, inclusive and enjoys driving an agenda forward.\""
        },
        {
            "heading": 2,
            "text": "We’re hiring a contract management lead"
        },
        {
            "text": "The contract management lead works with our business contract owners to manage key supplier contracts. They’ll often have a mix of contracts under their responsibility - each in different phases."
        },
        {
            "text": "The key phases we work through are:"
        },
        {
            "text": "Our contract management leads make sure suppliers meet their obligations and that the services procured go live effectively. They manage ongoing activities, working with business contract owners and suppliers to develop and improve performance and monitor risks. They play a proactive part in contract changes, renewals and transitions to new suppliers."
        },
        {
            "text": "Enjoying working together as one commercial team is important for these roles. If this sounds like you, we’d love to hear from you."
        },
        {
            "heading": 2,
            "text": "Working at Companies House"
        },
        {
            "text": "Companies House offers a flexible and welcoming culture that promotes a healthy work-life balance as well as a proactive approach to wellbeing that allows us to be our best at work. Our people-led networks provide support, a sense of community and opportunities for colleagues to flourish and bring their whole, brilliant selves to work."
        },
        {
            "text": "Our staff benefits include 30 days annual leave (based on full-time hours) plus public holidays, and a highly competitive Civil Service Pension."
        },
        {
            "text": "Find out more about working at Companies House and the benefits we offer."
        },
        {
            "text": "If you are looking for a new challenge working for a great organisation, visit Civil Service Jobs to apply for:"
        }
    ]
}