{
    "url": "https://deframedia.blog.gov.uk/2023/02/21/coverage-on-enforcement-action-surrounding-pollution-from-agriculture/",
    "title": "Coverage on enforcement action surrounding pollution from agriculture",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Pollution"
    ],
    "pub_date": "2023-02-21T16:36:06+00:00",
    "content": [
        {
            "text": "There has been coverage in The Times – as part of its Clean It Up campaign - relating to the Environment Agency and enforcement action around the Farming Rules for Water regulations. These regulations cover how manure can be spread on the land by farmers."
        },
        {
            "text": "The piece focuses on the Farming Rules for Water regulations and does not reflect the wider hard work of Environment Agency staff to tackle water pollution from farms."
        },
        {
            "text": "Agriculture is the biggest sector the Environment Agency regulates in terms of individual businesses, with around 100,000 premises covering 70% of the land in England."
        },
        {
            "text": "To do this, EA carries out farm inspections, which are advice-led, with officers taking a proportionate approach that uses advice and guidance first, reflects individual circumstances and only seeks sanction where farmers fail to take necessary action."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "At present, there have been no prosecutions or fines under the Farming Rules for Water - as in all cases, Environmental Agency advice and guidance and follow-up warning letters have resulted in appropriate action being taken, bringing farms back into compliance."
        },
        {
            "text": "If advice is not heeded the Environment Agency will not hesitate to pursue whatever sanctions are necessary – including penalties, formal cautions or prosecutions. It is important to note that pollution from agriculture may breach other legislation than the Farming Rules for Water – for instance, the Environmental Permitting Regulations."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}