{
    "url": "https://defrafarming.blog.gov.uk/2023/02/21/introducing-animal-health-and-welfare-grants/",
    "title": "Introducing Animal Health and Welfare grants",
    "authors": [
        "Fran Edmunds"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2023-02-21T12:48:50+00:00",
    "content": [
        {
            "text": "Now that the Annual Health and Welfare Review is open, I’d like to share more about the next step on the Animal Health and Welfare Pathway: Animal Health and Welfare grants.  "
        },
        {
            "text": "Farmers make decisions all the time about how to invest their money. This includes investments to improve the health and welfare of their livestock. There is rarely enough to cover everything they want to do. A challenging economic environment makes these decisions harder.  "
        },
        {
            "text": "That is why we’re offering farmers Animal Health and Welfare grants through the Farming Equipment and Technology Fund.  "
        },
        {
            "text": "If you missed the speech given by Minister Mark Spencer at the NFU Conference today, he set out our £168 million grants offer to support farmers. He also shared plans for small abattoir funding and an update on our ongoing payments. Thérèse Coffey, Secretary of State for Environment, Food and Rural Affairs will share government's wider plans tomorrow. We’ll post links to both speeches at the bottom of this post as soon as they are available."
        },
        {
            "heading": 2,
            "text": "Overview of the Animal Health and Welfare grant"
        },
        {
            "text": "These grants, of between £1000 and £25,000, will go towards the cost of items on a list which improve the health and welfare of livestock.  "
        },
        {
            "text": "We worked closely with farmers, academics and industry groups to compile the list of items. The list of items can be found in Annex 4 of the guidance. "
        },
        {
            "text": "You might apply for a grant for livestock handling equipment to reduce lameness in sheep or cattle. "
        },
        {
            "text": "To reduce disease transmission in outdoor pigs, you might use grant funding to install sealed water tanks to improve biosecurity.  "
        },
        {
            "text": "A poultry farmer could use an automated monitoring system and sensors which free up their time and allow adjustments to be made more quickly and efficiently, limiting environmental stress in poultry housing.  "
        },
        {
            "heading": 2,
            "text": "Applying for a grant   "
        },
        {
            "text": "We plan to open the application window in March.   "
        },
        {
            "text": "The first group eligible to apply will be commercial livestock farmers who keep cattle, pigs, sheep, meat chickens, or laying hens. "
        },
        {
            "text": "In time, we will expand the offer to include match funding for large infrastructure projects to achieve higher levels of animal health and welfare on farms.  "
        },
        {
            "text": "You can make your grant application part of your journey on the Animal Health and Welfare Pathway.  "
        },
        {
            "text": "Vets are an essential source of advice so we encourage you to discuss any equipment and technology grant applications with your vet. "
        },
        {
            "text": "They'll be able to help you identify the items which best tackle the specific health and welfare challenges on your farm.   "
        },
        {
            "text": "An Annual Health and Welfare Review is a great way to have this conversation, and we hope that you'll take the opportunity to have a fully funded vet visit before applying for a grant.  "
        },
        {
            "text": "For the next 3 years, funding will be available for  Annual Health and Welfare Reviews, so you can keep that conversation with your vet going. If you find your priorities change, you’ll be able to get advice on other grants.  "
        },
        {
            "text": "We recently blogged to explain that the Farming Equipment and Technology Fund is split into 2 themes: "
        },
        {
            "text": "You will be able to apply for a grant under either theme or both, for items that best suit your business. The official guidance on GOV.UK sets out: "
        },
        {
            "text": "It also includes information about the other grants available to help improve farm productivity and the management of slurry. "
        },
        {
            "text": "The window to apply for a Productivity and Slurry grant is now open."
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "heading": 3,
            "text": "Join our webinar  "
        },
        {
            "text": "On Tuesday 28 February at 2pm, we will host a webinar for you to find out more about the Farming Equipment and Technology Fund. There will also be an opportunity for you to put questions to us. Register to attend.  "
        },
        {
            "heading": 3,
            "text": "Visit the blog"
        },
        {
            "text": "We’ll publish a post listing all the grants available in 2023, so do subscribe to our Farming blog for a notification when that happens."
        },
        {
            "text": "And finally, as I mentioned, the window for applications to the Productivity and Slurry grant is open so do give that post a read."
        }
    ]
}