{
    "url": "https://movingon.blog.gov.uk/2023/02/21/operators-and-large-loader-cranes-on-lorries-know-your-responsibilities/",
    "title": "Operators and large loader cranes on lorries – know your responsibilities",
    "authors": [
        "Howard Forrester"
    ],
    "categories": [
        "Enforcement",
        "Features",
        "Guides and reports"
    ],
    "pub_date": "2023-02-21T11:26:53+00:00",
    "content": [
        {
            "text": "We are encountering an increasing number of heavy goods vehicles with large loader cranes where vehicles have often been converted to accommodate cranes of 80 tonnes lifting capacity or more.  "
        },
        {
            "text": "The additional weight caused by these conversions make the vehicles very close to their maximum carrying capacity meaning they are often unable to tow a standard semi-trailer without exceeding the permitted vehicle length.   "
        },
        {
            "text": "Operators, transport managers and drivers must take note of this when transporting a load on such a vehicle and look at the regulations. Operators need to make sure they are familiar with how they transport loads and understand whether they come under STGO (Special Type General Order) regulations or fall under Construction & Use (C&U) requirements.  "
        },
        {
            "text": "The information below should help operators better understand the circumstances around transporting cargo on vehicles with large loader cranes attached.  "
        },
        {
            "heading": 2,
            "text": "Can I operate under Special Type General Order regulations?  "
        },
        {
            "text": "Some manufacturers have indicated to operators they can run these larger loader crane units under STGO (Special Type General Order) regulations.  This is not the case. Operators need to make sure loader crane vehicles are working according to the correct regulations."
        },
        {
            "text": "We have found number of issues. These include:"
        },
        {
            "text": "Operators are liable where vehicles do not meet the requirements."
        },
        {
            "heading": 2,
            "text": "What have we found at the roadside?"
        },
        {
            "text": "We have seen increasing non-compliance partly due to a lack of understanding or incorrect information being shared."
        },
        {
            "heading": 3,
            "text": "Example 1"
        },
        {
            "text": "A vehicle combination seen at the roadside with maximum length of 17.8mts and the tractor unit 1,200kgs overweight (16.5mts is the maximum under C&U regs). In this case, the vehicle was carrying 2 x 20ft empty containers which do not constitute an abnormal load"
        },
        {
            "text": "In March 2021 this vehicle combination was checked by DVSA in Devon.  It was a tractor unit with a large loader crane fitted towing a semi-trailer.  After being measured by examiners, it was found to be a total length of 17.65mts.  The maximum permitted length for this type of vehicle is 16.5mts."
        },
        {
            "text": "Initially, the court ruled against the enforcement action taken by DVSA. However, following an appeal, the judge upheld DVSA’s view as correct. It was determined that the overall length of the vehicle should include all parts of the vehicle including the parts the crane is mounted on.  Any fittings which overhang the front or rear of the vehicle combination would not be included in the overall length. It is also worth remembering that allowable vehicle lengths and overhangs differ depending on whether the vehicle is a rigid one or if it is a cab towing a trailer."
        },
        {
            "text": "The result of this case will be used to inform future enforcement work and we will look to prosecute operators who are not keeping to the rules. This will help us support fair competition in industry and keep roads safe."
        },
        {
            "heading": 3,
            "text": "Example 2"
        },
        {
            "text": "A vehicle loaded with pontoon sections which was not an abnormal load but being transported incorrectly as STGO (Special Type General Order)."
        },
        {
            "text": "In this case, the vehicle was found to be overloaded at 29,460kgs (permitted 26,000kgs) on the tractor unit and measured at 18.mts (permitted 16.5mts). The operator claimed to have been told by the company which fitted the crane that it could be used legally and the dimensions of the crane could be subtracted.  However, a DVSA examiner explained that this was incorrect and the vehicle needs to meet C&U dimensions."
        },
        {
            "text": "The vehicle was prohibited for being overloaded. The following day the overloading issue was rectified when the operator informed Driver and Vehicle Standards Agency they had replaced the existing tractor unit with a lighter tractor unit. This enabled the driver and vehicle to continue their journey."
        },
        {
            "heading": 2,
            "text": "Overhangs and weights"
        },
        {
            "text": "The diagrams below demonstrate where to measure the front and rear of the total length of the vehicle.  You can see the difference between the part of the “apparatus” that extends beyond the front or rear of the vehicle. In this instance, the length can be discounted and the loader crane can be included in the vehicle length."
        },
        {
            "text": "To help make sure your vehicle is operating at permissible length and weight:"
        },
        {
            "text": "It is your responsibility as an operator to be aware of the rules before you put your vehicle on the road."
        },
        {
            "text": "If you have any questions, please let us know using the comments box below."
        }
    ]
}