{
    "url": "https://deframedia.blog.gov.uk/2023/02/21/our-record-on-farming-30-actions-we-have-taken-to-support-our-farmers-and-growers/",
    "title": "Our record on farming: 30 actions we have taken to support our farmers and growers",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-02-21T11:58:02+00:00",
    "content": [
        {
            "text": "We are re-investing £2.4 billion per year in the sector through new farming schemes"
        },
        {
            "text": " "
        },
        {
            "text": "We are supporting the long-term resilience and profitability of the agricultural sector:"
        },
        {
            "text": "11. Committed to at least maintain current levels of food production under the Food Strategy, which set out what we will do to create a more prosperous agri-food sector."
        },
        {
            "text": "12. Published our first Food Security Report, fulfilling the duty under the Agriculture Act 2020 to present a report on food security to Parliament once every three years."
        },
        {
            "text": "13. Paying Direct Payments in England in two instalments each year for the remainder of the agricultural transition period, to help farmers with their cashflow."
        },
        {
            "text": "14. Committed to spend around £600 million on grants and other support for farmers to invest in productivity, animal health and welfare, innovation over three years and…"
        },
        {
            "text": "15. Paid out over £30 million so far in grants for technology and equipment, having increased the original budget from £17 million and committed £90 million to our Innovation Programme."
        },
        {
            "text": "16. Provided 10,000 farmers with help and advice through the Future Farming Resilience Fund, which provides farmers with free advice to help farmers work out what to do for their business."
        },
        {
            "text": "17. Doubled the funding available for the Catchment Sensitive Farming programme over the next three years (new annual budget will be £15 million, up from £8 million in 2020-21) - covering 100% of England’s farmland, with every farmer able to access advice and support by March 2023."
        },
        {
            "text": "18. Providing seed funding to the newly created industry body for agriculture, The Institute of Agriculture and Horticulture, which will support the sector develop its skills and professional frameworks and provide labour market information."
        },
        {
            "text": "19. Looking at how we can support new entrants into the sector and those looking to grow their farming businesses by developing their entrepreneurial capabilities through a small pilot scheme being run in conjunction with Harper Adams and Landworkers’ Alliance."
        },
        {
            "text": " "
        },
        {
            "text": "And responding quickly to global challenges outside the EU:"
        },
        {
            "text": "20. Providing support for heating bills through the Energy Bills Relief Scheme."
        },
        {
            "text": "21. Removed the 25% tariff on maize imports from the USA. Maize is a key ingredient for animal feed."
        },
        {
            "text": "22. Improved the Avian Flu compensation scheme for farmers to help farmers through the worst global outbreak in many years and eased marketing rules to give certainty over business planning."
        },
        {
            "text": "23. Announced 45,000 visas for seasonal workers for the horticulture sector to ensure they have the labour they need, up 15,000 from start of 2022."
        },
        {
            "text": "24. Championed precision breeding technology through the Genetic Technology Bill, which will soon become law, to help farmers become more productive and help feed the nation."
        },
        {
            "text": "25. Cut red tape since we left the EU by making improvements to how and when we issue warning letters where financial reductions would previously have been applied."
        },
        {
            "text": "26. Committed to introducing a new statutory code of conduct for contracts in the dairy sector with legislation being introduced this year."
        },
        {
            "text": "27. Conducted a consultation exploring fairness in the UK pig sector between July and October 2022 – a Government Summary of Responses, which will outline the main findings and next steps will be published soon."
        },
        {
            "text": "28. Hosted a roundtable with egg sector representatives in December 2022 where we encouraged the supply chain to work together to address the recent problems and committed to some scoping work to understand the issues facing the sector."
        },
        {
            "text": "29. Introduced measures to help with the impact of global impacts on fertiliser supply chains: fertiliser industry roundtable, delayed changes to the use of urea fertiliser, encouraging use of organic fertiliser and new technologies, provided short term support to protect vital CO2 production, introduced funding for slurry storage and measures to improve soil health."
        },
        {
            "text": "30. Brought in eight new agri-food and drink attachés in priority markets, as part of a wider plan to boost exports, further unlock barriers to trade and open new opportunities around the world."
        },
        {
            "text": " "
        }
    ]
}