{
    "url": "https://defrafarming.blog.gov.uk/2023/02/21/productivity-and-slurry-grants-time-to-apply/",
    "title": "Productivity and Slurry grants: time to apply",
    "authors": [
        "Sarah Evered"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-02-21T12:47:03+00:00",
    "content": [
        {
            "text": "A few weeks ago, I blogged about the latest round of the Farming Equipment and Technology Fund."
        },
        {
            "text": "It was one of the things Minister Mark Spencer covered today in his NFU Conference speech, as part of our wider £168 million grants offer."
        },
        {
            "text": "In my blog post, I gave an overview of the fund. I explained that it is made up of 2 themes:  "
        },
        {
            "text": "Under each theme, and in collaboration with farmers and other experts, we’ve compiled a list of items. Grants between £1,000 and £25,000 are available to put towards the cost of items listed. "
        },
        {
            "text": "I’m pleased to say that you can now apply for grants under the Productivity and Slurry theme. "
        },
        {
            "text": "The window to apply will be open for 6 weeks, which means the deadline to apply is Tuesday 4 April. "
        },
        {
            "text": "The items in the Productivity and Slurry theme improve agricultural sustainability and horticultural and forestry productivity, helping farmers use less inputs, reduce emissions and cut waste. "
        },
        {
            "text": "You can apply for a grant if your business is in England and you are a:"
        },
        {
            "heading": 2,
            "text": "How to prepare "
        },
        {
            "text": "I’d recommend you start by looking at the lists of items under the Productivity and Slurry theme to see if there are any that interest you. "
        },
        {
            "text": "For example, if you’d like to get the most out of your slurry and reduce inputs, real time inline nutrient analysis might be for you. It records the levels of Nitrogen, Phosphate and Potassium during application so you can apply nutrients with greater accuracy. "
        },
        {
            "text": "An inter row companion drill for precision direct drilling of cover crops or companion crops could help you to reduce soil erosion and carbon loss from your soil.  "
        },
        {
            "text": "Or, if you have plans to plant trees, an automatic tree planter might be something to consider. It prepares a hole, inserts a small tree and applies water in one operation.  "
        },
        {
            "text": "If there are items that support your plans, we’ve provided a list of the steps to follow on GOV.UK. "
        },
        {
            "text": "The steps include a breakdown of the application process. Applying should take no longer than 20 minutes.  "
        },
        {
            "text": "We’ve also set out how the applications will be assessed. The grants are competitive: this means that you will not automatically get a grant. The Rural Payments Agency (RPA) will score applications.  "
        },
        {
            "text": "If the scheme is oversubscribed, we will allocate funding to those applications with the highest average score first. If your application is successful, you will receive an offer by email. "
        },
        {
            "heading": 2,
            "text": "Stay in the loop "
        },
        {
            "text": "In this post, I addressed the Productivity and Slurry theme. For more information on Animal Health and Welfare,  do take a look at the latest posts from the Animal Health and Welfare Team. "
        },
        {
            "text": "They just posted an overview of the Animal Health and Welfare grant, which follows the launch of the fully-funded Annual Health and Welfare Review. "
        },
        {
            "text": "We plan to open the Animal Health and Welfare theme up to applications next month. We'll blog about it when we do."
        },
        {
            "heading": 3,
            "text": "Join our webinar  "
        },
        {
            "text": "On Tuesday 28 February at 2pm, we will host a webinar for you to find out more about the Farming Equipment and Technology Fund. There will also be an opportunity for you to put questions to us. Register to attend.  "
        },
        {
            "heading": 3,
            "text": "Hear from the ministerial team"
        },
        {
            "text": "As I mentioned, Defra’s ministerial team covered grants, ongoing payments to support food production and the environment plus funding for small abattoirs in speeches at the NFU Conference."
        },
        {
            "text": "Links to the speeches, delivered by Minister Mark Spencer and Secretary of State for Environment, Food and Rural Affairs, Thérèse Coffey, will be added to the box at the bottom of this post when they are available."
        },
        {
            "heading": 3,
            "text": "Subscribe"
        },
        {
            "text": "We will soon publish a post setting out all the grants available in 2023, so do subscribe to the blog."
        },
        {
            "text": "Finally, the RPA handles the administrative side of the grants so it's worth keeping an eye on the Rural Payments blog. "
        }
    ]
}