{
    "url": "https://naturalengland.blog.gov.uk/2023/02/21/protecting-nature-through-our-enforcement-work-latest-data-published/",
    "title": "Protecting nature through our enforcement work – latest data published",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Biodiversity",
        "Licensing",
        "Protected sites and species"
    ],
    "pub_date": "2023-02-21T09:33:46+00:00",
    "content": [
        {
            "text": "By Stephanie Bird-Halton, National Delivery Director."
        },
        {
            "text": "At Natural England our mission is to build partnerships for nature’s recovery, which is reflected in our work with a wide range of people to rebuild sustainable ecosystems and protect and restore habitats, species, and landscapes. We know that our regulatory and enforcement work is key to ensuring that the value nature provides is prioritised and protected."
        },
        {
            "text": "Preventing harm to nature is central to Natural England’s work. We have responsibility for enforcing a number of laws that protect wildlife and the natural environment, mainly relating to planning applications and protected species. The work we do in this area, often alongside other regulators and partners, aims to ensure the value that Nature provides is recognised as a vital element of the economic and social needs of society."
        },
        {
            "text": "Our main aim is to prevent harm and remediate harm to the environment, and we work with landowners and the public to advise, educate and inform, and to reach a shared understanding of the value of protecting nature. However, we will take proportionate enforcement action where required, which could comprise civil sanctions, cautions and prosecutions."
        },
        {
            "text": "Today we have published findings and data about our enforcement action in relation to the main areas our work covers - Sites of Special Scientific Interest (SSSI), Species Licensing, Animal Poisoning (Wildlife Incident Investigation Scheme), Environmental Impact Assessment (EIA) (Agriculture) Regulations, and Injurious Weeds offences, including prosecutions, civil sanctions, and cautions. The report covers data from 2018-2022, but due to a range of factors impacting on our work and workforce during this time, we were not able to publish the data relating to our enforcement work. For the purposes of this blog, we’ll focus on the most recent year covered."
        },
        {
            "text": "Sites of Special Scientific Interest"
        },
        {
            "text": "In 2021-2022, 21 offences were recorded on SSSIs. Most incidents were minor and we resolved these using warning letters. Although the number of warning letters for SSSI offences appears to have continued to decline from previous years, since the Enforcement Team has been in place we have issued more enforcement actions that aim to address harm rather than simply provide advice."
        },
        {
            "text": "For example, in August 2021 Natural England agreed an Enforcement Undertaking (EU) with a landowner at River Mease SSSI, Derbyshire following the unconsented coppicing of waterside willow trees and mechanical removal of in-channel woody material, leading to a reduction in habitat diversity likely to impact the notified fish species including bullhead and spined loach. The Enforcement Undertaking required them to restore the riverbank by allowing the coppiced willows to regrow in addition to reinstating washed river gravels to provide spawning habitat for fish and provide material to support natural processes. Additional compensation included the provision of suitable refuges for the notified fish species to reduce the risk of predation. The use of these undertakings provides an opportunity for offenders to put right the damage they have done or to return to compliance without the need for us to take further enforcement action."
        },
        {
            "text": "Animal Poisoning"
        },
        {
            "text": "Under the Wildlife Incident Investigation Scheme (WIIS), NE investigates incidents where it is suspected that animals have died from pesticide poisoning. In 2021-22, 441 reports of animal deaths under the scheme were recorded, a decline from the previous year where peaks across total notifications and cases accepted were observed, mirroring increases highlighted by the Wildlife & Countryside link Wildlife Crime Report and the RSPB's Bird Crime Reports for the same period. This peak is likely a result of the increase of reports from members of the public, linked to changes in the use of natural environment during the global pandemic. 258 cases were rejected on the basis that pesticides were not thought to be involved, and 183 cases were accepted into the scheme."
        },
        {
            "text": "Environmental Impact Assessment (EIA) (Agriculture) Regulations"
        },
        {
            "text": "1797 queries were received by our EIA helpline, a decrease from the previous year, and we carried out fewer investigations. There were no Remediation notices or Stop Notices served, however one prosecution was taken forward with a tenant-farmer ordered to pay more than £30,000 for ploughing historically important fields linked to prehistoric and Second World War periods. Four Enforcement Undertakings were agreed."
        },
        {
            "text": "Injurious weeds"
        },
        {
            "text": "87 complaints of damage caused by injurious weeds were reported in 2021-22. 36 inspections were undertaken and 15 enforcement notices were served."
        },
        {
            "text": "Species licensing breaches"
        },
        {
            "text": "During the period covered in the report, Species licensing breaches were dealt with by use of warning letters, conditional warning letters and in one case, a formal caution used as a proportionate response to the incident. The caution involved a company in Warwickshire following their failure to correctly install and maintain amphibian exclusion fencing and a failure to deliver mitigation habitat as required by their licence in 2019/20."
        },
        {
            "text": "Enforcement Review"
        },
        {
            "text": "Following a review of our Enforcement work, we established a dedicated Enforcement team in June 2020 to investigate offences and serve enforcement actions and have introduced a programme to develop the skills and knowledge of the team."
        },
        {
            "text": "By bringing together a team of enforcement experts, we will be able to better address suspected incidents and respond to increases in reported incidents. This includes the increases in tipoffs we have had in relation to the EIA (Agriculture) Regulations and Wildlife Incident Investigation Scheme work areas over 2020 and 2021. Going forward, we will also be producing regular annual reports on action undertaken."
        },
        {
            "text": "We are committed to building on the improvements we have already made in our enforcement work. Our ongoing enforcement monitoring and evaluation will provide the intelligence that will identify priority areas for the team. This will help ensure a focus on those incidents that result in the most significant environmental damage and prevent environmental damage from occurring in the first place."
        },
        {
            "text": "Further information"
        },
        {
            "text": "Best practice guidance:"
        },
        {
            "text": "To help people comply with laws that protect wildlife and the natural environment, we have published best practice guidance. This also covers details of the processes involved in taking enforcement action :"
        },
        {
            "text": "Report a crime:"
        },
        {
            "text": "If you would like to report a suspected offence under one of the areas covered above, please click here for further information."
        }
    ]
}