{
    "url": "https://ipa.blog.gov.uk/2023/02/21/setting-up-major-projects-for-success-a-site-visit-to-sellafield/",
    "title": "Setting up major projects for success: A site visit to Sellafield",
    "authors": [
        "Vishal Shethwood"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Major Projects"
    ],
    "pub_date": "2023-02-21T14:32:22+00:00",
    "content": [
        {
            "text": "Vishal Shethwood, Project Delivery Advisor at the Infrastructure and Projects Authority (IPA), shares his thoughts on the importance of front-end loading as he visits one of Sellafield’s projects on the Government Major Projects Portfolio (GMPP). "
        },
        {
            "text": "Dealing with UK’s nuclear legacy waste"
        },
        {
            "text": "Located on the west Cumbrian coast, Sellafield is home to the highest hazard nuclear facility in Europe and has the largest inventory of untreated nuclear waste in the world. With an annual government funded budget of over £2 billion, Sellafield represents around two-thirds of the total annual spend by the Nuclear Decommissioning Authority (NDA) who are charged with cleaning up the UK’s earliest nuclear sites. The NDA’s mission is to overcome the challenges of nuclear clean-up and decommissioning, leaving sites like Sellafield ready for their next use."
        },
        {
            "text": "Two of Sellafield’s most complex and challenging projects form part of the GMPP. The site ‘Ion Exchange Effluent Plant (SIXEP) Continuity Plant (SCP)’ is one of these projects. Having received approval after its Full Business Case (FBC) just over a year ago, I had the opportunity to visit the site to see its progress and speak to the project delivery team as IPA prepared for its annual gateway assurance review of the project. "
        },
        {
            "text": "[Business cases and assurance reviews are central to how government makes spending decisions. You can find further information on the approvals process for projects and programmes here.] "
        },
        {
            "text": "Planning realistically"
        },
        {
            "text": "Sellafield is on the western side of Lake District National Park, and as is a common thought with many who visit the site, the contrast of the complex construction among the landscape of a UNESCO  (United Nations Educational, Scientific and Cultural Organization) world heritage site is striking. It puts into context the challenge for Sellafield to bring together the principles of delivering successful major projects in a remote part of the country."
        },
        {
            "text": "The existing SIXEP has been in operation since 1985. Acting as the ‘kidneys’ of the site by filtering out radioactive material, the plant plays a key part in the overall operation. While impressive to see that the plant is still operating 15 years beyond its original design life, demand for its services will remain until 2060. Therefore, new facilities are being built to enable the treatment of liquid effluent (via SIXEP) for decades to come."
        },
        {
            "text": "On site "
        },
        {
            "text": "On the drive to the SCP site, we were reminded of the scale and complexity of works. During the pre-brief, the Sellafield team started with a discussion on their approach to safety and wellbeing, which is typical for the nuclear industry and reinforced the management team’s focus on creating the right culture for hazard and risk reduction. "
        },
        {
            "text": "Sellafield has put into practice the principles of getting the basics of project setup right from the start (front-end loading). They have done this through the Programme and Project Partners (PPP) contract model. Established in 2019, the framework ensures that the project team works to an aligned plan that is developed up front, before decisions are made to commence major works. This is known as their Major Projects Baseline and it includes core information such as scope, detailed design, execution plans and mature cost estimates that sets a high level of confidence from the starting point and reduces the risk of changes later down the line."
        },
        {
            "text": "The team also explained how they are making the service building weathertight. The Senior Responsible Owner (SRO) for SCP, Jeremy Hunt, explained his view of how realistic and robust early planning has helped. “Nearly two years into delivery of the Major Project Baseline, the project met its first key milestone …this is largely down to the collaborative way we, with our PPP partners, approached robust engineering design maturity and constructability reviews, to support detailed schedule development and cost estimation. The team also incorporated learning from other projects undertaken at Sellafield and benchmarked against national and international infrastructure programmes, to ensure we had a good level of confidence to support the FBC.”"
        },
        {
            "text": "In just under 24 months the works were above ground, the concrete and steel structures were progressing well and the team were on track to transition into starting the installation of mechanical and electrical equipment."
        },
        {
            "text": "Valuable lessons for infrastructure delivery"
        },
        {
            "text": "Though there is no blueprint for the work to be done at Sellafield, the team are confident in being able to implement the principles of front-end loading. Through the PPP, Sellafield has acted to embed realistic planning into the delivery, a step change compared to the way it has historically delivered major projects. We will be working closely with the team to see how their delivery model will continually improve and lessons that can help new nuclear infrastructure projects across the industry."
        },
        {
            "text": "Sitting at the heart of government, reporting to the Cabinet Office and HM Treasury, the IPA provides expert project delivery advice, support and assurance to ensure projects are delivered efficiently and effectively. Since the publication of the ‘Principles of Project Success’, the IPA has worked to embed the principles of project success into all its engagement with current and future GMPP projects."
        }
    ]
}