{
    "url": "https://insolvencyservice.blog.gov.uk/2023/02/21/what-you-need-to-know-about-individual-voluntary-arrangements-ivas/",
    "title": "What you need to know about Individual Voluntary Arrangements (IVAs)",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Debt management",
        "Debt solutions",
        "Individual Voluntary Arrangement",
        "Personal finance"
    ],
    "pub_date": "2023-02-21T16:39:43+00:00",
    "content": [
        {
            "text": "It is important to know that if you are experiencing problem debt, the first step is to find out what solution is right for you, and that the government provides free debt advice to support you."
        },
        {
            "text": "One solution to dealing with problem debts is an Individual Voluntary Arrangement (IVA)."
        },
        {
            "text": "Here we provide all you need to know about IVAs, who can get them, and how to find out if they’re right for you."
        },
        {
            "heading": 3,
            "text": "What is an IVA?"
        },
        {
            "text": "An Individual Voluntary Arrangement (IVA) is a solution to help when you’re insolvent – that is, unable to pay your debts."
        },
        {
            "text": "An IVA is a legally binding agreement with your creditors – the people or organisations to whom you owe money – to pay all or part of your debts."
        },
        {
            "text": "An IVA usually lasts for 5 years, and during this time you will pay a monthly contribution towards your debt."
        },
        {
            "heading": 3,
            "text": "Who can get an IVA?"
        },
        {
            "text": "IVAs are available for people living in England and Wales. If you live in Scotland, you could get a Protected Trust Deed instead. For more information, please visit: Trust deed explained | Accountant in Bankruptcy (aib.gov.uk)."
        },
        {
            "text": "Anyone over the age of 18-years-old who is in debt and has a monthly disposable income could be able to get an IVA. Disposable income is money left over after your essential monthly expenditure such as mortgage/rent, council tax and utilities has been paid."
        },
        {
            "text": "You must be able to show your creditors that you don’t have enough money to afford your current monthly payments, and that you owe more than the value of your assets – the things you own."
        },
        {
            "text": "If you are considering an IVA, it is important to get debt advice from an FCA authorised debt adviser through the Financial Services Register before deciding which option is right for you."
        },
        {
            "heading": 3,
            "text": "How do I get an IVA?"
        },
        {
            "text": "You need the help of an Insolvency Practitioner to get an IVA."
        },
        {
            "text": "The first step is to talk to a trusted debt adviser to find out if you’re suitable for an IVA. Find out where to contact a reputable debt adviser here: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "text": "If your debt adviser thinks an IVA is suitable for you, they’ll offer you a guide to applying for an IVA. You can then choose an Insolvency Practitioner to draft a proposal to your creditors for their agreement."
        },
        {
            "heading": 3,
            "text": "What’s in the proposal?"
        },
        {
            "text": "Developing the proposal will involve you working with an Insolvency Practitioner – someone who has passed insolvency exams and holds a licence to act on your behalf when you’re insolvent."
        },
        {
            "text": "Your proposal will include working out an affordable monthly payment, and information about you and your finances to your creditors outlining how you could repay a portion of our debts."
        },
        {
            "text": "Your creditors will vote on the proposal and if at least 75% (by value) of them agree to it, your IVA can start."
        },
        {
            "text": "There is a chance that creditors may not agree to your proposal, and you may still have to repay all of your debts. However, if you successfully complete your IVA arrangement, a portion of your debt may be written off."
        },
        {
            "heading": 3,
            "text": "Do I have to pay for an IVA?"
        },
        {
            "text": "Yes. Your Insolvency Practitioner will charge a fee for the work they do on your IVA, but this will be included in your monthly payments. So, you usually only need to pay one set amount each month."
        },
        {
            "text": "The average cost of an IVA is around £3650. The fee includes payment for the Insolvency Practitioner’s work on the proposal to creditors, the meeting to agree the proposal, and for supervising the IVA for five years. The cost could be higher if your finances are more complicated, or you run a business."
        },
        {
            "text": "You should never have to pay extra money than that which has been agreed with your Insolvency Practitioner and included in your proposal."
        },
        {
            "heading": 3,
            "text": "Will an IVA affect my credit rating?"
        },
        {
            "text": "Yes, it will affect your credit rating while the IVA is in force."
        },
        {
            "text": "If you are in England or Wales, you will be added to the Individual Insolvency Register, which is a list of all those who are using an insolvency solution. It can be searched by anyone, including employers, landlords and credit reference providers."
        },
        {
            "text": "Once your IVA has ended, information about your IVA will stay on your credit file for up to another 6 years."
        },
        {
            "heading": 3,
            "text": "What happens when I’m in an IVA?"
        },
        {
            "text": "In an IVA, you will agree with your creditors to make regular payments to the Insolvency Practitioner – including the practitioner’s fees. The practitioner will then make the payment to your creditors."
        },
        {
            "text": "It is important that you read carefully through your proposal and all other documents to understand fully what you must and must not do during your IVA, so that it can complete successfully. You can ask your debt adviser or your Insolvency Practitioner if you are unsure."
        },
        {
            "text": "You must keep to the terms of your IVA agreement. If you don’t, your IVA could be terminated."
        },
        {
            "text": "If your IVA is terminated, you still need to pay your outstanding debts and any interest that has built up while you have been in your IVA."
        },
        {
            "text": "Once a year your Insolvency Practitioner will review your IVA, by looking at your income and outgoings, to see whether any changes need to be made to your arrangement."
        },
        {
            "text": "You will have to pay more money into your IVA if you receive additional income, including insurance pay-outs and inheritance, or if you get a bonus, overtime, or a pay rise."
        },
        {
            "text": "Your Insolvency Practitioner is there to support you to complete your IVA, so if you can’t pay, or need to discuss a change in circumstances, you must contact your Insolvency Practitioner immediately for help. You can also ask a reputable debt adviser for guidance if you are struggling, and you don’t need to pay for this service."
        },
        {
            "heading": 3,
            "text": "Are there other options to help me clear my debts?"
        },
        {
            "text": "Yes, there are other options which might suit you better. Some are formal insolvency procedures, meaning they are legally binding processes. Others, such as consolidation loans and Debt Management Plans (DMP) are not formal procedures and are instead informal arrangements with those to whom you owe money."
        },
        {
            "text": "You should speak to an FCA-authorised debt adviser before deciding which might be the right one for you. The Financial Conduct Authority (FCA) ensures that financial firms work well and provide a fair and honest deal to their customers."
        },
        {
            "text": "You can find options for paying off your debts on our website: Options for paying off your debts: Overview - GOV.UK (www.gov.uk)."
        },
        {
            "text": "If you’re still unsure, you can contact the National Debtline, or visit MoneyHelper to find out about the government’s Breathing Space scheme, which gives you time out from paying debts in order to work out an effective and long-term solution."
        },
        {
            "heading": 3,
            "text": "What if I have a problem with my IVA?"
        },
        {
            "text": "If you have any issues with the way you think your IVA is working then in the first instance you should speak to your IP to try and sort it out. If you have any complaints about the way your IVA or your debt advice had been handled, that you are not able to resolve by talking to your IP you can find out how to complain here:"
        },
        {
            "text": "The Complaints Gateway for complaints about Insolvency Practitioners: How to complain about an insolvency practitioner - GOV.UK (www.gov.uk)."
        },
        {
            "text": "You can also complain about regulated debt advisers here: How to complain | FCA."
        }
    ]
}