{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/08/04/call-for-views-on-trust-services-we-want-to-hear-from-you/",
    "title": "Call for views on trust services: we want to hear from you ",
    "authors": [
        "Inika Charles"
    ],
    "categories": [
        "Digital identity",
        "Trust services"
    ],
    "pub_date": "2025-08-04T16:44:08+01:00",
    "content": [
        {
            "text": "Today we’ve published a call for views on the adoption of trust services. You can respond to the call for views on GOV.UK until the 20th of September 2025.  "
        },
        {
            "heading": 2,
            "text": "What are trust services? "
        },
        {
            "text": "Trust services are digital tools, such as e-signatures, that make online transactions more secure and reliable. We wrote previously on this blog about the different types of trust services, and on the changes that the Data (Use and Access) Act is making to the UK’s trust services regulatory framework.  "
        },
        {
            "text": "A sectoral analysis which DSIT conducted in 2024 of identified digital identity service providers in the UK found that 34% offer trust services (including electronic seals, signatures, and certificates), and that those providers which offer trust services generated an estimated revenue of £136 million in 2023-2024.  "
        },
        {
            "heading": 2,
            "text": "Why we’ve published a call for views "
        },
        {
            "text": "The evidence we hold about the trust services market in the UK is limited. This call for views will help us understand what interventions might be useful to support this market to grow further as part of the UK’s digital economy.  "
        },
        {
            "text": "The call for views seeks responses from organisations who offer trust services in the UK, and from those that use these products. If the responses suggest government action is needed, we will consult again and seek to gather information more widely, including from individuals. "
        },
        {
            "heading": 2,
            "text": "We look forward to hearing from you! "
        }
    ]
}