{
    "url": "https://ukhodigital.blog.gov.uk/2025/08/04/furthering-collaboration-on-uk-sub-surface-infrastructure-data/",
    "title": "Furthering collaboration on UK subsea infrastructure data",
    "authors": [
        "Rory Shepherdson"
    ],
    "categories": [
        "Seabed mapping",
        "Subsea National Infrastructure"
    ],
    "pub_date": "2025-08-04T17:17:46+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Calling UK government, Crown Dependency, Overseas Territory and private sector colleague participation"
        },
        {
            "text": "A clear understanding of our Subsea National Infrastructure (SNI) is crucial to the UK, Crown Dependencies and Overseas Territories. Location-based data depicting SNI is important to a range of stakeholders responsible for managing, optimising and protecting this infrastructure."
        },
        {
            "text": "A new data discovery project is underway to understand more about SNI data, its management—and which organisations are involved—and to identify areas for potential optimisation. Commissioned by the COAST (Coast and Oceans Applied Systems Thinking) group of Chief Scientific Advisors, this study aims to inform government policy making and support the planning, protection and management of subsea infrastructure in the UK, Crown Dependencies and Overseas Territories."
        },
        {
            "text": "To inform this study, we are inviting stakeholders who use or manage subsea data to share their insights by completing a short questionnaire."
        },
        {
            "heading": 2,
            "text": "About the project"
        },
        {
            "text": "There are many types of SNI, and COAST has recognised the value of having a 'single best view'. Therefore, COAST seeks to understand how SNI data is collected, collated, stored and shared across government organisations across the UK, Crown Dependencies and Overseas Territories. Recognising the private sector's central role as SNI data owners, users and experts, we are also keen to understand and map out government-to-private sector relationships and benefit from their expert insights."
        },
        {
            "text": "This project will create a high-level understanding of the current approach to data management and signpost areas for further investigation."
        },
        {
            "text": "Representatives from The Crown Estate (TCE), the Department for Science, Innovation and Technology (DSIT) and the UK Hydrographic Office (UKHO) are co-managing this project. A cross-government project steering group has been established to ensure they address all relevant issues."
        },
        {
            "heading": 2,
            "text": "Key areas to explore  "
        },
        {
            "text": "One of the fundamental questions the project seeks to explore is what is meant by 'SNI' and which types of data this could describe."
        },
        {
            "text": "To address this, we want to gather the views of public and private sector stakeholders to consider a wide range of SNI features covering critical and non-critical assets. This could include data types that immediately come to mind, such as cables, pipelines and offshore energy, but also features that may not have been previously considered, such as components of maritime navigation, scientific monitoring and natural assets, along with new and emerging uses such as subsea data centres and carbon storage."
        },
        {
            "text": "If you use or manage SNI data, your input will be vital in shaping the future management of the UK's subsea infrastructure data."
        },
        {
            "heading": 2,
            "text": "Contribute to the research "
        },
        {
            "text": "We invite all UK Public Sector, Crown Dependency, Overseas Territory and Private Sector stakeholders involved in subsea infrastructure to share their insights by completing our questionnaire. We also encourage you to share this with your colleagues and peers using and managing SNI data."
        },
        {
            "text": "Please note that at no point will this discovery project ask for datasets or specific locations of assets."
        },
        {
            "text": "The survey is open until 15 September 2025."
        },
        {
            "text": "Complete the survey"
        }
    ]
}