{
    "url": "https://defradigital.blog.gov.uk/2025/08/04/reflections-on-civil-service-live-2025/",
    "title": "Reflections on Civil Service Live 2025",
    "authors": [
        "Suzy Robinson"
    ],
    "categories": [
        "Civil Service Live",
        "Defra digital",
        "Learning and Development"
    ],
    "pub_date": "2025-08-04T15:08:41+01:00",
    "content": [
        {
            "text": "Suzy Robinson, Head of Delivery Management (interim), shares her experiences at Civil Service Live 2025 and what she's learned from attending Civil Service Live over the past few years."
        },
        {
            "text": "Civil Service Live (CSL) is a great way to learn more about how government works, what other departments are focussing on, and network with colleagues across the board. I’d recommend it to anyone who’s joined the Civil Service recently, and anyone who wants to raise their head from their day-to-day work to collaborate with change makers across government."
        },
        {
            "heading": 2,
            "text": "Session highlights from previous years"
        },
        {
            "text": "Over the last few years, I’ve attended CSL in London, Newport, Cardiff and Manchester – including in 2023 when I attended as a presenter – co-facilitating a design sprint workshop with Department for Education."
        },
        {
            "text": "At previous events I’ve focused on learning about the fallout from the conflict in Ukraine. I’ve attended everything from Dame Melinda Simmons sharing her experience of being the ambassador to Kyiv during Russia’s invasion, to the Ministry of Housing, Communities and Local Government talk about Homes for Ukraine, to the Department for Digital, Culture, Media and Sport teams who made sure Eurovision 2023 would honour the winners of the 2022 contest and still go ahead."
        },
        {
            "text": "Other popular talks at Civil Service Live in the last few years included the 2022 Commonwealth Games, the Queen’s funeral and lying-in-state queue tracker, and the King’s Coronation. It’s fascinating to see how these events come together to incorporate thousands of years of history."
        },
        {
            "heading": 2,
            "text": "A focus on artificial intelligence "
        },
        {
            "text": "Artificial intelligence (AI) was the hottest topic this year. I attended ‘The Ultimate Hack: get ready for a new era of digital government’ and the AI workshop from the Government Legal Service, where colleagues discussed how their departments are implementing AI."
        },
        {
            "text": "I shared how Defra group is using AI to identify lesions in cattle hooves, and flora and fauna in the seabed. HMRC has implemented chat bots because the helplines are so busy. Some GPs are using ambient voice transcription during patient appointments. A platform called Minute is being trialled in local authorities to create minutes and transcripts. Another platform called Parlex is being used to predict parliamentary responses to a given policy. "
        },
        {
            "text": "A common theme throughout these digital conversations was 'digital first but not digital only' and 'humans in the loop'. We need to learn how to work with emerging technology but never forget that our users are real people."
        },
        {
            "heading": 2,
            "text": "Leadership to enhance security"
        },
        {
            "text": "My biggest takeaway from this year's event was the importance of security. I know what the protocols are, but it’s hard to feel passionate about adhering to them. "
        },
        {
            "text": "Attending this year’s packed talk from Cabinet Office's Government Security Group showed me how hard our colleagues are working to keep us safe—not only the more than half a million Civil Servants in the UK, but our friends and families too. I care and understand much more than I used to, and I’m going to put my learnings into place."
        },
        {
            "text": "So much of security is about people—human error, trust between colleagues, dissatisfaction at work. As a line manager, I can take steps to cultivate psychological safety so my direct reports can come to me if they’ve made a mistake, or spot a security breach, and know that I will take the right actions. I can role model and reward good security behaviours. I can intervene to make things better if colleagues aren’t happy in their roles."
        },
        {
            "text": "It can be hard to make time for Civil Service Live, but we all deserve a day away from our desks, soaking up some of the best and brightest ideas in our industry."
        }
    ]
}