{
    "url": "https://movingon.blog.gov.uk/2025/08/04/what-our-new-light-goods-vehicle-strategy-means-for-you/",
    "title": "What our new Light Goods Vehicle strategy means for you",
    "authors": [
        "Mark Horton"
    ],
    "categories": [
        "Enforcement",
        "Features"
    ],
    "pub_date": "2025-08-04T14:30:59+01:00",
    "content": [
        {
            "text": "Over the next year, we will be using a new approach to improve compliance around light goods vehicles (LGVs) and their trailers. This means we’ll heavily concentrate on particular higher-risk sectors – working with them and focusing our roadside enforcement work. We want to explain why this is so important and highlight the tragic consequences of when things go wrong.  "
        },
        {
            "text": "We know that many in the industry are diligent and prioritise safety. But unfortunately, there are still some operators of LGVs who don’t have robust systems to ensure safety, flout the rules and put lives at risk. It’s our role to make sure we stop this from happening, keeping everyone on Britain’s roads safer."
        },
        {
            "heading": 2,
            "text": "Why we’re targeting LGVs "
        },
        {
            "text": "DVSA checks approximately 20,000 LGVs every year. Over 50% of these encounters result in enforcement action for: "
        },
        {
            "text": "The annual MOT test failure rate for LGVs is around 4 times higher than HGVs, and it’s much higher than the failure rate for cars. This might not come as a surprise – LGV operators may not adopt the same safety systems that a heavy vehicle Operator Licence holder is required to. And of course, many LGVs have quite a ‘hard’ existence – high mileage with heavy loads.   "
        },
        {
            "text": "More significantly, road users are more likely to be seriously injured or killed by an LGV than an HGV. In 2023-24, there were 3,000 incidents reported involving LGVs which resulted in either a fatality or a serious injury - compared to less than 1,000 with an HGV. "
        },
        {
            "text": "This data shows why LGVs need targeting. "
        },
        {
            "heading": 2,
            "text": "What the new enforcement approach will look like "
        },
        {
            "text": "While many of you take great care to manage light goods vehicle operations in the same professional way as a HGV or PSV operator – some do not. We want to improve that situation, as it puts people in danger and is not fair on those that do things right. "
        },
        {
            "text": "As with any strategy, we start with engaging with the industries – such as trade associations – to make sure the rules and guidance are clear. However, enforcement must sit alongside this and we take that role seriously - taking robust action where appropriate, including issuing fines, sanctions and further penalties.  "
        },
        {
            "text": "With roughly ten times the number of LGVs compared to HGVs on the road, we need to be very focused in what we do to have a chance of influencing behaviours. We also recognise that there’s a wide range of users for LGVs across many different industries. "
        },
        {
            "text": "When developing our strategy, we evaluate where our enforcement efforts will be most effective, and target certain groups or geographical areas where our work is most needed. "
        },
        {
            "text": "For example, we've noticed an increase in the number of prohibitions issued to vehicles used in construction, and vehicles used for transporting cars. Therefore, these vehicles will be a high priority for us in the future."
        },
        {
            "text": "Of course, we will continue enforcement for other sectors as well – so this isn’t an open door for ‘anything goes’. Our expectations are still the same, and wouldn’t it be great if we had no reason for this extra targeting of your sector? "
        },
        {
            "heading": 2,
            "text": "Working with us "
        },
        {
            "text": "As we work with these specialist sectors, it’s important that we work with the trade bodies representing them. Many of these are organisations we already work with – but there may be others we haven’t yet engaged with. So please do reach out to us if you think your organisation can help. "
        },
        {
            "text": "We’d love to hear from light goods operators and drivers who have best practices to share. We want to see improvements across the industry so the more this can be about industry working with us to raise standards, the better. "
        },
        {
            "heading": 2,
            "text": "A tragic reminder of the consequences "
        },
        {
            "text": "Sometimes choosing to be non-complaint can - and often does - has fatal consequences.  "
        },
        {
            "text": "One heart-breaking example is the death of 11-year-old Harry Dennis, who was tragically killed after a scaffolding board hit the vehicle he was travelling in.  "
        },
        {
            "text": "The board had come loose from a vehicle transporting scaffolding. The driver, Russell Le Beau, had not adequately secured the load and was oblivious to it swinging out into the path of Harry’s vehicle. In court, he blamed this on a lack of training. However, the judge concluded that he’d likely driven similar vehicles for the past 15 years.  "
        },
        {
            "text": "Russel Le Beau was sentenced to 4 years in prison.  "
        },
        {
            "text": "Harry's mother has since inspired a campaign to improve road safety, arguing for more regulations to govern the use of light goods vehicles. "
        },
        {
            "heading": 2,
            "text": "How you can keep your vehicle compliant"
        },
        {
            "text": "Our guidance can help you understand and comply with the rules and regulations around driver conduct and licensing in the haulage industry. "
        },
        {
            "text": "As a driver, you should follow employer and government guidance to ensure the safety of yourself, your passengers, other road users and pedestrians, ultimately making Britain’s roads safer for everyone."
        },
        {
            "text": "Goods vehicle operator licensing guide - GOV.UK"
        }
    ]
}