{
    "url": "https://environmentagency.blog.gov.uk/2024/11/02/a-day-in-the-life-plant-surveying-on-the-river-mimram-with-emma-a-senior-environmental-monitoring-officer/",
    "title": "A day in the life – plant surveying on the River Mimram with Emma, a Senior Environmental Monitoring Officer ",
    "authors": [
        "Elodie Blanchfield"
    ],
    "categories": [
        "Environment Agency",
        "Nature",
        "Rivers",
        "Water"
    ],
    "pub_date": "2024-11-02T12:45:37+00:00",
    "content": [
        {
            "text": "Every June to September, Environment Agency monitoring officers conduct surveys of aquatic plant life (known as macrophytes) to determine the health of our riverine ecosystems. This year, I was lucky enough to spend the day on the River Mimram with Emma, one of our Senior Environmental Monitoring Officers, to complete a macrophyte survey.  "
        },
        {
            "text": "It’s hard when walking along the Mimram in Welwyn, not to stop and take in the landscape. Buzzing with Damselflies, ripples of fish breaking the water’s surface, and a family of swans drifting downstream, it all feels quite picturesque.  We pulled up at a nearby parking spot, donned waders and life jackets, grabbed our clipboards and weather writers, and walked down to the river.   "
        },
        {
            "text": "Beyond the obvious beauty of this section of the Mimram, something you might not notice is that this river is one of the rarest freshwater habitats on earth. The River Mimram is a chalk stream. Chalk streams are an exceptional type of spring-fed river, flowing from underground chalk aquifers, which store large amounts of water in porous rock and release it slowly over time. England is home to approximately 85% of chalk streams across the world. They are home to rare and endangered species and are hotspots for invertebrates that thrive in chalk stream conditions. "
        },
        {
            "text": "It is a true privilege to live and work in such proximity to so many of these rivers and it is all our responsibility to protect and restore them for future generations.  "
        },
        {
            "text": "Macrophyte surveys look at the aquatic plants growing within the channel. Changes in the community composition can be used as an indicator of eutrophication (the over enrichment of water with nutrients). In a macrophyte survey, each aquatic plant species scores differently and the score is relative to its association with nutrients. These scores are used to calculate the River Macrophyte Nutrient Index. This index generates a score for the stretch of river being surveyed, and today it’s Emma’s job to survey a 100m section of channel in the River Mimram, identifying and recording plants as she goes. "
        },
        {
            "text": "“Chalk streams are naturally diverse in flora,” Emma explains to me as she stands in the channel and picks up a strand of stream water-crowfoot (Ranunculus penicillatus subsp. pseudofluitans) from the water. “The difficulty is that chalk streams are diverse and meant to have lots of plants in them, but there’s not meant to be too much of any one species of plant. So, it’s a delicate balance.” Aquatic plants are a fundamental component in rivers. They provide important habitat for fish and invertebrates, they can help to regulate water quality through the uptake of nutrients and production of oxygen, and their physical structure acts as a filter to settle sediment and create flow diversity. "
        },
        {
            "text": "Monitoring levels of eutrophication is the main reason why we complete macrophyte surveys across the main rivers of England, but the data can be used for lots of other purposes. For example, macrophyte data can indicate where flow pressure may be an issue as well as highlight stretches of river where restoration projects may be of benefit and monitoring the success of these restoration projects. "
        },
        {
            "text": "In the Hertfordshire and North London Area alone, the Analysis and Reporting Team run a huge plant programme, completing around 120 different surveys between the start of June and end of September. On average over this period, Emma and the team will be out on site 2/3 days a week, completing up to 3 surveys a day.  "
        },
        {
            "text": "The knowledge required to complete this kind of surveying is specialist to say the least. Emma explains: “In your training you’re taught about 200 different plant species and then you sit a test, made up of a theory section where you are asked to identify 100 species using photos, key identification features and habitat requirements, and a practical section where you’re asked to identify 30-40 different specimens. Then you come out and learn the surveying methodology, so it’s quite a lot of work!”  "
        },
        {
            "text": "Unfortunately, the current picture of chalk streams isn’t as wonderful as I first painted. Our chalk streams face many challenges including: over abstraction of the water that sustains their flows, poor water quality due to point source and diffuse pollution, and the historic reshaping of their courses through deforestation, milling, canalisation, and dredging. The data Emma and the team continually collect over the year is essential to advancing our understanding of chalk streams and how they’re responding and adapting to the pressures. "
        },
        {
            "text": "Together with our partners that form the Chalk Stream Restoration Group, we have a comprehensive and coherent plan for chalk stream recovery. Improving their resilience to climate change and other pressures and getting the conditions right for nature recovery. The future of chalk streams is dependent on action by everybody: government, regulators, water companies, farmers and landowners. The road to restoration is a complex and extensive one, we’re doing a lot so far but there’s lots more to do. "
        },
        {
            "text": "The more time we spend in nature, the more we come to notice it’s incredible value. Plant identification specialist or not, I’d encourage everyone, if you’re able, to get out and experience these globally rare habitats.  "
        },
        {
            "text": "Subscribe to get updates from the Environment Agency delivered to your inbox, or follow us on X. "
        }
    ]
}