{
    "url": "https://insolvencyservice.blog.gov.uk/2021/12/22/behind-the-scenes-at-the-forward-thinking-conference/",
    "title": "Behind the scenes at the Forward Thinking conference",
    "authors": [
        "Sarah L"
    ],
    "categories": [
        "Insolvency",
        "Insolvency profession",
        "Policy"
    ],
    "pub_date": "2021-12-22T08:57:21+00:00",
    "content": [
        {
            "text": "Back in September, I learned that I was joining the Insolvency Service’s Policy team. Almost immediately I volunteered to help the Forward Thinking: Research & Technical Conference on Friday, 19 November."
        },
        {
            "text": "I was filled with a mixture of excitement and anxiety, as I had not been in such a public arena for over 18 months due to the pandemic. On top of that, I was going to be responsible for organising future conferences."
        },
        {
            "heading": 2,
            "text": "Excellence and innovation"
        },
        {
            "text": "Little did I know, there was already lots of excitement and anticipation behind the scenes because this was the Insolvency Service’s first academic conference since 2012. The conference was a joint venture between our Policy and Technical teams."
        },
        {
            "text": "A lot had happened in those 9 years; the London Olympics, the UK left the European Union, the Insolvency Rules 2016, and of course the Coronavirus, which in turn brought about the Corporate Insolvency and Governance Act 2020."
        },
        {
            "text": "The conference would also bring us together with esteemed minds from the academic and legal world, emphasising the UK’s reputation as a centre of excellence and innovation for insolvency."
        },
        {
            "text": "Everyone involved had already played a large role in shaping the insolvency landscape over the last 9 years, but instead of reflecting on the past, this was a chance for them to look forwards. After all, the conference theme was ‘Insolvency strategies for the post-pandemic economy’."
        },
        {
            "text": "And what better place to hold a ‘Forward Thinking’ conference than Aston University. I’d passed the campus thousands of times, but never been inside, even though the secret garden of academia is just a few minutes’ walk from our Birmingham office. The facilities were spacious, modern, and allowed us to stream the event online simultaneously. We only saw the proverbial tip of the iceberg during our little time there, but it was clear why Aston was The Guardian’s University of the Year for 2020."
        },
        {
            "heading": 2,
            "text": "The big day arrives"
        },
        {
            "text": "Long before I’d joined the team, there had already been an academic committee who reviewed and chose the papers to be presented on the day. The schedule, with biographies of our guest speakers, had been issued to all delegates. Each speaker was an expert in their respected fields, with a broad range of knowledge in the UK insolvency regime, as well as further afield including Canada, Cyprus, and Nigeria."
        },
        {
            "text": "On the day, each session had a chair to keep proceedings flowing, and fielding questions from audience members in the room and online. The papers presented were a mixture of technical or research, with some sessions hosting a panel of experts combining similar themes such as pre-pack administrations. All the talks were lively and engaging, with good use of slides and positive participation from audience."
        },
        {
            "text": "Meanwhile, colleagues moderated the questions being asked online.  Our social media channels highlighted events as they happened.  That in turn generated more online delegates throughout the day."
        },
        {
            "heading": 2,
            "text": "Publication online"
        },
        {
            "text": "At the conference, delegates had a variety of sessions to choose from. The over-lapping schedule meant it was impossible to attend every session. Thankfully, the team who broadcast the event online have recorded the livestreams, and we’re planning on publishing those in due course. We’ll also looking to publish online the papers when the presenters have finalised their work. We expect to publish those in Spring 2022."
        },
        {
            "text": "Personally, I missed many of the talks because it was a day of running around behind the scenes. So I’m looking forward to watching the combined panel with Dr Riz Mokal, Dr Alfonso Nocilla and Dr Bolanle Adebola, and the talk from Dr Stephen Baister without any interruptions."
        },
        {
            "heading": 2,
            "text": "Positive feedback"
        },
        {
            "text": "Some time has passed since the conference, and everyone has had time to reflect on the day. We had nearly 400 participants online, who asked nearly 100 questions. We’ve already had some very kind and excellent feedback, which is extremely encouraging."
        },
        {
            "text": "A lot of the feedback from online delegates told us how well the livestreams worked and that some of them would like to attend in person next year. I hope they can make it, and I look forward to meeting everyone."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "In the meantime, I’m already looking at next year’s conference.  There’s lots to do! Including some early thinking about the content and where the conference will be held."
        },
        {
            "text": "My day was long and exhausting, but a lot of fun.  Now I feel the pressure for next year to make it as good as this year’s!"
        },
        {
            "text": "If you were at the conference, either in person or online, please feel free to send me your feedback by writing to conference@insolvency.gov.uk."
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}