{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/12/22/g7-principal-chemicals-advisor-the-office-of-product-safety-and-standards/",
    "title": "G7 Principal Chemicals Advisor- The Office of Product Safety and Standards",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-12-22T12:54:25+00:00",
    "content": [
        {
            "text": "G7 Principal Chemicals Advisor- The Office of Product Safety and Standards"
        },
        {
            "text": "The Office of Product Safety and Standards is recruiting for a Principal Chemicals Advisor into the Science Team.  The Science Team provides access to robust and relevant scientific advice and novel research for the development of policy, and the delivery and enforcement of product safety regulations across the OPSS remit, including toys, cosmetics and new responsibilities in construction products. We work closely with other evidence teams including those in engineering, research, analysis and testing. It is a multidisciplinary team including scientists covering specialisms including analytical chemistry, materials science and toxicology. The team is also responsible for chemical risk assessment advice and leads the Office’s access to independent scientific experts in the space of chemicals and materials."
        },
        {
            "text": "We require a chemical science specialist to become our Principal Chemicals Advisor in this area. You will provide oversight, knowledge and direction on the identification, testing and management of chemicals in consumer products such as cosmetics, toys and textiles. You will lead a team of science specialists that will support you in the delivery of research, testing and evidence-based development of options for the management of chemicals content in consumer products. You and your team will work closely with others across OPSS that develop policy and inform and enforce regulations. Working together you will ensure that the advice and evidence you develop supports the delivery of correspondence and external communications, working with other government agencies and departments as the need arises."
        },
        {
            "text": "Further information can be found on our Careers website https://opss-careers.co.uk/ or by contacting the Organisational Growth team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": "Vacancy reference: 173931, London, Teddington or Birmingham; closing date: 11:55 pm on Sunday 16th January 2022."
        }
    ]
}