{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/12/22/g7-technical-policy-lead-the-office-of-product-safety-and-standards/",
    "title": "G7 Technical Policy Lead- The Office of Product Safety and Standards",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-12-22T12:49:01+00:00",
    "content": [
        {
            "text": "G7 Technical Policy Lead- The Office of Product Safety and Standards"
        },
        {
            "text": "The Office of Product Safety and Standards is recruiting for a Technical Policy Lead into the Research, Evidence and Dissemination (RED) team.  The RED team is responsible for the Office’s Strategic Research Programme and Research Hub, developing new and novel research, and ways of delivering research, to drive forward improvements in consumer product safety through changes in policy and delivering regulation, and, has oversight of how the OPSS designates standards for GB."
        },
        {
            "text": "This is an exciting opportunity to apply for a new role in the RED team that will lead on further developing our growing and cross-disciplinary scientific and technical research function. This includes the development, coordination and maintenance of structures and capabilities that support the development of a robust, fit for purpose and value for money evidence base, as well as, ensuring that the operational and delivery needs of colleagues are met by carrying out high quality research, and providing evidence on which to base decisions."
        },
        {
            "text": "Your work will support the creation and delivery of repatriated UK regulatory functions that OPSS is responsible for, including designating standards and appointing Approved Bodies. Designated standards are lists of standards that businesses can use to show their products, services or processes align with essential requirements of legislation. You will work with technical colleagues, and policy leads across OPSS to develop processes and monitor progress as part of the government’s process to decide whether a standard is appropriate for designation. This is an exciting time to join the team and have your chance help us build for the future!"
        },
        {
            "text": "Further information can be found on our Careers website https://opss-careers.co.uk/ or by contacting the Organisational Growth team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": "Vacancy reference: 173648, London, Teddington or Birmingham; closing date:  11:55 pm on Sunday 09th January 2022."
        }
    ]
}