{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/12/22/seo-senior-research-strategy-adviser-the-office-of-product-safety-and-standards/",
    "title": "SEO Senior Research Strategy Adviser- The Office of Product Safety and Standards",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-12-22T12:43:36+00:00",
    "content": [
        {
            "text": "SEO Senior Research Strategy Adviser- The Office of Product Safety and Standards"
        },
        {
            "text": "The Office of Product Safety and Standards is recruiting for a Technical Policy Lead into the Research, Evidence and Dissemination (RED) team.  The RED team is responsible for the Office’s Strategic Research Programme and Research Hub, developing new and novel research, and ways of delivering research, to drive forward improvements in consumer product safety through changes in policy and delivering regulation, and, has oversight of how the OPSS designates standards for GB."
        },
        {
            "text": "This is an exciting opportunity to apply for the role of Senior Research Strategy Adviser . You play a key part in supporting the management of the Strategic Research Programme, designing, procuring, and managing aspects of this cross-disciplinary research programme to address evidence gaps; developing an understanding of the relevant evidence base and policy drivers, and communicating evidence needs across OPSS."
        },
        {
            "text": "Key to this are the abilities managing a quality service and understand and communicate how the scientific capabilities within OPSS support the delivery of the broad range of activities OPSS has responsibility for; to network and work collaboratively across a large number of internal and external teams; to communicate scientific evidence to a non-technical audience; to identify gaps in the evidence base and opportunities for how these can best be filled; and continue to enhance the quality of our evidence."
        },
        {
            "text": "This is an exciting time to join the team and have your chance help us build for the future!"
        },
        {
            "text": "Further information contact the Organisational Growth team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": "Vacancy reference: 173628, London, Teddington or Birmingham; closing date: 11:55 pm on Sunday 09th January 2022."
        }
    ]
}