{
    "url": "https://ukhsa.blog.gov.uk/2021/12/22/staying-safe-over-the-festive-period-2/",
    "title": "Staying safe over the festive period",
    "authors": [
        "Susan Hopkins",
        "Richard Amlôt"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-12-22T14:50:23+01:00",
    "content": [
        {
            "text": "Christmas and New Year are special times when people come together. These social occasions are important, and we all want to spend time with friends and family. The emergence of the Omicron variant has served as a stark reminder that the pandemic is not over. Cases of COVID-19 are growing rapidly across the UK, with record numbers of cases being reported."
        },
        {
            "text": "It’s therefore important that we are all cautious over the festive period and do the things that can help keep ourselves and loved ones safe."
        },
        {
            "heading": 1,
            "text": "Get protected – get boosted or get your first or second dose"
        },
        {
            "text": "Booking your COVID-19 vaccine or booster or attending a walk-in COVID-19 vaccination site should be at the top of everyone’s to-do list."
        },
        {
            "text": "With cases of COVID-19 set to continue to sharply increase, it is more important than ever to get protected and we know that two vaccine doses alone are not enough."
        },
        {
            "text": "Our data shows that getting a booster dose of a vaccine provides around 70-75% protection against symptomatic disease from Omicron and is also highly effective against the Delta variant."
        },
        {
            "text": "Record numbers of people have been coming forward to get their booster dose in recent weeks, and you can join them. Everyone over 18 can now book through the NHS booking system."
        },
        {
            "text": "For those who have yet to take up their first or second dose, you can come forward and book these or attend a walk-in clinic."
        },
        {
            "text": "Getting a COVID jab is a powerful way to reduce your risk of falling seriously unwell from COVID-19 this winter. We are seeing daily record numbers of vaccinations being administered thanks to the incredible work of our NHS colleagues."
        },
        {
            "heading": 1,
            "text": "Meeting friends and family? Take a lateral flow test before you go"
        },
        {
            "text": "If you are meeting up with others, taking a rapid lateral flow test beforehand is strongly advised. Lateral flow tests are especially helpful at finding people who are infected but do not have symptoms and so could unknowingly pass COVID-19 on to others. Testing regularly ensures that you can safely spend time with friends and family and is especially important to help protect those who are more vulnerable, including elderly relatives."
        },
        {
            "text": "In response to the recent high demand for lateral flow tests, capacity for home deliveries is being doubled and pharmacies have access to an increased supply lateral flow tests per week. Order your lateral flow tests online or use this online tool to find venues in your community such as pharmacies where you can pick them up."
        },
        {
            "heading": 2,
            "text": "Ways we can stay safe and slow the spread"
        },
        {
            "text": "We all need to do our bit to help slow the spread of this Omicron wave, including following the guidance and taking sensible precautions."
        },
        {
            "text": "With such high amounts of COVID-19 circulating in our communities, the more people you meet, the more likely you will be exposed to an individual who is infectious. We should prioritise who we want to see and identify where we can reduce our social contacts."
        },
        {
            "text": "If you socialise indoors, then you can help to limit the chance of catching and spreading COVID-19 by:"
        },
        {
            "text": "Taking sensible precautions while we go about daily life can make a real difference, such as:"
        },
        {
            "heading": 2,
            "text": "What if I’ve been in contact with someone who has COVID-19"
        },
        {
            "text": "If you are identified as a close contact of a positive case of COVID-19, you must follow the appropriate self-isolation guidance, which was recently updated and can be read in full online."
        },
        {
            "text": "If you are fully vaccinated you do not need to isolate but you are strongly advised to do an LFD test daily for seven days and isolate if you test positive."
        },
        {
            "text": "If you have had only one vaccine dose or are unvaccinated, you must isolate for ten days. If you develop symptoms you should book a PCR test."
        },
        {
            "text": "People aged over 5 and under 18 years and 6 months do not need to isolate if not fully vaccinated, but should take daily LFD tests."
        },
        {
            "heading": 1,
            "text": "If you develop COVID-19 symptoms"
        },
        {
            "text": "If you develop any COVID-19 symptoms, you should get a PCR test as soon as possible and stay at home. Booking slots for PCR testing sites have increased with demand rising in recent weeks. Both home-delivery and test site PCR testing are available. Over the festive period, PCR testing sites will be operating on Christmas Day, Boxing Day and New Year’s Day. Find full details of opening hours here."
        },
        {
            "text": "Remember, if you are unwell for any reason, try to stay at home if possible and take precautions to stop illness from spreading."
        },
        {
            "heading": 1,
            "text": "7-day self-isolation if you test positive for COVID-19 "
        },
        {
            "text": "The self-isolation guidance has changed."
        },
        {
            "text": "You can take an LFD test from the sixth day of your isolation period, and another LFD test 24 hours later. If two consecutive tests are negative, and you do not have a high temperature, you may end your self-isolation after the second negative test result."
        },
        {
            "text": "You should not take an LFD test before the sixth day of your isolation period, and you should only end your self-isolation following two consecutive negative LFD tests which should be taken 24 hours apart."
        },
        {
            "text": "If you end your self-isolation early this way, you should still follow the public health advice and limit close contact with other people outside your household, especially in crowded, enclosed or poorly ventilated spaces. Work from home if you are able to, wear a face covering especially when you are in enclosed or poorly ventilated spaces and where you are in close contact with other people, and limit your contact with those who are at higher risk of severe illness if infected with COVID-19."
        },
        {
            "text": "There is more advice on how to stay safe and help prevent the spread of COVID-19 available here."
        },
        {
            "text": " "
        }
    ]
}