{
    "url": "https://insolvencyservice.blog.gov.uk/2021/12/22/the-shed-a-safe-place-to-talk/",
    "title": "The Shed: A safe place to talk",
    "authors": [
        "Dean Cavill"
    ],
    "categories": [
        "Inclusion",
        "Networks",
        "People"
    ],
    "pub_date": "2021-12-22T09:25:22+00:00",
    "content": [
        {
            "text": "I’m Dean and I’m a Continuous Improvement Business Manager at the Insolvency Service. I’m excited to tell the story of the latest network we provide for our staff in the agency: a men’s network."
        },
        {
            "text": "If you’re thinking \"surely not, a men’s network, really?\", then I am here to say to you, yes, it’s a men’s network."
        },
        {
            "text": "In the past there may have been scepticism around the idea that men needed a network. That view comes from an old way of thinking that men just get on with things and do not talk about issues that may be troubling them. We wanted to create a space where anyone could come along and ask questions, share any issues they may have and seek support when needed."
        },
        {
            "text": "My manager, who is one of the two Co-Chairs of the network, called me one afternoon in June 2021 and told me that he was working with a small group of people in setting up a men's network. He asked if I would be interested in helping get things up and running. I jumped at the opportunity, and our journey started there."
        },
        {
            "heading": 2,
            "text": "Laying the ground work"
        },
        {
            "text": "We all agreed that we wanted to differentiate ourselves from our the Insolvency Service’s already established Women’s Network, so we opted not to call ourselves simply The Men’s Network and asked for suggestions. My manager posted in the group’s Teams chat asking for suggestions for what we could call the network."
        },
        {
            "text": "Some of the ideas were clever and funny, such as The Man Cave, Brotherhood of Men, NEM (Network, Engaging Men) and Mixed Nuts. It turned out my suggestion of “The Shed” was chosen. It was picked because of its slightly stereotypical view of a shed being a sanctuary for men, but also a place where anyone could go in look around the shed and take away anything they may find useful."
        },
        {
            "text": "Our internal communications advisor then come up with the tag line “Everyone is welcome” and created our branding which you can see below. We also set up a central inbox for the network. So we were ready to go! We certainly didn't want to exclude anybody who wanted to join up, so the network really is for anybody who wants to make use of it."
        },
        {
            "heading": 2,
            "text": "The purpose of The Shed"
        },
        {
            "text": "Firstly, it helps the agency with achieving its diversity and inclusion objectives, but most importantly it is a safe and welcoming space for anyone to come along and talk and share any issues they may be experiencing."
        },
        {
            "text": "We work closely with the Insolvency Service's other networks in our agency to help produce content and support them during their big dates in the calendar. During Pride month, The Shed aided our colleagues in our LGBT+ network with online events and writing blogs explaining why they are an ally. We have worked closely with our Break the Stigma Network in creating a buddy scheme to help people move back into the office environment once restrictions had eased around the country."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Collaborating across the Civil Service"
        },
        {
            "text": "We have talked to other Men’s Network’s across the Civil Service and had a great informative discussion with the Man Down Network in the Cabinet Office. Since then, we attend a monthly call with the Man Down Network not only to share ideas, but which is just a place where anybody on the call can talk about anything they like. Our Co-Chair has attended one of these and was genuinely moved by the conversation he heard on the call."
        },
        {
            "text": "We then decided we wanted to produce something different to the usual news and blogs that the rest of the networks produced, and out of this discussion came The Changing Room concept."
        },
        {
            "heading": 2,
            "text": "The Changing Room"
        },
        {
            "text": "The Changing Room is essentially a recorded video which can be viewed on the agency’s intranet. The video has a host and our Co-Chairs, Scott Johnson and Dave Elliott, having a conversation and debate on different subjects. These have proved very popular, and we’re looking forward to producing a Christmas-themed edition soon."
        },
        {
            "text": "Future topics will include sexual harassment in the workplace, depression, and a discussion about suicide where I will be guest and talk about my experience of the subject."
        },
        {
            "text": "The Shed Co-Chair Scott Johnson says:"
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}