{
    "url": "https://naturalengland.blog.gov.uk/2025/05/16/creating-nature-towns-and-cities-conference/",
    "title": "Creating Nature Towns and Cities conference",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Climate change",
        "Connecting People with Nature",
        "Environmental Improvement Plan",
        "Green Infrastructure",
        "Growth",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2025-05-16T09:57:44+01:00",
    "content": [
        {
            "text": "Nature Towns and Cities is a partnership between Natural England, The National Lottery Heritage Fund and the National Trust working to ensure everyone in the UK can access the benefits of nature and green spaces.  We're delighted to invite you to our free online conference on 5th June, where innovative leaders from local government, public sector, business and community organisations will share practical strategies for creating greener, healthier and more vibrant communities. Join us to connect with passionate changemakers from across the UK who are actively transforming their local areas and be part of this growing movement."
        },
        {
            "text": "It’s well-recognised that living side by side with nature is good for us. As well as the clear health benefits of cleaner air, it goes deeper - the opportunity to truly connect with nature has a measurable impact on our wellbeing."
        },
        {
            "text": "“I’m a big believer in biophilia – the idea that as humans we feel a deep connection to the living world and a sense of loss and anxiety if we’re disconnected from nature. Bringing high quality nature closer to where people live is therefore fundamentally important to maintaining a healthy society” says Graham Duxford, Chief Executive of Groundwork UK."
        },
        {
            "text": "Yet millions of people in urban areas still don’t have access, something that Nature Towns and Cities is working to address."
        },
        {
            "text": "On 5 June 2025, Nature Towns and Cities will be holding its inaugural online conference. A coalition of public, private and third sector organisations, Nature Towns and Cities is committed to bringing nature and green space to urban areas for everyone's benefit. Putting access to green space at the heart of future plans for towns and cities will improve life for millions of people, but making this happen will require ambition, vision, leadership and collaboration."
        },
        {
            "text": "Creating Nature Towns and Cities will start to explore these themes, inviting people and organisations who want to lead this change in towns and cities across the UK to take part."
        },
        {
            "text": "Suitable for people from across a range of organisations and roles, sessions will focus on leadership and how to influence change in the context of urban nature. Plus, case studies, interactive networking spaces to meet like-minded changemakers and more. "
        },
        {
            "text": "Preparing to speak at the upcoming conference, Graham stresses the importance of this work and its timeliness. “As well as its proven benefits to people’s health and wellbeing, nature has a core role in helping us combat both the causes and effects of climate change. It also offers a way of addressing a wide range of other pressing issues – from supporting children’s early years development to helping people retrain for jobs in the green economy. This work is urgent and essential. But for a long time, budgets and capacity have been in sharp decline, and professionals have had little support to learn from peers and share good practice."
        },
        {
            "text": "That’s what makes the work of this programme so critical – we need to pool the expertise and resources available in the public, private and voluntary sectors to find better, more connected ways of working and support communities when they’re taking action to protect and promote nature in our towns and cities.”"
        },
        {
            "text": "The conference will kick start a long-term programme of support designed to build a collaborative network of expertise, people and organisations across the UK. Open to all and free to join, those attending can expect a mixture of speakers, panel sessions and case studies, and learn what’s working, why and how to adapt and adopt at local level. Through an interactive platform attendees will also have the chance to meet like-minded changemakers and share ideas."
        },
        {
            "text": "One such speaker is Allys Ludlow, urban tree canopy coordinator at Trees for Cities. She’ll be sharing what they’ve been working on with nationwide communities and how this charity is cultivating lasting change in local neighbourhoods."
        },
        {
            "text": "The conference will also delve into perspectives from across sectors into topics such as, ‘why does urban green space matter?’ Leaders and high-profile speakers from organisations such as Co-Op, The Royal Society for Arts, Bradford City of Culture and Edinburgh City Council will share their experiences and how their organisations are harnessing nature to drive forward a range of priorities benefitting people."
        },
        {
            "text": "Through the practical workshops, delegates will gain skills and knowledge needed to drive change in their own town or city and start to explore the support available through Nature Towns and Cities."
        },
        {
            "text": "This is a chance to connect with passionate organisations and people working to creating greener, healthier towns and cities. Register now for insights, inspiration and to be a part of the movement."
        },
        {
            "text": "BOOK YOUR PLACE"
        }
    ]
}