{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/05/16/gmp-gdp-certificates/",
    "title": "GMP & GDP Certificates",
    "authors": [
        "Ian Jackson"
    ],
    "categories": [
        "Good distribution practice",
        "Good manufacturing practice"
    ],
    "pub_date": "2025-05-16T16:49:01+01:00",
    "content": [
        {
            "text": "The purpose of this blog is to describe our approach to the validity date of UK issued certificates confirming compliance with Good Manufacturing Practice (GMP) and Good Distribution Practice (GDP)."
        },
        {
            "text": "Following the end of the COVID-19 public health emergency declared by WHO in May 2023[1], on-site GMP and GDP inspections were restarted after being postponed, or carried out remotely, during the pandemic.  This resulted in the GMP and GDP certificates for many sites having exceeded the accepted validity period. The validity of GMP and GDP certificates has subsequently been extended annually via a statement on our database with the last extension having ended December 2024[2]."
        },
        {
            "heading": 2,
            "text": "GMP Certificates"
        },
        {
            "text": "GMP certificates are critical to enable global trade and regulatory submissions."
        },
        {
            "text": "GMP certificates are for the purpose of confirming the overall conclusion of an inspection with respect to compliance with GMP. They may be used by applicants to support regulatory submissions. Within the UK they do not replace confirmation of the holding of an EU or UK manufacturing authorisation."
        },
        {
            "text": "A desk-based GMP Compliance Assessment has been developed to enable us to review the level of control and compliance at a manufacturing site. Since December 2024, we have been providing a reactive service to holders of UK manufacturing authorisations contacting us because they need an updated GMP certificate to continue trading. In January 2025, this was extended to 3rd country manufacturing sites under MHRA oversight for GMP compliance.  Once the required information has been received, we aim to conclude the assessment within 28 working days."
        },
        {
            "text": "Manufacturer’s authorisations & GMP certificates may be verified using the MHRA-GMDP database or the EU database."
        },
        {
            "text": "Manufacturers that require a new GMP certificate should contact the team via email: gmpinspectorate@mhra.gov.uk"
        },
        {
            "heading": 2,
            "text": "GDP Certificates"
        },
        {
            "text": "MHRA do not intend to automatically extend GDP certificates approaching, or beyond, 5 years of their issuing into 2025."
        },
        {
            "text": "GDP Certificates do not expire and can be considered valid, however, organisations should seek their own assurances of the GDP compliance of sites when undertaking their due diligence and consider the reliability of the certificate in their assessments."
        },
        {
            "text": "Should you have a specific requirement for GDP Certificates, for example to support regulatory submissions, please contact the GDP Inspectorate mail box: gdpinspectorate@mhra.gov.uk"
        },
        {
            "heading": 2,
            "text": "Inspections and compliance oversight"
        },
        {
            "text": "MHRA will continue to perform risk-based supervision of sites through either on-site inspections or distant assessments and, based on the outcome, may continue to issue, withdraw or restrict GMP and GDP certificates, as appropriate.  Scheduling of these inspections may be independent of the extended validity period stated above."
        },
        {
            "text": "This is a risk proportionate regulatory approach, that enables us to support safe and secure manufacturing and supply chains without compromising patient safety."
        }
    ]
}