{
    "url": "https://educationhub.blog.gov.uk/2025/05/how-were-helping-children-and-teachers-with-their-mental-health/",
    "title": "How we’re helping children and teachers with their mental health and wellbeing ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Mental Health",
        "school absence",
        "Schools"
    ],
    "pub_date": "2025-05-16T10:42:50+01:00",
    "content": [
        {
            "text": "Poor mental health and absence from school are impacting the education of children and in turn their futures. Government research suggests that persistently absent pupils in secondary school could earn £10,000 less at age 28 compared to pupils with near-perfect attendance. "
        },
        {
            "text": "Here we go through the ways we are supporting children and their teachers, so that every pupil can achieve and thrive in education. "
        },
        {
            "heading": 3,
            "text": "How we’re helping pupils to achieve and thrive "
        },
        {
            "text": "Mental Health and Wellbeing Support "
        },
        {
            "text": "Over 5 million young people now have access to specialist mental health support in their school or college. "
        },
        {
            "text": "This Mental Health Awareness Week, progress continues on our commitment to provide all schools with access to specialist mental health professionals by 2029/30 by expanding Mental Health Support Teams. "
        },
        {
            "text": "By April 2026, we estimate that 60% of pupils in schools and learners in further education in England could be covered by a Mental Health Support Team, up from 52% in April 2025. This means an additional 900,000 pupils and 1,700 schools and colleges will have access to support from Mental Health Support Teams by April 2026.  "
        },
        {
            "text": "We will also continue to develop our online mental health lead resource hub and targeted support toolkit, supporting mental health leads to continue to develop their role and to support young people. "
        },
        {
            "text": "Attendance support "
        },
        {
            "text": "We are investing nearly £1.5 million this year in new RISE Attendance and Behaviour Hubs to support hundreds of schools in tackling absence and poor behaviour.  "
        },
        {
            "text": "RISE regional advisors – education specialists with leadership, behaviour and attendance expertise – will work with the 90 lead schools to develop and support networks, and once fully implemented will support around 5000 schools. Together, they will work to make sure children get coordinated support they need to attend and do well in school.  "
        },
        {
            "text": "To help identify and directly address attendance areas of improvement, we are providing schools with additional AI powered data reports. Heads and attendance leads can now access intelligent reports which compare their absence rates with similar schools showing high or low performance.  "
        },
        {
            "text": "Wider support "
        },
        {
            "text": "We are rolling out free breakfast clubs at every state funded primary school, as well as a new Enrichment Framework that will be developed in collaboration with a panel of experts to support schools to offer pupils high-quality extra-curricular activities that range from debating to sport, to help children thrive beyond the classroom. "
        },
        {
            "heading": 3,
            "text": "How we're supporting teachers to thrive"
        },
        {
            "text": "For every child to achieve and thrive, we need our teachers to have the time, tools, and support to deliver a great education. That’s why we are recruiting 6,500 teachers into shortage subjects, support areas that face recruitment challenges, and tackle retention issues.  More than 4,100 schools have already joined the Education Staff Wellbeing Charter, which supports better work-life balance and mental health for those working in the education sector. "
        },
        {
            "text": "We're also offering practical help to cut down on workload, including the Improve workload and wellbeing for school staff service. This service provides advice created by school leaders themselves to help other school leaders support their staff's wellbeing. "
        }
    ]
}