{
    "url": "https://teaching.blog.gov.uk/2025/05/16/innovative-ways-to-support-student-wellbeing/",
    "title": "How schools are using innovative ways to support student wellbeing",
    "authors": [
        "Gill Bell",
        "Nichola Potts"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "School attendance"
    ],
    "pub_date": "2025-05-16T16:48:38+01:00",
    "content": [
        {
            "text": "Gill Bell, student councillor at Salford City Academy, and Headteacher Nichola Potts from Christ the King RC Primary School in Salford, talk about their approaches to student wellbeing in school."
        },
        {
            "heading": 2,
            "text": "A wellbeing-centred approach to school life (Nichola Potts)"
        },
        {
            "text": "Christ the King RC Primary School is committed to helping every child achieve their potential in a supportive environment. Our inclusive curriculum ensures all children see themselves reflected in their learning through content that celebrates diversity and integrates various cultural perspectives. This approach fosters belonging regardless of background while promoting engagement, cultural awareness, and empathy among pupils."
        },
        {
            "heading": 3,
            "text": "Beyond traditional learning"
        },
        {
            "text": "Our \"Vow to Wow Curriculum\" supplements traditional subjects through rich experiential learning that nurtures each child's unique strengths. Play forms an essential component of our educational philosophy, with approaches like 'Mantle of the Expert' and 'Tinkering for Learning' which see children fostering critical thinking and problem-solving skills."
        },
        {
            "heading": 3,
            "text": "Building strong community connections"
        },
        {
            "text": "Connectedness stands as our core objective, building strong relationships among students, staff, families, and the wider community. Our proactive approach to supporting vulnerable families has placed us in the top ten percent nationally for attendance. The consistency of our dedicated staff, many serving for decades, creates a stable environment where children thrive."
        },
        {
            "heading": 3,
            "text": "Proven success through collaboration"
        },
        {
            "text": "Our personalised \"no outsiders, no one left behind\" philosophy ensures all children flourish both academically and personally. Through extensive local, national, and global partnerships, we continually enhance our practices, consistently achieving above-average results while developing socially responsible individuals ready to contribute positively to society."
        },
        {
            "heading": 2,
            "text": "Mental Health Support Teams at Salford City Academy (Gill Bell)"
        },
        {
            "text": "Salford City Academy is fortunate to benefit from the support of Thrive in Education, Salford's Mental Health Support Team initiative. Over the current academic year, more than 20 students have benefitted from one-to-one support from mental health practitioners and emotional support workers."
        },
        {
            "text": "Behaviour, attendance, and academic progress have been monitored to discover the effectiveness of the interventions. The trend is for a reduction in incidences of negative behaviour and improved attendance. All students who have engaged in one-to-one support report feeling grateful for the support and say that it has made a 'positive difference'."
        },
        {
            "heading": 3,
            "text": "School-wide initiatives"
        },
        {
            "text": "In addition to the one-to-one support, the Thrive in Education team has delivered assemblies about how to manage anxiety and run workshops for parents to help them identify problems early and support their children. The team has also run activities around Mental Health Awareness Week."
        },
        {
            "heading": 3,
            "text": "Benefits of in-school support"
        },
        {
            "text": "One of many advantages of the project is that the Thrive team come into the school. For various reasons (such as poverty, parental mental health, parents' working, and childcare responsibilities), our families are often unable to attend appointments outside of school. Bringing the support in therefore allows students to benefit more often than if they had to travel to an external site."
        }
    ]
}