{
    "url": "https://defraenvironment.blog.gov.uk/2025/05/16/planning-reform-protecting-nature-while-supporting-growth/",
    "title": "Planning reform: protecting nature while supporting growth ",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Land use",
        "Nature",
        "Planning"
    ],
    "pub_date": "2025-05-16T16:23:13+01:00",
    "content": [
        {
            "text": "Nature is the bedrock of our entire way of life. "
        },
        {
            "text": "We are deeply connected to nature through the beauty of our ever-changing seasons and our treasured wildlife, from puffins to hedgehogs. Healthy ecosystems make our food systems and water supplies more reliable. They remove carbon from the atmosphere, cool our towns and cities, and improve public health. They help create thriving, healthier communities. "
        },
        {
            "text": "As we work to build the homes and infrastructure our communities need, there have been questions about whether the Planning and Infrastructure Bill might come at the expense of nature. "
        },
        {
            "text": "Many people care deeply about protecting our countryside, wildlife, and green spaces - and so does the Government.  "
        },
        {
            "text": "In this post, we’ll share with you more about the Bill and the Government’s vision for a planning system that delivers for both nature and people. "
        },
        {
            "text": "Introducing the Planning & Infrastructure Bill "
        },
        {
            "text": "The current system of Environmental assessments and case-by-case negotiations often slow down housing and infrastructure delivery, and the condition of our environment and important habitats has continued to decline despite these protections. This is a lose-lose situation for our economy, communities and nature. "
        },
        {
            "text": "Currently, there is often little or no strategic coordination of the conservation measures deployed to address development impacts on protected habitats and species.  "
        },
        {
            "text": "To grow the economy and recover nature we need new tools and a new approach, which is where the new Planning and Infrastructure Bill comes in. "
        },
        {
            "text": "The Bill has been designed to speed up house building without compromising nature. "
        },
        {
            "text": "The Planning and Infrastructure Bill does not remove environmental protections "
        },
        {
            "text": "Some have expressed concerns the Bill could \"erase\" environmental protections or give developers free rein to damage habitats and wildlife.  "
        },
        {
            "text": "The Planning and Infrastructure Bill does not remove environmental protections but provides an alternative route to discharging existing obligations. But, crucially, this will only be possible where an Environmental Delivery Plan is in place which sets out how conservation measures will deliver better environmental outcomes for the environmental feature being addressed."
        },
        {
            "text": "To ensure the delivery of these measures, the Bill requires developers to make appropriate contributions in respect of the environmental impact of the development. Natural England – England’s nature conservation body – will then use this funding to secure meaningful and lasting improvements to nature. This alternative approach will only be used when it can deliver better outcomes funded through levy payments.  "
        },
        {
            "text": "Supporting a more strategic approach to nature recovery "
        },
        {
            "text": "A key feature of the Bill, designed to support both nature and the economy, is the new Nature Restoration Fund.  "
        },
        {
            "text": "By capturing developer contributions through Environmental Delivery Plans Natural England will make better use of the millions of pounds that are spent each year on bespoke mitigation and compensation schemes, by using this money to fund strategic interventions that provide greater benefit for nature. "
        },
        {
            "text": "But we recognise that it is important that the new approach is supported with appropriate safeguards to ensure we secure the environmental outcomes we need. That is why Environmental Delivery Plans can only be put in place where the Secretary of State is satisfied the delivery of conservation measures is likely to outweigh the negative effects of development.  "
        },
        {
            "text": "This test should not be seen in isolation from the rest of the Bill as Natural England will be tasked with setting out conservation measures that will both address the environmental impact of development and contribute to an overall improvement, and set out why they, the statutory nature conservation body in England, consider those measures appropriate. "
        },
        {
            "text": "By establishing this new approach, we're moving away from the current piecemeal approach offsetting harm and toward strategic, larger-scale environmental improvements for protected sites and species. "
        },
        {
            "text": "The Nature Restoration Fund will: "
        },
        {
            "text": "The Planning and Infrastructure Bill’s Environmental Delivery Plans will help with this new strategic approach.  "
        },
        {
            "text": "In taking a strategic approach, it is important that Natural England are empowered to achieve the best possible environmental outcomes. This may mean taking a different approach to the design and sequencing of conservation measures than would have been adopted under the existing system. The government is, of course, focused on restoring nature in local communities, ensuring people benefit from accessing green space on their doorsteps.  "
        },
        {
            "text": "Natural England will be able to create Environmental Delivery Plans either on its own initiative or at the request of the Secretary of State. Environmental Delivery Plans will allow Natural England to take a more strategic approach to conservation. Rather than focusing on individual projects in isolation, they can take a broader perspective that will help deliver better outcomes for nature while reducing planning delays. "
        },
        {
            "text": "This new approach means more for nature, not less. At the same time, developers will benefit from a streamlined process and simpler user experience with costly and time intensive processes removed.  "
        },
        {
            "text": "The Government is committed to getting this right for nature and people  "
        },
        {
            "text": "We're committed to delivering positive environmental outcomes alongside the housing and infrastructure our communities urgently need. But we are clear that Environmental Delivery Plans will only be brought forward where they will deliver better environmental outcomes for the environmental issues being addressed. "
        },
        {
            "text": "To make sure we get this right, we're actively engaging with nature conservation organisations, developers, local authorities, and communities and the Office of Environmental Protection (OEP). The OEP have recently provided their advice, which we are considering while noting their support for the intention behind the Bill.  "
        },
        {
            "text": "By moving from piecemeal interventions to a more strategic approach for protected sites and species, we believe we can deliver more for nature, not less - creating a planning system that works better for communities and the environment we all cherish.  "
        },
        {
            "text": "For more information, please read the Planning & Infrastructure Bill guidance and our Development and Nature Recovery Working Paper. "
        }
    ]
}