{
    "url": "https://defrafmp.blog.gov.uk/2025/05/16/science-and-fmps-event-summary-and-research-projects-coming-up/",
    "title": "Science and FMPs event summary and research projects coming up",
    "authors": [
        "Katie St John Glew - FMP Evidence Lead, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Evidence"
    ],
    "pub_date": "2025-05-16T10:22:50+01:00",
    "content": [
        {
            "text": "On 18 March, Defra hosted \"Science and FMPs: Progress Made and Exploring the Future,\" supported by Green Futures at the University of Exeter.  "
        },
        {
            "text": "The hybrid event brought together 143 participants from academia, recreational and commercial fishing, NGOs, and government bodies. "
        },
        {
            "text": "The event aimed to increase transparency on Fisheries Management Plans (FMP) related science projects. It showcased innovative projects and collaborations between scientists, policymakers, and fishers, highlighting positive outcomes, challenges, and future research plans.  "
        },
        {
            "text": "Highlighted research "
        },
        {
            "text": "Professor Gideon Henderson, Defra's Chief Scientific Advisor, opened the event and emphasised the importance of collaboration and a broad evidence base to support sustainable fisheries.  "
        },
        {
            "text": "The focus of the day was exploring some of the research projects which have been working to address FMP Evidence Gaps.  "
        },
        {
            "text": "A presentation on the FMP Programme Evaluation was also shared which highlighted the success of collaborative efforts and the need for continued transparency.  "
        },
        {
            "text": "More information on these projects is available in the FMP R&D projects newsletter and the full reports will be published soon.  "
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "The event concluded with a look to this year’s research plans.  After prioritising, a range of projects have been approved which work to address a range of evidence gaps including improving data collection and stock assessment methods, exploring sustainable fishing practises and management tools and improving the social and economic evidence base of FMPs.  "
        },
        {
            "text": "Subscribe to the blog to hear more about these new projects. "
        },
        {
            "text": "Take-aways "
        },
        {
            "text": "Important points coming from discussions included the need to share more about our FMP evidence work and to ensure feedback is given after all collaborations and engagements. "
        },
        {
            "text": "A write up of the event has been shared with those who registered to attend. If you would like a copy, please get in touch at FMPs@defra.gov.uk "
        }
    ]
}