{
    "url": "https://marinescience.blog.gov.uk/2025/05/16/the-importance-of-reporting-marine-non-native-species-what-can-you-do/",
    "title": "The importance of reporting marine non-native species - what can you do?",
    "authors": [
        "Phil Davison"
    ],
    "categories": [
        "Animal Health",
        "biodiversity",
        "Invasive species"
    ],
    "pub_date": "2025-05-16T08:42:44+01:00",
    "content": [
        {
            "text": "Throughout this year’s Invasive Species Week, an annual event organised by the GB Non-Native Species Secretariat (GB NNSS), we have explored the many detrimental impacts invasive non-native species can have on our ecosystems and society. Whilst prevention remains the most effective defence, accidental introductions can still happen. In such cases, early detection and rapid response is crucial for preventing these species from establishing in the environment. This is especially true in our marine environments where, once established, these species are extremely difficult to control and often impossible to eradicate."
        },
        {
            "text": "A key way that we can all help in the battle against invasive non-native species is to report anything unexpected that we find. In the marine environment the public can help monitor places along our vast coastline that are rarely visited by marine biologists. In 2024, two events highlighted the crucial role that public reports can have in ensuring a rapid response to non-native species, and showed how we respond to these important sightings."
        },
        {
            "text": "In January 2024, we received a report from a member of the public who had found and photographed egg-cases on their local beach in East Sussex, that could have belonged to the Japanese oyster drill Ocinebrellus inornatus. This species is a non-native marine mollusc that could have severe impacts on our native species and economy. The Japanese oyster drill is native to the North Pacific and has established non-native populations in the Netherlands, but had not yet been recorded in the UK. This potential sighting was of concern as this species preys on oysters, scallops, mussels and cockles, by drilling through their shells to eat their flesh. If this species were to establish in UK waters, it could have economic effects on shellfish farms, as well as environmental effects on, for example, oyster reef regeneration projects."
        },
        {
            "text": "Unlike many marine species, the Japanese oyster drill disperses slowly, meaning that if found in time there could be options to manage a new population and prevent its spread to other sites.  Cefas led a rapid response group, which included Defra, GB NNSS, and Natural England. Experts were consulted to try to confirm the identification, and a survey was organised on the surrounding beaches to look for Japanese oyster drills or their egg-cases. No further evidence of the species was found, and from the original photographs it was decided that the egg-cases may have been from our native oyster drill, as their eggs look very similar. However, an awareness-raising programme was launched to ensure that interested parties in the area knew how to report any further sightings if they occurred.   "
        },
        {
            "text": "In July 2024, a sighting of an Atlantic blue crab, Callinectes sapidus, was reported by a member of the public in a rock pool in Brighton, East Sussex. This species is native to the eastern coast of North America, where it is a well-known seafood item, and has been introduced to the Mediterranean where it has become an invasive species and caused ecological impacts and economic damage to fisheries. Sightings in northern Europe have increased in the last few decades, but there had only been five isolated previous sightings in UK waters. It therefore came as a surprise in October when another blue crab was found off the coast at Brighton, this time found by a Cefas fisheries observer on a fishing boat. "
        },
        {
            "text": "The finding of a second crab at the same location triggered the formation of another rapid response group, this time involving the Marine Management Organisation, Natural England, Defra, GB NNSS and Cefas. How the crabs arrived in Brighton is a mystery, but as this species is sometimes sold live at food markets, one possibility is that they were set free by well-meaning people. As blue crabs are causing serious impacts in the Mediterranean, we are keen to prevent their establishment in the UK. The response group have launched a programme to raise awareness on the dangers of releasing crabs into the environment and continue to monitor the situation locally for further sightings.  "
        },
        {
            "text": "If you see something new that you have reason to believe is a non-native species, please report it to irecord, so the threat can be assessed, and appropriate action taken at the earliest opportunity. Further information on how to report non-native species can be found at Non Native Species Secretariat website, including a list of alert species for which timely reporting is especially important."
        }
    ]
}