{
    "url": "https://deframedia.blog.gov.uk/2022/04/27/coverage-of-appg-rural-productivity-report/",
    "title": "Coverage of APPG rural productivity report",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-04-27T11:57:53+01:00",
    "content": [
        {
            "text": "There has been widespread coverage across the Financial Times, BBC, ITV Regional News and the i of the All-Party Parliamentary Group’s report on rural productivity."
        },
        {
            "text": "The report titled, “Levelling up the rural economy: an inquiry into rural productivity”, suggests that productivity is limited in rural areas due to a lack of connectivity, slow broadband speeds, skills gap, and issues with tax, planning and housing. The report makes a number of recommendations and urges the government to provide more support to level up the countryside."
        },
        {
            "text": "As the department responsible for rural affairs, Defra works in collaboration with other government departments to address connectivity, planning and housing, transport and digital across rural areas. The government is committed to supporting the growth of even the remotest places and considers how policies operate in rural areas through a process of rural proofing."
        },
        {
            "text": "Through the dedicated Coastal Communities Fund, the government has invested over £229 million in projects throughout the UK’s rural and coastal communities to help create jobs and boost businesses. This includes nearly £4 million to refurbish the Tate in St. Ives, more than £2.5 million to refurbish Scarborough’s historic market hall and nearly £2.5 million to regenerate key areas of Littlehampton Town Centre."
        },
        {
            "text": "The government is investing £5 billion so hard-to-reach areas can get gigabit speeds – over 67% of UK premises can now access gigabit-capable broadband, a huge leap forward from July 2019, when coverage was just 8%. The £1 billion Shared Rural Network initiative will also roll out fast and reliable 4G coverage to 95 per cent of UK landmass, as well as hitting the government’s target of 85 per cent gigabit-capable broadband coverage by 2025."
        },
        {
            "text": "Later this year, the government will publish the annual report on Rural Proofing and will further set out how government departments are working to support levelling up in rural areas through targeted approaches to develop infrastructure, deliver services, strengthen the rural economy and manage the natural environment."
        },
        {
            "text": "Lord Benyon, Minister for Rural Affairs, said: "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}