{
    "url": "https://deframedia.blog.gov.uk/2022/04/27/coverage-of-nao-report-on-waste-crime/",
    "title": "Coverage of NAO report on waste crime",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Weekly stories"
    ],
    "pub_date": "2022-04-27T11:46:19+01:00",
    "content": [
        {
            "text": "Today the National Audit Office (NAO) has published a report on its investigation into the Government’s actions to combat waste crime."
        },
        {
            "text": "Coverage in The Telegraph, the Independent, Western Daily Press & Western Telegraph reports on the NAO’s assessment that there has been a steady rise in organised, large-scale waste crime in England in recent years."
        },
        {
            "text": "Criminal activities including fly-tipping, illegal dumping, and the illegal export of waste abroad can blight our communities, harm the environment, and pose a risk to human health. Both local authorities and the Environment Agency have a range of powers to tackle waste crime."
        },
        {
            "text": "With extra funding that is now part of its baseline, the Environment Agency has been able to employ extra frontline staff including environmental crime officers, prevention and disruption officers, intelligence officers and financial investigators."
        },
        {
            "text": "Between 2017 and 2020, the EA stopped illegal waste activity at 2,700 sites and initiated 191 prosecutions for illegal waste sites, with 39 prison sentences handed down. It also issued fines of over £1.1m for illegal waste sites, plus £5.5m in Proceeds of Crime Act (PoCA) confiscation orders. In 2019/20, the EA prosecuted nearly 100 individuals and companies for waste crime offences, with fines exceeding £900,000, 28 custodial sentences and £1m of confiscation orders."
        },
        {
            "text": "We recently consulted on the introduction of mandatory digital waste tracking, which will mean those handling waste will record information from the point waste is produced to the stage it is disposed of, recycled or reused, making it easier for regulators to detect illegal activity and tackle fly-tipping and other waste crime."
        },
        {
            "text": "Our reform of the licensing system will increase the competence and background checks needed to operate as a waste carrier, broker or dealer, and make it easier for regulators to enforce against non-compliant operators whilst making it harder for un-registered operators to find work in the sector."
        },
        {
            "text": "The Government has set up the Joint Unit for Waste Crime to disrupt serious and organised crime and reduce its impact on the environment and the economy, which brings together agencies from across the UK to share intelligence and enforcement."
        },
        {
            "text": "Resources and Waste Minister Jo Churchill said:"
        },
        {
            "text": "Sir James Bevan, chief executive at the Environment Agency, said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}