{
    "url": "https://publicguardian.blog.gov.uk/2022/04/27/creating-an-lpa-frequently-asked-questions-part-2/",
    "title": "Creating an LPA - Frequently Asked Questions Part 2",
    "authors": [
        "Caroline Amos"
    ],
    "categories": [
        "Attorneys",
        "Digital",
        "EPA",
        "FAQs",
        "General",
        "Guidance",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2022-04-27T12:39:37+01:00",
    "content": [
        {
            "heading": 4,
            "text": "We receive hundreds of phone calls each week from people looking for help and information on a number of different things. Here’s part 2 of our most frequently asked questions to make your life a little easier when creating an LPA."
        },
        {
            "text": "Q1. Are enduring powers of attorney still valid?\nIf a person has an EPA made before 1 October 2007, either registered or unregistered, it can still be used. EPAs only allowed people to appoint Attorneys to make decisions about property and financial matters."
        },
        {
            "text": "If someone has already made an EPA and still has capacity, they can either replace it with a new Property and Affairs LPA or can keep the existing EPA."
        },
        {
            "text": "EPAs were replaced by LPAs on 1 October 2007."
        },
        {
            "text": "Q2. Do I need to register an EPA?\nThe Attorney is responsible for registering the EPA. This is because the EPA is only registered when the Attorney believes that the Donor is no longer able, or will soon no longer be able, to make their own decisions."
        },
        {
            "text": "Before the document is registered you will need to notify the donor and at least 3 members of the donors family if possible. If they object to the registering of the EPA then it may not be possible to until all matters are resolved."
        },
        {
            "text": "OPG does not require formal evidence that the person lacks capacity in order to register the EPA."
        },
        {
            "text": "You can find out more about the registration process, notifying the right people and other common questions on EPA on our website. Go to gov.uk/OPG and search for enduring power of attorney."
        },
        {
            "text": "Q3. Can I use blue ink on my LPA application?\nWe scan our LPAs into an online system. Black ink is better recognised by the scanners and can transfer the information better. You can use blue ink if you don’t have a black pen available."
        },
        {
            "text": "Q4. Should I tick or cross the box on my LPA application?\nAs long as the mark you’re making is clear and within the box it doesn’t really matter whether you tick it or put a cross in it."
        },
        {
            "text": "Q5. What is section 5 of a health and welfare LPA and why is it important?\nSection 5 is the life sustaining treatment page. You need to fill this in to confirm whether you want this sort of treatment or not, such as feeding tubes. You can’t put anything illegal in here such as assisted dying. It also includes information on Do Not Resuscitate and other medical treatments."
        },
        {
            "text": "If this section isn’t completed in full, the LPA will be seen as invalid and a new form will need to be filled in."
        },
        {
            "text": "Q6. Why can’t I change or amend an LPA if I find a mistake?\nIf you make a mistake before you’ve signed the LPA you can correct it. Put a cross through the mistake and put the correction clearly next to it, the relevant people will need to sign and date the correction. Do not use correction fluid."
        },
        {
            "text": "If you find anything after the donor has signed the document, it can no longer be changed, this is because when the donor signs the document, they are saying everything on it is accurate and true at the time of signing. If you change anything after this, it will make the LPA invalid."
        },
        {
            "text": "If you’re using the online LPA tool it will prompt you to check all the information in each section and highlight errors made where possible. Once you’ve confirmed everything and the document is ready to print, you can no longer change the LPA, you will need to start again as you’ve confirmed the document is final."
        },
        {
            "text": "Q7. I’ve created my LPA documents and have received two letters with different reference numbers. Why is this?\nIf you have created a health and welfare LPA as well as a property and finance LPA you will have different reference numbers for each document. Both forms have lots of similar information so it may seem like a duplication, so we advise you check which reference number is for which form."
        },
        {
            "text": "Q8. I have an LPA but have moved or my attorney has moved, can I update an address?\nYou will need to get in touch and let us know your change of address."
        },
        {
            "text": "To do this we will need details of your LPA such as a reference number, name of the donor and date of birth. This is so we can find your document on the system and update as needed."
        },
        {
            "text": "You will also need to let third parties know, such as banks or utility companies that the address has changed. Do not change the LPA itself as this will invalidate it."
        },
        {
            "text": "Q9. I’ve changed my name and it no longer matches the LPA documentation. Can I change this?\nChanges in name works in the same way as a change of address, however, supporting documentation is needed to prove the names change is legal and legitimate - evidence (e.g. original marriage certificate or deed poll) needs to be sent to us in the post."
        },
        {
            "text": "Q10. Finally, what happens if I have further questions on filling in an LPA that haven’t been answered here?\nGo online at gov.uk/opg, we have guidance on filling in an LPA application there. If you have further questions you can contact us at customerservices@publicguardian.gov.uk or call us on 0300 456 0300"
        }
    ]
}