{
    "url": "https://companieshouse.blog.gov.uk/2022/04/27/progress-on-the-register-of-overseas-entities/",
    "title": "Progress on the Register of Overseas Entities",
    "authors": [
        "Rachael Watts - Companies House (ROE implementation lead)",
        "David Cleasby - HM Land Registry (ROE implementation lead)",
        "Harry Murray - Registers of Scotland (ROE implementation lead)",
        "Shauna Harley - Land Registers Northern Ireland (ROE implementation lead)"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2022-04-27T09:22:35+01:00",
    "content": [
        {
            "text": "The new Economic Crime (Transparency and Enforcement) Bill received royal assent on 15 March and became an Act."
        },
        {
            "text": "Under the Act, a new Register of Overseas Entities will be created and held by Companies House. This new Act forms part of the government’s strategy to combat economic crime, while making sure that legitimate businesses continue to see the UK as a great place to invest."
        },
        {
            "heading": 2,
            "text": "What we can confirm so far"
        },
        {
            "text": "The new register will require overseas entities that own UK land to declare their beneficial owners or managing officers. Overseas entities will not be able to buy, sell, transfer or lease land, or create a charge against the land in the UK unless they’ve registered with Companies House."
        },
        {
            "text": "Overseas entities who already own land in the UK will be given 6 months to register their beneficial owners or managing officers. This 6 month period will not begin until the new register has been launched. Any new purchasers will need to register with Companies House from the day the register comes into effect."
        },
        {
            "text": "Once the overseas entity has registered and provided all the necessary information, an overseas entity ID will be provided by Companies House. This ID will then need to be shared with the relevant land registry (depending on where the land is situated in the UK) whenever the overseas entity buys, sells, transfers, leases or charges land in the UK. The overseas entity will need to update its information every year."
        },
        {
            "text": "After registering, the name of the overseas entity and its beneficial owners will be publicly available on the Find and update company information service."
        },
        {
            "text": "Overseas entities who do not register will face severe sanctions such as daily fines and not being able to transact with their land."
        },
        {
            "text": "The Act will apply to land bought since January 1999 in England and Wales, since December 2014 in Scotland, and to land bought from the day the Act comes into force in Northern Ireland. Companies incorporated in the Republic of Ireland fall under the definition of an overseas entity."
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "Work is progressing at pace on the creation of the new register, and Companies House and the UK’s land registries have been collaborating with the Department for Business, Energy and Industrial Strategy (BEIS) to make sure the new register is implemented as soon as possible. We’ve mapped out our key stakeholders and partners and we’re engaging with them regularly to make sure they’re actively involved with the progress of this work."
        },
        {
            "text": "Companies House will soon be writing to all overseas entities captured by the Act who own land in England, Wales and Scotland to make sure they know about their new responsibilities."
        },
        {
            "text": "We intend to launch the Register of Overseas Entities on 1 August 2022, and we’ll publish detailed guidance on GOV.UK soon."
        },
        {
            "text": "We’re delighted to be at the forefront of this landmark milestone for tackling economic crime, and we’ll continue to keep you informed on our progress during the coming weeks and months."
        }
    ]
}