{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/a-history-of-ice-cream-manufacturing-for-the-general-public/",
    "title": "A history of ice cream manufacturing for the general public",
    "authors": [
        "Ellis Davies - Digital Content Manager"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T12:45:13+00:00",
    "content": [
        {
            "text": "Ice cream began as a delicacy reserved only for the extremely wealthy – first appearing in the UK in 1671 at a Windsor Castle banquet. But since then, ice cream has become a treat treasured by all."
        },
        {
            "text": "No one played a bigger role in bringing ice cream out of banquet halls and into the streets for everyone to enjoy than Carlo Gatti. Gatti was, however, faced with a tough task. Without the modern-day luxuries of freezers and ice machines, he and other likeminded culinary entrepreneurs had to store ice cut during the winter from ponds or canals in the coldest spaces they could find within an electricity-less London - underneath the canals!"
        },
        {
            "text": "The large amount of labour needed for this process is what had made ice cream such an exclusive treat. But as these ice distribution networks improved and manufacturing costs lowered, ice cream became more widely available."
        },
        {
            "text": "In the mid-19th century Gatti, for example, began to sell ice cream from his stall at the Hungerford Market in Charing Cross. His signature dish - penny licks - named for their price, quickly became popular amongst the general public who, for the first time, could afford such a luxury."
        },
        {
            "text": "More than a century has passed, and technological changes have made the frozen sweets industry unrecognisable from Gatti’s time. But some things, as they say, never change."
        },
        {
            "text": "The popularity of ice cream is clearly among those constants."
        },
        {
            "text": "According to the Companies House register, there are 701 companies currently manufacturing ice cream in the UK. While some have been around for some time, such as Unilever (since 1937), the industry is expanding rapidly. 64% of all operating ice cream manufacturers have been incorporated since 2015, with 222 of those since 2020."
        },
        {
            "text": "Despite the historical reputation of ice cream as a seaside treat, much of the recent increase in registrations has been fuelled by companies registered in London*, with a quarter (24%) of registrations coming from the capital."
        },
        {
            "text": "While Gatti may receive much of the credit for the popularity of ice cream among the general public, the industry now has many similarly creative cold treat connoisseurs who would give him a run for his money. They've helped to turn penny licks into iconic desserts such as the knickerbocker glory and they're keeping ice cream relevant in today’s social media age."
        },
        {
            "text": "London based Ruby Violet is a prime example of these new-age ice cream pioneers."
        },
        {
            "text": "Far from the penny-licks of the past, companies such as Ruby Violet bring glamour to the world of ice cream. They make it a truly Instagram-worthy treat and keep people coming back for seconds (or thirds), more than a century after Carlo Gatti helped introduce ice cream to the UK public.   "
        },
        {
            "heading": 2,
            "text": "Spotlight on Ruby Violet"
        },
        {
            "text": "From its humble beginnings as a once-a-week market stall in Tufnell Park to now having multiple parlours across London, Ruby Violet was aided by owner and founder Julie Fisher’s keen eye, developed through her background in photography."
        },
        {
            "text": "Having camera ready creations even influences the type of ice cream made by Ruby Violet."
        },
        {
            "text": "Though the growing influence of Instagram and other social platforms increases the importance of the ice cream’s appearance, quality remains the primary concern for Ruby Violet. Julie explains the importance of high standard ingredients in their operations."
        },
        {
            "text": "While eye catching style may help in attracting some first-time customers, it’s the dedication to quality ice cream that keeps everyone coming back. This formula certainly seems to be working for Ruby Violet, and thankfully their growth has not halted during the pandemic. Instead it has had rather a different effect. While footfall in the parlours was practically non-existent, Julie’s online ice cream business accelerated and is now booming."
        },
        {
            "text": "Ruby Violet is adapting and developing in light of recent events and is even preparing to move into a brand-new production unit in Marston Moretaine to keep up with demand. Good news for those with a sweet tooth. It seems that ice cream might just be the perfect pick-me-up to provide much needed comfort in these perplexing times."
        },
        {
            "text": "*Interpreting data note: this does not necessarily mean that they are ‘London companies’ as many companies have registered addresses which are not their main office."
        }
    ]
}