{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/an-analysis-of-the-first-letter-of-live-company-names-in-the-uk/",
    "title": "An analysis of the first letter of live company names in the UK",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T12:45:50+00:00",
    "content": [
        {
            "text": "Where do great companies start? Is it with the seed of the first idea? The first product? The first sale? Who’s really to say? But, in the most literal sense, all companies, regardless of size, start with the first letter of their first word."
        },
        {
            "text": "Did Apple start with a computer built in Steve Jobs’ garage or with the letter A? Again, who’s really to say?"
        },
        {
            "text": "It's interesting and insightful to look into that first letter and pull out some trends. To do so, the first letter of each company incorporated in the UK for every year from 1980 to 2020 and still live or in-business was aggregated."
        },
        {
            "text": "But, sadly, not all letters are created the same. More companies would naturally start with A than Z, for example, because far more words start with A than Z. To account for this, the entire English dictionary underwent a review to determine the percentage of words in the English language that begin with each letter. This allows for the comparison of company beginning letters to the word beginning letters in the English language, thus revealing which letters are more popular with live companies than in everyday use."
        },
        {
            "text": "Here's how 2020 looked:"
        },
        {
            "text": "Some interesting trends over time emerged. A, with its advantage of permanent front of the line status, has consistently been even more popular with live companies than in the whole English language. The same, however, cannot be said for the other vowels stuck behind A."
        },
        {
            "text": "I, O, and U were all significantly less popular amongst live companies, and E has jumped back and forth between being slightly less and slightly more popular with live companies over the last few decades."
        },
        {
            "text": "S and C, the 2 most common starting letters in dictionary also made up large proportions of the first letter of company names, though neither has quite lived up to its popularity in the English language."
        },
        {
            "text": "P, the third most popular starting letter in the English language, has received a similar treatment - appearing far less at the start of company names than at the start of words."
        },
        {
            "text": "While S and P have always been underrepresented among companies, C has fallen out of favour more recently. Until the mid-90s C was just as popular with live companies as it was in words, but has been on the decline ever since."
        },
        {
            "text": "K, J and T have been some of the most popular letters among live companies in comparison to their normal usage. T has, however, been on a steady decline since the 90s, while use of J and K has been increasing steadily upwards over the last few years."
        },
        {
            "text": "In contrast to the logic behind A’s popularity, many of the letters at the end of the alphabet are on track to being trendy. V, X, Y, and Z have all had small lifts in popularity in recent years. Who knows, maybe they’re onto something?"
        },
        {
            "text": "Check below and see where your company lines up in our Companies House alphabet."
        }
    ]
}