{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/analysing-the-age-demographics-of-business-sectors-in-the-uk/",
    "title": "Analysing the age demographics of business sectors in the UK",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T12:45:17+00:00",
    "content": [
        {
            "text": "Every time a company registers in the UK, Companies House collects and stores data on that company. Information such as standard industrial classification (SIC) codes allows for the sorting of companies based on their sector. It's a very helpful tool in identifying business trends in the UK."
        },
        {
            "text": "Information on the individual registering the company is also collected, making it possible to analyse the age demographics of every commercial sector in the UK. To do this, each sector is broken down by the share of company directors for each age."
        },
        {
            "text": "Once this data is created, a quick analysis of various age groups - younger (18 to 39), middle aged (40 to 59) and older (60+) reveals some interesting trends."
        },
        {
            "text": "Companies specialising in computer games and retail are among the most likely to be led by younger people, while companies in the medical and legal fields are frequently led by middle aged businesspeople. The live companies most often run by older people are, on the other hand, spread across a variety of diverse sectors."
        },
        {
            "text": "As evidenced by 2 fashion related SIC codes appearing in the top 5 industry sectors for under 40s, and 3 out of the top 5 for 18 to 24 year olds, the generation gap is particularly notable in fashion and related companies."
        },
        {
            "text": "On the whole, fashion companies, particularly those relating to apparel, have a greater proportion of young directors. This is perhaps a result of young fashion entrepreneurs being empowered by social media."
        },
        {
            "text": "Fashion stalls/markets and menswear stand out as being significantly lead by young directors with 3 quarters (72%) of directors of retail sale via stalls and markets of textiles, clothing and footwear companies are under 45."
        },
        {
            "text": "Other company types within the fashion sector also had a high proportion of young directors - 61 to 62% of companies focusing on the retail sale of clothing in specialised stores; agents involved in the sale of textiles, clothing, fur, footwear, and leather goods; or the manufacture of men’s outerwear have directors under the age of 45."
        },
        {
            "text": "Like fashion, the computer game publishing industry is filled with companies led by young directors. In fact, computer game publishing had the highest rate of directors under 40 – nearly two thirds (62%). A considerable proportion of them, representing more than a quarter (27%) of computer game publishing companies, were under the age of 30. This is further highlighting the important role that young business leaders have in the industry."
        },
        {
            "text": "To better understand the importance of the younger generation in business, we spoke with designer and illustrator Guy Warley. After spending a decade working in the design department for the Guardian Newspaper, Guy made the transition to freelance work. After an initial period of purely agency-based work, his illustration career took a flourishing turn, transforming his lifelong interest in fantasy, sci-fi and history into paid work - including computer games."
        },
        {
            "text": "Guy attributes winning the Barbican Centre’s Into the Unknown illustration competition as facilitating his entrance into the video game industry. But he also credits social media as having played a significant role in the process."
        },
        {
            "text": "Guy’s work received an even wider reaching audience on social media when film director Guillermo del Torro retweeted his illustration Ancient Jaeger to his nearly 2 million followers. As you can imagine, he “gained quite a few followers that day.”"
        },
        {
            "text": "The ability of social media to connect like-minded creatives is invaluable in the computer game industry, owing to its collaborative nature. As Guy notes, computer games are “a very collaborative way to work [involving] not just the artist but writers and programmers as well.”"
        },
        {
            "text": "Guy’s insights suggest that the high rate of young directors in computer game publishing companies is not the product of a few young trailblazing executives creating change from the top down. Rather, a large network of talented, young, creative minded workers in the computer game industry are taking advantage of new technology, including social media, to connect and collaborate in building brave new (virtual) worlds."
        },
        {
            "text": "The opportunities for young people interested in computer game are continuing to expand. Guy notes that \"there are definitely more opportunities now than when I was leaving college to work in video games” and dispenses advice to those interested in computer and video games."
        },
        {
            "text": "Because, after all, who knows who Guillermo del Toro might retweet next!"
        }
    ]
}