{
    "url": "https://aphascience.blog.gov.uk/2022/01/31/clinical-practice-to-government-veterinary-surveillance/",
    "title": "Why I moved from clinical practice to government veterinary surveillance",
    "authors": [
        "Leanne Forde"
    ],
    "categories": [
        "Careers",
        "Women in science"
    ],
    "pub_date": "2022-01-31T10:32:40+00:00",
    "content": [
        {
            "text": "Eight months in and Leanne Forde is relishing her new career as a Veterinary Investigation Officer at APHA Thirsk. Read more about Leanne’s veterinary career and how she is enjoying her new challenge!"
        },
        {
            "text": "I was born and bred in York and I have wanted to be a vet for as long I can remember. A lot of little girls want to be a vet, but I never grew out of it. I began seeing practice at my local vets at the age of 14 and this made me more determined to become a vet."
        },
        {
            "text": "I worked on a sheep farm throughout university and realised my passion for livestock health. I graduated from Liverpool Vet School in July 2012 and went straight in to mixed practice in North Yorkshire."
        },
        {
            "text": "A mixed practice job in rural North Yorkshire; an opportunity to live the James Herriot lifestyle. My first job really was what most new graduate vets dream of: hit the ground running and go from calving cows to vaccinating kittens and trotting lame horses. I realised very quickly that I had a real passion and enthusiasm for farm animal practice as I enjoyed getting stuck in and chatting to farmers. It did not feel like work going to a farm call and I got a real buzz."
        },
        {
            "text": "After two years in mixed practice, I took the plunge into ruminant only practice. I did over six years in farm animal practice mainly focusing on beef and sheep work. I was very lucky to have very proactive clients who wanted to investigate issues on their farm and focus on preventative health. During this time, I did a four-month secondment to APHA Thirsk as a Veterinary Investigation Officer (VIO) and found it fascinating. I had already been doing on-farm post-mortem examinations (PMEs) as an adjunct to herd and flock health planning so jumped at the chance for more training."
        },
        {
            "heading": 3,
            "text": "An opportunity came along"
        },
        {
            "text": "I thoroughly enjoyed my secondment and was so impressed with the team spirit at the Veterinary Investigation Centre (VIC) and the variety of cases coming through. Four years later when a permanent role came up at Thirsk to be a VIO, I had to go for it!"
        },
        {
            "text": "It was a difficult decision to leave clinical practice as I thoroughly enjoyed the day-to-day work and the client relationships, but I could not miss the opportunity to pursue my pathology interest and contribute to national surveillance."
        },
        {
            "heading": 3,
            "text": "Working as a VIO"
        },
        {
            "text": "I have been working as a VIO for eight months now and every day I realise how diverse this role is and how many avenues can be taken. As a practicing vet, I initially thought the VIO role was mainly based on PMEs but I have realised it is so much more, and includes membership of Species Expert Groups (SEGs), advisory farm visits, data analysis, disease consultancy as well as other specialist functions."
        },
        {
            "text": "In relation to PMEs, we are providing a service to local vet practices and farmers. Cases are referred to us from the local area, so it is important we maintain good relationships with local vets to gain surveillance material. Carcasses can be brought to us by the farmers, or some may be eligible for free carcass collection. I enjoy talking to farmers and as I used to work with some of them in practice and it is nice to have that familiarity and a catch up."
        },
        {
            "text": "From day one as a VIO, I have been on a steep learning curve, as this role builds on my veterinary practice expertise but also requires a new set of skills unique to being a VIO. In addition to the training programme offered to VIOs, I have also been very lucky to have supportive colleagues at Thirsk who are willing to share their expertise, and the wider network of SEGs are always on hand to support us with cases. When dealing with complex cases it is always good to have a collaborative approach."
        },
        {
            "heading": 3,
            "text": "My role in veterinary surveillance"
        },
        {
            "text": "When conducting investigations on diagnostic material, not only do we aim to get a diagnosis for the private vet so that issues can be solved on their clients’ farms, but the material submitted for diagnostic investigations also underpins other surveillance activities. For example, all abortions for cattle, sheep and pigs are screened for the relevant Brucella species, as part of our statutory disease surveillance."
        },
        {
            "text": "Surveillance testing can also be undertaken to investigate potential new and emerging disease threats. One example being enhanced surveillance for myocarditis (heart inflammation) due to a newly discovered virus, porcine circovirus 3 in pigs submitted for PME."
        },
        {
            "heading": 3,
            "text": "It could be a zebra"
        },
        {
            "text": "When conducting a PME as a VIO, you always need to consider notifiable diseases. From my time at Liverpool Vet School, it was always drilled into us that we did not want to be the vet who missed a case of notifiable disease."
        },
        {
            "text": "There is the famous saying, “if you hear hooves, think horse, not zebra.” Which means you should think about the more likely diagnosis. However, a much-esteemed lecturer at Liverpool once told my year group, “if you hear hooves, it is probably a horse, but it could be a zebra, never forget that.”. This modification of the saying is the one I always have in mind in the post-mortem room. We always need our eyes and ears open to the possibility of notifiable diseases."
        },
        {
            "heading": 3,
            "text": "Putting together pieces of the puzzle"
        },
        {
            "text": "As a fledgling VIO, I have lots of questions and curiosities, but there is plenty of support available to discuss cases. Within our team at Thirsk, we have regular discussion about cases and the wider network of colleagues across England and Wales is also very approachable."
        },
        {
            "text": "All the data from our PMEs and further testing is put on to a national database and analysed by our epidemiologists and species expert group leads to determine new trends and emerging threats. This information can be used to inform the relevant industries. You may be interested in reading one of our previous blogs by Veterinary Epidemiologist, Phil Jones, as he talked about how APHA is looking to exploit new data sources to support its scanning surveillance activities to look for new animal disease threats."
        },
        {
            "text": "Working as a government vet is very different to clinical practice and is an exciting new challenge in an interesting veterinary career."
        }
    ]
}