{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/how-bookstores-are-making-a-comeback-in-the-uk/",
    "title": "How bookstores are making a comeback in the UK",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T12:45:42+00:00",
    "content": [
        {
            "text": "Owing to their ubiquity and archaic origins, it's hard to imagine a world without books or a time before their invention. And for much of their history, booksellers have been among the primary means of disseminating books among the public."
        },
        {
            "text": "In the UK, which has a storied literary history, the oldest surviving bookseller, the Protestant Truth Society, is celebrating its 100th birthday this year."
        },
        {
            "text": "John Kensit founded the Protestant Truth Society with the intention of providing his community with what, in his view, was information vital to the spiritual wellbeing of his community."
        },
        {
            "text": "Though most modern booksellers do not have any religious affiliation, the legacy of booksellers helping their communities lives on. From local reading groups and spaces for community meetings to talks by favourite authors - booksellers have long provided a variety of services far beyond what typical high street retailers offer. This, however, has not protected booksellers from the rise of e-commerce giants such as Amazon."
        },
        {
            "text": "As e-commerce grew in the early and mid 2000s, fewer booksellers were opening up. From 2000 to 2003, an average of 272 new booksellers were incorporated in the UK per year - by 2012 to 2015 the average had dropped all the way to 85."
        },
        {
            "text": "Independent bookstores were hit particularly hard. Between 1995 and 2021, the number of independent booksellers in the UK was cut almost in half, falling from 1894 to 967."
        },
        {
            "text": "Despite decades of consistent decline, recent years have given reason to hope for the industry. 152 new booksellers opened in 2018 and are still in operation, with this number growing to 167 in 2019."
        },
        {
            "text": "Independent bookshops have furthermore been a part of this rebound, as their numbers have stopped shrinking and have even experienced a small growth in the last few years."
        },
        {
            "heading": 2,
            "text": "Spotlight on Round Table Books"
        },
        {
            "text": "Round Table Books is among these new independent bookstores. Located in the diverse London neighbourhood of Brixton, it made its start as a pop-up shop in 2019 by Aimée Felone and David Stevens."
        },
        {
            "text": "After the success of the pop-up store, with crowdfunding and support from the local community, Round Table Books was born. Aimée and David believe that their success stems from sharing “inclusive, diverse titles across race, gender, socioeconomic background, sexuality and ability” with readers."
        },
        {
            "text": "Though only a few years old, Round Table Books joins the century old Protestant Truth Society in its dedication to the local community."
        },
        {
            "text": "Though 2020 has presented many challenges for independent bookstores, Round Table Books has continued to show its value and connection to the community by changing the way they work with customers by offering support through email and social media. Aimée and David explain this transition:"
        },
        {
            "text": "The process of buying books online, in both physical and digital e-book formats, is more convenient than ever. Yet in the past few years booksellers have managed to minimise the shrinkage of their industry. Perhaps those such as Round Table Books have shown that their value extends far beyond mere convenience, that, despite the unmatched inventory of online retailers, bookshops still offer something that their internet rivals cannot: a connection to the community."
        },
        {
            "text": "And while we cannot necessarily make an in-person trip to our local bookshops in these more restrictive times, there are still ways to 'support local' while you 'stay safe'. Various e-commerce sites, such as hive.co.uk, have been set up to support independent bookshops with every sale, helping to make sure that our beloved bibliopoles withstand these testing times."
        }
    ]
}