{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/how-communities-have-helped-public-houses-and-bars-in-the-uk/",
    "title": "How communities have helped public houses and bars in the UK",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T12:45:26+00:00",
    "content": [
        {
            "text": "In some pubs, the centuries of rich history can almost be heard in the creak of the floorboards. Others have sleek modern designs that resemble science fiction movies."
        },
        {
            "text": "There are - or at least there used to be - the pubs that pack in people tight like sardines to watch the big game, where the smell of sweat might even overpower the bouquet of beer. Then there are the pubs with cosy alcoves perfect for a romantic chat or a good read."
        },
        {
            "text": "Some will have novel length menus with award winning craft ales and complex cocktails, whereas others have reduced their menus down to a select few tipples. Some have even removed alcohol entirely from their menus."
        },
        {
            "text": "The list of differences could go on and on - no 2 pubs are alike and they will always defy our attempts to define them."
        },
        {
            "text": "But if design, history or alcohol are not the threads connecting all pubs, what is? The answer, as the British Beer & Pub Association would have it, is people and the art of being together."
        },
        {
            "text": "A place to come together, to celebrate and mourn, to reunite with old friends and make new ones, to sing and dance, to raise awareness and support communities. And, perhaps, if it's your style, a place to drink."
        },
        {
            "text": "These community institutions are so commonplace in the UK they often seem part of the landscape itself. There are currently 33,410 live companies registered as ‘public houses and bars’ in the UK*."
        },
        {
            "text": "The eldest of them became incorporated in 1861 and is joined by 23 other 'relics' from the 19th century that remain in operation, including the Heavitree Brewery PLC, a family owned tenant and lease pub company dating back to 1790. It was first incorporated in 1890 and now has more than 70 public houses in its estate."
        },
        {
            "text": "Do not, however, be fooled into thinking that 'geezers' have a hold on the industry. It's constantly growing with an infusion of fresh blood. The number of ‘public houses and bars’ incorporated has, for example, grown each year for the past decade and continues to outnumber those dissolved each year."
        },
        {
            "text": "The Rose in June, located in the seaside town of Margate, is among those pubs providing new life to the industry. Though the Rose has been around for some time, it underwent changes when Deke Eichler took over its operations in 2019. Deke’s lifetime experience and family history of working in pubs has given him an understanding of the role that pubs can play in a community, even as it evolves."
        },
        {
            "text": "It's with this knowledge that he's looked to reinvigorate the 'unloved' Rose in June."
        },
        {
            "text": "Sadly, The Rose in June, like countless other pubs, is faced with uncertainty owing to the effects of the COVID-19 pandemic, but Deke reveals it’s not all doom and gloom. He believes the recent events have actually had some positive effects, in that punters have realised just how important their ‘local’ is to them."
        },
        {
            "text": "Rather than making sweeping transformations in light of the pandemic (other than those as a result of new health and safety regulations), Deke thinks that remaining familiar and true to their roots as a cornerstone of the community is the best way forward:"
        },
        {
            "text": "Though recent events have shaken the hospitality industry, pubs have long faced a challenging, unforgiving environment. It would be a mistake to assume that running a pub is an easy business. Many of the new pubs popping up have a tough time becoming established and the average live pub company has been around for just 6 years."
        },
        {
            "text": "Though pubs face a tough market, as evidenced by their short lifespan, and even more so in today’s current climate, the people they bring together and the communities they serve have recently been stepping up and saving their local institutions."
        },
        {
            "text": "Though nearly all pubs (99%) remain registered as private limited companies, there has been an increase in community interest companies. The first pub was registered as a community interest company in 2004 and 64 others have since followed suit. There has, been a dramatic increase in community interest pubs in the last few years, with 75% of all pubs registering as community interest companies having done so since 2017."
        },
        {
            "heading": 2,
            "text": "\nSpotlight on The New Inn"
        },
        {
            "text": "The community driven approach to pubs has risen to such prominence that the Plunkett Foundation now supports a network of 150 community owned pubs. Plunkett was created over a century ago in 1919, with a simple aim - to make communities a better place to live. They do this by implementing sustainable initiatives (often in more rural areas), known as community businesses, which come in the form of shops, cafes, pubs and many more."
        },
        {
            "text": "Through their government funded More than a Pub (MTAP) programme, Plunkett Foundation provides many valuable resources and business development support to community owned pubs throughout the UK. Of recent note, the programme has provided small grants to around half of all community pubs in England during the COVID-19 lockdown and to date, MTAP has helped 61 pubs into community control, with hundreds of others expressing interest in the scheme."
        },
        {
            "text": "Among such pubs is The New Inn, located in the small hilltop village of Norton Lindsey, Warwickshire. In 2016, the town’s only pub was under threat of being purchased by property developers. With an older population and its remote location, Norton Lindsey is at severe risk of social exclusion. Worried about the prospect of losing a valuable community asset, residents of Norton Lindsey - dubbed the 'Salvation Squad' - came to action. Through help from Plunkett Foundation and the MTAP scheme, they were able to make sure that the pub would remain a part of the community."
        },
        {
            "text": "Rob Brooke, local resident and chairman of Norton Lindsey Community Pubs says:"
        },
        {
            "text": "Having evolved into a community hub, now also including a café and a local shop, The New Inn is a cornerstone of the village and the main meeting spot for local residents. Rob Brook says:"
        },
        {
            "text": "With the term being an abbreviation of 'public house', it seems that pubs have reverted to their true meaning. So much more than just a watering hole, pubs, such as The Rose in June and The New Inn, continue to serve a vital role in communities - a place to socialise, access local services and pursue hobbies and interests."
        },
        {
            "text": "Pubs and the communities they belong to will seemingly continue to adapt so that these valued spaces remain accessible, particularly in times when perhaps they are needed more than ever. According to the British Beer & Pub Association:"
        },
        {
            "text": "*Note: this does not refer to the total number of pubs in the UK. It includes a broader range of organisations from chains, such as Wetherspoons, which have hundreds (or thousands) of pubs, social clubs/cinemas/events spaces that have a bar but selling alcohol is not their primary function, through to small independent pubs."
        }
    ]
}