{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/31/learning-development-offer/",
    "title": "Our Learning & Development Offer",
    "authors": [
        "GSE Profession"
    ],
    "categories": [
        "GSE Offer"
    ],
    "pub_date": "2022-01-31T06:00:45+00:00",
    "content": [
        {
            "text": "The GSE Profession has been working to improve our Learning and Development offer to ensure it is as useful and rewarding as possible to our members. The Profession aims to build science and engineering capability across government, providing guidance and support to scientists and engineers to continue their development to ensure these skills are embedded within Government. In this article, we hope to provide a one-stop shop to highlight existing and upcoming additions to the Learning and Development offer."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "GSE Induction Pack"
        },
        {
            "text": "This new  Induction Pack is designed to help new and existing members integrate into our community quickly, access key resources, understand the Profession’s work, and the work of our members."
        },
        {
            "text": "The new product will contain several key products, including:"
        },
        {
            "text": "If you are a new, returning, or existing member we’re sure you will find the Induction Pack an indispensable resource. You can access the new Induction Pack in our Knowledge Hub Library. If you are not a member of the GSE Profession on Knowledge Hub yet, you can join here."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "GSE Profession Recognition Offer"
        },
        {
            "text": "The GSE Profession launched a new professional recognition offer in September 2021. Regardless of where you are in your career (whether early career or more experienced) and no matter what your role (whether you’re a generalist or a specialist), the offer aims to support you to achieve professional recognition with external institutions."
        },
        {
            "text": "The GSE profession have partnered with various science and engineering professional institutions to provide you with direct links and support in becoming professionally recognised. This support ranges from signposting information on what it means to become a member or chartered, to advice on getting funded in your application. This is part of the profession’s wider aim to recognise the inspiring and talented skillsets and experience of our GSE members."
        },
        {
            "text": "We have created the GSE recognition offer booklet which contains more information about each institution, how you can record your developed competencies, and support on getting your application funded."
        },
        {
            "text": "Read more here in our blog post and fill in this simple form we’ve created for you to access the GSE recognition offer support booklet."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "GSE Career Framework"
        },
        {
            "text": "The Government Science and Engineering (GSE) Career Framework sets out a standard for careers across GSE. It explains the technical skills, knowledge and experience required to be an effective scientist or engineer in government. This framework links to Civil Service Success Profiles, and groups GSE roles into job families."
        },
        {
            "text": " "
        },
        {
            "text": "GSE technical skills"
        },
        {
            "text": "The GSE career framework defines the skills that all scientists and engineers working in government should align their development to. We developed these skills in collaboration from members across government organisations and aligned to competencies required by Science and Engineering Councils. They are grouped these into five skill areas:"
        },
        {
            "text": "By working towards competency in these skills should provide a solid foundation when applying for accreditation from external profession bodies. For more information including a breakdown of GSE job families, please take a look at the Career Framework here."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Skills Assessment Tool"
        },
        {
            "text": "The Skills Assessment Tool is an online, interactive, personal development tool for all our members which supports your career aims, skills, and learning. It provides an easy way of tracking your skills development against the GSE career framework technical skills including a space to record your evidence, a way for you to flag to others in government your technical expertise and a catalogue of relevant GSE-related learning opportunities."
        },
        {
            "text": "The GSE profession has a network of GSE L&D Champions who represent over 15 departments/organisations across government. Their primary role is to lead on the promotion and embedding of the GSE skills assessment tool in their organisation. A full list of departments can be found in our newsletter(LINK)."
        },
        {
            "text": "If you’ve not yet signed up for the tool, please do complete this quick form, and you will be sent your log in details via email."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Science and engineering 101 (S&E101) "
        },
        {
            "text": "This is a suite of introductory learning collated by the GSE profession designed to increase science and engineering literacy across government. It fulfils strands 1 and 2 of the New Curriculum and Campus for Government Skills, namely foundation level learning and essential skills for working effectively in government."
        },
        {
            "text": "S&E101 is made up of 3 components:"
        },
        {
            "text": "For more information, please click here."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Systems Thinking Apprenticeships"
        },
        {
            "text": "Systems thinking approaches is one of the GSE technical skills included in the GSE career framework and is a problem-solving approach which views 'problems' as part of a wider, dynamic system. The GSE Profession help promote two exciting postgraduate level apprenticeships in this area: Systems Thinking Practice, and Systems Thinking (MSc Systems Thinking in Public Service)."
        },
        {
            "text": "These apprenticeships are fantastic development opportunities to apply systems thinking to complex problems or systems you encounter at work. The application of system thinking is very broad, and examples include providing joined-up health and social services, developing sustainable international food production and supply systems, developing combined diplomatic and military options for unstable regions, and addressing climate change."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Stem Futures "
        },
        {
            "text": "STEM Futures is an established partnership of 21 organisations across industry, academia, and the public sector. The aim of this partnership is to support individuals working in STEM roles with the development of technical skills, knowledge and experience through on-the-job learning via placements supplemented by education. This also enhances personal networks and reduces training costs."
        },
        {
            "text": "The partners provide short term secondments and training to develop STEM individuals, currently aligned to seven technical hubs (subject-based communities of interest/practice) in: data, quantum, reliability, sensing, space and WOME (weapons, ordnance, munitions, energetics explosives)."
        },
        {
            "text": "More information and detail on the technical partners and hubs can be found in this promotional brochure here. Note: the hubs also include a new 7th hub on Systems Thinking."
        },
        {
            "text": " "
        },
        {
            "text": "The GSE team within GO-Science have worked extensively to put together a progressive and invaluable learning and development offer to ensure the advancement of science and engineering capability within the Profession and across government. As a Profession we aim to continually improve and evolve the learning and development offer and welcome suggestions and feedback to ensure it meets the needs of our members. If you have any questions/ feedback or would like support accessing any of the products, please contact gse@go-science.gov.uk."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Explore other areas of the GSE Profession's Offer"
        },
        {
            "text": " "
        }
    ]
}