{
    "url": "https://teaching.blog.gov.uk/2022/01/31/managing-staff-shortages-in-a-send-school/",
    "title": "Managing staff shortages in a SEND school",
    "authors": [
        "Matt Rooney"
    ],
    "categories": [
        "Attendance",
        "COVID-19 support",
        "SEND"
    ],
    "pub_date": "2022-01-31T10:09:17+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Matt Rooney is the Principal of St Giles School in Retford. In this blog, he shares how his staff are working together and with parents/carers, local authorities and agencies to keep supporting their students in the face of increased staff absences."
        },
        {
            "text": "Our pupils love coming to school, and their parents and carers want them to be in school too!"
        },
        {
            "text": "Throughout the pandemic we have had to manage staffing very carefully and at times, we’ve had several staff off because of Covid related issues. So far, our planning and operational guidance has meant we have been able to stay open for all pupils and learning has continued in all classes for all children. Over the last 2 years, our pupil attendance rates have been very high."
        },
        {
            "text": "During the early part of the pandemic, we established some key principles that would allow us to keep the school open and continue to support our students and their families; namely to follow COVID-19 guidance to keep our pupils, staff and classrooms as safe as possible and to work collaboratively with our wider school community."
        },
        {
            "text": "We have achieved this by:"
        },
        {
            "text": "As we approached the end of the autumn term, we recognised that the Omicron variant could impact pupil attendance and staffing levels. So we put plans in place to mitigate any risks, including:"
        },
        {
            "text": "However, supporting the individual needs of each pupil is more nuanced than the ratio of staff to pupils. We have worked to match pupil needs with the knowledge and skills of our workforce by:"
        },
        {
            "text": "Finally, we have been clear with pupils, parents and carers that we will continue to do our best to provide all the learning, experiences and services their children deserve, and I am grateful for their continued support and patience as we steer through the next half-term together!"
        },
        {
            "text": "Get support for COVID-19 related absences"
        },
        {
            "text": "The workforce fund has re-opened to support schools and colleges facing significant staff absences and financial pressures. Read the guidance for schools and colleges. We have also updated this resource to support you in managing staff absences."
        },
        {
            "text": "Remote education guides can be found on the EdTech Demonstrator resource page, and filter the resources by ‘remote learning’ and ‘newest first’. "
        },
        {
            "text": "There are also plenty of existing resources available through the Ed Tech demonstrator programme. "
        }
    ]
}