{
    "url": "https://civilservicelocal.blog.gov.uk/2022/01/31/one-south-west-civil-service-careers-showcase-3/",
    "title": "One South West Civil Service careers showcase",
    "authors": [
        "Angela Fisher"
    ],
    "categories": [
        "South West England"
    ],
    "pub_date": "2022-01-31T14:43:56+00:00",
    "content": [
        {
            "text": "On Monday 7 March we will be hosting an event for Civil Servants, which will showcase four departments in the South West."
        },
        {
            "text": "Following an introduction from senior leaders in the Rural Payments Agency, Crown Prosecution Service, National Crime Agency and HM Revenue and Customs, there is the opportunity to be involved in discussions with members of staff from those departments, to find out what it is like working there."
        },
        {
            "heading": 4,
            "text": "Background"
        },
        {
            "text": "This is the second in a series of virtual events to highlight the range of departments and career paths available in the Civil Service. It will provide a chance to find out more about people's roles in other departments and create connections."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Date and time"
        },
        {
            "text": "7 March 2022"
        },
        {
            "text": "11:00am to 13:00pm"
        },
        {
            "text": "This is a virtual event on Microsoft Teams."
        },
        {
            "text": "The event begins with an introductory session at 11:00 am when you will hear from senior civil servants in the region. You will then be able to join two of the four departmental discussion groups of your choice at the following times:"
        },
        {
            "text": "There is a limit of 50 delegates for each of the discussion groups, so you may not get your first choice, but there will be future events you can attend."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Further information"
        },
        {
            "text": "If you have any questions please email cslocalsouthwest@cabinetoffice.gov.uk"
        },
        {
            "text": " "
        }
    ]
}