{
    "url": "https://rpc.blog.gov.uk/2022/01/31/regulatory-policy-committee-welcomes-new-members/",
    "title": "Regulatory Policy Committee welcomes new members",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2022-01-31T13:54:49+00:00",
    "content": [
        {
            "text": "The RPC committee and secretariat are very pleased to welcome five new committee members who joined the RPC on 31 January 2022 following an open competition process. We are also delighted that Andrew Williams-Fry, who has been on the committee since June 2018, has been re-appointed as a committee member for a second term."
        },
        {
            "text": "Stephen Gibson, RPC Chair said: “Our new members bring a wealth of highly relevant experience to the RPC committee. This is an exciting time for the RPC with the potential for changes to our role arising from the Government’s current review of the Better Regulation Framework. I look forward to working with the new and existing members as the committee implements the changes required from the framework review and to continue the RPC’s important independent scrutiny role to improve the quality of evidence and analysis underpinning regulatory decisions.”"
        },
        {
            "text": " "
        },
        {
            "text": "Our new members are:"
        },
        {
            "text": "Daniel Dalton"
        },
        {
            "text": "Dan was a Member of the European Parliament between 2015-2019 representing the West Midlands and had previously worked in the European Parliament for a decade as an advisor on several parliamentary committees."
        },
        {
            "text": "He is also a previous CEO of the British Chamber of Commerce EU/Belgium in Brussels and is currently a senior advisor for Rud Pedersen and is on the Advisory Board of Allied for Startups."
        },
        {
            "text": " "
        },
        {
            "text": "Stephen Gifford"
        },
        {
            "text": "Stephen Gifford is an economist with 30 years of professional experience across the public and private sector. Stephen has expertise in economic regulation, competition, economic policy, economic appraisal, evaluation, economic impact analysis, econometrics, transport economics, regeneration, macroeconomics and infrastructure."
        },
        {
            "text": "Stephen is currently the Chief Economist of the Faraday Institution, Commissioner of the National Infrastructure Commission for Wales and Board Member of the Ulster University Economic Policy Centre. He was previously the Chief Economist at Grant Thornton, the Director of Economics at the CBI and held various senior economist roles at KPMG, Oxford Economics, Civil Aviation Authority and the Prime Minister's Strategy Unit."
        },
        {
            "text": " "
        },
        {
            "text": "Hilary Jennings"
        },
        {
            "text": "Hilary is an independent consultant specialising in competition and regulation. Her core work is in providing best practice advice to competition authorities and government departments, particularly in emerging economies, and working with organisations such as the OECD, the World Bank and the European Commission."
        },
        {
            "text": "She previously held senior roles at the OECD and the UK’s Office of Fair Trading, as well as in the private sector."
        },
        {
            "text": " "
        },
        {
            "text": "John Longworth"
        },
        {
            "text": "John Longworth is a businessman and entrepreneur. He was originally a scientist and spent most of his career in consumer goods and food corporates doing business in the UK and around the globe."
        },
        {
            "text": "He co-founded a science-tech business of which he was Chairman, and has represented the business community as spokesperson for the CBI, as Director General of the British Chambers of Commerce, and most recently as Chairman of the Independent Business Network of family businesses. He was Chairman of the Vote Leave Business Council and Co- Chairman of Leave Means Leave."
        },
        {
            "text": "At the same time, he has contributed to public life as a Health and Safety Commissioner, Panel Member of the Competition Commission, Director of an NHS Trust, NED of charities and as an MEP."
        },
        {
            "text": " "
        },
        {
            "text": "Derek Ridyard"
        },
        {
            "text": "Derek is a professional economist with interests in competition, regulation and public policy. He started his career in the UK Government Economic Service before working for 15 years as a consultant in the London office of microeconomics consulting firm NERA, where he headed up the firm’s European competition practice."
        },
        {
            "text": "In 2002, he co-founded RBB Economics, which is now a leading firm in the provision of expert economic advice to firms involved in competition law and related matters, with offices in multiple locations across Europe, and in South Africa and Australia."
        },
        {
            "text": "He ceased his consulting activities in 2018 when he became a Member of the UK Competition Appeal Tribunal."
        },
        {
            "text": " "
        },
        {
            "text": "And re-appointed for a second term:"
        },
        {
            "text": "Andrew Williams-Fry"
        },
        {
            "text": "Andrew is a regulatory and competition economist and has worked from the C-Suite in major corporates. Over the last 14 years, he has led regulatory representation for five companies in financial services, aviation and utilities, leading 14 multi-year regulatory reviews. Andrew has been a Board Member in financial services, and is also an adviser to regulated companies and to the Office for Rail and Road. He has been a member of the RPC since June 2018."
        }
    ]
}