{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/31/reward-offer/",
    "title": "Our Reward Offer",
    "authors": [
        "GSE Profession"
    ],
    "categories": [
        "GSE Offer"
    ],
    "pub_date": "2022-01-31T06:00:43+00:00",
    "content": [
        {
            "text": "Recognition and Reward Offer Blog"
        },
        {
            "text": "On this page we have signposted the Recognition and Reward offers which are available to members within the GSE regardless of your department of employment. These have been outlined in the following sections:"
        },
        {
            "text": "The GSE Profession launched a new professional recognition offer in September 2021. Regardless of where you are in your career (whether early career or more experienced) and no matter what your role (whether you’re a generalist or a specialist), the offer aims to support you to achieve professional recognition with external institutions."
        },
        {
            "text": "The GSE profession have partnered with various science and engineering professional institutions to provide you with direct links and support in becoming professionally recognised. This support ranges from signposting information on what it means to become a member or chartered, to advice on getting funded in your application. This is part of the profession’s wider aim to recognise the inspiring and talented skillsets and experience of our GSE members."
        },
        {
            "text": "We have created the GSE recognition offer booklet which contains more information about each institution, how you can record your developed competencies, and support on getting your application funded."
        },
        {
            "text": "Read more here in our blog post and fill in this simple form we’ve created for you to access the GSE recognition offer support booklet."
        },
        {
            "text": "The Declaration on Government Reform is committed to ‘reward those who are exceptional in what they deliver for the public’ and ‘incentivise those with deep subject expertise who stay in areas where they add value and continue to develop."
        },
        {
            "text": "The SCS Capability Based Pay Progression Framework (SCS CBPPF) - delivers a new approach that will incentivise exceptional delivery and depth of expertise as part of a cohesive, inclusive and modern approach to enhance attraction and build capability."
        },
        {
            "text": "The GSE SCS CBPPF  has been developed through collaboration with SCS departmental representatives from across GSE, and in consultation with other professions from across government and aligned to the best practice set by Civil Service HR."
        },
        {
            "text": "The GSE Profession Team is currently working with heads of science and engineering professions and departmental leads to understand the high demand science and engineering skills and critical roles that exist at delegated grades.  We want to develop an informed picture across the profession on how we attract, recruit and reward high demand skills. Using the approach of gathering evidence alongside best practice and utilising expertise from Civil Service Human Resources to find solutions to enhance attraction, reward and improve career development for those who stay in these roles."
        },
        {
            "text": "We are really keen to hear from you, our members, about what is important and what you place value on, in terms of recognition. Get in touch with us to share comments and ideas you have about what you might like to see available additionally within the GSE recognition offer."
        },
        {
            "text": "Please contact us via email at gse@go-science.gov.uk."
        },
        {
            "heading": 3,
            "text": "Explore other areas of the GSE Profession's Offer"
        }
    ]
}