{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/standard-industrial-classification-sic-codes-offering-insight-into-the-business-climate/",
    "title": "Standard industrial classification (SIC) codes: offering insight into the business climate",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T12:45:58+00:00",
    "content": [
        {
            "text": "Standard industrial classification (SIC) codes are a useful tool for organising the vast number of companies in the UK."
        },
        {
            "text": "Each company incorporated in the UK chooses a SIC code, or multiple SIC codes noting what industry that company is in. SIC codes provide valuable information about companies in the UK, such as:"
        },
        {
            "text": "Most analysis of SIC codes focusses on one particular SIC code, but many companies have multiple SIC codes. Looking at the pairings provides a more detailed picture of that company and wider trends."
        },
        {
            "text": "An examination of the top 20 SIC code pairings for live companies contains the types of insights that you would expect. For example, many letting companies also buy and sell real estate. And many construction companies that work on domestic buildings also work on commercial buildings."
        },
        {
            "text": "There were, however, more interesting insights to be found beyond the top 20 SIC code pairings. As a whole, public houses and bars are currently experiencing a decline. However, a high rate of live companies registered as both public house/bar and manufacturing suggests that breweries owning and operating their own bar is on the rise."
        },
        {
            "text": "The wealth of data available on the Companies House register can be used to identify trends in SIC code pairings and, for an even more detailed and informative look at business trends in the UK, we can examine those pairings as they have changed through time."
        },
        {
            "text": "The share of live companies with 4 different SIC code pairings each relating to real estate and letting from 2000 to 2020 shows an expected dip in 2008 and the years that followed. But even more notable is the fast recovery they made around 2011. That recovery did not slow down once the industries had returned to their pre-2008 share of live companies. Within a few years, the real estate companies had eclipsed their pre-2008 levels and had a significantly higher share of live companies."
        },
        {
            "text": "Another interesting insight came in regard to the book publishing industry."
        },
        {
            "text": "Online retail giants such as Amazon have completely reshaped the entire book industry, making life more difficult for many independent booksellers and publishers. Live companies incorporated under both the book publisher and retail sale via mail order houses or via internet SIC codes suggests that publishers are putting their inventory online to compete with the likes of Amazon."
        },
        {
            "text": "Data and technology are becoming integral parts of advertisement and market research. SIC code cluster pairings indicated that data driven advertising agencies and market research companies specialising in online surveys are having an increased share of their fields. As with publishers selling their books online, this highlights the importance of technology in today’s world. It also shows the value of being able to process and decipher data."
        },
        {
            "text": "An exhaustive list of all the live companies in the UK, for example, can provide valuable insights into the business climate and its trends, as long as the right expertise and tools are used."
        }
    ]
}