{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/31/talent-leadership-offer/",
    "title": "Our Leadership & Talent Offer",
    "authors": [
        "GSE Profession"
    ],
    "categories": [
        "GSE Offer"
    ],
    "pub_date": "2022-01-31T06:00:42+00:00",
    "content": [
        {
            "text": "The GSE Profession strives to inspire leaders, nurture talent and celebrate diversity. That’s why we offer a range of products, networking and signposting for your talent and leadership development and career progression."
        },
        {
            "text": "\nTALENT"
        },
        {
            "text": "Science and Engineering Fast Stream: The government needs a pipeline of talented people, with diverse skills, scientists and engineers who are creative, versatile, and numerate to deliver on exciting work that will make a difference to the lives of people across the UK. By joining the Science and Engineering Fast Stream, candidates will become part of a modern, vibrant, and active community of science and engineering professionals, who have one goal in common: to give back to the communities they serve. Applications open for the new recruitment round in September 2022."
        },
        {
            "text": "Find out more about the Civil Service Fast Stream here: Civil Service Fast Stream. Find out more about the Science and Engineering Fast Stream here: Science and Engineering Fast Stream"
        },
        {
            "text": "S&T Network\nThe Fast Stream Science and Technology (S&T) Network is a new science and technology-based community run by Fast Streamers, for Fast Streamers. A support network to all Fast Streamers (e.g. generalists) without a technical background but are in STEM based job roles.  The S&T Network provides -"
        },
        {
            "text": "For more information, you can join the monthly newsletter mailing list and can visit the Fast Stream Intranet page."
        },
        {
            "text": "STEM Challenge\nThe GSE Profession, in collaboration with Science and Engineering Fast Streamers and STEM ambassadors, are proud to announce the launch of the 2022 STEM Challenge for secondary school students. The challenge is focused on sustainability, and within that theme students will explore their vision of a day in 2050. They will work in teams to choose a real issue facing the country today – ‘Sustainable Food Production’, ‘Humans in Space’ or ‘Sustainable Transport’ and consider creative scientific solutions. These are all critical issues for policymakers in STEM. You can find both the student pack of activities and the teacher pack below."
        },
        {
            "text": "The team have worked with STEM Ambassadors to select schools in order to promote social mobility and inclusivity in STEM. As this is the first STEM challenge, they are initially launching in a select number of schools across the country. We hope these will be the first of many, and we will keep you updated here on our progress. For further information please contact - stemchallenge@faststream.civilservice.gov.uk,"
        },
        {
            "text": "STEM Outreach Programme\nThe STEM Outreach Programme is run by Fast Streamers with the aim of liaising with university students through student-led societies.  The programme will feature activities aimed to promote STEM such as:"
        },
        {
            "text": "Science and Technology Network Pen Pals\nUniversity students will be paired with a current Fast Stream trainee who has experience of working in science and technology within the Civil Service. Students will be invited to ask their Fast Stream pen pal about the postings they’ve had, their experiences relating to science and technology, the application process and any general questions about the Fast Stream. This won’t be a long-term mentoring scheme and a general limit of 2 weeks or an exchange of around 4 emails would be advised."
        },
        {
            "text": "S&T Presentation and Q&A Session\nStudents are invited to a virtual presentation and Q&A session, lasting around 30 mins in total. The presentation provides a general introduction to the Fast Stream and more specific information about science and technology and the Science and Engineering scheme. The presenters and Q&A panel will be current Fast Stream Trainees or alumni with experience of working in science and technology within the Civil Service. For further information please email - scienceandtechnologynetwork@faststream.civilservice.gov.uk"
        },
        {
            "text": "SEFS Alumni Network\nThe Government Science and Engineering Profession are establishing a SEFS Alumni network that will connect a community of professionals with shared experience. The network hopes to support current Fast Steamers, share top tips, support learning and development, and more."
        },
        {
            "text": "SEFS Learning & Development Offer\nAs part of the Science and Engineering Fast Stream (SEFS) Learning and Development offer, we provide multiple networking and learning and development opportunities over the 3-year period on the scheme these include -"
        },
        {
            "text": "Science and Engineering Fast Stream Assessing\nThe Fast Stream is the Government's flagship graduate development programme, equipping the brightest candidates with the knowledge, skills and experience they need to become future leaders of the Civil Service. We invite SEFS who are in their 3rd year of the Scheme and any GSE member with a Science or Engineering background to apply   This is an exciting and interesting opportunity to support the governments future science leadership pipeline. Assessor recruitment will commence in August 2022 for next year’s assessments."
        },
        {
            "text": "Science and Engineering - Quality Assuring of S&E Roles\nThe Science and Engineering Fast Stream (SEFS) are always looking for volunteers from the GSE profession to quality assure Science and Engineering Fast Stream roles. Every year, SEFS commissions over 100 job descriptions for S&E roles from across government, ranging from Environmental Policy Leads to Defence Technology Project Managers and CSA Private Office. To ensure that these roles meet the high standards of the GSE profession, we need experienced S&E professionals to assess a selection of these roles against two criteria:"
        },
        {
            "text": "The Civil Service Fast Stream has been rated as the top Public Sector Graduate Employer for the last two years and SEFS now offers places to over 40 graduates per year, making it an important, growing and increasingly diverse provider of GSE leadership talent. This is an exciting opportunity to find out more about the scheme and the work we do."
        },
        {
            "text": "\nDirect Appointment Scheme\nThe direct appointment scheme (DAS) is an initiative that recruits high capability individuals who demonstrated potential during the rigorous Fast Stream assessment process but were not offered a Fast Stream post.As part of the scheme, successful candidates will be matched to a position in Government, some with a substantial policy element, others more technical. Wherever based, successful candidates will be applying specialist skills and knowledge to make sure that the Government has access to the best Science and Engineering advice to support policy and decision-making. We currently have a DAS community of 8 who have joined the GSE profession with the hope to increasing these numbers going forward."
        },
        {
            "text": " "
        },
        {
            "text": "LEADERSHIP\n\nTalent Development Mentoring Program: GSE profession is set to a launch the Empowering Mentoring Scheme in summer 2022 for all GSE profession members to support your personal & professional development."
        },
        {
            "text": "GSE Leadership Values: GSE profession has concluded a range of focus group sessions with professions’ members to gain insights on leadership challenges, and will publish GSE Leadership Values in June/July 2020."
        },
        {
            "text": "Leadership in Action: A set of 8 Leadership attributes defined by Civil Service Learning"
        },
        {
            "text": "Networking: Opportunities to attend a range of learning and networking events – including with Chief Scientific Advisors from across the government."
        },
        {
            "text": "Career pathways: GSE offers a range of assistance for career progression to be discussed with your manager or mentor I.e., GSE career framework, skills assessment tools, Empowering Mentoring Scheme etc."
        },
        {
            "text": "Systems Thinking Practitioner Degree Apprenticeship: This course is for mid- to senior-level public sector staff engaged with addressing complex and cross-disciplinary challenges designed and delivered by University of Exeter."
        },
        {
            "text": "Leadership Development Schemes\nGSE profession encourage and assists profession members to enrol in Talent & Leadership Development Schemes offers by Accelerated Development Schemes (GSCU, Cabinet Office) for all Civil Servants. Such as:"
        },
        {
            "text": " "
        },
        {
            "text": "Further leadership development will be coming up later in 2022, check Knowledge Hub for future updates! Please contact gse@go-science.gov.uk for more information on each offer."
        },
        {
            "heading": 3,
            "text": "Explore other areas of the GSE Profession's Offer"
        }
    ]
}