{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/the-most-popular-words-in-live-uk-company-names/",
    "title": "The most popular words in live UK company names",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T13:06:56+00:00",
    "content": [
        {
            "text": "Over the years, trends have come and gone, and company names are no exception."
        },
        {
            "text": "We looked at words used in the names of all the currently operational or live companies registered between 1980 and 2019 to determine which words have stood the test of time."
        },
        {
            "text": "Our analysis has considered words by the following:"
        },
        {
            "text": "To understand a word’s popularity over a certain time period, we looked at its change in its share over time. For example, the share of live companies with the word ‘garden’ was about 5 times bigger in 2000 than in 2019."
        },
        {
            "text": "Additionally, we made a few considerations when examining the data, such as:"
        },
        {
            "heading": 2,
            "text": "Most popular words by share"
        },
        {
            "text": "For the eighties and much of the nineties, 'management', 'company' and 'services' were the 3 most common words in the names of newly incorporated UK live companies. From 1985 to 1990, 26% of all new live companies had at least one of those 3 words in their name and 13% had management, the most popular."
        },
        {
            "text": "Those same 3 words remained the most popular for live companies incorporated from 2005 to 2010 though their overall share dropped noticeably. Just 14% of all new companies had one of those words in their name. Furthermore, 'management' once in the name of 13% of new businesses by itself, dropped to below 5%."
        },
        {
            "text": "There has continued to be a wider spread of words in the name of new companies in the last few years. 'Services' was the most common from 2015 to 2020 with 5.4%. In 1985 both 'management' and 'company' were noticeably higher - at 13% and 9%, respectively. There were a further 6 other words that appeared in the names of at least 1.5% of all new live companies in the UK."
        },
        {
            "heading": 2,
            "text": "Most popular words by rank"
        },
        {
            "text": "While, even as their overall share has decreased, many words have remained among the most popular in business for 40 years, there are some notable newcomers. 'Consultancy', 'solutions' and 'consulting' were all outside of the top 100 words for companies incorporated in the early eighties and still operational. However, by 2020 they were all in the top 15 most common words for the names of newly incorporated live companies, making them the biggest risers."
        },
        {
            "text": "Interestingly, of the most popular words in the early eighties, none have experienced a significant drop off in relation to other words. The most popular words from the early eighties remain the most popular words, with the triumvirate mentioned above having joined their rank in recent years."
        }
    ]
}