{
    "url": "https://companieshouse.blog.gov.uk/2022/01/31/the-expansion-of-the-beauty-industry-in-the-uk/",
    "title": "The expansion of the beauty industry in the UK",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2022-01-31T13:07:47+00:00",
    "content": [
        {
            "text": "With social media influencers, makeup artists and vloggers leading the charge, beauty and wellness products, techniques and procedures which were once available only to the rich and famous now have increasing exposure among consumers."
        },
        {
            "text": "Through channels such as Instagram, the latest beauty and wellness trends have never been more accessible. The beauty and health industry continues to grow rapidly, outpacing many other sectors in the retail industry, and is now set to be worth £26.7 billion by 2022."
        },
        {
            "text": "This interest is reflected in the live companies emerging in the past 10 years. The word ‘beauty’ has seen a huge growth in the proportion of registered live companies using the term in their name – significantly more than any other word."
        },
        {
            "text": " "
        },
        {
            "text": "Since the early 2000s, there has been a continual growth in the number of live companies with ‘beauty’ in their name. In every year until 2014, ‘beauty’ appears in the name of less than 500 of those companies. Those days are long gone as there are more than 500 such companies incorporated in each year since 2014."
        },
        {
            "text": "What’s perhaps most striking is that the growth has only continued to increase. ‘Beauty’ appears in the name of more than 3,500 live companies incorporated in 2020 alone. That’s a quarter of all live companies with ‘beauty’ in their name."
        },
        {
            "heading": 2,
            "text": "Spotlight on Clinica Fiore Skin Medica"
        },
        {
            "text": "Flavio Refrigeri, founder of Clinica Fiore Skin Medica, a London based cosmetic skin clinic, has personally experienced these changes in the beauty industry. While retaining their more traditional, slightly older customer base, Clinica Fiore has had a huge rise in the more youthful customer."
        },
        {
            "text": "“Never before have we had such an increase in calls from younger clients as in the past 4-5 years” says Flavio, explaining that they now receive callers as young as 16 wishing to book in for appearance altering treatments - but makes it clear that the age of consent is 18."
        },
        {
            "text": "“The younger generation imply they want to look more perfect.”"
        },
        {
            "text": "He also notes the importance of social media in these changes, which he accounts for making beauty procedures more widely known and accessible through influencer and celebrity endorsements."
        },
        {
            "text": "“They see something on somebody famous and now they can go and get it.”"
        },
        {
            "text": "The strive for a flawless complexion is reflected in Clinica Fiore’s top 6 most popular treatments - 5 of which are skin-related. And Flavio believes these treatments are only set to soar - particularly with the emergence of 'Macne' (mask acne), where patients are now complaining of congestion where face coverings have been irritating their skin."
        },
        {
            "text": "The expansion of health and beauty, especially among the younger generation, has led to some interesting trends within the industry. Companies House further illuminates these trends as recent years have seen a noticeable increase in registered live companies relating to lashes and self-care."
        },
        {
            "heading": 2,
            "text": "Lash"
        },
        {
            "text": "The love of eyelashes, in particular fake lashes and eyelash extensions, is not a new phenomenon. With eyelash trends involving having false lashes embedded into eyelids appearing in the late 19th century and a Twiggy lead revival in the 60s, they are now back with a vengeance as of the early 2000s. This resurgence is thought to be the result of eyelash innovations in Korea and Japan, which spread like wildfire across the globe."
        },
        {
            "text": "False eyelashes and extensions have since become a staple of UK beauty providers. The proportion of live companies registered with the word ‘lash’ in their name has increased significantly - the use of the term grew from 3 in the 2000s to 1,350 in the 2010s."
        },
        {
            "heading": 2,
            "text": "Boutiques and lounges"
        },
        {
            "text": "As part of the growth of the beauty and wellness industry, there has been an increase in boutiques and lounges. While the words could conjure up images of exclusive spaces only accessible to wealthy, the increase in live companies with ‘boutique’ or ‘lounge’ in their name is indicative of the beauty and wellness industry’s democratisation of beauty. Everyone, after all, deserves to feel pretty."
        },
        {
            "text": "According to Companies House data, there are only 129 live companies with ‘boutique’ in their name and 149 with ‘lounge’ that were incorporated in the 2000s. Both experienced a massive increase over the next decade - 2,196 live companies with ‘boutique’ in their name were incorporated in the 2010s, and 1,698 with ‘lounge’."
        },
        {
            "heading": 2,
            "text": "Wellness"
        },
        {
            "text": "Self-care, wellness and health have become more and more synonymous with beauty over the past few years, with many influencers championing this wellbeing-oriented approach to beauty."
        },
        {
            "text": "Although perhaps not a new concept, ‘wellness’ has become a more familiar term over the past few years after being popularised by millennials. Wellness is way of approaching personal health that focuses on practicing healthy habits on a daily basis that lead to increased physical and mental wellbeing. For many, wellness activities can include:"
        },
        {
            "text": "The increased focus on ‘wellness’ is reflected in its use in company names. There were 853 live companies incorporated in the 2010s with ‘wellness’ in their name, compared to 69 in the 2000s. Skincare, a key activity in the ‘wellness’ routine of many people, has seen similar growth. While only 32 live companies from the 2010s have ‘skincare’ in their name, the term appears in 367 company names incorporated in the 2010s."
        },
        {
            "text": "While the coronavirus (COVID-19) pandemic has led to face coverings becoming standard, concealing parts of ourselves that health and beauty tends to focus on, Clinica Fiore’s Flavio predicts that health and beauty will remain important to the UK population."
        },
        {
            "text": "Facemasks can irritate the face and cause congestion, thus introducing a new obstacle to flawless skin. Flavio believes that new beauty and wellness trends will emerge to combat our reaction to face coverings."
        },
        {
            "text": "“Everybody likes to feel beautiful, and this will not stop.”"
        },
        {
            "text": "Clinica Fiore has already started doing more specific treatments for mask-related epidermal issues. So we can rest easy - and keep wearing our masks - knowing that the recent growth in the beauty and wellness sector means professionals such as Flavio are on the case, making sure that we have skin that is glowing and selfie ready!"
        }
    ]
}