{
    "url": "https://apprenticeships.blog.gov.uk/2022/10/14/black-history-month-introducing-our-edi-work/",
    "title": "Black History Month: Introducing our EDI work",
    "authors": [
        "Rachel Cooper",
        "Beth Chaudhary"
    ],
    "categories": [
        "Black History Month",
        "Insider insights",
        "The Institute"
    ],
    "pub_date": "2022-10-14T09:28:10+01:00",
    "content": [
        {
            "text": "This year’s theme for Black History Month is ‘Time for Change: Actions not Words’ and we could not agree more, which is why IfATE is working on an equity, diversity and inclusion (EDI) strategy and operational framework, to set out the practical steps we are taking to support an inclusive technical education system."
        },
        {
            "text": "The Strategy will be published later this year and will set out our ambitions to ensure that people from all backgrounds can train in their chosen occupation and can fulfil their potential. Our view is that this will strengthen and deepen the skills base employers are able to benefit from, in line with Mckinsey’s analysis in 2020 on why diversity wins, setting out the strong business case for equity, diversity and inclusion."
        },
        {
            "text": "At IfATE, we want to strengthen the consideration of equity, diversity and inclusion (EDI) as a core feature of the design and delivery of apprenticeships and technical qualifications."
        },
        {
            "text": "We work closely with employers and sector experts to design the occupational standards which apprenticeships and technical qualifications must meet. Over the past year, we’ve been working with them to develop an Operational Framework to embed EDI in the way standards are designed. This has involved open and honest conversations on how to do this in a meaningful way, to ensure the right questions are asked at each stage of the standard’s development and to provide helpful advice and toolkits for employers to use in their recruitment of apprentices."
        },
        {
            "text": "Working at IfATE we have the privilege of meeting so many amazing apprentices and students, either out on visits or when they join us to talk our Board through their experiences of technical education. Their passion and commitment, not just to their chosen careers, but to ensuring others can also access the same opportunities is inspiring. One of the most important features of our role is to listen and respond to those challenges, taking steps where we can change how IfATE operates and by continuing to make the wider case for equitable, diverse and inclusive technical education."
        },
        {
            "text": "Rachel Cooper and Beth Chaudhary, Strategy Directors"
        }
    ]
}