{
    "url": "https://naturalengland.blog.gov.uk/2022/10/14/catchment-sensitive-farming-supporting-farmers-across-england/",
    "title": "Catchment Sensitive Farming: supporting farmers across England",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Farming",
        "Natural England"
    ],
    "pub_date": "2022-10-14T17:19:04+01:00",
    "content": [
        {
            "text": "I’m Ceri Meehan, I'm a Catchment Sensitive Farming (CSF) Adviser covering the Severn River Basin District. I use my skills to deliver Natural England’s objectives in the West Midlands. I work with farmers advising them on sustainable farming practices that not only have the potential to improve the environment, but also increase yields and profitability. No one size fits all and my role is to work with the farmers I visit to understand their needs and suggest what might work for them."
        },
        {
            "text": "As a Natural England Catchment Sensitive Farming Adviser, I provide  independent and trusted advice on available options that deliver on a range of environmental objectives from water and air quality, natural flood management, to the latest on Agricultural Transition."
        },
        {
            "text": "This year Catchment Sensitive Farming has expanded and is able to offer farm advice across the whole of England meaning we’re able to work with more farmers, land managers and growers to deliver our ambition for Nature Recovery."
        },
        {
            "text": "As part of the national expansion, advisers across England are writing catchment plans to set out our direction for the next three years. We use a wide range of data, evidence, and local knowledge to inform our plans, as well as working together with our area team colleagues to target joint outcomes for an area along with other national experts within Natural England, and externally. All this information helps us to build a picture of where our advice would be most effective in supporting and working with farmers to protect and restore our natural environment."
        },
        {
            "text": "When I’ve got the planning done for my visit, I then do a risk assessment – factoring in any bio-security measures I need to take - and finally, print off a map to share with the farmers and scribble notes on. Now I’m ready for a farm visit."
        },
        {
            "text": "I usually like to start by having a quick chat in the kitchen with a cuppa – if offered one! I can then talk about the holding, current management, future plans and key topics to improve the environment such as nutrients, slurry management and healthy soils. I then agree with the farmer which areas we will look at on my visit, such as watercourses and erosion risk areas."
        },
        {
            "text": "Then it’s off for a look around the farm. I start in the yard to discuss infrastructure, especially drainage and water pathways, and then discuss any issues or opportunities as they arise."
        },
        {
            "text": "Next to consider is the wider farm, identified through the desk-based assessment and the kitchen table chat. Topics I cover are wide ranging, including livestock management, nutrient management, soil health, water use, drainage, farm infrastructure, water pathways, pollution risks, and ammonia mitigation. I try to encourage good practice, as well as signposting farmers to specific information and opportunities."
        },
        {
            "text": "Then it’s back to the office, where I will mull-over the visit, share information with other Area Team advisers and discuss: Is it value for money? What are the environmental benefits? Are we linking with other local opportunities? Is it eligible for funding?  Would the farmer benefit from a specialist farm visit? Is there anything else Natural England can provide to improve the resilience of the farm?"
        },
        {
            "text": "Finally, I send off any relevant approval forms and details of events or specialist visits they could sign-up to in a follow up letter or email confirming what we have discussed or agreed."
        },
        {
            "text": "No two days are the same and it is a continual learning curve in CSF but, step by step, we are cleaning up our waterways, releasing less ammonia into the air and making farms deliver more for the natural environment, in a sustainable way for the business. It gives me great job satisfaction knowing that what I do, working with farmers, is helping to create a better place for all of us to live and thrive."
        },
        {
            "text": "If you’d like to speak to a local Catchment Sensitive Farming Adviser like me visit - Catchment Sensitive Farming: advice for farmers and land managers - GOV.UK (www.gov.uk) to find the email address of your local team and advice on grant support."
        }
    ]
}