{
    "url": "https://socialcare.blog.gov.uk/2022/10/14/long-covid-and-why-vaccination-still-matters/",
    "title": "Long COVID and why vaccination still matters",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-10-14T13:30:03+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Welcome outstayed"
        },
        {
            "text": "Life may seem to be back to normal – and in many ways it is – but, despite some very public declarations suggesting the pandemic is over, COVID-19 and its many variations have not gone away. A growing number of people are sadly suffering the reality of that statement, each and every day."
        },
        {
            "text": "Although many have recovered from the initial infection itself, their recovery can be slow, prolonged and beset by often debilitating symptoms."
        },
        {
            "text": "It is estimated that around two million people in the UK are currently experiencing long COVID. Effective support for those affected cannot and should not be limited to the clinical. That’s why I am so glad social care nurses, midwives and the wider care workforce are being recognised, more and more, as essential partners in the delivery of effective care and support."
        },
        {
            "text": "Long COVID: a framework for nursing, midwifery and care staff, published earlier this year, supports us all to maintain and sustain the highest standard of care for those affected by long COVID, wherever they are in the health and care system."
        },
        {
            "text": "One of the framework’s strengths – and a particular passion of mine – is the focus on research and a growing evidence base, both in terms of how Long COVID presents itself, but also the efficacy of the health and care interventions intended to mitigate its symptoms. If we are to lead care teams with authority and credibility, it must be on the basis of methods and processes proven to lead to positive outcomes."
        },
        {
            "text": "We must not be afraid to share what works more widely too. So often, teams or services can get into unconscious mind sets, where there isn’t consideration that an approach tried in one setting, might also be effective in another. Sharing successes helps us all deliver better care for everyone."
        },
        {
            "heading": 2,
            "text": "Vaccination remains vital"
        },
        {
            "text": "It’s also hugely important to point out that vaccination – including boosters and flu jabs – is another essential tool in efforts to reduce the prevalence of long COVID in the population. To quote from the framework itself:"
        },
        {
            "text": " Jennie Hall, Director of Nursing and Clinical Delivery COVID-19 Vaccination Programme, NHS England is also quoted as saying:"
        },
        {
            "text": "This statement is as true of social care nurses as it is our clinical counterparts. Day to day we must use our skills, experience and empathy to support colleagues and the people we serve to make informed choices about vaccination."
        },
        {
            "text": "Whether an individual has Long COVID or not, our duty of care remains. If you’ve not booked your booster and flu jabs, please do so now and help protect yourself and others from the risk of infection and the possibility of symptoms that may outstay their welcome this winter!"
        }
    ]
}