{
    "url": "https://forestrycommission.blog.gov.uk/2024/02/12/ask-an-apprentice-2024-your-professional-forester-apprenticeship-questions-answered/",
    "title": "Ask an Apprentice 2024: Your Professional Forester Apprenticeship questions answered",
    "authors": [
        "Gareth Hopkins"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-02-12T12:32:44+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What are the job prospects for a qualified Forester?"
        },
        {
            "text": "The sector needs hundreds of new Professional Foresters to meet the legally binding planting targets, so the future job prospects are very good. Forestry Commission jobs are advertised on Civil Service Jobs.\nGareth"
        },
        {
            "text": "It's a growing sector and given the legally binding government target to hit 16% tree cover by 2050, we need more recruits! Take a look at the Institute of Chartered Foresters Job Board for current opportunities.\nRob"
        },
        {
            "heading": 3,
            "text": "Is there a maximum age for applying to the apprenticeship?"
        },
        {
            "text": "There is no maximum age limit, but it would be expected that applicants would complete the three-year apprenticeship and spend some time in the sector before retirement.\nGareth"
        },
        {
            "text": "The ages of our current cohort ranges from 18 to 53.\nEmily D"
        },
        {
            "heading": 3,
            "text": "Is there the potential to transfer into a more ecology-focussed role from the apprenticeship?"
        },
        {
            "text": "There might be scope to move into an ecology type of role in the future after the 3-year apprenticeship has been completed. The qualification awarded is similar to our BSc (Hons) Forest Management course and there is a Woodland Ecology module in 2nd year. Forest Health is also covered in 2nd year and Climate Smart Forestry in 3rd year.\nEmily D"
        },
        {
            "text": "We are building up the list of work experience placements which could include potentially more ecology focused placements with Forestry England and Forest Research.\nGareth"
        },
        {
            "text": "Each Forest Services area team within the Forestry Commission has an Ecologist.\nCatherine"
        },
        {
            "heading": 3,
            "text": "Do you currently have any, or are you planning any, level 7 apprenticeships (Masters level)?"
        },
        {
            "text": "At present we have a level 3 apprenticeship and the level 6 degree apprenticeship. The Trailblazer group is going to be working on level 4/5 provision next.\nRob"
        },
        {
            "text": "A Masters level is not in the pipeline, however we are working with the potential providers of a distance learning Masters offer.\nGareth"
        },
        {
            "text": "There are very few opportunities for level 7 apprenticeships in any sector (I'm only aware of Senior Leader, Architecture and Solicitor related Masters qualifications) so it would definitely be a distance learning/part-time Masters course if the University of Cumbria offers anything in the future.\nEmily D"
        },
        {
            "heading": 3,
            "text": "Within the apprenticeship are you taught any practical land management tools, such as chainsaws?"
        },
        {
            "text": "Within the level 6 apprenticeship, there is a module on practical forestry skills that focuses on fencing, hand tools etc. Chainsaw operator or supervisor may depend on the host employer and what they need, but it does not form part of the essential level 6 content.\nTom"
        },
        {
            "text": "We do not teach the practical elements of things such as chainsaw use on the level 6 but we do cover the skills needed to manage these types of operation. The level 3 apprenticeship, however, focuses on those practical skills.\nGareth"
        },
        {
            "heading": 3,
            "text": "Is the level 3 apprenticeship similar to a craftsperson apprenticeship?"
        },
        {
            "text": "Yes, the level three is the forest craftsperson apprenticeship.\nRob"
        },
        {
            "text": "We will be advertising for up to 12 x level 3 apprentices based in England (locations to be confirmed) on Civil Service Jobs in the spring.\nGareth"
        },
        {
            "heading": 3,
            "text": "Did you do a lot of volunteer work before application and do you think this helped your application?"
        },
        {
            "text": "I was not from a forestry or conservation background, therefore I spent the previous year gaining some experience on weekends with local conservation groups managing woodlands and nature reserves. I found this beneficial and included this within my application.\nEmily H"
        },
        {
            "text": "I did some volunteering which I included on my application, although I was working full-time and could not dedicate as much time as I would have liked. It's definitely beneficial but some jobs have transferrable skills - co-ordinating projects, time management, conflict resolution for example. I would say volunteer if you can, but not everyone is able to.\nTom"
        },
        {
            "text": "Volunteering was where I got my passion for managing woodlands and I was able to demonstrate this on my application. If you are able to get involved, I would highly recommend it.\nMark"
        },
        {
            "text": "Definitely some volunteer work or relevant activity is beneficial. Essentially something that demonstrates your passion for the subject will be advantageous to the application. How much you can do depends on your circumstances.\nDuncan"
        },
        {
            "heading": 3,
            "text": "Do you have any advice or key tips that would help an application stand out?"
        },
        {
            "text": "We are looking for people passionate about making a difference in the environment, so evidence of being involved with environmental projects, volunteering with Forestry England, the Woodland Trust and the likes of local wildlife organisations would be helpful.\nGareth"
        },
        {
            "text": "Show that you're passionate and that you're willing to get involved practically - volunteering is the best way to do this.\nTom"
        },
        {
            "text": "Google applying for civil service posts to help familiarise yourself with the style of answers expected. Read the job description and person spec and show how you meet the requirements and how passionate you are about this role and opportunity.\nEmily H"
        },
        {
            "heading": 3,
            "text": "What should candidates expect at the assessment centres?"
        },
        {
            "text": "At the assessment centre (in Cannock) we were set tasks throughout the day, including a formal interview, group work, written assessments and a woodland walk. Everyone was welcoming and put us at ease. They just want to get the best out of everyone. It was enjoyable.\nEmily H"
        },
        {
            "text": "The assessment centre is a day long, with a mix of formal interviews, a woodland walk, written tasks, groups task and a competition. This mix and time allows everyone to fully engage. We aim to create a welcoming environment to allow us to see the best of all applicants.\nGareth"
        },
        {
            "heading": 3,
            "text": "How long are the university block learning periods?"
        },
        {
            "text": "Each module has a one week teaching block every two months, and there are other opportunities for further learning offered by Forestry Commission.\nCatherine"
        },
        {
            "heading": 3,
            "text": "What advice can you give to anyone considering applying for the Professional Forester Apprenticeship?"
        },
        {
            "text": "Life is too short to not try something different especially if you are passionate about it, go for it. It is definitely worth it!\nEmily H"
        },
        {
            "text": "Embarking on this career change journey has been without doubt the best work choice I've made. Getting outdoors and having a career in nature is well worth it!\nTom"
        },
        {
            "text": "It's the most forward-thinking, engaging, enjoyable programme I have had the pleasure to be involved with in nearly 36 years in the sector. I'm surrounded by amazing passionate people making the most of opportunities & looking to make a difference which is very inspiring.\nGareth"
        },
        {
            "text": "If you have a passion for trees, forestry & woodlands and want to contribute to improving our environment, I can't think of a better way to gain the necessary knowledge and experience. It's been far more than I expected and would encourage anyone considering it to apply.\nDuncan"
        },
        {
            "text": "Put in an application! The forestry sector offers a huge variety of opportunities, between time with trees and great people - it is a winning move!\nCatherine"
        },
        {
            "text": "Joining the Forestry Commission was definitely the right career move for me, I have been given so many great opportunities and work with a fantastic bunch of people.\nMark"
        }
    ]
}