{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/12/biodiversity-net-gain-is-live/",
    "title": "Biodiversity Net Gain is live",
    "authors": [
        "Rachel Fisher"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Land Use",
        "Local Nature Recovery Strategies",
        "Nature"
    ],
    "pub_date": "2024-02-12T16:19:55+00:00",
    "content": [
        {
            "text": "Biodiversity Net Gain becomes mandatory for major developments today (12 February 2024), but why does this matter? Rachel Fisher, Defra’s Deputy Director for Land Use, outlines the benefits of the policy. "
        },
        {
            "text": "Biodiversity Net Gain is not a new policy. It was first introduced as a concept in the National Planning policy Framework in 2012, and made mandatory through the Environment Act 2021.  "
        },
        {
            "text": "There has been a two-year transition period to further develop the policy and ensure that implementation is as smooth as possible.  "
        },
        {
            "text": "At its most basic level, Biodiversity Net Gain is trying to do four things:   "
        },
        {
            "text": "Whilst some local authorities and individual developers have adopted voluntary Biodiversity Net Gain, mandatory Biodiversity Net Gain will make sure that these benefits are spread across the country in a consistent way.  "
        },
        {
            "text": "Though these four outcomes may not always neatly align, what the policy tries to do is balance them out – and ensure that it is still easy to understand.  "
        },
        {
            "text": "There are, of course, different ways of delivering the policy which would put more weight on one or the other of these outcomes.  "
        },
        {
            "text": "Let’s take each of these four in turn: "
        },
        {
            "text": "Change how development happens:  "
        },
        {
            "text": "The priority for net gain is to deliver these on-site – which means developers will be incentivised to deliver the 10% uplift as part of a development. In the context of a housing development, this means making sure that public open space benefits not just people, but also habitat.  "
        },
        {
            "text": "Change where development happens: "
        },
        {
            "text": "The statutory biodiversity metric incentivises a developer to build on sites with low to zero biodiversity value.  "
        },
        {
            "text": "For example, if you are building only on concrete or hardstanding you will not be required to deliver any additional biodiversity. This should incentivise developers to build on areas that have no biodiversity value rather than on existing habitat or green space.  "
        },
        {
            "text": "This is in line with the internationally accepted ‘mitigation’ hierarchy of environmental harms – avoiding harm being the priority.  "
        },
        {
            "text": "Create a high integrity nature market: "
        },
        {
            "text": "We recognise that it is not always possible for the 10% gain to be delivered onsite and a vibrant offsite market is also critical for development to continue. The off-site market for biodiversity units offers a new form of diversification for land managers, allowing nature recovery projects to be realised in a financially viable and ecologically sound way.  "
        },
        {
            "text": "Our analysis suggests it’s likely to be worth between £135 million to £274 million. By requiring sites to register with the Natural England Biodiversity Net Gain register, we are overcoming the risk of double counting, and enabling the mapping of Biodiversity Net Gain sites, linked to developments.  "
        },
        {
            "text": "Contribute to nature recovery  "
        },
        {
            "text": "Biodiversity Net Gain has been designed to work with the 48 Local Nature Recovery Strategies currently being prepared across England. These locally-led, spatial strategies will identify the best locations for Biodiversity Net Gain habitat creation and enhancement to take place.  "
        },
        {
            "text": "Each Local Nature Recovery Strategy Local Habitat Map will map the actions which local partners agree will have the greatest contribution towards the area’s top priorities for nature and the wider environment. Through the statutory metric, these actions receive a 15% uplift in the unit value, incentivising delivery in these locations. "
        },
        {
            "text": "In this way, we are incentivising the creation and enhancement of the right habitats in areas of strategic importance.  "
        },
        {
            "text": "What to do next "
        },
        {
            "text": "In readiness for mandatory Biodiversity Net Gain, we’ve been working to finalise both the draft Defra guidance and the draft planning practice guidance that were published at the end of November.  "
        },
        {
            "text": "We’ve listened to the feedback we received from stakeholders, and you’ll see that we’ve made updates to the guidance.  "
        },
        {
            "text": "This includes more information on phased development, irreplaceable habitats, the information that developers may submit to support their planning application and information on developments below the threshold.   "
        },
        {
            "text": "You can find all the latest information via the BNG guidance collection page. "
        },
        {
            "text": "For more nature and environment updates like this, please subscribe to our blog. "
        }
    ]
}