{
    "url": "https://aphascience.blog.gov.uk/2024/02/12/building-a-stronger-animal-health-workforce/",
    "title": "Embracing diversity: building a stronger animal health workforce",
    "authors": [
        "Flavie Vial"
    ],
    "categories": [
        "Women in science"
    ],
    "pub_date": "2024-02-12T08:30:36+00:00",
    "content": [
        {
            "text": "As International Programme Manager at the Animal and Plant Health Agency (APHA), Dr Flavie Vial facilitates international cooperation and knowledge exchange on preparing for, and responding to, animal disease threats. As part of her role, Flavie oversees APHA’s delivery of Official Development Assistance funded projects focused on food safety and security as well as strengthening animal health systems. Let us hear more from Flavie in this blog."
        },
        {
            "text": "-----------------------------------"
        },
        {
            "text": "Now in its ninth year, the International Day of Women and Girls in Science continues to raise awareness of the significant gender gap at all levels of science, technology, engineering, and mathematics (STEM), It also pushes for the recognition that tackling some of the greatest challenges of the United Nations’ Agenda for Sustainable Development will rely on harnessing talent of all genders."
        },
        {
            "text": "I have had the privilege of working in over 10 countries to date, as an academic, as a consultant and more recently as an international programme manager at APHA. I have been thinking a lot lately about how most of the work done globally in animal health, plant health or One Health could give more consideration to gender[1], since females represent half of the human population and playing important roles in human health the environment and the animals and plants they depend on. Gender blindness, the practice of ignoring differences between genders, is still an issue in public health programmes despite a long-standing recognition of gendered inequalities."
        },
        {
            "text": "It is only in the last decade or so that animal health experts have been questioning the potential harm of research, policy, or delivery of services which are gender-blind. The World Organisation for Animal Health Gender Task Force was only set up in 2021. The lack of gender consideration in my field partly results from the absence of research and evidence to generate meaningful guidance for gender-sensitive decision-making. This is further aggravated by the lack of diversity in the animal health workforce. When teams are composed of people from similar backgrounds, their perspectives are limited. This translates into policies, services and interventions that fail to be inclusive. Let me share with you some examples illustrating why gender matters in animal health."
        },
        {
            "heading": 3,
            "text": "Gendered inequalities in livestock farming"
        },
        {
            "text": "Globally, the share of women in the livestock sector varies significantly by livestock species. The most profitable breeds of livestock (cattle, camels, and buffalo) are often under the control of men. Women are more likely to control less-profitable livestock breeds (poultry and small ruminants)."
        },
        {
            "heading": 3,
            "text": "Gender and health risks"
        },
        {
            "text": "Gender-specific social and domestic roles can affect an individual’s risk of exposure to various hazards, including infectious diseases and zoonoses. For example, where men mainly work in slaughterhouses, they are at greater risk of brucellosis or anthrax infection because of their direct contact with the flesh and bodily fluids of diseased dead animals. Women can be more at risk of contamination from bacteria such as Campylobacter from handling raw products during food preparation."
        },
        {
            "heading": 3,
            "text": "Gendered impact of animal diseases"
        },
        {
            "text": "The burden of household management and childcare may well increase during an animal disease outbreak. For example, if a male farmer is working extra hours to manage the spread of the disease, this may in turn imply additional time that women will be at home caring for children. Or women may contribute to the increased labour on the farm or must feed farm workers working longer hours. This may have additional unintended consequences of forfeited additional income or educational advancement (if women study or work in the evenings while their partners care for children)."
        },
        {
            "heading": 3,
            "text": "Implication of gender issues for disease surveillance, control, and response"
        },
        {
            "text": "Information may be the most important resource during or after an outbreak. Information may not reach women because it can be given at a time that does not take account of their daily schedules or at male-only sites such as dip tanks, coop meetings, or even informally through friendship or clan networks."
        },
        {
            "heading": 3,
            "text": "Creating a diverse future for animal health"
        },
        {
            "text": "As part of the Defra Official Development Assistance-funded Animal Health Systems Strengthening project I am involved in, APHA is working with Ghana Poultry Network to train 90 Community Animal Health Workers (CAHW) over a 3-year period in 30 communities in the Upper East Region of Ghana. In remote areas underserved by public or private qualified veterinarians, trained CAHWs can perform a limited range of veterinary tasks and popularize good husbandry practices to optimise animal production, health and welfare. In 2023, 22 out of the 30 trainees we sponsored were female. Not only are these women able to earn an income and support their families, their social status and recognition within their communities has increased drastically."
        },
        {
            "text": "Achieving gender balance brings diverse perspectives and talents to all fields. In the veterinary/animal health field, the numbers of women professionals in the animal health sector continue to grow across the globe. However, the animal health sector’s culture, institutions, and policies are yet to be fully adjusted to this change. Doing so will not only benefit individual professionals but will also:"
        },
        {
            "text": "-----------------------------------"
        },
        {
            "text": "[1] Gender identity can be understood to include how someone describes themselves, how they present, and how they feel. There are at least 80 different cultural terms to describe gender constructs. For the purpose of this post, I use the simplest gender-binary construct in which the biological determinants of sex are congruent and consistent with an individual's gender identity."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}