{
    "url": "https://environmentagency.blog.gov.uk/2024/02/12/celebrating-international-day-of-women-and-girls-in-science-and-the-environment-agencys-citizen-science-projects/",
    "title": "Celebrating International Day of Women and Girls in Science and the Environment Agency's Citizen Science Projects",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Other areas of our work",
        "Sustainability",
        "Water"
    ],
    "pub_date": "2024-02-12T14:05:13+00:00",
    "content": [
        {
            "text": "Yesterday (Sunday 11 February) marked the ninth annual International Day of Women and Girls in Science – a UN designated celebration of the massive contribution women make to the fields of science and technology. Today, we look at a hugely important area of the Environment Agency’s (EA) work, one of the many where the work of women makes a great impact – our Citizen Science projects."
        },
        {
            "text": "Citizen Science is scientific monitoring and research conducted by members of the public. At the Environment Agency we’re part of many initiatives that support this type of science.  "
        },
        {
            "text": "From removing plastic from our waterways, to co-developing water quality monitoring tools, our own Supporting Citizen Science initiative is providing invaluable data about our water environment, enabling a greater understanding of the issues we face and how we can take collaborative action.  "
        },
        {
            "text": "Running from the end of 2022 until March 2025, the project aims to support emerging and established citizen science initiatives across the country to understand how the data collected can be used within the Environment Agency to improve the environment.  "
        },
        {
            "text": "We spoke to Kelly Haynes, National Citizen Science Advisor at the Environment Agency and Supporting Citizen Science project lead to find out more about the data that’s being collected, and how it’s helping improve our water environment in England: "
        },
        {
            "text": "From catchment to coast "
        },
        {
            "text": "The citizen science initiatives we work with are incredibly varied, geographically different and involve a wide range of stakeholders and participants. A few examples include;   "
        },
        {
            "text": " Making nature and science accessible to all "
        },
        {
            "text": "I’ve been in this role for nearly a year now and I really enjoy working across different internal teams, with external partners and communities to deliver environmental projects and better outcomes for people and nature. I’m passionate about the environment and making nature and science accessible to all.  "
        },
        {
            "text": "Using funding secured through spending review, the EA have recruited area specialists who are responsible for working closely with environment planning and monitoring teams, local catchment partners and community groups to engage and support citizen science projects in their areas.  "
        },
        {
            "text": "The monitoring data collected through local citizen science projects can complement our own monitoring and assessment work, enabling a greater understanding of the issues facing the environment and how together we can take action to deliver a better environment. "
        },
        {
            "text": "As the project lead, I am responsible for gathering this localised learning from our citizen science leads, identifying opportunities and challenges, and planning how we can share these projects wider, illustrate the benefits of collaborative monitoring to both the organization, people, and the environment. "
        },
        {
            "text": "Partnerships for change "
        },
        {
            "text": "In the year ahead, the ‘Supporting Citizen Science’ project will be looking at setting position statements, guidance and future ways of working as well as continuing to test how we can improve the way we currently engage with and support existing local citizen science projects.   "
        },
        {
            "text": "We’re looking forward to sharing our learning and feedback with partners and interested parties through a soon to be established citizen science page.   "
        },
        {
            "text": "Hope and positivity   "
        },
        {
            "text": "Our environment is facing a challenging and uncertain future, and it will need a collective approach to help find solutions to the complex problems water is facing. Citizen science initiatives can encourage individuals to connect with their local environment and communities, which can lead to local environmental stewardship and local action.  "
        },
        {
            "text": "The Environment Agency acknowledges the wide-ranging benefits of supporting citizen science and is committed to working collaboratively with everyone responsible for the water environment to find new solutions to the challenges we are all facing together.     "
        },
        {
            "text": "Fancy getting involved in citizen science? The Big River Watch is still live so have a go! Alternatively to find out more about citizen science that may be happening in your area contact your local catchment partnership: Get Involved - CaBA (catchmentbasedapproach.org).  "
        },
        {
            "text": "For more information on our project, the case studies mentioned, CaSTCo and Big River Watch email Kelly.haynes@environment-agency.gov.uk  "
        },
        {
            "text": "To find out more about the International Day of Women and Girls in Science, visit: International Day of Women and Girls in Science | United Nations"
        },
        {
            "text": " "
        }
    ]
}