{
    "url": "https://deframedia.blog.gov.uk/2024/02/12/coverage-of-government-action-on-bonuses-for-water-company-bosses/",
    "title": "Coverage of Government action on bonuses for water company bosses",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-02-12T14:50:25+00:00",
    "content": [
        {
            "text": "There has been widespread media coverage across multiple outlets – including the Times, BBC News and the Telegraph – following today’s announcement (Monday 12 February) that water bosses will be banned from receiving bonuses if a company has committed serious criminal breaches."
        },
        {
            "text": "Last year 10 water bosses received bonuses, totalling £2.5 million. The ban would apply to all executive board members and Chief Executives and would be expected to come into effect later this year. The ban is subject to an Ofwat consultation, which will be launched shortly and is expected to run for six weeks."
        },
        {
            "text": "Ofwat’s consultation will define the criteria for a ban, which could include successful prosecution for a Category 1 or 2 pollution incident or where a company has been found guilty of serious management failings. Categories 1 and 2 include the most serious pollution incidents, such as causing significant pollution at a bathing water site or conservation area."
        },
        {
            "text": "If taken forward, Ofwat would implement the measures by changing the conditions of water company licences. For water companies in England, this would be done using the powers given to the regulator through the Environment Act 2021."
        },
        {
            "text": "Environment Secretary Steve Barclay said:"
        },
        {
            "text": "“No-one should profit from illegal behaviour and it’s time that water company bosses took responsibility for that."
        },
        {
            "text": "“Tougher action is needed to address poor performance by water companies, which is why I am pleased Ofwat is going further today on bonus payments. In cases where companies have committed criminal breaches there is no justification whatsoever for paying out bonuses. It needs to stop now."
        },
        {
            "text": "“I will shortly be setting out more detail on further steps to clean up our waters, including reducing the reliance on water company self-monitoring in order to hold them to account and drive the improvements we all need to see.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}