{
    "url": "https://dluhcmedia.blog.gov.uk/2024/02/12/coverage-of-north-east-devolution-deal/",
    "title": "Coverage of North East devolution deal",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Devolution"
    ],
    "pub_date": "2024-02-12T15:34:36+00:00",
    "content": [
        {
            "text": "Our announcement that the legislation for a new £1.4billion devolution deal for the North East was laid in Parliament has been celebrated in regional media.   "
        },
        {
            "text": "This significant milestone which brings the North East of England one step closer to electing an historic mayor in May was covered positively online by BBC News, The Northern Echo, Northumberland Gazette and Chronicle Live. They report that greater powers will see the current North of Tyne Combined Authority replaced with a new North East Mayoral Combined Authority covering areas such as Newcastle, Northumberland, Sunderland and Durham."
        },
        {
            "text": "All note that once the legislation is formally approved, this will set the stage for an election on 2 May for the first mayor of the North East. They also quote Minister Young praising the deal as ‘an important milestone for communities’ across the region which will give local people ‘the levers and money they need to improve their areas’.   "
        },
        {
            "text": "In trade media, New Start Mag also reports the news positively, highlighting the deal’s multi-billion-pound investment package and that the legislation has been welcomed in a joint statement by the seven council leaders and North of Tyne Mayor. Together, they stated that this is a “transformative year”’ for the region.  "
        },
        {
            "text": "The Minister for Levelling Up Jacob Young also celebrated the deal reaching Parliament in a piece to camera which was published on our social channels.   "
        },
        {
            "text": "In his press quote issued to media last week (Wednesday 7 February), Minister Young said:  "
        }
    ]
}