{
    "url": "https://naturalengland.blog.gov.uk/2024/02/12/get-ready-for-new-biodiversity-net-gain-legislation/",
    "title": "Get ready for new Biodiversity Net Gain legislation",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Environment Act",
        "Environmental Improvement Plan",
        "Natural Capital",
        "Natural England"
    ],
    "pub_date": "2024-02-12T10:35:29+00:00",
    "content": [
        {
            "text": "The introduction of biodiversity net gain (BNG) today (12 February 2024) will see the biggest change to planning regulations in decades. This new law as part of the government’s Environment Act will make sure wildlife habitats are left in a better state than before development, and in doing so make a significant contribution to nature’s recovery."
        },
        {
            "text": "In November 2023, Defra published BNG guidance on GOV.UK to help local planning authorities, developers, landowners, and others prepare. It tells you everything you need to know now BNG has become law."
        },
        {
            "text": "Looking ahead to the new BNG Service "
        },
        {
            "text": "The Biodiversity Gain Site Register will provide a publicly accessible source of information about off-site gains across England. Natural England is the ‘Register Operator’ on behalf of Defra. The Register is one part of the BNG Service which went live when BNG became mandatory. The Service includes a collection of new digital and other services local planning authorities, developers, landowners, and others will need to be BNG compliant."
        },
        {
            "text": "Getting BNG ready has been a real team effort. We have worked closely with our stakeholders to develop, build, and test the guidance and digital services needed to help those affected comply with BNG once launched."
        },
        {
            "text": "More than 275 hours of user research has been carried out in the past 26 months. We have worked closely with over 580 stakeholders including local planning authorities, developers, landowners, ecologists, and others."
        },
        {
            "text": "We want to thank every stakeholder who has taken part. Their passion and willingness to share knowledge, expertise and most importantly their time has helped us develop better guidance and services for those who will need to use them from day one."
        },
        {
            "text": "What does the service provide? "
        },
        {
            "text": "Gain Site Register (digital service)"
        },
        {
            "text": "The Gain Site Register enables:"
        },
        {
            "text": "Others using the Register will include ecologists, non-governmental organisations, and the public."
        },
        {
            "text": "Allocations (downloadable pdf application)"
        },
        {
            "text": "Landowners or developers (with landowner permission) can apply to record an allocation of habitat enhancements to their development."
        },
        {
            "text": "Statutory biodiversity credits estimator (digital service)"
        },
        {
            "text": "Developers can calculate the cost of statutory credits ahead of purchasing them."
        },
        {
            "text": "Statutory biodiversity credit sales scheme (downloadable pdf application)"
        },
        {
            "text": "Developers can apply to purchase statutory credits. This will become a digital service in the spring of 2024."
        },
        {
            "text": "Statutory biodiversity metric calculation tool (MS Excel)"
        },
        {
            "text": "The Tool uses a habitat-based approach to assess an area’s value to wildlife and uses habitat features to calculate a biodiversity value. Find out more about the tool and how to download."
        },
        {
            "text": "It provides details on how:"
        },
        {
            "text": "Support when you need it"
        },
        {
            "text": "Dedicated teams will also be in place to provide support where needed including an assisted digital service for those who have difficulty accessing information online."
        },
        {
            "text": "Some parts of the Service including the Register are fully digital today, on day one. Others will become digital in the coming months. We will provide updates on any changes."
        },
        {
            "text": "Launch is just the beginning of the BNG journey. Our guidance and digital services will improve as they are used, and new digital services are launched. During this time, we will continue our user research with stakeholders."
        },
        {
            "text": "Want to know more?"
        },
        {
            "text": "If you or anyone you know would be interested in giving feedback on the digital services being developed, please feel free to complete our expression of interest form. We want to hear from developers, landowners, and their representatives."
        },
        {
            "text": "It would be great to hear from those building smaller housing developments, farmers with smallholdings and anyone who does not use or has trouble accessing the internet."
        }
    ]
}