{
    "url": "https://defrafarming.blog.gov.uk/2024/02/12/landscape-recovery-building-long-term-agreements/",
    "title": "Landscape Recovery: building long-term agreements",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2024-02-12T15:39:32+00:00",
    "content": [
        {
            "text": "Landscape Recovery supports large-scale, long-term management of land for the benefit of sustainable food production and the environment. "
        },
        {
            "text": "Many of the 22 projects in Round 1 are now halfway through the Project Development Phase (PDP). "
        },
        {
            "text": "During this phase, project teams are required to finalise their plans for how they will work collaboratively to develop a harmonious space for farming and the environment to thrive. "
        },
        {
            "text": "We’ve continued to develop details and share guidance for projects in this round. For example, we recently published guidance on how projects could be governed and details on the mechanisms through which farmers and landowners could be paid. "
        },
        {
            "text": "Our ability to co-design this scheme is founded on open and honest relationships with project teams. As part of building those relationships we: "
        },
        {
            "text": "On 30 January, we held our second face-to-face event with all the project teams in London. "
        },
        {
            "text": "We had two objectives for this meeting. First, we wanted to understand the issues they face as they cross the halfway point, to help guide us on where we should focus our support.  "
        },
        {
            "text": "Second, getting similar projects together to talk and share their approach where project arrangements might differ. For example, accessing private finance or managing different agreements with land managers such as tenants or commons associations.  "
        },
        {
            "text": "The breadth and depth of knowledge present in the discussions, plus the ambition demonstrated by project teams, makes us feel privileged to work with them. We’re optimistic about getting into the implementation phase. "
        },
        {
            "heading": 2,
            "text": "Working with tenant farmers and landlords "
        },
        {
            "text": "Earlier in January, the team visited four projects in the south-west of England. These projects are all working with a range of land managers, such as landowners, tenants, and commoners, making the projects more nuanced.  "
        },
        {
            "text": "We want to make Landscape Recovery work in a range of contexts, especially where there is a diversity of land managers. That’s why we want to understand more about how projects teams are thinking about how to work with different types of tenure.  "
        },
        {
            "text": "In the Axe Landscape Recovery Project, we spoke to a tenant who supported the project’s aims and emphasised how farming and environment improvements need to go hand in hand. They also highlighted that we need to understand the impact the project would have on his farm business. "
        },
        {
            "text": "In Killerton and Holnicote, we got to see the diversity across the project area and we saw the first steps of a collaborative approach between the landowners and the tenants, demonstrating the critical role of partnership and consultation – the golden thread that runs throughout the report from the independent Tenancy Working Group. "
        },
        {
            "text": "In East Dartmoor, we spoke with representatives from several commons associations about how they see the Landscape Recovery project and what would be needed for them to really get behind it and deliver for the environment.   "
        },
        {
            "text": "We want to make sure that tenants and other land managers can raise any concerns they have about Landscape Recovery with us directly. To facilitate this, we encourage tenants, or anyone else, involved in or impacted by an existing project in Round 1 or 2 to let us know about any issues they are experiencing by contacting: LandscapeRecovery@defra.gov.uk   "
        },
        {
            "text": "When emailing, please let us know which project your comments relate to. We will ensure all information is treated confidentially. "
        },
        {
            "heading": 2,
            "text": "Capturing project details "
        },
        {
            "text": "Since signing their PDP agreements last year, all projects have been working hard to develop the details of their plans. We asked them to bring these details together into 6 documents: "
        },
        {
            "heading": 2,
            "text": "What do we do with these plans? "
        },
        {
            "text": "With the information in these plans, we can carry out a range of assessments on the project. What we’re looking for is the confidence that the projects will deliver the outcomes over the long-term agreement in a way that is good value for money and involves stakeholders.  "
        },
        {
            "text": "Our assessments will cover areas such as: "
        },
        {
            "text": "We are building our assessment processes and will continue to refine them as they are applied to the range of project plans. "
        },
        {
            "text": "Once a project has made sufficient progress on their plans, we can start discussing the content of their bespoke implementation agreement. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "We’re continuing to meet and speak with project teams on site. The recent face to face meeting with all round one projects was a great opportunity for us to gather feedback and facilitate knowledge sharing between projects. We’ll be doing similar events with our round 2 projects later this year.  "
        },
        {
            "text": "We are continuing to develop some key policy details as part of co-design, such as the implementation agreement terms and conditions."
        },
        {
            "text": "We hope that in the coming months, we will start to see some plans coming through from projects, which will allow us to start building some of these long-term agreements. "
        },
        {
            "text": "We'll continue to blog with updates, so do subscribe to the Farming blog. "
        }
    ]
}