{
    "url": "https://ofsi.blog.gov.uk/2024/02/12/new-reporting-requirements-for-designated-persons-under-the-russia-regime/",
    "title": "New reporting requirements for Designated Persons under the Russia Regime",
    "authors": [
        "Giles Thomson"
    ],
    "categories": [
        "Compliance",
        "Russia"
    ],
    "pub_date": "2024-02-12T11:08:43+00:00",
    "content": [
        {
            "text": "In June 2023, the UK government announced that it would be introducing two new reporting measures. These are to strengthen transparency of frozen assets in the UK and assist HM Treasury in monitoring compliance with, and detecting evasion of, financial sanctions. These measures came into force in December 2023, through the Russia (Sanctions) (EU Exit) (Amendment) (No. 4) Regulations 2023. I would like to take the opportunity to explain what these new obligations mean."
        },
        {
            "text": " "
        },
        {
            "text": "Immobilised Assets reporting measure"
        },
        {
            "text": "Relevant firms are now required to inform OFSI of any funds or economic resources they hold for the Central Bank of Russia (CBR), Russian Ministry of Finance (MOF) or Russian National Wealth Fund (NWF). This includes a person owned or controlled directly or indirectly by these entities, or a person acting on behalf of or at the direction of these entities. This new reporting obligation is intended to provide the government with a more comprehensive picture of the value and nature of CBR, MOF and NWF assets held in the UK. It will enable HM Treasury to track these assets over time, enhancing the UK’s ability to keep these assets immobilised."
        },
        {
            "text": "This reporting obligation will provide the UK government with more reliable data to share with international partners through channels including the Russian Elites, Proxies and Oligarchs Taskforce."
        },
        {
            "text": " "
        },
        {
            "text": "Designated Persons asset reporting measure"
        },
        {
            "text": "An additional reporting requirement has also been placed on designated persons under the Russia regime. This new requirement means Persons designated under the Russia financial sanctions regime are required to proactively provide details of their UK assets to OFSI (or their worldwide assets if they are UK persons). The government intends for this measure to be extended to the Belarus regime in early 2024."
        },
        {
            "text": "This requirement strengthens OFSI’s compliance toolkit, allowing it to cross verify information provided by relevant firms and also placing accountability for asset reporting on those who are designated. We have gone further with this measure by creating a bespoke penalty threshold. This reflects the seriousness of non-compliance and ensures the UK government can penalise those who do not comply with this requirement. The civil enforcement of this measure will also be applied on a true strict liability basis where refusal or failure to report assets is an offence subject to a civil monetary penalty where it is appropriate to do so. This is regardless of whether the DP, for example, had a reasonable excuse for failing to report."
        },
        {
            "text": "Those found to have breached financial sanctions will still have the same right to obtain a review of monetary penalties issued. This change does not in any way alter or weaken the ability to further challenge OFSI’s monetary penalties at the Upper Tribunal."
        },
        {
            "text": " "
        },
        {
            "text": "OFSI’s approach"
        },
        {
            "text": "I hope you will find updates in our guidance covering these changes to be useful. However, OFSI’s guidance is not static. We will continue to review it and our enforcement policy to ensure they best deliver and reflect our objectives."
        },
        {
            "text": "We remain open and keen to engage on issues where businesses and stakeholders consider OFSI’s guidance could go further. Do contact us through existing industry channels and our email address below."
        },
        {
            "text": "OFSI will continue to use enforcement tools robustly but fairly and proportionately, including imposing monetary penalties, to effectively enforce financial sanctions in the UK. In light of Russia’s aggressive actions in Ukraine, the private sector’s compliance with UK financial sanctions is crucial to our sanctions remaining as effective as possible, and we thank those working across industry for playing their part."
        }
    ]
}