{
    "url": "https://defradigital.blog.gov.uk/2024/02/12/spotlight-on-talent-development-meet-fast-streamer-riman-salim/",
    "title": "Spotlight on talent development: Meet Fast Streamer Riman Salim",
    "authors": [
        "Riman Salim"
    ],
    "categories": [
        "Defra digital",
        "Strategy"
    ],
    "pub_date": "2024-02-12T07:00:05+00:00",
    "content": [
        {
            "text": "In the latest from our series focusing on stories from colleagues who are employed on our talent development programmes, Riman Salim reflects on her Fast Stream experiences to date and shares some tips for anyone thinking of applying."
        },
        {
            "text": "Hi, I’m Riman and I’ve been asked to share a bit about my experience of the Fast Stream, but if you don’t read any further than this – my key message would be that the exciting things you read in the promotional materials are true!"
        },
        {
            "text": "OK, great, you’ve read on, thank you. So, first and foremost I’d highly recommend the Fast Stream to anyone; it’s a great introduction to the Civil Service."
        },
        {
            "text": "It can be intense at times, but you have so much support, both from within the organisation you’re placed in, and from the Fast Stream Emerging Talent (FSET) team too."
        },
        {
            "heading": 2,
            "text": "Why I joined the Fast Stream"
        },
        {
            "text": "I first heard about the Fast Stream when I was at university, several years before I applied in 2021. When I was made redundant due to Covid, I felt a bit lost career-wise. I saw a post about the Fast Stream on social media; the concept of being able to try out different job roles each year, whilst I found my niche, sounded like a great fit."
        },
        {
            "text": "I love learning new skills, taking on new challenges and meeting new people (I’ve previously worked in charities, risk management consultancy and, briefly, publishing) but was also looking for some stability."
        },
        {
            "text": "I officially joined the scheme in autumn 2022, working as a Digital User Researcher at the Welsh Government for a year, before moving to my current placement as a Strategy and Policy Officer in Defra."
        },
        {
            "heading": 2,
            "text": "What I’ve learned"
        },
        {
            "text": "It’s been a great experience so far and I’m learning a lot. Although adjusting quickly to a new post and the different ways of working, where organisational priorities etc can be challenging at times, it’s taught me that I’m much more resilient than I realise."
        },
        {
            "text": "And my previous career experience has been a real asset in this respect as it’s made me more confident getting stuck in and taking a lead on things from the start of a placement."
        },
        {
            "text": "Currently, I’m working on a new reporting for security metrics and KPIs, so a typical day might involve meeting with different areas in my group to understand more about the kinds of data they work with on a regular basis and thinking of creative ways to present this."
        },
        {
            "text": "For example, I’ve been teaching myself how to use PowerBI using online resources, which creates interactive visuals from data sets and makes information look more dynamic. My team have been really supportive and have made my transition into this role really smooth. Everyone is super approachable, and good at listening and supporting one another."
        },
        {
            "heading": 2,
            "text": "My top tips if you’re thinking of applying to the fast stream"
        },
        {
            "text": "I don’t know yet what I’ll do after my time on the Fast Stream, but I’m enjoying the ride and I feel ready for whatever new challenges and opportunities come my way."
        },
        {
            "text": "Do leave me a comment and tell me about your experiences, or feel free to ask me any questions if you have any."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}