{
    "url": "https://insidedio.blog.gov.uk/2024/02/12/supplier-relationships-in-dio/",
    "title": "Supplier relationships in DIO ",
    "authors": [
        "Lee Taylor"
    ],
    "categories": [
        "Commercial",
        "Procurement"
    ],
    "pub_date": "2024-02-12T17:05:26+00:00",
    "content": [
        {
            "text": "As DIO’s Supplier Relationship Management Head, I am responsible for our supplier relationships which includes a deep understanding of our supply chains cross DIO. A few years ago, DIO’s role within the MOD shifted from being a ‘landlord’ to a strategic adviser and commissioning agent for our colleagues in other areas of the department. Since then, we have improved our services and modernised our commercial practices to become more responsive to market conditions, expand our supply chains and shape the infrastructure market to ensure long-term delivery for our front-line commands. "
        },
        {
            "text": "A few years ago we developed a Commercial strategy which is designed to inform our customers, suppliers and wider government stakeholders on how we tender opportunities, how we will do business and build our presence with industry. The strategy highlights how we will create and sustain a competitive market to deliver goods and services that meet the Department’s performance and affordability needs, now and in the future. Ultimately a wider range of firms bidding for DIO contracts gives us the best choice of suppliers to provide the expertise and level of service we need.  "
        },
        {
            "heading": 2,
            "text": "Working with Small and Medium Enterprises  "
        },
        {
            "text": "One strand of our Commercial Strategy is particularly focused on how we increase access for small and medium enterprises (SMEs) to our supply chain, which also feeds in to the Defence Small and Medium-sized Enterprise Action Plan. We want to make sure we’re not just always collaborating with the same few companies and that there is opportunity for smaller companies within our supply chain. The appetite to increase diversity in our supply chain comes from the centralised MOD approach to supply chains and we are very much focused on that. "
        },
        {
            "text": "Engaging with SMEs is important for us to help bring innovation and change, increase supply chain resilience, and deliver services for our end users. We will ensure that the qualification criteria to collaborate with us doesn’t affect suppliers based on size or experience. We will encourage the suppliers we contract with directly engage with SMEs through regular market engagement events such as large conferences and smaller working groups. "
        },
        {
            "text": "To make the procurement and tender process more accessible for SMEs, who may not be used to bidding for work with an organisation like DIO, we encourage early market engagement and talk to suppliers for their input on the best ways to achieve our desired results. We are already seeing positive outcomes from working together in this way and are better engaged with a wider supplier group. For example, we have increased the number of suppliers who subscribe to our event and industry notifications to over 3,000 and the companies we network with to over 1,100.  "
        },
        {
            "heading": 2,
            "text": "​​​Opportunities available to suppliers "
        },
        {
            "text": "On a quarterly basis, we publish the Procurement Pipeline, which complements the Commercial Strategy. It informs industry what we plan to buy on behalf of our customers. The regular updates ensure that the latest information is available so any company that may be interested in bidding has a good idea of the contract value, timescales and so on. "
        },
        {
            "text": "We want to break down the barriers that are preventing new suppliers from doing business with Defence. To help with this, we hold face to face ‘Meet the Buyer’ events attracting between 150 and 200 suppliers and host two virtual pipeline webinars annually, which more than 400 external suppliers usually attend. "
        },
        {
            "text": "I look forward to working with colleagues in DIO Commercial, the wider organisation, our customers, and the supply chain as we continue to grow our capability and capacity to deliver for Defence. "
        },
        {
            "text": " "
        }
    ]
}