{
    "url": "https://marinedevelopments.blog.gov.uk/2024/02/12/the-last-custodians-a-short-movie-by-fass-recipients-lyme-bay-fishermens-cic/",
    "title": "“The Last Custodians” a short movie by FaSS recipients Lyme Bay Fisherman’s CIC",
    "authors": [
        "Amy Blackham, Communications & Engagement Manager"
    ],
    "categories": [
        "fisheries",
        "Grant funding"
    ],
    "pub_date": "2024-02-12T17:17:05+00:00",
    "content": [
        {
            "text": "MMO is delighted to share the latest news story from Lyme Bay Fisherman’s CIC, who just unveiled an insightful short film on the untold stories of inshore fishing."
        },
        {
            "text": "At the beginning of 2023 a group of 50 small scale inshore fisherman from across the four ports of Lyme Bay, Axmouth, Beer, Lyme Regis and West Bay. With support of government funding via the Marine Management Organisation (MMO) Fisheries and Seafood Scheme (FaSS) and the BLUE Marine Foundation, they came together to set up the UKs first fisherman led, grass roots community interest company (CIC) – Lyme Bay Fisherman’s CIC."
        },
        {
            "text": "Over the last 12 months, they have created a seafood trail, schools outreach program, fishy scavenger hunts involving businesses and shops across the four ports and engaged with regulators."
        },
        {
            "text": "Now, these trailblazing fishermen are looking to help others around the coast to set up and fund their own CIC and have their voices heard too."
        },
        {
            "text": "This short film, which premiered at Seaton Theatre on 8 February 2024, tells of their journey to form a representative group to engage with their local community, government regulators and ensure their voices are heard."
        },
        {
            "text": "The film follows scallop divers, potters, trawlermen, netters and rod and line fishermen through their daily routines discussing their hopes and fears for the future of these iconic coastal fleets some of whom can trace their family fishing histories back to the 1600s."
        },
        {
            "text": "Most of the membership have small vessels under 8 metres and represent traditional fishing methods and a diminishing coastal fleet around UK coasts of small-scale fishermen after a challenging decade."
        },
        {
            "text": "It is hoped that the film will help highlight the fragility of these fleets around the UK coasts and get other fishermen in small coastal towns come together to create organisations of their own. Lyme Bay Fisherman’s CIC is now fundraising to create a how-to guide for other small-scale fleets to follow."
        },
        {
            "text": "CEO of Lyme Bay Fisherman’s CIC, Mandy Wolfe, said:"
        },
        {
            "text": "“We are so grateful to MMO and BLUE for their support in getting our CIC up and running and getting this film made."
        },
        {
            "text": "“No one has done this before and the MMO grants team have been fantastic throughout our evolution to help make sure we get the support that was needed to turn the aspiration into a reality."
        },
        {
            "text": "“For years fishers and regulators have been complaining that small scale coastal fleets are just not in the room when policy is developed, and fishing more broadly is considered."
        },
        {
            "text": "“This CIC changes that and we are already seeing our ports becoming a well-trodden path when regulators are visiting the coast and holding meetings as well as amazing community engagement and schools outreach projects."
        },
        {
            "text": "“Since we launched, we have been contacted by so many fishermen around the coast that we are looking to fund raise and create a how-to guide to help them follow our path, written by fishermen, for fishermen”."
        },
        {
            "text": "Paul Errington, MMO’s Head of Finance said:"
        },
        {
            "text": "“The Lyme Bay Fisherman’s CIC project is great example of how we’ve been able to support groups of fishers to co-ordinate their efforts, share best practice and ensure they maximise opportunities through funding, research and networking. They have already undertaken several initiatives since receiving their FaSS grant award just over a year ago."
        },
        {
            "text": "“This short film highlights how working cooperatively helps shine a light on the experiences, heritage, and voices of the fishing community. We continue to wish them every success with their ambitions.”"
        },
        {
            "text": "FaSS, which is due to re-open later this month, helps projects with real potential to boost business resilience and increase sustainability across our world-class fishing industry. Since opening in 2021, £27 million invested in over 1,300 projects supporting England’s catching, aquaculture, and processing sectors, as well as projects that are improving the marine environment."
        },
        {
            "text": "Mark Newton, Chair of Lyme Bay Fisherman’s CIC, said:"
        },
        {
            "text": "“It has been an amazing first inaugural year for our CIC, I am so proud of our membership that has seen fishermen from four ports come together for the greater good. The film offers a snapshot of their lives and aspirations, and we hope that it will help raise awareness of coastal communities and the important role these traditional fleets play in them.”"
        },
        {
            "text": "Josh McCarty Director and Executive Producer of The Last Custodians said:"
        },
        {
            "text": "“It has been an honour to work with LBFCIC on this project and to get to learn more about these brave fishermen and their lives during our filming. What was most striking is that even after a tough couple of decades for this sector the passion for their craft, their desire to help and find the custodians of the future runs deep.”"
        },
        {
            "text": "Sam Fanshaw Senior UK Projects Manager for Blue Marine said:"
        },
        {
            "text": "“Blue Marine has worked for over a decade with the Lyme Bay fishing community to support low impact fisheries and marine life recovery within the MPA. We are so pleased to have supported the local fishermen on their journey to create a CIC that champions marine conservation and sustainable fishing practices and congratulate them for their success in engaging such a broad audience from school children to government ministers”."
        },
        {
            "text": "More information into how the CIC was established can be found here:"
        },
        {
            "text": "https://lbfcic.com/new-lyme-bay-fishermans-cic-a-community-focus-others-could-follow"
        }
    ]
}