{
    "url": "https://educationhub.blog.gov.uk/2024/02/04/teacher-degree-apprenticeships-how-they-work-and-when-to-apply/",
    "title": "Teacher Degree Apprenticeships: how they work and when to apply",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2024-02-04T00:01:46+00:00",
    "content": [
        {
            "text": "Trainee teachers will soon be able to gain a degree through an apprenticeship, instead of through the traditional university route into the profession."
        },
        {
            "text": "Degree apprenticeships are growing in popularity as they offer the chance for people to earn while they learn, and gain a degree without student debt."
        },
        {
            "text": "They are already on offer in professions including nursing, law and even space engineering, and a new Teacher Degree Apprenticeship (TDA) will soon become available."
        },
        {
            "text": "It will enable schools across the country to recruit thousands more teachers into classrooms and will open opportunities for more people to get into teaching."
        },
        {
            "text": "The new apprenticeships will be offered alongside the university route, so aspirational teachers will be able to choose the path that works best for them."
        },
        {
            "heading": 3,
            "text": "What are Teacher Degree Apprenticeships?"
        },
        {
            "text": "Normally, teacher training courses require candidates to already have a degree to be eligible."
        },
        {
            "text": "With a TDA, you’ll work in a school while you gain qualified teacher status (QTS), which you need in order to teach in most schools in England. At the same time, you’ll be studying for a degree."
        },
        {
            "text": "It means trainees won’t take on student debt and will earn while they learn, supporting those who may not have the financial means to do a traditional university-based teacher training programme."
        },
        {
            "text": "It will be available for people to train as both primary and secondary teachers."
        },
        {
            "heading": 3,
            "text": "When can I apply for a Teacher Degree Apprenticeship?"
        },
        {
            "text": "Subject to final approval, schools will be able to start recruiting apprentices from autumn 2024, with the first trainees beginning the programme in 2025."
        },
        {
            "heading": 3,
            "text": "How do I apply for a Teacher Degree Apprenticeship?"
        },
        {
            "text": "We expect applications to open from autumn 2024 for training to start in autumn 2025."
        },
        {
            "heading": 3,
            "text": "Who is eligible and what qualifications do I need?"
        },
        {
            "text": "The TDA will be available both to those beginning their careers and those currently in employment who are interested in pursuing a career in teaching, including teaching assistants and career changers."
        },
        {
            "text": "Candidates won’t need to already have a degree."
        },
        {
            "text": "Further information on eligibility criteria will be provided at a later date."
        },
        {
            "heading": 3,
            "text": "How much will trainees earn?"
        },
        {
            "text": "Trainees will start working in the classroom from day one. As they develop skills to become excellent teachers, they will gradually scale up their teaching practice."
        },
        {
            "text": "Salaries will reflect trainee responsibilities at each stage of their course. Details of exact earnings will be announced at a later date."
        },
        {
            "text": "On top of receiving a salary, their training and qualifications will be fully funded."
        },
        {
            "heading": 3,
            "text": "How is this different to other teaching qualifications?"
        },
        {
            "text": "Currently, except for fee-funded undergraduate initial teacher training, all routes into teaching require trainees to already have a degree or undertake full time, fee-funded study."
        },
        {
            "text": "The TDA will be an exciting and unique route into teaching that builds on the existing Postgraduate Teaching Apprenticeship (PGTA) and will be the only route that provides a salary as well as the training to get both a degree and QTS."
        },
        {
            "heading": 3,
            "text": "Will this lower teaching standards?"
        },
        {
            "text": "No. On completion, TDA trainees will have the same qualifications as someone who has qualified as a teacher through any other teacher training route."
        },
        {
            "text": "This doesn’t mean trainees will be treated as qualified teachers from the beginning. They will work under supervision at an appropriate level that is suitable to their stage of training."
        },
        {
            "heading": 3,
            "text": "What other routes are there into teaching?"
        },
        {
            "text": "There are several routes to gaining QTS, including through university study, school-led training, or charitable organisations like Teach First."
        },
        {
            "text": "Find out more via Get Into Teaching."
        }
    ]
}