{
    "url": "https://educationinspection.blog.gov.uk/2025/07/09/highlights-from-our-area-send-inspection-framework-review/",
    "title": "Highlights from our area SEND inspection framework review",
    "authors": [
        "Lee Owston, National Director, Education",
        "Yvette Stanley, National Director, Social Care and Regulation"
    ],
    "categories": [
        "Area SEND"
    ],
    "pub_date": "2025-07-09T14:02:00+01:00",
    "content": [
        {
            "text": "As you may know, we recently reviewed the area special educational needs and disabilities (area SEND) inspection framework."
        },
        {
            "text": "We’ve just published our findings from that review and shared our next steps, so we wanted to talk you through the most important points in this blog post."
        },
        {
            "text": "For background, our blog from December 2024 set out what we were aiming to achieve through the review, and how we would go about doing that."
        },
        {
            "heading": 2,
            "text": "Findings from the first 2 years of inspection"
        },
        {
            "text": "Working with the Care Quality Commission (CQC), we looked at what we’ve learned from the first 2 years under the framework, and the 54 inspections we’ve done."
        },
        {
            "text": "Those inspections included surveys with a total of over 67,000 responses. Of these responses, we had:"
        },
        {
            "text": "We analysed inspection reports and identified common themes in the main factors that affect the support and help that children and young people with SEND receive in a local area. These include:"
        },
        {
            "text": "We’ll finish the first cycle of inspections of all 153 local area partnerships in 2027."
        },
        {
            "text": "We want to continue to learn from inspections so that we can share and develop the knowledge and skills of our inspection workforce, support continual improvement at a local level, and inform national decision-making."
        },
        {
            "heading": 2,
            "text": "Who we heard from"
        },
        {
            "text": "We received feedback from 27 engagement events across the sector, including from:"
        },
        {
            "text": "We also heard from Ofsted and CQC inspectors who carry out area SEND inspections, as well as policy colleagues in Ofsted, the Department for Education (DfE) and NHS England."
        },
        {
            "heading": 2,
            "text": "Changes we’ve made"
        },
        {
            "text": "We’ve made changes, and will make more, in response to the feedback we received throughout the review: these are set out in our findings."
        },
        {
            "text": "At the outset of the review, we were clear that the scope of changes would be limited to inspection practice. Details of the government’s intended approach to SEND reform will be set out in a schools white paper in the autumn, so making more fundamental changes to area SEND inspection methodology would have been premature. The changes we announced this month have so far been well received."
        },
        {
            "text": "We’ve increased the amount of time that inspectors will have during monitoring inspections to focus their lines of enquiry on the most pressing issues and engage with a range of young people and their families."
        },
        {
            "text": "We heard from some local area partnerships that inspections can be resource-intensive and could be more supportive. In response, we’ve simplified and streamlined the data requests that we make ahead of an inspection."
        },
        {
            "text": "We’re also improving coordination with other inspection frameworks and with the DfE and NHS England regional teams to help make sure that, where areas are already subject to significant intervention and oversight, this is taken into account. For example, where an area is subject to monitoring activity under both the area SEND and inspection of local authority children’s services (ILACS) frameworks, we will try to make sure we coordinate visits and inspections under each framework."
        },
        {
            "text": "Additionally, we’ve clarified that the focus of area SEND engagement meetings will be a supportive discussion about the area, including the successes the partnership has achieved and the challenges it faces. And we’ll schedule meetings to make sure they’re targeted proportionately."
        },
        {
            "heading": 2,
            "text": "How outcomes under different inspection frameworks relate to one another"
        },
        {
            "text": "Some stakeholders have previously said that they think our area SEND inspection outcomes are ‘inconsistent’ with other provision in the same local area."
        },
        {
            "text": "It is the case that many of the schools and children’s services in a local area may be good or outstanding but we may judge the area SEND provision in those same local areas as inconsistent or even to have widespread failings."
        },
        {
            "text": "But SEND and ILACS inspections are complex. Each looks – at a system level – at either SEND or child protection partnerships. This is different from an inspection at setting level (a school, for example), which looks at the identification, support and progress made by a cohort of children with SEND."
        },
        {
            "text": "So, we would not expect inspection outcomes under one framework to mirror outcomes under the others."
        },
        {
            "text": "For example, a school may be delivering outstanding education despite the absence of a strong partnership that looks after SEND arrangements across education, health and social care in its local area."
        },
        {
            "text": "This isn’t to say that we carry out different inspections in isolation from each other: far from it. Inspectors will consult the latest area SEND inspection report to understand the local context in which the setting they’re inspecting operates. They’ll then be able to focus their lines of enquiry accordingly."
        },
        {
            "heading": 2,
            "text": "Webinars"
        },
        {
            "text": "We hosted two webinars on 3 July to explain the changes we’ve made to the area SEND inspection framework. "
        },
        {
            "text": "These gave professionals and parents/carers the opportunity to ask questions, and we recorded them so you can watch them back on our YouTube channel:"
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "We’ll continue meeting with local areas and carrying out inspections under the framework. From this term onwards, this will include monitoring inspections for those areas that we found to have widespread and/or systemic failings."
        },
        {
            "text": "We want to ensure the best outcomes possible for children and young people with SEND. This means continuously improving our inspection frameworks so that we learn from our experience and keep our inspections relevant."
        },
        {
            "text": "We’d like to thank everyone who was involved in the review for contributing to this process; your feedback, suggestions, challenge, and praise have been – and will continue to be – invaluable."
        }
    ]
}