{
    "url": "https://buyingforschools.blog.gov.uk/2025/07/09/plan-technology-for-your-school-free-support-for-planning-implementing-and-using-technology/",
    "title": "Plan Technology for Your School: Free support for planning, implementing and using technology",
    "authors": [
        "Lara le Court de Billot, Senior Policy Advisor, School Technology Services, Department for Education"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2025-07-09T10:20:26+01:00",
    "content": [
        {
            "text": "In this blog post, Lara le Court de Billot, Senior Policy Advisor in the Department for Education’s (DfE) School Technology Services team, shares insights into plan technology for your school — a free, practical service designed to help schools make informed decisions about technology.  "
        },
        {
            "text": "In today's rapidly evolving educational landscape, effective use of technology is more crucial than ever. Schools are increasingly recognising the need to integrate digital tools and strategies to enhance learning, streamline operations, and reduce staff workload. However, navigating the complexities of technology planning and implementation can be daunting. This is where the plan technology for your school service comes in, offering support to schools through their digital journey.  "
        },
        {
            "heading": 3,
            "text": "Why use 'Plan technology for your school'?"
        },
        {
            "text": "The plan technology for your school service is designed to help schools harness the power of technology safely and effectively. By strategically assessing and implementing technology, schools can maximise resources within their available budgets. A well-planned digital strategy can improve staff workload efficiencies by supporting the automation of routine tasks and improving communication and collaboration tools. Furthermore, it can lead to cost savings for schools.  "
        },
        {
            "text": "Plan technology for your school supports schools in creating and developing lasting digital strategies that align with best practices and meet the Department for Education's (DfE) digital and technology standards.  "
        },
        {
            "heading": 3,
            "text": "What does the service offer?"
        },
        {
            "text": "Plan technology for your school is a free service available to all schools. Developed in collaboration with school leaders and technical experts, it helps schools to better understand their current digital status, identify areas for improvement, and implement effective strategies. The service allows schools to:  "
        },
        {
            "text": "By offering these insights, the service empowers schools to make informed decisions about their technology investments.  "
        },
        {
            "heading": 3,
            "text": "What plan technology for your school users say"
        },
        {
            "text": "We are eager to continually develop and improve the service, and as part of this we’ve asked a variety of school staff about their experience using the plan technology for your school service.   "
        },
        {
            "text": "Users have commented that:  "
        },
        {
            "text": " \"This is the type of service I am really happy to see being provided.\"  "
        },
        {
            "text": "\"This is a really easy to understand - self-explanatory overview of what you need to do.\" "
        },
        {
            "text": "“Using the DfE digital and technology standards and now the plan technology for your school service acts as a bridge between those different aspects of the school - the technical side, the strategic side and then that operational business side.” "
        },
        {
            "text": "“We started by reading DfE guidance. Both our IT manager and I did cyber training, and then I noticed that the DfE Digital and Technology standards mentioned the plan technology for your school service. This service set us on the path to developing a comprehensive technology plan. Before using the service, I wouldn't have known where to check or how to check and what we needed to prioritise.” "
        },
        {
            "text": "\"The recommendations and guidance were the only reasons we have a solid plan now. It helped us prioritise and understand what needed to be done.\" "
        },
        {
            "heading": 3,
            "text": "How to Access the Service"
        },
        {
            "text": "The plan technology for your school service is designed to be used by anyone involved in improving technology within a school. This includes:"
        },
        {
            "text": "To access the service you’ll need a DfE sign-in account, which allows you to save and return to your self-assessment answers and bespoke recommendations. More information about managing a DfE sign-in account can be found on the gov.uk website."
        },
        {
            "heading": 3,
            "text": "Continuous Improvement and User Engagement"
        },
        {
            "text": "We are committed to continually improving the plan technology for your school service. New features and content are regularly added to help schools plan and manage more aspects of their technology needs."
        },
        {
            "text": "We also value user feedback and encourage schools to participate in our user research to help shape the future of our services. If you would like to be involved in our user research, you can complete the form by clicking here."
        },
        {
            "text": "To get started with the next stage of your digital journey, visit plan technology for your school on the gov.uk website."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}