{
    "url": "https://educationhub.blog.gov.uk/2023/09/03/education-secretary-my-first-duty-is-to-protect-the-safety-of-pupils/",
    "title": "Education Secretary: My first duty is to protect the safety of pupils",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-09-03T13:16:51+01:00",
    "content": [
        {
            "text": "This article by Education Secretary Gillian Keegan was first published in The Sun on 3 September 2023. "
        },
        {
            "text": "I understand how important the start of each school year is for families across this country."
        },
        {
            "text": "So no one should be under any illusions over how carefully we took the decision to close even a small number of classrooms."
        },
        {
            "text": "The simple fact is we had no choice."
        },
        {
            "text": "As Secretary of State for Education, my first duty is to protect the safety of pupils, teachers and school workers."
        },
        {
            "text": "But I want to reassure families that this is not a return to the dark days of school lockdowns."
        },
        {
            "text": "We all have to make difficult decisions in life and responsible government is about getting them right. That means looking at evidence and acting, even when the trade-offs are significant."
        },
        {
            "text": "That’s the position I faced when new evidence was presented to me indicating concrete which forms part of certain school buildings was no longer safe."
        },
        {
            "text": "This was based on a handful of cases — in education and outside — where Reinforced Autoclaved Aerated Concrete, or RAAC, had failed unexpectedly."
        },
        {
            "text": "As we have already said, the most recent case was only toward the end of August."
        },
        {
            "text": "I understand the anxiety that this has caused parents, particularly those with children directly impacted, so soon after the disruption caused by the pandemic."
        },
        {
            "text": "But this is not pandemic school closures, and certainly not a return to extended home learning."
        },
        {
            "text": "Fifty two of the 156 schools and colleges affected have already had mitigation work put in place — and in the minority of cases where home learning has been required, it has been for days not weeks."
        },
        {
            "text": "Some projects can be more challenging but some are simply single class-rooms where the mitigation could just be not using that room."
        },
        {
            "text": "RAAC was already known as a risk, with research conducted by the Government in the 1990s, but the experts had been clear that where it was rated “non-critical”, spaces could be occupied with ongoing monitoring."
        },
        {
            "text": "These new cases questioned that view, and taking a risk with children’s safety is not something I am prepared to do."
        },
        {
            "text": "The Department for Education oversees thousands of schools, many of which might well not have their own large estate management teams in the way hospitals, for example, do."
        },
        {
            "text": "It’s thanks to the proactive approach this Government has taken that we were in a position to take action."
        },
        {
            "text": "In 2018 we sent a warning notice, alongside the Local Government Association, to councils and academy trusts as the bodies responsible for managing the safety and maintenance of our schools."
        },
        {
            "text": "In 2022 we then sent a request for detailed information to the same group asking them to tell us if they thought they had RAAC in their buildings."
        },
        {
            "text": "Where schools tell us RAAC is suspected, we send out an engineer to confirm it. In most cases, RAAC isn’t present, but that work means we have a clear picture of where RAAC is."
        },
        {
            "text": "For some schools, the engineering surveys were deemed critical so immediate action was taken. Other schools, deemed non-critical, were allowed to stay in place, although mitigating and monitoring it was still advised."
        },
        {
            "text": "This process has meant we’ve been able to target our work."
        },
        {
            "text": "The numbers are important. We have over 22,000 schools and colleges in this country. So far RAAC has been con-firmed in 156. We are continuing to survey schools that think they might have it, but aren’t sure, very quickly."
        },
        {
            "text": "But imagine if we hadn’t had these surveys. We would have been much less clear about where RAAC is."
        },
        {
            "text": "It is our monitoring that meant evidence came to light, which is why this week I have written to my counterparts in the devolved administrations to offer support and share best practices."
        },
        {
            "text": "This is of the utmost urgency so we can ensure children are safe, whether in England or the rest of the UK."
        },
        {
            "text": "In England, most schools have responded to our questionnaire but there are a few more to come and we are continuing to work at pace asking schools to tell us if they’re worried."
        },
        {
            "text": "We continue to send engineers rapidly to those cases."
        },
        {
            "text": "But parents can be reassured that the vast majority of schools are not and will not be affected."
        },
        {
            "text": "Of 156 confirmed cases, 52 schools had already responded to the risk, leaving 104 that needed to act straight away."
        },
        {
            "text": "As we keep surveying schools who have told us they are worried, some more may need to take action, but we are working with them to make sure they all have contingency plans."
        },
        {
            "text": "Of these, the majority will be able to continue operating on site, with only a small amount of space affected."
        },
        {
            "text": "A minority may need to move some or all of their children, with a short period of off-site learning or, as a last resort, remote learning."
        },
        {
            "text": "We’re supporting each of those schools with a caseworker, and funding to cover immediate measures like temporary classrooms, to keep face- to-face education going."
        },
        {
            "text": "There have been calls to name schools impacted — and we will, but only when parents have been informed and schools given time to respond."
        },
        {
            "text": "That’s the right thing to do because parents should hear from their school first, and schools in turn have time to focus — supported by teams working round the clock."
        },
        {
            "text": "Doing otherwise would bring unmanageable attention to those schools and parents, and be unfair."
        },
        {
            "text": "I’ll set out our plan to keep parents and the public informed on progress, in Parliament next week."
        },
        {
            "text": "Disrupting school plans for the new term so close to children going back was the last thing I wanted, but doing anything else with the evidence presented to us would have been unforgivable."
        },
        {
            "text": "Being in Government is about looking at the evidence and acting in the public interest — never more so than when it comes to the safety of children."
        }
    ]
}