{
    "url": "https://despatch.blog.gov.uk/2022/08/10/how-we-developed-the-ready-to-pass-campaign/",
    "title": "How we developed the ‘Ready to Pass?’ campaign",
    "authors": [
        "Abigail Britten"
    ],
    "categories": [
        "Driving instructors",
        "Ready to Pass?"
    ],
    "pub_date": "2022-08-10T16:07:46+01:00",
    "content": [
        {
            "text": "We launched our ‘Ready to Pass?’ campaign a few weeks ago now. I’m grateful to everyone who has promoted the campaign with their pupils and the wider public."
        },
        {
            "text": "In this blog post, I want to tell you more about:"
        },
        {
            "text": "But let’s start at the beginning with a reminder of what we’re trying to achieve with your help."
        },
        {
            "heading": 2,
            "text": "What we want to achieve"
        },
        {
            "text": "In our campaign, we’re trying to change the behaviour of learner drivers so they:"
        },
        {
            "heading": 2,
            "text": "Finding out what attitudes and intentions we need to change"
        },
        {
            "text": "The most critical thing we’ve had to do is understand all of the detail of why learner drivers are doing what they’re doing."
        },
        {
            "text": "Yes, we know it’s caused by the longer waiting times. But understanding who and what influences them, what their attitudes are and what their intentions are really helps to make sure we can write things in a way that are more likely to get through to them."
        },
        {
            "text": "To do this, we’ve used a mix of:"
        },
        {
            "text": "Combined, it’s helped us build up a good picture of the attitudes, intentions and behaviours of learner drivers. With that insight gathered, the next step was to design communications to start to change the behaviour."
        },
        {
            "heading": 2,
            "text": "Why we called it ‘Ready to Pass?’"
        },
        {
            "text": "Our research showed that when searching online, perhaps not unsurprisingly, learner drivers are looking for things like:"
        },
        {
            "text": "They’re not searching for ‘safe driving for life’."
        },
        {
            "text": "To get in front of those people, and to get towards the top of search engine results, we’ve got to use the language learner drivers actually use."
        },
        {
            "text": "That’s why we called the campaign ‘Ready to Pass?’."
        },
        {
            "text": "For some people, this might seem like the campaign is immediately far too test-focused. But once we can get them to our website, we can then start to expand on the importance of having the skills they’ll need to help them through a lifetime of safe driving."
        },
        {
            "heading": 3,
            "text": "Helping learner drivers understand what it means to be ready to pass"
        },
        {
            "text": "Our research with learner drivers showed that many felt they did not understand what it actually means to be ready to take the driving test."
        },
        {
            "text": "It’s another reason our campaign is called ‘Ready to Pass?’. And it’s why part of the website includes a 5-point checklist to help learner drivers reflect on their progress in a manageable way."
        },
        {
            "heading": 2,
            "text": "Choosing where to communicate"
        },
        {
            "text": "The next step was to decide how to communicate about the campaign website."
        },
        {
            "heading": 3,
            "text": "Email"
        },
        {
            "text": "As we have the email addresses of learner drivers who have booked a driving test, we can send them emails at different points in the lead up to their test."
        },
        {
            "text": "There are 6 main emails. Learner drivers will not necessarily get all 6 – it depends on how far away their test is."
        },
        {
            "text": "Here’s a summary of when they’re sent and what they’re about:"
        },
        {
            "heading": 4,
            "text": "Our research shows most learners expect to pass"
        },
        {
            "text": "Our research shows that learner drivers who fail the driving test think they were overly confident in their ability to pass and just expected to pass."
        },
        {
            "text": "In research interviews, learner drivers also said they want to take a test as soon as possible to avoid the cost of lessons and shorten the amount of time it takes to access more affordable insurance. They also say there’s no disincentive to taking multiple attempts to pass the test."
        },
        {
            "text": "So try to ‘nudge’ the behaviour, we’re including 2 pieces of information in the emails to give them a fuller picture and help them reflect. These are:"
        },
        {
            "text": "We’re keeping the messages under review, and we’re carrying out further research to see if this is starting to change attitudes and behaviours."
        },
        {
            "heading": 3,
            "text": "Instagram"
        },
        {
            "text": "We’ve relaunched the DVSA Instagram channel to help us connect with learner drivers and get our campaign messages in front of them."
        },
        {
            "text": "Research by Ofcom has shown that Instagram is the top mobile app used by those aged 15 to 24. In September 2021, 90% of people aged 15 to 24 who are online visited Instagram. It’s a place we definitely need to be so learner drivers see our messages."
        },
        {
            "heading": 2,
            "text": "Evaluating, changing and improving"
        },
        {
            "text": "The campaign has been running for just over 3 weeks now. It’s still far too early to know if it’s starting to provide all the outcomes we want."
        },
        {
            "text": "But we can start to see some important data. So far we know that:"
        },
        {
            "heading": 3,
            "text": "Making changes to the website and emails"
        },
        {
            "text": "As we learn more about what’s working well and what could work better, we’ll make changes to the website and emails. This is not just a case of us putting something out there and walking away from it."
        },
        {
            "text": "Since launching, we’ve made improvements to:"
        },
        {
            "text": "Over the coming weeks we’ll continue to monitor all the data we’re getting. And as we learn more, we’ll keep improving. That could be from things as simple as tweaking the wording of an email, right through to launching another channel to reach learner drivers."
        },
        {
            "text": "We’ll keep blogging as we go so you can keep up to date and learn as we do."
        }
    ]
}