{
    "url": "https://insidehmcts.blog.gov.uk/2021/12/07/a-strategy-for-a-data-led-organisation/",
    "title": "A strategy for a data-led organisation",
    "authors": [
        "Amy Caldwell-Nichols"
    ],
    "categories": [
        "Working at HMCTS"
    ],
    "pub_date": "2021-12-07T11:30:09+00:00",
    "content": [
        {
            "text": "Administering the court and tribunal system can be complicated and is a weighty responsibility. Some of the most vulnerable people in society look to us to make their day in court, their probate application, divorce or civil case as straight-forward as possible."
        },
        {
            "text": "Reliable, robust, and easily accessible data is key to ensuring we live up to this responsibility – and reassure others that we’re doing so.  Our Data Strategy – published today – lays out how we will collect, manage, and share data to give us these insights, help improve our services where needed and give confidence to our colleagues and court users."
        },
        {
            "text": "The strategy will deliver significant benefits; from improving our decisions because we better understand our users and have a stronger evidence base, to improving our operational effectiveness because we can dig into the detail of how different services perform."
        },
        {
            "text": "This work is already underway – as outlined in our latest update report into data in the courts and tribunals system – and we have examples of where we’ve used data to identify issues and resolve them"
        },
        {
            "text": "Why we need a data strategy"
        },
        {
            "text": "Thousands of pieces of data flow through HMCTS every day – as part of our Reform programme, our day-to-day operations and our response to, and recovery from, the impact of the pandemic. We can use this data to forecast our business needs, understand our performance, identify and resolve issues and set priorities – so having better, well-managed and easy-to-use data will help us provide the best service possible to those who rely on us."
        },
        {
            "text": "But, while HMCTS is data rich, we don’t currently make the most of our raw data and we have work to do before we can."
        },
        {
            "text": "And now is the time to do it. Data is key to our efforts to recover from the pandemic and, in the longer term, will enable the evaluation of our multi-year Reform program. So, our strategy comes at an important time for HMCTS as the programme enters its last 18 months."
        },
        {
            "text": "Five pillars to support the strategy"
        },
        {
            "text": "Our Data Strategy plots a course to a future where HMCTS is a data-led organisation. At its core are five pillars which lay the foundation on which we can build a path towards a data-fluent future."
        },
        {
            "text": "The pillars are to:"
        },
        {
            "text": "Developing these pillars means our data will be accessible and comprehensible across the business. They will give us better evidence of where and how we can improve our services. They mean we will work more efficiently and use our resource to deliver more complex, proactive insights. They will help us create a culture where everyone is able to find and use the data they need. And, importantly, they will build confidence in HMCTS and improve access to justice for all."
        },
        {
            "text": "Publishing and sharing our data"
        },
        {
            "text": "Justice must be seen to be done, and data is key to that transparency. It provides information crucial to understanding and scrutinising the wider justice system. But that scrutiny needs to be based on clear and robust data – and our Data Strategy provides the roadmap to build these foundations."
        },
        {
            "text": "Robust data must also be open to scrutiny and our strategy explains how we’re going to publish, share and give access to our data. For example, we plan to build a data catalogue that will give others easy access to our open data and clear guidance on what other data is available, for what purpose and how to request access."
        },
        {
            "text": "The start of our journey"
        },
        {
            "text": "While we have been working on improving how we collect, manage and share data for a while, this strategy brings that work together in one place and plots out a clear course to a data-driven organisation. We still have work to do – and it will take time – but we now have the clarity and direction to step towards our data-rich future with confidence and purpose."
        }
    ]
}