{
    "url": "https://ruralpayments.blog.gov.uk/2021/12/07/an-update-on-payments-for-our-land-schemes/",
    "title": "An update on payments for our land schemes",
    "authors": [
        "Sandy Kapila"
    ],
    "categories": [
        "Agricultural Transition",
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2021-12-07T13:25:34+00:00",
    "content": [
        {
            "text": "December is an important time of the year for farming communities and the Agency. We started to release payments on our land schemes (Basic Payment Scheme, Countryside Stewardship and Environmental Stewardship) annual claims from 1 December. This represents the culmination of efforts from many people across the Agency. We’ve announced today that we’ve delivered a strong opening payment performance, in particular on BPS, and I am proud of our efforts. But I thought it may be helpful to add a little more colour."
        },
        {
            "text": "We get the annual applications/claims in spring each year. They are then run through a series of checks which help us validate and verify the claim data with the control data we hold. Where there are differences, these are investigated and resolved by our teams allowing the claim to flow through to payment. For some claims we need to undertake further work, for example: to include the outcome of inspection results; allocate common land; and ask for additional information from farmers and land managers. Once these actions are completed the claims are ready for payment."
        },
        {
            "text": "I know from first-hand the importance of these payments to the rural economy. While the payment window runs between December and June, every year, we always strive to pay as promptly as we can. If the claim is ready, we pay it."
        },
        {
            "text": "That said, it can take longer to complete our checks for some claims. There are a number of reasons for this additional time. The allocation of common land can be a complex process while we allocate the available area to those claiming on the common; sometimes the outcome of inspections can take time to consider and establish the impact on the claim and/or agreement; we can’t progress some claims as they are reliant on the completion of legal work, such as probate; and some just take time as a result of their size."
        },
        {
            "text": "Our payment performance on BPS has improved since its introduction in 2015. We have also increased the number of full payments to CS and ES claimants earlier, since we took on the schemes in 2018. Our performance for 2021 has seen another improvement step."
        },
        {
            "text": "This year is also different for another reason. Direct Payments in England will be phased out starting from this year (2021) through to 2027. The approach is designed to help everyone manage the transition away from Direct Payments as smoothly as possible. The same amount will be available to the farming sector in every year of this Parliament, though the way it is distributed will change. Funds will be redirected straight back into Countryside Stewardship and our new schemes. More details can be found on the Rural payments and grants page on GOV.UK."
        },
        {
            "text": "Progressive reductions will be made to Basic Payment Scheme (BPS) payments from this year’s (2021) scheme year and then to delinked payments when these replace BPS in 2024. We have produced a helpful tool that shows how your BPS payments may decrease over the agricultural transition period and is worth a look if you believe you have not had what you were expecting. We will be sending out claim statements that will also give you some additional information which will be helpful. If this still shows a difference you can use our BPS query process to get in touch."
        },
        {
            "text": "We plan to get as many payments paid as promptly as possible, but I know that in certain instances there can be the need for support. We’ve been working with the farming help organisations and banking representatives on how we can work together to help."
        },
        {
            "text": "We’ll provide a further update early in the new year."
        }
    ]
}