{
    "url": "https://teaching.blog.gov.uk/2021/12/07/becoming-an-academic-mentor-making-a-difference-to-pupils-education-most-impacted-by-the-pandemic/",
    "title": "Becoming an Academic Mentor: making a difference to pupils’ education most impacted by the pandemic",
    "authors": [
        "Suzanne Jones"
    ],
    "categories": [
        "Primary schools"
    ],
    "pub_date": "2021-12-07T14:58:03+00:00",
    "content": [
        {
            "text": "Suzanne Jones is currently an Academic Mentor at Thorpedene Primary School in Essex as part of the National Tutoring Programme. She discusses what motivated her to become an Academic Mentor and what the role entails."
        },
        {
            "text": "When I found out about the Academic Mentor role, it immediately appealed to me as I was looking for a change in career and knew I wanted to work with children or young people in a mentoring capacity. I had precious experience of working in a school, during my year abroad at university, where I taught English to primary school age children in France."
        },
        {
            "text": "The National Tutoring Programme aims to support those children whose education has been most disrupted over the past 18 months. What resonated most was the opportunity to play a small role in ensuring that every child, regardless of background or location, has access to the best education possible. From personal experience, I know that tailored attention and encouragement can help pupils to achieve and build their confidence."
        },
        {
            "text": "Following acceptance onto the programme, I completed a two-week online training course and was then placed in a primary school in Essex which, coincidentally, had been my own. I quickly settled into the school and feel very much part of the team."
        },
        {
            "text": "Role & responsibilities "
        },
        {
            "text": "I work across Year 5, taking children for one-to-one and small group tuition sessions. My focus is on all aspects of literacy. This includes reading, spelling, sentence structure and handwriting. As well as more specialised projects, such as creating a school newspaper front page."
        },
        {
            "text": "I plan my own sessions, which I really enjoy. There is real satisfaction in knowing that you have planned a quality lesson which has achieved its aims and made a real impact on the child. I regularly liaise with teaching staff for guidance and support, to ensure that my content meets curriculum needs. My colleagues have provided invaluable insight into the pupils, this helps me to create tailored and impactful resources to best support their individual needs."
        },
        {
            "text": "Building relationships with pupils takes time and patience. Each child has their own learning challenges both inside and outside of school and have competing demands on their concentration levels and motivation. It is essential that my approach to learning is flexible, allowing me to achieve the best outcome for that child on that particular day."
        },
        {
            "text": "Impact"
        },
        {
            "text": "I feel that the impact I have in the role is huge and I’ve been able to reinforce certain skills, such as handwriting and reading, which were identified as areas needing improvement. I particularly remember the first time a child ran up to tell me that the word we learnt together came up in another lesson and helped unlock the subject for them. Witnessing a child’s lightbulb moment is incredibly rewarding and it’s a privilege to help them realise their potential. Pupils who would previously struggle, are now engaged, contributing members when doing group work."
        },
        {
            "text": "This is my second year as an Academic Mentor at the school, and I want to know that every child I have worked with has had their share of lightbulb moments and has seen for themselves their full potential."
        },
        {
            "text": "Access tutoring via the National Tutoring Programme"
        },
        {
            "text": " "
        }
    ]
}