{
    "url": "https://environmentagency.blog.gov.uk/2021/12/07/broadwater-brook-urban-chalk-stream-restoration/",
    "title": "Broadwater Brook urban chalk stream restoration",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-12-07T15:54:06+00:00",
    "content": [
        {
            "text": "In today’s blog we look at how the Environment Agency helped to restore 1km of urban chalk stream in West Sussex.  "
        },
        {
            "text": "By Gareth Williams, Environment Programme manager Solent and South Downs "
        },
        {
            "text": "In order to restore one chalk stream in the South East, The Ouse & Adur Rivers Trust and the Environment Agency have been leading a project to re-route the Broadwater Brook (Teville Stream) across land at Sompting, West Sussex."
        },
        {
            "text": "£123,000 of Environment Programme investment over three years has unlocked £1,200,000 of Heritage Lottery Fund money for the Enhancing Places, Inspiring Communities EPIC project to restore the Broadwater Brook"
        },
        {
            "text": "Gareth Williams, Environment Programme Manager for the Solent and South Downs, tells us more about how the project evolved."
        },
        {
            "text": "For a number of years, I have had the pleasure of working on the EPIC project to restore the Broadwater Brook, creating 1km of new urban chalk stream in Sussex just outside of Worthing. We have taken the stream from a polluted culverted straightened channel to a more naturally functioning, meandering watercourse."
        },
        {
            "text": "The restoration has resulted in an astounding increase in wildlife and local communities are now able to enjoy this new environment on their doorstep which is really great to see."
        },
        {
            "text": "Overcoming the challenges"
        },
        {
            "text": "Plans for this project began in 2010 but it has had to overcome a number of challenges as more funding was needed to complete the project. We put our heads together and worked in partnership with the local Rivers Trust to bring other partners and funding onboard."
        },
        {
            "text": "Land contamination was a major hurdle to overcome. Giant hogweed covered much of the site and the stream contained heavy metals from past industry and hydrocarbons from nearby roads. Multiple underground services crisscrossed the site, power cables, local sewers and infrastructure from the Rampion offshore wind farm made designing and constructing the channel very challenging. Even the topography of the site didn’t lend itself to an easy design process because rivers don’t like running uphill, we had to dig down and down to get the gradient right and ensure the river flowed naturally."
        },
        {
            "text": "We were able to overcome these challenges in August 2020 when contractors Salix River and Wetland Services constructed a new river channel and built two sediment traps. These helped slow, filter and store contamination from urban and road run-off. The sediment traps slow the water entering the site and the sediment containing the contamination drops to the bottom of the trap where it is dug out and disposed of when full. The water quality in the restored stretch is much better as a result which benefits the animals and plants that have made the site home."
        },
        {
            "text": "Working in partnership"
        },
        {
            "text": "The project was completed in partnership with landowners, The Sompting Estate Trust, and was supported by the Heritage Lottery Fund, Rampion Offshore Wind Ltd and Sompting Big Local."
        },
        {
            "text": "The Sompting Estate, owned and managed by the Crofts/Tristram family for more than 250 years partnered up with the Ouse and Adur Rivers Trust and the Environment Agency and other partners to create this new wetland complex. The Teville Stream, which meets with the Broadwater Brook, has been largely culverted since the Second World War, expanding the urban area to make space for industrial estates, housing and roads.  The stream, which was formerly three-quarters culverted, has now been re-routed away from sources of contamination. The restored urban chalk stream now meanders as an open channel across former agricultural land, creating a fantastic new wetland."
        },
        {
            "text": "Coming back to life "
        },
        {
            "text": "It was amazing to see how quickly life started to appear. Six species of dragonfly, mayfly nymphs, and even an elver were spotted in the first week of its opening. Over 500 species have now been recorded at the site since 2019."
        },
        {
            "text": "Over the last twelve months the river banks have been seeded with donated wetland plants from Salix, establishing riparian vegetation on the various berms and shelves along the new channel. The surrounding farmland has been converted from maize fields into 6.9ha of wildflower meadows with 2km of new hedgerow and 1000 trees planted on site."
        },
        {
            "text": "The new community River Trail with wildlife hides, art installations and seating areas were opened to local residents and the wider community in September 2021 so that everyone can now enjoy the restored environment of the Broadwater Brook."
        },
        {
            "text": "This project was recently a finalist for the UK river prize, which is awarded by the River Restoration Centre."
        },
        {
            "text": "Follow the Environment Agency on Twitter, and sign up for email alerts."
        }
    ]
}