{
    "url": "https://food.blog.gov.uk/2021/12/07/consumer-and-stakeholder-acceptance-of-urban-grown-food-and-alternative-proteins-my-transforming-uk-food-systems-spf-programme-fellowship/",
    "title": "Consumer and stakeholder acceptance of urban grown food and alternative proteins - my Transforming UK Food Systems SPF Programme Fellowship",
    "authors": [
        "Dr Bethan Mead, Research Fellow, University of Liverpool"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2021-12-07T11:21:42+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Dr Bethan Mead, Research Fellow at the University of Liverpool discusses her joint FSA-UKRI fellowship as part of the Transforming UK Food Systems SPF Programme."
        },
        {
            "text": " "
        },
        {
            "text": "I am excited to have been welcomed by the FSA as the latest research fellow as part of UK Research and Innovation’s (UKRI) Strategic Priorities Fund (SPF) Programme on Transforming the UK Food System for Healthy People and a Healthy Environment. Over the next three years, I will be working with my research group at the University of Liverpool on an exciting project, focusing on consumer and stakeholder interests in a transforming UK food system."
        },
        {
            "heading": 2,
            "text": "My research background"
        },
        {
            "text": "I have a background in Psychology specialising in eating behaviours, health, and their relation to the wider food system. I began my research career as a Research Assistant at Liverpool John Moores University studying external influences on eating behaviour. This laid the foundation for my PhD in Psychology at the University of Liverpool, which focused on the role of food reward and external food cues during weight management. Following my PhD, I undertook further research posts working with multidisciplinary teams to investigate determinants of eating behaviour, obesity and food choice."
        },
        {
            "text": "Most recently, I spent two years as a Postdoctoral Research Associate with the interdisciplinary Rurban Revolution project as part of the Global Food Security Resilience of the UK Food System (GFS-FSR) Programme. During this time I studied how upscaling urban agriculture could impact diet quality, food security and health as part of wider food system changes. Working with mixed teams has been hugely valuable in helping me to understand the complexities of the relationships between different parts of the food system and its wider impact on human and planetary health."
        },
        {
            "text": "In Summer 2021 I was successfully awarded a joint FSA-UKRI Fellowship opportunity for the Transforming UK Food Systems SPF Programme. I felt that the Food Systems SPF Programme was a great opportunity to work across interdisciplinary boundaries and contribute to impactful research that has the potential to deliver change. So far I am really enjoying being able to conduct my own research whilst working between academia and government to help deliver impact."
        },
        {
            "text": "To find out more about the Transforming UK Food Systems SPF Programme you can read the news story and visit the Food System SPF Programme’s page on the GFS website."
        },
        {
            "heading": 2,
            "text": "My Food Systems SPF Programme research project"
        },
        {
            "text": "The UK food system is facing a wealth of challenges, from greater environmental degradation to the rising number of people facing food insecurity. These pressures mean there is an ongoing push for innovative, safe and sustainable solutions. I’ve worked with my research team to identify urban grown food and alternative proteins as a key target to combat food system challenges."
        },
        {
            "text": "Before we can achieve this, identifying and overcoming barriers to uptake of these products needs to be addressed. For my research project, I will be looking at consumer and stakeholder views and acceptance of urban grown food and alternative proteins, with the aim of informing safe adoption and best practice. At the end of the project, I will have developed a clear roadmap of recommendations for food policymakers and regulators to help address any barriers to acceptance. I am planning to execute the research in three phases."
        },
        {
            "text": "The first phase of the research is already underway. During this phase, I am developing and mapping the current evidence base on consumer and stakeholder perceptions of urban grown food and alternative proteins. I am using a mixture of methods including rapid evidence synthesis, large-scale consumer studies, and in-depth stakeholder interviews and focus groups. This will help me to identify barriers and concerns that consumers and stakeholders might have about these foods."
        },
        {
            "text": "The next phase will be to design and test interventions to address these barriers. I’m particularly excited for this phase as it will involve some real-life sensory and intake testing with consumers and urban grown foods and alternative protein products. As a result, I will be able to monitor real-time consumer reactions and measure consumption to see if I can overcome the barriers identified in Phase 1."
        },
        {
            "text": "The final phase will involve synthesising my findings and running a number of codesigned workshops with stakeholders to produce a set of recommendations for policy about routes to acceptance. Overall, the three phases will allow me to identify and address barriers to acceptance in order to develop policy recommendations and support food system transformation."
        },
        {
            "heading": 2,
            "text": "Championing the Food Systems SPF Programme"
        },
        {
            "text": "As part of my fellowship, I will also be working closely with UKRI partners to help strengthen engagement with ongoing and future research programmes. I will be working with the FSA and across the Food Systems SPF Programme, engaging with stakeholders to champion food safety within the UK research community. I want to help ensure that regulatory guidance is considered throughout the project life cycle, all the way from conception to delivery."
        },
        {
            "text": "Over the next three years, I will be working with the Food Systems SPF Programme leaders and research teams, policymakers, community groups and academics to support impact and collaboration. I am already enjoying getting to know the members of the Food Systems SPF consortia projects, to keep up to date with the incredible research being carried out. For example, I recently visited the FixOurFood Team at their urban farm in York to get hands-on experience of their project and food system transformation in action."
        },
        {
            "text": "I am keen to support engagement and knowledge exchange within the Food Systems SPF Programme and the FSA. In November, I contributed to the FSA’s UK Food System Centre for Doctoral Training (UKFS-CDT) seminar session. Here I presented the plans for my fellowship with the doctoral researchers and shared examples of working across disciplines to support the FSA’s research priorities. I am also supporting the Food Systems SPF Programme’s early career researcher (ECR) network to provide a space and platform for ECRs to interact, learn from one another and engage with the FSA and stakeholders directly."
        },
        {
            "text": "I also have a number of other exciting engagement activities in the pipeline. For example, I will be contributing to the FSA’s involvement in the Spring 2022 UKRI SCENARIO Doctoral Training Partnership’s ‘Tiger Teams’ initiative. Here, interdisciplinary teams of doctoral students will work to tackle food system ‘problems’ posed by the FSA and other organisations. I am pleased to be able to represent the FSA and Food Systems SPF Programme interests in a way that can deliver scalable solutions to food system challenges."
        },
        {
            "heading": 2,
            "text": "Future work"
        },
        {
            "text": "I am excited for what the next few years will hold, starting with a rapid evidence review to kick-off our project and meeting key stakeholders across the FSA and Food Systems SPF Programme. By the end of the three years, I will have developed strategies to support policy, safe adoption and best practice relating to acceptance of urban grown food and alternative proteins, which both have the potential to contribute to food system transformation."
        },
        {
            "text": "Together, working across the Food Systems SPF Programme and with UKRI partners, the FSA and other key stakeholders, we will ensure that food safety and regulation play a key role in the work that the Food Systems SPF Programme research teams are doing to transform our food system. This fellowship is the first step in my career in food systems research that delivers impact and ensures that everybody has access to healthy, sustainable and safe food."
        },
        {
            "heading": 1,
            "text": "Cymrodoriaeth Rhaglen y Gronfa Blaenoriaethau Strategol (SPF) ar Drawsnewid Systemau Bwyd y Deyrnas Unedig – Derbyniad defnyddwyr a rhanddeiliaid o fwyd a dyfir yn drefol a phroteinau amgen"
        },
        {
            "text": "Mae Dr Bethan Mead, Cymrawd Ymchwil ym Mhrifysgol Lerpwl, yn trafod ei chymrodoriaeth ar y cyd â’r Asiantaeth Safonau Bwyd (ASB) ac Ymchwil ac Arloesi’r Deyrnas Unedig (UKRI) fel rhan o Raglen y Gronfa Blaenoriaethau Strategol (SPF) ar Drawsnewid Systemau Bwyd y Deyrnas Unedig (DU)."
        },
        {
            "text": " "
        },
        {
            "text": "Rwy’n teimlo’n gyffrous i fod wedi cael fy nghroesawu gan yr ASB fel y cymrawd ymchwil diweddaraf fel rhan o Raglen Cronfa Blaenoriaethau Strategol (SPF) Ymchwil ac Arloesi’r DU (UKRI) ar Drawsnewid Systemau Fwyd y DU ar gyfer Pobl Iach ac Amgylchedd Iach. Dros y tair blynedd nesaf, byddaf yn gweithio gyda fy ngrŵp ymchwil ym Mhrifysgol Lerpwl ar brosiect cyffrous, gan ganolbwyntio ar fuddiannau defnyddwyr a rhanddeiliaid o ran system fwyd drawsnewidiol y DU."
        },
        {
            "heading": 2,
            "text": "Fy nghefndir o ran ymchwil"
        },
        {
            "text": "Mae gen i gefndir mewn Seicoleg gan arbenigo mewn ymddygiadau bwyta, iechyd, a’u perthynas â’r system fwyd ehangach. Dechreuais fy ngyrfa ymchwil fel Cynorthwyydd Ymchwil ym Mhrifysgol John Moores Lerpwl gan astudio dylanwadau allanol ar ymddygiadau bwyta. Gosododd hyn y sylfaen ar gyfer fy PhD mewn Seicoleg ym Mhrifysgol Lerpwl, a oedd yn canolbwyntio ar rôl bwyd fel gwobr a chiwiau bwyd allanol wrth reoli pwysau. Yn dilyn fy PhD, ymgymerais â swyddi ymchwil pellach gan weithio gyda thimau amlddisgyblaethol er mwyn ymchwilio i benderfynyddion ymddygiadau bwyta, gordewdra a dewisiadau bwyd."
        },
        {
            "text": "Yn fwyaf diweddar, treuliais ddwy flynedd fel Cydymaith Ymchwil Ôl-ddoethurol gyda’r prosiect rhyngddisgyblaethol Rurban Revolution fel rhan o Raglen Gwytnwch Diogelwch Bwyd Byd-eang System Fwyd y DU (GFS-FSR). Yn ystod y cyfnod hwn, astudiais sut y gallai uwchraddio amaethyddiaeth drefol effeithio ar ansawdd diet, diogelwch bwyd ac iechyd fel rhan o newidiadau ehangach i’r system fwyd. Mae gweithio gyda thimau cymysg wedi bod yn hynod werthfawr i’m helpu i ddeall cymhlethdodau’r perthnasoedd rhwng gwahanol rannau’r system fwyd a’u heffaith ehangach ar iechyd pobl a’r blaned."
        },
        {
            "text": "Yn ystod Haf 2021, dyfarnwyd Cymrodoriaeth i mi ar y cyd rhwng yr ASB a’r UKRI ar gyfer Rhaglen y Gronfa Blaenoriaethau Strategol ar Drawsnewid Systemau Bwyd y DU. Teimlais fod y rhaglen hon yn gyfle gwych i weithio ar draws ffiniau rhyngddisgyblaethol a chyfrannu at ymchwil effeithiol sydd â’r potensial i sbarduno newid. Hyd yn hyn, rydw i wir yn mwynhau gallu cynnal fy ymchwil fy hun wrth weithio rhwng y byd academaidd a’r llywodraeth i helpu i gael effaith."
        },
        {
            "text": "I ddarganfod rhagor am Raglen y Gronfa Blaenoriaethau Strategol ar Drawsnewid Systemau Bwyd y DU, gallwch chi ddarllen y stori newyddion a mynd i dudalen Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd ar wefan Diogelwch Bwyd Byd-eang."
        },
        {
            "heading": 2,
            "text": "Fy mhrosiect ymchwil ar gyfer Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd"
        },
        {
            "text": "Mae system fwyd y DU yn wynebu nifer o heriau, o ddiraddio amgylcheddol ehangach i’r nifer cynyddol o bobl sy’n wynebu cyflenwad bwyd ansicr. Mae’r pwysau hyn yn golygu bod gofyn parhaus am atebion arloesol, diogel a chynaliadwy. Rwyf wedi gweithio gyda fy nhîm ymchwil i nodi bwyd a dyfir yn drefol a phroteinau amgen fel targed allweddol i frwydro yn erbyn heriau’r system fwyd."
        },
        {
            "text": "Cyn y gallwn ni gyflawni hyn, mae angen mynd i’r afael â nodi a goresgyn rhwystrau rhag derbyn y cynhyrchion hyn. Ar gyfer fy mhrosiect ymchwil, byddaf yn edrych ar farn defnyddwyr a rhanddeiliaid a sut mae bwyd a dyfir yn drefol a phroteinau amgen yn cael eu derbyn, gyda’r nod o lywio defnydd diogel ac arfer gorau. Ar ddiwedd y prosiect, byddaf i wedi datblygu cynllun clir o argymhellion ar gyfer llunwyr a rheoleiddwyr polisi bwyd i helpu i fynd i'r afael ag unrhyw rwystrau rhag eu derbyn. Rwy’n bwriadu cyflawni’r ymchwil mewn tri cham."
        },
        {
            "text": "Mae cam cyntaf yr ymchwil eisoes yn mynd rhagddo. Yn ystod y cam hwn, rwy’n datblygu ac yn cynllunio’r sylfaen dystiolaeth gyfredol ar gyfer canfyddiadau defnyddwyr a rhanddeiliaid o fwyd a dyfir yn drefol a phroteinau amgen. Rwy’n defnyddio cymysgedd o ddulliau gan gynnwys synthesis tystiolaeth cyflym, astudiaethau defnyddwyr mawr, a chyfweliadau manwl â rhanddeiliaid a grwpiau ffocws. Bydd hyn yn fy helpu i nodi rhwystrau a phryderon a allai fod gan ddefnyddwyr a rhanddeiliaid am y bwydydd hyn."
        },
        {
            "text": "Y cam nesaf fydd cynllunio a phrofi ymyriadau i fynd i’r afael â’r rhwystrau hyn. Rwy’n teimlo’n arbennig o gyffrous am y cam hwn gan y bydd yn cynnwys rhywfaint o brofion synhwyraidd a chymeriant gwirioneddol gyda defnyddwyr a bwydydd a dyfir yn drefol a chynhyrchion protein amgen. O ganlyniad, bydda i’n gallu monitro ymatebion defnyddwyr mewn amser real a mesur defnydd i weld a allaf oresgyn y rhwystrau a nodwyd yng Ngham 1."
        },
        {
            "text": "Bydd y cam olaf yn cynnwys cyfuno fy nghanfyddiadau a chynnal nifer o weithdai â rhanddeiliaid i gynhyrchu set o argymhellion polisi am ffyrdd i’r cynhyrchion gael eu derbyn. At ei gilydd, bydd y tri cham yn fy ngalluogi i nodi a mynd i’r afael â rhwystrau rhag derbyn y cynhyrchion er mwyn datblygu argymhellion polisi a chefnogi trawsnewid  system fwyd."
        },
        {
            "heading": 2,
            "text": "Hyrwyddo Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd"
        },
        {
            "text": "Fel rhan o fy nghymrodoriaeth, byddaf i hefyd yn gweithio’n agos gyda phartneriaid UKRI i helpu i gryfhau ymgysylltiad â rhaglenni ymchwil parhaus a’r rheiny yn y dyfodol. Bydda i’n gweithio gyda’r ASB ar draws Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd, gan ymgysylltu â rhanddeiliaid i hyrwyddo diogelwch bwyd yng nghymuned ymchwil y DU. Rwyf am helpu i sicrhau bod canllawiau rheoleiddio’n cael eu hystyried trwy gydol y prosiect, yr holl ffordd o ddatblygu i gyflawni."
        },
        {
            "text": "Dros y tair blynedd nesaf, byddaf i’n gweithio gydag arweinwyr Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd yn ogystal â thimau ymchwil, llunwyr polisi, grwpiau cymunedol ac academyddion i gefnogi effaith a chydweithio. Rwyf eisoes yn mwynhau dod i adnabod aelodau prosiectau consortia’r Gronfa Blaenoriaethau Strategol ar Systemau Bwyd, gan wybod y diweddaraf am yr ymchwil anhygoel sy’n cael ei chynnal. Er enghraifft, ymwelais â Thîm FixOurFood yn ddiweddar ar eu fferm drefol yn Efrog i gael profiad ymarferol o’u prosiect a gweld dulliau i drawsnewid y system fwyd ar waith."
        },
        {
            "text": "Rwy’n awyddus i gefnogi ymgysylltu a chyfnewid gwybodaeth o fewn Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd a’r ASB. Ym mis Tachwedd, cyfrannais at sesiwn seminar Canolfan System Fwyd y DU ar gyfer Hyfforddiant Doethurol (UKFS-CDT). Yma, cyflwynais y cynlluniau ar gyfer fy nghymrodoriaeth gyda’r ymchwilwyr doethurol a rhannu enghreifftiau o weithio ar draws disgyblaethau i gefnogi blaenoriaethau ymchwil yr ASB. Rydw i hefyd yn cefnogi rhwydwaith ymchwilwyr gyrfa gynnar Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd i ddarparu cyfle a llwyfan i ymchwilwyr gyrfa gynnar ryngweithio, dysgu oddi wrth ei gilydd ac ymgysylltu â’r ASB a rhanddeiliaid yn uniongyrchol."
        },
        {
            "text": "Hefyd, mae gen i nifer o weithgareddau ymgysylltu cyffrous eraill ar y gweill. Er enghraifft, byddaf i’n cyfrannu at gyfranogiad yr ASB ym menter Partneriaeth Hyfforddiant Doethurol SCENARIO UKRI yn ystod Gwanwyn 2022 o’r enw ‘Tiger Teams’. Yma, bydd timau rhyngddisgyblaethol o fyfyrwyr doethurol yn gweithio i fynd i’r afael â ‘phroblemau’ system fwyd a nodir gan yr ASB a sefydliadau eraill. Rwy’n falch o allu cynrychioli buddiannau Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd a’r ASB ar Systemau Bwyd mewn ffordd a all gyflwyno atebion y mae modd eu haddasu ar gyfer heriau’r system fwyd."
        },
        {
            "heading": 2,
            "text": "Gwaith yn y dyfodol"
        },
        {
            "text": "Rwy’n teimlo’n gyffrous am yr hyn a all ddigwydd yn ystod yr ychydig flynyddoedd nesaf, gan ddechrau gydag adolygiad tystiolaeth cyflym i ddechrau ar ein prosiect a chwrdd â rhanddeiliaid allweddol ar draws yr ASB a Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd. Erbyn diwedd y tair blynedd, byddaf i wedi datblygu strategaethau i gefnogi polisi, defnydd diogel ac arfer gorau sy’n ymwneud â derbyn bwyd a dyfir yn drefol a phroteinau amgen. Mae gan y ddau ohonynt y potensial i gyfrannu at drawsnewid y system fwyd."
        },
        {
            "text": "Gyda’n gilydd, gan weithio ar draws Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd a chyda phartneriaid UKRI, yr ASB a rhanddeiliaid allweddol eraill, byddwn ni’n sicrhau bod diogelwch a rheoleiddio bwyd yn chwarae rhan allweddol yn y gwaith y mae timau ymchwil Rhaglen y Gronfa Blaenoriaethau Strategol ar Systemau Bwyd yn ei wneud i drawsnewid ein system fwyd. Y gymrodoriaeth hon yw’r cam cyntaf yn fy ngyrfa ym maes ymchwil i systemau bwyd sy’n cyflawni effaith ac yn sicrhau bod gan bawb fynediad at fwyd iachus, cynaliadwy a diogel."
        }
    ]
}