{
    "url": "https://hmlandregistry.blog.gov.uk/2021/12/07/hidden-disabilities-hm-land-registry-and-me/",
    "title": "Hidden disabilities, HM Land Registry and me",
    "authors": [
        "Emma Procter, Registration Officer"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2021-12-07T10:47:05+00:00",
    "content": [
        {
            "text": "Hello, I’m Emma and have hidden disabilities including Ehlers-Danlos Syndrome, fibromyalgia and anxiety. Hidden disability often means people look well from the outside but are experiencing difficulties in day-to-day life."
        },
        {
            "text": "As a child, I found that I could do some things that others couldn’t. Bend my body in unusual ways, do ballet and gymnastic manoeuvres without training and swim really fast!"
        },
        {
            "text": "Later in life I started suffering with immense pains and my joints would dislocate for no reason. My jaw would dislocate when brushing my teeth, my finger(s) would dislocate when pushing a trolley in the supermarket. I would get tendon tears (like sporting injuries) while I was asleep, and they would take weeks to heal. I found that I started to become almost too scared to move."
        },
        {
            "text": "After multiple misdiagnosis, a rheumatologist conducted tests and diagnosed me with Ehlers-Danlos Syndrome and fibromyalgia. Anxiety followed due to not knowing how to manage my condition."
        },
        {
            "heading": 2,
            "text": "Working with hidden disabilities"
        },
        {
            "text": "One of the hardest things I had to deal with was work and how my diagnosis affected my career. I trained as a teacher, but I didn’t know how to manage my conditions properly and ended up losing my way. I found it hard to find a way to earn a living that I was physically able to do."
        },
        {
            "text": "Over the years, I have learned how to manage my conditions and now feel that I am in a much better place both physically and mentally. I know how to look after my body to minimise stress on my joints and tissues. My son introduced me to Buddhism, and I have taken a lot from the teachings with Kelsang Pagpa."
        },
        {
            "text": "I am now more accepting of myself and in January this year I started work at HM Land Registry’s Fylde Office as a Registration Officer."
        },
        {
            "text": "Getting a job here has changed my life. The job gives me stability and, because HM Land Registry works in a hybrid way, I’ve been supported to work at home when I need to."
        },
        {
            "text": "The support here is incredible and one of the first things I did was join the Disabled Employee Network. My line manager was also very supportive and told me about the Workplace Adjustments Passport."
        },
        {
            "heading": 2,
            "text": "Help at home and in the office"
        },
        {
            "text": "My adjustments include a supportive and adjustable chair, wrist supports, and taking regular breaks to prevent over wear on my joints and tissues. They may not seem much, but they make a big difference to me and my ability to work."
        },
        {
            "text": "I feel I can be open here and ask for support and equipment that enables me to my job to the best of my ability. I feel like an equal."
        },
        {
            "text": "I have an assistance dog in training called Pepper and when I go into the office she will be able to come with me."
        },
        {
            "text": "Pepper helps with picking things up and fetching things, so I don’t wear my joints out or risk dislocating them. She also helps with my anxiety and I feel calm when she is next to me."
        },
        {
            "text": "My condition is incurable and degenerative, which means it will unfortunately get worse as I get older, but I plan to live the best life I can!"
        },
        {
            "text": "Find out more about working for HM Land Registry."
        }
    ]
}