{
    "url": "https://companieshouse.blog.gov.uk/2021/12/07/how-to-use-and-protect-your-company-authentication-code/",
    "title": "How to use and protect your company authentication code",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance",
        "Filing advice"
    ],
    "pub_date": "2021-12-07T12:00:46+00:00",
    "content": [
        {
            "text": "One of the most important pieces of information you will be sent after you have incorporated your company is your authentication code."
        },
        {
            "text": "The code is equivalent to an electronic signature or your bank card PIN and whoever has access to it will have control over your company details. For this reason, it’s essential that you keep it secure and only share it with someone you trust to file and change information for your company."
        },
        {
            "text": "The authentication code is made up of 6 alphanumeric characters and will have been sent in an official letter to your registered office address when you set up your company."
        },
        {
            "text": "The code gives you - or someone you have authorised - the power to file or change your company information online. It’s a key security measure in preventing unauthorised access to your company account."
        },
        {
            "heading": 2,
            "text": "How to use your code"
        },
        {
            "text": "If you have not already signed up for online filing, you'll need to register to file online."
        },
        {
            "text": "To register you’ll need your email address and you’ll need to create a password. You’ll then be sent a reminder of your authentication code."
        },
        {
            "text": "Once registered, you’ll be able to access your online account to file your company’s confirmation statement, annual accounts and make changes to your company information, such as appointing new directors and changing your registered office address."
        },
        {
            "heading": 2,
            "text": "Retrieve your code"
        },
        {
            "text": "If you have forgotten or mislaid your authentication code, you can ask for a reminder to be sent by signing into your account and requesting an authentication code. We’ll send your code, or a reminder if you already have one, by post to your company’s registered office."
        },
        {
            "text": "If you're not able to access your company’s registered office address, you can request to have your authentication code sent to your home address instead. This is a temporary service in response to the coronavirus (COVID-19) pandemic."
        },
        {
            "text": "A new code can take a few days to arrive, so do not wait until the last minute, especially if any important filing dates are coming up soon."
        },
        {
            "heading": 2,
            "text": "Change your code"
        },
        {
            "text": "You can amend your existing authentication code to something that's easier for you to remember, but like your bank card PIN number, make sure it’s not too easy for someone to guess. You may want to change your code if you suspect someone might know the code."
        },
        {
            "text": "It could also be worthwhile changing the code if you appoint a new accountant, or if there have been changes within the company’s management structure."
        },
        {
            "text": "Changing your company authentication code is easy:"
        },
        {
            "text": "A confirmation of your change of code will be sent to your registered office address. Remember to inform anyone who files on your behalf if you change your code."
        },
        {
            "heading": 2,
            "text": "Using your code to file online"
        },
        {
            "text": "To file, change or update your company information online you'll need your:"
        },
        {
            "text": "There are many benefits of using the online filing service. You’ll save yourself time and money as many of the fee bearing forms are cheaper if you file online and you’ll get an instant response and confirmation that documents have been filed."
        },
        {
            "text": "The online filing process also has inbuilt checks to decrease the risk of making errors and reduce the need for filing corrections or amendments."
        },
        {
            "heading": 2,
            "text": "Follow your company"
        },
        {
            "text": "For added security, you could choose to follow your own company using the Companies House free follow service."
        },
        {
            "text": "Follow lets you receive email alerts of company transactions. The alert tells you instantly what’s been filed with us as soon as it’s been accepted. The email will contain a link to the filing history of the company where you’ll be able to download a copy of the document for free."
        },
        {
            "text": "To begin following companies:"
        },
        {
            "text": "To see all of the companies you’ve chosen to follow, click ‘Companies you follow’. To stop receiving email alerts for a company, choose to ‘Unfollow’."
        }
    ]
}