{
    "url": "https://naturalengland.blog.gov.uk/2021/12/07/how-natural-englands-green-infrastructure-framework-can-help-create-better-places-to-live/",
    "title": "How Natural England’s Green Infrastructure Framework can help create better places to live",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-07T12:55:37+00:00",
    "content": [
        {
            "text": "- Marian Spain, Natural England Chief Executive"
        },
        {
            "text": " "
        },
        {
            "text": "The Green Infrastructure (GI) Framework is a commitment in the Government’s 25 Year Environment Plan. It supports the greening of our towns and cities and connections with the surrounding landscape. Natural England is central to delivering the Framework and we’ve now gone live with two of its key elements which will help local planning authorities, developers and communities make better places to live, learn work and play:"
        },
        {
            "text": "• The Why, What and How Principles of good Green Infrastructure"
        },
        {
            "text": "• The Beta Green Infrastructure Mapping Tool providing a baseline of GI across England."
        },
        {
            "text": "Early high-level analysis using Natural England’s Beta Green Infrastructure Mapping tool shows that around a third of us don’t live within 15 minutes’ walk of a natural green space. It also tells us that in some of the most disadvantaged areas there is little or no access to green space within walking distance from home*."
        },
        {
            "text": "How will the Green Infrastructure Framework help?\nGood quality GI has an important role to play in our urban and rural environments. It’s important for health and wellbeing, air quality, nature recovery and for delivering net zero targets, as well as for adapting to climate change by providing urban cooling and reducing flood risk. It can help to address issues of social inequality and environmental decline, whilst also making better places to live."
        },
        {
            "text": "Mapping variations across the country means we can support better planning for good quality GI and help to target the creation or improvement of GI where existing provision is poorest and where there are opportunities for these important assets to be better managed for the environment and to deliver a wider range of multifunctional benefits."
        },
        {
            "text": "The elements of the GI Framework now published – the GI Principles and GI Mapping - will help local planning authorities and developers meet requirements in the National Planning Policy Framework to consider GI in local plans and in new development. The Framework is also being developed to enable other organisations and groups such as parks and green space managers and local communities to think more about GI and plan for its creation or improvement."
        },
        {
            "text": "Explore the new web portal\nWe’d like to invite you to explore the GI Framework web portal and the products released. There is lots of great information that can help in planning your GI network."
        },
        {
            "text": "For example, the GI Mapping Database brings together data from over 40 individual environmental and socio-economic datasets. Local authorities and others may use the database to inform the development of local plans, policies and GI strategies, and can download the spatial files to add their own data to it. It can be used in engagement with stakeholders, including developers and communities, to help identify priorities for GI enhancement and creation."
        },
        {
            "text": "The GI Framework will be fully available in autumn 2022. Additional elements will include the core GI Standards, from which local authorities can set their own local standards, for example on accessible natural green space or urban greening. It will also include a GI Design Guide, case studies and ‘process journeys’- intended to assist different audiences in applying the GI Framework."
        },
        {
            "text": "Your feedback\nWe would welcome your feedback on the elements of the GI Framework released to date and will be publishing a feedback questionnaire in January so that you can let us know your views. This will help us to improve the GI Framework, with the ultimate aim of helping to plan and deliver good quality networks of multifunctional green infrastructure for the benefit of all."
        },
        {
            "text": "By Clare Warburton, Principal Adviser, Green Infrastructure, Natural England"
        },
        {
            "text": "*This is based on a composite analysis across England of doorstep green spaces (at least 0.5ha within 200m), local natural green spaces (at least 2ha within 300m) and neighbourhood natural green spaces (at least 10ha within 1km), all within a 15 minute walk zone from home. These are initial findings, and the data comes with caveats and limitations as set out in the GI Mapping User Guide. Further work will be undertaken in the next phase to analyse the data in more detail."
        }
    ]
}