{
    "url": "https://nda.blog.gov.uk/swiss-underground-rock-laboratory-turns-25/",
    "title": "Swiss underground rock laboratory turns 25",
    "authors": [
        "Jane Cantwell - RWM Stakeholder Engagement Manager"
    ],
    "categories": [
        "International activities",
        "Research and development",
        "Science",
        "Waste management"
    ],
    "pub_date": "2021-12-07T13:30:35+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Cutting-edge experiments"
        },
        {
            "text": "It was a cool, crisp autumn day as we stepped off the train amid spectacular Swiss scenery and took a short walk to the warren of tunnels excavated from solid rock."
        },
        {
            "text": "Passers-by would simply never guess that the Mont Terri mountainside, located in the north west of the country, was home to numerous cutting-edge experiments that are helping international scientists to solve some of the technical complexities of developing geological disposal facilities."
        },
        {
            "text": "This incredible facility welcomes researchers from across the world, and its scope extends beyond organisations needing to refine their approach to radioactive waste: its clay rock environment is available for projects involving hydrogeological, geochemical, microbiological, geotechnical and engineering investigations. One project, for example, is looking at how to safely close shafts and tunnels when a GDF is sealed."
        },
        {
            "heading": 3,
            "text": "World-renowned"
        },
        {
            "text": "RWM became a partner to Mont Terri in 2017 - there are 22 in total, some of which have been partners since the earliest days.  Over the years, the experimental galleries have been extended to nearly 1.3km and are located off a motorway tunnel that passes through Mont Terri in the Jura mountains.  The interesting qualities of the surrounding geology – low permeability, no water inflows and more – were attractive to Nagra, the Swiss implementer for a GDF. The National Hydrological and Geological Survey (SNHGS) became responsible for construction and management of the URL, who have created a truly world-renowned research laboratory here."
        },
        {
            "text": "The last 25 years have shown how rock like the Opalinus Clay may safely contain radioactive waste over very long periods of time. Claystones and mudstones can also be ‘cap rocks’ preventing gases such as CO2 put in rocks beneath them from penetrating into the near-surface environment."
        },
        {
            "text": "We’d arrived to celebrate that 25-year anniversary, to be greeted, along with dozens of international guests, by a chorus of Swiss horns and a welcome from a Swiss minister. The event involved a series of presentations, discussions and an opportunity to wander along the tunnels where we could see the workstations and chat to the researchers – there’s a real sense of passion about the progress being made and of support for each of the different programmes world-wide."
        },
        {
            "heading": 3,
            "text": "Collaboration"
        },
        {
            "text": "The ethos for partnership is collaboration, bringing knowledge and data share across the partners.  We’re all committed to ensuring that our deep geological repositories will keep our countries’ radioactive waste safely isolated for thousands of years. Repositories don’t necessarily need to be in lower sedimentary rock like Mont Terri, but it’s one of the geological environments we know could be suitable for the UK."
        },
        {
            "text": "RWM currently participates in around 15 projects at Mont Terri. Several of them started decades ago, providing understanding about how the rock and engineered parts of a GDF evolve over time.  We also follow experiments that will help us characterise potential GDF sites since this ensures that, for our sites, we will gather relevant information using the right tools and equipment, so we then have knowledge in place able to interpret the data."
        },
        {
            "text": "Mont Terri is a fascinating place and it’s just one of the international programmes that RWM is involved with. We also participate in experiments in other European underground rock labs, delivering research in support of European and international collaborations such as Sweden’s Äspö Task Force and EURAD projects.  We recognise that working together, sharing research and knowledge is essential to ensuring our science provides the confidence necessary for protecting people and the environment."
        },
        {
            "heading": 3,
            "text": "Research only"
        },
        {
            "text": "“Mont Terri will remain a research lab and is independent from a Swiss GDF being delivered by Nagra - there’s no intention to convert it into a GDF.  Valuable research in the Mont Terri Opalinius Clay has, however, helped Nagra in narrowing its search, with three possible regions identified. A decision on the most suitable site could be made during 2022."
        },
        {
            "text": "There’s also a popular visitor centre which, along with tours of the experimental galleries, welcomes thousands of parties and individuals annually, in parties of up to 10 people. Most definitely worth taking the tour!"
        }
    ]
}