{
    "url": "https://forestrycommission.blog.gov.uk/2021/12/07/woods-into-management-forestry-innovation-funds-projects/",
    "title": "Woods into Management Forestry Innovation Funds projects.",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2021-12-07T12:38:41+00:00",
    "content": [
        {
            "text": "The Woods into Management Forestry Innovation Funds (WiMFIF) were developed and launched in 2021 to support innovative projects that will encourage more woods to be brought into active management."
        },
        {
            "text": "Presently around 41% of our woodlands are not actively managed and this can have a negative impact on the biodiversity they contain. By increasing the area of woodlands in active management, these funds aim to restore vulnerable woodland habitats and help woodlands adapt to a changing climate and recover from the impacts of pests and diseases."
        },
        {
            "text": "In 2021/2022, three funding streams were made available through the WiMFIF"
        },
        {
            "heading": 2,
            "text": "The successful projects."
        },
        {
            "heading": 3,
            "text": "Routes to market for ash timber Innovation Fund"
        },
        {
            "text": "Securing a new supply chain for ash through the development of ash tool handles, Grown in Britain works to reduce imports and utilise more UK timber. This project with Axminster Tools aims to see ash more widely viewed as high value, bringing more ash into active management."
        },
        {
            "text": "Researching the use of rotary veneer technology (rotary peeling) to add value to small diameter ash logs from small woodlands. Rotary peeling is quicker and produces less waste than sawmilling and can use lower value logs not suited to sawmilling."
        },
        {
            "heading": 3,
            "text": "Regional woodland restoration Innovation Funds:"
        },
        {
            "heading": 4,
            "text": "South East and London Innovation Fund"
        },
        {
            "text": "Securing a new supply chain for ash & sweet chestnut through developing a range of construction components. This project with Grown in Britain, Birling Estate and London Metropolitan University showcases the use of sweet chestnut & ash in scalable housing construction bringing more woods into management, aiding habitat restoration and boosting local economies."
        },
        {
            "text": "Development of an online UK Forestry Standard (UKFS) Evaluator Tool to support woodland management. The tool, known as myForest Woodland Assessor, will enable woodland owners and agents to critique their woodland management practices against the UKFS and will be used to deliver advice to 50 owners of undermanaged woodlands, raising awareness to support delivery of the UKFS."
        },
        {
            "text": "Exploring opportunities to address ash decline in the South Downs National Park. Through three trials, this project is looking at under planting declining ash as an alternative to clearfelling. It aims to restore woodland SSSI containing ash and restore ash heavy Ancient Woodland sites. The project will plant both native species and species tolerant to climate change and is seeking to improve woodland habitats."
        },
        {
            "heading": 4,
            "text": "Yorkshire and North East Innovation Fund"
        },
        {
            "text": "Development of a new GIS dataset to identify which unmanaged woodlands have the lowest barriers to management. Once established, this GIS methodology will be made available for other landowners in England to use. This project is also trialling the myForest assessor tool developed by the Sylva foundation and will provide support to woodland owners through online assessments and seminars."
        },
        {
            "heading": 4,
            "text": "East England and East Midlands Innovation Fund"
        },
        {
            "text": "Research into the use of temporary road surface matting in the management of Ancient and SSSI Woodlands across Bedfordshire, Cambridgeshire and Northamptonshire."
        },
        {
            "text": "By using temporary matting, the impacts of machinery on ecologically sensitive woodland sites can be reduced, whilst allowing vehicles access to areas of ash dieback to facilitate the extraction of material. This research will be used to assess whether temporary access can bring areas of woodland into management that might previously have been discounted."
        },
        {
            "heading": 4,
            "text": "North West and West Midlands Innovation Fund"
        },
        {
            "text": "A collaboration with the Royal Forestry Society (RFS) providing information to demystify forestry and woodland management. Through this project, a new course designed for non-specialists has been developed. Woodland owners will have access to the RFS new mentor scheme where they will be informed about management, climate change, planning, licensing, and grants. At the end of the project, a report will be produced highlighting opportunities, constraints, and barriers to woodland management."
        },
        {
            "text": "An investigation into the use of diseased ash in biochar production. Through this project, a co-operative will be developed between woodland owners, managers and farmers who are seeking to remove diseased ash from their woodlands, linking up with Shropshire Council, the Bio-products Research Institute at Aston University (EBRI) and industry. Production of Biochar using a kiln, retort and by pyrolysis are being compared taking into consideration the ease of production and economics."
        },
        {
            "text": "Coordinating and managing a FSC Ecosystems Services Project on behalf of small woodland owners across the North West and West Midlands. This project is supporting woodland owners to produce management plans and implement the FSC Ecosystem Services Procedure, ensuring connectivity and biodiversity improvements and bringing more woodlands into active management."
        },
        {
            "text": "Research and development of a new business model that engages woodland managers and landowners, and provides support to River Trusts. This project is conducting a review of barriers to woodland management to develop a better understanding between River Trusts and private forestry."
        },
        {
            "text": "Analysis of publicly available information and datasets, scoring woodlands by scale and ease of management, to develop a “hitlist” of priority areas for management. This analysis will be followed by a targeted outreach programme in the NW&WM, engaging with unmanaged woodland owners to promote sustainable woodland management."
        },
        {
            "text": "Inspiring and enabling owners to bring woodlands into management through online training to demystify woodland management, provision of virtual advice, and an initial light touch site visit to guide the formal processes of management grants and plans."
        },
        {
            "heading": 4,
            "text": "South West Innovation Fund"
        },
        {
            "text": "Silviculture Analysis of publicly available information and datasets, scoring woodlands by scale and ease of management, to develop a “hitlist” of priority areas for management. This analysis will be followed by a targeted outreach programme in the South West, engaging with unmanaged woodland owners to promote sustainable woodland management."
        },
        {
            "text": "Delivering public information and outreach to engage woodland owners in projects and management. Through this project, woodland owners along 35 miles of Exmoor coast will be connected, and climate resilience and carbon sequestration improved through replanting, regeneration and implementation of grey squirrel management plans targeted to key locations."
        },
        {
            "text": "Analysis of forest cover and timber stock in Dartmoor and the surrounding areas. Combined with an evaluation of Dartmoor’s wider forestry sector, this will facilitate understanding of local supply and demand for timber, with a view to bringing more woodland into management. This project is exploring how local woodland related industries in the area can find new opportunities in ‘Dartmoor's Future Forest’."
        },
        {
            "text": "Research and trial of a new woodland ownership model which allows groups of small investors to buy areas of woodland through a legal entity, such as a company with shares, which then manages the woods on the investor’s behalf for a small service charge. Woods will be managed to preserve ecological health, and to maximise both biodiversity and carbon sequestration."
        }
    ]
}