{
    "url": "https://educationhub.blog.gov.uk/2021/08/back-to-school-what-you-need-to-know/",
    "title": "Back to school – what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2021-08-24T10:59:26+01:00",
    "content": [
        {
            "text": "Pupils all over the country are beginning to return to schools and colleges after their summer breaks. For many pupils they will be returning with far fewer restrictions than when they left for the summer holidays."
        },
        {
            "text": "Now that there are fewer restrictions, pupils will be able to experience a fuller education experience, including, access to more group activities, team sports, playing with friends, plays, and taking part in musical groups."
        },
        {
            "text": "Here’s what you need to know on going back to school."
        },
        {
            "heading": 3,
            "text": "There are three key changes:"
        },
        {
            "heading": 3,
            "text": "1. Mixing and ‘bubbles’"
        },
        {
            "text": "Keeping pupils or students in year group or classroom bubbles to reduce mixing is no longer a requirement."
        },
        {
            "heading": 3,
            "text": "2. Tracing close contacts"
        },
        {
            "text": "Close contacts will now be identified via NHS Test and Trace. Education settings are no longer expected to undertake contact tracing."
        },
        {
            "heading": 3,
            "text": "3. Face coverings"
        },
        {
            "text": "Face coverings are no longer advised for pupils, staff and visitors either in classrooms or in communal areas."
        },
        {
            "heading": 3,
            "text": "So, what will stay the same?"
        },
        {
            "text": "Coronavirus hasn’t gone away so there will still be a need for schools, pupils and students to follow basic measures to avoid the spread of the virus:"
        },
        {
            "heading": 3,
            "text": "Is it true that the start of term is being delayed?"
        },
        {
            "text": "No. We’re aware of misleading reports suggesting the start of term could be delayed by schools. This is not the case."
        },
        {
            "text": "Our priority is to ensure settings are able to deliver high-quality, face-to-face education to all pupils."
        },
        {
            "text": "As our guidance stated two months ago, and to ensure all pupils receive the education they deserve with minimal disruption, settings may commence testing from three working days before the start of term and can stagger the return of pupils across the first week to manage this process."
        },
        {
            "heading": 3,
            "text": "But what if there are a number of cases in one school or college?"
        },
        {
            "text": "If there are a number of cases in one school or college, there is advice in place so teachers and staff know what to do."
        },
        {
            "text": "Schools and colleges will do everything they can to minimise the impact on education and attendance, so might decide to introduce measures like:"
        },
        {
            "text": "More information on the guidance we have issued to education settings is available on our website: Contingency framework: education and childcare settings."
        },
        {
            "heading": 3,
            "text": "What if someone tests positive or has symptoms? Do they need to isolate?"
        },
        {
            "text": "Self-isolate straight away and get a PCR test (a test that is sent to the lab) on GOV.UK as soon as possible if you have any of these 3 symptoms of COVID-19, even if they are mild:"
        },
        {
            "text": "You should also self-isolate straight away if:"
        },
        {
            "text": "Pupils should only self-isolate if they have symptoms or if they get a positive PCR or Lateral Flow Device (LFD) test."
        },
        {
            "text": "If they develop symptoms or get a positive LFD test they should book a PCR test. A positive PCR test cannot be overridden. If a pupil is asked to get a PCR test as a result of contact with a positive case they may continue to attend education until they get the result of their PCR back."
        },
        {
            "heading": 3,
            "text": "And what will happen for people who have been in contact with positive cases?"
        },
        {
            "text": "Individuals are not required to self-isolate if they live in the same household as someone with COVID-19, or are a close contact of someone with COVID-19, and any of the following apply:"
        },
        {
            "text": "Instead, they will be contacted by NHS Test and Trace, informed they have been in close contact with a positive case and advised to take a"
        },
        {
            "text": "PCR test. They do not need to isolate while awaiting the PCR test. We would encourage all individuals to take a PCR test if advised to do so."
        },
        {
            "text": "Staff who do not need to isolate, and children and young people aged under 18 years 6 months who usually attend school, and have been identified as a close contact, should continue to attend school as normal."
        },
        {
            "text": "If none of the above applies, people should self-isolate as per the instructions from NHS Test and Trace."
        }
    ]
}