{
    "url": "https://civilservice.blog.gov.uk/2021/08/24/disability-and-me/",
    "title": "Disability and Me",
    "authors": [
        "Gill Atkinson, Deputy High Commissioner to Abuja, British High Commission"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-08-24T08:15:39+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Gill Atkinson, Deputy High Commissioner to Nigeria, shares her inspiring account of living and successfully working with an invisible disability."
        },
        {
            "text": "I was recently asked in a FCDO survey, ‘Do you self-define as disabled?’  At a personal level, the question annoyed me because the answer is straightforward – no. I do live with a disability though. I have epilepsy but it’s not how I define myself.  I couldn’t work out how to answer. By saying no, the diversity statistics would be wrong, but by saying yes, I would give an untrue answer. I said no, and gave a pithy comment at the end…."
        },
        {
            "text": "My childhood and young adulthood were ‘normal’ and ‘healthy’ and I joined the Civil Service – originally in the Ministry of Defence. I started out working for the MOD outside London, before moving to the capital in 1997.  "
        },
        {
            "text": "Unconscious"
        },
        {
            "text": "One perfectly normal day, two years later, I woke up in St Thomas’ Hospital A&E with no memory of what had happened. Apparently I’d become unconscious at Waterloo Station on my way home. Tests were clear, and the doctors decided I may have had an epileptic seizure, but there is an 8-10% chance of having a one-off seizure in adult life. "
        },
        {
            "text": "I crossed my fingers and carried on, although I had to give up driving for 12 months. A minor hiccup was that the officer who later carried out my first DV clearance asked for lots of detail on something I couldn’t actually remember much about."
        },
        {
            "text": "Formal diagnosis"
        },
        {
            "text": "A couple of years later, now working in the UK delegation to NATO, on loan to the Foreign Office (now FCDO), I had a second seizure one evening.  The situation was confusing as I was on my own at work. I may have driven home from the office afterwards, but have no memory of doing so. The next day, my GP sent me to the local A&E in Brussels where they carried out a range of tests and this time, gave a formal diagnosis of Epilepsy.  "
        },
        {
            "text": "I had to start medication – the main impact was that I wasn’t allowed much alcohol and I had to give up driving again. I was pleasantly surprised how much support friends and colleagues gave. This included regular lifts to the office (NATO is not great to get to, by public transport) whilst the  Ambassador at the time, Peter Ricketts – later National Security Advisor, used to invite me to stay over at the residence after official dinners. Back then, taxis cost about €40 for the evening, and at the time, the office refused to help with transport costs to official functions. Now, thankfully they do help.  "
        },
        {
            "text": "At the same time though, I had to come to terms with the fact I had a condition which means I could describe myself as disabled. I do still find this odd, as it’s really not how I think of myself.  I was fortunate though - I was already an adult, had set a career path and self image and although there were minor bumps, I found myself working for an organisation that, even 20 years ago, took the diagnosis in its stride."
        },
        {
            "text": "My seizures are very infrequent, but serious, and when they happen, I’m pretty ill and it takes a while to recover. They can be embarrassing (during a video conference with New York in the Political Director’s office and at the Ambassador’s PA’s birthday party in Warsaw both spring to mind).  "
        },
        {
            "text": "I finally gave up driving for good about 10 years ago – it’s actually more straightforward just to manage life without driving than never being quite sure. Most of my jobs have been related to security issues, including a period as a Head of Department in the National Security Directorate, and across a range of countries where security is a challenge.   "
        },
        {
            "text": "I’ve now been DV’d consistently for almost 20 years, and my epilepsy has never been an issue after that first interview. I do have to be a little careful about where I’m posted in terms of the availability of medical care and how I manage not driving. But in recent years, I’ve worked in Karachi and Dhaka and I am now Deputy High Commissioner in Abuja. "
        },
        {
            "text": "Non-visible disability"
        },
        {
            "text": "I know I’m fortunate, my disability is non-visible and most of the time my life is normal although not driving is inconvenient. But my seizures are sudden and disruptive – and I never have any warning.  "
        },
        {
            "text": "I’d say my experience as a disabled diplomat has been about 90% positive. I’ve had supportive line managers, and colleagues of all grades have treated me as normal and with kindness, even when my seizures have been potentially embarrassing and certainly inconvenient to everyone. My career has seen me reach the Senior Civil Service – and I hope to continue that success. "
        },
        {
            "text": "There are a few things the FCDO (and I) could do better. Although there are some posts that obviously won’t work, how do I challenge a job description which says driving is essential – is it really?  "
        },
        {
            "text": "Do I apply and see if a reasonable adjustment can be made – and what if it can’t? Reasonable adjustments are paid for from the centre, so why did I allow myself to be pushed out of using official support with an office driver, and into informal ad hoc arrangements (which are less flexible) on the basis it would be cheaper?"
        },
        {
            "text": "As I move through the system, how do I decide which jobs to apply for and which to exclude as the number of possible roles becomes smaller? Ultimately I know that this smaller selection may be career limiting – I’m not sure I’m reconciled to that. And finally, why did I have to think long and hard about writing this blog, even though many colleagues know I have epilepsy?"
        },
        {
            "text": "When I start a new role, I let colleagues know I have epilepsy, and what to do if I have a seizure. I’ve consistently had positive feedback about doing so, people welcome the openness, guidance and honesty.  I’m also about to start work with one of my colleagues in Abuja on our lobbying on disability rights in Nigeria."
        },
        {
            "text": "As well as living with a disability, I’m a woman and went to the local comprehensive in Doncaster.  My career in FCO/FCDO and the wider Civil Service hasn’t been without its moments of discrimination, but it’s certainly not the stereotypes of Yes Minister or W1A. I’ve enjoyed working across a range of jobs in and with the National Security Community – I do encourage others to join us."
        }
    ]
}