{
    "url": "https://securityprofession.blog.gov.uk/2021/08/24/profile-kelly-paterson-chief-security-officer-hmrc/",
    "title": "Profile: Kelly Paterson, Chief Security Officer HMRC",
    "authors": [
        "Kelly Paterson"
    ],
    "categories": [
        "Government Security",
        "Job",
        "Women and security"
    ],
    "pub_date": "2021-08-24T12:16:19+01:00",
    "content": [
        {
            "text": "I am honoured to have been asked to share my story. It’s not unique, exciting or even that special. But if it encourages anyone who has listened  to the little voice of doubt in their head, my job is done. "
        },
        {
            "text": "I did well at school, despite being brought up in an environment which didn’t value education.  I saw it as a way out of a cycle of unemployment that my family and every family around us found themselves repeating, generation after generation. "
        },
        {
            "text": "Life got in the way"
        },
        {
            "text": "Deciding to study Anatomy at university was an easy choice and I aspired to become a Forensic Scientist. Graduating in 2000 from the University of Glasgow was my springboard. As it tends to do, life got in the way and my husband and I found ourselves pregnant with our first child. "
        },
        {
            "text": "I decided, therefore, to join a commercial bank’s security graduate programme in 2001. As the role offered £17k a year (a fortune for us) and a great maternity policy, it was the best thing for my family. Four years and another two babies later, I was offered the role of heading up the bank’s Security Transformation programme and my real love affair with security started."
        },
        {
            "text": "I spent 19 years with the bank, gaining experience in every corner of security, leading the Cyber and Physical Security teams, fraud transformation and incident response function, to name a few. With a passion for encouraging women and girls into technology and security, I joined several industry groups to support school-age girls across the UK to look to science, technology, engineering and maths (STEM) subjects as viable careers. Throughout that time I felt massively supported by my employers and five periods of maternity leave certainly tested this."
        },
        {
            "text": "Ready for a new challenge"
        },
        {
            "text": "Leaving the bank after my fifth child was a difficult decision, but one that I am very happy to have made. I wasn’t pushed (promise) and I didn’t get a big cheque on the way out (shame); I did it because I was ready for a new challenge. I’ve always been one who closes her eyes and jumps!"
        },
        {
            "text": "Two months into my role as Chief Security Officer at HMRC I’m finding the change equally terrifying and exhilarating. All of the fears I had about the civil service were unfounded (have yet to meet an out of touch, dusty civil servant). The people are passionate, dedicated and focused on doing the right thing. I’m hoping to continue my role as an HMRC diversity and inclusion ambassador and am honoured to have been asked to become autism champion, a role I will give my all."
        },
        {
            "text": "Managing a busy job, five children and my passion for diversity and inclusion isn’t easy. I’ve failed many times to keep the balls in the air, learning throughout my career and relying on the support of my family and employer. Most important of all, I’ve sometimes ignored that little voice of doubt in my head, bet on myself and made choices based on what’s right for me and my family. "
        }
    ]
}