{
    "url": "https://defradigital.blog.gov.uk/2021/08/24/user-research-whats-it-all-about/",
    "title": "User Research – what’s it all about?",
    "authors": [
        "Amy Dyde"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2021-08-24T08:37:49+01:00",
    "content": [
        {
            "text": "I recently joined Defra’s Digital Data and Technology Services (DDTS) function as a lead user researcher and I’m already finding the role immensely fulfilling.  Previously, I worked in another public sector organisation for nearly sixteen years, so I was worried that I would be a little bit institutionalised and that working for and learning about Defra would, at first, be overwhelming."
        },
        {
            "text": "This hasn’t been the case though. Everyone I have met has been friendly, welcoming, and keen to help me settle in. The onboarding process has been simple, and the time has whizzed by. I’ve learned so much already and I feel that I’m trusted and making contributions to the work of the team. I’m passionate about working with service users and overcoming challenges, and I feel excited and enthusiastic about the future."
        },
        {
            "heading": 2,
            "text": "Putting the ‘U’ into user research"
        },
        {
            "text": "User researchers plan, design, and carry out research activities with users that help teams get a deep understanding of the people that use government services. This research informs policy, proposition, service, content, and interaction design so that services work well for users and achieves policy intent."
        },
        {
            "text": "In our team we support the delivery of Defra’s priority outcomes; protecting and enhancing our environment to make it a great place for living. From safeguarding the natural environment, to supporting a world-leading food and farming industry, to sustaining a thriving rural economy – our user research community has a part to play in it all. Our great people are real advocates for the voices of the users of our services too."
        },
        {
            "text": "We all love the idea of working in a role where we really can make a difference. We celebrate new ideas and enable better outcomes and sustainable practices.  Through co-design we are involved in real-life trials of ideas and approaches.  A good example of this is the user research work being done in support of the Future Farming and Countryside Programme,"
        },
        {
            "text": "We experiment, test, and learn to make sure that services are simple, fair, and effective, and that they work for users themselves. We are an outward facing, diverse and inclusive team.  Most of all though, while doing these things that are making a difference, we are having fun."
        },
        {
            "heading": 2,
            "text": "So, what’s it like to work in our team?"
        },
        {
            "text": "As the leader of a growing team, I want to create a working environment that feels supportive, creative, and fun, where staff flourish and reach their potential. In turn, this then has a positive impact on the outputs of the team and the service provided to stakeholders."
        },
        {
            "text": "And as part of a relatively new leadership team, I and my fellow leaders are developing our approach to wellbeing using staff feedback and making use of Defra’s reward and recognition schemes.  We have a career development pathway, and we are passionate about introducing a talent management process where we create opportunities for progression."
        },
        {
            "text": "We strive to provide our people with the best available technology and tools to perform their roles, and we encourage innovation, while working in an ethical and sustainable way.  We are keen to promote a ‘one team’ ethos and a collective identity where we create opportunities for user researchers to share knowledge and learning with each other. Through a welcoming and inclusive approach, we’re creating a strong sense of belonging, pride, and job satisfaction within our community."
        },
        {
            "text": "One member of my team, Penny Kirby, has taken the time to reflect on her experience of being a user researcher in Defra."
        },
        {
            "text": "“I’m a User Researcher at Defra, working on the Environment Agency’s Flood Map for Planning Service on GOV.UK. Before joining Defra two years ago I’d been working in UX in the private sector for over 15 years. I have a degree in graphic design."
        },
        {
            "text": " “On my project we are looking to improve how people access one of our flood risk data products. The aim is to deliver benefits for both the end user and the organisation. It’s a really interesting project. I help the team learn about the people who use the service, to understand the bigger picture so that we can improve the service for users and solve problems for the organisation. I’m embedded in a multidisciplinary team where a lot of our focus is on understanding the needs of service users and other teams and colleagues in the Environment Agency. For example, understanding the back-office workflow and the intricacies of how maps are created has been a large part of my research."
        },
        {
            "text": " “I’ve worked on the project from discovery where I did contextual research going out to end users’ offices. More recently we’ve been focusing on usability testing the end-to-end journey in private beta. The research has helped the team learn about the complexities of the data used to create the product. This has led to us changing our approach to how we will deliver the service so that we still deliver improvements for our customers and business efficiencies. "
        },
        {
            "text": " “I enjoy that I can contribute to the important work Defra is doing. I really enjoy observing and listening to people, I love finding patterns in how people behave. I get job satisfaction from seeing the improvements we get when we identify and solve problems.”"
        },
        {
            "heading": 2,
            "text": "Find out more about user research roles in Defra"
        },
        {
            "text": "If you have been inspired and enthused by what you’ve read here, and you feel passionate about working in a role where you really can make a positive impact, we would love to hear from you."
        },
        {
            "text": "We’re currently recruiting for Senior User Researchers. Read the job advert and find out how to apply."
        },
        {
            "text": "Top tips if you’re new to applying for Civil Service Jobs."
        },
        {
            "text": " "
        }
    ]
}