{
    "url": "https://valuationoffice.blog.gov.uk/2024/05/08/council-tax-renovations-and-repairs/",
    "title": "Council Tax: renovations and repairs",
    "authors": [
        "Diane Thomson - CT and Rent Officer Functions Unit Head"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2024-05-08T13:32:51+01:00",
    "content": [
        {
            "text": "Council Tax bands are based on the price a property could have sold for on a fixed date. This is 1 April 1991 in England and 1 April 2003 in Wales."
        },
        {
            "text": "Every property that is habitable (capable of being lived in) or capable of being repaired is banded for Council Tax."
        },
        {
            "text": "We can only delete a property’s Council Tax band in limited circumstances. This happens when the property is one of the following:"
        },
        {
            "text": "In this blog, we explain what we class as major renovation, the evidence we need to delete the property’s band, and what happens once the band has been deleted."
        },
        {
            "text": "Read our previous blog for more information about truly derelict properties."
        },
        {
            "text": "What is major renovation?"
        },
        {
            "text": "For Council Tax purposes, major renovation is classed as significant redevelopment or reconstruction work affecting most of a property."
        },
        {
            "text": "Works will be substantial, and of a much greater scale than typical repairs."
        },
        {
            "text": "While works are ongoing, the property will not be capable of being lived in. If you are living in the property, or it is capable of being lived in, we will not be able to delete the band."
        },
        {
            "text": "Examples of major renovation include:"
        },
        {
            "text": "We look at every request on a case-by-case basis, taking into account the extent of the works and whether they have actually started."
        },
        {
            "text": "Property conversions"
        },
        {
            "text": "Property conversions, such as flats merged into one single property or one property converted into multiple flats, are classed as major renovations."
        },
        {
            "text": "If part of the property can still be lived in while works are ongoing, it will be banded for Council Tax. We will then band each new unit once works are complete."
        },
        {
            "text": "Normal repairs"
        },
        {
            "text": "We class normal repairs as the replacement or renewal of property features that have worn out over time. We would not usually delete a property’s Council Tax band for normal repairs, unless they formed part of a wider scheme of works."
        },
        {
            "text": "Examples of normal repairs include:"
        },
        {
            "text": "Our decision is based on the extent of the works and how they affect the property as a whole, not how much the repairs will cost."
        },
        {
            "text": "Evidence requirements"
        },
        {
            "text": "When you ask us to delete your property’s Council Tax band, we will ask you for evidence to help us make a decision."
        },
        {
            "text": "For properties undergoing major renovation, this evidence could be:"
        },
        {
            "text": "The amount of evidence you will have will depend on the size of the scheme, but it’s important you provide as much information as possible."
        },
        {
            "text": "We will need to be satisfied that there is a scheme of works actually underway before we delete a band."
        },
        {
            "text": "What happens next?"
        },
        {
            "text": "If we agree to delete your property’s Council Tax band, the effective date for deletion is the first day the works physically start. Obtaining planning permission does not mark the start of a scheme."
        },
        {
            "text": "If we delete your band after the works have started, the deletion will be backdated."
        },
        {
            "text": "Once the works have been completed, your property will be banded as new. If you have converted a single property into flats, each flat will be banded separately."
        },
        {
            "text": "We will consider all improvements made to the property. This means your Council Tax band may go up. The effective date will be the date works were completed."
        }
    ]
}