{
    "url": "https://deframedia.blog.gov.uk/2024/05/08/coverage-of-bluetongue-virus-risk/",
    "title": "Coverage of Bluetongue virus risk",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-08T19:45:45+01:00",
    "content": [
        {
            "text": "  There has been widespread coverage of our announcement that there is a very high probability of a new introduction of bluetongue virus serotype 3 (BTV-3) into livestock in Great Britain this year."
        },
        {
            "text": "This was reported by publications including BBC News,  Sky, Standard, ITV, Farmer’s Weekly, Farmer’s Guardian, Mirror, Mail, GB News, Shropshire Star and South Wales Argus."
        },
        {
            "text": "Bluetongue virus is primarily transmitted by biting midges (Culicoides species) and affects cattle, sheep, and other ruminants such as goats and deer, and camelids such as llamas. The virus does not affect people or food safety."
        },
        {
            "text": "There are no authorised vaccines available for bluetongue virus serotype 3 (BTV-3) in the UK or Europe, but the government are actively engaging with vaccine manufacturers on the development of a BTV-3 vaccine for use in the UK."
        },
        {
            "text": "The vaccine approved by the Dutch authorities has emergency use approval but not market authorisation. Vaccines without market authorisation can have potentially negative implications for trade and may impact our ability to export meat and dairy products to some trading partners. We are actively monitoring vaccine data from EU countries and will continue to work with industry on any decisions on use of a deployable vaccine."
        },
        {
            "text": "In an updated qualitative risk assessment, APHA confirm there is a very high probability of a new introduction of bluetongue virus serotype 3 (BTV-3) into livestock in Great Britain through infected biting midges being blown over from northern Europe.  Biting midges are most active between April and November and the timing of a potential incursion will depend on the temperature and wind patterns."
        },
        {
            "text": "Due to their proximity to areas in Northern Europe, where BTV-3 is actively being transmitted by the biting midge population and wind patterns, counties along the south and east coasts of England, including Norfolk, Suffolk, Essex, Kent, and Sussex, are considered most likely to be impacted."
        },
        {
            "text": "The government is actively monitoring the situation and has been working closely with a wide range of stakeholders to review the bluetongue virus control strategy."
        },
        {
            "text": "Biosecurity Minister Lord Douglas Miller said:  "
        },
        {
            "text": "“We must not be complacent about the bluetongue virus risk and the challenge this could pose to our livestock sector.  We want to ensure our control strategy is proportionate, and we will continue to work with industry to keep them briefed on the latest disease and veterinary assessments."
        },
        {
            "text": "“Once the risk of transmission increases, we will also be offering free bluetongue tests to keepers in high-risk counties and we are actively engaging with vaccine manufacturers on the development of a BTV-3 vaccine for use in the UK. “"
        },
        {
            "text": "Chief Veterinary Officer Dr Christine Middlemiss said: "
        },
        {
            "text": "“Our robust surveillance systems show we have now entered the period where biting midges are more active, and we know that the likelihood of bluetongue virus entering Great Britain is increasing."
        },
        {
            "text": "“Despite the increase in midge activity, the current risk of transmission has not changed, but I would urge farmers to remain vigilant and report any suspicions to the Animal Plant Health Agency ."
        },
        {
            "text": "“Bluetongue virus does not pose a threat to human health or food safety.”"
        },
        {
            "text": "David Holdsworth, Chief Executive Officer, Animal and Plant Health Agency said:    "
        },
        {
            "text": "“The Animal Plant Health Agency’s world-leading scientists and vets have been working to provide evidence and modelling to government, to enable effective proactive planning and to prepare for any potential incursion and outbreak in the UK. Our field teams stand ready and will continue to work closely with farmers and animal keepers to ensure they are kept up to date and supported during any outbreak ."
        },
        {
            "text": "“I would encourage farmers to make sure they register their livestock and land with APHA, ensure their contact details are updated so we can locate animals in the event of an outbreak, and monitor their animals frequently for clinical signs.”"
        },
        {
            "text": "Farmers should continue to be vigilant and monitor their animals frequently, whilst making sure their livestock and land is registered with APHA and that their contact details are updated so animals can be located in the event of an outbreak. More advice can be found on gov.uk."
        }
    ]
}