{
    "url": "https://deframedia.blog.gov.uk/2024/05/08/coverage-of-thames-barrier-celebrating-40-years-protecting-london/",
    "title": "Coverage of Thames Barrier celebrating 40 years protecting London",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Flood"
    ],
    "pub_date": "2024-05-08T11:36:24+01:00",
    "content": [
        {
            "text": "There has been widespread positive media coverage today following the 40th anniversary of the late Queen officially opening the Environment Agency’s largest asset, the Thames Barrier, on 8 May 1984."
        },
        {
            "text": "Publications including the BBC, Financial Times, Independent, Daily Express, The York Press, Standard, Greenwich Wire, and Lowestoft Journal published stories marking the occasion."
        },
        {
            "text": "Operated and maintained by the Environment Agency, the Thames Barrier and the other flood defences across the wider estuary protect 125 square kilometres of central London, encompassing 1.42 million people, four World Heritage sites, more than 4,000 listed buildings, 711 healthcare sites, 116 railway and tube stations and more than 300km of major roads. The value of residential property protected stands at £321 billion."
        },
        {
            "text": "Without the barrier, storm surges and frequent tidal flooding of the Thames would submerge buildings along the river as well as the underground, wrecking properties and livelihoods and causing billions of pounds worth of devastating damage."
        },
        {
            "text": "In its 40 years, the barrier has closed 221 times for flood defence purposes, underlining its importance to helping London thrive."
        },
        {
            "text": "Andy Batchelor, Thames Tidal Defences Operations Manager, said:"
        },
        {
            "text": " "
        },
        {
            "text": "Caroline Douglass, Executive Director for Flood and Coastal Risk Management at the Environment Agency, said:"
        }
    ]
}