{
    "url": "https://ruralpayments.blog.gov.uk/2024/05/08/marie-hardemans-site-visit-to-a-lancashire-farm/",
    "title": "Marie Hardeman’s site visit to a Lancashire farm",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-05-08T16:28:23+01:00",
    "content": [
        {
            "text": "In the first of a series of blogs from Customer Director, Marie Hardeman on her visits to shows, farms and projects, Marie writes about her time at a farm in Lancashire, with RPA field officers on a sheep identification site visit. "
        },
        {
            "text": "I joined field officers Emma and Stuart on a sheep identification site visit to a farm in Lancashire, where the farmer, a widower, is now farming alone but is supported with paperwork and the admin side by family members."
        },
        {
            "text": "It was a beautiful sunny day when we arrived and the first thing I quickly realised is that you’re not only entering someone’s farm, business, and home, but you’re also stepping into their lives. Within seconds of sitting down at the kitchen table, we had an excellent cup of tea, and were looking to see how we could help."
        },
        {
            "text": "The farmer and family organised paperwork efficiently but were unsure whether they were completing the right paperwork for sheep on and off the farm and were entering the same information in different places. Field officer Emma was great. She was empathetic and explained the paperwork clearly and within minutes was able to halve the amount of time they were spending on record keeping. She was also able to note discrepancies in the sheep purchased and tag numbers on the paperwork from the mart, and explained why this was important and how to put things right."
        },
        {
            "text": "The family was also unsure how to use the Rural Payments service and had called RPA more than once. With them feeling unsupported, this was so far unresolved. I did a quick call to a colleague in RPA to get their permissions on the Rural Payments service updated so they can now do everything they need to online."
        },
        {
            "text": "They’d also recently been to a farm advice session and were interested in the Sustainable Farming Incentive (SFI) but didn’t know where to start, so we went through the SFI area of the Rural Payments service, checked maps, and looked at the actions they could include in an application."
        },
        {
            "text": "After this, we went out onto the farm where both Stuart and Emma commented on how well kept it was, both the farm areas and the animals. Emma demonstrated how her scanner worked and how it could help reconcile tags to purchases, and although sceptical at first, once the farmer started scanning, he was totally sold on it."
        },
        {
            "text": "We also went out into the fields for Emma to literally count sheep and the farmer proudly showed us his neat hedges, which are cut once a year. We talked about the hedgerow actions in SFI and explained that if on rotation, he cut each hedge every two years, cutting no more than half his hedges each year, he could apply for that action under SFI, meaning he can halve his cost and get an income. In addition, he has a soil test and plan he’s got to do, and that can also be included."
        },
        {
            "text": "By the time we left everyone was happy. The farmer was scouring eBay for a scanner and was planning to look at an SFI application, and replacement ear tags were also being ordered."
        },
        {
            "text": "A big thank you to Stuart and Emma, who demonstrated that their advice and guidance is immeasurable, and I’m confident the farmer and his family got as much out of our visit as I did."
        }
    ]
}