{
    "url": "https://moderncivilservice.blog.gov.uk/2024/05/08/meet-the-modern-civil-service-neil-couling/",
    "title": "Meet the Modern Civil Service: Neil Couling",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Interview",
        "Modernisation and Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-05-08T13:46:53+01:00",
    "content": [
        {
            "text": "Neil Couling, DWP Change and Resilience Director General and Senior Responsible Owner Universal Credit,  spoke with Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit about what A Modern Civil Service means to him, as well as how he sees reform in action and how all civil servants and the public will benefit from change. "
        },
        {
            "heading": 2,
            "text": "What does a Modern Civil Service look like to you?"
        },
        {
            "text": "It's a bit of a mix for me. There's something eternal in my view about the idea of public service, and that's what's caused so many of us to come and want to be civil servants. Although it was a long while ago for me, that fire burns as strongly in me to be a proud civil servant. But we have to recognise that the demands on us, and the way the world is changing, is creating new expectations of us. For me, a modern civil service means meeting those expectations, but not losing that public service ethos that is an eternal verity in my view. "
        },
        {
            "heading": 2,
            "text": "A journey through the Civil Service"
        },
        {
            "text": "It's a long while ago — some may say when dinosaurs still ruled the earth was when I joined the civil service! I joined as a temporary administrative assistant. It was effectively a job that I wasn't expecting to stay in, but instead I absolutely loved it. And when I said, “could I apply to be a permanent civil servant?” they said, yes, of course.  So I applied, worked my way up through various of the grades, starting in operational delivery. I loved meeting the public and working with the public. It was just eye opening as a young man, and I just loved that sense of what we did was really important. "
        },
        {
            "text": "Since then I've been lucky enough to get promoted a fair few times and have done a number of interesting jobs. Some of my career highlights involved working as a district manager for the benefits agency. I was Alastair Darling's principal private secretary for a couple of years. I ran Jobcentre Plus, and I ran all the welfare reforms as well after the coalition government came in. But my biggest job has been as senior responsible owner for Universal Credit for the last 10 years and overseeing its transformation."
        },
        {
            "heading": 2,
            "text": "Building an ambitious and determined Civil Service"
        },
        {
            "text": "When looking at your civil service career, there's something to be said about determination. If you've ever worked delivering services to the public, you have to be pretty determined to make things happen, your commitment to colleagues, and accept that you can't do this on your own. I found that determination rather infectious."
        },
        {
            "heading": 2,
            "text": "The evolution of the Civil Service in the last decade"
        },
        {
            "text": "The biggest difference in the civil service now is the way in which we use technology. I mean, it would have amazed the young 23 year old who was stumbling around the Department of Health and Social Security's office a long while ago in terms of just what the tech can do, the way in which we can talk to each other now across departments."
        },
        {
            "text": "For example HM Revenue and Customs (HMRC) provide real time earnings information that comes through to us so we can assess 2 million people's Universal Credit data every month."
        },
        {
            "text": "I think the public holds us to a higher standard, and that is a good motivator to improve things for citizens. I can tell you from my inbox there are many people who are not yet happy with the way in which we're delivering services, but that doesn't make me down. That inspires me to want to improve and want to fix whatever the problem is. If it's systemic, I want to make sure it doesn't happen for other people. "
        },
        {
            "text": "To make things easier for the public and civil servants, the information you need for a claimant is now all in one place. You can communicate directly to the claimant and they can come directly back to you. It's streets ahead of where things were even 15 years ago or 10 years ago. So I'm very proud of that, because it's taken many hundreds of people over the last 10 years to build this."
        },
        {
            "text": "All that being said,  there are still about two million people to move across to Universal Credit. We’ve moved about 300,000 of those in the last six months and we're on track to do about a million of those by the end of 2024 and into 2025. So that's the next phase of the project. We've got one more phase afterwards that will see nearly 7 million people in the service some time in the future. When I took over back in 2014, I think we had about 20,000 people on Universal Credit, so you can see how it's grown. "
        },
        {
            "heading": 2,
            "text": "The impact of AI on the Civil Service"
        },
        {
            "text": "Artificial intelligence (AI) is a good example of what could be next with Universal Credit. Whilst AI has been around for many years, these large language models that people are now exploiting and using weren't around when we first designed Universal Credit. So it'll be a question of, well, how can we exploit some of that technology? "
        },
        {
            "text": "We're doing some really good stuff and hats off to my digital colleagues actually for leading some of this. I think when you ask what AI can do for us, it should be about enhancing services to the public and making jobs more enriching for our people who are working in the system. A good example of that, we've developed is based on a large language model and is trained to look out for vulnerability."
        },
        {
            "text": "We get so many thousands of letters a day, and the length of time it takes to sift through means that someone vulnerable could potentially be missed. So we've trained this large language model to spot these letters, pull them out and highlight them, so that a human being can pick up that case and say, “We're going to get to you today and try and sort that out for you”."
        },
        {
            "heading": 2,
            "text": "Empowering civil servants for better service"
        },
        {
            "text": "So I'm a big believer in empowering the front line to make decisions. As good as guidance can be, we follow a rules based system as well, as well as focusing on what the public's looking for, and I think what fires up our people — the ability to make a difference. So I'd encourage ourselves to empower more, trust more, and be very clear on the outcomes of what you’re trying to achieve. "
        },
        {
            "text": "We have a lot of this with our work coaches. You can find out from them what will help them get people into work. So if you see something that you think will help this person get into work,  I want you to feel empowered to make that call and give as much empowerment and trust as you can to that individual."
        },
        {
            "text": "People will get things wrong, but an empowered system that supports civil servants taking risks and coming up with innovative ideas is what the public want. They don't want to be told that the computer says no. We know that in our own private lives as well, if we're ever ringing up trying to get something sorted, a gas bill or something, and somebody can't help you, that's really frustrating. So I'd want to empower people much more, and I think that is the key to quality public service. "
        },
        {
            "heading": 2,
            "text": "Advice for new civil servants"
        },
        {
            "text": "I would say do the difficult stuff and volunteer, and don't be afraid if it's going wrong. I've often thought that it's easier to turn something around than to run something that's working perfectly, because where are you going to take it next? So I've always taken the difficult job and thought, well, I'll learn stuff here."
        },
        {
            "text": "My next bit of advice is to recognise that you're part of a team. Throughout my leadership of Universal Credit, I have had brilliant support from colleagues over the last  few years, who've seen when I've been down, and picked me up and looked after me."
        },
        {
            "text": "You're always part of a team in the civil service which makes it less risky to take the difficult job. I would also say that you must concentrate on your learning.  If you don't like the job, you're actually learning there as well, and you can use that learning and experience in other roles. "
        },
        {
            "heading": 2,
            "text": "Reflecting on a rewarding career"
        },
        {
            "text": "I love public service and I love what we do. I'm proud of my colleagues across the civil service, from those in the Foreign and Commonwealth Development Office who are helping people on the ground, in various parts of the world, to what the MOD do every day, and I've already praised my colleagues in the Home Office and HMRC. Wherever you go in the Civil Service, people are doing a really good job for the right reasons, with the right motivations. I think the UK is blessed that there's a public service here that cares enough to want to do some of that. "
        }
    ]
}