{
    "url": "https://space.blog.gov.uk/2024/05/08/meteor-showers-and-the-milky-way-the-uk-night-sky-in-may-2024/",
    "title": "Meteor showers and the Milky Way: the UK night sky in May 2024",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-05-08T17:40:46+01:00",
    "content": [
        {
            "text": "The shorter nights of May provide a great opportunity to see meteors and the star-dense core of our Milky Way galaxy.  There’s also a chance to see spectacular Noctilucent Clouds and find several galaxies hidden in the spring constellations."
        },
        {
            "text": "As the planets of our Solar System orbit around the Sun at different speeds, their position relative to Earth, and therefore where they appear in our skies, changes."
        },
        {
            "text": "This month, Jupiter is briefly visible low in the western evening sky after the Sun has set, while the remaining brighter planets - Saturn, Mars, Mercury and Venus - all line up in the brightening pre-dawn skies to the east."
        },
        {
            "text": "The mornings of May are also a wonderful opportunity to spot the brighter core of our Milky Way galaxy."
        },
        {
            "text": "Try to get away from the bright lights of our towns and cities and look south from around 1:00 am until dawn.  Here you’re looking into the beautiful glow of the star-dense centre of our galaxy."
        },
        {
            "heading": 2,
            "text": "Spring is galaxy season"
        },
        {
            "text": "In last month’s blog we showed you how to locate the spectacular Whirlpool and Pinwheel galaxies near the tail of Ursa Major, the Great Bear."
        },
        {
            "text": "This month we focus on finding three more of our neighbouring galaxies, near the hind foot of the constellation of Leo the Lion."
        },
        {
            "text": "Here’s a star-map below to help you find the stars and galaxies within Leo."
        },
        {
            "text": "The brightest star and front leg of the lion is Regulus, a blue star around three times larger than our Sun.  It spins so fast on its axis (taking less than 16 hours, whereas our Sun takes 25 days) that the forces are ‘squashing’ it into an egg shape."
        },
        {
            "text": "The light we see from Regulus comes from a system of four stars that lies around 80 light-years away."
        },
        {
            "text": "Above it, you can find the neck and mane of the lion marked by the stars Algieba and Adhafera, while Agenubi, a star 20 times larger than the Sun that lies 250 light-years away, forms the eye."
        },
        {
            "text": "The lion’s back is marked by Zosma, a white star twice the size of our Sun, with Chertan forming the back leg.  Leo’s second brightest star, Denebola, forms the tail."
        },
        {
            "text": "The Leo Triplet of galaxies lies just below and to the left of Chertan, and can be seen through binoculars or a telescope, particularly from darker skies away from the lights of our towns and cities."
        },
        {
            "heading": 2,
            "text": "The Eta Aquarids meteor shower"
        },
        {
            "text": "Comet Halley’s orbit means it only travels into the inner Solar System every 76 years, last passing through in 1986."
        },
        {
            "text": "It meets more intense radiation from the Sun as it does so, and this causes fragments of ice, dust, and rock to be ejected from the surface of the comet and left streaming in the long wake of Halley’s orbit through space.  Each year, Earth passes through that debris stream."
        },
        {
            "text": "Early May is a great time to try and spot these fragments from Comet Halley as they collide with our atmosphere, heat up and streak across the sky in the annual Eta Aquarids meteor shower."
        },
        {
            "text": "While they’re visible all month, the darker, moonless skies of the first half of May provide the greatest chance to see these meteors as they hit our atmosphere at speeds of over 65 kilometres (40 miles) per second."
        },
        {
            "heading": 2,
            "text": "Get ready for Noctilucent Cloud season"
        },
        {
            "text": "Each year there is a period of two or three months where the Sun lies at an optimal angle below the horizon during the night to under-light ice-crystals high up in our atmosphere."
        },
        {
            "text": "These ‘clouds’ of ice-crystals shine with a distinctive silver-blue glow compared to the regular, much lower clouds of water condensation that appear dark and block the light of the stars."
        },
        {
            "text": "The middle of May marks the start of Noctilucent Cloud season, so look north an hour or two after sunset and before sunrise for the best chance to see them."
        },
        {
            "text": "Join us next month for more on this beautiful night sky phenomenon!"
        }
    ]
}