{
    "url": "https://environmentagency.blog.gov.uk/2024/05/08/operation-angola-we-need-your-help/",
    "title": "Operation Angola – we need your help",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2024-05-08T08:39:14+00:00",
    "content": [
        {
            "text": "Emma Viner, Enforcement and Investigations Manager, writes about just one of the many waste crime investigations the Environment Agency is dealing with."
        },
        {
            "text": "Waste crime is a major issue across the country which is often not fully understood. The Environmental Services Association have estimated that illegal waste activity costs our economy over £1 billion annually which is money being taken away from other essential services.  Those people committing waste crimes not only cost our economy a huge amount of money, their actions also negatively impact our health and spoil our environment – places we should be able to enjoy."
        },
        {
            "text": "Operation Angola is just one of the waste crime investigations the Environment Agency is dealing with. This operation has been ongoing since 2015 into a series of break-ins into yards and buildings and on to land throughout the south-east of England. Once they have gained access, the criminals involved unlawfully deposit large quantities of waste.  The scale of the offending is significant and is estimated to have cost its victims over £30 million to date. These costs are being met by landowners, businesses or local councils to clear up the devastation being left behind."
        },
        {
            "text": "So far, we have identified over 400 sites linked to this operation with an estimated financial gain to the offenders of over £70 million!"
        },
        {
            "text": "To tackle these criminals the Environment Agency has been working with many partners including local councils and the police.  We have used a wide range of powers to disrupt the offending and bring those responsible to justice.  Since 2017 we have prosecuted over 20 individuals and used other tactics such as vehicle seizures and upstream interventions to prevent further offending."
        },
        {
            "text": "Tackling waste crime of this scale takes a substantial amount of resource which we have to manage alongside the other investigations we are dealing with.  Our highly skilled and committed staff working across our enforcement teams dedicate their time to dealing with these criminals who can be violent, threatening and intimidating."
        },
        {
            "text": "Over recent years we have seen more organised criminals working within the waste industry.  With this becomes more sophistication in the way they work. They operate across county boundaries, and they are likely to be involved in a wide variety of other criminal activity such as drugs trafficking, modern slavery, firearms and fraud."
        },
        {
            "text": "Stopping waste crime continues to be a priority for us but we need the help of the public and the waste industry.  The sooner we know about a new site, the sooner we can intervene and stop the offending resulting in a lower clean-up cost for the innocent landowner."
        },
        {
            "text": "Importantly - we need to stop these criminals getting hold of waste in the first place. You can help by doing the right thing with your own waste to stop it going to criminals: Dispose of household waste - GOV.UK (www.gov.uk)"
        },
        {
            "text": "If you ask a private waste company to take your waste away for you, first check they are a registered waste carrier: Waste Carriers, Brokers and Dealers (data.gov.uk)"
        }
    ]
}