{
    "url": "https://teaching.blog.gov.uk/2024/05/08/schools-working-to-close-the-attainment-gap-using-tutoring/",
    "title": "Breaking barriers: School’s drive to close the attainment gap using tutoring",
    "authors": [
        "Simon Bush"
    ],
    "categories": [
        "Inspiring teachers",
        "Primary schools",
        "School funding"
    ],
    "pub_date": "2024-05-08T10:33:58+01:00",
    "content": [
        {
            "text": "Executive headteacher at The Green Way Academy, Simon Bush, shares his experience of using the National Tutoring Programme (NTP) to support disadvantaged pupils during the school holidays."
        },
        {
            "text": "Our ambitions "
        },
        {
            "text": "At The Green Way Academy, we have an ambitious target to get 90% of our year 6 pupils meeting the expected national standard by 2028. NTP gives us the opportunity to reach those who need extra support in getting there."
        },
        {
            "text": "Ultimately, our aim is that disadvantaged pupils achieve in line with their more affluent peers and are being given the same learning opportunities and experiences to enable them to do so."
        },
        {
            "text": "Implementing tutoring"
        },
        {
            "text": "For the last 2 years, we’ve spent our NTP allocation in full. We initially delivered tutoring using the tuition partner route. Our tuition partner, Tute, were great to work with and completely changed how we delivered online tutoring. They accommodated our request to provide tutoring after school and built excellent relationships with the pupils."
        },
        {
            "text": "We’ve now moved towards school-led tutoring; this route utilises the skills of our existing teachers who already work so well with our pupils."
        },
        {
            "text": "Offering tutoring during school holidays"
        },
        {
            "text": "We had previously considered implementing holiday tuition to aid catch-up and parents have long expressed desire for it."
        },
        {
            "text": "Now, thanks to NTP funding, we have been able to implement holiday tuition programmes, including SATs booster sessions and catch-up clubs. These programmes target pupils preparing for their exams, as well as pupils preparing for the new academic year."
        },
        {
            "text": "To guarantee attendance at our holiday programmes, we’ve gained the support of parents by keeping them informed of the benefits tutoring has on their children, as well as providing flexibility with session timings. Breakfast snacks are provided as an incentive for pupils to attend and we also had support staff present who the pupils were familiar with. These factors have added to pupils having a positive experience and ensure excellent attendance."
        },
        {
            "text": "Pupil selection"
        },
        {
            "text": "We began by delivering tutoring to all year groups, in response to learning lost during the pandemic. Since then, we have been able to track progress and identify which year groups require additional support."
        },
        {
            "text": "Above all, our focus lies with supporting pupils eligible for pupil premium and pupils with Special Educational Needs and Disabilities (SEND). They always have priority access to tutoring, providing additional support towards achieving the same standards as their peers."
        },
        {
            "text": "The impact of NTP at our school "
        },
        {
            "text": "Each pupil receiving tutoring is given an end of year target at the start of each school year. We then use a tracker to help us to monitor progress made throughout the year."
        },
        {
            "text": "After implementing tutoring, we’ve seen 63% of our key stage 2 (ages 7-11) pupil premium eligible pupils, meet the national standards for reading, and 78% for writing. According to our data, pupil premium eligible pupils and pupils with SEND are performing at the same level as their non-disadvantaged peers."
        },
        {
            "text": "One of our pupils improved a whole reading level after attending our Easter holiday sessions last year."
        },
        {
            "text": "Tutoring is an essential element in helping us close the attainment gap for disadvantaged pupils at our school. We aim to continue to deliver tutoring in some form post-NTP, as we have seen such a positive impact on our pupils."
        },
        {
            "text": "Further information"
        }
    ]
}