{
    "url": "https://dluhcmedia.blog.gov.uk/2024/05/08/single-sex-toilets-announcement-coverage/",
    "title": "Single-sex toilets announcement coverage",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Planning"
    ],
    "pub_date": "2024-05-08T16:20:08+01:00",
    "content": [
        {
            "text": "There was widespread coverage earlier this week of the laying of a law to require every new, non-residential building to have single-sex toilets, as well as a fully enclosed universal toilet if space allows. This means amending building regulations so that new offices, restaurants, hospitals and other non-residential buildings have single-sex toilets to ensure privacy, dignity, and safety for all."
        },
        {
            "text": "The Telegraph covered the announcement on its front page and published a comment piece from Minister Rowley, who explained the new legislation and the Government’s aim to offer support, compassion and dignity to everyone across our society. The Daily Mail, The Sun, The Daily Express, The Guardian, The Times, Sky News, and BBC Online all reported on the changes."
        },
        {
            "text": "Meanwhile on the airwaves, Women’s Health Minister Maria Caulfield appeared on Sky, ITV, and LBC on Monday, highlighting that this new law is an important issue for women."
        },
        {
            "text": "Women were among those who expressed concern via a government consultation on toilets last year. They said they felt unfairly disadvantaged as publicly accessible toilets are increasingly being converted into gender neutral facilities where users share cubicle and hand-washing facilities. This leads to increasing waiting in shared queues, decreased choice and less privacy and dignity."
        },
        {
            "text": "Changes to building regulations will ensure that:"
        },
        {
            "text": "Housing Minister Lee Rowley said:"
        },
        {
            "text": "Minister for Women and Equalities Kemi Badenoch said:"
        }
    ]
}