{
    "url": "https://cddo.blog.gov.uk/2024/05/08/transforming-for-a-digital-future-latest-update/",
    "title": "Transforming for a Digital Future - latest update",
    "authors": [
        "Sam Lawler, Deputy Director Strategy, Analysis and Reform, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-05-08T16:02:45+01:00",
    "content": [
        {
            "text": "For the past two years, teams across government have been making great strides in digital delivery, harnessing the power of artificial intelligence (AI) and fixing the foundations of data and legacy that will enable us to transform at scale."
        },
        {
            "text": "Last year, I shared how this collective delivery has enabled us to make huge progress against government’s 2022-25 roadmap for digital and data, Transforming for a digital future. As we approach two years since publication, I wanted to take the time to look back and reflect on our achievements."
        },
        {
            "heading": 3,
            "text": "Big achievements"
        },
        {
            "text": "A key part of our mission to transform government focuses on making it easier for users to access services. Over 4.4 million people have so far proven their identity using GOV.UK One Login and 21 of the Top 75 services are now at ‘great’ standard, ensuring some of the most important services in government are quick and easy to use. "
        },
        {
            "text": "We’re been ensuring services are underpinned by the right data and technology, publishing the Generative AI Framework to ensure the Civil Service can confidently and responsibly use this technology to improve services, and launching the new Secure by Design approach, which will embed cyber security into our delivery of digital services. "
        },
        {
            "text": "We’re also continuing to support civil servants in using these new technologies and growing the capability of the whole Civil Service. Over 55% of all Civil Servants from our core departments took part in data training as part of the One Big Thing initiative. On average, every 15 seconds of every working day since the initiative launched, one civil servant signed-up to learn about data. The Government Digital and Data profession has also continued to grow and is now at 5.4% of the total Civil Service workforce, close to our target of 6%. "
        },
        {
            "text": "We at CDDO also launched an exciting new Government Digital and Data brand in November and celebrated this through a fantastic launch event with digital leaders across departments. You can follow Government Digital and Data on LinkedIn to be kept informed of the latest digital transformation stories from across government."
        },
        {
            "heading": 3,
            "text": "A team effort "
        },
        {
            "text": "As well as these collaborative cross-government efforts, teams in departments have been forging ahead with essential digital and data projects and programmes that are improving productivity and outcomes for users. I wanted to share a couple of exciting examples."
        },
        {
            "text": "The Home Office has developed the Law Enforcement Data Service (LEDS) which will enable the retirement of the fifty-year-old Police National Computer (PNC) by March 2026. The PNC underpins essential day-to-day operational policing but it is a complex, legacy IT system that requires updating. The new LEDS is being developed using a product-centric approach that will result in a more efficient and user-friendly service for law enforcement officials."
        },
        {
            "text": "The Cabinet Office has launched its first data strategy, ‘Better Data for a Better Cabinet Office’, recognising data and information to be among the Cabinet Office’s most valuable assets. The vision is ‘Data Confidence’ to ensure all staff are enabled to use data effectively and appropriately to enhance decision making, drive efficiencies and unlock innovation. The strategy will also deliver the right data culture and foundations to safely and securely approach the use of advanced capabilities like AI. All teams are being asked to contribute, with a people-first approach to delivery, including through strong data leadership, strengthening data literacy training and sharing expertise."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "We’ve still got plenty of work ahead of us to deliver the commitments in the roadmap by next year, from transforming more services to growing digital and data capability and harnessing the potential of artificial intelligence."
        },
        {
            "text": "But we’re also starting to look ahead and think about the future for digital government beyond 2025. "
        },
        {
            "text": "It’s clear that digital and data will continue to be key to delivering policy goals and better public services, reducing costs to the taxpayer and making government more productive. Thanks to the work of our Permanent Secretary sponsors and Chief Digital and Information Officers, the digital agenda remains a high priority and collaboration continues to grow."
        },
        {
            "text": "We’re excited to engage with the whole Government Digital and Data community - as well as colleagues in other areas of government - to gather input and ideas for the future of digital government. Keep an eye out for upcoming communications for your chance to contribute over the coming months. "
        }
    ]
}