{
    "url": "https://stratcommand.blog.gov.uk/2024/05/08/we-are-strategic-command-with-jan-flitcroft/",
    "title": "We Are Strategic Command with Jan Flitcroft",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-08T10:55:44+01:00",
    "content": [
        {
            "text": "Jan Flitcroft, a Dental Nurse at Strategic Command, shares her journey from a Foods Manager to Dental Nurse in the Defence Medical Services and her passion for teaching."
        },
        {
            "text": "Interviewer: Can you introduce yourself and tell us about your role?"
        },
        {
            "text": "Jan: My name is Jan Flitcroft, I am a dental nurse at Wimbish Carver Barracks, which is part of the East Region of Defence Medical Services (DMS)."
        },
        {
            "text": "I work as Dental Nurse at the Barracks, providing dental care to approx. 900 military personnel."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What do you find most rewarding about your role?"
        },
        {
            "text": "Jan: The most rewarding part of my role is providing care to those who protect us. We provide care both at home and prior to deployment, ensuring they are prepared, by making sure they have everything they need to take care of their teeth but also providing them with advice on how to do this."
        },
        {
            "text": "I also have the chance to support our people, I have undertaken various mental health courses. Patients are often quite open with us and provides me a real opportunity to listen and help them, such as pointing them in the direction of the welfare team and at times just check in on them and make sure they are ok. Stress can really affect your health and that includes your oral health, your mental health is just as important as your physical health."
        },
        {
            "text": " "
        },
        {
            "text": "Interview: What inspired you to pursue a career in Dentistry?"
        },
        {
            "text": "Jan: I’ve always been a nurturing person; I really enjoy looking after others."
        },
        {
            "text": "My journey started in Marks and Spencer’s as a Foods Manager for about 20 years, and I took early retirement at 52 and the dentist I went to said “why don’t you come and help us out at reception?”, I jumped at the chance and was soon splitting my time between being a receptionist and working at Marks and Spencer’s. I then took the retirement package and then went full time at the dentist. No sooner did I walk through the door, she said to me “I’m going to get you trained up as a Dental Nurse”."
        },
        {
            "text": "It was tough to retrain in something completely different, but I have a passion for it and really liked it! I think in another life I would have been a doctor."
        },
        {
            "text": "And 15 years later, I’m trained and one of the oldest people in the team here at Wimbish Carver Barracks."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Do you have a passion for learning?"
        },
        {
            "text": "Jan: I’ve always loved learning and teaching people."
        },
        {
            "text": "In my current role I am an oral health educator. On Thursday mornings, I teach my own patients on how to look after their teeth and gums better. When the opportunity came up, I jumped at the chance. DMS trained me and I undertook an exam with the National Education Board of Dental Nurses (NEBM). I love showing people that may have never been educated in how to brush their teeth properly, such as interdental cleaning and keeping their whole mouth healthy."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What advice would you give to someone looking to change career?"
        },
        {
            "text": "Jan: My advice would be to never give up on your passions, regardless of age. Embrace opportunities for learning and growth."
        },
        {
            "text": "If you have a passion, embrace it. At 67, I’m doing something I truly love and enjoy."
        },
        {
            "text": "While embracing your passions is important, looking after your mental health is vital to your overall wellbeing. After COVID, I knew I needed to take time and recharge after a few tough years, I decided to take two-months of leave. I went to Italy and lived in Florence by myself for two-months and visited Sicily. That time allowed me to recharge and fill my batteries back up. A lot of people said, “you’re 65 you shouldn’t be going by yourself”. To me, age is just a number, I want to live life to the fullest."
        },
        {
            "text": "Even now, I’m not giving up. Age should never limit your pursuit of happiness and fulfilment."
        }
    ]
}