{
    "url": "https://ukhsa.blog.gov.uk/2024/05/08/what-is-ukhsa-doing-about-antibiotic-resistance/",
    "title": "What is UKHSA doing about antibiotic resistance?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance"
    ],
    "pub_date": "2024-05-08T12:09:39+01:00",
    "content": [
        {
            "text": "Antimicrobial resistance (AMR) occurs when medicines used to fight infections lose their effectiveness because the organisms they target – whether bacteria, fungi, viruses or parasites – have evolved or acquired adaptations to survive."
        },
        {
            "text": "In 2019, AMR was directly responsible for about 1.27 million deaths globally. Sustained action is required to curb inappropriate use of antibiotics, the main driver of AMR."
        },
        {
            "text": "The UK has a 20-year vision for tackling AMR through a series of 5-year National Action Plans (NAPs), which aim to bring together organisations across government to contain, control and mitigate AMR by 2040."
        },
        {
            "text": "The latest action plan was published on 8 May 2024."
        },
        {
            "heading": 2,
            "text": "The new UK AMR National Action Plan for 2024 to 2029"
        },
        {
            "text": "The updated plan will commit the UK to restricting the unnecessary use of antimicrobials in humans and animals, strengthening the surveillance of drug resistant infections, and incentivising industry to develop the next generation of treatments."
        },
        {
            "text": "It will also embed lessons from the COVID-19 pandemic and will include specific commitments focusing on infection prevention and control, diagnostics and vaccines."
        },
        {
            "text": "UKHSA’s role within the NAP includes overseeing human health surveillance and threat detection, tracking and analysing resistance, developing evidenced-based interventions, implementing targeted public interventions, and embedding infection prevention and control in healthcare settings."
        },
        {
            "text": "It also involves translating research into possible policy outputs and public health campaigns, all while maintaining a focus on health equity across all our activities."
        },
        {
            "text": "UKHSA also played a leading role in developing the targets and commitments defined under this NAP, including coordinating consensus groups across the 4 nations."
        },
        {
            "heading": 2,
            "text": "How UKHSA is tackling AMR"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "These vital measures will help reduce the threat now posed to the lifesaving power of antibiotics. You can find out more in the full report: Confronting antimicrobial resistance 2024 to 2029."
        }
    ]
}