{
    "url": "https://naturalengland.blog.gov.uk/2023/07/23/how-natural-england-is-working-to-achieve-the-governments-nature-targets/",
    "title": "How Natural England is working to achieve the government's nature targets",
    "authors": [
        "Marian Spain"
    ],
    "categories": [
        "Natural England",
        "Uncategorized"
    ],
    "pub_date": "2023-07-23T13:18:58+01:00",
    "content": [
        {
            "text": "As the government’s statutory advisor on nature conservation, Natural England is charged by the government to achieve its ambitious targets.  We do this through advice to businesses, delivery projects with partners, grant funding and by regulation backed by UK legislation. As a nation we rightly have legally binding targets to halt species decline by 2030 and improve these numbers by 10% by 2042. Meeting these legal targets will be challenging and requires urgent action over  the next seven years - not just from nature conservation bodies but from every part of society:  the public, business, farmers, government at a national and local level, and homebuilders."
        },
        {
            "text": "Action is underway across the country to tackle the catastrophic declines in nature and levels of air and water pollution that are a cause of deep concern to many people from all walks of life. Ecological restoration is happening through action by landowners, businesses, communities and government, backed by major public, private and charitable funding. This will help get us on the road to recovery, along with mitigation against potential harm to nature that enables sustainable development to provide the housing and services we need."
        },
        {
            "text": "It's disappointing then that there has been some more misleading – and in some places inaccurate – media coverage this weekend about the work of Natural England to deliver those government commitments. As the country’s expert nature recovery body, part of how we do that is by providing legally-based and scientific advice to local authorities and developers so they can design and build sustainable communities without harming nature."
        },
        {
            "text": "One particular area of this work which has received considerable media attention  - is our advice to some local authorities on achieving nutrient neutrality. This advice had to be put in place as, in some river catchments, pollutant levels from sewage and agricultural run-off have reached critical levels and additional intervention is needed to stop harm to our legally protected wetlands"
        },
        {
            "text": "This a requirement under UK law and has been upheld in the courts."
        },
        {
            "text": "Recognising the challenge this posed, we designed solutions. We worked with Defra, DLUHC and councils to put in place a mitigation scheme whereby developers can offset the damage caused by wastewater from new housing by purchasing credits from environmental improvement projects such as new wetlands."
        },
        {
            "text": "Our scheme was launched by government last year and has been pump-primed by government funding of £30m to accelerate the provision of nutrient credits for developers. This scheme is running in affected areas across England, along with schemes offered by councils and wildlife charities,  and at the time of writing will enable construction of at least 40,000 homes with more housing credits in pipeline – all while protecting our rivers.  So it is simply not true to say nutrient neutrality is a blocker – the solutions are there in place and already working."
        },
        {
            "text": "That is not to say we don’t recognise the challenge this situation has posed.  But it is nothing new or unusual to require mitigation against the impacts of new housing, which is why developers are asked to contribute to new roads, schools and shops if they build new developments in areas where local services under strain.  There is no reason why developers should not be asked to contribute too when development puts the environment under similar strain, particularly if they want to build housing near the most and sensitive sites for nature - iconic places like the Severn Estuary, Morecombe Bay, or Minsmere."
        },
        {
            "text": "We have also seen some misunderstanding and misreporting around Natural England’s role on air quality and emission zones. So let me be clear. Natural England has no powers to introduce emission zones, nor any programme to ask others to do so. Only locally elected authorities have the powers to introduce such schemes which are being described by some as “anti-car schemes”."
        },
        {
            "text": "In some areas of the country, air pollution from many sources is damaging nature, as well as damaging human health and wellbeing. Our job is to provide clear evidence to government on the problem and offer policy solutions. We are doing just that now, backed by scientific and technical advice, exploring the pros and cons of different options. That way, where development that might increase pollution needs to take place close to legally protected nature sites, Local Planning Authorities are able to consider a range of proportionate measures to avoid further declines of air quality when making their difficult planning decisions."
        },
        {
            "text": "The transition we are making to be a nature positive economy can be complicated and challenging.  In the case of housing, we will always work with councils and housebuilders to devise solutions that mitigate pollution, protect nature and create environmentally sustainable places to live. However, local authorities are the ultimate arbiter when it comes to deciding what is best for their communities in providing both sustainable homes and healthy environments - and will take a range of local factors into place, as they do on other planning limitations such as flood risk or protected landscapes."
        },
        {
            "text": "Natural England will continue to  work hard with all the different sectors within our economy – everyone needs to be part of the solution if we are to go from nature decline to nature recovery. We all need to play our part  if we want to be able to look future generations in the eye."
        }
    ]
}