{
    "url": "https://educationhub.blog.gov.uk/2022/12/16/building-new-schools-your-questions-answered/",
    "title": "Building new schools – your questions answered",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School building",
        "Schools"
    ],
    "pub_date": "2022-12-16T16:14:24+00:00",
    "content": [
        {
            "text": "All pupils should be able to learn in buildings that are fit for purpose."
        },
        {
            "text": "The School Rebuilding Programme is transforming hundreds of schools across the country and ensuring they are suitable for the future."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the School Rebuilding Programme? "
        },
        {
            "text": "The School Rebuilding Programme carries out major rebuilding and refurbishment projects at school and sixth form college buildings across England."
        },
        {
            "text": "Projects are prioritised according to the condition of buildings."
        },
        {
            "heading": 3,
            "text": "How many schools are being rebuilt? "
        },
        {
            "text": "Over the course of the decade 500 schools will benefit from the programme."
        },
        {
            "text": "In December 2022 we announced that 239 new school buildings schools and sixth forms will benefit from renovation projects."
        },
        {
            "text": "The new projects build on the 161 that had previously been announced, with construction works now nearing completion on the most advanced sites."
        },
        {
            "text": "It means in total 400 out of the 500 schools and sixth forms have now been selected for rebuilds through the ten-year School Rebuilding Programme."
        },
        {
            "heading": 3,
            "text": "What will be different about the new schools? "
        },
        {
            "text": "All projects in the School Rebuilding Programme are built to the latest construction standards, resilient to climate risks, net-zero in operation, and include modern facilities to support a world-class education from classrooms and science labs to sports halls and dining rooms."
        },
        {
            "heading": 3,
            "text": "How do you decide which schools get to benefit from the School Rebuilding Programme?"
        },
        {
            "text": "We prioritise schools based on how immediate their need for improvement is."
        },
        {
            "text": "We ran a public consultation on how we should decide which schools are in the greatest need and have developed the application process from that. The consultation findings can be found here: Prioritising schools for the School Rebuilding Programme - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 3,
            "text": "What else are doing to help improve school buildings? "
        },
        {
            "text": "In addition to the School Rebuilding Programme, we are continuing to invest in the school estate with annual capital funding."
        },
        {
            "text": "Over £13 billion has been allocated since 2015 to maintain and improve school facilities across England, including £1.8 billion in financial year 2022-23."
        }
    ]
}