{
    "url": "https://dluhcdigital.blog.gov.uk/2022/12/16/dluhc-continues-to-support-local-planning-authorities-to-scale-the-adoption-of-digital-citizen-engagement-tools/",
    "title": "DLUHC continues to support Local Planning Authorities to scale the adoption of digital citizen engagement tools",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2022-12-16T09:38:56+00:00",
    "content": [
        {
            "text": "The PropTech Engagement Fund continues to build on its success as we launch the next round of funding for 8 projects under the Digital Planning Continuous Funding Model. This most recent funding will see select projects from previous rounds explore ideas around how to further scale the adoption of digital tools and increase efficiencies when undertaking planning consultation projects across the country. "
        },
        {
            "text": "DLUHC has previously supported 45 Local Planning Authorities (LPAs) across Round 1 and Round 2 of the fund to use innovative digital citizen engagement tools and platforms across planning services. The projects funded so far have seen a significant increase in community engagement, with one LPA seeing a 342% increase in consultation responses from individuals under the age of 34. "
        },
        {
            "text": "There is also emerging evidence of the digital platform’s impact on increasing positive dialogue and support for planning, upskilling planning officers and reducing wasted officer time. One Local Authority reported that prior to receiving funding an additional 50 hours were required for officers to analyse  responses - Thanks to the fund and new digital tools these extra officer hours are no longer needed. "
        },
        {
            "text": "The additional investment via the continuous funding model will allow LPA teams and their Property Technology (PropTech) partners to identify and respond to the lack of existing interoperability between tech platforms and discover innovative approaches to processing, analysing and managing consultation feedback faster and more efficiently. "
        },
        {
            "text": "Through DLUHC support and that of motivated partners working together to tackle current inefficiencies, we hope to deliver a consistent approach and data flow between planning stages, which ultimately reduce delays and resource pressures for LPAs and wider industry. In addition, this work will continue to drive transparency between community groups and stakeholders throughout the planning system."
        },
        {
            "text": "The LPAs who have been awarded funding under the Continuous Funding Model represent a range of diverse planning teams, projects and opportunities to design digital  solutions at scale and speed across the country. The successful LPAs are: "
        },
        {
            "text": "South West Herts (St Albans City and District Council, Three Rivers District Council, Hertsmere Borough Council, Watford Borough Council, Hertfordshire County Council) (joint project team)"
        },
        {
            "text": "Funds awarded: £30,000\n"
        },
        {
            "text": "Exploring the potential to design and deploy a new digital solution for the processing and reporting of planning consultations capable of consolidating local plan consultation responses gathered from multiple digital media and platforms as well as emails and letters into a single database. "
        },
        {
            "text": "Plymouth City Council, South Hams District Council and West Devon Borough Council (joint project team) "
        },
        {
            "text": "Funds awarded:  £200,000"
        },
        {
            "text": "Exploring automated approaches that can be used to streamline the way consultation data is mapped and analysed to reduce officer time spent accessing, processing and preparing data. \n\nChesterfield Borough Council and London Borough of Hounslow (joint project team)"
        },
        {
            "text": "Funds awarded: £200,000\n\nAdopting user centric design and developing new functionality to improve the access, flow and use of local planning data and information at all stages of the local plan process for stakeholders and Councils, including for consultations and examination in public, to improve back office processes and make data easily accessible and usable. "
        },
        {
            "text": "London Borough of Richmond upon Thames & London Borough of Wandsworth"
        },
        {
            "text": "Funds awarded: £100,000"
        },
        {
            "text": "Tackling inefficiencies in current back office systems (which requires the manual movement of data between different software packages) to improve and speed up the consultation reporting process making it more efficient, transparent and visual. "
        },
        {
            "text": "Cotswolds District Council and West Oxfordshire District Council (joint project team) "
        },
        {
            "text": "Funds awarded: £230,000\n"
        },
        {
            "text": "Exploring improving the back office functionality to enhance the submitting, processing and analysing of representations gathered through consultation."
        },
        {
            "text": "Havant Borough Council "
        },
        {
            "text": "Funds awarded: £100,000"
        },
        {
            "text": "Integrate PowerBI with Havant’s digital engagement platform to create a central data reporting tool. This will improve efficiency by decreasing the manual handling of data, progress reporting and continue to enable through faster data-driven decision making."
        },
        {
            "text": "Bolsover District Council "
        },
        {
            "text": "Funds awarded: £44,000\n\nExploring what efficiencies can be achieved in the plan making consultation process through automation to summarise representations effectively and summarise into a Statement of Consultation.\n"
        },
        {
            "text": "Southampton City Council "
        },
        {
            "text": "Funds awarded: £100,000\n\nExploring an approach to improve access to, flow of and use of consultation responses at all stages of the local plan, with an emphasis on improving the process of multiple stakeholders assessing and documenting responses as a result of consultation. "
        },
        {
            "text": "This continued investment in LPAs reflects the department’s ambitions to drive digital transformation of the planning sector and PropTech market. We look forward to working with our project partners to scale digital solutions and opportunities across the system and drive the digital agenda forward. "
        },
        {
            "text": "If you are interested in following the project's progress, you can find us on LinkedIn and Twitter or visit our website. "
        }
    ]
}