{
    "url": "https://socialcare.blog.gov.uk/2022/12/16/getting-vaccinated-saves-lives-and-helps-the-health-and-care-system-too/",
    "title": "Getting vaccinated saves lives (and helps the health and care system too)",
    "authors": [
        "Clenton Farquharson MBE"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "coronavirus",
        "Diversity"
    ],
    "pub_date": "2022-12-16T11:23:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A personal journey"
        },
        {
            "text": "I’ve caught COVID-19 three times. If I hadn’t had the vaccine, I wouldn’t be here writing this now."
        },
        {
            "text": "Back in January 2021, you might remember me talking in this blog about the vaccine discussions we were having in my family:"
        },
        {
            "text": "Well, quite a bit of time has passed since that discussion. All my family and friends, who were vaccine-hesitant at the start, have now been vaccinated. They watched what I went through and realised that, without the vaccine, I wouldn’t be here."
        },
        {
            "text": "I’ve had five COVID-19 vaccines/boosters.  We need to remember that the vaccine doesn’t stop you getting the virus, but it generally makes the symptoms milder. Because of my health profile, including my ethnicity, and being diabetic and asthmatic, I have actually been in hospital each time I’ve had COVID-19, but each time the symptoms got milder."
        },
        {
            "heading": 2,
            "text": "Vaccination saved my life"
        },
        {
            "text": "The first time I had the virus, I was put in a medically induced coma. I was told by the doctors that if I hadn’t had the vaccine, I would have died.  I can’t say any more than that really - it saved my life.  I look at the vaccine as a partner in the fight against COVID-19. It’s like training at the gym - but for our immune systems, helping us to build up our biological defenses."
        },
        {
            "text": "I do understand vaccine hesitancy. Maybe some people feel they are not high risk themselves, but this is about collective responsibility, which brings collective benefits. Not only does the vaccine help build our bodies defenses, it also protects and builds resilience in our health and care systems."
        },
        {
            "text": "Health and social care services are still dealing with a shock to the system. This winter, we can play our part to ease some of the pressure.  The more people get vaccinated, or go for their boosters and flu jabs, the more we can ease the pressure."
        },
        {
            "text": "I can only speak from personal experience, but I didn’t experience any side effects from any of my COVID-19 vaccines. Weighing up the possible side effects, versus my situation, had I not had the vaccine, well, it’s a no brainer."
        },
        {
            "text": "With my most recent COVID-19 booster I was also given a flu vaccine, so was able to get both done at the same time. With cases of flu on the rise, I would encourage people to check if they are eligible for this one too.  Let’s protect ourselves, those around us, and the system we’ve built to take care of us too."
        }
    ]
}