{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/12/16/introducing-the-anti-racist-listening-project-podcast/",
    "title": "Introducing The Anti-racist Listening Project podcast",
    "authors": [
        "Liz Howard",
        "Nimal Jude",
        "Lyn Romeo"
    ],
    "categories": [
        "Communities",
        "Society"
    ],
    "pub_date": "2022-12-16T12:35:40+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What's it all about?"
        },
        {
            "text": "So, we held a day of anti-racist activism in 2021 using social media (#AntiRacistSW21), urging senior leaders to take action. Then we published a book: The Anti-racist Social Worker. We spoke at several events, held webinars and encouraged others to make an anti-racist pledge. As a group of anti-racist activists, we thought what next?"
        },
        {
            "text": "We had picked up that many people were grappling with the same tricky and challenging conversations around racism we were having. We wanted to do something to help others work through their own anti-racist action challenges and to share some ideas and insights into how others try to navigate these seemingly everyday issues."
        },
        {
            "text": "We thought of blogs and newsletters, but everyone's got so much to read already. ‘How about a podcast?’ we said in almost harmony."
        },
        {
            "text": "We're always keen to find new ways to keep the anti-racism conversation going, but we recognise from our own experiences how difficult this can be. This is sensitive stuff. The stakes are high for people experiencing racism and for those trying to navigate the journey to becoming an ally. There is the worry about making mistakes, being misunderstood and hurting people."
        },
        {
            "heading": 2,
            "text": "The Anti-Racist Listening Project Podcast is born"
        },
        {
            "text": "The Anti-Racist Listening Project is a way to connect with people out there doing the work of anti-racism and to encourage those that aren’t sure where to start to give it a go, after all anti-racism is all about action."
        },
        {
            "text": "We want to demystify what conversations about anti-racism sound like, how they happen and most importantly what we can all learn from them."
        },
        {
            "text": "The podcast features social workers, colleagues from other professions, friends and family in conversation, sharing their experiences of “doing anti-racism” exploring the challenges and positive change that is happening from a lived experience and allyship perspective."
        },
        {
            "text": "Each episode has a message about anti-racist action to take away and think about but most importantly it is call to action."
        },
        {
            "text": "The podcast can be used in different ways, including playing episodes in teams, listening as a family or in educational settings, all with the purpose of starting conversations about anti-racism that lead to action."
        }
    ]
}