{
    "url": "https://disabilityunit.blog.gov.uk/2022/12/16/music-is-magic-the-charity-christmas-single-connecting-people-with-learning-disabilities-and-military-musicians/",
    "title": "Music Is Magic: the charity Christmas single connecting people with learning disabilities and military musicians",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Event"
    ],
    "pub_date": "2022-12-16T14:03:48+00:00",
    "content": [
        {
            "text": "The Music Man Project, an award-winning music education and performance service specifically for children and adults with learning disabilities, has teamed up with the Royal Marines Band Service to release a charity Christmas single. The single, Music Is Magic, aims to connect military musicians and people with learning disabilities through the universal language of music."
        },
        {
            "text": "David Stanley, Government’s Disability and Access Ambassador for Arts and Culture, founded and the Music Man Project to connect the learning-disabled community across the globe through original music. Government’s Disability and Access Ambassadors are senior business leaders that encourage improvements in accessibility and quality of services and facilities in their sectors."
        },
        {
            "text": "The Christmas single marks the first of many collaborative projects between the Music Man Project and the Band of HisMajesty's (HM) Royal Marines, with all proceeds going to help the Music Man Project to support learning-disabled people across the UK."
        },
        {
            "text": "\"The title of the song says it all. Music is magic. The single celebrates the power of music to bring people together and transform lives, no matter their background.\""
        },
        {
            "text": "Creating unity is the main aim of our collaboration with The Royal Marines Band Service, and the fact that the single has been released by Sony is another sign that disabled musicians are being heard like never before. "
        },
        {
            "text": "\"We couldn’t be prouder of this unique collaboration with The Music Man Project. Each performer radiates warmth, energy, and positivity. They are also incredibly talented musicians. Rehearsing and recording this single was a wonderful experience. Everyone at the Royal Marines Band Service looks forward to creating magic this Christmas with The Music Man Project.\""
        },
        {
            "text": "Lieutenant Colonel Jason Burcham, Commanding Officer Royal Marines Band Service/Principal Director of Music Royal Marines"
        },
        {
            "text": "The Music Man Project and The Royal Marines will perform the single at The Massed Bands of The Royal Marines Christmas Spectacular at the Portsmouth Guildhall, as well as appearing  on TV and radio leading up to the official release date on 16 December. Music is Magic is available for pre-order, and will be available on all major digital music stores and streaming services."
        },
        {
            "text": "More on the Music Man Project…"
        },
        {
            "text": "The Music Man Project is a global beacon of accessible arts and culture, where musicians with learning disabilities become role models in their communities and capable of entertaining audiences in their thousands at the world’s most prestigious performance venues. The musicians herald a step-change from consumers of culture to talented creative artists, who show what they can do rather than what they need. Regional Music Man Projects are established across the UK, and have travelled to South Africa, India, Nepal, the Philippines and the USA to inspire communities world-wide to start similar projects which provide original music, resources and performance opportunities for free. "
        },
        {
            "text": "As well as The Royal Albert Hall, Music Man students have performed twice at the London Palladium, broken a Guinness World Record, performed to members of the Royal Family, opened a National Lottery TV advert and regularly feature on TV and radio. They also received a standing ovation and four yes votes from celebrity judges on Britain’s Got Talent."
        }
    ]
}