{
    "url": "https://supportingfamilies.blog.gov.uk/2022/12/16/sheffield-council-celebrating-10-years-of-supporting-families/",
    "title": "Sheffield Council celebrating 10 years of Supporting Families",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Employment",
        "Evaluation",
        "Health",
        "Multidisciplinary Teams",
        "News",
        "Policy links",
        "Reducing Parental Conflict"
    ],
    "pub_date": "2022-12-16T08:51:48+00:00",
    "content": [
        {
            "text": "To celebrate 10 years of the Supporting Families programme, Sheffield City Council have produced an infographic, https://delta.communities.gov.uk/document-repository/public/download?uri=/document-repository/SF-Infographic-10-years-Nov-22.pdf showcasing the journey of the programme in Sheffield including the successes and sustained changes that families have achieved.  "
        },
        {
            "text": "Since the initiation of the programme in Sheffield in 2012:"
        },
        {
            "text": "This is based on the criteria that families needed to have at least two areas of identified need to engage in the programme:"
        },
        {
            "text": "*To note the headline criteria has now been extended (as part of the next iteration of the programme) this will enable more detailed reporting on the problems families are facing, clarify what good looks like for these outcomes, and what levels of evidence would be expected when measuring these outcomes. To view details of this, please check out the following link: (Supporting Families: programme guidance 2022-25) "
        },
        {
            "text": "Direct feedback from families include:"
        },
        {
            "text": "Feedback 1: ‘Multi-Agency Support Team (MAST) was very helpful, to start with I was hesitant and didn’t know if I wanted to take the first step of having help from MAST. I needed help, ‘F’ (the intervention worker) helped me and gave me advice. "
        },
        {
            "text": "He helped me with child benefit and also went to school and saw my children on their own. They were having difficulties with other children in school and the 1 to 1’s really helped this. Also, he called a meeting with everyone which really helped. He helped me to gain a council house, with furniture. There is nothing more he could have done for us, and I was pleasantly surprised with the service’."
        },
        {
            "text": "Feedback 2: 'Client wins appeal at benefit tribunal and receives a backdated award of £5,500 plus £240 every four weeks, just in time for Christmas 2021!'"
        },
        {
            "text": "Feedback 3: “I got the job, start on the 17 November, I want to thank you so much because if it wasn’t for you and your support, I wouldn’t have got it thank you I am so happy”"
        },
        {
            "text": "To demonstrate the use of the ‘whole family’ approach to achieving successful and sustained outcomes for children and their families, Sheffield have identified a range of services which are funded and available to create closer working with key partners, these include, but are not limited to:"
        },
        {
            "text": "Early Help Partnership Training was established in 2019 as a bespoke offer of training to complement the core training available. The offer continuously evolves to ensure that it is current and offers thematical responsive training on the essential needs of families. The purpose of the training is to further embed whole family ways of working, to continue to upskill the universal workforce and to enhance and build connectivity and partnership working."
        },
        {
            "text": "Since establishing the training offer in 2019, 472 sessions have been provided, with 4,642 attendees from a range of organisations attending, this includes:"
        },
        {
            "text": "Sheffield City Council has received a variety of positive feedback from delivering these training sessions."
        },
        {
            "text": "If you would like to learn more about your local area's work to deliver early help through Supporting Families, please contact families.team@levellingup.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}