{
    "url": "https://digitalpeople.blog.gov.uk/2022/12/16/summer-interns-how-gds-coped-with-our-autism/",
    "title": "Summer Interns - How GDS coped with our Autism",
    "authors": [
        "Shamima Begum - Early Talent Manager, GDS",
        "Blaithin Gillen - Summer Intern, GDS",
        "Indigo Sullivan - Summer Intern, GDS"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Diversity and Inclusion"
    ],
    "pub_date": "2022-12-16T10:30:42+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "Every summer we welcome a number of students from diverse backgrounds into our Summer Diversity Internship Programme (SDIP) and this year, unlike for the last two years, we were able to meet them in person in our offices."
        },
        {
            "text": "This year we also extended the invitation to include applicants from the Autism Exchange Internship Programme (AEIP) increasing the diversity of our interns and offering us a greater chance to interact with a broader range of service users."
        },
        {
            "text": "This the last of a series of six blog posts written by some of the DSIP/AEIP interns. In this blog, we hear from two of the interns who took part in the Autism Exchange Internship Programme (AEIP) - Indigo Sullivan and Blaithin Gillen (pictured) who were interviewed about their experiences."
        },
        {
            "heading": 3,
            "text": "Ambitious about Autism - Autism Exchange Internship Partnership"
        },
        {
            "heading": 4,
            "text": "Why did you apply for the Autism Exchange Internship Programme?"
        },
        {
            "text": "Indigo: I am interested in working within the civil service and wanted to give it a try and see if it was right for me. I also wanted to get some more work experience to put on my CV to help me in getting a job after graduating university. "
        },
        {
            "text": "Blaithin: A family member told me about the opportunity and I decided that I should apply because I thought it would be a great opportunity. I did want to know more about what the Civil Service does. I wanted an opportunity to learn more about how my creativity could be used in a business. Also I wanted experience working in an office environment as I have only done retail and physical jobs so far."
        },
        {
            "heading": 4,
            "text": "What kind of support have you received and how has it helped you?"
        },
        {
            "text": "Indigo: The main support I need is the ability to take breaks when my anxiety gets too much or I get overwhelmed. With the flexible nature of the job this hasn’t been an issue at all, and I have found myself free to take a quick break whenever I need it. "
        },
        {
            "text": "Blaithin: My line manager Cam helps me by giving me a to-do list and making sure that she has checked in with me or someone else checked in with me everyday to make sure I knew what I was doing. I wrote an about me page so the team could get to know me and how to help me. My team also gave me a well laid out calendar so I knew what I was doing and why I was doing it."
        },
        {
            "heading": 4,
            "text": "What advice would you give someone in the industry who is considering an internship?"
        },
        {
            "text": "Indigo: If you are thinking about a career in the civil service or just want to get some work experience this is the perfect opportunity to do that. It’s normal to be anxious about your first day but everyone is super friendly and understanding and you’ll find you settle in really quickly."
        },
        {
            "text": "Blaithin: Definitely go for it if you can because I think it's a great opportunity for young people to get more experience. We need so much experience for jobs these days that I think we should grab opportunities like this with both hands. I think the skills I have learned about recruitment will help me get insight into how I will be perceived as a candidate in the future."
        },
        {
            "heading": 4,
            "text": "Have you made any new connections whilst doing your internship?"
        },
        {
            "text": "Indigo: I have had the opportunity to talk one-on-one with a lot of members of the team to get an insight into what they do. This has been really valuable in helping me understand exactly what GDS do and where I could fit into the department. "
        },
        {
            "text": "Blaithin: Yes I met another intern and good friends with all of my team members, that way I can contact any of them if I ever need any help in the future. I have also had the opportunity thanks to my team to meet a Content Designer from GDS and an ex-BBC worker to get more insight into the creative world."
        },
        {
            "heading": 4,
            "text": "How has your experience of working in Government Digital Service been so far?"
        },
        {
            "text": "Indigo: So far the experience has been great. In my first week I have been given the opportunity to talk personally with a lot of people. I’ve also done some note taking on  consumer research, and have started setting up a confluence space for my team. All of this has helped me develop lots of really valuable skills."
        },
        {
            "text": "Blaithin: I love it. It's been so fun and I really enjoy the work that I'm doing and the people I'm working with. I had training to learn how to write a good advert. This will help me in the future if I ever do advertisement work. I got to draft some adverts to attract candidates and write tweets for different government organisations to go on the official websites and Twitter. I trained with the recruitment team and have learnt all the different types of recruitment which will help me in my future job hunt."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}