{
    "url": "https://nationalscreening.blog.gov.uk/2022/12/16/uk-nsc-receives-record-number-of-annual-call-screening-proposals/",
    "title": "UK NSC receives record number of annual call screening proposals",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General",
        "Uncategorized"
    ],
    "pub_date": "2022-12-16T09:51:49+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) received a record number of 29 proposals during its 2022 annual call for topics, which closed on 5 December."
        },
        {
            "text": "This is by far the most submissions it has received in a single year since the annual call process started in 2016."
        },
        {
            "text": "This year’s annual call follows the expansion of the UK NSC’s remit. This means the remit of the annual call has also expanded and, for the first time, the topics proposed cover programme modifications, targeted and stratified screening in addition to population screening."
        },
        {
            "text": "The 29 submissions include:"
        },
        {
            "heading": 2,
            "text": "Thank you and next steps"
        },
        {
            "text": "Many thanks to all those individuals and organisations who took the time and effort to submit their proposals. This is a very exciting time for screening as the committee now has the potential to consider many more topics following the expansion of its remit."
        },
        {
            "text": "The UK NSC will carefully consider all 29 annual call proposals during 2023 and respond individually to everyone who made a submission. More detailed work will be carried out on any topics that meet its criteria and have the potential to become national screening programmes."
        },
        {
            "text": "Watch this space for developments."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}