{
    "url": "https://defrafarming.blog.gov.uk/2024/08/29/capital-grants-in-2024-an-overview/",
    "title": "Capital grants in 2024: an overview",
    "authors": [
        "Sarah Blatchford"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-08-29T12:31:31+01:00",
    "content": [
        {
            "text": "In this post, I'll provide an overview of capital grants for environmental land management, the current offer and recent updates. "
        },
        {
            "heading": 2,
            "text": "A recap "
        },
        {
            "text": "Capital grants help farmers and land managers cover the cost of items that deliver specific environmental benefits. For example, new hedges to reduce soil erosion and automatic slurry scrapers to improve air quality. "
        },
        {
            "text": "These grants can support actions in environmental land management agreements such as the Sustainable Farming Incentive (SFI), Countryside Stewardship (CS), and Higher Level Stewardship (HLS). You can apply for these grants as a standalone agreement or for individual works without needing an agreement. "
        },
        {
            "text": "Applications are open year-round.  The agreements last 3 years so you have 3 years to make the purchase and claim reimbursement. There is currently no cap on the value of capital items you can receive funding for. "
        },
        {
            "text": "Some applications, particularly those involving items to improve air or water quality, may require support from a Catchment Sensitive Farming adviser before submission. "
        },
        {
            "heading": 2,
            "text": "The current offer "
        },
        {
            "text": "There are 108 capital items on offer which fall under 5 categories:  "
        },
        {
            "text": "Capital Grants "
        },
        {
            "text": "These can be used to support a range of farming and environmental improvements, including air and water quality, boundaries, hedgerows and natural flood management. "
        },
        {
            "text": "Protection and Infrastructure grants "
        },
        {
            "text": "Protection and Infrastructure grants are for capital items that support improving the management of woodland and to help manage the impact of beaver behaviours. "
        },
        {
            "text": "Woodland Tree Health (WTH) grants "
        },
        {
            "text": "A Woodland Tree Health (WTH) grant helps to restock or improve woodland after tree health problems. "
        },
        {
            "text": "Capital grants plans "
        },
        {
            "text": "There are 5 plans available through 5 different grants in the offer. You can receive funding to plan and identify which capital works are needed to help achieve specific improvements. For example, a grant is available to help fund the production of a woodland management plan for woodland over 3 hectares. You can then get funding for the items needed to make that improvement."
        },
        {
            "text": "We have published details on amended plans and we will provide more detail on CS Higher Tier in due course. "
        },
        {
            "text": "Higher Tier Capital Grants "
        },
        {
            "text": "Higher Tier Capital Grants provide 3-year agreements offering capital items to achieve additional environmental benefits. I’ll go into more detail on these later in the post.  "
        },
        {
            "text": "The full range of available items can be found on the Countryside Stewardship Grant Finder."
        },
        {
            "heading": 2,
            "text": "Improvements to the offer "
        },
        {
            "text": "Earlier this month, new capital items were added to the existing offer. "
        },
        {
            "text": "Farmers can now apply for items that support agroforestry. Funding is available for a diverse range of trees for an ‘in-field’ agroforestry system, as well as for an agroforestry plan to support new actions available through the SFI. "
        },
        {
            "text": "Tree guards are also available to protect trees as they establish. "
        },
        {
            "text": "More information on using capital grants for agroforestry is available on the Forestry Commission blog. "
        },
        {
            "text": "A new moorland mapping plan is also available to support better planning for managing environmental features on moorland. "
        },
        {
            "text": "The new items added are: "
        },
        {
            "text": "The following items are now part of the agroforestry offer: "
        },
        {
            "text": "We will continue to expand the capital offer in the coming months, with more details to follow. "
        },
        {
            "heading": 2,
            "text": "Capital items supporting Countryside Stewardship Higher Tier "
        },
        {
            "text": "The CS Higher Tier capital grant offer includes 25 specialist items designed to support environmental benefits.  "
        },
        {
            "text": "These grants are offered under 3-year agreements. Applications are open all year, and you don’t need a Higher Tier agreement to apply. "
        },
        {
            "text": "The offer to undertake an Implementation plan or Feasibility study remains available. We have updated these to allow their use in successive periods in areas where dynamic land changes alter the landscape, such as coastal regions. "
        },
        {
            "text": "Plans are mandatory for certain CS Higher Tier actions but not required for SFI agreements. "
        },
        {
            "text": "Natural England, Historic England, or Forestry Commission advisers will discuss whether a plan is necessary for a CS Higher Tier agreement. "
        },
        {
            "text": "Further details on CS Higher Tier plans will be provided in due course. "
        },
        {
            "heading": 2,
            "text": "How to claim"
        },
        {
            "text": "You can make a claim for a capital item online, by email, or by post. For more information, read the guidance on how to make a capital or revenue claim. "
        }
    ]
}