{
    "url": "https://food.blog.gov.uk/2024/08/29/decoding-food-allergies-unveiling-insights-from-nhs-data/",
    "title": "Decoding Food Allergies: Unveiling insights from NHS data",
    "authors": [
        "Dimitris Maimouliotis, Allergen Risk Assessor"
    ],
    "categories": [
        "Allergy",
        "Science"
    ],
    "pub_date": "2024-08-29T09:25:15+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Food allergies can lead to life threatening reactions and understanding the data behind them is vital."
        },
        {
            "text": "Food hypersensitivity includes food allergies, food intolerances and coeliac disease, and has a major impact on affected individuals. However, only food allergies among these can cause potentially life-threatening allergic reactions known as anaphylaxis."
        },
        {
            "text": "We recently funded a new study which used NHS Data to monitor trends in food allergy epidemiology, including severe, food induced allergic reactions. The study was conducted by researchers from Imperial College London, and explored NHS data to better understand how common food allergies and anaphylaxis are, as well as the circumstances surrounding their occurrence. The outcome of this could help reduce the risk of allergic reactions and help people with a food allergy make more informed eating choices."
        },
        {
            "heading": 2,
            "text": "NHS data analysis of hospitalisations"
        },
        {
            "text": "The project analysed NHS data in relation to hospitalisations, primary care visits and Accidents & Emergency (A&E) department visits from 1998 to 2018."
        },
        {
            "text": "The analysis revealed that food-induced anaphylaxis represented 29.4% of reported allergy admissions from 1998 to 2018. Since 1998, the rate of hospital admissions for food-induced anaphylaxis had increased year-on-year by an average of 5.7%."
        },
        {
            "text": "Despite increased admissions, the case fatality rate (fatalities as a percentage of hospital admissions) for food anaphylaxis during the same period more than halved, dropping from 0.7% to 0.3%.\nAdvancements in identifying and managing anaphylaxis may play a role in the decrease in case fatality rates. This encouraging trend is promising for the safety of people with allergies in the UK."
        },
        {
            "text": "Sadly, 152 deaths were identified during the 10-year study period (from 2008 to 2018) where the cause was very likely to have been food-induced anaphylaxis. Overall, at least 46% of total fatalities were triggered by peanut or tree nuts."
        },
        {
            "text": "Cows’ milk was the most common cause of fatal anaphylaxis in children under the age of 16 years and was responsible for 26% of fatalities in this age group."
        },
        {
            "heading": 2,
            "text": "NHS data and the Anaphylaxis Registry - two pieces of the same puzzle"
        },
        {
            "text": "To help us better understand the circumstances of allergic reactions, Imperial College London, in conjunction with the NORA European Anaphylaxis Registry (Network of Online Reporting for Anaphylaxis), developed the UK Anaphylaxis Registry with funding from the FSA and Food Standards Scotland."
        },
        {
            "text": "This registry was created to record information on cases of anaphylaxis in A&E departments and other acute care environments. It sought to obtain a comprehensive view of reaction types, frequency, and geographical distribution."
        },
        {
            "text": "While NHS data reflects historical trends and provides insights into the prevalence and fatality rates of food-induced anaphylaxis, the UK Anaphylaxis Registry served as a real-time, standardised reporting system to record episodes of significant allergic reactions in the community following unintended allergen exposure. This information could help improve services for allergy patients and help guide public policy."
        },
        {
            "heading": 2,
            "text": "The impact of these studies"
        },
        {
            "text": "The synergy between the NHS data analysis and the UK Anaphylaxis Registry paved the way for a more comprehensive understanding of the lived experiences of food hypersensitive consumers."
        },
        {
            "text": "These insights are important to use, as they help improve our understanding of the causes and impacts of food-induced anaphylaxis and can form part of the evidence base of our work to improve the quality of life for people with food allergies."
        },
        {
            "heading": 2,
            "text": "Next steps in our work"
        },
        {
            "text": "Helping people with a food hypersensitivity to make more informed eating choices is a key part of our work."
        },
        {
            "text": "All food businesses are under a legal obligation to provide information on the presence of the 14 allergens. In 2021, it became a legal requirement for all food businesses to display full ingredient and allergen information on every food item sold pre-packed for direct sale."
        },
        {
            "text": "We are currently creating best practice guidance for food businesses in the non-prepacked sector (such as restaurants and cafes) on how to provide allergen information to consumers. This guidance will help businesses to improve the availability of allergen information, so that people with a food hypersensitivity can make informed food choices when eating out."
        },
        {
            "text": "For more in-depth information on the data relating to hospital admissions and a comprehensive analysis of food anaphylaxis trends, please see the Food anaphylaxis in the United Kingdom: analysis of national data, 1998-2018 study published in the British Medical Journal (BMJ) and the Time trends in the epidemiology of food allergy in England: an observational analysis of Clinical Practice Research Datalink data published in The Lancet Public Health."
        },
        {
            "text": "Related post: The launch of the UK Anaphylaxis Registry and its importance for UK consumers"
        },
        {
            "heading": 1,
            "text": "Dehongli data alergeddau bwyd: Datgelu mewnwelediadau o ddata’r GIG"
        },
        {
            "text": "Gall alergeddau bwyd arwain at adweithiau sy’n beryg bywyd ac mae deall y data perthnasol yn hanfodol. "
        },
        {
            "text": "Mae gorsensitifrwydd i fwyd yn cynnwys alergeddau bwyd, anoddefiadau bwyd a chlefyd seliag, ac mae’n cael effaith sylweddol ar unigolion yr effeithir arnynt. Fodd bynnag, o’r rhain, dim ond alergeddau bwyd sy’n gallu achosi adweithiau alergaidd a allai beryglu bywyd. Anaffylacsis yw’r enw ar hyn."
        },
        {
            "text": "Yn ddiweddar, fe wnaethom ariannu astudiaeth newydd a oedd yn defnyddio Data’r GIG i fonitro tueddiadau mewn epidemioleg alergeddau bwyd, gan gynnwys adweithiau alergaidd difrifol a achosir gan fwyd. Cynhaliwyd yr astudiaeth gan ymchwilwyr o Goleg Imperial Llundain, gan archwilio data’r GIG i ddeall yn well pa mor gyffredin yw alergeddau bwyd ac adweithiau anaffylacsis, yn ogystal â’r amgylchiadau sy’n eu hachosi. Gallai’r astudiaeth helpu i leihau’r risg o adweithiau alergaidd, a helpu pobl ag alergeddau bwyd i wneud dewisiadau bwyta mwy gwybodus."
        },
        {
            "heading": 2,
            "text": "Dadansoddi data’r GIG ar achosion o fynd i’r ysbyty"
        },
        {
            "text": "Roedd y prosiect yn dadansoddi data’r GIG mewn perthynas ag achosion o fynd i’r ysbyty, ymweliadau gofal sylfaenol ac ymweliadau ag adrannau Damweiniau ac Achosion Brys, rhwng 1998 a 2018."
        },
        {
            "text": "Datgelodd y dadansoddiad fod anaffylacsis a achosir gan fwyd yn cynrychioli 29.4% o’r adroddiadau o achosion o fynd i’r ysbyty oherwydd alergeddau rhwng 1998 a 2018. Ers 1998, roedd y gyfradd o fynd i’r ysbyty oherwydd anaffylacsis a achosir gan fwyd wedi cynyddu bob blwyddyn, ar gyfartaledd o 5.7%."
        },
        {
            "text": "Er gwaethaf y cynnydd, roedd cyfradd y marwolaethau o blith yr achosion (marwolaethau fel canran o’r achosion o fynd i’r ysbyty) ar gyfer anaffylacsis bwyd yn ystod yr un cyfnod wedi mwy na haneru, gan ostwng o 0.7% i 0.3%."
        },
        {
            "text": "Mae’n bosib bod datblygiadau o ran nodi a rheoli anaffylacsis yn chwarae rhan yn y gostyngiad mewn cyfraddau marwolaethau o blith yr achosion. Mae’r duedd galonogol hon yn argoeli’n dda o ran diogelwch pobl ag alergeddau yn y DU."
        },
        {
            "text": "Yn anffodus, nodwyd 152 o farwolaethau yn ystod y cyfnod astudio 10 mlynedd (rhwng 2008 a 2018) a hynny’n fwyaf tebygol o ganlyniad i anaffylacsis a achosir gan fwyd. Yn gyffredinol, roedd o leiaf 46% o’r holl farwolaethau o ganlyniad i alergeddau i bysgnau neu gnau coed."
        },
        {
            "text": "Llaeth buwch oedd yr achos mwyaf cyffredin o adweithiau anaffylacsis a arweiniodd at farwolaeth ymhlith plant o dan 16 oed, ac roedd yn gyfrifol am 26% o farwolaethau yn y grŵp oedran hwn."
        },
        {
            "heading": 2,
            "text": "Data’r GIG a’r Gofrestrfa Anaffylacsis – dwy elfen bwysig"
        },
        {
            "text": "Er mwyn ein helpu i ddeall amgylchiadau adweithiau alergaidd yn well, datblygodd Coleg Imperial Llundain, ar y cyd â Chofrestrfa Anaffylacsis Ewropeaidd NORA (Rhwydwaith Adrodd Ar-lein ar gyfer Anaffylacsis), Gofrestrfa Anaffylacsis y DU gyda chyllid gan yr ASB a Safonau Bwyd yr Alban."
        },
        {
            "text": "Crëwyd y gofrestrfa hon i gofnodi gwybodaeth am achosion o anaffylacsis mewn adrannau damweiniau ac achosion brys ac amgylcheddau gofal acíwt eraill. Roedd y gofrestra yn ceisio cael golwg gynhwysfawr o’r mathau o adweithiau, eu hamlder a’u dosbarthiad daearyddol."
        },
        {
            "text": "Er bod data’r GIG yn adlewyrchu tueddiadau hanesyddol ac yn rhoi cipolwg ar nifer yr achosion a chyfraddau marwolaeth anaffylacsis a achosir gan fwyd, roedd Cofrestrfa Anaffylacsis y DU yn gwasanaethu fel system adrodd safonol, amser real i gofnodi achosion o adweithiau alergaidd sylweddol yn y gymuned ar ôl i bobl ddod i gysylltiad ag alergenau’n anfwriadol. Gallai’r wybodaeth hon helpu i wella gwasanaethau i gleifion ag alergeddau a helpu i lywio polisi cyhoeddus."
        },
        {
            "heading": 2,
            "text": "Effaith yr astudiaethau hyn"
        },
        {
            "text": "Gyda’i gilydd, roedd dadansoddiad data’r GIG a Chofrestrfa Anaffylacsis y DU yn ei gwneud yn bosib i gael dealltwriaeth fwy cynhwysfawr o brofiadau bywyd defnyddwyr â gorsensitifrwydd i fwyd."
        },
        {
            "text": "Mae’n bwysig defnyddio’r mewnwelediadau hyn, gan eu bod yn helpu i wella ein dealltwriaeth o achosion ac effeithiau anaffylacsis a achosir gan fwyd. Gallant fod yn rhan o sylfaen dystiolaeth ein gwaith i wella ansawdd bywydau pobl ag alergeddau bwyd."
        },
        {
            "heading": 2,
            "text": "Ein gwaith: y camau nesaf"
        },
        {
            "text": "Mae helpu pobl â gorsensitifrwydd i fwyd i wneud dewisiadau bwyta mwy gwybodus yn rhan allweddol o’n gwaith."
        },
        {
            "text": "Mae’n ofyniad cyfreithiol i bob busnes bwyd ddarparu gwybodaeth am bresenoldeb yr 14 prif alergen. Yn 2021, daeth yn ofyniad cyfreithiol i bob busnes bwyd arddangos gwybodaeth lawn am gynhwysion ac alergenau ar bob eitem o fwyd wedi’i becynnu ymlaen llaw i’w werthu’n uniongyrchol sy’n cael ei gwerthu."
        },
        {
            "text": "Rydym wrthi’n creu canllawiau arferion gorau ar gyfer busnesau bwyd yn y sector bwyd heb ei becynnu ymlaen llaw (fel bwytai a chaffis) ar sut i ddarparu gwybodaeth am alergenau i ddefnyddwyr. Bydd y canllawiau hyn yn helpu busnesau i wella’r wybodaeth am alergenau sydd ar gael, fel y gall pobl â gorsensitifrwydd i fwyd wneud dewisiadau bwyd gwybodus wrth fwyta allan."
        },
        {
            "text": "I gael gwybodaeth fanylach am y data sy’n ymwneud ag achosion o fynd i’r ysbyty a dadansoddiad cynhwysfawr o dueddiadau anaffylacsis bwyd, gweler yr astudiaeth Anaffylacsis Bwyd yn y Deyrnas Unedig: dadansoddiad o ddata cenedlaethol, 1998-2018 a gyhoeddwyd yn y British Medical Journal (BMJ) a’r astudiaeth Tueddiadau amser yn epidemioleg alergeddau bwyd yn Lloegr: dadansoddiad arsylwadol o ddata Datalink Ymchwil Ymarfer Clinigol a gyhoeddwyd yn The Lancet Public Health."
        },
        {
            "text": "Blog cysylltiedig: Lansio Cofrestrfa Anaffylacsis y Deyrnas Unedig, a'i phwysigrwydd i ddefnyddwyr"
        }
    ]
}