{
    "url": "https://defraenvironment.blog.gov.uk/2024/08/29/how-the-woodland-carbon-code-is-supporting-our-net-zero-ambitions/",
    "title": "How the Woodland Carbon Code is supporting our net zero ambitions",
    "authors": [
        "Vicky West"
    ],
    "categories": [
        "Forestry"
    ],
    "pub_date": "2024-08-29T09:19:36+01:00",
    "content": [
        {
            "text": "Woodland creation is one of the most powerful tools in the fight against climate change and for achieving many of the UK's environmental targets. This is because trees absorb carbon dioxide from the atmosphere as they grow. To learn more, watch the following video from Forestry Commission."
        },
        {
            "text": "Just one hectare of new woodland of native trees can absorb 300 to 400 tonnes of carbon dioxide equivalent by the time it’s 50 years old, and up to 500 tonnes by the time it’s 100 years old."
        },
        {
            "text": "A Woodland Carbon Unit is 1 tonne of carbon dioxide that has been sequestered into a Woodland Carbon Code-verified woodland."
        },
        {
            "text": "England have set a legally binding target to increase tree canopy and woodland cover from 14.5% to 16.5% of total land area in England by 2050. The extra financial incentive that the Woodland Carbon Code offers helps make tree planting a viable option for farmers and landowners."
        },
        {
            "text": "I’m Dr Vicky West, manager of the Woodland Carbon Code. With my expertise in climate science and forestry policy, I’ve been involved in the development and management of a code to support these ambitions since 2011 which I’d like to tell you some more about."
        },
        {
            "text": "The Woodland Carbon Code"
        },
        {
            "text": "The Woodland Carbon Code is the quality assurance standard for woodland carbon projects in the UK. It sets out requirements for voluntary woodland creation projects that tackle climate change by removing carbon dioxide from the atmosphere."
        },
        {
            "text": "Woodland carbon projects offer landowners and farmers an additional revenue stream from their woodland. They also offer a way for companies to support woodland creation and compensate for their unavoidable emissions."
        },
        {
            "text": "Projects under the Woodland Carbon Code generate high integrity, independently verified carbon units. They can provide a range of other environmental, social and economic benefits too, including:"
        },
        {
            "text": "The code is managed by Scottish Forestry on behalf of the Forestry Commission, Welsh Government, Scottish Government and the Northern Ireland Forest Service."
        },
        {
            "text": "It is informed by science, and is backed by government, the forest industry and carbon market experts. It is also endorsed by the International Carbon Reduction and Offset Alliance."
        },
        {
            "text": "How it works for landowners and farmers "
        },
        {
            "text": "Farmers and landowners can apply for government grants to help with the upfront costs of woodland creation. They can then also apply to the code to provide an additional long-term income stream."
        },
        {
            "text": "Woodland carbon units can then offer extra funding and are available where the extra carbon finance is required to make your project viable."
        },
        {
            "text": "Please see this link to find out more information on how woodland creation projects can become eligible for the code."
        },
        {
            "text": "Eligible projects can carry the Woodland Carbon Code label of approval. Landowners can then choose to sell or keep the carbon units, which are created as the trees grow and mature."
        },
        {
            "text": "How it works for carbon buyers "
        },
        {
            "text": "Large organisations are required to report their carbon emissions in line with UK Government guidelines, and all organisations are encouraged to voluntarily reduce their emissions to help the UK become net zero by 2050."
        },
        {
            "text": "Once organisations have taken action to reduce their emissions in line with science-based targets, they can compensate for unavoidable, UK-based emissions by buying units from Woodland Carbon Code projects."
        },
        {
            "text": "Success so far "
        },
        {
            "text": "An area of woodland almost the size of Newcastle upon Tyne (9,700 hectares) was validated to the Woodland Carbon Code in 2023/2024. This is an increase of 70% more woodland being validated than in 2022-23."
        },
        {
            "text": "The 9,700 hectares of newly planted woodland will sequester an equivalent of over 2.2 million tonnes of carbon dioxide over their lifetimes and could be worth over £55 million to landowners."
        },
        {
            "text": "By bringing landowners, companies and communities together to support woodland creation, the Woodland Carbon Code makes a vital contribution to the environment and to UK greenhouse gas targets."
        },
        {
            "text": "Altogether, there have been 35,000 hectares validated under the Woodland Carbon Code. This is predicted to sequester over 11.7 million tonnes of carbon dioxide equivalent over their lifetime - which is around as much as Manchester's annual carbon emissions."
        },
        {
            "text": "To read more information about the Woodland Carbon Code, visit the Woodland Carbon Code website."
        }
    ]
}