{
    "url": "https://defradigital.blog.gov.uk/2024/08/29/how-content-designers-add-value-to-projects-from-start-to-finish/",
    "title": "How content designers add value to projects, from start to finish",
    "authors": [
        "Jenn Brookbanks",
        "Catherine Flack"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2024-08-29T17:11:18+01:00",
    "content": [
        {
            "text": "We work in Defra’s farming content improvement team. Our role is to iterate and improve farming-related content on GOV.UK. "
        },
        {
            "text": "One of our goals is to help farmers understand what type of funding is available and how to apply for it. "
        },
        {
            "text": "Recently, we had the opportunity to work on guidance for the Farming Equipment and Technology Fund (FETF) 2024. Farmers and land managers can apply to the fund for help towards costs of items that improve productivity, slurry management and animal health and welfare. "
        },
        {
            "text": "FETF guidance had not been through Defra’s content design process before, so we were keen to show how content design could add value at each stage. "
        },
        {
            "text": "Being involved right from the start, up until the fund launched, meant we could influence the project in different ways. "
        },
        {
            "heading": 2,
            "text": "Simplifying the user journey  "
        },
        {
            "text": "Before starting work on the guidance for 2024, we audited current FETF and related content on GOV.UK. "
        },
        {
            "text": "We used a Mural board (an interactive whiteboard) to map out the existing user journey. "
        },
        {
            "text": "This initial work (or ‘discovery’) helped us understand how users interacted with GOV.UK guidance, the FETF application portal and related communications. "
        },
        {
            "text": "The Mural board was an important visual tool, which showed us: "
        },
        {
            "text": "We identified unnecessary steps in the FETF 2023 user journey and worked with the relevant subject matter experts (SMEs) to remove these pages. "
        },
        {
            "text": "We also restructured the content to make it clearer how FETF relates to other grants, so users had a clearer application journey for 2024. "
        },
        {
            "heading": 2,
            "text": "Establishing good working relationships, pair-writing and reviewing "
        },
        {
            "text": "We received the 2024 draft content from our SMEs and ran 2 pair-writing sessions with Rural Payments Agency (RPA) colleagues to make sure the content met user needs. To do this, we met on a Teams call and edited the document together on a shared screen. "
        },
        {
            "text": "This was a really positive experience. It allowed us to combine content design skills with in-depth FETF subject knowledge and meant the draft was in good shape when we returned it to the SMEs for comments. "
        },
        {
            "text": "What followed was a collaborative and supportive approach to agreeing the draft guidance, taking account of policy requirements and legal considerations, and making sure the content remained user-focused. "
        },
        {
            "text": "Our SMEs dedicated time and patience to reviewing all feedback with us. Working together, we balanced user needs with stakeholder feedback. "
        },
        {
            "text": "One SME, Robert Potts from the RPA Grants Service team, said: ‘I really enjoyed the process of working with the Defra content team. It was great to hear views from a content perspective with a focus on short, concise messaging, rather than just operational needs.’  "
        },
        {
            "heading": 2,
            "text": "Test, and test again "
        },
        {
            "text": "Once we were happy with the first draft, we loaded it into Whitehall (the GOV.UK publishing system) to create a preview to test with users. "
        },
        {
            "text": "Our next job was to work with our user researcher to develop questions to ask users. We wanted to find out: "
        },
        {
            "text": "We were able to recruit users who had experience applying to FETF 2023. With their knowledge of how the guidance worked, we could compare the 2023 content with our draft for 2024. "
        },
        {
            "text": "This was an invaluable step in the content design process. "
        },
        {
            "text": "One of the most significant changes we made as a result of user testing was to re-format the item lists users need to review before applying for funding. The 2023 guidance used a table format to list items, which led to lots of scrolling and accessibility issues. "
        },
        {
            "text": "User research provided us with evidence to change the way the lists were formatted. We restyled and restructured items to allow for easier comparison between them, which the users we spoke to valued. "
        },
        {
            "heading": 2,
            "text": "The end result  "
        },
        {
            "text": "The draft guidance needed to go through several approval rounds. We worked closely with SMEs to make amendments at each stage and make sure the content remained focused on user needs. We then published the signed off content on the FETF launch date. "
        },
        {
            "text": "We’re now waiting to see how users interact with the FETF 2024 guidance. "
        },
        {
            "text": "We hope we've provided something clearer, easier to navigate and with less repetition. When we hear from users what their application experience was like, we’ll start to plan improvements to take into 2025. "
        },
        {
            "text": "Photo by Scott Graham on Unsplash."
        }
    ]
}