{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/29/new-homes-accelerator/",
    "title": "New Homes Accelerator",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-08-29T12:17:00+01:00",
    "content": [
        {
            "text": "There has been positive media coverage today about the Government’s launch of the New Homes Accelerator, which will work to speed up the delivery of large housing sites and drive economic growth across every part of the country."
        },
        {
            "text": "National papers including The Daily Telegraph, The Times and The Mirror all report that the Accelerator will see a group of experts working closely with local councils and developers to unblock homes stuck in the planning system. They report 200 large sites have been earmarked across England that could unlock up to 300,000 new homes. Positive quotes feature in the articles from the Home Builders Federation and the Local Government Association who have warmly welcomed the steps being taken to deliver more homes."
        },
        {
            "text": "Coverage in regional papers including The Yorkshire Post note the Accelerator will be an experienced team across the Ministry of Housing and Homes England that supports the Government’s plans to build 1.5 million new homes."
        },
        {
            "text": "Inside Housing, Local Government Chronicle, Architects’ Journal, Property Week and Construction Index report positively about how the Government is stepping up its housebuilding efforts and will deploy planning experts on the ground to identify blockages and support local authorities."
        },
        {
            "text": "Today’s announcement is also running across national and regional radio bulletins including Times Radio, LBC and Heart Radio."
        },
        {
            "text": "The Deputy Prime Minister has written exclusively for The Mirror with an urgent plea to work with housebuilders and local councils to accelerate large sites that are facing delays."
        },
        {
            "text": "Deputy Prime Minister, Angela Rayner said:"
        },
        {
            "text": "“For far too long the delivery of tens of thousands of new homes has been held back by a failure to make sure the development system is working as it should."
        },
        {
            "text": "“This government has a moral obligation to do everything within our power to build the homes that people desperately need and we won’t hesitate to intervene where we need to."
        },
        {
            "text": "“Our New Homes Accelerator will quickly identify blockages, fix problems and support local authorities and developers to get shovels in the ground.”"
        },
        {
            "text": "A call for evidence has been launched today calling upon landowners, local authorities and housebuilders to come forward with details of blocked sites that have significant planning issues. More information can be read here."
        }
    ]
}