{
    "url": "https://naturalengland.blog.gov.uk/2024/08/29/reflecting-on-the-first-six-months-of-bng/",
    "title": "Reflecting on the first six months of BNG",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Environment Act",
        "Environmental Improvement Plan",
        "Natural Capital",
        "Natural England",
        "Nature-based solutions"
    ],
    "pub_date": "2024-08-29T14:52:02+01:00",
    "content": [
        {
            "text": "By Chris Kaighin – Deputy Director, Biodiversity Net Gain Services"
        },
        {
            "text": "It has been six months since the world-leading initiative Biodiversity Net Gain (BNG) became mandatory for most planning applications under the Town and Country Planning Act. BNG makes sure development has a measurably positive impact (‘net gain’) on biodiversity."
        },
        {
            "text": "Ensuring positive outcomes for nature is fundamental to unlocking sustainable development, and we are proud to continue to play our part in a win-win for housing and the natural environment. We have supported Defra since 2018 by engaging with stakeholders to collaboratively produce and refine this policy. Now that BNG is being delivered through legislation, we have started our role in managing the publicly accessible biodiversity gain site register and statutory biodiversity credit sales service, as delegated by Defra."
        },
        {
            "text": "Half a year, on, we want to share our reflections from these first six months with our many partners."
        },
        {
            "text": "1. BNG is a fundamental shift in approach "
        },
        {
            "text": "BNG requires developers to deliver a minimum 10% biodiversity net gain. This BNG can be delivered either fully or in part via on-site habitat, off-site habitat, or as a last resort, through the purchase of statutory biodiversity credits."
        },
        {
            "text": "Some developers are telling us that following the biodiversity gain hierarchy has already changed the way they choose sites, and how they approach their designs for the benefit of people and nature. Landowners have also found that BNG has been a catalyst for developing their vision and a new approach to land management."
        },
        {
            "text": "The introduction of statutory BNG has also been a stimulus to the creation of a new market and associated activity to link developers and providers of on- and off-site BNG solutions. New habitat banks, BNG brokers, software tools and on-line market places have emerged as creative solutions to the new ambition for nature recovery embedded in BNG. Nearly 500 sites are being advertised across several digital marketplaces, with a majority of those sites being listed as ready, or nearly ready, to register their sites on the biodiversity gain site register."
        },
        {
            "text": "2. How to use the BNG Register"
        },
        {
            "text": "Created and enhanced habitat to offset impacts of development must be legally secured for a minimum of 30 years. If this habitat is delivered off-site, it must be recorded on the BNG Register. The purpose of the Register is to provide a publicly accessible record of off-site gains and the developments they are enabling. It aims to enable strategic planning and prevent the double counting of biodiversity units."
        },
        {
            "text": "On 18 March 2024, the first successful registration of a biodiversity gain site was recorded. Since then, a total of 11 gain sites have been registered, securing more than 250 hectares and 7.5 km of planned habitat intervention. Most of this habitat enhancement and creation is being provided through grassland, broadleaved forests and floodplain wetland mosaic habitats. For a full breakdown of registered gain sites, you can search the Biodiversity gain sites register (data.gov.uk)."
        },
        {
            "text": "If you are ready to register a gain site that can deliver Biodiversity Units for development, we are ready to process your application and look forward to hearing from you soon. Your site does not need to be linked to a development before you register."
        },
        {
            "text": "We aim to process all applications to register a gain site within 6 weeks. Every application to register we have received since launch has been completed within this time frame, with some applications taking as little as two weeks . This includes the receipt of payment and the completion of the verification process conducted by the register operator team."
        },
        {
            "text": "Landowners can ensure that their applications to put land on the Register are approved without delay by ensuring that their applications meet all the requirements of the BNG regulations and that all the necessary documentation is provided."
        },
        {
            "text": "3. When to consider the last resort, statutory biodiversity credits"
        },
        {
            "text": "We recognise that planning applications are being submitted at a slower rate than previous years, an issue highlighted in the King’s speech on 17th July 2024. We welcome the new government’s commitment to both improving the planning system and nature recovery and ambition to boost capacity at a local level."
        },
        {
            "text": "The BNG system is designed to help to ensure that the pace of development in England is not impacted by the introduction of mandatory BNG. Statutory biodiversity credits are available if on-site and off-site options are not possible. Local Planning Authorities decide whether a developer can buy statutory credits as part of the planning process. These statutory credits are available to buy only once planning permission has been granted and other options have been exhausted."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "This is still the start of the BNG journey. We’ve shared some BNG lessons learned with Local Planning Authorities – Natural England (blog.gov.uk) and we continue to work on BNG with Defra and others.\nWe know that some still have questions about this new and exciting initiative. Natural England is acting as the centre point for Defra and others to answer enquiries."
        },
        {
            "text": "Contact biodiversitynetgainenquiries@naturalengland.org.uk by email and 0300 060 3900 by phone. We aim to respond to all enquiries within 10 working days."
        }
    ]
}