{
    "url": "https://vets.blog.gov.uk/2024/08/29/the-first-time-joining-a-fob/",
    "title": "The first time joining an FOB",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Disease outbreak",
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Professional development"
    ],
    "pub_date": "2024-08-29T14:25:40+01:00",
    "content": [
        {
            "text": "Jordon Egan is a Senior Veterinary Inspector at the Animal and Plant Health Agency, and in this blog shares her experiences of traversing across the country and joining a Forward Operating Base to work in front-line exotic disease control."
        },
        {
            "text": "After spending two-and-a-half years in mixed-veterinary practice with a focus on farm-animal and small-animal care, I was in search of opportunities to learn and develop as a vet. An email from a recruiter, whom I had met at a career’s fayre during my time as a student, popped into my inbox in November 2022 and caught my eye: an opportunity to join the Animal Plant Health Agency (APHA) on a 6-month locum (self-employed) contract. Having previously spent only one day completing bird flu surveillance visits, which involved meeting members of the public who had chickens in their back garden in close proximity to a bird-flu-infected premises, it was going to need completely new skills!"
        },
        {
            "text": "Initially there was a need for vets to join the International Trade team, who deal with anything animal-related being imported into the UK, working with legislation and regulations to safeguard the health and welfare of people and animals in the UK. The role was solely desk based and it felt like a huge contrast to my normal workday, and after a short while, and the arrival of a full-time vet from within the agency to join the team, I found myself preparing for another change. My locum manager suggested another opportunity: becoming an employee in the field team as a Senior Veterinary Inspector (SVI) with a 12-month contract and the flexibility to work full-time hours over fewer days, giving a great opportunity for flexibility."
        },
        {
            "text": "During my time at vet school, APHA was a little bit of an enigma and career opportunities were hard to gauge. Even after graduating in 2020, I didn’t have any interactions with APHA, and it was only once I stepped into the field that I learnt just how many vet roles are within the agency, offering career changes under the same employers, career breaks, flexible working arrangements, as well as educational opportunities and residency training, which enables a vet to become a European Board Specialist in Veterinary Public Health."
        },
        {
            "text": "One of the important roles the field team carry out is dealing with diseases which are notifiable (of importance to government because they are zoonotic or their impact on trade or production), and exotic (not usually present in the UK). At the end of 2023, this was the case when bluetongue virus serotype 3 (BTV-3) was detected in the UK for the very first time. Epidemiologists within APHA had already anticipated the possible arrival of this virus, which causes animal suffering and economic loss, within the UK as we see rising global temperatures, bringing diseases further north and it was detected through our annual BTV surveillance."
        },
        {
            "text": "Therefore, in February 2024 I was deployed away from my home field team (Somerset & Dorset) to Norfolk to experience first-hand how we respond to exotic disease on the frontline. Thinking back, I wasn’t sure what to expect, but I am delighted that I was able to experience learning many new things and meet lots of friendly new colleagues."
        },
        {
            "text": "When I was first assigned, I was excited to get stuck in and develop new professional skills, but also nervous having only reached the end of my probation period with no previous outbreak experience. To begin with, my colleagues from my home field team supported me with the logistics, knowing what living arrangements were available to book, the budgets available while I worked away from home, and had their door open to me for any silly little questions."
        },
        {
            "text": "Once I arrived at the disease outbreak base in Norfolk, I was greeted by a welcoming team comprised of a mixture of external vets, fellow and more experienced APHA Senior Veterinary Inspectors from across the UK, and many seasoned Animal Health Officers who perform similar tasks as a vet technician would in practice. We all worked in tandem to respond promptly and complete the crucial visits of animals which had moved from a positive premises to a new home. We also conducted surveillance visits with livestock owners based in proximity to a confirmed infected premises, and dealt with cases of positive animals which involved liaising with the Veterinary Exotic Notifiable Diseases Unit (VENDU)."
        },
        {
            "text": "One of the most enjoyable surveillance visits was to an educational Care Farm to blood sample their goats and sheep. We had wonderful support from the farm assistants who come to the farm to learn new skills, which made it a lovely outing for our team. I was very pleased to be able to return home after completing my first ever blood sampling of goats!"
        },
        {
            "text": "Back at the Forward Operating Base, the office team were critical in ensuring smooth operations and were always approachable, helping us vets find the information we needed with lots of detailed knowledge about individual holdings. Throughout my time in Norfolk, I was very aware that farmers were facing the stresses of bluetongue, the disease control measures and extra licensing requirements, however all my customer-facing interactions were positive. I was able to remember the importance of understanding farmers’ frustrations sympathetically in addition to working constructively alongside them to be flexible in gathering information and finding the answers to their questions. Farmers appreciated APHA’s efforts, especially with phone call updates to clarify concerns."
        },
        {
            "text": "I want to end by saying a huge thank you to the team at the Norfolk base. I was eased into new, fulfilling skill areas and I gained so much experience and knowledge about APHA’s work on bluetongue. I could very easily jump to a future deployment working on bluetongue again without trepidation and would encourage more vets to get stuck into a similar opportunity."
        },
        {
            "text": " "
        },
        {
            "text": "Interested in veterinary work at the Animal and Plant Health Agency? Use this link to find out more: https://aphavets.co.uk/"
        },
        {
            "text": " "
        }
    ]
}