{
    "url": "https://despatch.blog.gov.uk/2022/11/01/helping-parents-understand-the-learning-to-drive-process/",
    "title": "Helping parents understand the learning to drive process",
    "authors": [
        "Amanda Lane"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Learning to drive",
        "Ready to Pass?"
    ],
    "pub_date": "2022-11-01T10:16:01+00:00",
    "content": [
        {
            "text": "Amanda Lane, Head of Driver Testing and Training Policy, shares how we plan to create content for parents as part of our ‘Ready to Pass?’ campaign and the role that ADIs can play in supporting us."
        },
        {
            "text": "Earlier this year we launched the ‘Ready to Pass?’ campaign to improve learner drivers’ understanding of what it means to be test ready and how they can assess their readiness.  "
        },
        {
            "text": "The campaign is going well and 96% of learner drivers who have used the campaign website to help them prepare for their driving test said the information on it was useful.  "
        },
        {
            "text": "So, we’ll continue: "
        },
        {
            "text": "From our research we know that parents can influence learner’s decisions when learning to drive and feeling ready for their test. One of the main factors behind this is because parents tend to contribute or pay for driving lessons and the test.  "
        },
        {
            "text": "So, we have published a new supervising learner drivers guide on GOV.UK aimed at parents who plan to take their child out for private practice.   "
        },
        {
            "text": "In this blog post, I want to: "
        },
        {
            "heading": 2,
            "text": "Why we’re focusing on parents "
        },
        {
            "text": "We know from your feedback that parents can have a big influence on your pupils feeling ready for their test. This can often put pressure on your pupils to take their test before they are ready.   "
        },
        {
            "text": "In December 2021, we surveyed 1,501 parents and guardians of learner drivers aged between 17 and 24.  "
        },
        {
            "text": "We found that:  "
        },
        {
            "heading": 2,
            "text": "What we’re planning to do "
        },
        {
            "text": "Our research shows that around half of parents helping learner drivers underestimate the amount of practice and professional lessons their child will need to become a safe driver.  But they recognise that it is harder than when they learned to drive and agree more information is needed.  "
        },
        {
            "text": "As a result, over the coming months we plan to: "
        },
        {
            "text": "As a parent and an experienced driving examiner who helped both my children learn to drive, I'm passionate about the importance of sharing this guidance and messages with parents and guardians of learner drivers. "
        },
        {
            "text": "It’s important to me that all new drivers have the knowledge, experience, and skills to drive safely on their own after they have passed their driving test and be a safe driver.   "
        },
        {
            "text": "I strongly believe a combination of professional lessons and private practice will help make sure learners get as much on road experience as they can before taking their test and help them to be a safer driver. "
        },
        {
            "heading": 2,
            "text": "Benefits of private practice and observing driving lessons "
        },
        {
            "text": "As many you know, learners who have a combination of professional driving lesson and private practice are 1.5 times more likely to pass their driving test than those have no private practice. "
        },
        {
            "text": "Based on the research we carried out in 2021, most of you said that you actively encouraged private practice and encouraged parents to sit in on lessons. This is great news as there are many benefits to this such as helping: "
        },
        {
            "text": "As part of the campaign, we plan to encourage parents and learners to tell you that they intend to do private practice when they reach a suitable level. "
        },
        {
            "heading": 2,
            "text": "How you can help "
        },
        {
            "text": "We need your help to do this and make sure parents have the right knowledge and skills to support learners with this. We would like you to: "
        },
        {
            "text": "We’d love to hear your feedback and thoughts on whether you plan to do any of these "
        },
        {
            "heading": 2,
            "text": "NASP’s views on the campaign   "
        },
        {
            "text": "The driving instructors’ National Associations Strategic Partnership (NASP) chair, Peter Harvey, said: "
        },
        {
            "text": "“NASP is delighted to support DVSA in this campaign, and applauds the efforts being made to educate supervising drivers about their roles and responsibilities in helping learners navigate the challenging process of learning to drive in modern times.  "
        },
        {
            "text": "“As learning to drive, and the driving test itself, has clearly developed since most supervising drivers learnt themselves, this campaign places an important emphasis on consulting and seeking advice from the pupils' professional driving instructor, both during the learning process and before booking any practical test.  "
        },
        {
            "text": "“Pupil, trainer and supervising driver really need to work together to achieve the best result - a pupil ready to take on the responsibilities of independent driving.” "
        },
        {
            "heading": 2,
            "text": "Keep a record of this professional development "
        },
        {
            "text": "And remember, reading this blog post and the new supervising learner driver guide counts as continuing professional development. So, keep a record of what you do.  "
        },
        {
            "text": "If you’re interested in being featured in a guest blog post here on Despatch about how you’ve used the guidance, let us know in the comments and we’ll be in touch. "
        }
    ]
}