{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/01/introducing-you-to-14/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2022-11-01T10:30:29+00:00",
    "content": [
        {
            "text": "Hi, I’m Holly and I’m a Senior Operational Analyst with RPA based in Worcester. I’ve been with RPA since transferring from Natural England in 2018."
        },
        {
            "text": "I work within the Operational Enabling Team, part of Agricultural Transition. Basically, we’re an RPA internal team, working to ensure that our Agricultural Transition operational colleagues are able to complete their work. We do the work in the background to make changes and remove blockers to allow processing on Basic Payment Scheme (BPS), Countryside Stewardship (CS) and Environmental Stewardship (ES). I specifically work on the planning and implementation of change for CS and ES claims. This means working to open the claims windows, carry out annual crosscheck exercises and anything in between."
        },
        {
            "text": "I act as Scheme Business Readiness Lead, meaning I work on any changes relating to BPS, CS or ES (sometimes all three). I act as line manager for three members of the team. I lead on all crosscheck work that is carried out on claims to ensure that we’re protecting tax payers’ money appropriately. I also act as deputy for a senior lead on DEFRA’s overall transition strategy for moving from BPS, CS & ES to Environmental Land Management (ELM) schemes."
        },
        {
            "text": "There’s no typical day in my role, which is what I think every person must say about their role. I spend a lot of time on calls, speaking to various stakeholders to ensure that actions are underway. There are a number of governance forums that I attend to ensure we’re carrying out appropriate actions across RPA.  I carry out work to establish business requirements, process planning, guidance and products updates etc. I will typically get a question from people across the organisation on a multitude of subjects, either because I may know the appropriate person or to act as a subject matter expert."
        },
        {
            "text": "Everything about my role is intended to try and improve the customer experience, either via making it clearer/easier for them to claim funds, or by making our internal processes more efficient. A key example of this is the recent update of the Farm Visit Form for CS & ES customers where I revised this down from five to two pages. I feel like most of my work ends up seeming obvious once it’s done but it can take a long time to get to a finished product, for instance, the claim windows open in March, but we begin work on this in August/September!"
        },
        {
            "text": "One of the aspects of my role that I enjoy the most is the enormous range of things that I get involved in, from maintaining and improving current schemes to trying to inform future strategy. I work with people across the whole of RPA on a regular basis, linking up with colleagues from DEFRA, Natural England and Forestry Commission."
        },
        {
            "text": "I’m also the thematic lead for the RPA LGBT+ Network, meaning I lead on planning, communication and linking up with other Civil Service LGBT+ networks. We began the network in 2021 and had our first RPA Pride events this year. We’ve worked incredibly hard to raise visibility of LGBT+ staff and awareness of LGBT+ issues which has had good impacts. Our network membership is now up to around 70 I believe, and we’re just beginning to look at how we can work with farming organisations to raise awareness of LGBT+ issues within the communities we serve."
        },
        {
            "text": "One of the ways we could improve the service we provide for customers is by creating greater awareness of what we do at RPA and why. I know from my time in Operations that it can be incredibly frustrating and unclear for customers why we take certain actions. Hopefully that has improved for most, but it’s hard to emphasise enough that we are bound by some strict rules. We’re working to make things clearer, more accessible and more transparent, but there’s still a lot more work to be done on this."
        },
        {
            "text": "I do miss speaking to customers regularly. When I was working in Operations, I would be able to speak to people regularly because of the areas that I worked on. I’ve been lucky this year and been able to meet more customers through my work on opening the claim windows, the farm visit form and attending all three days of the Three Counties Show on the RPA/DEFRA stand."
        },
        {
            "text": "Before I did this role I worked as a team lead within an ES operational team and worked my way up to this position after joining in 2015. Before that I was at university studying Ancient & Medieval History. As you might be able to guess from this I don’t come from a farming background. I kind of fell into this work but I’m passionate about supporting our rural communities now. I’ve moved around quite a bit, having been born near Manchester, moving to South Wales and then Worcester to live with my partner."
        },
        {
            "text": "I think that outside work, I may be pretty boring really. I game (I’ve actually booked a week off to play through the new God of War game that is coming out in a few weeks), I knit, I bake and when I’m feeling sensible, I try to run regularly."
        }
    ]
}