{
    "url": "https://socialcare.blog.gov.uk/2022/11/01/ncasc-2022-is-here/",
    "title": "NCASC 2022 is here!",
    "authors": [
        "Mark Osterloh"
    ],
    "categories": [
        "Events",
        "Mental health",
        "Safeguarding",
        "Social care reform",
        "social work",
        "Workforce"
    ],
    "pub_date": "2022-11-01T20:02:57+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Back in the (big) room"
        },
        {
            "text": "The National Children and Adult Services Conference (NCASC) is back - and in the physical realm this time after two years of pandemic-enforced virtual presentations."
        },
        {
            "text": "Once again, the Manchester Central Exhibition Centre is the venue for the year's biggest social care conference, taking place this week, 2 - 4 November."
        },
        {
            "text": "Attended by representatives from social care providers, local and central government, voluntary organisations, and the private sector, it's an opportunity to debate and discuss the provision of effective services for children, young people, families and vulnerable adults."
        },
        {
            "text": "This year, representation from the Department of Health and Social Care includes Lyn Romeo, Chief Social Worker for Adults, Jason Brandon, Mental Health Social Work Lead and Michelle Dyson, Director General for Adult Social Care."
        },
        {
            "text": "They'll be participating in conference sessions and 'meet and greet events' at our traditional DHSC stand in the exhibition hall. Policy leads involved in charging reform, ASC recruitment and the Better Care fund will also be there to answer your questions."
        },
        {
            "text": "Lyn is looking forward to sessions on \"the challenge of workforce recruitment and the retention of regulated professionals, including the opportunity to share views and reflections from key sector leaders and what can be put in place to improve both.\""
        },
        {
            "text": "There will also be a transitional safeguarding session led by Research in Practice's Dez Holmes, which builds on Lyn's Chief Social Worker for Adults annual report published earlier this year."
        },
        {
            "text": "The local authorities, leading the way as charging reform trailblazers, will also be represented as they and others come together to discuss opportunities, challenges and concerns as the social care reform agenda continues"
        },
        {
            "text": "Jason, meanwhile, will promote the various aspects of the draft Mental Health Bill, which will impact local authorities including strengthening opportunities for prevention, consolidating the Approved Mental Health Professional (AMHP) workforce and promoting improved arrangements for safeguarding patients detained under the Act."
        },
        {
            "heading": 2,
            "text": "Visit DHSC colleagues at stand D6 in the exhibition hall"
        },
        {
            "text": "Here's a mini-timetable of all DHSC related events, but for more details, visit the NCASC site and download the full conference programme."
        },
        {
            "text": "Whether you're attending in person or not, don't forget to follow the conference twitter coverage, using #NCASC22."
        }
    ]
}