{
    "url": "https://defrafarming.blog.gov.uk/2024/11/27/an-update-on-capital-grants/",
    "title": "An update on capital grants",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes"
    ],
    "pub_date": "2024-11-27T15:42:28+00:00",
    "content": [
        {
            "text": "A budget of £5 billion has been allocated for farming and the environment over the next 2 years. This is the largest amount ever dedicated to supporting sustainable food production and nature recovery. "
        },
        {
            "text": "While this is the largest budget we've ever had, we still need to manage it carefully and focus spending on the areas where it can deliver the most benefit for food security and nature. "
        },
        {
            "text": "We provide capital grants for a wider range of items to support sustainable food production and environmental outcomes. So far this year, we have already paid out over £120m across these capital grant offers."
        },
        {
            "text": "This year the demand for capital grants has been exceptional. As of November, RPA had received more applications for the standalone capital offer than over the whole of the 2023-24 financial year. The value of these applications has also increased significantly – with applications from May to November this year worth 42% more than all applications received last financial year. "
        },
        {
            "text": "This high demand for some grant items has led to spending levels that aren't sustainable for this year. We will be giving more to capital grants this year than ever before. We are forecast to spend 49% more on capital grants this year than we paid out in 2023/24 and 125% more than in 2022/23. "
        },
        {
            "text": "To ensure the funding can be prioritised to help build a sustainable farming sector, we’re simplifying and rationalising grant funding. "
        },
        {
            "text": "Part of the overall capital grant offer will temporarily close to most new applications. A further update on this will be shared in early 2025. The remainder of the capital items will remain open, and we will monitor take-up. "
        },
        {
            "text": "In this post, we summarise the changes to capital grants. "
        },
        {
            "heading": 2,
            "text": "Prioritising funding and temporary closures "
        },
        {
            "text": "Due to an overwhelming demand for some capital grant items, the main capital grant offer will have closed to new applications - a total of 76 grant items. This is being done to prioritise funds for areas that will have the greatest benefit for food security and nature conservation.  "
        },
        {
            "text": "You’ll still be able to apply for the following grants during this period: "
        },
        {
            "text": "If your application relates to the capital grant elements that are temporarily withdrawn, it will be on hold for now. You will be contacted in early 2025 with information about what happens next. "
        },
        {
            "text": "If your application is for one of the grants that are still open, it is being processed. You should expect to receive an offer, provided there are no issues with your application.  "
        },
        {
            "text": "Payments under existing agreements will continue as usual following the current process. The change only impacts new applications. "
        },
        {
            "text": "For more information on capital grant items, please visit (GOV.UK). "
        },
        {
            "heading": 2,
            "text": "Support for those with existing agreements "
        },
        {
            "text": "In case you missed it, we recently published a post for those with existing Countryside Stewardship Higher Tier (CSHT) and Higher Level Stewardship (HLS) agreements: CSHT mirror agreements and HLS extensions: an overview. "
        },
        {
            "text": "We’re committed to simplifying the application process for all our environmental land management schemes. "
        },
        {
            "text": "To that end, a rolling application window for the CSHT will open in 2025. This change aims to make the process easier and more accessible, helping you benefit from these important environmental schemes. We’re also working to increase the scheme’s capacity to ensure more farmers can apply. "
        },
        {
            "text": "More information on the CSHT will be published in December. By subscribing to the Farming blog, you’ll receive a notification whenever a post is published. "
        },
        {
            "heading": 2,
            "text": "Investing in food production and nature "
        },
        {
            "text": "As mentioned, the £5 billion in funding over 2 years reflects the importance of investing in both food production and nature’s recovery. This funding will support not only the direct grants but also help safeguard against disease threats, provide recovery funds for farmers affected by extreme weather, and sustain projects that improve both farming productivity and biodiversity. "
        },
        {
            "text": "£60 million has already been allocated to support farmers impacted by last winter’s extreme wet weather through the Farming Recovery Fund, and £208 million directed towards protecting against disease outbreaks. "
        },
        {
            "text": "You can expect more information on the upcoming changes as we approach the new year.  "
        },
        {
            "text": "A further detailed update on the capital grants will be provided in early 2025, including specifics about new applications, eligibility criteria, and processes. The government will continue working to ensure that funding is directed where it will have the most benefit, helping you achieve both environmental and productivity goals. "
        },
        {
            "text": "The Sustainable Farming Incentive (SFI) is open to farmers. There has been a 13% increase in the number of SFI agreements since July 2024 and in total there are nearly 30,000 live agreements. "
        },
        {
            "text": "Learn how SFI can work for you. "
        }
    ]
}