{
    "url": "https://dfedigital.blog.gov.uk/2024/11/27/content-workflow-tips/",
    "title": "Content workflow tips",
    "authors": [
        "Laura Croft"
    ],
    "categories": [
        "Content design",
        "User-centred design"
    ],
    "pub_date": "2024-11-27T11:00:00+00:00",
    "content": [
        {
            "text": "When working on content-heavy services like our Early years child development training and Support for social workers, it’s crucial to agree on and document a workflow. This is because: "
        },
        {
            "text": "For guidance, refer to reviewing and approving content and user-centred design practices."
        },
        {
            "text": "Here are some of the tips for managing long form content from the teams within the Children and families digital portfolio.  "
        },
        {
            "heading": 3,
            "text": "Bring the team together "
        },
        {
            "text": "Onboarding sessions at the project’s start help explain processes and clarify roles and responsibilities, preventing confusion later. Ensure you have: We're hiring"
        },
        {
            "heading": 3,
            "text": "Agree on the content workflow "
        },
        {
            "text": "As a team, agree on the workflow after establishing your strategy, which should detail users, stakeholders, objectives, and monitoring methods. Track and record your workflow using tools like Trello, Jira, or Excel, especially for large volumes of content and with multiple contributors. Tools like Jira can help track and prioritise content work alongside other streams, providing a clear history of completed tasks. "
        },
        {
            "heading": 3,
            "text": "Improve your process "
        },
        {
            "text": "Consider these questions to streamline content creation: "
        },
        {
            "heading": 3,
            "text": "Review Process "
        },
        {
            "text": "Regularly review the efficiency of your content workflow and the ease with which people can engagement with it. Continuously review content and designs through crits and show-and-tells, and test them. When you document the sign-off process, considering DfE and cross-government guidance. "
        },
        {
            "heading": 3,
            "text": "Quality content takes time "
        },
        {
            "text": "Creating content varies by type: "
        },
        {
            "heading": 3,
            "text": "Timeframes "
        },
        {
            "text": "Agree on timeframes during project setup. Allow time for discussion to understand the requirements that will impact on time frames. Time frames vary, for example on our Early years training: "
        },
        {
            "heading": 3,
            "text": "Regular reviews "
        },
        {
            "text": "Review content annually for relevance, accessibility, and accuracy. Make sure you have an agreed process to update or remove content that is no longer relevant or useful. "
        }
    ]
}