{
    "url": "https://socialcare.blog.gov.uk/2024/11/27/delegated-healthcare-the-journey-continues/",
    "title": "Delegated healthcare: the journey continues",
    "authors": [
        "Deborah Sturdy",
        "Oonagh Smyth"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Leadership"
    ],
    "pub_date": "2024-11-27T15:48:55+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Right care, right place, right time"
        },
        {
            "text": "As the conversations about delegated healthcare continue to evolve, the messaging remains clear. Delegation of healthcare activities is happening across adult social care and has been for many years."
        },
        {
            "text": "These voluntary guiding principles support person-centred, clinically appropriate and safe delegation from registered nurses and other regulated healthcare professionals to social care workers and personal assistants across England. "
        },
        {
            "text": "They have been co-developed with the sector and are vital to realising this vision, supporting care providers, care workers and regulated healthcare professionals. Most importantly, they support people drawing on care and provide delegated healthcare in a way which benefits everyone."
        },
        {
            "text": "The guiding principles are supporting conversations where these person-centred activities may bring about better experiences and quality of care for people, in places and times that suit them, by care workers they know and trust."
        },
        {
            "text": "At the heart of our updated resources is the need for a person centred, safe, and effective approach which sets clear expectations for all involved."
        },
        {
            "text": "Having the right guidance and support, as well as hearing from  and sharing with others about what effective delegation looks like (and equally, what doesn’t) makes a difference. It can enable local health and care systems and care providers to update and align their processes and policies with national standards."
        },
        {
            "text": "Through these approaches, care workers and personal assistants can be supported to carry out delegated healthcare activities with the right governance, training, competency and clinical oversight."
        },
        {
            "text": "The guiding principles were originally published in May 2023, followed by testing and evaluation with nine trial sites over 2023-24. Additionally, surveys and national events were held to identify gaps and highlight best practice for further learning."
        },
        {
            "text": "The updated resources reflect the findings from this evaluation. We continue to provide information and support opportunities to bring people together through the Skills for Care Learning Exchange,  listening and responding to challenges and seeking solutions and incentives to embed the principles more effectively."
        },
        {
            "text": "These revised materials are now available on the Skills for Care website. Tools and resources can be accessed to help local health and social care partners embed and adapt these principles into their services."
        },
        {
            "text": "We encourage regulated healthcare professionals, care providers, health and care commissioners, individual employers and care workers to engage with them. We recommend doing this as part of wider conversations, responding to local population requirements and helping people to live well in a place they call home."
        },
        {
            "text": "We will continue to support local health and care systems to make best use of the principles. Our commitment to listening, learning and refining our approach to delegation continues."
        },
        {
            "text": "Together, we will continue to provide high-quality, person-centred care right across the country, empowering care colleagues to expand their skills and experience and deliver the very best support to those who need it the most."
        }
    ]
}