{
    "url": "https://mhclgdigital.blog.gov.uk/2024/11/27/faster-better-cheaper-delivering-improved-outcomes-for-citizens/",
    "title": "Faster, better, cheaper: delivering improved outcomes for citizens",
    "authors": [
        "Lawrence Hopper, Deputy Director, Digital Products and Delivery"
    ],
    "categories": [
        "Innovation",
        "Strategy"
    ],
    "pub_date": "2024-11-27T10:00:20+00:00",
    "content": [
        {
            "text": "Everyone in government is focused on outcomes. Whether these are wrapped up in policies or programmes, the underlying driver is about meeting citizens’ needs through good services. In MHCLG we emphasise that digital is more than digitising things or adopting new tools – it’s a critical partner in shaping responsive, innovative and efficient government. Digital is about working smarter, streamlining how we operate, making policies more responsive, and creating a culture of collaboration. "
        },
        {
            "heading": 2,
            "text": "Explaining what we care about  "
        },
        {
            "text": "Earlier this autumn, we set out a vision within the department of using digital ways of working to deliver improved outcomes. With this aim, we intentionally took a fresh approach to ‘strategy’, moving away from a long, static document unlikely to capture much attention from our users or fulfil its ambition. Instead, we chose to capture our vision in 3 strategic objectives and 9 guiding principles, brought to life by a set of case studies that demonstrate them in action. "
        },
        {
            "text": "This new strategic vision sets out our ambition, showcasing how digital ways of working can support the delivery of our departmental objectives and outcomes, offering better, faster and more efficient services to citizens. "
        },
        {
            "heading": 2,
            "text": "Our ambitions in 3 objectives "
        },
        {
            "text": "Our 3 objectives explain to the department what we care about. We want to embed digital in policy, accelerate digital maturity, and enhance operational excellence:  "
        },
        {
            "heading": 3,
            "text": "1. Embedding digital in policy "
        },
        {
            "heading": 3,
            "text": "2. Accelerating digital maturity "
        },
        {
            "heading": 3,
            "text": "3. Enhancing operational excellence "
        },
        {
            "heading": 2,
            "text": "9 principles to guide the work we do "
        },
        {
            "heading": 2,
            "text": "The strategy is engagement "
        },
        {
            "text": "Communicating our objectives and principles was only the starting point for MHCLG Digital. We have also been using the strategy as a framework for engagement across the department.  "
        },
        {
            "heading": 2,
            "text": "Bringing our objectives and principles to life "
        },
        {
            "text": "In order to inspire teams across the department, we used case studies to illustrate the benefits of collaboration between policy and digital teams, demonstrating our principles in action. "
        },
        {
            "text": "These examples include how policy and digital worked together to respond to a crisis with Homes for Ukraine, how we have worked to deliver a consolidated Funding Service that reduces the overhead on both local authorities and the department, and our work to transform the complex and archaic planning system with Digital Planning. "
        },
        {
            "text": "Over the coming weeks, we’ll explore these case studies and our guiding principles in more detail, and how to embed digital ways of working to achieve better, faster and more efficient outcomes. "
        }
    ]
}