{
    "url": "https://naturalengland.blog.gov.uk/2024/11/27/how-ne-is-helping-people-connect-with-nature-in-the-west-midlands/",
    "title": "How NE is helping people connect with nature in the West Midlands  ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Mental health and wellbeing",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2024-11-27T08:05:00+00:00",
    "content": [
        {
            "text": "By Dr Chloe Hardman, Senior Project Manager, West Midlands Area Team "
        },
        {
            "text": "How do you connect with nature?  Noticing birdsong?  Watching the changing seasons?  There is scope for us all to find ways to connect with nature more deeply and experience greater health and wellbeing benefits, such as reduced stress levels. Human health and wellbeing and nature’s health are closely linked. We know that helping nature to recover is a powerful tool with multiple benefits including generating wealth, building the country's resilience to climate change and for food security.    "
        },
        {
            "text": "Some of us find it easy to connect with and appreciate nature, especially if we have good access to a variety of nature-rich spaces. Some of us find it a lot harder, for a whole mix of reasons. There is still huge inequality in access to nature, influenced by cultural, physical or economic barriers. Natural England’s People and Nature Survey shows that in the West Midlands, visiting the natural environment at least once a week is something that 64% of people in the most deprived postcodes report doing, compared to 75% in the least deprived postcodes.   "
        },
        {
            "text": "The five pathways to nature connection are evidence-based approaches that help people grow closer to nature. This blog explores these pathways, by describing some of the ways Natural England is working with partners to create more opportunities for people to connect with nature. The Purple Horizons Nature Recovery Project, situated between Sutton Park and Cannock Chase in the West Midlands aims to restore habitats and species in a historic heathland landscape whilst giving people more opportunities to engage with nature."
        },
        {
            "text": "The five pathways to nature connection as set out in The Nature Connection Handbook developed by Miles Richardson and Carly W. Butler (2002)."
        },
        {
            "text": "Compassion "
        },
        {
            "text": "We are expanding partners’ capacity to offer people opportunities to act for nature.  Walsall Council is increasing the variety of tasks that corporate volunteers can help with, thanks to some new tools funded through the Purple Horizons project. This helps to enhance heathland and grassland habitats, supporting the growth of a national Nature Recovery Network of improved, better-connected wildlife-rich sites. At the Turner’s Wood Nature Reserve, we are supporting the Birmingham and the Black Country Wildlife Trust in creating a Friends of Group of residents to be more involved in the management of the site."
        },
        {
            "text": "Involving communities with the design of nature connection projects is key to helping cater for all needs and interests. This is an approach that we are encouraging across our partnership. For example, Birmingham and the Black Country Wildlife Trust will be developing a Shared Vision for Nature Recovery in the Bloxwich to Pelsall Landscape, using funding secured by the Purple Horizons partnership, which will involve community consultation and engagement events."
        },
        {
            "text": "Senses "
        },
        {
            "text": "Natural England is funding the enhancement of a Staff Memorial Garden and wildflower meadow at Walsall Manor Hospital, working with the NHS and Groundwork West Midlands. The planting of scented, colourful wildflowers and shrubs aims to activate people’s senses, whilst also benefiting insects and birds.  We are funding three ‘Wellbeing in Nature’ sessions in the renovated garden through Community Interest Company, Mettaminds. These sessions will include Tai Chi, nature photography, sketching, mindful breathing techniques and focusing on the five senses. We hope the sessions will promote greater use of nature-rich spaces by staff and patients, deepening their connection to nature."
        },
        {
            "text": "Beauty"
        },
        {
            "text": "This summer, our partnership held two guided walks to learn about bees and how to help them. We were joined by artist Suzanne Holtom. Suzanne grew up in Walsall and is creating art inspired by the area’s geology, landscape, social history and her personal memories, working up to an exhibition at the New Art Gallery Walsall in Spring 2025. During the bee walks we visited a sandy bank, recently cleared of vegetation to create nesting areas for bees and wildflower meadow created with Natural England funding. Suzanne found the walk inspiring and produced some artwork in response."
        },
        {
            "text": "Innovation"
        },
        {
            "text": "We are supporting the RSPB and local charity Birmingham Settlement to run sports workshops for children themed around swifts. The workshops aim to grow the children’s interest in local nature through sports activities that also support their wellbeing. RSPB will be evaluating the workshops, with the intention of delivering at a greater scale in future. The workshops will be combined with targeted swift conservation measures such as putting up swift boxes. To find out more about how sportsmanship and birdwatching can be a great pairing, listen to Nadeem Perera on Open Country here."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "We are keen to maximise the benefits offered by NE funding for nature connection that supports nature recovery. To help us, Andrew Holmes, Natural England Social Scientist, is interviewing local project leaders. This will build a picture of successes, challenges and gaps we could help address.  The results will be written into a report and used to guide Purple Horizons project development and funding allocation next year. If you are interested in putting forward an idea for a future Purple Horizons related project, please contact the team via  west.midlands.enquiries@naturalengland.org.uk"
        },
        {
            "text": "For more information on Purple Horizons you can also follow the below link:"
        },
        {
            "text": "Purple Horizons | Birmingham & Black Country Wildlife Trust"
        },
        {
            "text": "See the latest news story here:"
        },
        {
            "text": "https://www.gov.uk/government/news/west-midlands-nature-and-community-projects-to-receive-funding"
        },
        {
            "text": "Thank you"
        },
        {
            "text": "A huge thank you to all the project partners and Amber Marquand, Health and Environment lead in the West Midlands Area Team for her role in developing these projects."
        }
    ]
}