{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/11/27/loyalty-pricing-what-shoppers-and-supermarkets-need-to-know/",
    "title": "Loyalty pricing: what shoppers and supermarkets need to know  ",
    "authors": [
        "Debbie Kitcher-Jones"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2024-11-27T12:51:46+00:00",
    "content": [
        {
            "text": "Are you a member of a supermarket loyalty scheme?  "
        },
        {
            "text": "If so, do you trust that the loyalty discounts are as good as they seem, and that you are getting a good deal? "
        },
        {
            "text": "The Competition and Markets Authority (CMA) is working to make sure people get a fair deal as they continue to face cost of living pressures. As part of our work in the groceries sector, we’ve been investigating supermarket loyalty pricing and have today published the final report of our investigation.  "
        },
        {
            "text": "As part of our investigation, we wanted to check: "
        },
        {
            "text": "We asked shoppers how they really feel about loyalty pricing, and found that:  "
        },
        {
            "text": "We analysed around 50,000 grocery products on loyalty price promotions and found very little evidence of supermarkets inflating their usual prices to make loyalty promotions seem like a better deal. "
        },
        {
            "heading": 2,
            "text": "Our messages to shoppers "
        },
        {
            "heading": 3,
            "text": "Loyalty prices offer genuine savings "
        },
        {
            "text": "Our findings reveal shoppers can make an average saving of 17 to 25% compared to the usual price when buying loyalty priced products at the 5 supermarkets examined (Tesco, Sainsbury’s, Waitrose, Co-op and Morrisons). "
        },
        {
            "heading": 3,
            "text": "Shop around for the best deal "
        },
        {
            "text": "Are you a bargain hunter? We found loyalty prices typically beat other supermarkets' regular prices and are often similar to other promotional prices. But we also saw examples of other promotions and regular prices being cheaper for some products so shop around to find the best deals. "
        },
        {
            "heading": 2,
            "text": "Our messages to supermarkets"
        },
        {
            "text": "Supermarkets should:  "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "You can read more about the investigation on our loyalty pricing case page.  "
        },
        {
            "text": "You can also find out more about what we’re doing to help people get a fair deal as they face the rising cost of living. This update covers our recent work on road fuel prices, groceries, infant formula, vet services, online shopping and housing. "
        }
    ]
}