{
    "url": "https://nda.blog.gov.uk/phd-student-joshua-bettles-joins-the-team-at-sizewell-a-to-explore-robotics-and-their-role-in-monitoring/",
    "title": "PhD student Joshua Bettles joins the team at Sizewell A to explore robotics and their role in monitoring",
    "authors": [
        "Joshua Bettles"
    ],
    "categories": [
        "Research and development",
        "Skills"
    ],
    "pub_date": "2024-11-27T11:14:56+00:00",
    "content": [
        {
            "text": "PhD student Joshua Bettles reflects on his three-week placement with the team from Nuclear Restoration Services (NRS) – part of the Nuclear Decommissioning Authority (NDA) group that is co-funding his studies – at former nuclear power station Sizewell A to further his understanding of how robotics could assist the clean-up mission on site."
        },
        {
            "text": "“I am student at the University of Manchester’s Centre for Robotic Autonomy in Demanding and Long-Lasting Environments (CRADLE), in conjunction with the Robotics and AI Collaboration (RAICo) centre in Whitehaven."
        },
        {
            "text": "“My PhD is developing a novel system using collaborative robots (COBOTS) to enable the automated monitoring of personnel and items to detect radiological contamination."
        },
        {
            "text": "“The use of robotics in hazardous environments has many benefits, including ensuring we are able to move people further away from potential harm."
        },
        {
            "text": "“I was pleased to secure a placement at Sizewell A to gain a better understanding of how COBOTS could operate in the real world, alongside the practicalities of how radiological monitoring must be performed."
        },
        {
            "text": "“Safety is taken extremely seriously and I had to undertake a rigorous training and familiarisation programme before entering the site. On completion, I joined an operational work party where I observed skips of radioactive waste being transferred from the cooling ponds area, where they are stored to allow the heat and radiation levels to decay, and saw how they are monitored to ensure safety."
        },
        {
            "text": "“I then donned full PPE to join the Radiological Monitoring Persons in a controlled area to check waste items for contamination. This hands-on experience included locating contamination hotspots on bags and using swabs and probes to identify areas of fixed contamination on the items inside."
        },
        {
            "text": "“In the days that followed, I spent time with various other parties carrying out a range of tasks, including boundary fence designation surveys, characterising areas of surface contamination, waste clearance monitoring and radionuclide identification. A particular highlight for me was wearing a full lead apron and using teleprobes to survey areas of high-dose radiation, and helping to map these areas and record dose rates."
        },
        {
            "text": "“One of the most interesting aspects of my placement was one that some might consider somewhat mundane – watching people get monitored by a Radiological Monitoring Person! This directly informed my research, which aims to design a robotic system for monitoring contamination on humans. I appreciated this insight, especially in terms of human-robot interactions, which is something that the final system will have to carefully navigate."
        },
        {
            "text": "“The placement will ensure my research focuses on an industry-required product, helping me to ‘think like a monitor’ to better design a system that mimics the radiological monitoring processes. "
        },
        {
            "text": "“I was very grateful to those I worked alongside for sharing their views on the future of radiological protection, and how innovation – particularly robotics – could support their work and reduce demand on this resource-constrained profession."
        },
        {
            "text": "“I’d like to thank Michael Carr, NDA Radiation Protection Manager, who coordinated the placement, and all the staff at Sizewell A who supported me.”"
        },
        {
            "text": "Gareth Ward, Sizewell A Waste Manager, said: “We have been very happy to host Josh at Sizewell, and are glad that we can support academic research that contributes to the NDA mission by facilitating practical experience on-site. "
        },
        {
            "text": "“Sizewell’s Waste and Rad Protection team members have also benefited, through the opportunity for constructive, two-way dialogue with the technical experts and having input to hopefully enable more fit-for-purpose products as a result.”"
        },
        {
            "text": "Joshua’s PhD is co-funded by NRS and the Engineering & Physical Sciences Research Council (EPSRC), through an Industrial Cooperative Awards in Science & Engineering (iCASE) voucher."
        },
        {
            "text": "To develop the workforce and technologies that will be needed to meet the complex needs of a decommissioning programme that spans into the next century, the NDA group – of which NRS is a subsidiary company – invests £45 million annually in early careers, including apprenticeship, graduate and PhD programmes.  The NDA’s PhD programme is focussed on developing technical experts of the future and it is proud of its strong retention rate in the sector."
        }
    ]
}