{
    "url": "https://thebluebeltprogramme.blog.gov.uk/pitcairn-at-masts/",
    "title": "A tiny island with a big conservation impact ",
    "authors": [
        "danielleanthony1"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-27T14:11:07+00:00",
    "content": [
        {
            "text": "Despite having an on-island population of approximately 40 people, the Pitcairn Islands manage the third largest continuous and highly protected marine area in the world. Recently awarded a platinum-level Blue Park Award, the marine protected area (MPA) preserves a rare, fully intact marine ecosystem within its expansive 842,000 Km2 boundary. Therefore, it provides sanctuary to over 1,250 marine species from vibrant coral reefs to endangered humpback whales and rare sea birds. "
        },
        {
            "text": "With their Marine Science Base, the Pitcairn Islands offer the opportunity for scientists to study a uniquely pristine coral ecosystem. This marine environment serves as a vital scientific reference point in measuring the profound impacts of climate change.   "
        },
        {
            "heading": 2,
            "text": "Presenting Pitcairn marine research session at MASTS "
        },
        {
            "text": "On the 5th of November, representatives from the Government of the Pitcairn Islands and Blue Belt Programme attended the Marine Alliance for Science and Technology for Scotland (MASTS) Annual Science Meeting in Glasgow.  "
        },
        {
            "text": "In an extended session they proudly shared the extensive work and achievements of their MPA to the global marine science community. The session included four talks from Government of the Pitcairn Islands and Blue Belt Programme representatives that delved into: "
        },
        {
            "heading": 2,
            "text": "Reflecting on the significance of MASTS for the Pitcairn Islands "
        },
        {
            "text": "We spoke to Alasdair Hamilton, Deputy Governor of the Pitcairn Islands, who chaired the session, and Torika Christian, MPA Communications Officer. Reflecting on the success of the conference, they explained how the representation of the MPA at MASTS demonstrates the island’s commitment towards its marine ecosystem.  "
        },
        {
            "text": "What’s the significance of representatives from the Pitcairn Islands coming to events like MASTS? "
        },
        {
            "text": "Alasdair: Conferences like MASTS help to put Pitcairn and its new science base on the global research map.  Being able to connect Pitcairn’s unique environmental profile, which is one of the last remaining fully intact marine eco-systems left globally, with the global Marine Science Community was our key objective for the session.  "
        },
        {
            "text": "The presentations opened up a captivating story of excellent environmental stewardship, high levels of marine biodiversity, crystal clear waters with visibility down to 70 metres and expansive, and healthy, coral cover. We were able to demonstrate the impact of our management and protection efforts and why the marine habitats across the Pitcairn Islands offer so much to environmental research, given the minimal impact of human activity. "
        },
        {
            "text": "Torika: It is highly significant for the local community to represent Pitcairn Island in global events like the MASTS conference. It’s a recognition of the commitment and the communal strength our community has for our marine ecosystem. We hope that many will join us on our shores, in our community and in our oceans, utilizing our new Marine Science Base and further studying Pitcairn’s MPA. "
        },
        {
            "text": "What have been your highlights of MASTS? "
        },
        {
            "text": "Alasdair: Hearing from academics and researchers who have visited Pitcairn and their experiences, and the findings from recent science expeditions which are evidencing the health of Pitcairn’s MPA and the efforts involved in managing and protecting it. Not only is the science demonstrating why MPA’s are so important to protecting marine biodiversity but that places like Pitcairn, with its pure marine habitats, provide a unique opportunity in measuring the impact of climate change. "
        },
        {
            "text": "Torika: Seeing and hearing the engagement of the audience and those presenting. Being able to see the work being presented and the proof that Pitcairn’s Marine Ecosystems are moving it the right directions makes all our efforts so worth it. Also seeing the passion and commitment in those that presented was inspiring to me and I hope others will be inspired to again, explore Pitcairn’s water. "
        },
        {
            "text": "What have been your key take aways from the MASTS conference? "
        },
        {
            "text": "Alasdair: The level of interest in the Pitcairn Islands, including in coral health, fish diversity and the increasing number of humpback whales returning each year to calve. Also being able to talk about the opportunities to explore Pitcairn’s waters, which are generally undiscovered, and how the Blue Belt programme has enabled this. "
        },
        {
            "text": "Conferences like MASTS, which brings together a community of likeminded marine science researchers, is an important platform to highlight both the benefits of scientific research in a biodiversity rich environment, and the need for new innovative methods in capturing data in a very remote part of the globe. "
        },
        {
            "text": "Torika: I was specifically interested in the level of interest the audience had in how much engagement our younger generation has in the MPA. The younger generation is often overlooked yet are the very reason many scientific expeditions gather the data they do. It was a boost to our younger people that our contribution to science is impactful, meaningful, and important. Hopefully more people will be inspired by the science data that was presented, and more opportunities will become available to more scientists to visit Pitcairn. "
        },
        {
            "heading": 2,
            "text": "Receiving global recognition  "
        },
        {
            "text": "Through the MASTS conference, the Pitcairn Island MPA is receiving global recognition for the tireless efforts of its community, scientists and partners that support their MPA. To discover more about the Pitcairn Islands extensive MPA, the ecosystem its safeguarding and how they’re contributing to global marine science through their science base, visit their website.  "
        }
    ]
}