{
    "url": "https://food.blog.gov.uk/2024/11/27/should-we-be-concerned-about-mercury-in-tinned-tuna/",
    "title": "Should we be concerned about mercury in tinned tuna?",
    "authors": [
        "Natasha Smith, Deputy Director of Food Policy"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-11-27T17:01:27+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Tinned tuna is a cupboard staple across the country and is an excellent source of protein, vitamins and minerals. Tuna has been hitting the headlines recently following a report by Bloom, a marine conservation organisation based in France, about levels of mercury in tinned tuna. So, does this product contain ‘toxic levels’ of mercury as reported? We’ve looked at the coverage and wanted to clarify a couple of points."
        },
        {
            "heading": 3,
            "text": "How much mercury is there in fish?"
        },
        {
            "text": "Mercury  is found in all fish due to natural accumulation from the environment, so it can’t be eliminated entirely. Mercury is naturally higher in predatory fish (such as tuna) because the mercury builds up over time from the other fish that they eat. The amount of mercury is also influenced by the size and age of the fish. Therefore, an older, larger fish is likely to have higher levels of mercury than younger, smaller fish. Larger predatory fish (like swordfish or shark) have the highest mercury levels."
        },
        {
            "text": "To accommodate this, in Great Britain we have a maximum level for mercury in tuna and other specified species of 1.0 mg/kg. For other fish (like cod), a lower maximum level for mercury applies. It’s important to note that the researchers have compared levels of mercury in tuna to the lower level for other fish species), rather than the maximum level for tuna. The report found that all 148 cans of tuna tested positive for mercury contamination, but in fact, the study shows a relatively small number of products were above the legal maximum level. Out of 30 products from the UK market, just one product was found which may have been over the legal level. However, we have not seen the individual results or how they’ve been calculated."
        },
        {
            "heading": 3,
            "text": "Guidance for vulnerable groups"
        },
        {
            "text": "The NHS guidance specifies recommended weekly portions of tinned or fresh tuna for those trying for a baby and those who are pregnant. These groups are advised to have no more than four cans of tuna a week or no more than two tuna steaks a week. This recommendation is based on a medium-sized can of tuna with a drained weight of around 140 g per can and a 140 g cooked steak.  The 2018 Committee on Toxicity of Chemicals in Food, Consumer Products and the Environment (COT) review of the most toxic form of mercury in the diets of very young children did not identify any concerns."
        },
        {
            "heading": 3,
            "text": "How is the FSA monitoring exposure to mercury? "
        },
        {
            "text": "We aim for mercury levels to be as low as reasonably achievable and we keep all contaminants in food, including mercury, under review. Our advice on eating fish is informed by work from 2004 by the Scientific Advisory Committee on Nutrition (SACN) and The Committee on Toxicity of Chemicals in Food, Consumer Products and the Environment (COT). Businesses are responsible for ensuring their products are below maximum levels and any products that exceed it should be removed from sale. Local authorities also sample products on the market and test foods to ensure compliance with legislation. Where non-compliant products are found they are investigated and withdrawn from sale. We have no evidence that tinned tuna is unsafe to eat and we encourage everyone to read the NHS advice on the consumption of fish."
        },
        {
            "heading": 1,
            "text": "A ddylem fod yn poeni am fercwri mewn tiwna tun?"
        },
        {
            "text": "Mae tiwna mewn tun yn gynhwysyn poblogaidd yn y DU ac mae’n ffynhonnell wych o brotein, fitaminau a mwynau. Mae tiwna wedi bod yn y newyddion yn ddiweddar yn dilyn adroddiad gan Bloom, sefydliad cadwraeth forol yn Ffrainc, am lefelau mercwri mewn tiwna tun. Felly, a yw’r cynnyrch hwn yn cynnwys ‘lefelau gwenwynig’ o fercwri fel yr adroddwyd? Rydym wedi edrych ar y drafodaeth ac eisiau egluro ambell bwynt."
        },
        {
            "heading": 3,
            "text": "Faint o fercwri sydd mewn pysgod?"
        },
        {
            "text": "Mae mercwri yn bresennol ym mhob pysgodyn am ei fod ar gael yn naturiol yn eu hamgylchedd, felly ni ellir ei ddileu yn gyfan gwbl. Mae mercwri yn uwch yn naturiol mewn pysgod rheibus (fel tiwna) oherwydd bod y mercwri yn cronni dros amser o’r pysgod eraill y maent yn eu bwyta. Mae maint ac oedran y pysgod hefyd yn dylanwadu ar lefel y mercwri. Felly, mae pysgod hŷn, mwy o faint, yn debygol o fod â lefelau uwch o fercwri na physgod iau, llai. Pysgod rheibus mwy (fel cleddbysgodyn neu siarc) sydd â’r lefelau uchaf o fercwri."
        },
        {
            "text": "Er mwyn darparu ar gyfer hyn, ym Mhrydain Fawr mae gennym uchafswm ar gyfer mercwri mewn tiwna a rhywogaethau penodedig eraill, sef 1.0 mg/kg. Ar gyfer pysgod eraill (fel penfras), mae’r uchafswm ar gyfer mercwri yn is. Mae’n bwysig nodi bod ymchwilwyr wedi cymharu lefelau mercwri mewn tiwna â’r lefel is ar gyfer rhywogaethau pysgod eraill, yn hytrach na’r uchafswm ar gyfer tiwna. Canfu’r adroddiad fod pob un o’r 148 tun o diwna wedi profi’n gadarnhaol am halogiad mercwri, ond mewn gwirionedd, mae’r astudiaeth yn dangos mai nifer cymharol fach o gynhyrchion oedd yn uwch na’r uchafswm cyfreithiol. Allan o 30 o gynhyrchion sydd ar farchnad y DU, dim ond un cynnyrch a ganfuwyd a allai fod wedi bod dros y lefel gyfreithiol. Fodd bynnag, nid ydym wedi gweld y canlyniadau unigol na sut y maent wedi'u cyfrifo."
        },
        {
            "heading": 3,
            "text": "Canllawiau i grwpiau sy’n agored i niwed"
        },
        {
            "text": "Mae canllawiau’r GIG yn nodi’r dognau wythnosol a argymhellir o diwna tun neu ffres ar gyfer menywod sy’n ceisio beichiogi a menywod beichiog. Cynghorir y grwpiau hyn i beidio â bwyta mwy na phedwar tun o diwna neu ddwy stêc tiwna yr wythnos. Mae’r argymhelliad hwn yn seiliedig ar dun canolig ei faint o diwna sy’n pwyso 140g y tun ar ôl ei ddraenio neu stêc 140g wedi’i choginio. Yn adolygiad y Pwyllgor ar Wenwyndra Cemegion mewn Bwyd, Cynhyrchion Defnyddwyr a'r Amgylchedd (COT) o’r math mwyaf gwenwynig o fercwri yn neietau plant ifanc iawn, ni nodwyd unrhyw bryderon."
        },
        {
            "heading": 3,
            "text": "Sut mae’r ASB yn monitro amlygiad i fercwri?"
        },
        {
            "text": "Ein nod yw sicrhau bod lefelau mercwri mor isel ag sy’n rhesymol gyraeddadwy, ac rydym yn arolygu’r holl halogion mewn bwyd, gan gynnwys mercwri, yn barhaus. Mae ein cyngor ar fwyta pysgod yn cael ei lywio gan waith o 2004 gan y Pwyllgor Cynghori Gwyddonol ar Faeth (SACN) a’r Pwyllgor ar Wenwyndra Cemegion mewn Bwyd, Cynhyrchion Defnyddwyr a'r Amgylchedd (COT). Mae busnesau’n gyfrifol am sicrhau bod eu cynhyrchion yn is na’r uchafsymiau, a dylid tynnu unrhyw gynhyrchion sy’n uwch na’r lefelau hyn o’r farchnad. Mae awdurdodau lleol hefyd yn samplu cynhyrchion ar y farchnad ac yn profi bwydydd i sicrhau cydymffurfiaeth â deddfwriaeth. Pan ddarganfyddir cynhyrchion nad ydynt yn cydymffurfio, cânt eu harchwilio a’u tynnu oddi ar y silffoedd. Nid oes gennym unrhyw dystiolaeth bod tiwna tun yn anniogel i'w fwyta, ac rydym yn annog pawb i ddarllen cyngor y GIG ar fwyta pysgod."
        }
    ]
}