{
    "url": "https://beisdigital.blog.gov.uk/2016/05/17/facebook-algorithm/",
    "title": "5 tips for working with the new Facebook algorithm",
    "authors": [
        "Gareth Rice-Jones"
    ],
    "categories": [
        "Engagement"
    ],
    "pub_date": "2016-05-17T10:13:47+00:00",
    "content": [
        {
            "text": "Facebook recently announced it has 1.65 billion users. We know that Facebook is the platform where 97% of all social media users have a profile, so how can your organisation’s page work if it doesn’t have many fans?"
        },
        {
            "text": "User growth and the optimisation of Facebook’s paid advertising has reduced the utility of organic posting. So, when there isn’t the option to pay how can work within the algorithm to build successful campaigns?"
        },
        {
            "heading": 2,
            "text": "How it works"
        },
        {
            "text": "Unlike Twitter, which is a live-stream of tweets (albeit with some collation features such as moments), the Facebook algorithm works by showcasing your post to a few fans and, if they respond to it, showing it to a larger group and so on until content fatigue sets in."
        },
        {
            "text": "Achieving a good organic reach can be difficult on a campaign. This is because the repeated use of the same URL is treated by the algorithm as ‘spam activity’."
        },
        {
            "text": "We encountered this issue with our National Living Wage campaign. Our early posts achieved fantastic reach, but after 3 posts linking to the microsite the reach had declined significantly. However, there are a few ways to beat this effect while still remaining on message."
        },
        {
            "text": "Using the following 5 tips we have ensured a consistent reach in the thousands and hundreds of likes and shares for our posts. In one instance we had a post reach of 430,000 with 8,907 engagements (reactions, comments and shares)."
        },
        {
            "heading": 2,
            "text": "1. Use ‘native’ video"
        },
        {
            "text": "To compete with YouTube the algorithm prioritises natively uploaded video in the news feed. You can include a strong call to action in the video or add in a clickable URL to the microsite at the end. That way the punish effect is partially counteracted by the video priority."
        },
        {
            "heading": 2,
            "text": "2. Use a GOV.UK link"
        },
        {
            "text": "If you use a press release on GOV.UK to mark the launch of your campaign then you should include an obvious link to your microsite. You can then link to that to help break up repetitive microsite URL usage."
        },
        {
            "heading": 2,
            "text": "3. Post graphics with a strong call to action"
        },
        {
            "text": "You can also use standard graphics with a clear call to action. For National Living Wage we had the call to action (\"Search: NationalLivingWage\") at the bottom of graphics and you can add this into the post as well. This is best used for awareness raising elements of your campaign."
        },
        {
            "heading": 2,
            "text": "4. Make sure your content is mobile optimised"
        },
        {
            "text": "Over 91% of traffic on Facebook is on a mobile device so make sure your content and all web pages are optimised for mobile by testing on the scheduling previewer. You can’t always rehash Twitter graphics and you may need to change font sizes etc. The algorithm only shows the content users actually engage with on news feeds so if your mobile users can’t engage you have a problem!"
        },
        {
            "heading": 2,
            "text": "5. Use organic targeting"
        },
        {
            "text": "Facebook’s relatively new organic audience targeting can help you to effectively target different audience segments and more effectively optimise your content to user needs. Using it in a smart way, as you would with paid activity, can enhance the reach potential of a post."
        },
        {
            "text": "These 5 tips can help you get the most out of your organic campaign posts. The main thing to remember is that the algorithm keeps changing so you need to change up your posting approach regularly to succeed."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}