{
    "url": "https://naturalengland.blog.gov.uk/2026/01/14/building-homes-restoring-nature-how-district-level-licensing-has-streamlined-development/",
    "title": "Building Homes, Restoring Nature: How District Level Licensing has streamlined development ",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Development",
        "Growth",
        "Natural England",
        "Nature"
    ],
    "pub_date": "2026-01-14T17:07:13+00:00",
    "content": [
        {
            "text": "By Mike Burke, Sustainable Development Portfolio Director"
        },
        {
            "text": "Nature underpins our nation's growth, health, and security. Natural England's job is to recover nature whilst enabling our partners in the development sector to build the vital homes this country needs. "
        },
        {
            "text": "Our approach is to integrate nature into development from the outset, working in partnership with developers to find strategic nature-based solutions, finding ways to conserve nature that also keep down costs and delays for developers. As part of our new strategy, we are thinking bigger, rather than protecting individual sites or species, we are looking at delivering recovery across entire landscapes. We are making development quicker, simpler, and cheaper, cutting red tape to get homes built faster. "
        },
        {
            "text": "One of these flagship solutions is our District Level Licensing scheme that conserves the wetland habitats of great crested newts. There has been some recent commentary that the planning system places more importance on newts than building homes – that developer charges are not being spent on habitat restoration and developers are not supportive of the scheme. These statements are simply untrue. "
        },
        {
            "text": "There is ample evidence showing significant losses of ponds and other wetlands over recent decades, which impact a wide range of wildlife including newts. Developers understand and respect their legal obligation to safeguard our most endangered wildlife, and they bear the cost of this responsibility.  But we must avoid this responsibility becoming an obstacle to important new housing delivery. Natural England’s role as a public conservation body is to help developers meet their obligations in the most effective and straight forward way possible."
        },
        {
            "text": "The answer to this is the District Level Licensing Scheme. This voluntary scheme gives developers an alternative efficient solution to offset harm to habitats arising from their developments. Rather than having to conduct their own newt surveys and carry out subsequent mitigation actions, the scheme allows developers to pay a one-off fee, which Natural England invests entirely in the operation of the District Level Licensing scheme to restore wetland habitats at scale and fund their monitoring and maintenance over 25 years. These funds are ring-fenced and used only for the purpose of meeting this obligation. To date the scheme has enabled the creation and restoration of over 4,000 ponds and supported the delivery of 35,000 housing units. "
        },
        {
            "text": "Developers are not obliged to use the District Level Licensing scheme. However, the alternative is for a developer to commission surveys of individual sites to determine whether they need to apply for specific licences. The seasonal nature of survey work can create uncertainty and delay which no business welcomes.  For this reason, most developers actively choose to use District Level Licensing, with over 65% of all newt license applications opting for this solution – because it is the best choice for their business.  "
        },
        {
            "text": "Surveys of developers who have used District Level Licensing over the past five years confirm that more than 70% believe the scheme provides greater certainty: certainty that their development will be licensed, that licence requirements will be fulfilled, that timescales will be clear, and that there will be no unforeseen delays.  Developers have told us that, ‘District Level Licensing is a much clearer, simpler, and swifter process to ensure we can get on site in a timely manner.'"
        },
        {
            "text": "District Level Licensing demonstrates that strategic, evidence-based approaches can remove unnecessary barriers to development while delivering measurably better outcomes for nature. It’s proof that building the homes Britain needs and protecting our environment can be achieved together. With assent for the Planning and Infrastructure Act heralding the launch of the Nature Restoration Fund later this year, there is much that can be learnt from the success of District Level Licensing as collectively, we develop new strategic solutions that will benefit people and nature."
        }
    ]
}