{
    "url": "https://space.blog.gov.uk/2025/07/25/ecsat-celebrates-its-10th-anniversary/",
    "title": "ECSAT celebrates its 10th anniversary",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "European Space Agency"
    ],
    "pub_date": "2025-07-25T14:48:53+01:00",
    "content": [
        {
            "text": "The European Centre for Space Applications and Communications (ECSAT) celebrates a decade of of boosting UK prosperity, understanding the Universe, and protecting our planet and outer space. "
        },
        {
            "heading": 2,
            "text": "What is ECSAT and what does it do? "
        },
        {
            "text": "In operation from 9 July 2015, the ECSAT research centre in Harwell, Oxfordshire has championed scientific innovations in space, made the world a better place for UK and European citizens, and improved our understanding of the Universe. "
        },
        {
            "text": "The founding of ECSAT was one part of the UK government’s project to establish itself within the space sector, along with the creation of the UK Space Agency in 2010. The research centre’s location in the UK has also served to strengthen collaboration between the UK Space Agency and ESA, supplying both agencies with added expertise and facilities that would have otherwise been harder to obtain. "
        },
        {
            "text": "This close connection between agencies has allowed ECSAT to achieve its main research objectives and expanded its innovative capabilities in fields such as satellite telecommunications, robotics, climate change research, technology, and science. "
        },
        {
            "heading": 2,
            "text": "ECSAT’s achievements over the last 10 years "
        },
        {
            "text": "Since its inception, ECSAT has been at the forefront of space and technology research, with the overall objective being to improve the lives of UK and European member state citizens. "
        },
        {
            "text": "Over its lifetime, ECSAT has invested over €1 billion in new technologies and services for the biggest markets for space – satellite telecommunications and applications. This investment has helped research teams around Europe and in the UK test and develop their technologies, achieving connectivity in some of the most remote locations on Earth.    "
        },
        {
            "text": "The research centre’s 5G/6G Hub has played a key part in developing the next generation of space-enabled network connectivity; both strengthening existing 5G networks and preparing for the future instalment of 6G. "
        },
        {
            "text": "The applications of this technology are practically limitless. Engineers have begun testing the use of specialised remote-control robots in conditions that are potentially hazardous for humans but harmless for agile robots controlled from afar with 5G. Another potential application of this technology comes in the field of climate research. Since bodies of water are often isolated and poorly connected, ECSAT’s improved 5G technology could aid scientists to monitor metrics such as salinity, pollution, and pH levels in water around the world and in real time. "
        },
        {
            "text": "ECSAT does not work alone, however. Teams at the research centre have supported smaller organisations and start-ups in the space sector to test and launch their products. Over 1000 companies have benefitted from the support of ECSAT and ESA, resulting in the development of technologies such as medical supply drones and a prototype for 5G-connected ambulances that would support paramedics in remote locations. "
        },
        {
            "text": "These are not just established companies either. Through its Business Incubator Centre, the ECSAT network has also supported 140 space startups, of which 95% have gone on to succeed commercially. Together, these companies have secured over £200 million in private equity investment, helped create over 1000 high-skilled jobs, and continue to push the space sector into uncharted territory. "
        },
        {
            "text": "Perhaps most significantly, ECSAT has contributed immensely to our understanding of the planet, and the forces threatening its ecosystems. ESA’s Climate Change Initiative (ICC), working out of ECSAT, has produced over 1300 scientific papers as well as informed over half of the Essential Climate Variables (ECVs) scientists around the world use to keep track of the climate and its health. "
        },
        {
            "heading": 2,
            "text": "ECSAT’s plans for the future "
        },
        {
            "text": "With 10 years of impressive achievements behind them, ECSAT is not taking its foot off the accelerator. "
        },
        {
            "text": "The primary goal of the centre and ESA is to keep reinforcing and expanding the work ECSAT is currently doing with special emphasis on satellite communications. This will include working both with the cluster organisations within its network, and the UK Space Agency itself. "
        },
        {
            "text": "In terms of sizeable changes to its remit, ECSAT has emphasised its ambitions to expand its activities to include multi-disciplinary projects such as the Moonlight Initiative, which aims to facilitate infrastructure building on the moon for institutions and companies. "
        }
    ]
}