{
    "url": "https://environmentagency.blog.gov.uk/2025/07/25/the-unsung-heroes-of-water-monitoring-a-chief-scientists-perspective/",
    "title": "The Unsung Heroes of Water Monitoring: A Chief Scientist's Perspective",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Science",
        "Uncategorized",
        "Water Monitoring"
    ],
    "pub_date": "2025-07-25T08:27:23+00:00",
    "content": [
        {
            "text": "When I first stepped into the Chief Scientist role at the Environment Agency, one of my earliest visits was to observe how our teams monitor England's rivers. What I witnessed was nothing short of remarkable—a complex network of skilled professionals working tirelessly to understand and protect our water environment."
        },
        {
            "text": "Monitoring our ever-changing water systems is far from straightforward. It demands skill, knowledge, expertise, and deep scientific understanding. The journey from collecting a water sample to generating actionable information involves a carefully orchestrated chain of activities:  planning of monitoring locations and frequencies, coordinating logistics, collecting samples, taking measurements, conducting laboratory analyses, and interpreting and publishing data. This process underpins critical decisions across multiple fronts, from abstraction licencing and flood warnings to water quality permits."
        },
        {
            "text": "The Scale of the Challenge"
        },
        {
            "text": "The magnitude of this undertaking cannot be overstated. England boasts over 55,000 kilometres of rivers, streams, and canals—a network longer than the country's main road system. Add to this the lakes, groundwaters, coastlines, and estuaries, and you begin to appreciate the immense complexity of monitoring such vast and varied terrain. It requires significant resources, coordination, and cutting-edge technology to ensure effective environmental oversight."
        },
        {
            "text": "During my visits to our national laboratories, I've witnessed the extraordinary range of water quality tests conducted daily. I've observed our National Water Quality Instrumentation Service managing continuous real-time monitoring, visited our Analysis and Reporting Teams conducting ecological surveys, accompanied our Monitoring Field Teams collecting samples, and toured gauging sites with our Hydrometry and Telemetry teams monitoring water levels, flow, and rainfall. Throughout these experiences, I've been consistently impressed by the care, professionalism, and passion of our staff."
        },
        {
            "text": "Adapting to Change"
        },
        {
            "text": "Our work constantly evolves because the environment itself is dynamic. Our monitoring must deliver insights that enable effective responses to change—whether that's immediate action following an incident or long-term strategies based on multi-year data to guide large-scale improvements."
        },
        {
            "text": "This is why we collected over 99,000 samples across the country last year, analysing thousands of different chemicals and hundreds of species of plants and animals in our laboratories and in the field. This remarkable achievement was delivered by skilled staff, often working under very tight timescales. Recognising the critical importance of this work, we've secured an additional £8 million in funding this year—on top of existing budgets—to boost our monitoring service capacity."
        },
        {
            "text": "Our dedicated workforce"
        },
        {
            "text": "Much of this excellent work, carried out by around 1,000 dedicated professionals across the Environment Agency, often goes unnoticed. We have specialists who start early each morning to collect samples or process laboratory bottles from the previous day. We have experts who understand everything about invertebrates and what they reveal about river health. Our teams include mathematicians, environmental scientists, ecologists, data scientists, and analytical chemists, all playing vital roles in generating the information we need. Together, they make us by far the largest provider of water monitoring data in England."
        },
        {
            "text": "Addressing Recent Challenges"
        },
        {
            "text": "Recent media coverage regarding capacity issues in our inorganic laboratory has highlighted the challenges we face, but it cannot diminish our position as England's primary water monitoring provider. Over recent years, we've steadily increased our overall delivery of water quality analysis. In March, we opened our new laboratory space in Leeds continuing to expand our capacity for the future."
        },
        {
            "text": "In response to the specific staffing issue, we've increased the size of our inorganic team to strengthen overall resilience, helping reduce the risk of similar disruptions. We expect to return to full capacity with the expanded team and deliver all planned monitoring programmes in October."
        },
        {
            "text": "Managing a complex monitoring programme requires constant adaptation to unexpected changes. Any decision to pause monitoring is never taken lightly. During the affected period, we implemented various mitigations to ensure continued valuable data collection. We optimised our sampling strategy to maximise sample collection. We used handheld monitors at discharge compliance sites, and maintained sampling when concerns were flagged by field measurements."
        },
        {
            "text": "Despite challenges, we processed tens of thousands of samples, including 47,000 through our inorganic laboratory alone between May and July. The reported 17.5% impact on our inorganic capacity represents only a small fraction of our overall monitoring activities. The 10,000 cancelled tests must be viewed within the context of 1.7 million measurements for which we had results last year."
        },
        {
            "text": "The vast majority of our monitoring activities remain unaffected. Our ecology monitoring, water quantity assessments, bathing water testing, pollution incident sampling, and organic chemical analysis continue without disruption."
        },
        {
            "text": "We continue to prioritise our efforts, with inorganic analysis for national drought monitoring programmes being reinstated first. This work is scheduled to resume next week. Our monitoring for water quantity for drought and prolonged dry weather in our Hydrometry and Telemetry teams has ramped up, and is also unaffected by these issues."
        },
        {
            "text": "Innovation and Collaboration"
        },
        {
            "text": "We must continue innovating, constantly exploring new equipment and analytical methods to improve our monitoring capabilities. The Defra-wide Natural Capital Ecosystem Assessment programme offers exciting opportunities for new science and understanding. The NCEA is a distinct, time-limited initiative with its own dedicated funding, which can only be spent on research and development.  While we have this additional resource, we are maximising what we can learn from it so that our future monitoring programmes give us the information we need to manage our rivers and water environment. We're committed to making our data more accessible. While much of our data is publicly available on our Water Hub Data Explorer, we're working to bring together broader information from different sources, maximising data available for local decision-making. This includes information from citizen scientists, industry, and academics."
        },
        {
            "text": "The recent media interest has generated tremendous support from citizen scientists and other laboratories. Through our Supporting Citizen Science Project, we now have citizen science leads in most areas of the country. We've published a Technical Advisory Framework to support this activity, and we encourage engagement through our Citizen Science Water Hub page."
        },
        {
            "text": "Looking Forward"
        },
        {
            "text": "This essential monitoring is critical to the health of our environment and communities. In the months and years ahead, I will continue listening to colleagues and customers to understand what works well and where challenges remain. I'm eager to understand how our data is being used and explore how we can unlock even more value from it, making our monitoring even more relevant and useful."
        },
        {
            "text": "I will work with the monitoring community, both internally and externally, to continue innovating and improving our work. I want us to remain at the forefront of this field, and I truly believe we have the expertise and passion to make that happen."
        },
        {
            "text": "As Chief Scientist, I want to ensure the fantastic work of people across the Environment Agency receives the recognition it deserves. Thank you to everyone who delivers this essential, critical service. I look forward to more great science and insight from our collaboration in the coming months and years."
        }
    ]
}