{
    "url": "https://defraenvironment.blog.gov.uk/2025/09/05/the-protected-landscapes-partnership-working-together-for-nature-people-and-climate/",
    "title": "The Protected Landscapes Partnership: working together for nature, people and climate ",
    "authors": [
        "Michelle Luscombe"
    ],
    "categories": [
        "Community",
        "Nature",
        "Protected Landscapes",
        "Wildlife"
    ],
    "pub_date": "2025-09-05T13:29:46+01:00",
    "content": [
        {
            "text": "I’m Michelle and I work in the Protected Landscapes team in Defra. We’ve just launched an advert for an Independent Chair of the Protected Landscapes Partnership and in this blog post, I’m going to spread the word about this fabulous collaboration - and how you can get involved in this opportunity if it resonates with you. "
        },
        {
            "text": "Protected Landscapes are treasured places "
        },
        {
            "text": "From the Southwest Coast Path’s dramatic cliffs to Northumberland’s dark skies, our National Landscapes, National Parks and National Trails are our most inspiring places.  "
        },
        {
            "text": "Our 10 National Parks, 34 National Landscapes and 20 National Trails cover around 25% of England and are home to vital habitats, wildlife, and heritage. Welcoming over 270 million visitors a year, these treasured places connect wildlife, people, communities and landscapes, helping to support local communities and rural economic growth. "
        },
        {
            "text": "As a child I used to love walking my family dogs in Dartmoor National Park and experiencing its rugged wildness. I now walk my own dog in the beautiful leafy greenness of the Blackdown Hills and feel a sense of peace and serenity every time. "
        },
        {
            "text": "Our Protected Landscapes aren’t just lines on a map or signs at the side of the road. Each Protected Landscape has a dedicated team behind it who are experts in their local area and both national and international collaboration. "
        },
        {
            "text": "Protected Landscape teams work together with local farmers, communities and business to support their needs and conserve and enhance the natural beauty of the landscape. This could mean working together to create new, nature-rich habitats providing a home for our wildlife like red squirrels or curlew to restoring or creating footpaths ensuring our landscapes are accessible to all.  "
        },
        {
            "text": "But more is needed to protect these amazing places for nature and people. In recognition of the challenges they face, the Government has created the Protected Landscapes Partnership to bring together the organisations responsible for these special places. "
        },
        {
            "text": "The Protected Landscapes Partnership is a forum for national collaboration "
        },
        {
            "text": "The Protected Landscapes Partnership (PLP) is a forum for national collaboration between the partner organisations – the National Landscapes Association, National Parks England, National Trails UK, and Natural England. It also works closely with the National Parks Partnership to develop green finance opportunities and bring new investment to deliver large scale nature restoration projects.  "
        },
        {
            "text": "The PLP is a hub for innovation and the development of ambitious projects; a place to learn, test new ideas, share knowledge and find peer support.  "
        },
        {
            "text": "Everything the PLP does is to help conserve and enhance Protected Landscapes so they can be enjoyed by everyone, a worthy mission which I’m proud to be involved in. Some exciting projects currently taking place include: "
        },
        {
            "text": "The Big Chalk Partnership, which aims to create thriving chalk and limestone landscapes across southern England. Big Chalk consists of over 150 organisations, including 14 National Landscapes, South Downs National Park and 9 National Trails. "
        },
        {
            "text": "Big Chalk has a vital role in nature’s recovery, helping bring about local projects that will contribute to national targets for nature recovery. Big Chalk has just launched its first ever Nature Recovery Fund, which will provide targeted funding to support high-impact, partner-led projects to restore, connect and enhance the habitats that make these chalk landscapes globally significant. "
        },
        {
            "text": "The PLP also funds the Coastal Wildbelt project, which advocates for a joined-up approach that gives equal weight to outcomes for people and nature along England’s coast. At 2,700 miles, the King Charles III England Coast Path will be the world’s longest managed coastal walking route. "
        },
        {
            "text": "Its unique coastal margin - 943 square miles of land between the trail and the sea - is a vital ecological corridor connecting Protected Landscapes and priority habitats and plays a crucial role in restoring biodiversity, tackling climate change, and building coastal resilience. "
        },
        {
            "text": "And the final project we’re shining a light on is Nature Calling. This is a national arts programme funded by Arts Council England and the Partnership, working with Activate Performing Arts and National Landscapes, and led by the National Landscapes Association. "
        },
        {
            "text": "Nature Calling aims to amplify new voices and create innovative artwork with National Landscapes communities, inviting people to connect and experience our natural world in new ways. "
        },
        {
            "text": "Building to a national 'season' between May and October 2025, it’s delivering 6 major art projects and working with 6 writers across 6 National Landscape hubs, plus 23 further projects scattered across 26 National Landscapes and 2 National Parks. "
        },
        {
            "text": "An independent Chair for the PLP "
        },
        {
            "text": "Together with the PLP partners we are seeking an independent Chair for the PLP to provide strategic leadership of the Protected Landscapes Partnership into the future, amplify the Protected Landscapes brand, and drive innovation. "
        },
        {
            "text": "We are looking to attract dynamic candidates from a range of diverse backgrounds, who have a genuine passion for tackling the climate and nature crises and for empowering England’s Protected Landscapes to become greener, wilder and more accessible through innovative and visionary approaches. "
        },
        {
            "text": "How to apply and get involved  "
        },
        {
            "text": "The PLP’s mission is to support Protected Landscapes accelerate nature recovery, lead work leading in tackling climate change and become accessible for all.  "
        },
        {
            "text": "If you share this passion and are keen to drive forward the Partnership’s vision for the future, visit the Public Appointments website and get your application in by 18 September. "
        },
        {
            "text": "For more information, contact protectedlandscapes@defra.gov.uk. "
        },
        {
            "text": "Whether you’re in a city, town or the countryside, you shouldn’t be far from a Protected Landscape or National Trail so get out and get exploring these incredible places that do so much for us. "
        }
    ]
}