{
    "url": "https://ipo.blog.gov.uk/2025/02/14/alls-fair-in-love-and-ip-rights/",
    "title": "All is Fair in Love and IP Rights ",
    "authors": [
        "Meg Davies",
        "Christina Watts"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Patents",
        "Trade marks",
        "Uncategorized"
    ],
    "pub_date": "2025-02-14T10:00:00+00:00",
    "content": [
        {
            "text": "Love, innovation and creativity have always gone hand in hand. From patented heart-shaped jewellery to chocolate brands protected with trade marks, romance has long inspired inventors and creators across the UK. While you are busy planning the perfect gift, intellectual property (IP) is quietly playing cupid behind the scenes. "
        },
        {
            "heading": 2,
            "text": "Patently in Love "
        },
        {
            "text": "In the spirit of Valentine’s Day, the Intellectual Property Office (IPO) has gifted us a brand new patent search, meaning finding a patent is easier than hunting for the perfect Valentine’s gift. A few quick searches have revealed some romantic innovations that show just how creative love can make us: "
        },
        {
            "heading": 4,
            "text": "Folding heart design card - GB2436813"
        },
        {
            "text": "This greetings card has interlocking sections that form a love heart shape, complete with space for a special message inside. "
        },
        {
            "heading": 4,
            "text": "Wishbone - GB2619980 "
        },
        {
            "text": "This novelty wishbone patented in 2022 claims to test \"who loves more\" - we recommend using this one with care! "
        },
        {
            "heading": 4,
            "text": "Heart-shaped swim goggles - GB2579706 "
        },
        {
            "text": "These heart-shaped swim goggles feature rims filled with liquid and glitter- the perfect gift for the swimming enthusiast in your life. "
        },
        {
            "heading": 2,
            "text": "Copyrighting Cupid"
        },
        {
            "text": "If something homemade is more your style, IP still has you covered. Whether you're writing the world's most romantic poem or composing a tune to rival the sweetest love song, copyright is there to protect your work automatically from the moment of creation. "
        },
        {
            "text": "Not feeling creative? You're in luck! Many romantic classics are now out of copyright and free to use. Shakespeare's sonnets are all in the public domain, as are Jane Austen's novels and musical pieces like Tchaikovsky's \"Romeo and Juliet Overture\" and Here Comes the Bride (Wagner’s “Bridal Chorus”). "
        },
        {
            "text": "Feel free to quote poetry in your Valentine's card, but if you’re looking to sell products or use music in a video that you’ll be posting online, you should be aware that more recent works will still be under copyright. A good rule of thumb in the UK is that copyright usually lasts for 70 years after the creator's death. "
        },
        {
            "heading": 2,
            "text": "Sealed with a Registered Design  "
        },
        {
            "text": "Do you have your eye on a special someone this year? Your valentine’s gift - whether it’s an engagement ring or their favourite scent - may be protected with a registered design. Here are some of our favourites: "
        },
        {
            "heading": 4,
            "text": "Welsh love spoon- 6107275"
        },
        {
            "text": "The appearance of love spoons are often unique, so protecting the design is a great idea. Paul Curtis did just this in 2020, for this love spoon with a rose design.  "
        },
        {
            "heading": 4,
            "text": "Perfume bottle for DKNY Be Delicious - D529397 "
        },
        {
            "text": "Many fragrances have unique and iconic bottles, such as DKNY’s Be Delicious. This glass bottle, which is shaped like an apple, lines many a dresser across the world. Gabrielle Studio, Inc. hold registered designs for many of DKNY’s products. "
        },
        {
            "heading": 4,
            "text": "Ring with heart-shaped setting 6170653  "
        },
        {
            "text": "This ring was registered as a design in 2022 by jewellery company Pandora A/S. It has a heart-shaped stone and pink stones studding the band. "
        },
        {
            "heading": 2,
            "text": "Marked with Love"
        },
        {
            "text": "Behind many of our most beloved Valentine's brands are carefully protected trade marks. Trade marks don't just protect logos and names. They help us identify authentic tokens of affection from imitations, and safeguard the considerable investment these companies make in building their brand identity and reputation. From luxury jewellers to artisan chocolatiers, trade marks help ensure that when you're spending money on that special gift, you're getting exactly what you paid for. "
        },
        {
            "heading": 4,
            "text": "Tiffany"
        },
        {
            "text": "The iconic jewellery company hold a wide array of trade marks. As well as having protected their name and logo, they famously hold trade marks for their signature colour Tiffany Blue (UK00911964641) and their iconic blue boxes (UK00900151985)."
        },
        {
            "heading": 4,
            "text": "Bollinger"
        },
        {
            "text": "Champagne company Bollinger hold the oldest trade mark on our list. As well as having trade marked their logo and some of the labels for their bottles, they hold the original trade mark for their name, from 1908! (UK00000308985)."
        },
        {
            "heading": 4,
            "text": "Bloom and Wild "
        },
        {
            "text": "This floral company sell fresh bouquets of flowers, delivered directly to your doorstep. The company has wisely protected their IP, having trade marked both their name (UK00915755283) and logo (UK00004027364)."
        },
        {
            "text": "So, this Valentine's Day, take a moment to consider the IP that helps make the day of love extra special. After all, behind every romantic gesture, there might just be a patent, design or trade mark! "
        },
        {
            "text": "Happy Valentine's Day from the Intellectual Property Office!"
        }
    ]
}