{
    "url": "https://dwpdigital.blog.gov.uk/2025/02/14/celebrating-apprenticeship-success-at-the-makers-awards-2025/",
    "title": "Celebrating apprenticeship success at the Makers Awards 2025 ",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Apprenticeships",
        "Digital Academy",
        "Digital With Purpose",
        "Diversity"
    ],
    "pub_date": "2025-02-14T15:32:34+00:00",
    "content": [
        {
            "text": "This week marks the celebration of National Apprenticeship Week here at DWP Digital. "
        },
        {
            "text": "We are proud to have supported 113 apprentices through their learning journey to successful completion in the last 12 months, an increase of 80% more than the previous 12 months.  "
        },
        {
            "text": "Throughout the week a series of events and training was provided to colleagues across the organisation to raise awareness of the incredible work our apprentices and their support networks do on a daily basis. "
        },
        {
            "heading": 2,
            "text": "Makers Apprenticeship Awards"
        },
        {
            "text": "Last week we also celebrated four DWP Digital colleagues getting recognition for their work at the Makers Apprenticeship Awards. Makers are an apprenticeship provider for DWP Digital, offering programmes at a Higher Level 4 standard in a range of roles including Software Development and DevOps Engineering. Makers provide the knowledge and skills in a supportive learning setting; apprentices then combine this with hands on learning on real projects within DWP Digital.  "
        },
        {
            "text": "The awards are a celebration of transformation of individuals, organisations, and the tech industry. Now in its third year, they honour the bold spirit of career changers and the organisations that support them.  "
        },
        {
            "text": "There were 43 colleagues from across DWP Digital nominated, and 16 shortlisted, an exceptional achievement to be put forward for the rising star, technical brilliance, innovator, impact, mentor and line manager categories. "
        },
        {
            "heading": 2,
            "text": "Innovator "
        },
        {
            "text": "Louis won The Innovator Award for transforming The Garage's existing Redmine ticketing platform to its latest version. The Garage are a team within DWP Digital using AI and automation to simplify and streamline customer and colleague experience.  Managing to create a proof of concept in under three weeks, within twelve-weeks, Louis successfully set up a fully functional application. His ability to deliver a working solution in such a short timeframe is impressive, whilst also balancing his regular workload and apprenticeship. "
        },
        {
            "text": "Louis demonstrated an exceptional ability to learn and apply new technologies, earning the award for his work ethic, technical expertise, and innovative mindset.  "
        },
        {
            "heading": 2,
            "text": "Technical Brilliance "
        },
        {
            "text": "Jaabir won the Technical Brilliance Award for his achievement optimising AWS endpoints as part of his final apprenticeship project. His meticulous research and implementation significantly reduced cloud costs, exemplifying Jaabir’s ability to combine technical skill with strategic thinking to deliver measurable value to the department.  "
        },
        {
            "text": "He has written numerous scripts to automate repetitive tasks, streamline workflows, and increase efficiency. Saving time, reducing errors, and improving consistency across the team, Jaabir has a genuine passion for problem-solving. His ideas are not only innovative but impactful. "
        },
        {
            "text": "Jaabir is deaf and requires additional accessibility considerations. Supported by an interpreter, he ensures complex technical information is conveyed accurately in both directions, not allowing this to be a barrier to his success. "
        },
        {
            "heading": 2,
            "text": "Supportive teams "
        },
        {
            "text": "The Makers Apprenticeship awards not only recognise rising stars on their apprenticeship journey but are an opportunity to celebrate the supportive teams around them, the colleagues who offer advice, cheerlead, and guide apprentices through any challenges.   "
        },
        {
            "text": "Stella won Line Manager of the Year for her exceptional leadership, mentoring and unwavering commitment to supporting apprentices with their growth and contributing to team success.    "
        },
        {
            "text": "Annesa was awarded Mentor of the Year for her commitment to supporting apprentices beyond her direct line management responsibilities. As a former DevOps apprentice in DWP Digital, she acts as a role model to current apprentices, offering guidance on portfolios and providing technical advice.   "
        },
        {
            "text": "Annesa is dedicated to inspiring others into pursuing a tech career, regularly holding one-on-one sessions, answering questions on LinkedIn and speaking at events. She shares her journey of having no prior experience in technology, just an interest and a positive attitude for learning. She is generous with her time to encourage those curious about working in technology to follow their passions. "
        },
        {
            "heading": 2,
            "text": "Congratulations "
        },
        {
            "text": "To get more articles like this, subscribe to our newsletter. "
        }
    ]
}