{
    "url": "https://gds.blog.gov.uk/2025/02/14/joining-gds-as-a-junior-site-reliability-engineer-radhas-story/",
    "title": "Joining GDS as a Junior Site Reliability Engineer: Radha's story",
    "authors": [
        "Radha Kotyankar - Site Reliability Engineer, Government Digital Service"
    ],
    "categories": [
        "People and skills"
    ],
    "pub_date": "2025-02-14T14:45:53+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Life before GDS"
        },
        {
            "text": "I started my career in teaching and moved gradually into the corporate world. "
        },
        {
            "text": "I had worked as a software tester but when I came to the UK I had to give up my job for family reasons. I was a stay-at-home mum for quite some time before I joined the workforce again."
        },
        {
            "heading": 2,
            "text": "DevOps bootcamp"
        },
        {
            "text": "I realised when I got back into software testing that things had changed quite a lot since I first worked in the field. So I thought it would be good to try something different. That's why I joined the DevOps bootcamp in July 2022, where I achieved AWS cloud practitioner certifications over 12 weeks."
        },
        {
            "text": "Following this, I applied for a role at GDS  as a Junior Site Reliability Engineer on GOV.UK Pay."
        },
        {
            "heading": 2,
            "text": "Gradual learning"
        },
        {
            "text": "At the beginning everything was new including writing git commands."
        },
        {
            "text": "I completed a lot of self-learning using training videos, and the support of my team. It would have been impossible to be where I am today without them!"
        },
        {
            "text": "In the early days I mostly worked on package updates but in the background I was learning basic but essential skills: using git, how to push code to github, how to use the command line interface - it seems simple now!"
        },
        {
            "text": "Gradually I  took on more challenging work including creating dashboards for metrics in the Prometheus tool."
        },
        {
            "text": "The team has always asked, \"what would you like to do next?\" and \"how much more would you like to try?\" encouraging me to push myself and giving me the support that I need to succeed."
        },
        {
            "heading": 2,
            "text": "Moving to a more senior role"
        },
        {
            "text": "As part of the rotation for my programme, I then moved to GOV.UK Forms. Moving to a more senior role wasn't straightforward as I had to develop a set of skills to be able to develop into a mid-level role, but the team’s work always gave me scope to learn something different."
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "In future I'd like to get involved in more challenging projects to develop my skills and opportunities further. At the moment I'm also doing the senior leadership apprenticeship so I am practicing those skills in my current role. It’s a really broad programme covering finance, change management, and leadership over a 2-year period."
        },
        {
            "heading": 2,
            "text": "Challenge and progress"
        },
        {
            "text": "I think GDS is one of the best places I've ever worked. Although I found things challenging when I first arrived, my team were brilliant. Their help and patience was so important in helping me to settle in. I would recommend anybody who is thinking of a career in the UK government or GDS to apply."
        }
    ]
}