{
    "url": "https://icsdigital.blog.gov.uk/2025/02/14/new-year-new-job/",
    "title": "New year, new job?",
    "authors": [
        "Nindy Scott"
    ],
    "categories": [
        "People and recruitment",
        "Skills and development",
        "User-centred design"
    ],
    "pub_date": "2025-02-14T15:45:01+00:00",
    "content": [
        {
            "text": "Little is good, so bigger must be better.  If you’re looking for a new role, you may have noticed that we’re recruiting for many user-centred design roles at the moment.  If you haven’t, check them out on Civil Service Jobs or through our Linkedin pages."
        },
        {
            "text": "We’ll be looking for business analysts, user researchers, content designers and service designers at various grades over the coming months."
        },
        {
            "text": "Those successful will be joining a small and established team of UCD professionals who work on phases of projects (from discovery to live), building services and products for DESNZ and DSIT.  "
        },
        {
            "text": "While we all sit within one team, on a day-to-day basis, we work on different projects, sometimes together and sometimes with external contractors or a mix of both. "
        },
        {
            "text": "We work with policy teams to build services that will help them deliver their policy. Whether that’s creating eligibility checkers for our funding schemes or reporting and management tools to make sure that things are working as they should be. When you’re supporting at three main business areas, there’s always something interesting where we can add value."
        },
        {
            "text": "Apprenticeship week"
        },
        {
            "text": "We can’t just let a week like apprenticeship week pass by.  There’s already so much going on across government around this. Check out https://nationalcareers.service.gov.uk/national-apprenticeship-week"
        },
        {
            "text": "Within the civil service, we have many great opportunities for apprenticeships and similar learning as you work schemes like summer internships. What you may not know, is that apprenticeships are on offer once you’re in a role too."
        },
        {
            "text": "Within our own team, our lead user researcher is doing a chartered management degree apprenticeship (CMDA). Here’s what she has to say about taking on an apprenticeship while working:"
        },
        {
            "text": "“I have always been passionate about leadership and management, and I wanted to gain a deeper understanding of how to effectively lead team and drive business need successfully. The CMDA apprenticeship offered the perfect combination of academic learning and workplace experience. "
        },
        {
            "text": "Rather than studying in isolation, I could apply my learning directly to my role, ensuring that I develop practical skills alongside theoretical knowledge. The opportunity to gain a Chartered Manager status at the end of the programme was a huge incentive.  "
        },
        {
            "text": "There are several benefits of being an apprentice such as the opportunity to apply learnings to work-based scenarios, making it more relevant and impactful. Engaging with fellow apprentices has expanded my network providing me with valuable insight and support throughout my journey.  "
        },
        {
            "text": "The CMDA apprenticeship has transformed both my mindset and my approach to work. I have become more confident in taking on leadership responsibilities, making strategic decisions, and driving improvements in my team. "
        },
        {
            "text": "Additionally, the ability to balance work, study, and personal life has improved my time management resilience. I now feel better equipped to contribute meaningfully to my team and inspire others on their professional journey."
        },
        {
            "text": "Choosing the Chartered Management Degree Apprenticeship (CMDA18) has been one of the best decisions I have made for my career. It has provided me with invaluable knowledge, practical skills, and a pathway to professional recognition. I would like to also appreciate my line manager for her continuous and consistent support."
        },
        {
            "text": "For anyone considering an apprenticeship, I would highly recommend exploring this route, as it offers a fantastic opportunity to grow and succeed while actively working in your role. If you have any questions or are considering a similar journey, feel free to reach out ICS Apprenticeship Network and to me, I would love to share more about my experience.”"
        }
    ]
}