{
    "url": "https://insidehmcts.blog.gov.uk/2025/02/14/transforming-justice-giving-children-a-voice-in-the-family-courts/",
    "title": "Transforming justice, giving children a voice in the family courts",
    "authors": [
        "Peter Curran"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services",
        "User experience and research"
    ],
    "pub_date": "2025-02-14T15:27:51+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Disputes amongst families can be some of the most challenging issues heard in a court. When people are pitted against each other, it can be difficult to remember what’s best for children. For victims of domestic violence court proceedings can add stress at an already traumatic time."
        },
        {
            "heading": 2,
            "text": "What is Pathfinder?"
        },
        {
            "text": "My court in Wales is part of the family Pathfinder pilot which launched in 2022. New ways of working encourage a non-adversarial, out of court approach to resolve disputes about making arrangements for children. We do this by bringing together all the agencies involved in an application at the beginning of the process to ensure the court has the information it needs to reach a decision as soon as possible. This prioritises children and families and means applications are managed more effectively in line with recommendations published by the Private Law Advisory Group in 2020."
        },
        {
            "heading": 2,
            "text": "How does Pathfinder work to support families, children and victims?"
        },
        {
            "text": "When an application is made in a Pathfinder area in Wales, Cafcass Cymru or the local authority begins the investigative and assessment phase. Safeguarding information is gathered, and for applications where domestic abuse is an issue, the domestic abuse agency supporting Pathfinder makes an assessment. Cafcass meets with the child to explore their views and then with parties (who are usually the parents) to discuss the views of the child and help resolve differences. "
        },
        {
            "text": "At this early stage, children are asked about their preferences in relation to the proceedings, for example they’re asked whether they want to meet the judge, receive the court's decision by letter, or be informed by a parent. That information is added to a Child Impact Report which is filed within six weeks, providing information and recommendations for resolving the application. "
        },
        {
            "text": "Before the first hearing, a judge or legal adviser reviews the case to ensure the court has all the information needed to make a decision at the first hearing. Working in this way can help us resolve the case quickly, before Pathfinder, it took at least 24 weeks and two hearings to gather the information needed to make a decision. Bringing everyone involved in an application together earlier means we gather the information needed more efficiently and sometimes issues are resolved without the need for a hearing."
        },
        {
            "heading": 2,
            "text": "What happens if a case reaches a hearing?"
        },
        {
            "text": "Of course, there are times when a hearing is the only way to resolve a dispute and we now have Case Progression Officers to ensure parties are engaged and understand and follow the requirements of court orders. "
        },
        {
            "text": "When hearings are needed there’s no longer a “win or lose” adversarial approach. Instead, a judge or magistrate leads a discussion to help parents explore options, solve their own issues and reach a solution. More complex cases, like those involving domestic abuse, are case managed and dealt with in a way that’s appropriate to ensure an outcome that’s safe for everyone."
        },
        {
            "heading": 2,
            "text": "Working together to improve outcomes"
        },
        {
            "text": "So why is Pathfinder successful? It takes a holistic approach and focuses gathering information at the start of the process so that a decision can be made at the earliest opportunity."
        },
        {
            "text": "Agencies collaborate to provide information, often within challenging timescales and parents are supported to focus on their child and move away from the issues that contributed to their relationship breakdown. This is an important change and is key to whether a case can be resolved, it prevents further conflict between separating couples and reduces additional trauma for domestic abuse survivors. "
        },
        {
            "text": "The commitment and dedication of the professionals involved in the Pathfinder has reduced the average time to resolve private law applications from 29 weeks in the 12 months to February 2022 to an average of 18 weeks in the 12 months to November 2024 in North Wales  which is much better for everyone involved. I’m proud to work in a Pathfinder court and looking forward to seeing other family courts follow in our footsteps.    "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Trawsnewid cyfiawnder, rhoi llais i’r plant yn y llysoedd teulu"
        },
        {
            "text": "Gall anghydfodau ymysg teuluoedd fod yn un o’r problemau mwyaf heriol y gellid dod ar eu traws mewn llys. Pan fydd pobl am yddfau ei gilydd, gall fod anodd cofio beth sydd orau i’r plant. Yng nghyd-destun dioddefwyr trais domestig, gall achosion llys ychwanegu straen at sefyllfa sydd eisoes yn drawmatig."
        },
        {
            "heading": 2,
            "text": "Beth yw’r Cynllun Braenaru?"
        },
        {
            "text": "Mae fy llys i yng Nghymru yn rhan o’r cynllun peilot Braenaru a lansiwyd yn 2022. Mae ffyrdd newydd o weithio yn annog dull nad yw’n wrthwynebol, y tu allan i’r llys i ddatrys anghydfodau ynglŷn â gwneud trefniadau ar gyfer plant. Rydym yn gwneud hyn drwy ddod ynghyd yr holl asiantaethau sy’n rhan o gais ar ddechrau’r broses i sicrhau bod gan y llys yr wybodaeth y mae ei hangen arno i gyrraedd penderfyniad cyn gynted â phosib. Mae hyn yn blaenoriaethu plant a theuluoedd a golygir bod ceisiadau’n cael eu rheoli’n fwy effeithiol yn unol â’r argymhellion a gyhoeddwyd gan y Grŵp Cynghori ar Gyfraith Breifat yn 2020."
        },
        {
            "heading": 2,
            "text": "Sut mae’r Cynllun Braenaru yn gweithio tuag at gefnogi teuluoedd, plant a dioddefwyr?"
        },
        {
            "text": "Pan wneir cais mewn ardal Braenaru yng Nghymru, bydd Cafcass Cymru yn cychwyn ar y cyfnod ymchwilio ac asesu. Cesglir gwybodaeth ddiogelu, ac mewn ceisiadau lle mae cam-drin domestig yn broblem, bydd yr asiantaeth cam-drin domestig sy’n cefnogi’r Cynllun Braenaru yn gwneud asesiad. Bydd Cafcass yn cyfarfod â’r plentyn i gael ei farn ac yna’n cyfarfod â’r partion (y rhieni fel arfer) i drafod barn y plentyn a helpu i ddatrys eu gwahaniaethau.  "
        },
        {
            "text": "Yn ystod y cam cynnar hwn, gofynnir i’r plant am yr hyn sydd orau ganddynt mewn perthynas â’r achosion, er enghraifft, gofynnir iddynt p’un a ydynt eisiau cyfarfod y barnwr, cael penderfyniad y llys mewn llythyr drwy’r post, neu gael eu hysbysu gan riant. Ychwanegir yr wybodaeth honno at yr Adroddiad Effaith ar Blentyn a fydd yn cael ei ffeilio o fewn chwe wythnos, a fydd yn darparu gwybodaeth ac argymhellion er mwyn datrys y cais.  "
        },
        {
            "text": "Cyn y gwrandawiad cyntaf, bydd barnwr neu gynghorydd cyfreithiol yn adolygu'r achos i sicrhau bod gan y llys yr holl wybodaeth sydd ei hangen arno i wneud penderfyniad yn y gwrandawiad cyntaf. Gall gweithio fel hyn ein helpu i ddatrys yr achos yn gyflym, cyn cyflwyno’r Cynllun Braenaru, cymerodd o leiaf 24 wythnos a dau wrandawiad i gasglu'r wybodaeth a oedd ei hangen i wneud penderfyniad. Mae dod â phawb sy'n rhan o gais at ei gilydd yn gynharach yn golygu ein bod yn casglu'r wybodaeth sydd ei hangen arnom yn fwy effeithlon ac weithiau caiff materion eu datrys heb fod angen gwrandawiad."
        },
        {
            "heading": 2,
            "text": "Beth fydd yn digwydd pe bai achos yn cyrraedd gwrandawiad?"
        },
        {
            "text": "Wrth gwrs, mae adegau pan mai gwrandawiad yw’r unig ffordd o ddatrys anghydfod ac mae gennym bellach Swyddogion Cynnydd Achosion i sicrhau bod partïon yn ymgysylltu ac yn deall ac yn dilyn gofynion y gorchmynion llys."
        },
        {
            "text": "Pan fydd angen gwrandawiad, nid oes dull gwrthwynebol \"ennill neu golli\" mwyach. Yn hytrach, mae barnwr neu ynad yn arwain trafodaeth i helpu rhieni i archwilio opsiynau, datrys eu problemau eu hunain a dod i ddatrysiad. Mae achosion mwy cymhleth, fel y rhai sy'n ymwneud â cham-drin domestig, yn cael eu rheoli a'u trin mewn ffordd sy'n briodol i sicrhau canlyniad sy'n ddiogel i bawb.   "
        },
        {
            "heading": 2,
            "text": "Gweithio gyda’n gilydd i wella canlyniadau"
        },
        {
            "text": "Pam fod y Cynllun Braenaru mor llwyddiannus? Mae'n cymryd agwedd gyfannol ac mae’n canolbwyntio ar gasglu gwybodaeth ar ddechrau'r broses fel y gellir gwneud penderfyniad cyn gynted â phosibl."
        },
        {
            "text": "Mae asiantaethau'n cydweithio i ddarparu gwybodaeth, yn aml o fewn amserlenni heriol a chefnogir rhieni i ganolbwyntio ar eu plentyn a symud i ffwrdd o'r problemau a gyfrannodd at chwalu eu perthynas. Mae hwn yn newid pwysig ac mae'n allweddol i weld a ellir datrys achos, mae'n atal gwrthdaro pellach rhwng cyplau sydd wedi gwahanu ac mae’n lleihau trawma ychwanegol i oroeswyr cam-drin domestig. "
        },
        {
            "text": "Mae ymrwymiad ac ymroddiad y gweithwyr proffesiynol sy'n ymwneud â'r Cynllun Braenaru wedi lleihau'r amser cyfartalog i ddatrys ceisiadau cyfraith breifat o 29 wythnos yn y 12 mis hyd at fis Chwefror 2022 i gyfartaledd o 18 wythnos yn y 12 mis hyd at fis Tachwedd 2024 yng Ngogledd Cymru, sy'n llawer gwell i bawb sy'n cymryd rhan. Rwy'n falch o weithio mewn Llys Braenaru ac yn edrych ymlaen at weld llysoedd teulu eraill yn dilyn yr un trywydd.    "
        }
    ]
}