{
    "url": "https://earlyyears.blog.gov.uk/2025/02/14/when-do-you-need-to-notify-ofsted/",
    "title": "When do you need to notify Ofsted?",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2025-02-14T11:42:03+00:00",
    "content": [
        {
            "text": "We know that keeping children safe and happy is the biggest priority for all of you in the early years and childcare sector. Caring for young children in a safe environment helps them to develop the skills they need as they grow."
        },
        {
            "text": "The early years foundation stage (EYFS) sets out the requirements you must meet for learning, development and care. It is a statutory requirement that you notify Ofsted or your childminder agency of:"
        },
        {
            "text": "Last year we received 11,100 notifications from 7,850 providers."
        },
        {
            "text": "We have found that we are often notified about incidents we don’t necessarily need to know about. We know that notifying us takes time and can add to the pressure you are working under. So being sure whether you do need to notify us could save you time and relieve pressure."
        },
        {
            "text": "This blog will set out the types of information we need to know about to help you understand when it is appropriate to notify us."
        },
        {
            "text": "What you must tell us about"
        },
        {
            "text": "If you are an Ofsted-registered provider, you must notify us of any serious childcare incident within 14 days. This includes:"
        },
        {
            "text": "Our guidance gives more detail on the types of incidents you must tell us about and how to report them."
        },
        {
            "text": "You do not need to tell us about minor injuries such as animal and insect bites, or cuts and grazes. This is true even when hospital treatment is required, unless the child is admitted to hospital for more than 24 hours."
        },
        {
            "text": "What is a significant event?"
        },
        {
            "text": "A significant event is any change or incident that affects the suitability of the registered person, or anyone connected with your registration, to care for or be in regular contact with children."
        },
        {
            "text": "We do not need to know about everything, and you will need to use your judgement to determine whether to notify us. The greater the risk posed to children, the more likely it is you should tell us about it. To help you make this decision, we have listed some examples in our published guidance."
        },
        {
            "text": "Changes to health"
        },
        {
            "text": "A significant event may include a change to the health of the registered provider or those connected to your registration. We only need to know about changes that could impact on a person’s ability to care for or be in regular contact with children. This includes any long-term condition that affects their ability to walk, balance, bend, kneel or lift a child."
        },
        {
            "text": "You don’t need to tell us about changes to the health of managers or staff at an early years setting, as that is the provider’s responsibility."
        },
        {
            "text": "However, if a provider wishes to employ someone who is disqualified, or a member of staff becomes disqualified, that person must apply to us to waive disqualification.  They cannot work at the setting until a decision has been made. This is also the case if you, as a provider, become disqualified.  "
        },
        {
            "text": "Again, you need to tell us about changes to health or any other significant event as soon as reasonably practical and always within 14 days."
        },
        {
            "text": "What we do when we receive a notification"
        },
        {
            "text": "We know things can happen, despite all appropriate measures in place to keep children safe. Notifying us will not necessarily affect your registration. However, failure to notify us of a significant event without reasonable excuse is an offence."
        },
        {
            "text": "When we receive a notification, we will risk assess the information alongside the details we already hold about your registration. This helps us to decide what action, if any, we need to take. For example, we may contact you to discuss the notification, or carry out a regulatory visit or inspection."
        },
        {
            "text": "Changes to your registration"
        },
        {
            "text": "We also need to know about any changes to your registration details. This includes informing us of changes to your name, address or telephone number, the address where childcare is provided, working hours and the number of children you look after. You also need to contact us regarding any change to the legal entity of your registered body. You can do this by emailing enquiries@ofsted.gov.uk from the email address you have registered with us and giving your URN. You must also let us know about changes to people connected to your childcare. If you are registered on the Early Years Register, the relevant EYFS sets out the full list of changes that you must notify us about. Providers registered on the Childcare Register must follow the relevant Childcare Register requirements."
        },
        {
            "text": "The Ofsted early years team will be at the Childcare Expo in Olympia, London, on 28 February and 1 March 2025. If you have any questions, please come and speak to them."
        }
    ]
}