{
    "url": "https://earlyyears.blog.gov.uk/2025/05/22/applying-to-register-with-ofsted-what-you-need-to-know/",
    "title": "Applying to register with Ofsted: what you need to know",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Childminder registration",
        "Registration"
    ],
    "pub_date": "2025-05-22T10:18:38+01:00",
    "content": [
        {
            "text": "Whether you’re thinking about registering with Ofsted or are in the process of submitting your application, this blog post aims to help you understand the registration process and the actions you need to take."
        },
        {
            "text": "Before you begin your application, you need to determine the type of childcare you intend to provide. You need to register with Ofsted unless you’re exempt from registration or you’re going to register with a childminder agency."
        },
        {
            "text": "Below is a useful flowchart to help you determine what type of provider you should apply to register as. You can contact your local authority early years team if you want advice:"
        },
        {
            "heading": 2,
            "text": "Which register should I join?"
        },
        {
            "text": "To understand which register you should join, first consider the ages of the children you plan to care for. It is completely up to you whether you join one or more registers, depending on what type of childcare you want to provide."
        },
        {
            "text": "If you plan to care for children aged from birth to the 31 August after their fifth birthday, you’ll need to register on the Early Years Register and meet the requirements of the early years foundation stage (EYFS) statutory framework."
        },
        {
            "text": "If you plan to care for children from 1 September after the child’s fifth birthday up until their eighth birthday, you’ll need to register on the compulsory part of the Childcare Register."
        },
        {
            "text": "If you plan to provide care for children that does not require registration, for example if you’re becoming a nanny, then you can register on the voluntary part of the Childcare Register.   "
        },
        {
            "text": "If you’re registering on the Childcare Register, whether that’s the compulsory or voluntary parts, you’ll need to follow the relevant requirements for the type of care you intend to provide."
        },
        {
            "text": "Our registration manual, Childminders and childcare providers: register with Ofsted, gives some examples of different types of care and register combinations."
        },
        {
            "heading": 2,
            "text": "Which registration form should I complete?"
        },
        {
            "text": "It’s important to use the correct form to complete your application. Which registration service you use will depend on the provider type you are applying to register as. To apply to operate as:"
        },
        {
            "text": "Each form contains links to further guidance to help you with your application."
        },
        {
            "heading": 2,
            "text": "What information will I need to complete the form?"
        },
        {
            "text": "You need to supply us with information to help us process your application and determine how suitable you are to provide childcare. It’s important to supply this information as early as possible to avoid delays to your application."
        },
        {
            "text": "As an example, if you’re applying to register as a childminder you’ll need: a valid DBS certificate for yourself and anyone living or working with you; first aid training for the age group you intend to look after; a completed health declaration form; and contact details of 2 references (one of which must be from your most recent childcare employer). We also need details of the setting, your address history and any previous registrations you have held with Ofsted or a childminder agency."
        },
        {
            "text": "If you’re applying to register a nursery or other daycare, we’ll send you an invoice with details of your application fee. Please pay the fee as quickly as possible to avoid delays."
        },
        {
            "text": "You can find more details on the information we require at the point of application for your type of child care at: Early years and childcare registration."
        },
        {
            "heading": 2,
            "text": "How long will it take to process my application?"
        },
        {
            "text": "If you're applying to register on the Early Years Register, once you’ve submitted your application form we’ll contact you to let you know whether we can accept it. We will usually phone you but we may try by email if we are unable to reach you."
        },
        {
            "text": "During this call, we’ll confirm that you understand the type of service you are registering and outline what to expect. Where applicable, we’ll also schedule a registration visit with you. This will usually be 8 weeks after we’ve accepted your application."
        },
        {
            "text": "Once we’ve confirmed that your form has been accepted, we will give you a unique reference number (URN) and start to carry out suitability checks."
        },
        {
            "text": "If you’re already known to us, for example if you’ve been registered before, we may not need to schedule a registration visit during the initial call. This is because we have already carried out suitability checks on you and therefore it’s likely a registration visit can be organised earlier than 8 weeks. We will contact you to confirm this.  "
        },
        {
            "text": "We aim to complete applications within:"
        },
        {
            "text": "These timescales apply from the point at which we confirm your application has been accepted."
        },
        {
            "text": "If we need to carry out further checks, we’ll contact you to request these – and it may result in a longer timescale."
        },
        {
            "heading": 2,
            "text": "Will I receive updates on my application?"
        },
        {
            "text": "We’ll keep in touch with you throughout the process."
        },
        {
            "text": "You do not need to contact us to chase your application. Please only contact us by email to make a change to your application or to send us any information we’ve requested. You can do this via enquiries@ofsted.gov.uk from the email address you have registered with us.  "
        },
        {
            "text": "Our guidance Childcare: application review provides further details on what to expect while your application is under review."
        },
        {
            "heading": 2,
            "text": "What to look out for when submitting your application"
        },
        {
            "text": "It’s important to have the required information ready when you begin your application. If we receive an incomplete form, we’ll return it to you and this may cause delays to your application."
        },
        {
            "text": "To avoid delays, here are some key points to consider when submitting your application:"
        },
        {
            "heading": 2,
            "text": "Adding a setting to your registration"
        },
        {
            "text": "If you’re already registered with Ofsted and want to add an additional setting to your registration, you must apply to register the new premises. You can do this through our service: Add another setting to your nursey or other daycare organisation (EYS). "
        },
        {
            "text": "We need to approve any additional setting before you can begin operating from it. We may need to complete an approval visit at the new premises or do an inspection at one of your existing settings before we can make an approval decision. You’ll also need to pay an approval and annual fee for each setting."
        }
    ]
}