{
    "url": "https://naturalengland.blog.gov.uk/2025/05/22/aston-rowant-national-nature-reserve-kew-millenium-seed-bank-sowing-seeds-for-natures-recovery/",
    "title": "Aston Rowant National Nature Reserve & Kew Millennium Seed Bank: Sowing Seeds for Nature’s Recovery",
    "authors": [
        "Mick Venters"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "National Nature Reserve",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Parks, trails and nature reserves",
        "Science and evidence",
        "Species recovery",
        "Tree Planting",
        "Wildlife"
    ],
    "pub_date": "2025-05-22T11:55:30+01:00",
    "content": [
        {
            "text": "By Mick Venters, Senior Reserve Manager at Aston Rowant NNR, Natural England."
        },
        {
            "text": "Aston Rowant National Nature Reserve (NNR) is a hidden gem in the Chiltern Hills, and I am fortunate to have spent over twenty years as the Reserve Manager here, looking after the habitats whilst welcoming visitors and volunteers to enjoy and care for this special place.  "
        },
        {
            "text": "In this post, I want to share why the Reserve is so important when we think about restoring nature and give you a sense of how we work in partnership with other organisations, such as our recent work with Kew Millenium Seed Bank."
        },
        {
            "text": "Let me begin with my personal ode to the Reserve:"
        },
        {
            "text": "The early morning sun casting long shadows over the hillside as the sheep rest peacefully. I am serenaded by a myriad of bird songs from the bushes and trees all around. Summer swallows glide overhead as my gaze is drawn to the patchwork of fields and villages of the Vale of Oxfordshire below. "
        },
        {
            "text": "This gentle landscape of the Chilterns in southern England fills me with a sense of belonging, a sense of home. "
        },
        {
            "heading": 4,
            "text": "Aston Rowant NNR’s role in Nature Recovery"
        },
        {
            "text": "NNRs were established to protect the country's most important habitats, species and geology, whilst also serving as places for scientific research.  Here at Aston Rowant the mix of chalk hills, scrubland (areas of low-growing bushes) and ancient woodland have thrived for hundreds of years and are home to many species that are rare or absent elsewhere in the country."
        },
        {
            "text": "Aston Rowant NNR is also a Site of Special Scientific Interest (SSSI) and Special Area of Conservation (SAC), containing one of the largest surviving areas of beech woodland, once widespread across the Chilterns, now fragmented by agricultural fields and urban development.  "
        },
        {
            "heading": 4,
            "text": "Working Together for Nature"
        },
        {
            "text": "Aston Rowant NNR has a long history of working in partnership with organisations like Chilterns National Landscape, Plantlife, National Trust, and Berkshire, Buckinghamshire, and Oxfordshire Wildlife Trust, to drive nature recovery."
        },
        {
            "text": "The Reserve is a perfect place for the public to enjoy and learn about nature conservation through activities such as local school trips, community events, and walking groups. We know that engaging with the community is key to delivering nature recovery and we cherish those local relationships."
        },
        {
            "heading": 4,
            "text": "Our Partnership with Kew’s Millenium Seed Bank"
        },
        {
            "text": "Recently, we’ve been working with scientists from Kew’s Millennium Seed Bank who have been out on the NNR collecting Wild Cherry tree seeds for conservation and research purposes. This is one of several ongoing conservation initiatives on the NNR, often unnoticed by most visitors. "
        },
        {
            "text": "That's why we’ve collaborated with the Royal Botanic Gardens, Kew to create a short film to showcase this essential work and raise awareness of the importance of our NNR for nature recovery."
        },
        {
            "text": "“The NNR at Aston Rowant really is a fantastic site and was a real pleasure to work within. By making these collections of cherry seed we hope to have been able to conserve seed that may be specifically adapted to the local environment here in the Chilterns, not only acting as a long-term safeguard to catastrophic events but also for potential use in the here and now, in scientific research or for possible use in future reintroductions."
        },
        {
            "text": " It really has been a great opportunity and a perfect illustration of the ongoing partnership between Kew and Natural England.”  - Owen Blake, UK Tree Seed Collecting Project Officer"
        },
        {
            "text": "Watch the film below to see the Wild Cherry seed collection in action at Aston Rowant (film by Nicola Schafer.)"
        },
        {
            "text": "Although Aston Rowant was established as an NNR nearly 70 years ago, researchers are still discovering new and unique species on the site, from fungi and insects to flowers and birds. "
        },
        {
            "text": "Our partnership with Kew, ensures we can continue to conserve rare species for future generations. In many ways the reserve is a time capsule, but I see it more as a living library of species ready to spread the good news story of nature recovery."
        },
        {
            "heading": 4,
            "text": "Why Partnerships Matter for Nature Recovery"
        },
        {
            "text": "By working together with Kew to collect tree seeds from our ancient woodland, we not only preserve these incredible species, but they may one day be used to restore damaged habitats, increase our resilience to climate change, and even contribute to medical research. "
        },
        {
            "text": "This collaboration is one example of what's possible when we unite behind a common goal: not only to preserve nature, but to help it thrive."
        },
        {
            "text": "Aston Rowant NNR is one of many NNRs across the country where partnership working is at the heart of driving long-term nature recovery. We understand that we cannot achieve this goal alone, which is why our mission of ‘Building Partnerships for Nature’s Recovery’ remains more vital than ever. "
        },
        {
            "text": "Together we can create a brighter future for our natural world."
        },
        {
            "heading": 4,
            "text": "Visit and Get Involved"
        },
        {
            "text": "To discover more about Aston Rowant NNR and volunteering opportunities, please visit Oxfordshire's National Nature Reserves - GOV.UK and click on ‘Aston Rowant’"
        },
        {
            "text": "To learn more about the mission to protect the world's biodiversity, visit Millennium Seed Bank | Kew. 2025 marks the 25th anniversary of the seed bank and since its inception in 2000, nearly 2.5 billion seeds from more than 40,000 wild plant species have been banked."
        }
    ]
}