{
    "url": "https://defrafmp.blog.gov.uk/2025/05/22/cuttlefish-action-plan-supporting-the-channel-demersal-nqs-fishery/",
    "title": "Cuttlefish Action Plan - supporting the Channel demersal NQS fishery",
    "authors": [
        "Callum Williams - Principal Fisheries Manager, Marine Management Organisation",
        "Laura Lovett - Fisheries Manager, Marine Management Organisation"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-05-22T09:40:32+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) has launched an action plan for the cuttlefish fishery in ICES areas 7d and 7e.   "
        },
        {
            "text": "The development of an action plan was proposed in the Channel demersal non-quota species (NQS) fisheries management plan (FMP) because the cuttlefish fishery is of high economic importance, has a potential risk of exploitation and doesn’t have a formal ICES stock assessment determining levels of sustainability.  "
        },
        {
            "text": "The plan focuses on restoring or maintaining the stock at sustainable levels and delivering benefits for future generations, whether they are environmental, social, or economic. It will help us pinpoint where more evidence is required and enhance monitoring and data collection to guide future management decisions. "
        },
        {
            "heading": 2,
            "text": "Key actions from the plan are:  "
        },
        {
            "text": "Find the full Cuttlefish Action Plan on gov.uk (you’ll find a summary table of the goals and actions on page seven.) "
        },
        {
            "heading": 2,
            "text": "Stakeholder engagement to develop the FMP and Cuttlefish Action Plan "
        },
        {
            "text": "MMO started engaging with stakeholders in early 2024 to explore what should be included in the cuttlefish action plan.  "
        },
        {
            "text": "We started by holding a roundtable discussion with key stakeholders to look at the existing evidence base, views and opinions on the key issues of the cuttlefish fishery. This identified the need for a better understanding of the fishery.  "
        },
        {
            "text": "A roadshow followed which visited Newlyn, Brixham, Shoreham-by Sea and Hastings. This helped us to build on the initial findings and gather further understanding of views on the status of the fishery and the proposed management measures in the FMP. A questionnaire supported this to gather information from those that couldn't attend. "
        },
        {
            "text": "Thanks to all those involved in the development of the action plan so far. The views and opinions we collected were fed into both the development of the cuttlefish action plan and other measures which were proposed in the FMP.  "
        },
        {
            "heading": 2,
            "text": " Next steps  "
        },
        {
            "text": "We're planning a follow-up roundtable and after that, we'll hit the road to some key spots in the 7d/7e areas to share the progress from our action plan, including insights from evidence projects and market sampling. We'll also be gathering views on the latest roundtable discussion outputs and explore the potential for gear trials.  "
        },
        {
            "text": "Feedback we get from these will be crucial in shaping the focus and ongoing development of our action plan, which will keep evolving as we learn more about the fishery. "
        },
        {
            "text": "To get involved, please contact us at fmp@marinemanagement.org.uk for more details. "
        },
        {
            "text": "Find the published FMP at Channel demersal non-quota species fisheries management plan (FMP) - GOV.UK "
        }
    ]
}