{
    "url": "https://ipo.blog.gov.uk/2025/05/22/eye-p-protection/",
    "title": "Eye-P Protection",
    "authors": [
        "Sara Jones",
        "Christina Watts"
    ],
    "categories": [
        "Enforcement",
        "Innovation",
        "Patents"
    ],
    "pub_date": "2025-05-22T10:33:00+01:00",
    "content": [
        {
            "text": "The sun coming out means it’s time to don one of my favourite accessories. As I reorganise my collection of shades, I can't help but marvel at how one pair is never enough. From classic tortoiseshells for everyday wear, to bold statement frames for weekend brunches, each pair of sunnies serves a distinct purpose in my seasonal wardrobe. "
        },
        {
            "text": "But have you ever wondered about the clever innovations that allow us to transform from squinting pedestrians to effortlessly cool individuals with a simple accessory? Behind those UV-protective lenses lies a fascinating story of British ingenuity, design evolution and intellectual property (IP) that spans centuries. "
        },
        {
            "heading": 3,
            "text": "Specs through time "
        },
        {
            "text": "While prehistoric Inuits crafted snow goggles with narrow slits to combat snow blindness, ancient Chinese judges used darkened glasses to hide their emotions during court proceedings. However, it was the British inventors who made some of the most significant contributions to sunglasses as we know them today. "
        },
        {
            "text": "The first documented instance of sunglasses came in 1752, when English optician James Ayscough experimented with tinted lenses in spectacles. Ayscough worked as an optician's apprentice while simultaneously establishing his shop in London. Though primarily known for his microscopes, Ayscough introduced spectacles with revolutionary double-hinged side pieces in c.1752 – the start of what we know today as sunglasses. "
        },
        {
            "text": "While Ayscough wasn't specifically focused on sun protection, he believed blue or green-tinted glass could potentially correct specific vision impairments and his work laid crucial groundwork for future innovations. While these early tinted lenses weren't yet the UV protective accessories we treasure today, they represented an important step in the evolution of protective eyewear. "
        },
        {
            "text": "It was another British pioneer, Sir David Brewster, who made a discovery in c.1815 that would transform sunglasses. While studying polarised light, Brewster determined the precise angle at which light on a reflective surface could be transmitted. This was previously known as plane-polarised but is now referred to as \"Brewster's Angle.\" This scientific principle underpins the polarised sunglasses that protect our eyes from glare today. "
        },
        {
            "heading": 3,
            "text": "Protected by patents"
        },
        {
            "text": "While we often focus on the stylish frames, some of the most valuable patents in the sunglasses industry relate to lens technology. Brewster's work on polarised light would later be applied practically when Edwin Land developed the first synthetic polarising materials in the 1930s. View one of Land’s patents for his polarising sunshades here [link]: US2005426A "
        },
        {
            "text": "The early 20th century saw sunglasses transition from medical devices to mainstream accessories. By the 1930s, sunglasses gained popularity when they were developed for pilots to combat high-altitude glare, birthing the iconic Aviator style - still one of the bestselling designs today. "
        },
        {
            "text": "The late 1960s and 1970s saw further innovations, with photochromic lenses that automatically darken in bright conditions. Since 1990, companies like Transitions Optical have built substantial patent portfolios around these technologies, with continuous improvements protected by intellectual property rights. They protect their products with patents such asUS12076951B2."
        },
        {
            "text": "UK optical companies have continued this tradition of innovation, securing patents for advancements in impact resistance, UV protection, scratch-resistant coatings, and even smart technologies. Patents such as GB1520099A demonstrate how intellectual property protection encourages the ongoing development of safer, more effective eyewear that protects our vision whilst complementing our style. "
        },
        {
            "heading": 3,
            "text": "Shady look-alikes  "
        },
        {
            "text": "Sunglasses are among the most frequently counterfeited products in the UK, so knowing how to identify authentic eyewear really matters! Beyond potentially missing the quality markers of genuine glasses, counterfeits may lack proper UV protection certification, putting your eyes at risk while giving a false sense of security."
        },
        {
            "text": "This month, £6 million worth of sunglasses, perfume and trainers were seized in Manchester by Rochdale Neighbourhood Policing Team, alongside Rochdale Trading Standards and Greater Manchester Police, in a huge effort to stamp down on criminals selling counterfeits. "
        },
        {
            "text": "Getting the real deal is important, not only for your eye protection but to ensure you’re getting good value for your hard-earned cash. When adding to your collection look out for: "
        },
        {
            "heading": 3,
            "text": "The perfect finishing touch "
        },
        {
            "text": "So next time you reach for your favourite pair of sunnies, appreciate the layers of innovation and IP protection that make them possible. From historical tinted lenses to today's high-tech eyewear, sunglasses showcase how our IP system encourages creativity and investment in the everyday items we love. "
        },
        {
            "text": "After all, whether you're relaxing in the park, driving along the coast, or simply trying to look effortlessly cool while grabbing a coffee, your sunglasses aren't just shading your eyes - they're showcasing centuries of protected British innovation at its finest.  "
        }
    ]
}