{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/05/22/fair-process-as-public-policy/",
    "title": "Fair process as public policy",
    "authors": [
        "Joe Tomlinson"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2025-05-22T12:00:00+01:00",
    "content": [
        {
            "text": "People are sensitive to how public services treat them. They evaluate whether the processes they experience are fair in a way that is distinct from the outcomes they may receive."
        },
        {
            "text": "In turn, people’s evaluation of whether processes in public services are fair can shape their attitudes and behaviours over time, including towards government more broadly."
        },
        {
            "text": "These attitudes and behaviours can then have large-scale impacts on society, as well as the capacity of government to deliver policy."
        },
        {
            "text": "For the last few years, my research group (Administrative Fairness Lab) has been striving to understand more about the public’s perceptions of fair process in the context of public services."
        },
        {
            "heading": 2,
            "text": "Being treated fairly is personal"
        },
        {
            "text": "It’s helpful to make this more concrete."
        },
        {
            "text": "Imagine a person with a disability who is in part-time work. They rely on support through the benefits systems, must have regular healthcare appointments, and are entitled to a range of other forms of support and exemptions from the government."
        },
        {
            "text": "If this person were to perceive that benefits or healthcare processes were persistently treating them unfairly (even if they were ultimately getting the benefits and healthcare they were entitled to) it is likely to affect their attitudes and behaviours towards these and other services."
        },
        {
            "text": "They might, for instance, be less willing to reach out to these services, take up other entitlements they ought to have access to, or be less engaged when those services ask for something to be done."
        },
        {
            "text": "In turn, this can reduce the capability of services to effectively deliver."
        },
        {
            "heading": 2,
            "text": "The consequences of perception"
        },
        {
            "text": "There are many reasons why it is important to understand if this theory plays out in reality."
        },
        {
            "text": "Given the millions of interactions between individuals and public services every day, the potential scale of these effects is significant and diverse."
        },
        {
            "text": "At the same time, it is often suggested that - while many do - many services are perceived by users as not implementing fair processes."
        },
        {
            "text": "It is also common to see a (well-intentioned) assumption that people focus on outcomes, not processes, when accessing public services. While it is true that outcomes matter, public service processes are more than just a mechanism to get somebody the outcome they are entitled to as efficiently as possible."
        },
        {
            "heading": 2,
            "text": "Fair policing"
        },
        {
            "text": "There is one field where this theory has been widely proven: frontline policing."
        },
        {
            "text": "Following the pioneering work of Tom Tyler, there is now ample evidence that frontline police officers play a crucial role in shaping public perceptions of the legal system."
        },
        {
            "text": "The way police treat individuals during encounters - whether fairly, respectfully, and without bias- influences people's willingness to comply with the law. When individuals feel that police officers are procedurally fair, they view them as more legitimate authorities. This legitimacy increases voluntary compliance with laws, as people obey not out of fear of punishment but because they trust the system and believe it is just."
        },
        {
            "text": "This approach obviously has systemic benefits not only for society but for government; it is premised on a less resource-intensive form of policing."
        },
        {
            "heading": 2,
            "text": "Improving the NHS"
        },
        {
            "text": "There is also growing evidence for this theory in other areas, such as healthcare."
        },
        {
            "text": "Studies have linked, for instance, perceptions of fair process in treatment with higher levels of adherence to medical advice and also to better results in weight management programmes."
        },
        {
            "text": "Most of these studies have been done in the US, but in the UK, the NHS is one of the most significant points of interaction between the public and public bodies, and administrative processes are too often an afterthought."
        },
        {
            "text": "Take, for instance, GP’s booking appointments. In 2023, NHS England estimated that general practice delivered 353 million appointments across the year, but appointment booking processes are of highly variable quality, often leaving people frustrated."
        },
        {
            "text": "There are grounds to think increasing perceptions of procedural fairness in systems like these could be good for health outcomes and good for the NHS overall."
        },
        {
            "heading": 2,
            "text": "Willingly paying into the system"
        },
        {
            "text": "Tax researchers have also found evidence to support this theory."
        },
        {
            "text": "Seeking to explore the potential of alternatives to direct enforcement approaches, researchers across the world have become increasingly interested in how voluntary adherence to tax rules can be increased and whether reform that increases perceptions of procedural fairness could achieve this."
        },
        {
            "text": "One leading study found that taxpayers who believed that they were treated fairly and respectfully by tax authorities were more likely to perceive the tax system as legitimate. This perception of legitimacy, in turn, was a significant predictor of voluntary tax compliance. Moreover, these people were more willing to comply with tax laws, even in the absence of direct enforcement or penalties. Conversely, when taxpayers felt unfairly treated, they were more likely to resist compliance."
        },
        {
            "heading": 2,
            "text": "Helping people back to work"
        },
        {
            "text": "We have been conducting a large study of perceptions of claimants’ perceptions of fair process in Universal Credit, which has been funded by the Nuffield Foundation."
        },
        {
            "text": "As part of this work, we have developed a better understanding of what fair process means in this context."
        },
        {
            "text": "Moreover, we have found associations between perceptions of fair process and a range of important behavioural and attitudinal outcomes amongst claimants."
        },
        {
            "text": "We found that perceptions of fair process were positively associated with claimants being willing to share information and cooperate with the DWP, being willing to complain or appeal, and having a positive relationship with work. In relation to the latter, claimants who perceive they have been subject to fair processes were more likely to report that the Universal Credit system helped them to feel more confident about finding a job or better-paid work, has raised their long-term work-related ambitions, and increased their motivation to leave Universal Credit by finding a job or better-paid work."
        },
        {
            "text": "Further work is required to evidence these links but initial evidence points to how fair process can help and hinder the effective implementation of some of Universal Credit’s central policy goals."
        },
        {
            "heading": 2,
            "text": "Process design must be part of policymaking"
        },
        {
            "text": "There is much more we need to understand about the effects of fair process in public services, and this discussion raises a host of complex questions about how such perceptions are formed across different settings."
        },
        {
            "text": "But we are at a point where we should be starting to think differently about fair process in public services and what value it has."
        },
        {
            "text": "Far too often, public bodies draw too sharp of a line between law-making/policymaking and the processes designed to allow people to access the benefits of those laws and policies. This typically reduces user design to narrow questions of implementation."
        },
        {
            "text": "Our research, and the research of others, suggests fair process in public services has important substantive effects and, in this way, ought to be seen as part and parcel of substantive social and economic policy."
        },
        {
            "text": "Viewed from this perspective, achieving greater alignment between the procedural fairness expectations of the public and the delivery of government should be central to law-making, policymaking, and attempts to increase the capacity of government to deliver transformative change."
        }
    ]
}