{
    "url": "https://valuationoffice.blog.gov.uk/2025/05/22/how-we-value-nurseries/",
    "title": "How we value: nurseries",
    "authors": [
        "Justin Allen - National Valuation Lead"
    ],
    "categories": [
        "Business Rates",
        "How We Value"
    ],
    "pub_date": "2025-05-22T09:23:34+01:00",
    "content": [
        {
            "text": "There are around 12,500 nurseries, made up of day nurseries, pre-schools and other daycare facilities, across England and Wales, providing care, support and early education to children up to 5 years old."
        },
        {
            "text": "The Valuation Office Agency (VOA) is responsible for calculating their rateable values."
        },
        {
            "heading": 2,
            "text": "Rateable value vs business rates"
        },
        {
            "text": "A property’s rateable value is not the same as its business rates bill."
        },
        {
            "text": "Rateable values are estimates of the annual rent a property could reasonably be expected to generate on a date set in law, known as the Antecedent Value Date (or AVD). "
        },
        {
            "text": "Local councils use these values to calculate business rates bills. They do this by multiplying the rateable value by an agreed multiplier and then applying any rate reliefs or exemptions a property qualifies for."
        },
        {
            "text": "Reliefs and exemptions do not affect rateable values, but they do affect how much you pay in business rates. Nurseries in Wales are eligible for Small Business Rates Relief."
        },
        {
            "heading": 2,
            "text": "The valuation method"
        },
        {
            "text": "Like most other business properties, nurseries are valued using the rental comparison method."
        },
        {
            "text": "For properties valued using this method we collect a representative sample of real rental prices across the sector."
        },
        {
            "text": "This information helps us get a sense of the rental market, but rent paid will not always equal a property’s rateable value."
        },
        {
            "text": "This is because:"
        },
        {
            "text": "To account for this we use a measure, known as a unit of comparison. This helps us make sure we value all nurseries fairly and consistently."
        },
        {
            "heading": 2,
            "text": "Unit of comparison"
        },
        {
            "text": "As our valuations are based on rental evidence above all else, the unit of comparison we use doesn’t generally impact the rateable value. But it does help to ensure rateable values are as accurate as possible."
        },
        {
            "text": "For the 2026 revaluation, the unit of comparison for nurseries is a price per square metre. We use all the evidence we have collected to set it. We multiply this by the size of the property to calculate its rateable value."
        },
        {
            "text": "We also consider the individual features of each property, looking at factors like how the building is designed and used. We do this to account for variation in the sector, as nurseries occupy a wide range of different buildings such as industrial properties and converted commercial spaces."
        },
        {
            "heading": 2,
            "text": "Location"
        },
        {
            "text": "In any area, the specific location of a nursery is key in determining rental value, and valuations will naturally differ between areas."
        },
        {
            "text": "Usually, nurseries in prime locations – for example in or near city centres, or close to major employers, like hospitals - will be able to charge higher fees, therefore attracting the highest rents. At the other end, nurseries in areas with less demand tend to charge less, with lower rental values."
        },
        {
            "heading": 2,
            "text": "Looking ahead: Revaluation 2026"
        },
        {
            "text": "The next business rates revaluation is due to come into effect on 1 April 2026. It will be based on property values as of 1 April 2024."
        },
        {
            "text": "Changes in rateable values will be primarily driven by changes in the property market since the last revaluation was carried out, regardless of whether these go up or down."
        },
        {
            "text": "To view your current rateable value, check the details we hold about your property and receive notifications about future valuations, register for a Business Rates Valuation Account."
        }
    ]
}