{
    "url": "https://educationhub.blog.gov.uk/2025/05/teacher-pay-everything-you-need-to-know-about-the-2025-pay-award/",
    "title": "Teacher pay: everything you need to know about the 2025 pay award",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Breaking news",
        "Schools",
        "Teacher pay"
    ],
    "pub_date": "2025-05-22T16:39:45+01:00",
    "content": [
        {
            "text": "The School Support Staff Negotiating Body (STRB) is an independent group that makes recommendations on the pay of teachers and leaders in maintained schools in England and reports to the Secretary of State for Education and the Prime Minister. "
        },
        {
            "text": "Each year the STRB recommends a pay award based on different factors including the economy, school workforce data and evidence from organisations including the DfE, employers, and the teaching unions. "
        },
        {
            "text": "The government then considers the recommendations in depth and makes a decision on what pay award teachers receive for the coming year. "
        },
        {
            "text": "Here’s everything you need to know about teacher pay. "
        },
        {
            "heading": 3,
            "text": "Are teachers getting a pay rise this year? "
        },
        {
            "text": "The STRB recommended a pay award of 4% and this has been accepted in full by the Education Secretary, reflecting the crucial role teachers play in breaking the link between background and success for pupils. "
        },
        {
            "text": "The 4% pay award would see pay packets increase by over £1,900 for the average classroom teacher, which would take the median salary for 2025/26 to over £51,000 a year. "
        },
        {
            "heading": 3,
            "text": "Will teachers at all schools receive the pay award? "
        },
        {
            "text": "The pay award applies to maintained schools currently, but most academies also choose to follow the statutory pay arrangements in practice."
        },
        {
            "text": "Through the Children’s Wellbeing and Schools Bill, the government is legislating to ensure all teachers in academies as well as maintained schools can rely on a core pay offer and all schools can innovate to attract and retain the best talent."
        },
        {
            "heading": 3,
            "text": "Is the pay award fully funded? "
        },
        {
            "text": "This year’s pay award is backed by a significant investment of £615 million this financial year, on top of the £3.2 billion funding increase the government is already investing to support schools. "
        },
        {
            "text": "Like the rest of the public sector, schools will need to play their part in getting maximum value from every pound of public money. "
        },
        {
            "text": "Schools will be expected to find approximately the first 1% of pay awards through improved productivity and smarter spending to make every pound count.  "
        },
        {
            "text": "To support schools the government is providing a range of initiatives to help them cut the cost on things like energy and recruitment, as well as providing better banking solutions. "
        },
        {
            "text": "There are already examples of schools making savings and bringing costs down: the 400 schools who have already participated in the department’s new energy for schools offer will save 36% on average compared to their previous contracts. "
        },
        {
            "heading": 3,
            "text": "When will teachers receive their pay rise? "
        },
        {
            "text": "The pay award now goes through a period of consultation with unions and employers’ organisations. The school teachers' pay conditions (STPCD) which sets out teachers pay and conditions, will be updated ahead of the new academic year. This should remove the need for schools to backdate the pay award, meaning teachers can expect their updated salaries from September. "
        },
        {
            "heading": 3,
            "text": "Will school support staff get a pay rise? "
        },
        {
            "text": "The teacher pay award only applies to school teachers, but the additional funding schools will receive also takes into account the current 2025-26 pay offer for support staff, which is currently under negotiation. "
        },
        {
            "text": "Unlike teachers, most school support staff are currently employed on the pay and conditions of the National Joint Council (NJC) for Local Government Services. The NJC is a negotiating body made up of representatives from trade unions and local government employers. "
        },
        {
            "text": "We are committed to reinstating the STRB to give support staff like teaching assistants, caretakers and cleaners a stronger voice. The body will be tasked with establishing a national terms and conditions handbook, training, career progression routes, and fair pay rates for support staff. "
        },
        {
            "heading": 3,
            "text": "Will further education teachers get a pay rise?"
        },
        {
            "text": "The Department for Education does not set further education teacher pay. However, we are providing £160 million in the 2025-2026 financial year to support colleges and other 16-19 providers to address immediate priorities, including recruiting and retaining expert teachers in subject areas such as construction and manufacturing so more young people gain the skills need to deliver growth and the workforce of tomorrow. "
        },
        {
            "heading": 3,
            "text": "What else are you doing to ensure teaching is an attractive profession? "
        },
        {
            "text": "We are continuing to work alongside the sector to re-establish teaching as the attractive, expert profession it should be. "
        },
        {
            "text": "This includes investing hundreds of millions of pounds to offer tax free financial incentives and professional development to attract and keep the best and brightest teachers alongside targeted action to improve teachers’ workload and wellbeing. You can find out more about how we’re attracting and retaining the best teachers here.  "
        },
        {
            "text": "There are encouraging signs that this is working with two thousand more secondary school teachers training this year than last, a 25% increase in the number of people accepting teacher training places in STEM subjects, and more teachers forecasted to stay in the profession. "
        }
    ]
}