{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/01/24/sign-up-to-the-government-science-and-engineering-gse-profession/",
    "title": "Sign up to the Government Science and Engineering (GSE) Profession",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2024-01-24T10:14:58+00:00",
    "content": [
        {
            "text": "Get to know the GSE "
        },
        {
            "text": "We are a diverse cross-government group of around 10,000 members who are connected to science and engineering either by their role, skillset, or interests and are headed up by Professor Dame Angela McLean, the Government Chief Scientific Adviser.  "
        },
        {
            "text": "To become a member of the GSE Profession, sign up here. "
        },
        {
            "text": "What is the role of the Government Science and Engineering (GSE) Profession?  "
        },
        {
            "text": "Our vision is for a high-profile, proud and effective GSE Profession that attracts fresh talent and has a secure place at the heart of government decision-making.  "
        },
        {
            "text": "We have two key aims: "
        },
        {
            "text": "Our impact has strengthened government decision-making by developing the skills of our diverse science and engineering leaders, empowering them to excel in their respective fields. "
        },
        {
            "text": "What does the GSE Profession offer to its members?"
        },
        {
            "text": "Below is a flavour of the resources, support and opportunities that are available to our members and you can find out more details about our full offer here. "
        },
        {
            "text": "Your first stop is our monthly newsletter which signposts learning and other development opportunities and provides updates on science and engineering from members across government.  "
        },
        {
            "text": "As well as highlighting L&D opportunities across government, GSE has developed resources to support all our government colleagues, regardless of their background. We have developed products to: showcase the value of science and engineering across government, provide career guidance, development opportunities for scientists and engineers, and upskill all of government on how to access, understand and communicate science and engineering advice. "
        },
        {
            "text": "There are a range of events and activities available throughout the year. Coming up soon we have:  "
        },
        {
            "text": "We’re currently planning Science and Engineering Week and our biennial GSE conference. Join us from 8th to 17th March for a ten-day packed week celebrating science, technology, engineering and maths through insightful talks and events. Our GSE conference is a day to network with fellow members and hear from diverse speakers within the government, shedding light on the pivotal role of science and engineering in shaping government and policymaking. "
        },
        {
            "text": "Make sure you sign up for the profession to be the first to hear about these events and other upcoming opportunities. If you have any questions, get in touch: gse@go-science.gov.uk.  "
        }
    ]
}