{
    "url": "https://marinescience.blog.gov.uk/2024/01/24/the-power-of-plankton-advancing-our-understanding-of-the-role-and-value-of-plankton-as-marine-natural-capital/",
    "title": "The power of plankton: Advancing our understanding of the role and value of plankton as marine natural capital",
    "authors": [
        "Matthew M Holland",
        "Carolyn Graves",
        "Michelle Devlin",
        "Abigail McQuatters-Gollop",
        "Mike Best"
    ],
    "categories": [
        "adaptation",
        "biodiversity",
        "Climate Change",
        "mNCEA",
        "Monitoring",
        "Science"
    ],
    "pub_date": "2024-01-24T09:15:02+00:00",
    "content": [
        {
            "text": "In this new Marine Science blog, scientists from Cefas, the University of Plymouth, and Environment Agency discuss new research by the Pelagic Natural Capital project (PelCap), which is helping to monitor the impact of human activities on plankton health in our marine environment. The evidence generated will feed into Defra's Marine Natural Capital and Ecosystem Assessment Programme (mNCEA) helping policymakers to understand the value of plankton as an important source of marine natural capital."
        },
        {
            "heading": 3,
            "text": "What are plankton and why are they so important?"
        },
        {
            "text": "Often called ‘the drifters of the oceans’ due to their limited ability to propel themselves, plankton are a diverse collection of organisms including phytoplankton (plankton capable of photosynthesis), zooplankton (animal plankton), and bacterioplankton (bacteria). They range over many sizes, and whilst the majority are very small, and not able to be seen by the naked human eye, they also include large organisms such as jellyfish. As the base of the food web, plankton provide a crucial food source to many small and large animals like fish and whales. Phytoplankton are also critical for the global carbon cycle, helping to regulate carbon dioxide in the atmosphere, and through photosynthesis, generate around half of the world’s oxygen. Despite their small individual size, changes in plankton communities often operate across very large spatial scales, impacting the entire marine food web."
        },
        {
            "text": "Some human activities, particularly those which release greenhouse gases into the atmosphere, input nutrients into the ocean, or extract biomass from the ocean (e.g. fishing), can negatively impact the state of pelagic habitats and their ability to provide these ecosystems services. For example, rising temperatures and increased nutrient pollution have been linked to harmful algal blooms (HABs) that can have huge impacts on marine biodiversity, resulting in economic losses for the seafood industry and tourism."
        },
        {
            "text": "Because plankton are so sensitive to these pressures, this makes them useful indicators on the health and condition of the marine environment. Pelagic habitat assessments carried out to support the UK Government’s UK Marine Strategy and Environmental Improvement Plan 2023, and at a regional sea scale through OSPAR are used by governments to regulate human activities which negatively impact the marine environment. Observing and understanding changes to plankton abundance and community structure is therefore key to assessing the health of our marine environment."
        },
        {
            "heading": 3,
            "text": "What are some of the challenges in assessing the health of plankton?"
        },
        {
            "text": "Biodiversity indicators have a history of use in the assessment of marine mammals, seabirds, and fish; however, it has not been easy to integrate pelagic habitat indicators into a routine assessment process. Assessing pelagic habitats is complicated by the fact that it is difficult to divide up the open ocean into discrete geographic areas (since there are no clearly defined boundaries in the open ocean), limited data coverage (a significant proportion of UK waters are under-surveyed, particularly for zooplankton), and a lack of agreement on what constitutes a “healthy” state."
        },
        {
            "text": "Until recently, it has also been challenging to generate the necessary public and policy support to incorporate plankton and pelagic habitats into routine marine biodiversity assessments. This oversight has likely stemmed from a general lack of appreciation for the important ecosystem services plankton provide, since their contributions to water quality regulation, food webs and global climate are difficult to observe or understand. To help overcome some of these challenges, we now consider pelagic habitats in the context of the human dimension, representing a new way of thinking which is now central to all the work this expert group produces."
        },
        {
            "text": "What work is being done to better monitor and assess pelagic habitats?"
        },
        {
            "text": "The UK’s Pelagic Habitats Expert Group has developed an indicator that assesses changes in phytoplankton and zooplankton communities. This biodiversity indicator quantifies change in time-series of both plankton and environmental data to identify and understand changes in plankton community dynamics. It measures the functional diversity in the plankton community, through examining the abundance of groups of plankton that share a similar functional role within their environment. By assessing plankton as functional groups, rather than as individual species, we can identify important changes which can impact other components of the food web. This indicator has been used to assess pelagic habitat biodiversity status at the UK and OSPAR levels, and the outputs can help scientists and policymakers further their understanding of how the marine food web is changing in response to human pressures."
        },
        {
            "text": "“Plankton are the invisible glue that hold the web of life together in our seas, coasts, and estuaries, providing the crucial services that are critical to our marine natural capital. Our investigations under “PelCap” (as part of the mNCEA programme) are helping us to truly value this much unappreciated asset.”"
        },
        {
            "heading": 5,
            "text": "Mike Best, Marine Technical Advisor, Environment Agency and lead on the PelCap project"
        },
        {
            "text": "This indicator and our understanding have fundamentally evolved over the past 10 years through a series of EU and UK funded projects and this work is still ongoing as part of the Defra-funded Pelagic Natural Capital project, or PelCap for short. Over more than a decade of collaborative research, the Pelagic Habitats Expert Group has substantially progressed understanding of not only plankton functional diversity, but also how healthy plankton communities provide the essential ecosystem services, upon which we all depend."
        },
        {
            "text": "The expert group is now focusing on integrating this work into the marine arm of Defra’s flagship three-year Natural Capital and Ecosystem Assessment (NCEA) research and development programme. Marine (m)NCEA is delivering evidence, tools and guidance to integrate natural capital approaches into policy and decision making for marine and coastal environments. This will enable policymakers and decision makers to ensure that ecological, societal, and economic information about our marine environment is considered holistically."
        },
        {
            "heading": 3,
            "text": "What can pelagic habitat assessments tell us about the impact of human activities on the health of plankton?"
        },
        {
            "text": "Researchers from the UK and OSPAR member countries routinely assess long-term environmental monitoring datasets using indicators to inform the state of marine biodiversity. The Assessment of Pelagic Habitats for the new OSPAR Quality Status Report 2023 has used this indicator, as well as two others, to provide an assessment of pelagic habitats biodiversity, and for the first time in the context of human activities that impact plankton and pelagic habitats. This work also forms the basis for pelagic habitats assessment under the UK Marine Strategy."
        },
        {
            "text": "The main findings of the assessment were that pelagic habitats in the OSPAR Maritime Area have experienced widespread changes over the past 60 years, with a general pattern of decreasing phytoplankton and zooplankton abundance across mainly offshore areas of the Greater North Sea, Celtic Seas, and Bay of Biscay and Iberian Coast. These long-term trends have largely continued through 2015-2019, and are expected to continue, eventually impacting higher food web levels. Due to these widespread changes which have been linked to pressures generated by human activities, pelagic habitats in the Greater North Sea, Celtic Seas, and Bay of Biscay and Iberian Coast all have a status which is considered “not good”."
        },
        {
            "heading": 3,
            "text": "What's next for UK pelagic habitats and natural capital research?"
        },
        {
            "text": "Going forward, PelCap will continue to form an important component of Defra’s mNCEA programme, exploring in more depth the links between human activities and the impacts on the plankton community and the ecosystem services they provide. Valuing plankton through a ‘natural capital’ approach can help us understand the societal, cultural, and economic value of these goods and services to society. With Defra’s support, we will work to strengthen the UK’s capacity for pelagic habitats monitoring, conduct empirical research on how human pressures are impacting pelagic habitats, and generate science communication outputs to help promote the natural capital value of pelagic habitats to relevant stakeholders and the public. Finally, with the evidence and tools generated under the programme, we hope to help policymakers consider the costs and benefits associated with different conservation and management approaches to safeguard the health of our seas."
        },
        {
            "text": "“The Defra-funded PelCap project has made huge progress in advancing our understanding of plankton as remarkable organisms sustaining our seas. By looking through a ‘natural capital’ lens and understanding the value of plankton in supporting the goods and ecosystem services our ocean provides, we can make better decisions around the protection and management of our marine environment.”"
        },
        {
            "heading": 5,
            "text": "Professor Gideon Henderson, Chief Scientific Advisor at Defra"
        },
        {
            "text": "Authors: "
        }
    ]
}