{
    "url": "https://defralanduse.blog.gov.uk/2024/01/24/the-statutory-biodiversity-metric-what-it-means-for-biodiversity-net-gain-and-biodiversity-measurement/",
    "title": "The Statutory Biodiversity Metric: what it means for biodiversity net gain and biodiversity measurement",
    "authors": [
        "Mike Burke, Natural England Programme Director – Sustainable Development"
    ],
    "categories": [
        "BNG",
        "Land Use"
    ],
    "pub_date": "2024-01-24T09:16:06+00:00",
    "content": [
        {
            "text": "Guest blog by Mike Burke, Natural England Programme Director – Sustainable Development"
        },
        {
            "text": "Informed by 10 years of development work and extensive user testing, led by Natural England, Defra has now laid the statutory biodiversity metric (‘the metric’) before Parliament and the statutory biodiversity metric calculation tool has been published."
        },
        {
            "text": "\"Built on global best practices, many of the BNG Good Practice Principles are embedded into the metric and as a result, it is being used across the globe from Canada to the Middle East, from Brazil to Singapore.” - Tom Butterworth, Head of Ecology UK, WSP"
        },
        {
            "text": "What does a ‘statutory’ biodiversity metric mean for BNG? "
        },
        {
            "text": "When BNG becomes mandatory, developers must use the metric to demonstrate a net gain for all planning applications (unless exempt). Land managers supplying off-site units to such projects must also use this metric."
        },
        {
            "text": "\"The metric provides an evidence based and standardised way of accounting for habitat change scenarios. It’s a useful tool to communicate the value of nature to non-technical audiences. It enables the standardised measurement of habitat delivery on the ground in a way that has not been possible before.” - Steve Panks,  Principal Specialist Biodiversity Metrics Natural England"
        },
        {
            "text": "The use of a biodiversity metric does not replace existing ecological advice and expertise. It should be used in conjunction with advice from a competent person(s) commensurate with the scale and the impacts of the project. A competent person has the knowledge and skills to perform specified tasks to complete and review metric calculations."
        },
        {
            "text": "How does the statutory biodiversity metric work, and why does it matter?"
        },
        {
            "text": "The metric uses habitats as a proxy for biodiversity and calculates biodiversity value for the purposes of biodiversity net gain (BNG). Biodiversity value is calculated in standardised ‘biodiversity units.’"
        },
        {
            "text": "For developers, the metric helps you break down your site into easily managed parcels and see your gains and losses for each habitat parcel. It helps you make an informed decision in your approach to ensuring your development achieves a minimum 10% biodiversity net gain."
        },
        {
            "text": "Use of the metric better integrates BNG into scheme designs from site selection to outline design. It provides a transparent means of calculating when the net gain requirement has been met, including through the use of any off-site land."
        },
        {
            "text": "For landowners, the metric shows the current biodiversity value of your land. It shows how many off-site units you could produce through additional habitat creation or enhancement to sell to developers."
        },
        {
            "text": "It can also establish how many additional units you may have available to sell to developers should you choose to commence habitat creation or enhancement works in advance, ahead of the development impact."
        },
        {
            "text": "For decision-makers, such as local authorities, the calculation tool evidences that the statutory biodiversity metric has been used by the developer to meet the BNG requirement. It provides a more transparent and objective means of determining what additional biodiversity value a development will deliver."
        },
        {
            "text": "The metric ensures that, for the very first time, all habitats can be afforded a value in the development process, not just the rarest or those with legal protection."
        },
        {
            "text": "It:"
        },
        {
            "text": "Developing the metric"
        },
        {
            "text": "\"The statutory biodiversity metric represents a decade of work to develop, revise and update the biodiversity metric. Throughout this time, the Natural England team were incredibly collaborative, always seeking views and feedback.” - Julia Baker, Technical Director, Nature Services, Mott MacDonald"
        },
        {
            "text": "The metric was initially developed by Natural England in collaboration with Defra and with substantial input from:"
        },
        {
            "text": "The statutory metric which has now been published by Defra is based on metric 4.0."
        },
        {
            "text": "A simplified version, known as the small sites metric (SSM), has also been published. Smaller developments which meet the criteria to use the SSM will be able to use the corresponding small sites calculation tool when minor development BNG becomes mandatory in April."
        },
        {
            "text": "We want to thank all those who have participated in the metric’s development journey over the years. The valuable input and feedback informed and shaped the metric and associated materials."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "You can find the statutory biodiversity metric tools and guidance published by Defra here. These must be used for the measure of mandatory biodiversity net gain (BNG), no other metric versions are acceptable."
        },
        {
            "text": "To compliment this package, Natural England has published a GIS data import tool and technical guidance which can be found here, with case studies to follow soon."
        },
        {
            "text": "Both Defra and Natural England continue to welcome feedback from all partners and experts, including ecologists and developers. We will use this feedback to support iteration of the metric. Natural England will continue to act in an advisory role in the metric’s development."
        },
        {
            "text": "To provide certainty, government has committed to making major updates only to the metric following consultation, which will likely be between 3 and 5 years' time. Natural England will continue advising Defra based on the best ecological evidence."
        },
        {
            "text": "We look forward to witnessing the positive impact that BNG will bring to both people and nature. For more insights, you can read the BNG guidance here. Stay tuned for upcoming blogs, including Natural England blogs and Land Use blogs from Defra, featuring case studies to assist BNG stakeholders in their preparations."
        }
    ]
}