{
    "url": "https://defrafarming.blog.gov.uk/2024/01/24/watch-an-ofc-and-sfi-special/",
    "title": "Watch: an OFC and SFI special",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Conversations we're having",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-24T11:34:16+00:00",
    "content": [
        {
            "text": "In this post, we share 2 videos from the Oxford Farming Conference (OFC)."
        },
        {
            "heading": 2,
            "text": "The agricultural transition and environmental land management"
        },
        {
            "text": "The first video is a session hosted by Jim Egan and Jonathan Baker."
        },
        {
            "text": "Jim is Sustainable Farming Adviser at Frontier Agriculture (sponsor of the event) and Jonathan is Deputy Director in Defra's Farming and Countryside Programme."
        },
        {
            "text": "Jim sets the scene for environmental land management. He gives a practical overview of the Sustainable Farming Incentive (SFI). "
        },
        {
            "text": "Jonathan shares the ambitions, plans and progress of the programme, with a summary of the recent Agricultural Transition Plan update."
        },
        {
            "text": "The session includes a Q&A."
        },
        {
            "heading": 2,
            "text": "Farmer opinion"
        },
        {
            "text": "The second video features farmers John Geldard and Ben Taylor-Davies."
        },
        {
            "text": "John gives his opinion on the work of the team and Ben describes his experience with SFI and plans for his farm."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "Jonathan recently posted a summary of the ATP update on the blog. It includes details of scheme payment rates, premium payments, new actions and plans for a single application service."
        },
        {
            "text": "If you'd like to explore how SFI can work for you, visit our dedicated site. If you apply for an SFI agreement today, you will receive your first payment 4 months after your agreement starts. After that, you’ll be paid every 3 months, so you'll have a regular, reliable income."
        },
        {
            "text": "If you're ready to apply, colleagues from the Rural Payments Agency (RPA) produced a step-by-step guide on YouTube. "
        },
        {
            "text": "Finally, we're publishing a series of posts on the new SFI actions by sector so look out for those. By subscribe to the Farming blog you'll receive an email notification whenever a new post is published."
        }
    ]
}