{
    "url": "https://environmentagency.blog.gov.uk/2024/01/24/weve-joined-forces-with-msc-to-stop-illegal-waste-exports/",
    "title": "We’ve joined forces with MSC to stop illegal waste exports",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2024-01-24T09:56:59+00:00",
    "content": [
        {
            "text": "Each year our illegal waste exports team in our National Enforcement Service stops between 200 and 450 containers full of waste that does not comply with waste export regulations, such as untreated and hazardous waste."
        },
        {
            "text": "In our blog last month, we shared news with you of our new sharing agreement with HMRC to receive their customs export data to help us better target and shut down criminals who are sending waste abroad illegally."
        },
        {
            "text": "Now we have launched our Waste Shipment Intelligence Service in partnership with the shipping line Mediterranean Shipping Company (UK) Ltd. The project aims to work in partnership with the shipping industry to protect the environment from harm caused by illegal shipments of waste."
        },
        {
            "text": "The project shares resources and knowledge between us and MSC UK to prevent known illegal waste exporters from using shipping lines to facilitate their illegal activities. Through this preventative action we can reduce the risk of repatriations and their associated costs."
        },
        {
            "text": "This approach provides dual benefits for us as the environmental regulator and MSC UK as a major UK exporter."
        },
        {
            "text": "We are really pleased that MSC UK have stepped up to help us target and stop offenders from within their sector. It shows that they are taking waste crime seriously and are prepared to take action to stop illegal waste exports."
        },
        {
            "text": "This is another step towards stopping Illegally exported waste which can result in significant environmental damage and harm to human health in the destination countries."
        },
        {
            "text": "Get involved!"
        },
        {
            "text": "The Waste Shipment Intelligence Service is open to all shipping lines, and we invite more companies to sign up and join us in our mission to eliminate waste crime."
        },
        {
            "text": "Any companies interested in understanding more about this project and signing up can contact us at: IWEshared@environment-agency.gov.uk"
        }
    ]
}