{
    "url": "https://traderemedies.blog.gov.uk/2024/01/24/working-with-us-become-a-senior-trade-remedies-lawyer-with-the-tra/",
    "title": "Working with us: Become a senior trade remedies lawyer with the TRA",
    "authors": [
        "Matt Gass, Senior Trade Remedies Lawyer"
    ],
    "categories": [
        "HR",
        "People"
    ],
    "pub_date": "2024-01-24T12:08:03+00:00",
    "content": [
        {
            "heading": 3,
            "text": "As we prepare to open applications for a Grade 6 senior trade remedies lawyer we asked senior lawyer, Matt Gass, to share his experiences of joining the TRA and what his highlights have been so far. "
        },
        {
            "text": "I started with the TRA as a new senior lawyer in October 2023. Before that I had spent most of my career at HMRC, having moved there after a few years as a corporate M&A lawyer. "
        },
        {
            "heading": 3,
            "text": "Wealth of experience meets new challenges "
        },
        {
            "text": "I applied to join the TRA because international trade law was something I’d always been interested in. I had a chance to work in various aspects of trade law before joining. I worked on negotiations for the tax chapters of the TCA as well as free trade agreements with Australia and EFTA, and carried out advisory work on various customs issues including working on the Northern Ireland Protocol/Windsor Framework. So, even though I’d never worked directly on trade remedies, it made sense for me to move here for the next step of my career. "
        },
        {
            "text": "To anyone thinking of applying who hasn’t worked in international trade, or trade remedies specifically, I don’t think that should be a barrier to joining. It’s still such a new area for the UK we’ve all got a lot to learn. Everyone’s aware of that too, so there is a real emphasis on training and upskilling.  "
        },
        {
            "heading": 3,
            "text": "No two days are the same... "
        },
        {
            "text": "The work itself is incredibly interesting and combines some of the things I enjoyed most about working in government and in private practice. The main thing I’ve been working on since I started has been new dumping and subsidy investigations into excavators from the People’s Republic of China following an application by JCB.  "
        },
        {
            "text": "Another thing I’ve enjoyed is getting to work closely with colleagues, including investigators, economists and policy colleagues, government departments such as DBT and HMRC and domestic industries with an interest in our work. It’s been great to be involved with such a big project from the start, and to work with such a high-profile company like JCB. I even got to join investigators on a site visit to their manufacturing plant in Uttoxeter, which was a real early highlight for me.  "
        },
        {
            "heading": 3,
            "text": "Flexibility and support "
        },
        {
            "text": "Speaking of travel, given that I live in London, the office being in Reading was something that made me think twice before applying. However, when I found out the expectation for the legal team was to come in at minimum once a week, that felt manageable from a work/life balance perspective. Of course, some people come in more than that – there’s a real emphasis on finding what works for the individual and I’ve always felt like I have control over my schedule here. The whole team aims to come in on Tuesday, which is great because I get to see people in person more than I did where I worked before, where the team was more spread out. These Tuesdays have really helped us to get to know each other and work well together. "
        },
        {
            "text": "It's a really nice office and team. The whole organisation is relatively small (by government standards) and we all work in the same location so it feels quite close knit. There have been a few events since I’ve joined that have brought large numbers of people together, like the annual Stakeholder Forum and the Community Day. "
        },
        {
            "text": "I’d definitely encourage anyone interested to sign up for a chat with General Counsel, Clare Brodie, and learn a bit more about the role and ask any questions you might have, once the job applications open. I learned a lot about the organisation which really helped me decide to apply. "
        },
        {
            "heading": 4,
            "text": " Applications for the role of senior trade remedies lawyer will open on the February 5. Follow us on LinkedIn to keep up to date with our latest news and role vacancies. "
        },
        {
            "text": " "
        }
    ]
}