{
    "url": "https://teaching.blog.gov.uk/2024/11/25/achieving-success-for-all-through-the-pupil-premium/",
    "title": "Achieving success for all through the Pupil Premium",
    "authors": [
        "Elizabeth Bramley"
    ],
    "categories": [
        "Pupil premium & PE premium",
        "Uncategorized"
    ],
    "pub_date": "2024-11-25T15:09:42+00:00",
    "content": [
        {
            "text": "Elizabeth Bramley, headteacher and disadvantage strategy lead of Oakdene Primary Academy, Billington, tells us how she uses the pupil premium grant to raise attainment so that all pupils achieve success.  "
        },
        {
            "text": "Managing a school with a larger than average pupil premium cohort means that embedding our pupil premium offer into our whole school approach is crucial.  "
        },
        {
            "text": "We have developed our pupil premium strategy in line with the DfE’s 5 step approach and resources. It focuses on 4 key elements: "
        },
        {
            "text": "Utilising this strategy we have successfully lifted the attainment of our pupil premium cohort to well above the national average year on year.  "
        },
        {
            "text": "Active assessment   "
        },
        {
            "text": "Developing and evaluating our pupil premium strategy is key and data is a vital driver to enable this.  "
        },
        {
            "text": "We ensure our teachers have access to our most up-to-date data to aid continuous active assessment and diagnosis of all our pupils’ needs and required interventions. For example, through our active assessment, we identified that our disadvantaged cohort are significantly behind their peers in developing early language skills. Alongside monitoring those pupils reading attainment, our school leaders also observe pupil’s vocabulary application during classes each day. "
        },
        {
            "text": "These lesson visits encourage ongoing conversations about assessment outcomes, enabling all staff to have a firm understanding about what each child needs to boost their success "
        },
        {
            "text": "Research informed approaches "
        },
        {
            "text": "Our strategy has been influenced by the contributions of Marc Rowland, disadvantaged learners’ adviser at Unity Schools Partnership. One of Marc’s key messages, “The teacher is the intervention” has informed how we deploy adults in school.  "
        },
        {
            "text": "We have adopted a tiered approach as recommended by the Education Endowment Foundation and supported through the DfE’s menu of approaches, and in line with this approach, quality first teaching is always central to our pupil premium strategy.  "
        },
        {
            "text": "Each year we review our pupil premium strategy by forensically assessing our progress. This provides us with a deep understanding of what is making a difference for disadvantaged pupils and what more we can achieve. Enabling us to create further opportunities for all colleagues to utilise evidence-based approached in the classroom.   "
        },
        {
            "text": "Bespoke curriculum design "
        },
        {
            "text": "Our curriculum fosters inclusivity through engagement with parents, as well as using capital funding to bolster outdoor education and our academic provision.  "
        },
        {
            "text": "As noted above, improving early language skills is a priority for our pupil premium cohort. This is a key focus of our curriculum so that children become articulate and confident communicators.  This enables our learners to grapple with complex and important problems and talk confidently about their learning. "
        },
        {
            "text": "We invest in CPD on language development for all staff through the pupil premium, as well as funding more targeted programmes such as Accelerated Reader and Lexia.  "
        },
        {
            "text": "As well as enhancing our pupils’ achievements, our pupil premium strategy cultivates best practice sharing and underlines our professional development. "
        },
        {
            "text": "High expectations for every child and colleague "
        },
        {
            "text": "High expectations of every member of the school community, from staff to pupil, are a hallmark of our school culture. Pupils are explicitly taught how to behave well and treat one another with courtesy and respect. Our pupils are active participants in the creation of a positive school culture. By having such high expectations of all our pupils, regardless of background, we enable pupils to have high expectations and aspirations for themselves. Everyone in our school understands, shares, and celebrates this culture, which is a key pillar of our success.  "
        },
        {
            "text": "Further resources: "
        },
        {
            "text": "DfE publications: "
        },
        {
            "text": "Pupil premium - GOV.UK "
        },
        {
            "text": "Pupil premium: overview - GOV.UK "
        },
        {
            "text": "Pupil premium: allocations and conditions of grant 2024 to 2025 - GOV.UK "
        },
        {
            "text": "Using Pupil Premium: Guidance for School Leaders "
        },
        {
            "text": "Education Endowment Foundation resources: "
        },
        {
            "text": "The EEF Guide to the Pupil Premium | EEF "
        },
        {
            "text": "Teaching and Learning Toolkit | EEF "
        },
        {
            "text": "DfE pupil premium webinars and blogs: "
        },
        {
            "text": "Pupil premium strategy planning webinar: insights from schools | DfE - YouTube  "
        },
        {
            "text": "Pupil premium expert panel webinar | DfE - YouTube  "
        },
        {
            "text": "School blog: A consistent approach to Pupil Premium to improve outcomes for all | DfE Teaching Blog – GOV.UK "
        }
    ]
}