{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/11/25/announcing-the-gamma-0-4-trust-framework/",
    "title": "Announcing the gamma (0.4) trust framework",
    "authors": [
        "Charlie Smith"
    ],
    "categories": [
        "Digital identity",
        "UK digital identity and attributes trust framework"
    ],
    "pub_date": "2024-11-25T09:23:17+00:00",
    "content": [
        {
            "text": "The UK digital identity and attributes trust framework underpins our approach to building trust in the digital identity ecosystem. The requirements it contains help build confidence that services certified against it are reliable and secure.  "
        },
        {
            "text": "So far, we’ve published three versions of the UK digital identity and attributes trust framework. Today, we're delighted to pre-release the next iteration – the gamma (0.4) publication."
        },
        {
            "heading": 2,
            "text": "What we mean by a ‘pre-release’"
        },
        {
            "text": "We’re badging this publication as a pre-release because it’s not yet ready to be certified against. "
        },
        {
            "text": "However, pre-releasing gives certainty about the forthcoming standards and allows providers time to prepare for the new rules. Once Conformity Assessment Bodies (CABs) are accredited and ready to begin certifying early next year, we will republish gamma, clearly labelling it as the final publication."
        },
        {
            "text": "The requirements in the gamma publication won’t change between now and its final release.  "
        },
        {
            "heading": 2,
            "text": "Changes for the gamma publication"
        },
        {
            "text": "Testing and iterating the trust framework is core to our approach. We’ve engaged extensively with stakeholders since publishing the June 2022 beta (0.3) version, and building on that evidence we’ve made five main changes for gamma. These mean the new rules:"
        },
        {
            "text": "Overall, I see these changes as more evolutionary than revolutionary. But, taken together, it should be clear that we’re deliberately raising the bar for providers operating within our trusted ecosystem. It’s essential that certification remains a real distinction for the most trustworthy services, and that we suitably safeguard the privileges that it brings."
        },
        {
            "text": "For more details on the improvements we’ve made, please see the detailed summary of changes in the gamma publication."
        },
        {
            "heading": 2,
            "text": "What happens next?"
        },
        {
            "text": "As mentioned earlier, while services can start preparing to meet the gamma publication’s rules now, they will not be able to get certified against them just yet. We will announce when CABs are accredited and ready to begin certifications next year."
        },
        {
            "text": "Once the new Data (Use and Access) Bill passes, OfDIA will have a duty to review the trust framework at least annually. We’ll therefore soon also be launching our next round of stakeholder engagement, to gather feedback on the gamma publication and other guidance that together makes up the trust framework. This will help us develop the next publication, which we plan to release following the Data Bill’s passage."
        },
        {
            "text": "We’ll share more information about getting involved with engagement in a future blog post. In the meantime, do let me know what you think about this new publication."
        }
    ]
}