{
    "url": "https://planninginspectorate.blog.gov.uk/2024/11/25/appeals-service-four-lpas-join-householder-appeals-system-trial/",
    "title": "Appeals Service: Four LPAs join Householder Appeals system trial",
    "authors": [
        "Tom Sedgman"
    ],
    "categories": [
        "Appeals",
        "Service improvement"
    ],
    "pub_date": "2024-11-25T12:14:09+00:00",
    "content": [
        {
            "text": "Following the successful launch of our pilot with the London Borough of Barnet, we're excited to announce the expansion of our trial to include four additional local planning authorities (LPAs), marking another significant step in modernising our appeals process. Tom Sedgman, Lead Delivery Manager for the Appeals Service explains."
        },
        {
            "text": "Since early September, the London Borough of Barnet has been instrumental in testing our new Beta service for Householder Appeals. Their valuable feedback and participation with live appeals have helped us refine and enhance the system, paving the way for this wider rollout."
        },
        {
            "heading": 2,
            "text": "Welcoming new trial participants"
        },
        {
            "text": "We are pleased to announce that four additional LPAs have today (Monday, 25 November) joined our pilot programme:"
        },
        {
            "text": "This expansion represents a significant milestone in our journey to transform the appeals process, allowing us to gather more comprehensive feedback in areas with a higher concentration of planning appeals, and ensure the system works effectively across different local authority contexts."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "As we continue to develop and refine the service, we remain committed to:"
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        },
        {
            "text": "For more information about our initial pilot, you can read our previous blog post about the London Borough of Barnet pilot."
        },
        {
            "text": "For a preview of the dashboard, we’ve put together three tutorial videos to help users navigate the new system. They include:"
        },
        {
            "heading": 2,
            "text": "Keep updated"
        },
        {
            "text": "Follow our progress through our official blog and LinkedIn page, where we regularly share updates about our services and ongoing transformation projects."
        },
        {
            "text": "For email alerts for news and events, sign up via this form"
        }
    ]
}