{
    "url": "https://defrafarming.blog.gov.uk/2024/11/25/csht-mirror-agreements-and-hls-extensions-an-overview/",
    "title": "CSHT mirror agreements and HLS extensions: an overview ",
    "authors": [
        "Cindy Hughes"
    ],
    "categories": [
        "Countryside Stewardship",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-11-25T14:06:43+00:00",
    "content": [
        {
            "text": "If you have a Countryside Stewardship Higher Tier (CSHT) agri-environment agreement that expires in 2024 or Higher Level Stewardship (HLS) agreement that expires in 2024 or 2025, we want to support you as you transition to our environmental land management (ELM) schemes. "
        },
        {
            "text": "In this post, I’ll share an overview for those with CSHT and HLS agreements.  "
        },
        {
            "heading": 2,
            "text": "CSHT agri-environment mirror agreements "
        },
        {
            "text": "If your CSHT agri-environment agreement is expiring or partly expiring in 2024, you’ll be offered a mirror agreement with the same duration of 5 or 10 years.  "
        },
        {
            "text": "For example, a 10-year CSHT agri-environment agreement that partly expires will be offered a 10-year mirror agreement covering all eligible land management options.   "
        },
        {
            "text": "This will be an exact duplicate of your current agreement, so you can carry on delivering environmental outcomes and receiving funding without any interruption. "
        },
        {
            "text": "If your agreement includes land designated as a Site of Special Scientific Interest (SSSI), you’ll need to contact Natural England to get consent up until the end date of your new mirror agreement. "
        },
        {
            "text": "Natural England will issue consents for these agreements following basic checks.  "
        },
        {
            "text": "The RPA will start writing to farmers like you who are eligible for mirror agreements soon, so keep an eye on your post or email. "
        },
        {
            "text": "More information about the timing and content of the expanded Higher Tier scheme will be published in December. "
        },
        {
            "heading": 2,
            "text": "HLS extensions "
        },
        {
            "text": "If your HLS agreement has already expired or is due to expire by December 2024, the RPA will soon be in touch to offer you a 2-year extension. "
        },
        {
            "text": "An extension will allow you to continue delivering land management practices in your HLS agreement without interruption to the funding you receive.  "
        },
        {
            "text": "Natural England has already approved these agreements for extension, and we’ll only review cases where significant changes have occurred since the extension was approved. If your agreement has already expired, you can only request an extension if you have continued to manage your land in accordance with your agreement. "
        },
        {
            "text": "If your HLS agreement is due to expire in 2025, Natural England will review each case and recommend either a 1-year or 2-year extension. "
        },
        {
            "text": "Those with agreements expiring in 2024 will be contacted first, followed by those with agreements expiring in 2025. "
        },
        {
            "heading": 2,
            "text": "Woodland management "
        },
        {
            "text": "If your CSHT agreement involves woodland, you won’t be eligible for a mirror agreement. This is because many woodland agreements include actions that cannot be repeated on the same area of land and a new agreement may also need an updated or new woodland management plan, licence or consent.  "
        },
        {
            "text": "However, you will be able to apply for a new CSHT agreement when this new expanded scheme opens next year. "
        },
        {
            "text": "We’ll write another blog post when you can apply. Subscribe to the blog for the latest updates. "
        },
        {
            "text": "Applying for the expanded SFI offer alongside your existing agreement "
        },
        {
            "text": "If your CS Mid Tier, CSHT, or HLS agreement doesn’t expire soon, you can apply for the expanded Sustainable Farming Incentive (SFI) offer if your land meets the eligibility criteria, and the activities you wish to carry out must be compatible with the SFI. You cannot be paid twice for similar activities or outcomes on the same area of land. "
        },
        {
            "text": "Find out how SFI can work for you.  "
        },
        {
            "heading": 2,
            "text": "Ending your agreement early  "
        },
        {
            "text": "If you choose to extend your HLS agreement or accept a CSHT mirror agreement, over time you’ll have the option to end your extended or mirror agreement early if you want to apply for the new CSHT scheme once it becomes available.  "
        },
        {
            "text": "If you end your agreement at the end of its current agreement year, you’ll receive the full payment for that year, provided you meet the requirements of the agreement.  "
        },
        {
            "text": "If you decide to end your agreement before the end of the year, any payments for that agreement year will be forfeited. You may submit a request to close your agreement at any time during the calendar year and we’ll provide more information about how to do this soon. "
        }
    ]
}