{
    "url": "https://gds.blog.gov.uk/2024/11/25/how-gds-partners-with-the-oecd-on-digital-government/",
    "title": "How GDS partners with the OECD on Digital Government",
    "authors": [
        "Tim Paul - Head of Interaction Design, Government Digital Service",
        "Farah Hussain - Governance and Multilateral Organisations Manager, GDS"
    ],
    "categories": [
        "Digital, Data and Technology"
    ],
    "pub_date": "2024-11-25T12:50:46+00:00",
    "content": [
        {
            "text": "At the Government Digital Service (GDS) our international work includes engagement with multilateral organisations such as the Organisation for Economic Cooperation and Development (OECD)."
        },
        {
            "text": "The UK’s digital, data and technology expertise is highly sought after by our international peers in other governments and multilateral organisations. Our membership of forums hosted by these bodies plays a role in providing our UK practitioners with unique learning opportunities."
        },
        {
            "text": "With first-hand experience of delivering digital transformation, our GDS senior leadership is at the very core of our engagement, through their participation on international forums such as the OECD’s E-Leaders where they get together with other senior officials from different governments, share lessons learnt and collectively solve common problems, but also help to shape the future of the global digital government landscape."
        },
        {
            "text": "Organisations like the OECD bring together international experts and digital practitioners in their respective specialist subject fields to conduct in-depth analysis and share international insights and best practices with other governments."
        },
        {
            "text": "The end goals all have the same purpose - sharing of information and opinions between country peers and thematic experts to achieve a desired output or common goal."
        },
        {
            "text": "The UK’s engagement with the OECD’s Digital Government and Open Data Unit opens up many opportunities for learning. "
        },
        {
            "text": "GDS digital practitioners have previously supported digital government reviews led by the OECD, in Chile, Slovenia and will be supporting upcoming OECD capacity building workshops in Thailand.  Participating in interviews and discussions with other governments also brings back learnings and insights to help our own work and thinking."
        },
        {
            "text": "Here’s a recent example of a trip that my colleague Tim Paul, our Head of Interaction Design, joined. Over to Tim…"
        },
        {
            "heading": 2,
            "text": "Peer review trip to the Republic of Korea"
        },
        {
            "text": "Back in June 2024 I was lucky enough to be selected to join a small OECD delegation to the Republic of Korea, to conduct a peer review of their digital public services and infrastructure."
        },
        {
            "text": "The OECD works to help its 38 member countries improve people’s lives with better policies for things like digital government, economic development, education, climate change and corruption."
        },
        {
            "text": "They occasionally visit member countries to conduct a detailed review, and then share what they learn in a report. Typically they invite a few peers from other member countries; experts in a particular field that the country in question is interested in."
        },
        {
            "text": "I was joined by another peer, Laura Sommer, an advisor from the New Zealand equivalent of GDS. We were there to provide expertise on User Centred Design and Service Transformation."
        },
        {
            "text": "Over 5 days we held 19 in-depth interviews with civil servants from 14 different departments. They were held in government offices in Seoul and Sejong, and for each interview we were joined by a translator."
        },
        {
            "text": "The interviews were semi-structured, with some pre-prepared questions, but as peers we were able to improvise a bit. At the end of the week we presented our initial findings back to our hosts. The final report is written by OECD, but Laura and I will review it too."
        },
        {
            "text": "On reflection, it’s been one of the most fascinating and rewarding experiences of my career so far."
        },
        {
            "text": "It felt really good to be supporting the digital transformation of another country. The OECD team was fantastic, and it was great to make connections with a fellow peer."
        },
        {
            "text": "The trip gave me a new appreciation that every nation is on its own journey when it comes to digital transformation. What works in one place may not work elsewhere, so it’s really important to understand a country’s context before you try to replicate their strategies."
        },
        {
            "text": "Also, the food was delicious."
        }
    ]
}