{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/25/investing-in-nature-global-action-is-needed-for-a-sustainable-future/",
    "title": "Investing in nature: global action is needed for a sustainable future  ",
    "authors": [
        "Ruth Davis OBE"
    ],
    "categories": [
        "Climate change",
        "Community",
        "Nature"
    ],
    "pub_date": "2024-11-25T14:15:19+00:00",
    "content": [
        {
            "text": "I’m Ruth Davis, and I'm honoured to have been appointed as the UK’s very first Special Representative for Nature. It will be my job to engage with countries and policy makers across the world, making the case for investing in nature to protect our precious forests, land, water and wildlife.  "
        },
        {
            "text": "Protecting and restoring nature is vital for the UK’s security and economy and our ability to meet climate, energy and development goals. "
        },
        {
            "text": "More than half of the global economy is moderately or highly dependent on nature. Food, land and ocean systems generate around 12% of global GDP. Natural capital in the UK is estimated to be worth £1.8 trillion.  "
        },
        {
            "text": "Leading the way at COP29 "
        },
        {
            "text": "Following the UN Biodiversity Conference in Colombia last month, I am supporting the bold and ambitious UK delegation to deliver a successful outcome from the UN Climate Change Conference in Baku, Azerbaijan, commonly known as COP29.   These multilateral agreements are critical for driving forward ambition and for mobilising the much-needed finance for climate and nature.  It’s estimated that $700 billion a year is needed to halt and reverse nature loss globally.   "
        },
        {
            "text": "As well as meeting with climate representatives from across the globe, I’ve been speaking on the successful synergies between the three Rio Conventions on Biodiversity, Climate and Desertification, blended finance and other investment channels for sustainable agriculture investments and how the UK is supporting efforts to implement water-related mitigation and adaptation measures.  "
        },
        {
            "text": "COP29 has provided an excellent opportunity for me and Minister for Nature Mary Creagh to connect with international counterparts and share ideas on how we can better protect our climate and the natural world. "
        },
        {
            "text": "In my role, I’ll be working with different countries, communities and institutions to ensure that finance flows positively toward nature’s recovery to bridge this gap. "
        },
        {
            "text": "Nature and our future "
        },
        {
            "text": "We need to put nature at the heart of our discussions on climate and development.  "
        },
        {
            "text": "A thriving natural environment is critical for building our resilience to face the demands of a changing climate. We know that our global network of peatlands, seas and forests act as carbon sinks, sequestering and holding carbon dioxide to regulate the Earth’s climate.  "
        },
        {
            "text": "It is not possible to reach our Net Zero or Sustainable Development goals without restoring nature.  "
        },
        {
            "text": "We need to take an integrated approach to tackling these challenges, and I am committed to working with partners across the global to unlock finance and ensure that all types of investments align financial flows with our climate and nature objectives and deliver the UK’s vision to create a world free from poverty on a liveable planet.  "
        }
    ]
}