{
    "url": "https://aphascience.blog.gov.uk/2024/11/25/joining-forces-with-qatar-university/",
    "title": "Joining forces for a safer future: Qatar University, and APHA's research on food-borne pathogens and antimicrobial resistance",
    "authors": [
        "Sandra Laborda Anadon"
    ],
    "categories": [
        "Antimicrobial Resistance",
        "Bacterial diseases",
        "International",
        "Uncategorized"
    ],
    "pub_date": "2024-11-25T13:46:19+00:00",
    "content": [
        {
            "text": "The bacteria known as Campylobacter are a common cause of food poisoning in people. The majority of Campylobacter infections are linked to the handling and consumption of chicken meat as chickens can carry the bug in their guts and faeces. The emergence of antimicrobial resistance (AMR) is also a threat to infected patients who require antibiotic treatment as there is a risk that these medications will no longer be effective. Therefore, research into AMR in Campylobacter that can be found on chicken meat is important to ensure food safety for the consumer."
        },
        {
            "text": "In a world in which international trade and travel are so prevalent, it is crucial to address the issue of food-borne pathogens and the spread of AMR from a global perspective. In line with this, Animal and Plant Health Agency’s (APHA) collaboration with Qatar University aims to share expertise between bacteriology laboratories, support research to control the spread of AMR in food-borne pathogens and promote best practices to minimize consumer risks."
        },
        {
            "text": "In 2022, the UK National Reference Laboratory for Campylobacter in Animals based at APHA Weybridge, began working with Dr Nahla Omer Eltai from the Biomedical Research Centre (BRC) at Qatar University initiated by discussions led by Dr Rod Card from APHA’s FAO Reference Centre for AMR."
        },
        {
            "text": "This project was conceived to share expertise in detecting, identifying, and characterising Campylobacter, helping Qatari scientists to assess the burden of Campylobacter present in chicken meat consumed in Qatar and AMR. In January 2023, BRC scientist Miss Hana Adel Mohamed Abdelrahman visited APHA to learn laboratory methods and quality systems. A reciprocal visit by Dr Sandra Laborda Anadon and Mr James Coates followed to help implement the new methods at the BRC. These visits were supported by the Science & Innovation Network in Qatar of the Foreign, Commonwealth and Development Office (FCDO)."
        },
        {
            "text": "A scientific workshop was hosted by the BRC at Qatar University in 2024 entitled, “Campylobacter Foodborne Disease: Essentials and Advanced Hands-On Techniques”. It featured presentations from APHA scientists Dr Sandra Laborda Anadon, Dr John Rodgers and Mr Alistair Davies, along with experts from Qatar University, and other Qatari institutions. The sessions were moderated by Dr. Nahla Eltai. The environment, food-production, veterinary and medical sectors were all represented to ensure the discussions had a ‘One Health’ perspective. Over 60 highly engaged attendees joined the three-day event that included ‘hands-on’ demonstrations."
        },
        {
            "text": "In May 2024, Dr Eltai and Miss Abdelrahman from the BRC returned to the APHA to review the collaboration on Campylobacter and to deepen the knowledge exchange in bioinformatics."
        },
        {
            "heading": 3,
            "text": "Hana’s experience visiting APHA Weybridge"
        },
        {
            "heading": 3,
            "text": "Sandra’s experience visiting Qatar University"
        }
    ]
}