{
    "url": "https://actuaries.blog.gov.uk/2024/11/25/supporting-hm-treasury-through-legal-proceedings/",
    "title": "Supporting HM Treasury through legal proceedings",
    "authors": [
        "James Pepler - Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis"
    ],
    "pub_date": "2024-11-25T12:28:07+00:00",
    "content": [
        {
            "text": "When I was a newly qualified actuary, part of the induction process into life as a professional was to watch a video in which an accountant was in the dock accused of professional negligence squirming as he was cross-examined by a barrister. "
        },
        {
            "text": "I’ve been reminded of this over the last couple of years, as a colleague and I have spent the best part of 2 weeks sitting in court rooms in the Royal Courts of Justice where the products of some of GAD’s advice have been brought into question by 2 trade unions. Fortunately, this is where the parallel ends as we were not giving evidence. "
        },
        {
            "text": "In this case we were supporting our client, HM Treasury, which was defending the claim. I can’t remember what happened to the fictitious accountant, but [spoiler alert] the government won the real-life case although it went as far as the Court of Appeal."
        },
        {
            "heading": 2,
            "text": "The context to the case"
        },
        {
            "text": "The government introduced a cost control mechanism for public service pension schemes in 2015 at the same time as new scheme designs for all public service workers. If scheme costs went above a cap, then benefits would be reduced, or member contributions increased. However, if costs fell below a floor, then benefits would be increased, or member contributions reduced. "
        },
        {
            "text": "The first use of this mechanism was at the 2016 scheme valuations. Preliminary actuarial analysis in autumn 2018 indicated that costs were falling such that either an increase in benefits or reduction in contributions would be required by the mechanism. "
        },
        {
            "text": "In the meantime, a group of judges and firefighters were challenging some of the new scheme arrangements in the courts. They challenged the transitional protections which enabled older members to remain members of the old schemes. "
        },
        {
            "text": "By autumn 2018 that claim had reached the Court of Appeal and, in December 2018, the Court made its judgment that the transitional arrangements were age discriminatory. This judgment has become known as the “McCloud” judgment."
        },
        {
            "text": "As a result, the government paused the cost cap mechanism while it started to consider what further changes to pension schemes were needed to remedy this discrimination. "
        },
        {
            "text": "During this time, the government decided that the costs of the McCloud remedy (around £20 billion) should be included in the cost control mechanism. HM Treasury unpaused the cost cap valuations in 2022 with final results showing that increases in benefits/ reductions in contributions were no longer needed."
        },
        {
            "heading": 2,
            "text": "What was the case about?"
        },
        {
            "text": "The lead claimants were members of the Fire Brigades Union (FBU) and British Medical Association (BMA). Both challenged the Directions that HM Treasury made in 2022 that implemented the decision to include the cost of the McCloud judgment in the cost cap mechanism. There were 8 separate arguments made by the unions. Some challenged the process that HM Treasury had followed in making its Directions while others challenged the substance of the Directions themselves. "
        },
        {
            "text": "The Directions are the legislation which describes how pension scheme actuaries must do the cost cap mechanism calculations. GAD had provided advice to HM Treasury as the Directions were developed to ensure that they understood the policy decisions they had to make about how the calculations would work and to ensure that the legislation was drafted to correctly implement those decisions. We had also provided an analysis of the impact of this decision on different groups which helped support the Equalities Impact Analysis which HM Treasury prepared when making the Directions."
        },
        {
            "heading": 2,
            "text": "Experiences in court"
        },
        {
            "text": "Our first task in the case was helping to produce a huge ‘bundle’ of evidence. All of GAD’s advice relating to the decision to include the McCloud remedy costs in the cost cap mechanism was in scope. We therefore had a deep dive into the departmental files to produce what was needed for the court to have a full understanding of the historic evidence. The ‘bundle’ ran to thousands of pages. "
        },
        {
            "text": "Each side then produced “skeleton” arguments to indicate the points that the barristers expected to make in court. We provided actuarial comment of the claimants’ arguments and reviewed the drafts produced by HM Treasury’s counsel. "
        },
        {
            "text": "Our first experience in court was 4 days in the Royal Courts of Justice in early 2023 when the judicial review was heard in the High Court. "
        },
        {
            "text": "There were a few supporters of the unions outside the building who we passed on our way in. Once inside the court room, the non-barristers were crammed in on a hard bench in the back row of the court room. "
        },
        {
            "text": "Those supporting HM Treasury were on one side of the room and those supporting the unions were on the other with a rather small ‘no man’s land’ in the middle of the bench. On the front row the 3 KCs sat amongst huge boxes containing hard copies of the ‘bundle’ which could also double as a stand for their speaking notes. "
        },
        {
            "text": "There was no cross examination during the hearings, so time was solely used by the barristers making their legal arguments. Our work during the hearing was to note anything said by either side where we felt there were actuarial points or descriptions of the historical evidence that were not being made correctly or completely or potentially being misunderstood. "
        },
        {
            "text": "It was pretty impressive to see the silks making their arguments, sometimes talking for up to 3 hours without break, managing their time to ensure that they covered all the material they wanted in the allotted time. We had time to talk to counsel in the lunch break and after each hearing to discuss how things had gone. "
        },
        {
            "text": "There haven’t been many cases in the past about actuarial calculations so there was not very much actuarial about the legal precedents being discussed. In the context of case law around “public consultations” we heard about a case concerning the final resting place of Richard III. While I do have a professional interest in the mortality of public servants, this was definitely an era beyond our actuarial training. "
        },
        {
            "text": "We were back in court for a further 3 days in February 2024, still in the Royal Courts of Justice. This time we were in the Court of Appeal’s more spacious courtroom with upholstered seats and power sockets which enabled laptop batteries to survive a whole day."
        },
        {
            "heading": 2,
            "text": "Epilogue"
        },
        {
            "text": "The 2 judgments can be read here and at this link. Videos of the Court of Appeal hearing sessions are available on YouTube. "
        },
        {
            "text": "The BMA did not seek to challenge the Court of Appeal judgment, but the FBU applied to the Supreme Court for permission to appeal. There was a final round of written arguments sent to the Supreme Court which refused permission to appeal in July 2024. "
        },
        {
            "text": "This piece of work was a rare insight into the litigation process for me as a legally unqualified person. Being involved in it was a really useful experience to reflect on how legal risks can emerge in GAD’s work. However, I’m happy to leave the courtroom to the barristers and stick to giving actuarial advice."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}