{
    "url": "https://forestrycommission.blog.gov.uk/2024/11/25/tree-planting-at-silver-hill-four-years-later/",
    "title": "Tree planting at Silver Hill: four years later",
    "authors": [
        "Shaun Purkiss-McEndoo"
    ],
    "categories": [
        "Tree planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2024-11-25T08:30:00+00:00",
    "content": [
        {
            "text": "I’ve worked at Zetland Estates in North Yorkshire for over 40 years. During that time, we’ve created over 100 hectares of new woodland. Our largest woodland is Silver Hill, which spans about 47 hectares. Before we got started, Silver Hill didn’t have many trees at all. "
        },
        {
            "text": "We planted at Silver Hill in late 2019 and early 2020 with timber production in mind. We’re looking to produce good quality timber from about 65-70% of the area we've planted and are generating carbon credits with the trees. The Forestry Commission helped fund the project through the Woodland Carbon Fund. "
        },
        {
            "text": "This week is National Tree Week, marking the start of the tree planting season. What better time to give you an update on our journey so far? I hope there’s something you can learn from our experience. "
        },
        {
            "heading": 2,
            "text": "Spruce, pine and woody shrubs"
        },
        {
            "text": "We've planted spruce in rows two metres apart. For a good few years they were tucked away in the grass, which we spot weeded, but you couldn’t really make the trees out. But having some grass around the young trees is protecting them from the prevailing wind and the cold.  "
        },
        {
            "text": "We've beat the trees up over the last few years – checking and replacing any that have died. I’m confident they are now established and moving on into a really good crop. I reckon they’ll be a decent size in the next four or five years. "
        },
        {
            "text": "It’s always windy on the western edge of the plantation, so we planted two or three rows of pine and some woody shrubs around the perimeter. We’ve got some hawthorns, some hazel and some guelder rose in there. They form a wind block to protect the spruce. The pine will stay for at least two, maybe three rotations of spruce. "
        },
        {
            "text": "We haven’t used any tree guards. The prevailing wind on Silver Hill is harsh, and I can’t even imagine managing a site with guards for 90,000 trees. Instead we’ve installed deer fencing and made sure there are no grazing livestock that might damage the young trees."
        },
        {
            "heading": 2,
            "text": "Tackling gorse"
        },
        {
            "text": "The area was overrun with gorse. We cleared a lot of it before planting – around 5 hectares were mulched. We left some in certain areas for biodiversity, but we got a fair bit of regrowth around the young trees and it started to become a problem, which I had anticipated.  "
        },
        {
            "text": "The trees were getting to a good size but I didn't want to lose them underneath the gorse. We wanted to avoid overspray around the trees, so we used machinery to clear the gorse last year. Hopefully we can keep it under control until the trees dominate the area and manage it themselves. "
        },
        {
            "heading": 2,
            "text": "DIY fencing"
        },
        {
            "text": "We put up 3000 metres of deer fencing, which is important in advance of the planting. We've got roe deer on the estate which are a threat to new woodland. We only need temporary fencing – once the trees are clear of deer browsing height it’ll come down.  "
        },
        {
            "text": "We’ve made the fencing ourselves. We've got rabbit net at the bottom, topped with plastic net and a line wire. In other areas, instead of plastic netting, we’ve used high-tensile stock fencing.  "
        },
        {
            "text": "I'm quite happy to think that we'll be able to take that down once the trees are grown (probably after 10-12 years of growth) and use it again elsewhere, so it won't go to waste. For the fence posts, we used a long post followed by a short one, repeating that all the way around.  "
        },
        {
            "text": "We’ve cut strainers ourselves out of our thinnings. We cut some larch and knocked those in and they're giving us as good a service as some of the fencing you can buy for a great deal of money these days. "
        },
        {
            "text": "We’re saving ourselves some money all the time. It seems to be holding fast even though it's now over four years old. "
        },
        {
            "heading": 2,
            "text": "Access roads"
        },
        {
            "text": "As we’re looking to produce timber, we need access roads. We built a road right at the beginning - it went in before we even planted any trees here. We actually used part of the funding we got from the Forestry Commission’s Woodland Carbon Fund to build the road. "
        },
        {
            "text": "It's a full spec road capable of taking timber wagons. We’ve made sure there’s a turning area for the larger wagons that will come through in the future. We’ve made room for forwarders, and we’ve got some stacking points in place already. "
        },
        {
            "text": "Some areas have been left unplanted for future maintenance and timber stacking. "
        },
        {
            "text": "Being able to drive into your site from the outset has been great for planting and for ongoing maintenance, too.  "
        },
        {
            "heading": 2,
            "text": "Questions to ask before you start planting"
        },
        {
            "text": "All I can say is whatever size of woodland that you're thinking about planting, think about the future. "
        }
    ]
}