{
    "url": "https://earlyyears.blog.gov.uk/2024/11/29/best-start-in-life-curriculum-roadshows-what-does-our-research-mean-for-you-and-whats-next/",
    "title": "Best Start in Life Curriculum Roadshows – what does our research mean for you and what’s next?",
    "authors": [
        "Wendy Ratcliff HMI, Principal Officer, Early Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2024-11-29T09:18:56+00:00",
    "content": [
        {
            "text": "In November 2024, we completed our annual programme of Best Start in Life Curriculum Roadshows on the prime areas of learning. In this blog we reflect on where our roadshows have taken us this year, what we spoke about, and what providers and practitioners can take away from our research."
        },
        {
            "text": "Our roadshows"
        },
        {
            "text": "This year, we delivered roadshows in 11 different locations across England and spoke to over 1,000 attendees. This time, we focused on the prime areas of learning. We went to Plymouth, Horsham, Walsall, Harrogate, Croydon, Leicester, Doncaster, Manchester, North Tyneside, Essex and Southwark."
        },
        {
            "text": "We worked with local authorities and stronger practice hubs to plan and deliver these events and would like to say a huge ‘thank you’ for your support in doing so."
        },
        {
            "text": "In this year’s roadshows, we continued to focus on the importance of communication and language and draw on the second part of our early years research reports."
        },
        {
            "text": "What our Best Start in Life research means for you"
        },
        {
            "text": "Our three-part research review explored the latest research on early years education and pulled together their insights. Our review concentrates on the pre-school years from birth to age 4. It is designed for early years practitioners, to help you enhance the quality of education you provide."
        },
        {
            "text": "Some of what we say in our review you know already, and that’s great. We hope the research is helpful to all practitioners, even if it just reassures you about what you are already doing."
        },
        {
            "text": "What attendees told us"
        },
        {
            "text": "We ask those who attend our roadshows to complete a survey so we can learn more about what providers and practitioners take away. We heard that the research helped practitioners as well the children they care for and educate."
        },
        {
            "text": "One attendee said that ‘staff are more careful when planning and they have seen impacts which has increased their confidence.’"
        },
        {
            "text": "It’s also been great to read that attendees are taking the time to reflect, and that they are getting ‘back to basics’, as shown by this response: ‘Why this, why now + why these children’."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "We want to make sure these events are as accessible as possible, especially to childminders. To help with this, we are delivering a live webinar specifically designed for childminders."
        },
        {
            "text": "The webinar takes place on 16 December from 7 to 8 pm."
        },
        {
            "text": "Please register for the webinar."
        },
        {
            "text": "You will hear from Ofsted inspectors about:"
        },
        {
            "text": "Where you can find out more"
        },
        {
            "text": "You can read our completed Best Start in Life research review, and watch back a recorded version of our roadshows from last year, which explores communication and language on our YouTube channel."
        },
        {
            "text": "We have produced some short videos on YouTube in a specific playlist called ‘Early years FAQs for providers and practitioners. We also address some commonly asked questions in our ‘Ofsted inspections: what early years providers and practitioners need to know’ collection, which aims to answer any questions that you might have about early years education inspection framework inspections. If you want to hear more, don’t forget to sign up to this blog page."
        }
    ]
}