{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/29/local-government-policy-statement/",
    "title": "Local Government Policy Statement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Local government"
    ],
    "pub_date": "2024-11-29T17:56:47+00:00",
    "content": [
        {
            "text": "Council Tax"
        },
        {
            "text": "Following the publication of the Local Government Policy Statement for 2025-2026, there has been speculative media coverage that councils will be able to increase council tax above the 5% threshold. The government is committed to keeping taxes on working people as low as possible and will not increase the main 5% council tax referendum threshold."
        },
        {
            "text": "While it is for local authorities to decide at what level they set their council tax, the previous government’s policy of a 3% core council tax cap, and an additional 2% for local authorities with Adult Social Care responsibilities, in line with OBR forecasting, will be maintained. As is always the case, there are variations in the flexibilities proposed for different types of authorities, reflecting their circumstances. Continuing this referendum threshold means voters have the final say over excessive council tax increases.  "
        },
        {
            "text": "The government is taking further action to simplify bills received by taxpayers, improve transparency and provide clarity on council tax increases by introducing regulations so that council tax bills issued from 25/26 will show a single line for council tax increases set by social care authorities and will also consider longer term options to improve council tax billing. Every council must also have a locally designed Local Council Tax Support to protect anyone facing financial hardship."
        },
        {
            "text": "The Policy Statement published yesterday (28/11) set out, as with previous years, where a council in need of exceptional financial support sees additional council tax increases as critical to maintaining their financial sustainability, the government will continue to consider requests for bespoke referendum principles."
        },
        {
            "text": "Local proposals will be considered on a case-by-case basis and the impact on working people will be at the forefront of Ministers’ consideration, alongside the councils’ specific circumstances, for example their existing levels of council tax relative to the average and the strength of plans to protect vulnerable people. Ministers have been clear that agreement would only be given in exceptional circumstances."
        },
        {
            "text": "Local Referendums"
        },
        {
            "text": "Full details of the referendum principles for different types of local authority are set out in the policy statement. Following consultation on the provisional local government settlement the final set of referendum principles will be put before the House of Commons for approval in the New Year. "
        },
        {
            "text": "If a local authority sets a council tax increase above the referendum threshold it must have it approved in a referendum of local voters by the first Thursday in May. If the referendum is lost the authority must set a lower council tax level below the referendum principle."
        },
        {
            "text": "Fixing the foundations"
        },
        {
            "text": "The government remains committed to getting councils back on their feet, which is why the Budget confirmed total real terms increase in core spending power of around 3.2% and through our £1.3bn new grant funding, of which £680m will go towards supporting social care, and £250 will support children’s social care."
        },
        {
            "text": "More broadly and as set out in the Local Government Policy Statement yesterday (28/11), we’re taking the necessary steps to reform to local government finance, fixing the foundations and ensure taxpayer money is used as efficiently and effectively as possible."
        }
    ]
}