{
    "url": "https://environmentagency.blog.gov.uk/2024/11/29/regulatory-edm-2024-bathing-season-storm-overflow-data-analysed/",
    "title": "Regulatory EDM 2024 Bathing Season storm overflow data analysed ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-11-29T16:29:56+00:00",
    "content": [
        {
            "text": "The Environment Agency has analysed Event Duration Monitoring (EDM) data on storm overflows associated with bathing waters across England for 2024.  "
        },
        {
            "text": "This regulatory data, bolstered as 100% of storm overflows are now fitted with event duration monitors, is a vital tool for us to plan what investigation and improvement work from water companies needs to take place, and to work with water companies and local partners to take action where needed. "
        },
        {
            "text": "The EDM data we receive from water companies for the bathing season (May to September inclusive) are a sub-set of the EDM Annual Return data for all storm overflows, which is published by the Environment Agency each March.    "
        },
        {
            "text": "Bathing water quality has improved significantly over recent decades; in the 1990s 28% of bathing waters met the highest standards in place at the time. This year 92% met the minimum standard of Sufficient, with 85% achieving the highest standards of Good and Excellent.  "
        },
        {
            "text": "However, the classification results do show there is more work to do, and you can read more about the bathing water classification data and our bathing water classification blog.  "
        },
        {
            "text": "This year’s initial assessment of EDM bathing season data shows that the average number of spills per storm overflow is 7.7 and the average duration per spill is 3.9 hours. This is a decrease from an average of 8.4 spills per overflow in 2023 and a slight increase in average duration from 3.7 hours (equivalent to an additional 12 minutes per discharge) in 2023.  "
        },
        {
            "text": "This year’s data also shows an increase in the total number of spills this year – 8,704, up from 8,496 in 2023.  So, why is this?  "
        },
        {
            "text": "The storm overflows from the 27 new bathing waters have not yet been assessed for subsequent investigation and improvement work by water companies to meet bathing water design standards.  These overflows will be prioritised for improvement programmes in the 2024 Price Review, with improvements to be made to all storm overflows impacting designated bathing waters by 2035. "
        },
        {
            "text": "We are still analysing this year’s EDM bathing season data, but what we do know is that discharges from storm overflows are happening too often and for too long.  "
        },
        {
            "text": "The fact that 100% of storm overflows are now fitted with an event duration monitor means that we have maximum transparency on the scale of the problem.  "
        },
        {
            "text": "Our work to transform and strengthen our regulation of the water industry will focus on directly tackling under performance and the data we receive from Event Duration Monitors and make available, is key to providing the intelligence we need. We’re already making significant progress with our transformation, which includes investing £15 million into enhancing our digital systems to make sure our regulation is effective and intelligence led. We’re also increasing water company inspections and recruiting up to 500 staff, from enforcement officers to data analysts and technical experts.   "
        },
        {
            "text": "We understand just how important bathing waters are to local communities, and we will always hold companies to account if they don’t comply with environmental laws. "
        },
        {
            "text": "Finally, it’s important to remember that there are many factors that impact water quality, including agricultural, highway and urban run-off. That is why we work across all sectors to drive improvement together. "
        },
        {
            "text": "Subscribe to get new blog updates from the Environment Agency delivered to your inbox, or follow us on X"
        }
    ]
}