{
    "url": "https://naturalengland.blog.gov.uk/2024/11/29/small-but-mighty-nature-recovery-seed-corn-projects-2024/",
    "title": "Small but mighty! Nature recovery seed corn projects 2024 ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Education",
        "Environmental Improvement Plan",
        "Local Nature Recovery Strategy (LNRS)",
        "Mental health and wellbeing",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-11-29T14:59:13+00:00",
    "content": [
        {
            "text": "The government is committed to nature recovery and Natural England (NE) is working with partners to grow a national Nature Recovery Network (NRN). This growing network of enhanced, better-connected wildlife-rich places supports biodiversity and species recovery. It will also enhance climate change resilience, give us access to clean air, water and healthy soil and improve health and wellbeing by connecting people with nature. Over recent years, one of the methods we have implemented with our partners to meet this challenge are small, locally based projects known as seed corn. "
        },
        {
            "text": "Seed corn projects are named after the small sums of public funding that are enabling collaboration, innovation, and growth towards delivery of nature’s recovery. Since their inception and implementation in 2019, the NRN Local Delivery Team has worked with partners to oversee and launch over 400 of these mini but mighty projects across the country, with each costing less than £25,000. Spanning all 12 of Natural England’s area teams, seed corn projects have covered a wide range of project types. This includes on-site mapping and restoration work, research projects to inform future actions, habitat assessments and educational resources, which collectively are playing a significant role towards delivering the nature recovery network."
        },
        {
            "text": "Flexibility and diversity "
        },
        {
            "text": "Our recent internal evaluation, involving the analysis of 55 of the 389 projects completed between April 2020 and March 2023 has been encouraging. Projects have been shown to contribute to overarching organisational targets, helping to strengthen and grow the nature recovery network and the collaborative partnerships that it is dependent on. Flexibility and diversity were noted as being two of the programme’s great strengths. Importantly, 96% of the projects reviewed were found to directly contribute to seed corn guiding principles: enhancing biodiversity, connecting local communities with nature; enhancing partnership networks; encouraging the inclusion of external partners; and directly expanding, connecting, and improving nature. "
        },
        {
            "text": "The seed corn programme was recognised as a valuable partnership creation and inclusion tool. NE area teams have used the programme to develop partnerships, and to increase access to a wider variety of funding streams including the Green Recovery Challenge Fund and National Lottery Heritage Fund. When approached for comment, partner organisations emphasised the importance of this type of funding in enabling project creation and research delivery. It was also noted as being invaluable in involving local communities in nature’s recovery. "
        },
        {
            "text": "Examples of success"
        },
        {
            "text": "The Holcombe Moor Peat Monitoring and Improvement Project is an excellent example of how funding can be used to restore and monitor protected habitats through a collaborative approach. Seed corn funding enabled the purchase of vital peatland monitoring equipment, helping the National Trust to create integral local community and external partnerships. This has extended existing support from NE’s Cheshire to Lancashire team, enthusiastic partner organisations and volunteers, and encouraged innovative approaches to monitoring and peatland restoration. It has also helped to lever a further £700,000 in funding from the Nature for Climate Peatland Grant Scheme. "
        },
        {
            "text": " “We found it a very positive experience because of what we’ve achieved. Without this seed corn funding, we wouldn’t have bought the monitoring equipment.” "
        },
        {
            "text": "Nik Taylor – Area Ranger, National Trust "
        },
        {
            "text": "Seed corn funding has proven a valuable resource in laying the foundation for species recovery, as with the North Yorkshire Turtle Dove nature restoration project. Securing the funding enabled the North York Moors National Park Authority to employ a consultant contractor to carry out essential works, filling in knowledge gaps on pond restoration priorities, a vital habitat for Turtle Doves. The seed corn funding also enabled the project to secure £270,000 from the National Heritage Lottery Fund for the ‘Birds on the Edge’ project. "
        },
        {
            "text": "Project lead, Elspeth Ingleby, is confident that this project will benefit other species and local communities as well as the recovery of Turtle Doves.  "
        },
        {
            "text": "‘Bearing Fruit’, is a community led project run by East Lindsey District Council, demonstrating how a little funding can go a long way to benefit both people and nature. The council sought to make use of limited space to create community orchards that would not only aid local biodiversity, but also provide social, mental, and physical benefits for residents. After receiving £3,458 in seed corn funding, tree planting commenced in earnest, with volunteers from the local community coming together to establish the orchard. "
        },
        {
            "text": "The project has produced long-term benefits for the community. As well as the initial community engagement, there have been ongoing opportunities for volunteering, training, and the creation of a platform for knowledge exchange and learning. The project has been well received by local communities. Success has prompted the council to develop long-term goals, hosting community events and exploring opportunities to create more orchards in towns and villages across the area, at the behest of residents. "
        },
        {
            "text": "Lessons Learned "
        },
        {
            "text": "While internal analysis of the projects has proven them to be highly successful, it has also identified challenges. This included the short timeframes for applications and delivery, and the need for clear guidance on funding. We have also learned that these smaller projects enable us to collate quality evidence to underpin applications to other schemes. This includes the Nature for Climate Fund, and the Landscape Recovery Scheme, providing solid foundations on which these larger projects are built. "
        },
        {
            "text": "What this means going forward "
        },
        {
            "text": "Our internal analysis has identified that large sums of money are not necessary to drive nature’s recovery. What is important is our ability to identify priorities and gaps in delivery where collaborative action and innovation can open doors. There are plenty of tools in the toolbox that support nature recovery, not least green finance. But these projects highlight that with collaboration, commitment, creative thinking, and skill, each of us can make a difference to support the delivery of the national nature recovery network. "
        },
        {
            "text": "If you are interested in driving nature’s recovery, please get in touch here:  NDPNaturerecovery@naturalengland.org.uk"
        }
    ]
}