{
    "url": "https://ukhsa.blog.gov.uk/2024/11/29/why-is-norovirus-reporting-in-england-so-high-at-the-moment/",
    "title": "Why is norovirus reporting in England so high at the moment?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Norovirus"
    ],
    "pub_date": "2024-11-29T13:34:50+01:00",
    "content": [
        {
            "text": "Data for the current 2024/2025 season in England shows that norovirus laboratory reports are notably higher than the 5-season average. Norovirus cases typically increase through autumn and into winter, but this year cases have risen earlier than usual and are expected to continue to increase. This rise comes alongside a shift in circulating common norovirus genotypes."
        },
        {
            "heading": 2,
            "text": "Data indicating the rise"
        },
        {
            "text": "Our surveillance systems reveal several key patterns:"
        },
        {
            "text": "While we typically expect norovirus cases to peak in winter months, this season's pattern has been distinctive, starting earlier than is usual. With the exception of a dip during October half-term school holidays, activity has increased again across all age groups. This highlights the significant role that educational settings play in transmission patterns of norovirus. However, health and social care settings also contribute to the spread of the virus, given its highly contagious nature and the vulnerability of individuals in these settings."
        },
        {
            "text": "2.  Hospital impacts"
        },
        {
            "text": "The impact of norovirus outbreaks in healthcare settings is significant. The Hospital Norovirus Outbreak Reporting System (HNORS) is showing more outbreaks than average, though it’s important to note that reporting to this system is voluntary, and engagement can vary. This suggests we may be approaching a period of increased pressure on our health and social care infrastructure during an already challenging winter."
        },
        {
            "text": "3.  Genetic diversity"
        },
        {
            "text": "For the first time, genogroup 2, genotype 17, known as GII.17, has become the most commonly detected genotype in England since April 2024. GII.17 now accounts for 66.3% of characterised samples during the 2024/2025 season to date. Previously, GII.4 noroviruses have dominated globally with GII.4/Sydney/2012 variants persisting as the most frequently detected variant worldwide since the winter of 2012."
        },
        {
            "text": "Several factors are likely contributing to the unusual norovirus activity we’re seeing this season. These include:"
        },
        {
            "heading": 2,
            "text": "Key information about GII.17"
        },
        {
            "text": "There's currently no indication that GII.17 causes more severe illness, but work is underway to conduct further assessment of severity. This new GII.17 genotype has been incorrectly covered in the media as Kawasaki, which is a historic GII.17 variant, not another name for the current GII.17. The distinction is important because the incorrect use of ‘Kawasaki virus’ is causing confusion with ‘Kawasaki disease,’ which is an unrelated, very serious condition."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "Earlier this year our surveillance systems effectively detected the shift from GII.4 to GII.17 dominance, which warrants continued attention and close monitoring by healthcare professionals and public health teams, particularly as we move deeper into the winter season. As norovirus usually causes short-lived illness, many people treat it at home without consulting a healthcare professional - this means that many cases go unreported and don’t appear in surveillance figures - so it is likely that burden in the community is much higher.  While current numbers are higher than expected, they should be interpreted within the context of changes in surveillance systems and the evolving post-pandemic landscape."
        },
        {
            "heading": 2,
            "text": "What you can do to prevent the spread of norovirus"
        },
        {
            "text": "To reduce the spread of norovirus, wash your hands thoroughly with soap and warm water, as alcohol-based hand sanitisers are not effective against the virus. Stay at home for at least 48 hours after symptoms stop and disinfect surfaces using a bleach-based cleaner where possible. Find full guidance here."
        }
    ]
}