{
    "url": "https://ukhsa.blog.gov.uk/2023/02/08/climate-and-health-security-looking-ahead-to-2023/",
    "title": "Climate and health security: Looking ahead to 2023",
    "authors": [
        "Lea Berrang Ford"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-02-08T12:27:34+01:00",
    "content": [
        {
            "text": "The start of each year is a time where we recall the previous year and anticipate the year ahead, and there’s much to reflect on."
        },
        {
            "text": "For climate scientists, there’s no doubt that 2022 was remarkable."
        },
        {
            "text": "Here in the UK we recorded our warmest year on record with temperatures in excess of 40C recorded for the first time."
        },
        {
            "text": "In Coningsby in Lincolnshire the temperature reached 40.3C exceeding the previous UK record by 1.6C, and the hot period in July saw the Met Office issue its first ever red warning for extreme heat."
        },
        {
            "text": "Sadly, there were an estimated 2,803 heat-related deaths in England amongst those aged over 65 this summer, reminding us that our changing climate is an ever-growing health security concern with a real human cost."
        },
        {
            "text": "Here at UKHSA, 2022 was notable because in October we launched our Centre for Climate and Health Security with a mission to deliver a step change in our capabilities."
        },
        {
            "text": "The Centre is now leading UKHSA’s climate health activity, providing a focus for partnerships and collaborations with academia, local authorities and other public sector organisations."
        },
        {
            "text": "Ever since our vision for the centre first formed, we have worked closely with partners to shape its offer, and in the autumn we were delighted to host three focus groups bringing together local government and health professionals from every part of the country."
        },
        {
            "text": "We were particularly keen to hear your views on how we could go about delivering some of the Centre’s key products, in development this year."
        },
        {
            "text": "Over a hundred professionals joined us, giving us a wide range of insightful and actionable feedback."
        },
        {
            "text": "As time-poor professionals, you urged us to focus on where there are gaps in the provision of evidence or resources to help avoid duplication with existing material."
        },
        {
            "text": "You also asked us to ensure local relevance is considered, with recognition that – for instance – coastal or rural areas face different issues to urban areas. Having the option to choose whether to view national, regional, local or ward level information appealed to participants."
        },
        {
            "text": "You also urged us to link our work to other sectors and topics which are not explicitly climate and health related but are relevant, such as mental health and transport."
        },
        {
            "text": "The need to support you to share best practice as well as translate research and data into practical and useable information for local authorities (and each department within them) was mentioned several times."
        },
        {
            "text": "We’d like to thank everyone who took part; we’ll take all of the feedback on board and use it to inform the work we do through 2023."
        },
        {
            "text": "I’m really looking forward to a busy first full year for the Centre as in addition to developing the resources highlighted above, we are also contributing to the 3rd National Adaptation Programme overseen by DEFRA, which sets out the actions that the government and others will take to adapt to the challenges of climate change over a five-year period."
        },
        {
            "text": "In the spring we will publish a single adverse weather and health plan to replace the heatwave and cold weather plans for England, including guidance on drought and flooding."
        },
        {
            "text": "And in the summer, we will publish the fourth iteration of Health Effects of Climate Change in the UK, a landmark report produced periodically and last published in 2012, which provides analysis of a range of threats to our health."
        },
        {
            "text": "From increasingly adverse weather and the potential for impacts on our food security, through to the risk of mosquito-borne diseases becoming endemic in the UK, the risks we face are real."
        },
        {
            "text": "But we look forward to working with you to help the nation adapt to these threats and ultimately keep more people safe."
        }
    ]
}