{
    "url": "https://ofqual.blog.gov.uk/2023/02/08/how-ofqual-acts-in-the-interests-of-apprentices/",
    "title": "How Ofqual acts in the interests of apprentices",
    "authors": [
        "Catherine Large OBE"
    ],
    "categories": [
        "Vocational and technical qualifications"
    ],
    "pub_date": "2023-02-08T09:00:33+00:00",
    "content": [
        {
            "text": "National Apprenticeship Week is the perfect time to talk about how Ofqual’s work benefits apprentices, and the employers they go on to work for. Specifically, I want to look at apprenticeship end-point assessments (EPAs).  "
        },
        {
            "heading": 2,
            "text": "Apprenticeship end-point assessments  "
        },
        {
            "text": "EPAs are tests to show that apprentices have the knowledge, skills and behaviours they need for the occupation they have been training for. As the name suggests, they are completed at the end of an apprenticeship and are vital for apprentices to be able to prove their knowledge, behaviours and skills.  "
        },
        {
            "text": "As the qualifications regulator, it’s Ofqual’s role to make sure that apprenticeship EPAs are awarded consistently and fairly. It is also our job to make sure that the organisations that award them are capable, effective and have apprentices’ interests as their top priority. Ofqual is here to protect students and apprentices and can step in should something go wrong. "
        },
        {
            "text": "Apprenticeship assessments take place in all types of workplaces, from pharmacies to accountancy firms, and from hair salons to factories. There are a wide variety of organisations delivering EPAs, some of which are niche in their fields. All regulated EPAs, however, must be delivered by an awarding organisation that has met Ofqual’s Criteria for Recognition and is recognised on Ofqual’s Register. Such organisations have demonstrated they have the necessary governance, processes, financial stability and assessment expertise to design, develop and deliver the specific EPAs they are interested in.  "
        },
        {
            "text": "Meeting the Criteria for Recognition also provides assurance that awarding organisations deliver robust and fair assessments for apprentices in the long term, providing a level of confidence in the depth and longevity of the apprenticeship assessment landscape. As of the end of January 2023 there are 1,141 EPAs on our register. "
        },
        {
            "heading": 2,
            "text": "Using our regulatory tools "
        },
        {
            "text": "We use a variety of regulatory tools to check EPAs and ensure they take place appropriately. One of these is to carry out an evaluation. This is where we work with assessment and subject matter specialists to review EPA materials produced by awarding organisations. Ofqual and the subject matter specialists review materials (such as the guidance provided to assessors) to make sure the awarding organisation has interpreted the assessment plan correctly and that the assessments are set at the right level of demand – neither too hard nor too easy – to produce consistent, reliable results. "
        },
        {
            "text": "From April 2021 to August 2022 Ofqual evaluated 72 EPAs from across 42 apprenticeship standards, with many more under way and planned this year. "
        },
        {
            "text": "We continue to work closely with the Institute for Apprenticeships and Technical Education, to ensure that the views of employers are taken into account in the way we regulate EPAs. "
        },
        {
            "text": "In addition to this, Ofqual also visits different workplaces and settings to observe apprentices being assessed. This allows us to understand better some of the challenges awarding organisations face in delivering assessments, as well has testing that the organisations and their assessors are following their own procedures.  "
        },
        {
            "text": "From April 2021 to autumn 2022 we visited 81 awarding organisations offering 88 different apprenticeship standards, and we expect to complete a similar volume of engagements this year. Over 50% of these visits included observation of practical and professional discussions. Every visit leads to tangible feedback with points for improvement for the awarding organisation, including follow up regulatory activity if necessary. "
        },
        {
            "heading": 2,
            "text": "Giving confidence to apprentices and employers  "
        },
        {
            "text": "From design through to assessment development and monitoring of delivery, all of Ofqual’s tools are used to ensure that EPAs are assessing the right thing in the right way to provide both accurate and useful results. This means apprentices and employers can be confident that these assessments are carried out fairly, indicate the right level of competence, and will stand the test of time.  "
        },
        {
            "text": " "
        },
        {
            "text": "Catherine Large OBE\nExecutive Director, Vocational and Technical Qualifications "
        }
    ]
}