{
    "url": "https://ipa.blog.gov.uk/2023/02/08/national-apprenticeship-week-2023-the-worlds-best-kept-secret/",
    "title": "From growing up watching PMQs to supporting the delivery of government's major projects",
    "authors": [
        "Luke Cryan"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Project Futures"
    ],
    "pub_date": "2023-02-08T14:44:59+00:00",
    "content": [
        {
            "text": "This week marks National Apprenticeship Week 2023 (NAW23). At the Infrastructure and Projects Authority (IPA), we wanted to celebrate the brilliant and inspiring apprentices across government, by hearing from one of our own, Luke Cryan (Project Futures Team) as he reflects on his journey so far and the opportunities he has had throughout his time on the government apprenticeship scheme. "
        },
        {
            "text": "An apprenticeship was the obvious choice. However, the prospect of leaving a well-trodden route of attending a traditional academic institution felt like a risk. After all, I loved learning, and there was not any particular push from my teachers or auxiliary figures towards other routes than good A-Levels, followed by a The Universities and Colleges Admissions Service (UCAS) application."
        },
        {
            "text": "How could I preserve that love for learning, enter the workforce and develop my corporate skills ahead of the curve… and earn a living at the same time? An apprenticeship seemed slightly too good to be true - but it turned out to be one of the best decisions I have ever made."
        },
        {
            "text": "\"I remember rushing home after school on a Wednesday to catch up on Prime Minister's Questions\""
        },
        {
            "text": "A government apprenticeship is the perfect foot in the door to something I have a keen interest in and feel passionate about - politics. When I was 16-years old, I remember rushing home after school on a Wednesday to catch up on Prime Minister's Questions. My curiosity of government has been in my DNA since I was old enough to have developed interests. So to now start my career in government through an apprenticeship is incredibly exciting."
        },
        {
            "text": "I consider myself very lucky to have undertaken a government apprenticeship, because I have found they are designed around one fundamental principle: opportunity. I have been given the opportunity to be completely immersed in something that I love and to develop many soft skills in the real world at the age of 17, which has stood me in good stead since."
        },
        {
            "text": "\"A whole new world of how the government delivers its agenda\""
        },
        {
            "text": "The breadth and scope of work I have been involved with has been incredible. At the IPA, I have become closely involved with some of the most interesting and complex projects and programmes that are being delivered by the government. They have given me an insight into a whole new world of how the government delivers its agenda and, most importantly, a new range of skills and working practices to take forward into my career."
        },
        {
            "text": "While completing my apprenticeship, I was able to gain a promotion into a policy role. I have had the opportunity to work on the immediate pandemic response, lead the drafting of our responses to major industry and parliamentary reports, input into the Spending Review and work on the IPA’s flagship change programme - Transforming Infrastructure Performance: Roadmap to 2030 (TIP). TIP has a huge focus on protecting our environment and delivering government net zero targets. As such, I have had the pleasure of speaking to another brilliant apprentice working at The Environment Agency, called Celia McNally."
        },
        {
            "text": "Building connections across government"
        },
        {
            "text": "Celia began her apprenticeship at the Environment Agency mid-career. She is an experienced project and delivery assurance manager in Flood Risk Management and co-leads the department’s staff network for dyslexia. This demonstrates that an apprenticeship is not exclusively for school leavers like myself, but also for talented professionals looking to expand their skills and take on new challenges. It was great to be in a call with Celia - sharing stories, tips and tricks - the apprenticeship being the tether that brought it all together."
        },
        {
            "text": "Apprenticeships are hubs for inclusivity. Whether it’s lifelong learning, neurodiversity or social mobility, apprenticeships prove to be a vehicle for breaking through barriers via personal achievement and growth. Celia and so many others are a shining example of this. "
        },
        {
            "text": "Our reflections"
        },
        {
            "text": "As we were discussing what we had found to be most beneficial about apprenticeships, Celia commented that when it comes to acquiring knowledge and experience, this route comes out top. In my view, this approach supports your future goals far more than other methods of learning. "
        },
        {
            "text": "It made me think of the doctrinal iron triangle of project management that, ironically, I learnt during the project management module of my apprenticeship - time, cost and scope, as the main forces of quality. An apprenticeship seems to get this right."
        },
        {
            "text": "There is an apprenticeship for almost every career now and whatever your interest, there will be something that suits you and your background. It has been an amazing experience for me, for Celia, and for countless other people who have had their lives changed or otherwise massively impacted because of taking on an apprenticeship scheme. This would form the basis of the single and simple piece of advice for someone thinking about doing an apprenticeship - go for it!"
        }
    ]
}