{
    "url": "https://apprenticeships.blog.gov.uk/2023/02/08/national-apprenticeship-week-2023-introducing-some-of-ifates-apprentice-network/",
    "title": "National Apprenticeship Week 2023: introducing some of IfATE's apprentice network",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "National Apprenticeship Week",
        "The Institute"
    ],
    "pub_date": "2023-02-08T11:04:37+00:00",
    "content": [
        {
            "text": "This week is National Apprenticeship Week 2023. To celebrate, we want to introduce some of IfATE's own apprentices, who are part of a newly formed apprentice network within the organisation."
        },
        {
            "text": "Following the latest apprentice panel survey, six recommendations were made, one of which was to improve provision for apprentice networks and other sources of support. IfATE is now leading by example with the creation of an apprentice network, which will help to foster a sense of community and support for our very own apprentices."
        },
        {
            "heading": 2,
            "text": "Chloe, Level 4 Market Research"
        },
        {
            "text": "I’m doing an apprenticeship in market research because I have always enjoyed being involved in collecting, interpreting, and analysing data and information, having had some experience of this whilst at university and in my prior roles. I prefer learning on the job and feel I get much more out of applying what I’m learning directly into my role by doing an apprenticeship. I am in the communications team, and they have been a wonderful support. I have been able to go out filming with a colleague working on the digital side of things, allowing me to get a broad sense of what the rest of the team do."
        },
        {
            "text": "I love being able to get a good spread of experience through working with different colleagues, as it’s also helped me in getting to know them and their roles better, and the ways that I can help add to that through my own role."
        },
        {
            "heading": 2,
            "text": "Alex, Level 4 Commercial Procurement & Supply"
        },
        {
            "text": "I decided to undertake an apprenticeship due to some concerns I faced at university. I feel more confident working and learning, as opposed to taking a gap year to find relevant work experience. I found that doing an apprenticeship was better suited in helping me obtain my goals."
        },
        {
            "text": "My most enjoyable moment so far was being invited to attend the apprenticeship award ceremony in December 2022 with Jennifer Coupland, the chief executive of IfATE. Being able to witness the hard work and seeing the progress of all apprentices was extremely beneficial and inspiring. I was able to understand the work conducted here at IfATE first-hand during the very start of my new career. I look forward to achieving my goals, gaining hands-on experience and learning from experts and staff alike."
        },
        {
            "heading": 2,
            "text": "Grace, Level 3 Human Resources"
        },
        {
            "text": "I’m doing an apprenticeship in human resources (HR) because I have always enjoyed being involved in the people side of an organisation, having had some experience of this in my previous role working for private companies. I enjoy building my skills and gaining knowledge through learning on the job as I can apply my experience in my role to learning opportunities and develop within those. My apprenticeship has given me the opportunity to work with senior staff to develop a deeper insight to HR. This qualification is highly regarded within the HR sector and will benefit my career in the future."
        },
        {
            "text": "In my role, I have the opportunity to onboard apprentices, allowing me to foster open communication with various training providers and see the beneficial support they provide."
        }
    ]
}