{
    "url": "https://homeofficemedia.blog.gov.uk/2023/02/08/prevent-and-channel-factsheet-2023/",
    "title": "Prevent and Channel factsheet - 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Uncategorised"
    ],
    "pub_date": "2023-02-08T12:26:17+00:00",
    "content": [
        {
            "text": "What is the Prevent programme?"
        },
        {
            "text": "The early intervention support provided by Prevent addresses the personal, ideological, and social factors which make people more receptive to radicalisation, diverting people away from becoming terrorists or supporting terrorism."
        },
        {
            "text": "The programme:"
        },
        {
            "text": "What is a Prevent referral?"
        },
        {
            "text": "A Prevent referral can be made by anyone who is concerned that they, or someone they know, is susceptible to radicalisation or being drawn into terrorism. This could be a family member, friend, colleague, or a professional."
        },
        {
            "text": "If an individual is found to represent a security threat, they will always be referred to the police for further investigation."
        },
        {
            "text": "Prevent referrals are not made to the Home Office; they are handled by expert officers in the local police force."
        },
        {
            "text": "When a referral is made, initial checks will be conducted and if the individual is found to not be at risk of radicalisation, the case is immediately closed to Prevent."
        },
        {
            "text": "Making a referral"
        },
        {
            "text": "If someone is worried about another individual becoming radicalised and would like to seek advice before making a referral, they can contact their local authority safeguarding team, or speak to a teacher, healthcare provider or another trusted authority. Contacting the authorities will not get the person into trouble if a criminal act has not been committed. The local authority or police can discuss concerns, suggest how they can best help and provide access to relevant support and advice."
        },
        {
            "text": "Alternatively, people can visit Counter Terrorism Policing’s safeguarding website, ACT Early or call the national police Prevent advice line on 0800 011 3764 to discuss their concerns."
        },
        {
            "text": "Teachers and parents can also learn more on the Educate Against Hate website."
        },
        {
            "text": "What is Channel?"
        },
        {
            "text": "If the referral progresses and it is assessed that there is a genuine risk of radicalisation, the case is considered by a multi-agency ‘Channel Panel’ of professionals who collectively assess the case and decide on a tailored package of support that can be offered to the person."
        },
        {
            "text": "The Channel panel is chaired by the local authority and can include a variety of partners such as the police, children’s services, social services, education professionals and mental health care professionals."
        },
        {
            "text": "What kind of support is offered via Channel?"
        },
        {
            "text": "If a Channel intervention is required, a tailored support package will be offered. This could include mentoring, theological guidance, education, and careers assistance to those assessed as being at risk of radicalisation and requiring support. This is known as Channel in England and Wales, and Prevent Multi-Agency Panels (PMAP) in Scotland."
        },
        {
            "text": "Channel is voluntary and people who are referred to Prevent must give consent (via a parent or guardian if they are underage) before they can be given support."
        },
        {
            "text": "If a person does not engage with Channel or decides not to continue with the process for any reason, alternative forms of support may be available from the local authority or other providers. Any risks are then carefully managed by the police."
        },
        {
            "text": "A network of partners delivers Prevent in local communities"
        },
        {
            "text": "Statutory partners: Under the 2015 Prevent Duty, institutions including schools, colleges, universities, health, local authorities, police, and prisons must consider the risk of radicalisation as part of their day-to-day safeguarding work. This duty means having ‘due regard’ to the need to prevent people from being drawn into terrorism. As the threat of radicalisation evolves, we have updated our training for frontline professionals to help equip them with the skills and knowledge to spot the signs of radicalisation and make a referral where appropriate."
        },
        {
            "text": "Local authorities: Oversee delivery of the programme locally, collaborating with partners to understand and respond to local risks. Areas where the risk of radicalisation is highest have dedicated Prevent Coordinators, whereas others are supported by Home Office Regional Advisors."
        },
        {
            "text": "Civil society organisations: Prevent provides funding for a wide range of organisations across the country. Projects include a variety of initiatives, such as critical thinking workshops, the use of sport as intervention and online safety training for parents. This empowers and builds resilience in communities enabling them to challenge extremism and terrorism wherever it tries to take root."
        },
        {
            "text": "Independent Review of Prevent"
        },
        {
            "text": "What is the Independent Review of Prevent?"
        },
        {
            "text": "During the passage of the Counter Terrorism and Border Security Act 2019 on 12 February 2019, the government committed to carrying out an independent review of Prevent."
        },
        {
            "text": "William Shawcross was appointed as the Independent Reviewer of Prevent on 26 January 2021. The independent review considered the UK’s strategy for protecting people vulnerable from being drawn into terrorism, and made recommendations to improve Prevent."
        },
        {
            "text": "The Independent Review of Prevent and HM Government’s response was published on Wednesday 8 February 2023."
        },
        {
            "text": "What changes are being made to Prevent following the Independent Review of Prevent?"
        },
        {
            "text": "The Independent Review of Prevent paves the way for a stronger, more transparent, and proportionate approach to stopping people from being radicalised into supporting terrorism."
        },
        {
            "text": "To address the disparate terrorist threat, Prevent will move from a local model of delivery to a regional one, driving up Prevent delivery standards nationwide through increased join up between the police and regional partners."
        },
        {
            "text": "Prevent Duty Guidance will be updated to ensure a consistent referral process across national and local delivery, and those sectors under the Duty. Further work is already underway to consider extending the Prevent Duty, to broaden the touch points in place for frontline professionals to identify and refer relevant concerns to Prevent."
        },
        {
            "text": "All local authorities in England and Wales will have access to expert Prevent support from the Home Office, enabling resource to be surged into areas to meet radicalisation risks."
        },
        {
            "text": "Prevent will work closely with DLUHC and the Commission for Countering Extremism to develop new training to ensure better understanding of ideology across Prevent teams. It will also review its wider training to ensure it aligns with the findings of the Independent Review."
        },
        {
            "text": "These improvements will ensure Prevent fully aligns with the threats we face and the ideologies underpinning them."
        },
        {
            "text": "When will the government implement the Independent Reviewer’s recommendations?"
        },
        {
            "text": "We intend to implement the majority of these recommendations within the next twelve months. To ensure transparency, the Home Office will report on implementation of the recommendations a year from now."
        },
        {
            "text": "Key Prevent statistics and facts"
        },
        {
            "text": "Since the introduction of the Prevent Duty in 2015, over 3,800 referrals have been supported through the Channel Programme. Channel aims to move individuals away from violent ideologies that could have resulted in harm to themselves or others. 6,406 referrals to Prevent were made in the year ending on 31 March 2022."
        },
        {
            "text": "This is an increase of 30% compared to the year ending March 2021 (4,915), likely to have been driven by the associated impacts of lifting the public health restrictions that were in place to control the spread of the coronavirus (COVID-19)."
        },
        {
            "text": "Of those in custody for terrorism-connected offences in Great Britain as at 30 September 2022, 65% were categorised as holding Islamist-extremist views, 28% were categorised as holding Extreme Right-Wing ideologies, and the remaining 8% were categorised as holding beliefs related to other ideologies. These figures include both those that had been convicted and those being held on remand (that is, held in custody until a later date when a trial or sentencing hearing will take place)."
        },
        {
            "text": "Of all the Prevent referrals in 2021/2022:"
        },
        {
            "text": "The threat from Islamist terrorism remains the foremost and most significant. Through the implementation of the Independent Review of Prevent, greater emphasis will be placed on tackling Islamist ideology."
        },
        {
            "text": "There were 804 referrals adopted as a Channel case in the year ending March 2022. 13% of referrals to Prevent were adopted as a Channel case."
        },
        {
            "text": "Prevent addresses all forms of terrorism. Of all the Channel cases adopted in 2021/2022:"
        },
        {
            "text": "Individuals aged 15 to 20 accounted for the largest proportion (30%) referrals, with individuals aged under 15 accounting for 29%, followed by individuals aged between 21 and 30 (16%)."
        },
        {
            "text": "Rehabilitation"
        },
        {
            "text": "The Desistance and Disengagement Programme (DDP) works with individuals who have crossed the line into terrorist activity, aiming to reduce the risk they pose to the UK. The programme works by providing intensive, tailored interventions which support them to stop engaging in terrorist related activity (desist) and to move away from terrorist ideology (disengage)."
        },
        {
            "text": "The programme runs alongside existing statutory risk assessment and management processes such as the Multi Agency Public Protection Arrangements (MAPPA) for managing offenders, to ensure it bolsters and complements work being done through existing frameworks. It is not a replacement for any police investigation or prosecution on individuals who have committed terrorism offences, either abroad or at home."
        }
    ]
}