{
    "url": "https://space.blog.gov.uk/2023/02/08/the-night-sky-in-february-3/",
    "title": "The night sky in February",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-02-08T16:51:58+00:00",
    "content": [
        {
            "text": "This month provides a great chance to catch a glimpse of a comet and watch bright planets Venus and Jupiter appear to move towards each other in our evening skies."
        },
        {
            "heading": 2,
            "text": "Comet C/2022 E3 ZTF"
        },
        {
            "text": "Those with binoculars or a telescope will still be able to see Comet C/2022 E3 ZTF as a fuzzy patch of greenish light over the next couple of weeks."
        },
        {
            "text": "The comet was discovered in March last year by the Zwicky Transient Facility (hence the ‘ZTF’ in the name) based in California, as it approached the inner Solar System.  It swung around the Sun in January and passed 42 million kilometres (26 million miles) from Earth on 1 February."
        },
        {
            "text": "The comet is currently passing through the constellation of Auriga and will appear close to Mars in the constellation of Taurus on 10 -11 February. It will then approach and pass the giant star Aldebaran on 14 February, before appearing to glide down the right side of Orion the Hunter over the following week."
        },
        {
            "text": "You can find a star-map of this patch of sky in last month’s blog."
        },
        {
            "heading": 2,
            "text": "The Moon and planets"
        },
        {
            "text": "The brightest planets in our night sky move towards a spectacular conjunction this month, as Jupiter and Venus appear to move closer to each other in the western sky soon after sunset."
        },
        {
            "text": "The two will be joined by an eight percent illuminated crescent Moon on the evening of 22 February – a must see if the skies are clear - before they set just after 8pm."
        },
        {
            "text": "The two planets reach their apparent closest point at the start of March where with the naked eye they’ll appear to form one large, bright point of light in the evening sky."
        },
        {
            "text": "Saturn drifts behind the Sun from our perspective this month, reappearing next to Mercury (or so it will seem from Earth) in the dawn skies."
        },
        {
            "text": "Mars is still a colourful sight in the constellation of Taurus, but it is fading rapidly in brightness now, with some of the brighter stars nearby, such as Capella, Rigel and Betelgeuse outshining the red planet."
        },
        {
            "text": "Mars will once again be eclipsed by the Moon this month, though sadly the event won’t be visible from the UK as both will have set in the pre-dawn skies minutes before the eclipse takes place."
        },
        {
            "text": "If you’re up early on the morning of 28 February, however, take a look toward the north-western horizon as the two appear to approach each other – the contrast of the pale Moon with the red planet is always great to see."
        },
        {
            "heading": 2,
            "text": "Other night sky sights"
        },
        {
            "text": "Despite being nicknamed the ‘Seven Sisters’ because of its brighter members, the Pleiades star cluster consists of several hundred stars that sit around 440 light years away from Earth.  The larger, brighter members of the cluster are several times larger than the Sun."
        },
        {
            "text": "The stars are ‘only’ around a hundred million years old, and the cluster is currently travelling through an enormous cloud of gas that’s drifting around our galaxy.  This gas is only visible to us because it’s being illuminated by the stars as they travel through it, and it can be seen through a telescope or with long exposure photography."
        },
        {
            "text": "Have a look for this beautiful star cluster this month, high in the southern sky as darkness falls."
        }
    ]
}