{
    "url": "https://healthmedia.blog.gov.uk/2023/04/04/adult-social-care-reform-media-fact-sheet/",
    "title": "Adult social care reform - media fact sheet",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "Social Care"
    ],
    "pub_date": "2023-04-04T07:05:58+01:00",
    "content": [
        {
            "text": "*Updated 04 April 2023*We have set out measures to support people who receive care, and staff and providers of care.This includes the publication of a refreshed plan to further digitise the social care sector and bolster the workforce, and more funding to speed up discharge from hospital.Here’s what you need to know about our plans. What have you announced?We have published Next Steps to Put People at the Heart of Care, which builds on commitments outlined in the People at the Heart of Care white paper – published in December 2021.We’ve previously announced up to £7.5bn additional funding for ASC, which builds on an existing £1.7bn for reform, and today we set out plans for how over £2bn of that funding will be used to improve adult social care.The plan sets out how we are taking forward reforms to support workforce development, enable sector digitisation, keep people independent at home, and improve local authority oversight and new data collections. We are also increasing the Better Care Fund, which brings together health, social care and housing to help older people and those with complex needs live at home for longer. This will increase from £7.7 billion last year to £8.1 billion in 2023 and £8.7 billion in 2024. This includes £1.6 billion to improve hospital discharge arrangements.  What is included in the social care reform package?More than £2 billion of previously announced funding will go towards improvements including:"
        },
        {
            "text": "How is this different from the People at the Heart of Care white paper?"
        },
        {
            "text": "How are you delivering your workforce commitments?"
        },
        {
            "text": "The Prime Minister has recently reiterated the importance of reforming the adult social care workforce, with a focus on professional development, skills and career progression. Our £250 million investment in the workforce remains the biggest part of our reform package."
        },
        {
            "text": "Are you halving the workforce funding?"
        },
        {
            "text": "How is the funding being allocated?"
        },
        {
            "text": "How are you supporting integrated housing?"
        },
        {
            "text": "How are you supporting unpaid carers?"
        }
    ]
}