{
    "url": "https://socialcare.blog.gov.uk/2023/04/04/help-us-shape-a-career-pathway-for-care-workers/",
    "title": "Help us shape a career pathway for care workers",
    "authors": [
        "Deborah Sturdy",
        "Oonagh Smyth"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Consultations and surveys",
        "Guidance",
        "Recognition",
        "Social care reform"
    ],
    "pub_date": "2023-04-04T15:57:10+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making the most of our people"
        },
        {
            "text": "We are a people focused service, so establishing and maintaining strong relationships with care workers and supporting them in the attainment of high skill levels will always be the foundation of outstanding care."
        },
        {
            "text": "These personal and professional relationships also have to work both ways, where people working in care can achieve their full potential, and, just as importantly, feel valued as they deliver high-quality care in our communities."
        },
        {
            "text": "So that’s why we are asking employers, people who draw on care and support and anyone interested in supporting that process to submit evidence to the Department of Health and Social Care’s call for evidence for a ‘care workforce pathway’ for adult social care careers."
        },
        {
            "text": "The insights we gather will help us develop that pathway and establish what’s needed to embed it, so it becomes a recognised benchmark for career development across social care."
        },
        {
            "text": "It will help us think about the essential knowledge, skills, values and behaviours needed for someone to work effectively in adult social care. It will also look at how we can better signpost career opportunities and progression routes across the system."
        },
        {
            "heading": 2,
            "text": "Help us build on our learning so far"
        },
        {
            "text": "We already know access to career-long learning and development opportunities improves quality of care offered, access to other care roles and boosts workforce retention. Adding your voice to this call for evidence will help us enhance all these things."
        },
        {
            "text": "A clear workforce pathway, based on feedback from across the care sector, can only empower people working in care to develop themselves and their careers in a positive learning environment. The pathway will support them to gain new skills, access learning and development that meets their needs at different points in their working lives and progress careers in a way that meets their aspirations, whatever they may be."
        },
        {
            "text": "We believe a social care workforce pathway can set out universal definitions of roles that employers, and those working in the sector, can recognise and map their own roles onto."
        },
        {
            "text": "The first priority is to focus on the care worker role and make sure it offers a clear career pathway with the necessary training and support for progression to new or more senior roles. This, we believe, will help to increase recognition of social care as a viable and rewarding profession."
        },
        {
            "text": "It's so important this pathway builds on what works and draws on the experiences of all those working in care to enhance the experiences of all those we support."
        },
        {
            "text": "We really encourage all of you involved in delivering or accessing social care to make sure your voices are heard as we begin to develop the training and career progression of tomorrow. It’s your chance to influence the future of social care in a really direct way and help us meet the hopes and dreams of all the people who work in this amazing profession."
        }
    ]
}