{
    "url": "https://naturalengland.blog.gov.uk/2023/04/04/how-new-fire-management-partnerships-are-helping-nature-to-recover-at-hatfield-moors/",
    "title": "How new fire management partnerships are helping nature to recover at Hatfield Moors",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Landscapes and access",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery Network",
        "Parks, trails and nature reserves",
        "Peat",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2023-04-04T17:16:28+01:00",
    "content": [
        {
            "text": "Almost three years on from a serious wildfire at Hatfield Moors near Doncaster, nature is in recovery thanks to an ever-stronger partnership between Natural England and South Yorkshire and Humberside Fire and Rescue Services."
        },
        {
            "text": "A new, jointly written Wildfire Management Plan is in action to prevent future fires and guide the work of reserve staff and firefighters, with visitors playing their part too."
        },
        {
            "text": "Over the summer of 2022 the plan proved its worth when despite unprecedented heatwaves there were no serious fires – a win for nature and people at this nationally important wetland, which is part of the Humberhead Peatlands National Nature Reserve."
        },
        {
            "text": "Now, the team behind the plan want to share their experience to help others write their own nature reserve Wildfire Management Plans."
        },
        {
            "text": "Building partnerships for nature"
        },
        {
            "text": "Julian Small is the Senior Reserve Manager for Natural England at Hatfield Moors and for him, 2020’s wildfire struck home the need for proactive wildfire management on our nature reserves."
        },
        {
            "text": "“Wildfire plans are even more important in the face of a changing climate where summer droughts will become more frequent and more severe,” he says. “Extinguishing the wildfire and managing the wider impacts was a real team effort, led by the Fire and Rescue Service and supported by Natural England, Doncaster Council, the Police and the Environment Agency. Afterwards, we collectively came together as a Wildfire Recovery Group and incorporated the lessons learned into a multi-agency Wildfire Response Plan, detailing how we would work together in the event of another incident.”"
        },
        {
            "text": "Rich Leighton, Station Manager at Thorne Fire Station adds, “We wanted to learn lessons and mitigate the risk of a fire happening again as best we can going forwards.”"
        },
        {
            "text": "This joint response plan is now part of the nature reserve’s Wildfire Management Plan. It acts as a source of vital information that is readily accessible during an incident and sets out the roles of each agency in managing a serious wildfire."
        },
        {
            "text": "Prevention is better than cure"
        },
        {
            "text": "Fire prevention is always the first goal however and is at the heart of the new Wildfire Management Plan for the Humberhead Peatlands National Nature Reserve."
        },
        {
            "text": "Every day, Natural England staff monitor both the Met Office’s Fire Severity Index and the Daily Hazard Assessment produced by the Natural Hazards Partnership. Reserve staff and the fire and rescue service can then take appropriate fire prevention steps, from updating signage and making sure emergency equipment is ready, to communicating fire risk to visitors using social media, and – in extreme cases – closing the reserve."
        },
        {
            "text": "Everyone at the reserve – from wardens to visitors – has a role to play, whether that’s managing reserve vegetation and maintaining machinery to following the Countryside Code."
        },
        {
            "text": "Julian Small says, “Unfortunately, evidence shows that many wildfires start by accident. So following the Countryside Code is the number one thing that all of us can do. In places like Hatfield Moors, that includes not bringing BBQs onto the site or dropping litter, and not lighting fires or camping stoves. If visitors see flames, they should dial 999.”"
        },
        {
            "text": "Being ready for a fire"
        },
        {
            "text": "Of course, fires are still possible and so the plan also includes actions to reduce the spread of fire and the risk of damage to people and wildlife."
        },
        {
            "text": "Detecting a fire early is vital, so based on their daily hazard assessments, reserve wardens now increase monitoring if the risk of fire severity is high. Staff, volunteers and neighbours are all involved too and aware of key contacts and procedures if they see a fire or smoke."
        },
        {
            "text": "To help stop a fire spreading, reserve mangers have set up fire control lines alongside other emergency strategies including high volume pump water sources."
        },
        {
            "text": "A fire control line is an area that is more resilient to fire, such as a firebreak, dense deciduous woodland or boggy or re-wetted areas."
        },
        {
            "text": "Fire control lines can slow the spread of a fire and provide access to fire and rescue services."
        },
        {
            "text": "Training and equipment has also been improved as part of the plan. More reserve staff now attend Lantra Wildfire Operators Training and there is at least one joint training exercise with the South Yorkshire and Humberside Fire and Rescue Service each year."
        },
        {
            "text": "For Rich Leighton, being ready is essential. “It’s about getting everything in order so that if a fire does start, we’re prepared for it. It’s really important for the fire service that we get off to a good start. The impact of this can be massive and stop an incident from becoming serious.”"
        },
        {
            "text": "In future"
        },
        {
            "text": "Hatfield Moors’ Wildfire Management Plan has proven so successful that it will be incorporated into the reserve’s wider Site Management Plan. Regular reviews and updates will be part of future work too."
        },
        {
            "text": "What can land managers take away from Natural England’s experience at Hatfield Moors?"
        },
        {
            "text": "Julian Small sees great benefits in building fire management partnerships. “I’m proud of the plan and the way we’ve been implementing it with the fire and rescue service and other partners for two reasons. First, it’s worked through a summer of unprecedented heatwaves. And secondly, it’s had good feedback both internally and from local partners” he says."
        },
        {
            "text": "Rich Leighton has some advice too. “Go and speak to your nearest fire station manager,” he says. “Whichever brigade that is, get them on board.”"
        },
        {
            "text": "Finally, land managers can also play their part in educating visitors about fire risk using the Countryside Code: Advice for Land Managers. Find out more here."
        }
    ]
}