{
    "url": "https://designnotes.blog.gov.uk/2023/04/04/introduction-to-content-design-course-is-back-on-futurelearn/",
    "title": "Introduction to content design course is back on FutureLearn!",
    "authors": [
        "Laura Hiles – Head of Profession for Content Design, GDS",
        "Tommaso Spinelli – Senior Learning Designer, CDDO",
        "Jane Wilkinson – Senior Content Designer, DWP Digital"
    ],
    "categories": [
        "Content Design",
        "Training"
    ],
    "pub_date": "2023-04-04T12:00:21+01:00",
    "content": [
        {
            "text": "The ‘Introduction to Content Design' online course was launched in 2020, a previous blog covers the pilot and first launch of the course. Over 21,000 learners completed the course in 2020 and 2021, with people from all over the world taking part."
        },
        {
            "text": "This month, Government Campus and the Central Digital and Data Office are launching the next iteration of the course. This is an open course, which means there will be no limit on the number of spaces or who can sign-up."
        },
        {
            "text": "The 4-week online course will be available from 10 April and you can register now."
        },
        {
            "heading": 2,
            "text": "Who the course is for"
        },
        {
            "text": "The course is designed for people who are new to content design in government, or are interested in learning more about the profession."
        },
        {
            "text": "The principles and ideas covered will also be useful for anyone who would like to learn more about how to:"
        },
        {
            "heading": 2,
            "text": "What the course includes"
        },
        {
            "text": "The course is based on the UK government content design role profile and GOV.UK content design guidance.\nYou will learn about a range of topics, including:"
        },
        {
            "text": "There is a mix of articles, videos and quizzes, as well as optional tasks and polls."
        },
        {
            "text": "You can get a certificate that shows you have completed this course at the end. Also, if you are studying a related subject at a UK university, some universities may award up to 20 credits for completing this course."
        },
        {
            "heading": 2,
            "text": "Social learning"
        },
        {
            "text": "FutureLearn, where the course is hosted, is a social learning platform. Interaction between learners is built into the way the platform works."
        },
        {
            "text": "Each section gives you the opportunity to chat to other learners about the subjects and activities covered. You can comment as much or as little as you want."
        },
        {
            "text": "During the 4-week course run, educators from the cross-government content community will also be there to chat to learners in the comments. We look forward to seeing you there."
        }
    ]
}