{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/04/04/next-steps-for-social-care-reform-and-the-voice-of-adult-social-work/",
    "title": "Next steps for social care reform and the voice of adult social work",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Communities",
        "Consultation and engagement",
        "Guidance",
        "Knowledge and skills",
        "Our profession",
        "Recognition",
        "Recruitment"
    ],
    "pub_date": "2023-04-04T12:03:33+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The benefit of insight"
        },
        {
            "text": "It is one of the privileges of being Chief Social Worker for Adults that my professional colleagues and I can offer our advice, insight and guidance to inform major social care initiatives in England."
        },
        {
            "text": "Although progress towards real and sustained care sector reform remains challenging, the voice of adult social work has a powerful and constructive role to play, not least in how our practice can be used to provide enhanced support to those who need it most."
        },
        {
            "text": "The People at the Heart of Care white paper, published in December 2021, set out the Government’s 10-year vision for adult social care. Adult social work’s focus on holistic, person centred care and support is its foundation."
        },
        {
            "text": "Now, with the publication of Next Steps to Put People at the Heart of Care, we’re helping to refine and strengthen that vision. This is not just about funding (although that’s important of course), but also practical and emphatic steps to improve quality of care for the more than 10 million people in England who receive it."
        },
        {
            "text": "The best kind of support is that which empowers and emboldens individuals, families and communities to lead the best lives they can – lives which give them as much autonomy as possible, whilst building wider networks of mutual support."
        },
        {
            "text": "However, to do this effectively, we need to support our amazing care workforce to feel valued, supported and equipped with the tools and experience they need to serve the increasingly complex demands of a growing, aging and diversifying population."
        },
        {
            "text": "Recruitment and retention of adult social workers, indeed of social care professionals as a whole, remains a critical issue to resolve. Ethical overseas recruitment has played an important part in mitigating the problem, especially since care colleagues, including social workers, became eligible for the Health and Care Worker visa and were added to the shortage occupation list in February 2022."
        },
        {
            "text": "Meanwhile, I am very pleased the Government continues to fund Skills for Care’s package of support across workforce training and development, which includes specific support for social workers. The organisation has also collaborated with the Department of Health and Social Care on a new call for evidence to determine new career paths with nationally defined roles."
        },
        {
            "heading": 2,
            "text": "The part we play"
        },
        {
            "text": "It’s welcome and reflects an approach I have long advocated, when we established knowledge and skills frameworks for all social care workers and the promotion of social work expertise in specific practice specialisms, including mental health, autism, dementia, drug and alcohol misuse."
        },
        {
            "text": "Why is all this so important? Because social workers play a vital role in delivering a social work service as well as assessing and supporting people with multiple complex needs. When you consider the additional stresses and uncertainties of the last few years (pandemics, wars, cost of living and natural disasters), our nuanced and empathic approach is needed more than ever."
        },
        {
            "text": "A case in point is the continuation of our Think Ahead programme, the fast track graduate scheme to create qualified social workers who specialise in supporting people with mental health needs. Additional support continues through the Education Support Grant and Social Work Bursary, which can sometimes be the critical factor in helping prospective social workers realise their professional dreams."
        },
        {
            "text": "I must thank the Adult Principal Social Worker Network for all they do to support new and existing social workers and also Deborah Sturdy, the Chief Nurse for Adult Social Care who, like me, is committed to the upskilling and recognition of care staff throughout England. We are both passionate about encouraging leadership, facilitating innovation and sharing best practice guidance throughout the social care workforce."
        },
        {
            "heading": 2,
            "text": "Principals and principles"
        },
        {
            "text": "Alongside work to improve our adoption and use of digital tools in our practice and closer working with local authorities to enhance service provision, I am also working with Principal Social Worker Networks and SCIE (the Social Care Institute for Excellence) to consider ways in which we can improve the access and timeliness of social care assessments for people and their carers."
        },
        {
            "text": "This work will help us develop principles to streamline the care and needs assessment process, eliminating bureaucracy but, more importantly, reducing delay, stress and uncertainty for those we are tasked to help."
        },
        {
            "text": "Providing training and support for social care staff, contributing to care act assessment work, is important as well as making sure we deploy our valued social workers to work with people in the most complex and challenging circumstances."
        },
        {
            "text": "More broadly, this is what Next Steps is all about: providing stability, certainty and positive progression for those who work in care and the people they support. I am proud of adult social work’s role in this endeavour and look forward to working with my colleagues, inside and outside this incredible profession, to transform many more lives, careers and dreams in the months and years ahead."
        }
    ]
}