{
    "url": "https://nda.blog.gov.uk/nuclear-is-green-and-the-perfect-career-challenge-for-those-passionate-about-the-environment/",
    "title": "“Nuclear is green… and the perfect career challenge for those passionate about the environment”",
    "authors": [
        "Martin Clough"
    ],
    "categories": [
        "Skills",
        "skills"
    ],
    "pub_date": "2023-04-04T11:31:52+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Nuclear and environment haven’t always been close bedfellows"
        },
        {
            "text": "The recent classification of nuclear as a green energy is interesting, because nuclear and environment haven’t always been close bedfellows."
        },
        {
            "text": "On one hand, I think using the term green energy is helpful because it starts to break down the stigma that exists around nuclear – there's still a bit of myth-busting that needs to take place."
        },
        {
            "text": "On the other hand - in my humble opinion - I think ‘clean energy’ would be a closer match."
        },
        {
            "text": "That’s because there isn’t a way to generate energy without creating some form of environmental impact, some of which can be more persistent and/or visible than others."
        },
        {
            "heading": 2,
            "text": "Nuclear energy’s place in the energy mix"
        },
        {
            "text": "Solving the energy crisis that we’re living through will demand a mix of energy sources. The fact that our national demand for energy isn’t decreasing is a crucial part of that mix."
        },
        {
            "text": "Since 1956, UK nuclear power has saved 2.3 billion tonnes of carbon emissions, the equivalent of all the UK’s emissions from 2015 to 2020."
        },
        {
            "text": "Nuclear energy isn’t a panacea, and it won’t solve all the problems, but as a dependable energy source I think it does have a significant part to play in providing the long-term stability we need."
        },
        {
            "text": "While I believe that nuclear is a clean energy source, I also believe that you don’t need to work in the power generation part of our industry to make a positive contribution to our environment."
        },
        {
            "text": "At Sellafield – the birthplace of the country’s nuclear capability and possibly one of the most iconic nuclear sites in the world – the environment now sits at the heart of our purpose. We’re creating a clean and safe environment for future generations."
        },
        {
            "heading": 2,
            "text": "Looking to the future"
        },
        {
            "text": "Sellafield has served the country in a variety of ways – from the production of nuclear materials for national defence and generating electricity to recycling used nuclear fuel through a process called reprocessing and developing ways to look after all types of nuclear waste."
        },
        {
            "text": "Today we look after the county’s stockpile of nuclear materials, safely manage nuclear waste and – crucially – are reducing the environmental risk posed by our legacy ponds and silos by retrieving the nuclear wastes held inside the 70+ year-old storage facilities."
        },
        {
            "text": "To do that we are building on an epic scale, building the facilities we need to keep nuclear materials and wastes safe and secure."
        },
        {
            "text": "Across our operations we have the potential to have an impact on the environment. It is my team’s job to help make sure that the impact is a positive one."
        },
        {
            "heading": 2,
            "text": "Sellafield is creating a clean and safe environment for future generations "
        },
        {
            "text": "The importance of understanding our environment has always been recognised. We have one of the most comprehensive and long-running environmental monitoring programmes in the UK. In fact, this last year marked our 50th anniversary of reporting results from our year-in and year-out environmental sampling and analysis."
        },
        {
            "text": "We do our own monitoring. But we don't mark our own homework. Sellafield has some of the highest levels of regulatory scrutiny of any industry in the UK with external reporting into government to make sure we comply with the strictest standards."
        },
        {
            "text": "For a long time, the focus was on our radioactive discharges. Our track record demonstrates that the routine impacts from our radioactive operations are low."
        },
        {
            "text": "We’ve long recognised that radioactivity isn’t the only impact we present. For example, we also manage all the conventional types of waste that you might come across in any domestic or industrial setting—as well as a wide range of other environmental issues including noise levels, resource use, and ecology."
        },
        {
            "text": "As a large energy user in our own right, we also generate other emissions like greenhouse gases—including carbon dioxide. And we’ve done a lot of work to better understand our carbon footprint. We've got comprehensive data to underpin where we are and have something to drive against in supporting the UK Government’s commitments towards Net Zero."
        },
        {
            "text": "In the field of environmental protection, we have a lot of history that can inform how we can do things better in the future. We’re taking our track record from the past to project where we're headed in the future, and as far as environmental impacts are concerned, we’ll continue to drive those impacts downward."
        },
        {
            "heading": 2,
            "text": "How can environmental specialists help to make Sellafield safer from an environmental perspective?"
        },
        {
            "text": "As well as being one of the longest serving industrial sites, Sellafield is one of the largest construction sites in Europe, so we’re managing the legacy of the nation’s nuclear waste while also ensuring that what we’re building today doesn't generate a clean-up legacy for tomorrow’s generations."
        },
        {
            "text": "My team’s role is to help drive environmental performance up, which means actively driving our impact down, across all aspects of the environment—from our carbon footprint, discharges, energy consumption, and sustainable new builds."
        },
        {
            "text": "Joining our team puts you at the forefront of introducing more sustainable techniques into our construction projects and of helping to keep our discharges low. "
        },
        {
            "heading": 2,
            "text": "What would make someone who chooses a career in protecting the environment want to work somewhere that’s home to some of the biggest potential environmental hazards in the country?"
        },
        {
            "text": "Environment and nuclear haven’t always sat well together, which takes me back to a decision I made a long time ago in answer to the question, ‘Will you sit on the outside, complain and shout—or will you choose to get involved?’"
        },
        {
            "text": "And the truth of the matter is someone has to manage our legacy nuclear waste—we can’t just walk away. And we have an obligation to make sure we do all we can to underpin a robust set of arrangements for managing the past and building a platform for the future."
        },
        {
            "text": "If the environment is where your heart is, where’s better than Sellafield to put your environmental professional credentials on the table and act as part of the solution?"
        },
        {
            "text": "If you're the type of person who rises to a challenge and wants to be part of working out how we getter better at doing things—that’s what you’ll find at Sellafield."
        },
        {
            "heading": 2,
            "text": "What made you want to work in environmental safety at Sellafield?"
        },
        {
            "text": "Did I start out through school and go into university thinking I know I wanted to work at Sellafield? No, I didn’t. And that's despite the fact that I was born and brought up not that far away from our Risley site in Warrington and knew lots of people whose parents were involved in the nuclear industry."
        },
        {
            "text": "And so how did I end up coming here? Well, I started off with civil engineering, then moved into environment because that was going to be the next big thing. And we’re talking 20-plus years ago—so it's only taken me 20 years for us to be the next big thing."
        },
        {
            "text": "One thing that brought me here is the size of the challenge."
        },
        {
            "text": "And I say this to our graduates.  If I cast my mind back to when I first came to site, I think if somebody had flown me up in a helicopter to see it from above and said, “Your job is sorting all that out.” I'd have said, “Wow, let me at it.” While I know for others it would have been, “Get me out of here.”"
        },
        {
            "text": "But the reason I mention the helicopter is because we sit next to some of the most stunning scenery in the world. And for me, from an environmental perspective, Sellafield’s got that stark juxtaposition between a highly secure specialist industrial site and some of the most breath-taking scenery in the UK."
        },
        {
            "text": "If I look out of the back of my office, I'm looking at onto fells. If I look out of the front, I'm looking onto the Sellafield site. It's a daily reminder that we have an obligation and a duty to make sure that as we manage the site, we do so with environmental ethics at the centre. And again, the only way you can do that is by being a part of it."
        },
        {
            "text": "My obligation, by being here at Sellafield, is to make sure that environment is part of all the decisions that we make. I don’t think that there is anywhere better for those people who want to make a positive impact on our environment."
        },
        {
            "heading": 2,
            "text": "What are the critical skills you need to work as an environmental advisor or specialist at Sellafield? "
        },
        {
            "text": "When I when I joined Sellafield 20 years ago there weren't huge numbers of people with pure environmental qualifications and yet somehow, we still had the forming of the team we have today. And how that team has become what it is today is due to a large dose of curiosity."
        },
        {
            "text": "As an environmental specialist, you bring an eagerness to be open and to learn. I think that’s because the reality is that you will never understand everything that we do on that site—ever. There’s so much variety, there aren't enough lifetimes."
        },
        {
            "text": "And we talk about variety, you can either become a super specialist in a very, very niche, very particular aspect, or you can become a generalist who enjoys variety—we attract both skill sets."
        },
        {
            "text": "In some areas of the job the ability to solve problems and be able to take a complex set of information, interpret it, translate it, and convey them back to people in a way they can absorb and make informed decisions about is a key skill."
        },
        {
            "text": "The ability to communicate, collaborate, and distil information from"
        },
        {
            "text": "different sources and from different people are all important."
        },
        {
            "text": "Sellafield Ltd is a large organisation, hence it can sometimes be challenging to navigate through all the different requirements and arrangement. You need the ability to rise above things at times, so a bit of resilience and integrity will get you a long way."
        },
        {
            "text": "I do think you need to have a passion for the environment to come into this business. Today, we’re more involved in the way the business works, which means the value we provide is being recognised. But when you’re here, you are the advocate for the environment and your role is to provide that voice. As an environmental specialist, you are the conscience of the business."
        },
        {
            "heading": 2,
            "text": "Taking a multidisciplinary approach to problem-solving"
        },
        {
            "text": "In terms of its size and scale, Sellafield is a town. And we’re a town that has the most complex, hazardous industrial operations stacked on top of it. We've got everything within our boundary that you could have ever seen in another job, from medical services through to sewage treatment works through to building sites that are tackling some of the most complex constructions in the country. All of that’s in the mix at Sellafield."
        },
        {
            "text": "And we attract a whole mix of people too, from pure scientists and engineers to geologists, geographers, biologists, and chemists—and that means we can take a multi-disciplinary approach to our work."
        },
        {
            "text": "We’ve got people running facilities and plants who literally have hundreds of different things that they have to balance in the operation of that plant and in moving things forward."
        },
        {
            "text": "As the environmental conscience of the business, our environmental advisors and specialists play a critical role. People at Sellafield need to make decisions and take actions that will have consequences that may only be felt decades in the future—and that can be quite a difficult concept to get your head around."
        },
        {
            "text": "Especially if you’re used to sitting at work, making a decision, and seeing the outcome the following day—though we have those roles too."
        },
        {
            "heading": 2,
            "text": "Taking the environment to the top table "
        },
        {
            "text": "We need to be aware that the people in the future will ask why we made the decisions we made. As an environmental specialist here, you're the part of the machinery that makes sure the decision that’s made is the right one from an environmental perspective."
        },
        {
            "text": "In the past, it was sometimes a challenge for environment to get the top table treatment at Sellafield. Back then, people were operating under very different regimes and with different priorities. Today, we’re managing yesterday's problems and they’re problems that didn't have clean-up solutions built into them—or any user manuals or disposal instructions."
        },
        {
            "text": "Our role is to ask the questions—but also come up with the answers that make sure the needs of the environment are given priority and that’s about proportionality and making sure that there’s that balance. And that’s not something you’re expected to do alone."
        },
        {
            "text": "We've got different departments that work together, we've got a network, and we're building a collective voice and a momentum, which is why we're starting to look at who can we bring in to complement what we've already got."
        },
        {
            "text": "And to join us, you don't need to be a master of all these points. You don't have to have a nuclear background. You don't have to have industrial background. It all comes back to having that openness and the ability to look, to absorb, and to learn. And then to take your learning and apply it as part of a collective team. And if you can bring your own particular specialisms and knowledge, we can benefit from that too."
        },
        {
            "text": "While we have answers to a lot of questions—like our 50 years of monitoring and reporting— we don't have answers to all the questions. And so, while we’re pulling from a mix to inform our answers, a lot of the issues we’re addressing are not ‘ifs’, they’re ‘whens.’"
        },
        {
            "text": "Tomorrow will always bring a new challenge at Sellafield—always."
        },
        {
            "text": "If you’re interested in joining Martin and the environment team, here are our latest opportunities."
        }
    ]
}