{
    "url": "https://defrafarming.blog.gov.uk/2023/04/04/slurry-infrastructure-grants-first-round-summary-and-next-steps/",
    "title": "Slurry Infrastructure grants: first round summary and our next steps",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Things we're doing"
    ],
    "pub_date": "2023-04-04T12:56:48+01:00",
    "content": [
        {
            "text": "Offered alongside better advice and fairer, more effective regulation, the Slurry Infrastructure grant is designed to help livestock farmers make better use of their slurries to meet crop need and cut pollution.  "
        },
        {
            "text": "In December, we opened the first round of the Slurry Infrastructure grant for applications.  "
        },
        {
            "text": "In this post, I’ll explain how we chose to prioritise the first round of projects and what will happen next."
        },
        {
            "text": " I’ll also describe some changes we are making to the payment process in light of the high demand for the scheme."
        },
        {
            "heading": 2,
            "text": "First round findings"
        },
        {
            "text": "The online checker closed on 31 January. During that period, we saw very strong interest in the scheme. Given that high demand, we increased the funding for round one from £13.2 million to £33.9 million. "
        },
        {
            "text": "This is consistent with our approach to managing the farming budget. We will respond to farmer demand in a way that keeps us on track to achieve our outcomes."
        },
        {
            "text": "In March, we invited 374 projects to submit a full application."
        },
        {
            "text": "This is our best assessment of how many storage projects the market could handle after speaking to suppliers and installers and considering what types of store farmers applied using the online checker. "
        },
        {
            "text": "Of course, we want to help as many farms as we can to upgrade their slurry storage. However, we need to balance the high demand for grants with the capacity of slurry store suppliers to increase production."
        },
        {
            "text": "If we invite too many projects forward at once, we risk causing unnecessary delays and pushing up prices. "
        },
        {
            "text": "We also want to make sure projects are built first in areas where we can have the biggest impact on the environment. "
        },
        {
            "text": "I appreciate lots of farmers will be disappointed not to have been invited to full application in this round. However, as we set out in the Agricultural Transition Plan, we want to run 2 larger rounds. One will come in autumn and the other in 2024.  "
        },
        {
            "text": "This is a time-limited opportunity. We aren’t planning further rounds beyond 2024.  "
        },
        {
            "text": "We are funding farmers to go beyond compliance to create a step-change in slurry management across England. We know many farmers are already looking at how to meet their legal obligations and make better use of their slurry, particularly given the high fertiliser prices.  "
        },
        {
            "text": "We will fund as many farms as we can. We will continue to work with the industry to prioritise funding fairly while maximising environmental outcomes.  "
        },
        {
            "heading": 2,
            "text": "How we prioritised projects in round 1  "
        },
        {
            "text": "Before we launched the Slurry Infrastructure grant, we explained that we would give priority to projects that will most benefit the environment, based on their location.  "
        },
        {
            "text": "We identified in advance areas where we need to take coordinated action to reduce both water and air pollution from agriculture, and published maps showing the places we expected to prioritise grant applications in this round."
        },
        {
            "text": " You can read more about how those areas were chosen on our guidance pages. "
        },
        {
            "text": "All the farms in the priority areas for both water and air quality action have been invited to the next stage of applications.  "
        },
        {
            "text": "We have also been able to invite forward some projects outside our published target area as they were within high scoring locations for water or air quality. Prioritising these farms helps us ensure funds go first to areas that will make the biggest difference to meeting biodiversity outcomes. "
        },
        {
            "text": "Ahead of the next round, we will be looking at options for prioritising grants, including widening the target areas or using a different method to manage high numbers of applications. "
        },
        {
            "text": "I'll share details of how to get involved at the end of the post."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Projects prioritised this round received an email from the Rural Payments Agency (RPA) recently telling them what they need to prepare to complete their full application. "
        },
        {
            "text": "We would encourage everyone who is invited to the next stage to prepare and submit your application as soon as possible to avoid delays in receiving a grant.  "
        },
        {
            "text": "Applicants will also shortly be contacted by Catchment Sensitive Farming. They will offer a free advice visit to discuss their slurry management and ways of reducing pollution across their farms. "
        },
        {
            "text": "Projects who have not been prioritised this round will be invited to resubmit their application when the checker reopens in autumn. We will provide more details in summer.  "
        },
        {
            "heading": 2,
            "text": "Grant contributions "
        },
        {
            "text": "Given the exceptional demand and to ensure funds are distributed fairly, we are making a change to how we pay grant contributions. under the scheme. "
        },
        {
            "text": "In November, I wrote a blog post which explained that we use standard costs, which means you’ll get set contributions for each item based on your project needs. These contributions, set out in the grant guidance, are based on 50% of current market costs.  "
        },
        {
            "text": "To make sure individual projects aren’t taking a disproportionate share of funding, we will limit claims at 50% of the final amount paid where this is lower than the standard cost contribution. "
        },
        {
            "text": "The rest of the application process will remain the same and applicants won’t need to submit multiple quotes. "
        },
        {
            "text": "Introducing this cap means that, over time, we can fund more projects by ensuring no single farm receives more than 50% of grant funding.  "
        },
        {
            "text": "RPA will work this out by looking at the invoices you submit when you claim your grant. For example, if the project consists of: "
        },
        {
            "text": "The maximum amount of grant that could be claimed based on the standard costs would be £76,756.  "
        },
        {
            "text": "So, if a farmer paid £160,000 for the items and installation, their grant payment would be £76,756. "
        },
        {
            "text": "If they paid £120,000 for the items and installation, they total grant payment would be £60,000 (50% of what was paid).  "
        },
        {
            "heading": 2,
            "text": "Future rounds - get involved"
        },
        {
            "text": "We recently kickstarted a co-design process with farmers, sector and environmental groups to look at how we improve the grant for future rounds.  "
        },
        {
            "text": "If you would like to know more about that process and get involved, please contact the team at Tacklingpollutionfromslurry@defra.gov.uk.  "
        },
        {
            "text": "We will keep you updated on how that work is progressing on the blog. "
        },
        {
            "text": "Finally, in case you missed it, my colleague Gordon published a post today about the new Water Management grant, complementing government's newly published Plan for Water on GOV.UK."
        }
    ]
}