{
    "url": "https://naturalengland.blog.gov.uk/2023/04/04/water-and-nature-recovery/",
    "title": "Water and nature recovery",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Landscapes",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species"
    ],
    "pub_date": "2023-04-04T10:24:46+01:00",
    "content": [
        {
            "text": "By John Holmes, Strategy Director, Natural England"
        },
        {
            "text": "Water is a fundamental resource for life - there is no environment, society, or economy without it and yet it has probably been taken for granted more than other resource. Perhaps that is because of its relatively low cost at the tap, or because supply has been relatively consistent over time (to consumers at least, if not to our natural environment where pressures have been evident for decades). Whatever the reason, it has been a big year for water: flash flooding, drought and storm overflows continue to dominate in the media, because these things can have such an impact on people’s lives. They say when you are in a drought prepare for flooding and when you are flooding, prepare for a drought! Where I live in the South West, I am used to rain, yet we are not seeing reservoirs refilled and, if rainfall remains below average, we seem sure to continue in drought conditions through into this summer and in other areas of the country."
        },
        {
            "text": "Drought is not, of course, the only pressure the water system faces, and I am really pleased to see the publication of the Integrated Plan for Delivering Clean and Plentiful Water today by Defra. The challenges we face are big - freshwater, wetland, transitional and coastal habitats make up a high proportion of Sites of Special Scientific Interest (SSSIs) - around two thirds of sites - and are among the most impacted of habitats, for example, only 17 per cent of river SSSIs are in favourable condition. Restoring these habitats is complex, but we know the benefits to society in doing so over the short and long-term is important and requires investment."
        },
        {
            "text": "The Plan for Water emphasises a need to take a systems approach for nature recovery and water. Thinking of water as a precious but reusable resource, we can plan how to use it efficiently for people, nature and the economy over the longer term. If we continue to place too much stress on the water cycle, this will ultimately impact communities, businesses and wildlife. The Plan sets out interventions across government that will help achieve our ambition for clean and plentiful water and thriving plants and wildlife."
        },
        {
            "text": "Natural England, too plays a vital role in this through our partnership work in catchments and our advice to farmers on Catchment Sensitive Farming and Environmental Land Management Schemes But everyone can play a role, whether by thinking about their own individual consumption, or by working together with others using tools such as Local Nature Recovery Strategies, to plan out where our interventions can have the maximum benefit."
        },
        {
            "text": "Through focusing on natural ecosystem function in catchments, we can improve resilience to more extreme climate events. To do this, we need to implement real momentum to change how society approaches things: there will be no nature recovery, continued economic function or secure public supply without real change, as outlined in the Plan. We can see an example of solutions to reducing extreme demands on the water cycle and impacts on nature in our approach to mitigating impacts of nutrients resulting from built development. The Nutrient Mitigation Scheme - launched on 31 March (read more on our blog here) - sees us working with local landowners, local planning authorities and Habitat Delivery Partners to identify opportunities to create habitats (e.g. wetlands) to offset nutrient pollution. These then create credits that developers can purchase, providing assurance to Local planning Authorities and developers that additional nutrients from proposed developments will be mitigated for. This will enable the building of new homes in a way that benefits the natural environment. As explained in the Plan for Water, serious long-term reductions in agricultural pollution are needed to complete the system-wide improvement and allow nature to recover in our most important wetlands."
        },
        {
            "text": "Natural England will continue to use evidence to point to solutions for a more sustainable future that supports nature’s recovery. The Integrated Plan for Water will enable us to collectively tackle these pressures. The inclusion of new interventions that are needed are welcome and NE looks forward to working on these with our partners to restore natural function to freshwater habitats, including our treasured protected sites."
        }
    ]
}