{
    "url": "https://defrafarming.blog.gov.uk/2023/04/04/water-management-grants-get-ready-for-round-2/",
    "title": "Water Management grants: get ready for round 2",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-04-04T13:12:48+01:00",
    "content": [
        {
            "text": "In a few weeks' time, you will be able to apply for a Water Management grant."
        },
        {
            "text": "To help you prepare, we’ve published guidance for the second round of the Water Management grant on GOV.UK.  "
        },
        {
            "text": "In this post, I’ll give an overview of the grant and details of a webinar for you to find out more. "
        },
        {
            "heading": 2,
            "text": "Improving farm productivity through more efficient use of water"
        },
        {
            "text": "Part of the Farming Investment Fund, the Water Management grant is for horticultural and arable businesses growing, or intending to grow, irrigated food crops, ornamentals, or forestry nurseries. "
        },
        {
            "text": "Grants will go towards capital items which improve farm productivity through more efficient use of water for irrigation, by adopting best practice irrigation application equipment and to secure water supplies through construction of on-farm reservoirs."
        },
        {
            "text": "For example, you might use funding to move from rain guns to trickle and boom application. "
        },
        {
            "text": "The minimum grant available is £35,000 and the maximum grant available is £500,000. The grant will cover up to 40% of the cost.  "
        },
        {
            "text": "This will ensure funding is available to support the widest number of farmers while committing to supporting higher value projects which align with the fund’s objectives.  "
        },
        {
            "text": "Applicants are free to undertake larger projects, but most we will allocate is £500,000.  "
        },
        {
            "heading": 2,
            "text": "Applying for a grant "
        },
        {
            "text": "We’ll let you know when you can apply for the grant here on the blog. "
        },
        {
            "text": "We’ll post a link to apply in the ‘New on GOV.UK box’ which you’ll be able to see on the left of your screen if you’re on a desktop computer or at the bottom of the screen if you’re on a mobile. "
        },
        {
            "text": "We’ll also update this blog post which gives an overview of the grants available in 2023. "
        },
        {
            "text": "However, before you apply, take a look at the grant guidance on GOV.UK."
        },
        {
            "text": "The first step is an online checker. It is expected to open mid-April and run until mid-July.  "
        },
        {
            "text": "This will assess your eligibility and likelihood of success. This will, in turn, determine whether you are invited to submit a full application. "
        },
        {
            "heading": 2,
            "text": "Improving your experience "
        },
        {
            "text": "This is the second time we've offered Water Management grants. "
        },
        {
            "text": "To improve your experience, we’ve made several changes building on what we’ve learned so far. "
        },
        {
            "text": "You can now detail the range of water sources you have and there will be a longer application window at the online checker stage. "
        },
        {
            "text": "Those invited to make a full application will now be asked to obtain their planning permission and abstraction licence before they are invited to submit their application. "
        },
        {
            "text": "This will give greater clarity and speed up decision-making.    "
        },
        {
            "text": "You will be able to submit this once you have your abstraction licence and planning permission. Exact dates for this will be provided when you are invited to make a full application.  "
        },
        {
            "heading": 2,
            "text": "Learn more about the grant "
        },
        {
            "text": "We’re hosting a webinar for you to learn more about the Water Management grant. You’ll be able to put your questions to the team."
        },
        {
            "text": "Sign up to attend the online webinar on Thursday 20 April."
        },
        {
            "text": "It will begin at 2.30pm and finish at 3.45 pm."
        },
        {
            "text": "Don't worry if you can't make it. The webinar will be recorded and we'll post a link to the video here as soon as it's over."
        },
        {
            "heading": 2,
            "text": "Government's plan for clean and plentiful water"
        },
        {
            "text": "This funding is an important element in Defra’s commitment to helping farmers and growers adapt to climate change and to improve on-farm resilience so they can deal better with droughts such as the one we saw last year."
        },
        {
            "text": "My colleague Tom also published a post today setting out what we learned from the first round of Slurry Infrastructure grants and our next steps which is worth a read."
        },
        {
            "text": "Finally, do take a look at government's Plan for Water, published today. It sets out the plan for a healthy water environment and a sustainable supply of water for people, businesses and nature."
        }
    ]
}