{
    "url": "https://educationhub.blog.gov.uk/2023/04/04/what-is-pupil-premium-funding-for-schools-how-benefit-child/",
    "title": "What is pupil premium funding for schools and how will it benefit my child?",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Funding",
        "School spending",
        "Schools"
    ],
    "pub_date": "2023-04-04T12:04:02+01:00",
    "content": [
        {
            "text": "Every child should be given the chance to realise their potential at school, regardless of their background."
        },
        {
            "text": "We are committed to supporting all disadvantaged pupils in England and have put in place support, such as the pupil premium, for schools to address the challenges to success that these pupils face."
        },
        {
            "text": "With  £2.9 billion provided to schools in the 2023-24 financial year, the pupil premium is our largest support package for disadvantaged pupils – here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the pupil premium? "
        },
        {
            "text": "The pupil premium is extra money for schools to help disadvantaged pupils of all abilities achieve their full potential."
        },
        {
            "text": "The amount of pupil premium funding schools receive is decided by how many disadvantaged pupils they have – schools then receive funding per pupil premium-eligible child."
        },
        {
            "text": "We have recently updated our guidance to help schools with planning how to use their pupil premium, so that it best supports disadvantaged pupils."
        },
        {
            "text": "Following the impact of the COVID-19 pandemic, we also introduced the recovery premium grant."
        },
        {
            "text": "Recovery premium is a time-limited grant which provided over £300million of additional funding for state-funded schools in the 2021 to 22 academic year and is providing a further £1billion across the 2022 to 23 and 2023 to 24 academic years."
        },
        {
            "heading": 3,
            "text": "What should schools be spending the pupil premium on? "
        },
        {
            "text": "Schools must spend their pupil and recovery premium in line with a ‘menu’ of approaches, based on expert evidence of what works when it comes to improving the outcomes of disadvantaged children."
        },
        {
            "text": "Schools must allocate spending across the following three key areas:"
        },
        {
            "text": "It is up to schools to decide how exactly to spend their pupil premium so that it supports pupils who need it most."
        },
        {
            "heading": 3,
            "text": "What are the key changes to the guidance?"
        },
        {
            "text": "We want our guidance to be as helpful as possible in supporting schools to make best use of pupil premium and recovery premium."
        },
        {
            "text": "We’ve updated our ‘menu of approaches’ to help schools use funding in line with the evidence on how to improve the performance of disadvantaged pupils."
        },
        {
            "text": "We’re also asking schools to use our new pupil premium strategy statement template to support them in planning how they will use the funding, to ensure they are meeting the needs of their disadvantaged pupils."
        },
        {
            "text": "To find out more about how your child’s school is using this funding, you can find the school’s pupil premium strategy statement on their website."
        },
        {
            "heading": 3,
            "text": "Who is eligible for pupil premium and recovery premium?"
        },
        {
            "text": "To be eligible for pupil premium or recovery premium, pupils must be:"
        },
        {
            "text": "In addition to the above, for recovery premium, all pupils in special schools, special educational needs units in mainstream schools, Pupil Referral Units and general hospital schools are eligible."
        },
        {
            "text": "Pupil premium and recovery premium are not a personal budget for eligible pupils."
        },
        {
            "text": "Schools can also use the funding to support non-eligible pupils where they have identified needs, for example pupils who have or have had a social worker or are a carer."
        },
        {
            "text": "In addition, schools can use the funding on whole class approaches, for example high-quality teaching, which will also benefit non-disadvantaged pupils."
        },
        {
            "heading": 3,
            "text": "Where can I find more information?"
        },
        {
            "text": "For more information on pupil premium and recovery premium, see the ‘Pupil premium: overview’ and ‘Recovery premium: overview’ guidance found here: Pupil premium: overview and Recovery premium funding."
        },
        {
            "text": "If you would like more information on how your child’s school is using its pupil premium and recovery premium funding, you can look at the school’s strategy statement on their website."
        }
    ]
}