{
    "url": "https://grantscommunity.blog.gov.uk/2022/02/16/electric-vehicle-charge-point-grants-are-you-missing-out/",
    "title": "Electric Vehicle Charge-point Grants - Are you missing out?",
    "authors": [
        "darrenhandley"
    ],
    "categories": [
        "Digital transformation",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2022-02-16T13:19:08+00:00",
    "content": [
        {
            "text": "In order to deliver the electric vehicle revolution, the Office for Zero Emission Vehicles (OZEV) has grants that are available right now. But have you heard about them?"
        },
        {
            "heading": 2,
            "text": "What are the OZEV grants all about?"
        },
        {
            "text": "You will probably be aware of the phenomenon of electric vehicles. They are everywhere now. In December, one in four new cars sold were electric. By 2035, all new cars will be zero emission. My team in the Office for Zero Emission Vehicles is helping more people to make the switch."
        },
        {
            "text": "Once someone has an electric vehicle, the first thing they want to do is charge it up - ideally at home and at work. This is where my department’s grants come in. If you are considering switching to electric vehicles, we can help you install electric vehicle charge-points."
        },
        {
            "text": "For example, we have a voucher-based scheme that provides support towards the up-front costs of the purchase and installation of electric vehicle charge-points, for eligible businesses, charities and public sector organisations."
        },
        {
            "text": "This Workplace Charging Scheme (WCS) can cover up to 75% of the costs, up to a maximum of £350 for each socket, for up to 40 sockets. Yes, that is up to £14,000. This is principally to support the deployment for staff, but charities and small accommodation businesses can access it for any use, such as for use by guests or visitors. More information on our whole range of grants, including those for homes, is available on www.gov.uk."
        },
        {
            "heading": 2,
            "text": "Simpler, faster and fairer"
        },
        {
            "text": "OZEV wants to make sure many more people know that these grant schemes exist - and help them to understand how to find and apply for them."
        },
        {
            "text": "That is why we have put ourselves forward for the Grants Applicant Programme to make our grants easier to find and simpler to apply for."
        },
        {
            "text": "We are also looking for the support of the Government Grants Community to get the word out even further alongside your help with our user research. We are especially keen to co-create the new grants service with people with visual impairments or cognitive impairment to make sure it is fully accessible."
        },
        {
            "heading": 2,
            "text": "Can we work together?"
        },
        {
            "text": "My department has three asks."
        },
        {
            "text": "Firstly, please, tell us what more we can do to help people find and successfully apply for this great opportunity."
        },
        {
            "text": "For example, we could run a series of virtual webinars about the scheme for the Government Grants Community so that you can hear about how to apply for our grants, what makes a strong application and explain some of the terms."
        },
        {
            "text": "Secondly, if you have not yet signed up to be part of the Government Grants Community and the research panel, please do."
        },
        {
            "text": "And finally, do share your views with us about your experience of finding and applying grants, via this survey, which closes on 25 February 2022."
        },
        {
            "heading": 2,
            "text": "And if you want to apply for the charge-points grants now…"
        },
        {
            "text": "It's best to apply for the WCS online. Once you’ve done that, a voucher will be generated, which is valid for four months. Your approved installer will then complete the work and submit a claim on the WCS portal. They then receive the grant of up to 75%, to a maximum of £350."
        },
        {
            "heading": 2,
            "text": "Improvements are coming, with your help"
        },
        {
            "text": "And with the support of the Grants Applicant Programme, we want your experience of applying for the OZEV grants to be much easier and to get the word out to others."
        },
        {
            "text": "My department wants to help you to access the financial support that’s available if you are eligible, so you, your staff or visitors to your place of work can plug in and charge up to get to where you all want to go."
        },
        {
            "text": "Darren Handley"
        },
        {
            "text": "Head of Infrastructure Grants\nOffice for Zero Emission Vehicles"
        }
    ]
}