{
    "url": "https://environmentagency.blog.gov.uk/2022/02/16/environment-agency-investigation-into-sewage-treatment-works/",
    "title": "Environment Agency investigation into sewage treatment works",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Ofwat",
        "Waste",
        "Water"
    ],
    "pub_date": "2022-02-16T09:32:45+00:00",
    "content": [
        {
            "text": "On 18 November 2021, the Environment Agency and Ofwat announced major investigations into potential widespread non-compliance by water and sewerage companies at sewage treatment works."
        },
        {
            "text": "The investigations were launched after companies revealed to us that they may be in breach of their permit conditions. This issue was brought to light following the Environment Agency’s requirement of companies to improve how they monitor and manage flow-to-full treatment at wastewater treatment works through the installation of new monitors."
        },
        {
            "text": "This update sets out what we’re investigating, what has happened since we announced the investigation and more about what flow-to-full treatment is."
        },
        {
            "text": " "
        },
        {
            "text": "What the EA is investigating"
        },
        {
            "text": "More than 2200 sewage treatment works spanning all water and sewerage companies in England will be scrutinised by EA experts."
        },
        {
            "text": "This is a criminal investigation and as such must be conducted in accordance with criminal rules and procedures. The standard of proof in criminal proceedings is much higher than with a regulatory investigation such as Ofwat’s. Once the EA has completed an initial assessment, further investigations will be needed to confirm whether breaches of permit have occurred, the reason they have occurred and what the impact of the breaches might have been on the receiving waters, the wider environment and company profits.  These investigations are complex, involve vast amounts of material which needs to be analysed and turned into evidence and this will take time to complete. Any enforcement action will be taken in line with the EA’s Enforcement and Sanctions Policy depending on the nature and severity of any offence/s which come to light."
        },
        {
            "text": "Ofwat’s investigation is considering whether any potential non-compliance with environmental permits suggests the company concerned might not be complying with other legal requirements a water company has, which Ofwat is responsible for enforcing. These include requirements water companies have about how, overall, they operate, manage, and report their performance, including of their wastewater treatment works."
        },
        {
            "text": "While the investigation progresses, the EA, government and Ofwat are working closely together to ensure water and sewerage companies take immediate action where potential breaches of permit conditions are identified. It is the water and sewerage companies’ responsibility to bring their sites back within compliance as soon as possible and they will be held to this by the regulators."
        },
        {
            "text": " "
        },
        {
            "text": "What we have done since the investigation was announced"
        },
        {
            "text": "The announcement followed initial work we’d done to establish the grounds for an investigation. Since that time, EA experts have requested detailed data from over 2200 sewage treatment works to help determine the scale of any non-compliance. We are now beginning the process of scrutinising around 140 million pieces of data relating to flow, provided by companies at the end of January 2022. We expect to conclude this phase in spring 2022. As we move into the next phase we will examine further data sources including those provided by third parties, to give us the best intelligence."
        },
        {
            "text": "This will help identify the sites for further investigation so that we can confirm whether breaches have occurred, the reason they have occurred and what the impact of the breach is on the receiving waters."
        },
        {
            "text": "This is the first in several phases of the investigation. The potential scale of it sets it apart from others previously conducted by the EA and adds several layers of complexity."
        },
        {
            "text": "The next phase may include site inspections, audits and interviews, and is expected to continue throughout 2022 and into 2023. The length of time it takes will be determined by the number of sites found to be in breach of legal requirements and the number of offences involved."
        },
        {
            "text": " "
        },
        {
            "text": "What is Flow-to-full Treatment? "
        },
        {
            "text": "Flow-to-full treatment refers to the level of rain and wastewater, or flow, a sewage treatment works must treat before it is permitted to discharge excess flows to storm tanks or the environment. A works must treat all flows up to a limit specified in permits. This ensures there is enough dilution in any overflow to minimise its impact on the environment."
        },
        {
            "text": "Storm overflows at sewage treatment works are not the same as storm overflows on the sewer network. The sewer network is the system of pipes that transports sewage and often rainwater from all our houses and businesses around the country. Where necessary it includes storm overflows to prevent flooding of properties and infrastructure by allowing excess flows to be discharged in wet weather. Storm overflows at sewage treatment works are different as these are permitted to discharge excess flows either directly to the environment, or via storm tanks when the volume of rain and wastewater is greater than the treatment works can cope with."
        },
        {
            "text": "Every year we collect Event Duration Monitoring (EDM) data from all companies, providing greater transparency around the frequency and duration of spills from all storm overflows - both those on the network and at sewage treatment works. The EDM data, published on gov.uk - Event Duration Monitoring - Storm Overflows -2020 - data.gov.uk, recorded 400,000 discharges in 2020. The vast majority of these are compliant with their permits, but should only have been used when rainfall risks the network or sewage treatment works from being overwhelmed or sewage backing up into people’s homes, or discharging to the environment.  Our investigation is looking into whether the discharges from storm overflows at sewage treatment works – a subset of the 400,000 – are happening in line with that requirement."
        },
        {
            "text": "In separate work, we have also requested detailed data from over 1300 storm overflows on the network. We have identified these as frequently spilling and are analysing whether there have been unauthorised discharges. Some of this analysis may also be used to inform the main flow-to-full treatment investigations."
        },
        {
            "text": " "
        },
        {
            "text": "Is data still available?"
        },
        {
            "text": "Monitoring data received by the Environment Agency is environmental information and is normally provided on an annual basis, or at our request."
        },
        {
            "text": "Whilst the investigation is ongoing, it’s vital that any potential evidence or proceedings are not compromised by the inappropriate sharing of sensitive data or information that could jeopardise our ability to take enforcement action."
        },
        {
            "text": "However, the EA will continue to publish data and provide data on request in the vast majority of cases, except where it may be necessary to withhold it for the legal reasons described above."
        },
        {
            "text": "Water companies are also bound by the same Freedom of Information Act and Environmental Information Request requirements on the provision of data."
        },
        {
            "text": " "
        },
        {
            "text": "How the EA is resourcing this work"
        },
        {
            "text": "The EA is drawing on expertise and resource from around its business to carry out this major investigation. This will include the National Enforcement Service, water quality regulation staff, technical experts and communications teams. We are treating the investigation as we would do a major incident such as a flood, where we prioritise and brigade the resources we need."
        },
        {
            "text": "Funding secured through Spending Review 2021 is enabling additional resource for investigating and enforcing water quality offences."
        },
        {
            "text": "We will continue to provide updates as the investigation progresses to the extent we can, and plan to set out next steps later in the spring."
        },
        {
            "text": " "
        }
    ]
}