{
    "url": "https://marinedevelopments.blog.gov.uk/2022/02/16/growing-awareness-and-use-of-explore-marine-plans/",
    "title": "Growing awareness and use of Explore Marine Plans",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Coastal",
        "marine planning"
    ],
    "pub_date": "2022-02-16T16:59:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is Explore Marine Plans?"
        },
        {
            "text": "Explore Marine Plans (EMP) is a digital service developed by the Marine Management Organisation (MMO) and is an online, interactive resource that supports the implementation of England’s marine plans. The digital service allows you to find and view spatial data for the English marine area, as well as marine plan policy information. For example, you can use EMP to identify:"
        },
        {
            "text": "Being able to readily identify the information listed above has benefits for both decision-makers and proponents. For example, proponents can use it to inform the development of proposals (eg marine licence applications), while decision-makers can use it when making authorisation or enforcement decisions, as well as other types of decisions (eg developing sub-national plans and strategies)."
        },
        {
            "text": "If you are interested in EMP and how to use it in either proposal development or decision making, a recorded walkthrough of the digital service is available on the MMO Using Marine Plans webpage. The webpage also provides links to worked hypothetical examples of how to use marine plans."
        },
        {
            "heading": 2,
            "text": "Stakeholder awareness and use of Explore Marine Plans"
        },
        {
            "text": "Explore Marine Plans first went live on 4 November 2019. In its first two years of operation, EMP has been accessed by almost 9,000 users, over about 18,000 individual sessions and 46,000 pageviews."
        },
        {
            "text": "In its second year of operation (4 November 2020 to 3 November 2021), the number of users of EMP grew by almost 2,000. The number of annual pageviews and user sessions also increased from the previous reporting year (23% and 36%, respectively)."
        },
        {
            "text": "User data therefore shows that stakeholder awareness and use of EMP is growing over time. Factors that may have contributed to this finding include the:"
        },
        {
            "heading": 2,
            "text": "What next for Explore Marine Plans?"
        },
        {
            "text": "Explore Marine Plans is currently in the ‘beta’ phase of development. The MMO will continue to support EMP through regular internal service monitoring and external promotion."
        },
        {
            "text": "Where possible, improvements to the digital service will be made, including in response to user feedback. The MMO will be seeking user feedback on EMP as part of our follow-up interviews to this year’s marine plan monitoring surveys."
        },
        {
            "text": "The MMO is currently seeking feedback on how decision-makers and proponents use marine plans. The surveys are voluntary and can be accessed here. We welcome your participation in completing a survey by 7 March 2022."
        },
        {
            "text": "If you have any questions about this EMP, you can get help from the MMO Marine Planning team at the contact details below."
        },
        {
            "text": "email: planning@marinemanagement.org.uk"
        },
        {
            "text": "phone: 0208 0265 325 (available Monday to Friday, 7am to 7pm)"
        },
        {
            "text": "You can subscribe to the MMO Marine Planning newsletter here."
        }
    ]
}