{
    "url": "https://educationhub.blog.gov.uk/2022/02/our-focus-on-literacy-and-numeracy-what-it-means-in-practice/",
    "title": "Our focus on literacy and numeracy – what it means in practice",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-02-16T15:21:16+00:00",
    "content": [
        {
            "text": "In February, we announced a package of measures to level up education across the country and ensure every child is given the best start in primary school."
        },
        {
            "text": "This means that when pupils leave primary school they are equipped with the building blocks needed in literacy and numeracy for learning at secondary school."
        },
        {
            "text": "Here’s what this means in practice."
        },
        {
            "text": "In maths we think that all pupils who leave primary school should be fluent in addition, subtraction, long multiplication and division, and be able to work with fractions, decimals and percentages."
        },
        {
            "text": "In English, we think that all pupils should be able to read fluently and write accurately and coherently. These skills set them up to succeed and flourish in secondary school and access a broad and balanced curriculum."
        },
        {
            "text": "These fundamental skills are important because they give pupils the foundations to develop in secondary school. The skills they learn in maths will support them when they come to the more advanced topics they will learn, such as algebra and geometry, and will be essential in a range of other subjects including science and technology."
        },
        {
            "text": "Basic literacy is also important as it is essential for expression. Without basic literacy skills pupils will struggle to engage with subjects across the curriculum."
        },
        {
            "text": "Poor numeracy and literacy skills can have a huge knock-on effect on their wider education and the ability to get on in life."
        },
        {
            "text": "We’ve made huge progress recently – in 2019, 65% of pupils reached the expected standard in reading, writing and maths, compared to 53% in 2016."
        },
        {
            "text": "The introduction of systematic phonics to teach reading has had a huge impact, with more children able to read in the first two years of primary school across England."
        },
        {
            "text": "In maths, our national network of 40 Maths Hubs is helping local schools improve their maths teaching based on best practice. For example, hubs have been expanding “mastery” teaching approaches from across the world with the aim to reach 11,000 English schools by 2023."
        },
        {
            "text": "There are still 35% of children who do not meet the expected standard in reading, writing and maths by the time they leave primary school."
        },
        {
            "text": "Through our levelling up plans, we plan to close this gap by making sure we have excellent teachers, trained in the very best literacy and numeracy approaches, in all areas of the country."
        },
        {
            "text": "By supporting behaviour and attendance, alongside targeted support for pupils furthest behind due to the pandemic, we expect the number of primary school children achieving the expected standard in reading, writing and maths to significantly increase."
        },
        {
            "text": "By 2030, our ambition is that 90% of all primary school children in England will achieve the expected standard across the country."
        },
        {
            "text": "We will be setting out more details in our Schools White Paper on what this means in practice and how we will deliver it."
        }
    ]
}