{
    "url": "https://cspl.blog.gov.uk/2022/02/16/standards-bodies-whos-who-2/",
    "title": "Standards Bodies: Who's who? (2)",
    "authors": [
        "Dame Shirley Pearce"
    ],
    "categories": [
        "Elections",
        "MPs"
    ],
    "pub_date": "2022-02-16T09:57:15+00:00",
    "content": [
        {
            "text": "In the second in our series of blogs looking at the various standards regulators, Shirley Pearce explains the role of the Independent Parliamentary Standards Authority and the Electoral Commission."
        },
        {
            "text": "The Independent Parliamentary Standards Authority (IPSA)"
        },
        {
            "text": "The media’s publication of MPs’ expenses claims in 2009 caused a wave of public anger at the apparent misuse of taxpayer funds. The scandal led to an inquiry and recommendations for a wholly different framework to support MPs and protect the taxpayer (MPs’ Expenses and Allowances 2009), including a new independent body to administer expenses to support the work of Members of Parliament."
        },
        {
            "text": "Parliament passed the Parliamentary Standards Act in 2009 to set up such a body, the Independent Parliamentary Standards Authority (IPSA). The Act was amended in 2010 by the Constitutional Reform and Governance Act."
        },
        {
            "text": "IPSA was created as a new statutory regulator, independent of both Parliament and the government. IPSA has responsibility for regulating MPs’ staffing and business costs, determining MPs’ pay and pension arrangements and providing financial support to MPs in carrying out their parliamentary functions. IPSA also publishes a range of information to provide transparency about MPs’ pay, pensions and claims."
        },
        {
            "text": "The Chair of IPSA is appointed by The Queen following resolution of the House of Commons.  The Speaker of the House of Commons (via the Speaker's Committee for IPSA) recommends the appointment to the House. The Chair is supported by four Board members, all of whom are appointed by the same Speaker’s Committee. Under the legislation they must be made up of a former MP, a qualified accountant, a former High Court judge, and one other."
        },
        {
            "text": "The Board appoints an independent Compliance Officer, who investigates complaints made about MPs’ claims and reviews decisions made by IPSA. IPSA’s Compliance Officer deals with issues related to expense and payments only. Any suspected criminal activity is referred to the police."
        },
        {
            "text": "During the debates on the 2009 legislation, it was discussed whether IPSA would include all standards matters – hence the reference to parliamentary standards in its title. However, it was decided that complaints about conduct would continue to be dealt with by the Commissioner for Parliamentary Standards"
        },
        {
            "text": "IPSA now independently regulates and administers the business costs and decides the pay and pensions of the 650 elected MPs and their staff in the UK, and regularly reviews arrangements with an open public consultation."
        },
        {
            "text": "The Electoral Commission"
        },
        {
            "text": "In 1997, the Committee on Standards in Public Life was given an expanded terms of reference by the then Prime Minister, Sir Tony Blair, to look at the funding of political parties. The Committee’s fifth report then recommended the creation of the Electoral Commission to regulate political party funding."
        },
        {
            "text": "The Commission was established as an independent body in the Political Parties, Elections and Referendums Act 2000 (PPERA). It is directly accountable to UK Parliament through the Speaker’s Committee on the Electoral Commission and is also accountable to the Parliaments of Scotland and Wales. Its core purpose is to oversee elections and referendums and regulate donations and expenditure by political parties and third party campaigners."
        },
        {
            "text": "The Political Parties and Elections Act 2009 granted the Electoral Commission a variety of new supervisory and investigatory powers, including a range of flexible civil sanctions, both financial and non-financial. The Act also made changes to the structure of the Electoral Commission, including allowing for the appointment of four new electoral commissioners nominated by political parties."
        },
        {
            "text": "The Commission’s role in ensuring that elections are well run includes supporting electoral administrators, candidates, parties, campaigners and voters by providing guidance, resources and advice."
        },
        {
            "text": "As the regulator of political party funding in the UK, the Commission's role is to ensure the integrity and transparency of party and election finance. It has a duty to:"
        },
        {
            "text": "The Commission may impose financial civil penalties on political parties and their accounting units if they fail to comply with legal requirements. The Commission also has the power to seek forfeiture of impermissible donations accepted by political parties."
        },
        {
            "text": "The Committee’s 2021 report on election finance made recommendations to modernise and reform aspects of the regime regulating electoral finance and emphasised the importance of an independent regulator for confidence in the democratic process. The government responded  to say it would look at these recommendations, alongside other recommendations set out in similar reports as part of further work looking at the regulatory framework for elections, beyond the Elections Bill."
        },
        {
            "text": "The government introduced their Elections Bill in July 2021 which is now under consideration in the House of Lords. Lord Evans gave evidence to the Commons Public Administration and Constitutional Affairs Committee (PACAC) on aspects of the Bill and their report was published in December. The government responded to this report in February."
        },
        {
            "text": "PACAC has also recently concluded an inquiry into the work of the Electoral Commission and will publish a report shortly."
        },
        {
            "text": "I have previously blogged about the recommendations in our report, Regulating Election Finance, and we hosted a guest blog by Dr Alistair Clark about the potential impact of the government’s illustrative Electoral Commission Strategy and Policy Statement on the independence of the Electoral Commission."
        },
        {
            "text": " "
        },
        {
            "text": "Watch a short film about the work of the Committee on Standards in Public Life"
        },
        {
            "text": "Follow us on Twitter @PublicStandards"
        },
        {
            "text": "Download CSPL research mapping British standards bodies "
        }
    ]
}