{
    "url": "https://civilservice.blog.gov.uk/2022/02/16/supporting-civil-service-colleagues-through-loss/",
    "title": "Supporting Civil Service colleagues through loss",
    "authors": [
        "Adam Land, Senior Director at the Competition and Markets Authority"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-02-16T09:23:41+00:00",
    "content": [
        {
            "heading": 3,
            "text": "How Civil Service colleagues support each other through loss Supporting staff experiencing bereavement and loss is a key Civil Service health and wellbeing priority.  In part seven of Adam Land’s bereavement series, Charlotte Bedford talks about the Bereavement Network she established in the Department for Transport."
        },
        {
            "text": "Over the past 18 months, I’ve worked with CSHR to identify how we can provide support for colleagues who experience bereavement and loss. Together with a volunteer group from across the Civil Service, we have provided guidance, shared stories of colleague’s lived experiences and worked with the Charity for Civil Servants to provide access to the Griefworks App. We have also worked alongside departments to support their work including the Department for Transport’s (DfT) Bereavement Network, which I was lucky enough to visit last December.  "
        },
        {
            "text": "Charlotte Bedford, network chair, tells us more"
        },
        {
            "text": "When we launched the DfT Bereavement Network in August 2021, we were not expecting such an incredible reaction from colleagues. The reaction showed just how much the network was needed. It empowered colleagues to talk about their grief and not feel so alone at work. "
        },
        {
            "text": "In July 2020, my world was turned upside down when my little brother passed away, a day after his 15th birthday. His death was sudden, and I experienced a lot of guilt and anger. I couldn’t understand why his life had been so unfairly cut short. "
        },
        {
            "text": "Though most people experience bereavement, I felt alone when I returned to work. I would have valued having a network of people who I could talk to. That’s why I decided to start the network, and with like-minded colleagues, we strive to make it successful and supportive."
        },
        {
            "text": "Joe Goodhart is network co-founder in DfT "
        },
        {
            "text": "Joe says: “Shortly before joining DfT I lost my dad. At 22, this was my first experience of the death of a close relative, and adapting was difficult. In particular, I hated feeling like I was ‘starting a conversation’ about grief, despite really wanting to talk to someone."
        },
        {
            "text": "“Above all else, this is what led me into this network. I want to ensure DfT has a place to hold these conversations and that people feel comfortable to ask how others are doing.”"
        },
        {
            "text": "After several brilliant months where we secured our SCS sponsor, Iain Forbes, and commenced regular Grief Cafés and newsletters, Joe and I realised we needed more support. That’s when Grace Potter got involved. "
        },
        {
            "text": "Grace Potter is network comms lead in DFT"
        },
        {
            "text": "“The day before my 24th birthday a close friend took their own life. It was a devastating blow and I couldn’t fathom how I was meant to complete normal tasks, let alone return to work. I worked in the private sector, and my manager was sadly not equipped to help me. So three years later, in a new job, I volunteered to join the Bereavement Network to be part of something providing support for others. I feel  lucky to have met so many wonderful, empathetic colleagues  – it feels very special to be a part of the network.” "
        },
        {
            "text": "We’ve run many Grief Cafés since launching the network. "
        },
        {
            "text": "Mental Health First Aider Malky Stoddart, who attends regularly, shares his reflections. "
        },
        {
            "text": "“Grief and bereavement will affect us all at some point in our lives, yet sharing our feelings with others is still considered taboo. The Grief Cafés provide a safe space to share feelings openly and honestly, where they’re listened to and welcomed with humility and understanding. Whilst it will always remain a difficult subject, colleagues no longer need be alone in their grief.”"
        },
        {
            "text": "We worked across DfT to explore the intersections of grief with other parts of our identities. We held an Interfaith Week panel discussion in November on faith and bereavement, with representatives from DfT’s Christian, Jewish, Muslim and Sikh communities. Our speakers explored complex themes ranging from how faith shapes their views of death, through to how people of every faith can best support those around them as they engage with death. We learned a lot about how different religions and cultures mourn their loved ones.  "
        },
        {
            "text": "Grief Awareness Week"
        },
        {
            "text": "In December, we held events to explore the reasons behind Grief Awareness Week and ran a Grief Café centred around grieving at Christmas. We hosted an ‘In Conversation’ event with Adam Land, who spoke openly about his personal relationship with grief after the loss of his daughter, Eloise. He highlighted some of the brilliant work that’s been achieved since sponsoring this work. It was a truly inspiring session. "
        },
        {
            "text": "We hosted DfT’s Employee Assistance Programme provider, Health Assured, which provided an incredibly helpful session, where we learned about what they do and the support available. We were encouraged to download their app – My Healthy Advantage – to access personalised support resources.  "
        },
        {
            "text": "Adam Land: I want to thank Charlotte and colleagues for sharing this information. The DFT Network and others across the Civil Service do some amazing work to support colleagues. "
        },
        {
            "text": "A Modern Civil Service"
        },
        {
            "text": "Of course, grief is part and parcel of life. In A Modern Civil Service, we talk about building an innovative organisation to ‘find new ways to solve problems and improve people’s lives.’ For me, this means recognising we’re all human and affected by personal events away from the office. We strongly encourage managers and colleagues to look out for and support bereaved colleagues, enabling them to give their best. Our values focus on integrity, honesty and impartiality and objectivity. But I believe there’s two other threads running through our work - empathy and compassion for the people we work alongside every day. "
        },
        {
            "text": "More information"
        },
        {
            "text": "Civil Service HR has produced a series of useful resources, including a Guide for Managers to support staff navigating bereavement and loss. "
        },
        {
            "text": "Visit the Learning Platform for Government to access these resources. "
        },
        {
            "text": "Mental Health First Aiders"
        },
        {
            "text": "Most Civil Service departments have MHFAs. If you can’t find one in your area, please contact one in a nearby unit. Look out for departmental first aid notices and lists of MHFAs on your intranet."
        }
    ]
}