{
    "url": "https://educationhub.blog.gov.uk/2022/02/use-half-term-to-make-sure-your-family-is-vaccinated/",
    "title": "Use half term to make sure your family is vaccinated",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2022-02-16T10:43:07+00:00",
    "content": [
        {
            "text": "This February half term, we are encouraging everyone who is eligible – including those aged 12-17 – to get a COVID-19 vaccine or make sure that they are up to date with a booster."
        },
        {
            "heading": 3,
            "text": "Why is it important to get vaccinated?"
        },
        {
            "text": "COVID-19 remains highly infectious, and it continues to cause disruption to education."
        },
        {
            "text": "Vaccinating 12-17-year-olds can help reduce the risk of spreading COVID-19 within schools and colleges. Vaccinations lower the chance of pupils catching the virus, reduces the amount of time required to recover from any illness, and in some cases, reduces the amount of time needed to recuperate from long COVID."
        },
        {
            "text": "Getting vaccinated also helps pupils who have missed out on classroom learning because of Covid prepare for exams this summer as they are able to maximise their time in the classroom and have access to support – if they need it – and revision materials."
        },
        {
            "text": "Now that restrictions have eased, getting the vaccine also means pupils will have a greater chance of participating in activities like school trips, plays, sports matches and cultural activities that benefit wider development."
        },
        {
            "text": "NHS consultant paediatrician and TV presenter Dr Ranj explains the importance of getting vaccinated:"
        },
        {
            "heading": 3,
            "text": "Who can get vaccinated?"
        },
        {
            "text": "Everyone aged 12 and over, and some children aged 5 to 11, can get a 1st and 2nd dose of the vaccine."
        },
        {
            "text": "Young people who have recently tested positive for COVID-19 need to wait 12 weeks after testing positive for Covid before they can get vaccinated but they are encouraged to book as soon as they can."
        },
        {
            "text": "More information on vaccine eligibility is available on the NHS’ website: Who can get the coronavirus (COVID-19) vaccine - NHS (www.nhs.uk)."
        },
        {
            "heading": 3,
            "text": "How can we get vaccinated?"
        },
        {
            "text": "The government has made it as easy as possible to get a vaccine, including through ‘grab a jab’ pop-up vaccine sites across the country in locations such as football stadiums, at festivals, and in shopping centres."
        },
        {
            "text": "You can book your COVID-19 vaccination appointments online. This service is available for:"
        },
        {
            "text": "If you cannot book appointments online, you can call 119 free of charge. You can speak to a translator if you need to."
        },
        {
            "text": "If you have difficulties communicating or hearing, or are a British Sign Language (BSL) user, you can use textphone 18001 119 or the NHS 119 BSL interpreter service."
        },
        {
            "text": "Or you can find a walk-in COVID-19 vaccination site to get vaccinated without needing an appointment. This service is available for:"
        }
    ]
}