{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/12/06/bridging-the-gap-between-academia-and-government/",
    "title": "Bridging the Gap Between Academia and Government",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Collaborating & Networking",
        "GSE Opportunities"
    ],
    "pub_date": "2021-12-06T13:51:21+00:00",
    "content": [
        {
            "text": "The Royal Society Pairing Scheme pairs academics and civil servants together for one week to share knowledge and learning to ensure policy making is strengthened by links with academia and data. Through the scheme, policy makers will make lasting relationships with academics who can provide expert knowledge on areas relevant to their work and network with other civil servants working across government."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What does the scheme involve?"
        },
        {
            "text": "The scheme consists of a ‘Week in Westminster’ which will take place from Monday 14 March 2022. The week involves a program of sessions including workshops, talks from invited speakers and 1-1 shadowing sessions to learn more about the processes of parliament and the science research and advice landscape. To take part you will need to be available to meet with your scientist pair at least twice during the week and we encourage you to invite colleagues in your team to join you as appropriate."
        },
        {
            "text": "The Civil Servant will then be invited to visit the academic’s home institution and find more about their work in person. Your pair will introduce you to their work and colleagues, giving you an insight into their area of research and an opportunity to explore how you might use these connections in the future."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Who will I be paired with?"
        },
        {
            "text": "The Royal Society pairing scheme is open to applications from scientists across all science, technology, engineering, medicine and mathematics (STEMM) disciplines working in academia or industry. To be eligible for the scheme, the scientists are required to have at least two years postdoctoral research experience or equivalent research experience in industry. The scheme is open to all civil servants but is particularly aimed at those working in policy areas."
        },
        {
            "text": "We are looking to pair academics from a wide range of backgrounds:"
        },
        {
            "text": "Health, Disease and Epidemiology x12\nClimate Change x5\nTechnology x5\nGenetic Modification x3\nChemistry x2"
        },
        {
            "text": "A full list can be found here but in particular:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Following the scheme"
        },
        {
            "text": "By taking part in the scheme, Civil Servants will be able to take away:"
        },
        {
            "text": " "
        },
        {
            "text": "“I hugely enjoyed my experience of the scheme. It was really interesting to explain my own work and to get a sense for how the work of government is seen through researchers.”"
        },
        {
            "text": "Dr Alan Pitt, former Secretary for the Council for Science and Technology, paired with Dr Emma Stone at the University of Bristol"
        },
        {
            "text": " "
        },
        {
            "text": "This is a great opportunity to help you to expand networks, improve your knowledge of the research landscape and understand how the research community can support you in your day-to-day work."
        },
        {
            "text": "If you are interested in pairing up with an academic, please complete this form by COP 15 December."
        }
    ]
}