{
    "url": "https://deframedia.blog.gov.uk/2021/12/06/coverage-of-leading-report-on-the-benefits-of-uk-woodlands-for-mental-health/",
    "title": "Coverage of leading report on the benefits of UK woodland’s for mental health",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-12-06T11:12:34+00:00",
    "content": [
        {
            "text": "To round off National Tree Week 2021, there has been positive coverage of our announcement that visits to the UK’s woodlands boosts mental health and is estimated to save £185 million in treatment costs annually, a landmark report published by Forest Research finds."
        },
        {
            "text": "A piece in The Telegraph notes the various benefits of woodland highlighted in the report, and quotes both Sir William Worsley and Stephen Buckley, head of information at Mind, explaining the importance of trees and being outside in nature to physical and mental health. Coverage in the Guardian extensively cites an author of the report, Vadim Saraev, who says “If people spend 30 minutes a week in trees, doing whatever they like – walking, sitting meditating – there are noticeable benefits”.  The report shows the importance of woodlands, which the government is already aiming to expand to tackle the climate and wildlife crises."
        },
        {
            "text": "This announcement was also covered in the Independent, I News, and Daily Mail, and regionally in outlets such as the Yorkshire Post and Western Daily Press."
        },
        {
            "text": "Forestry Commission Chair, Sir William Worsley, said:"
        },
        {
            "text": "The report, published during ‘National Tree Week’ and funded by the Forestry Commission, Scottish Forestry and the Welsh Government, is the first time the health and wellbeing benefits of the UK’s woodlands have been quantified."
        },
        {
            "text": "For England specifically, woodlands save £141 million costs associated with mental health illnesses, including visits to GPs, drug prescriptions, inpatient care, social services and the number of days lost due to mental health issues. The figures are based on evidence of the reduced incidence of depression and anxiety resulting from regular visits to woodlands."
        },
        {
            "text": "Read the ‘Valuing the mental health benefits of woodlands’ report here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}