{
    "url": "https://defrafarming.blog.gov.uk/2021/12/06/how-the-sustainable-farming-incentive-will-develop/",
    "title": "How the Sustainable Farming Incentive will develop",
    "authors": [
        "Cindy Hughes"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2021-12-06T12:48:49+00:00",
    "content": [
        {
            "text": "Last week we published details on how the new Sustainable Future Incentive scheme will work in 2022."
        },
        {
            "text": "The Sustainable Farming Incentive in 2022 is very much a starting point. We are rolling out the scheme incrementally."
        },
        {
            "text": "We want to test, learn and improve as we go, and expand the scheme to fit the available budget each year."
        },
        {
            "text": "In this post, I'll give you an idea of how the scheme will expand over the next few years."
        },
        {
            "heading": 2,
            "text": "Standards in 2022"
        },
        {
            "text": "The environment and climate change elements of the Sustainable Farming Incentive will be structured around standards. Standards are collections of actions relevant to a particular asset or theme on the farm."
        },
        {
            "text": "Farmers will be able to choose as many standards as they like. They will be able to add more standards into their Sustainable Farming Incentive agreement each year."
        },
        {
            "text": "In 2022, 3 standards available will be available."
        },
        {
            "text": "There will be 2 soils standards and the introductory level of the moorland and rough grazing standard. Livestock farmers will also be able to apply for an annual health and welfare review."
        },
        {
            "text": "The document we published last week gives more detail."
        },
        {
            "heading": 2,
            "text": "Levels of ambition"
        },
        {
            "text": "In time, each standard will have 3 levels of ambition. The introductory levels of the standards will pay farmers to meet a good level of sustainable environmental practice alongside food production, beyond the regulatory baseline and existing good farming practice."
        },
        {
            "text": "The intermediate and advanced levels will include more challenging actions and achieve higher levels of impact on the environment and climate change. These will result in a higher level of payment."
        },
        {
            "text": "Farmers will be able to choose the level of ambition that works for them on each parcel of their land."
        },
        {
            "text": "They can add higher levels of ambition each year if they wish. In 2022, the soils standards will have 2 levels of ambition: an introductory and intermediate level. We will, over the next year, add in an advanced level of ambition to the soils standards for those who want to go further and get paid more."
        },
        {
            "text": "We’ll be working with farmers and other experts to develop the advanced level of ambition over the next few months. We’ll publish more about that in the new year.  We’ve published the moorland and rough grazing standard in draft, and we will continue to work with moorlands farmers and experts over the next few months to finalise it."
        },
        {
            "text": "For the early rollout of the Sustainable Farming Incentive, the moorland and rough grazing standard will focus on assessing the condition of the moorlands. Those who want to go further can look to existing schemes which have a range of options for moorland farms."
        },
        {
            "text": "From 2024, we’ll have an intermediate and advanced level of ambition for this standard too. We’ll work with farmers and other experts to develop them."
        },
        {
            "heading": 2,
            "text": "Adding in more standards"
        },
        {
            "text": "Over the next 3 years, we’ll also add more standards into the scheme, until the full set of standards is available by 2025. The table below sets out our indicative plan. The precise details may change."
        },
        {
            "text": " "
        },
        {
            "text": "As the scheme expands, farmers will be able to adopt more standards, produce more environmental benefits, and earn more money from the scheme."
        },
        {
            "text": "Farmers will be able to update their Sustainable Farming Incentive agreements each year. This will allow them to adopt the new standards as they become available and increase their level of ambition and payment rate. It will also allow them to add more land into the scheme."
        },
        {
            "heading": 2,
            "text": "Local Nature Recovery and Landscape Recovery"
        },
        {
            "text": "Over the next few years, we will also rollout the other 2 environmental land management schemes: Local Nature Recovery and Landscape Recovery. "
        },
        {
            "text": "Farmers will be able to choose which scheme or combination of schemes works best for them, and we’ll make it straightforward to do that."
        },
        {
            "text": "We’ll publish more information on these schemes early next year. If you want to start doing more for the environment while we’re still rolling out the new schemes, we encourage to look at the Countryside Stewardship scheme. "
        },
        {
            "heading": 2,
            "text": "Countryside stewardship"
        },
        {
            "text": "Countryside Stewardship will remain open to new applications in 2022 and 2023, for agreements starting in 2023 and 2024. We’ve been improving and simplifying the scheme, and we’ve seen a 40% increase in applications for the scheme just in the last year."
        },
        {
            "text": "Please subscribe to the Future Farming blog to get updates."
        }
    ]
}