{
    "url": "https://insideDIO.blog.gov.uk/2021/12/06/increasing-our-capabilities-in-the-sustainable-management-of-the-defence-estate/",
    "title": "Increasing our capabilities in the sustainable management of the Defence estate",
    "authors": [
        "Richard Brooks"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Sustainability"
    ],
    "pub_date": "2021-12-06T17:01:03+00:00",
    "content": [
        {
            "text": "The sustainable management of woodland on military training areas is an important aspect of the Technical Services team's work. [Crown Copyright/MOD]The DIO Technical Services team is full of expert practitioners in various fields from archaeology to engineering, and now boasts even more expertise than before thanks to the introduction of 18 new posts related to climate resilience and sustainability."
        },
        {
            "text": "The new staff and the increased capacity they bring will enable us to work towards the sustainability goals outlined in our 10-Year Strategy, which are centred on DIO continuing to develop its expertise in sustainability, climate change and the environment. In working towards these goals, we will make a major contribution towards meeting MOD and UK government sustainability targets, such as achieving net-zero carbon emissions by 2050."
        },
        {
            "text": "Many of the posts have now been filled, with the new staff already making an impact."
        },
        {
            "heading": 2,
            "text": "Why were the new posts necessary?"
        },
        {
            "text": "Our former Director of Strategy & Planning Gen Nick Cavanagh wanted DIO to have a strategy which would help us to achieve our sustainability aspirations. As the infrastructure and services provider for Defence, a robust DIO sustainability strategy will in turn play a key role in meeting the climate change and sustainability objectives outlined for Defence as a whole in the MOD Climate Change and Sustainability Strategic Approach."
        },
        {
            "text": "This is a starting point in our journey as we work to point ourselves and Defence in the right direction to achieve the UK Government’s milestone target of net zero carbon emissions by 2050. The expansion of our capabilities in the area of sustainability is also vital to DIO’s continued stewardship of the many Sites of Special Scientific Interest (SSSI), Ramsar sites and other important natural assets across the UK Defence Training Estate which we have a duty to maintain."
        },
        {
            "heading": 2,
            "text": "Key aims over the next few years"
        },
        {
            "text": "A Sustainability Management System has been introduced to help gather information about our current land use across the UK Defence estate, the ‘natural capital’ value of the land, and the ways in which we can work to reduce the carbon footprint of the estate through a range of interventions."
        },
        {
            "text": "Natural capital baselining, which we have been conducting in partnership with Cranfield University, is an assessment across landscapes or habitats to look at the current value of the land to nature as well as its potential value to nature. We have been focusing on current land use across our rural estate and assessing the environmental impacts of its use, while aligning our strategy with Defra’s 25 year plan and the UK Government’s net zero 2050 target."
        },
        {
            "text": "A Gurkha recruit moves across an area of growing tree saplings at Catterick Training Area [Crown Copyright/MOD 2018]The current data shows that the rural Defence estate is most likely a net carbon emitter. Our task is to work out the most effective way to increase its value to nature, whether through planting trees, restoring peatland habitats, ‘rewilding’ or a range of other approaches. All such work must be carried out in balance with the primary purpose of the Defence estate, which is to enable military training."
        },
        {
            "heading": 2,
            "text": "What will the new posts allow us to do?"
        },
        {
            "text": "The new posts are scattered through the wider team, and as such help to boost capacity and resources across the team. There is now a second environmental advisor team which has a focus on supporting UK built estate colleagues to embed sustainability into their programme of works. Previously, this has been carried out on the overseas and training estate, with a similar approach now being applied to the UK built estate."
        },
        {
            "text": "The new posts also enable increased capacity in the (Defence Related Environmental Assessment Methodology) team, which assesses the environmental credentials of new builds on our estate. In addition, the new environmental engagement role will facilitate increased collaboration with conservation groups while also getting Service Personnel and their families involved in sustainability issues."
        },
        {
            "heading": 2,
            "text": "Long term plans"
        },
        {
            "text": "Two new woodland creation posts and two new ecology roles will provide more scope for the planning and implementation of environmental actions across the Defence estate, ranging from tree planting to river and peatland restoration. All four roles sit within the natural capital team, which is responsible for carrying out feasibility studies before work is carried out by colleagues ‘on the ground’ in Regional Delivery."
        },
        {
            "text": "Be sure to check our blog regularly for future updates on work the team is undertaking to meet the climate change and sustainability challenge across the UK Defence estate."
        }
    ]
}