{
    "url": "https://healthcareleaders.blog.gov.uk/2021/12/06/keeping-each-other-safe-in-the-nhs-this-winter/",
    "title": "Keeping each other safe in the NHS this winter",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Supporting NHS staff"
    ],
    "pub_date": "2021-12-06T14:26:05+00:00",
    "content": [
        {
            "text": "Winter is always a difficult time for the NHS. I’m under no illusion that this winter will be especially difficult, with Covid-19 – and the Omicron variant – adding to our usual seasonal pressures. I’m determined to make sure you have everything you need to stay safe and healthy through the challenging weeks ahead."
        },
        {
            "text": "During my visits to the NHS frontline, I’ve been hearing from you about what you need from us right now. I know we need to address workforce shortages across the NHS. While our workforce continues to grow, and we now have the highest staffing levels in the history of the NHS, we must ensure that we are able to meet the demand on services with the right staffing levels."
        },
        {
            "text": "This is why, in addition to our long-term ambitions, we’re taking short-term actions to find and plug gaps in the workforce, particularly among nurses and consultants. This means recruiting 13,000 international nurses and an additional 5,000 FTE clinical support workers in 2021/22."
        },
        {
            "text": "Protecting the NHS will require not just more new staff, but more support for you too, particularly when it comes to supporting your mental health and wellbeing."
        },
        {
            "text": "My department has been working hand in hand with the NHS and Local Authorities to ensure the right support is in place this winter. This includes ensuring colleagues can take an appropriate amount of annual leave to mentally recover and providing access to occupational health and psychological support."
        },
        {
            "text": "I would urge anyone struggling right now to speak to a colleague or your occupational health team, or to use the helplines or services that are available."
        },
        {
            "text": "This includes the 40 dedicated mental health support hubs across the country that are helping staff get rapid access to assessment and mental health support."
        },
        {
            "text": "These hubs have been an invaluable beacon of support throughout the pandemic – with over 32,000 staff members accessing them already – and I’m delighted to see that the NHS has confirmed a further £43 million of funding for 2021/22 to strengthen and continue this important programme."
        },
        {
            "text": "You can find the location and details of your nearest mental health support hub by clicking here."
        },
        {
            "text": "I want the NHS to be the best possible place for you to start and finish your career. This is why we’re working hard to deliver the commitments made in the NHS People Plan to offer and promote flexible working opportunities, supporting you to have more choice in when, where and how you work."
        },
        {
            "text": "As well as your mental health, I’m determined we do all we can to protect each other’s physical health too. There’s no denying that those working in health and care carry a unique responsibility – this is especially true of the people who work in close contact with some of our society’s most vulnerable people."
        },
        {
            "text": "I want to thank all of those who have already chosen to be vaccinated against Covid-19. The latest data shows that over 90% of NHS Trust staff in England have had a second dose, with 60% having had their booster jab."
        },
        {
            "text": "I continue to urge all staff working in the NHS this winter to get your vaccinations – including a booster dose – to keep your colleagues and patients safe and free from harm."
        },
        {
            "text": "NHS providers and staff have been the very best of us in some difficult days – and I’m so grateful for everything you continue to do. This winter, you’ll not only have my continued admiration and thanks. You’ll have my support too. Thank you."
        }
    ]
}