{
    "url": "https://civilservice.blog.gov.uk/2021/12/06/making-your-comms-clear-and-inclusive-our-top-tips/",
    "title": "Making your comms clear and inclusive - our top tips",
    "authors": [
        "Sarah Healey, DCMS Permanent Secretary and CS Disability Champion"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-06T10:15:00+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Government information should be as clear and accessible as possible. Sarah Healey's simple guide for what everyone should know."
        },
        {
            "text": "Civil servants send out hundreds of thousands of emails and documents every week, which is why it’s important to make them accessible and ensure they are written in plain English. "
        },
        {
            "text": "Accessible communication is an umbrella term to describe communication that’s clear and easy to read and understand, taking into consideration the needs of people who may use different software or techniques to process information. Things that help disabled people will often help everyone else too; making documents easy to read and navigate around helps everyone to communicate in an effective and inclusive way. "
        },
        {
            "text": "We're all responsible"
        },
        {
            "text": "If we don’t consider accessibility, we are potentially excluding colleagues, which could lead to difficulty in accessing vital information. Accessible communication is sometimes overlooked, but we are all responsible for making things as user-friendly as possible and ensuring that nobody is left struggling. "
        },
        {
            "text": "I’m grateful to colleagues Paul Willgoss and Stephanie Hill for drawing on their expertise to share some of the challenges they face, as well as valuable tips we can all adopt. Last week was International Day for People with Disabilities and it’s also Disability History Month - two timely events which hammer home the importance of building accessibility into all comms."
        },
        {
            "text": "At a time when we’re working hard to modernise and reform the Civil Service, I encourage all of you to weave in some of their helpful suggestions to make our communications more inclusive for disabled colleagues and citizens."
        },
        {
            "heading": 3,
            "text": "Improving the Civil Service for others"
        },
        {
            "text": "Paul Willgoss MBE, Science Division, Chief Scientific Adviser’s Office"
        },
        {
            "text": "I am a disabled civil servant, and I’ve been involved in improving the Civil Service for others over the last 20 years. Yet every year, I’ve seen accessibility can often be viewed as a strange, remote new world. Trust me, it doesn’t have to be!"
        },
        {
            "text": "Making sure our documents are accessible to as many people as possible is right at the heart of being an inclusive organisation. For many of us, reading a poorly structured document is tiring and frustrating. "
        },
        {
            "text": "Imagine having to fiddle with multiple settings, then trying to cut and paste text into other programmes just to access the multitude of written communications we each receive every day. On top of this, you’re fatigued from managing your life already. This is the reality for many disabled people."
        },
        {
            "text": "Misunderstanding and confusion"
        },
        {
            "text": "There is a lot of misunderstanding and confusion about making documents accessible. If you’re producing glossy policy documents, websites or apps, then please find an expert as early as possible - it’s much easier to build accessibility in from the start rather than retrofit it.   "
        },
        {
            "text": "Many documents and services for UK citizens are written by civil servants in our teams, departments or across the Civil Service, so following some simple rules can be really helpful. "
        },
        {
            "heading": 3,
            "text": "The web accessibility advocate"
        },
        {
            "text": "Stephanie Hill, Digital Content Producer, Government Communication Service"
        },
        {
            "text": "I am a web accessibility advocate and a mum of two. My mother was impacted by a stroke when I was young, so I’ve always been empathetic to people's differing needs. As a digital content professional for more than 20 years, I care about providing accessible content online."
        },
        {
            "text": "Accessible communication is important because no one should feel excluded from messages or online activities, at home or in the workplace. Government information should be as accessible and inclusive as possible. "
        },
        {
            "text": "It’s our duty as civil servants to make sure everyone who needs to engage with us can do what they need (like apply for benefits or a driving license, or receive information) in an straightforward, clear manner. It’s also important to be mindful of the different ways and needs that others like to receive information or communicate."
        },
        {
            "heading": 4,
            "text": "New guide"
        },
        {
            "text": "Last year, we published a guide on how to make social media posts clearer. It was developed by the Government Digital Service in partnership with the Government Communication Service (GCS) with input from the Government Equalities Office. "
        },
        {
            "text": "You can read the guidance: Planning, creating and publishing accessible social media campaigns on the GCS website. We also developed on-demand training about digital accessibility best practices to upskill more colleagues."
        },
        {
            "heading": 4,
            "text": "Practical Dos and Don’ts"
        },
        {
            "text": "If you’re unsure about whether your communication is accessible for colleagues, the best thing to do is to ask them. There are also some fantastic accessible communications learning and resources available to everyone. As a starting point, here are some things that you can do to make your communications more accessible, especially emails and documents."
        },
        {
            "text": "Thank you to Paul and Stephanie for sharing why accessible communications are important. It’s fantastic to have colleagues who are so passionate about making the Civil Service more inclusive and representative. "
        },
        {
            "text": "We all communicate at work and at home, and the pandemic has also increased our reliance on technology. That’s why it’s vital nobody misses out on accessing information. These are just a few ways you can make your communications accessible; please share your own tips in the comments below.◼︎"
        }
    ]
}