{
    "url": "https://nationalscreening.blog.gov.uk/2021/12/06/supporting-the-uk-nsc-to-make-effective-recommendations/",
    "title": "Supporting the UK NSC to make effective recommendations",
    "authors": [
        "Jonny Fertray"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-12-06T16:48:13+00:00",
    "content": [
        {
            "text": "Have you ever wondered where the evidence which the UK National Screening Committee (UK NSC) uses to make its recommendations comes from?"
        },
        {
            "text": "The UK NSC is supported by a secretariat function, part of which is a team responsible for managing the evidence review process. This evidence team plays a vital role to help the UK NSC to keep its recommendations up to date and based on the best possible evidence."
        },
        {
            "text": "The team commissions external suppliers to develop a range of evidence ‘products’. The UK NSC uses these products to make its recommendation to ministers. Examples of products include:"
        },
        {
            "heading": 2,
            "text": "A new home"
        },
        {
            "text": "The evidence team has just moved from Public Health England and is now hosted by the Office for Health Improvement and Disparities (OHID), which is part of the Department of Health and Social Care (DHSC)."
        },
        {
            "text": "The team’s work will continue to inform policy on new and existing screening programmes. Its role covers the following areas."
        },
        {
            "heading": 3,
            "text": "Commissioning evidence products"
        },
        {
            "text": "The team commissions and procures a range of evidence products from external evidence review teams. It does this by determining the appropriate type of product for each condition considered by the UK NSC, as well as the most important questions that need to be answered by that product, the scope of these questions and the potential methods to address them."
        },
        {
            "text": "It has the skills, though not always the capacity, to conduct its own systematic reviews, evidence maps or other analyses, when needed."
        },
        {
            "heading": 3,
            "text": "Managing the review process"
        },
        {
            "text": "Importantly, the team manages the whole end-to-end process for each topic reviewed. This includes:"
        },
        {
            "heading": 3,
            "text": "Horizon scanning"
        },
        {
            "text": "The team plans and prioritises for future reviews by systematically examining information sources to detect early signs of important developments."
        },
        {
            "text": "It also runs the annual call for topics, evaluating the submissions and managing those that are successful through the entire evidence review process."
        },
        {
            "text": "Finally, the team also manages or contributes to topic-specific projects, such as artificial intelligence (AI) or ethics in screening."
        },
        {
            "text": "While the evidence team supports the UK NSC by providing it with high quality evidence and managing its review processes, it is the committee itself that makes recommendations to ministers in the 4 countries of the UK and is accountable for the quality of those recommendations."
        },
        {
            "text": "John Marshall, who leads the evidence team, said:"
        },
        {
            "heading": 2,
            "text": "UK National Screening Committee"
        },
        {
            "text": "The UK NSC works independently from central Government and the Civil Service and reports to the chief medical officers (CMOs) of the 4 nations of the UK. It is made up of a community of experts in their specialist fields, who are independently appointed to the committee as individuals."
        },
        {
            "text": "It has been recently recruiting, to make sure it has the right kind of experts across the 109 conditions it regularly reviews. In their role as a member of the UK NSC, these experts are expected to:"
        },
        {
            "text": "England’s Chief Medical Officer (CMO), Professor Chris Whitty, who heads up the new OHID, said:"
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}