{
    "url": "https://digitaltrade.blog.gov.uk/2021/12/06/volunteering-in-the-civil-service-taking-time-for-our-wellbeing-by-supporting-causes-we-care-about/",
    "title": "Volunteering in the Civil Service: taking time for our wellbeing by supporting causes we care about",
    "authors": [
        "Millie Martin, Engagement and Strategic Adoption Manager",
        "Hannah Horn, Senior Engagement and Strategic Adoption Manager"
    ],
    "categories": [
        "Culture",
        "Flexible working",
        "People and Skills"
    ],
    "pub_date": "2021-12-06T09:18:32+00:00",
    "content": [
        {
            "heading": 6,
            "text": "A stock image of volunteers"
        },
        {
            "text": "At the Department for International Trade (DIT), all civil servants are allowed 3 special paid leave days each year to volunteer. You can take time off work to support causes you are passionate about. DIT’s Volunteering Network support this policy and encourage colleagues to take their special paid leave days.  "
        },
        {
            "text": "To celebrate International Volunteer Day (IVD) on 5 December, why not volunteer for a cause you care about?  "
        },
        {
            "text": "IVD is mandated by the UN General Assembly and viewed as a unique chance for volunteers and organisations to celebrate their efforts, share their values, and promote their work. We are celebrating IVD by reflecting on the benefits of volunteering and how you can take part as a civil servant. We also want to showcase volunteering experiences by members of the Digital Data and Technology (DDaT) team.  "
        },
        {
            "heading": 3,
            "text": "Special paid leave days  "
        },
        {
            "text": "As civil servants in DIT, we are entitled to take 3 days each year to dedicate to volunteering. Being part of the DDaT DIT team means you will have the opportunity to take paid volunteering leave too. Volunteering can range from helping at a food bank to distribute food to those in need, to litter picking in your local park to protect wildlife. At DIT our volunteering network can support you to take up volunteering opportunities you care about the most.   "
        },
        {
            "text": "You can take the full 3 days or just an hour of your time to volunteer. Taking the special paid leave will not impact your annual leave and you can volunteer for a cause you are passionate about.  "
        },
        {
            "text": "DDaT’s senior management team (SMT) support us in taking our volunteering days. We promote a culture at DDaT where we can take time out of our day jobs and support causes we care about. We are encouraged to take these days and our leadership team take them too.  "
        },
        {
            "text": "“I used a volunteering day in 2020 at Gateshead to be an official at the re-located Anniversary Games! The games are part of the 2012 Olympic legacy. I was invited in 2020 before they were cancelled for COVID so was delighted to be able to go on a Tuesday in July using a volunteering day. There was the added advantage of being up close to some of our Olympians shortly before they went to the Olympics!” Sian Thomas, Chief Data Officer"
        },
        {
            "heading": 3,
            "text": "The benefits of volunteering  "
        },
        {
            "text": "Volunteering has many benefits and DIT encourage staff to volunteer multiple times throughout the year. Volunteering has positive effects on mental health and enhances life satisfaction by helping volunteers to contribute towards causes they care about, learn new skills, and meet new people.  "
        },
        {
            "text": "Even virtual volunteering can make a huge difference to the volunteer and the charity. Many staff who have volunteered over the past year have reported to have found a new sense of confidence and purpose from trying something new outside of their comfort zone.  "
        },
        {
            "text": "Millie and Julie share their experiences of volunteering they carried out this year: "
        },
        {
            "text": "“In summer 2021 I volunteered at a COVID vaccination hub to support the NHS with the rollout of the vaccine. I was able to take the day off with my line manager’s approval and volunteered from 8:30am – 5:30pm in the lovely Westminster sunshine. I was a steward for the day, making sure people were in the right place to receive their vaccine. The whole experience was very rewarding, I got to meet so many people and discuss what getting the vaccine meant to them. I would highly recommend volunteering for a cause you care about and using your volunteering days.” Millie Martin, Engagement and Strategic Adoption team"
        },
        {
            "text": "“In August 2021 I volunteered to help out with some conservation work in Lee Valley. The conservation work involved a day of litter picking and raking mown areas to encourage meadow development. I would recommend it to anybody wanting to do a volunteer day outdoors. It's a complete change to working in an office (or at home). You're also helping to maintain an outdoor area which is used by many people for walking, cycling, and sports. It was great to get outdoors and the work itself was better than a gym workout!” Julie Fenn, Live Services team"
        },
        {
            "heading": 3,
            "text": "How the DIT Volunteering Network can support you "
        },
        {
            "heading": 6,
            "text": "A screenshot of DIT’s Volunteering Network Microsoft Teams call"
        },
        {
            "text": "DIT’s Volunteering Network is a lively network of over 350 staff across DIT. As a network we aim to make volunteering accessible for staff by: "
        },
        {
            "text": "The network also has a monthly newsletter for members. The newsletter contains volunteering opportunities across the UK that are available to staff to take if they wish. We have dedicated research leads who seek out the opportunities with charities and organisations. They promote regular opportunities for a range of causes including the environment, homelessness, and NHS volunteering. By doing this, we do all the hard work so that staff can focus on volunteering.  "
        },
        {
            "text": "Volunteering has never been easier in the Civil Service. You can take time off work to volunteer for causes you care about and make a real difference. To find out more, visit DDaT’s careers page on how you can view our other working benefits. "
        }
    ]
}