{
    "url": "https://civilservice.blog.gov.uk/2022/11/28/analyse-this/",
    "title": "Analyse this",
    "authors": [
        "Osama Rahman"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-11-28T12:07:20+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Osama Rahman, Director of the Data Science Campus, talks about the importance of developing analysis skills for all, and involving analysts in all we do. "
        },
        {
            "text": "Everyone in government needs to be supported to make informed decisions so that policy and operations can be evidenced and deliver value for money, and improve the lives of the people of the UK."
        },
        {
            "text": "The Government Analysis Function, a cross-government network and a Civil Service Function, is working with the Government Campus and the Policy Profession to identify the right analytical training for all civil servants, wherever you sit in government. This training sits in strand 2 of the Government Campus curriculum. Ranging from awareness in administrative data to forecasting, there is something that covers every skill level."
        },
        {
            "text": "To get things done in government we must improve the analytical capability of the Civil Service. Not just for those in analytical professions across government, but we all need to understand a little bit about analysis. While we don’t all need to be experts in analysis, we do all need to know when and how to involve an analyst, understand the analytical process and how to ask the right questions of analysts. "
        },
        {
            "heading": 4,
            "text": "What’s an analyst?"
        },
        {
            "text": "First let's start with what an analyst is. There are many different people and roles involved in the generation and dissemination of analysis and evidence. The reason for this is different experts are needed to help inform, shape, and measure the impact of strategy, policy, and operational development and delivery. "
        },
        {
            "text": "Here are a range of different analyst roles:"
        },
        {
            "heading": 4,
            "text": "How can analysts help you"
        },
        {
            "text": "Analysis helps us all make better decisions, understand what works and what doesn’t, and tailor delivery to user needs. Ongoing relationships with analysts also help us to identify new data sources; understand what modelling, data, and research and evidence says; understand complex systems; and help innovate."
        },
        {
            "text": "The ROAMEF framework (traditionally used to inform policy thinking) is useful for thinking about how analysts can help."
        },
        {
            "text": "Rationale - Analysts improve understanding of what the problem is, what outcomes or behaviours need to change, and why government intervention might make this happen."
        },
        {
            "text": "Objectives - Analysts set Objectives, setting out a clear vision or definition of the impact or outcomes we want to deliver – what does success look like? Analysts use different methods to structure or diagnose problems to identify root causes and build the data and evidence base to really understand what’s going on, and show how government intervention will deliver activities and outputs that will lead to desired impacts and outcomes.Once objectives have been identified, analysts help draw up a list of options."
        },
        {
            "text": "Appraise - Analysts assess these options and identify impacts resulting from the intervention to make Value for Money (VfM) decisions. "
        },
        {
            "text": "Monitor - After choosing the best options to implement, analysts monitor how these are being implemented. Monitoring is important not just to track performance and what’s going on but also to spot when things are going off-track and when we need to step in to investigate what’s going wrong, make changes and build in learning."
        },
        {
            "text": "Evaluation - Analysts design Evaluations to understand, and provide context to Monitoring data, and demonstrate overall impact of  interventions. "
        },
        {
            "text": "Feedback - They build in feedback loops throughout so delivery can be refined while running and can also help demonstrate impact by planning delivery in a way that allows measuring the ‘counterfactual’, or what would be happening if the intervention were not in place. "
        },
        {
            "heading": 4,
            "text": "Improving children’s language skills\nThe Nuffield Early Language Intervention (NELI) programme trial involved 1,156 pupils. Teaching assistants identified children who needed further support. It achieved the equivalent of 3 additional months’ progress in language skills, compared to the control group and Department for Education was able to make an informed decision to supply NELI to more state funded schools. "
        },
        {
            "text": "All of this helps inform decisions on whether government interventions should be continued, expanded, modified or stopped. As well as a clearer picture of what future ‘success’ will look like, and how future specific needs might be met. "
        },
        {
            "text": "Whatever you are working on, analysts can help you. Involve them in all that you do, not just at particular points. Get in touch with them!"
        },
        {
            "text": "Find out more about the Government Campus curriculum and the training available.  To understand analysis better and be equipped to use analysis, visit the Government Analysis Function website. Further examples of good practice are available at the Evaluation Task Force website."
        }
    ]
}