{
    "url": "https://deframedia.blog.gov.uk/2022/11/28/daily-express-coverage-of-20-million-funding-for-woodlands/",
    "title": "Daily Express coverage of £20 million funding for woodlands",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-11-28T13:14:38+00:00",
    "content": [
        {
            "text": "There was exclusive coverage in today’s Daily Express of our announcement of £20 million in funding for tree planting, innovation and resilience."
        },
        {
            "text": "Defra and the Forestry Commission have jointly announced the recipients of three different funds aimed at accelerating tree planting, boosting domestic timber production and supporting innovative approaches to many of the greatest threats facing our trees, woodlands and forests – namely, climate change and the growing prevalence of pests and diseases. Announced as part of National Tree Week, the three funds are the Woods into Management Forestry Innovation Funds, the Tree Production Innovation Fund and the Woodland Creation Accelerator Fund. The latter will support local authority tree planting initiatives which will see hundreds of thousands of trees planted in communities across England."
        },
        {
            "text": "The funding will create jobs, boost biodiversity, create new opportunities for growth for the forestry sector and support progress towards our goal of trebling tree planting rates in England by the end of this Parliament."
        },
        {
            "text": "In a comment piece for the Daily Express, Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "National Tree Week marks the beginning of another crucial planting season and offers a moment for us to reflect on the importance of the trees, woodlands and forests at the heart of our natural landscapes. They protect us against flooding, provide habitats for our precious native wildlife and are nature’s ultimate carbon capture machines. They are an important source of jobs too, directly employing over 30,000 and contributing more than £2billion to our economy every year. In the face of climate change and the growing prevalence of pests and diseases, it is imperative that we plant more trees, whilst simultaneously building their resilience. So I am delighted to mark the beginning of National Tree Week 2022 with a major £20million funding package, made possible through our landmark Nature for Climate Fund. Over 100 projects championed by tree nurseries, charities and businesses will be funded to bring the latest innovations to the forestry sector and address some of the greatest threats facing our treescapes. Local authorities across the country will receive significant funding to kickstart tree planting activity, create new green jobs and boost access to nature. The value of trees to people and nature has never been clearer, and I know Express readers have been particularly inspired by the paper’s campaign to make space for nature so I am sure readers will need no extra encouragement to get involved and plant a tree."
        },
        {
            "text": "Trudy Harrison, Forestry Minister, said:"
        },
        {
            "text": "Also announced today, the Local Authority Treescapes Fund (LATF) and the Urban Tree Challenge Fund (UTCF) will reopen for new applications early in 2023. Now in their third and fifth rounds respectively, the reopening of both funds will see trees planted in rural areas (for LATF), as well as in towns and cities nationwide."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}