{
    "url": "https://designnotes.blog.gov.uk/2022/11/28/designing-for-people-with-dyscalculia-and-low-numeracy/",
    "title": "Designing for people with dyscalculia and low numeracy",
    "authors": [
        "Jane McFayden- Senior Content Designer, DWP Digital",
        "Rachel Malic - Content Designer, HMRC Digital",
        "Laura Parker - Content Designer, HMRC Digital"
    ],
    "categories": [
        "Design"
    ],
    "pub_date": "2022-11-28T09:22:19+00:00",
    "content": [
        {
            "text": "Dyscalculia (Dis - Cal - Coo - Lia) is a specific and persistent difficulty in understanding numbers."
        },
        {
            "text": "It makes it hard for someone to read, understand and work with numbers. It impacts the ability to handle money, like counting change, telling and managing time, estimating how long things take, understanding percentages, and remembering number facts."
        },
        {
            "text": "Dyscalculia also affects someone’s working memory. It impacts everyday things like remembering items on a shopping list, following instructions, phone numbers, PINs or game scores."
        },
        {
            "text": "It means people miss trains, withdraw the wrong amount of money from cash machines, get locked out of their accounts, and sign contracts they don’t understand.  "
        },
        {
            "text": "People can be unaware they have dyscalculia but know they struggle with numbers."
        },
        {
            "heading": 2,
            "text": "Most people with dyscalculia are undiagnosed"
        },
        {
            "text": "There’s little awareness in society about dyscalculia. And this means you’re less likely to be diagnosed if you have it and are less likely to be offered support. "
        },
        {
            "text": "Dealing with numbers can be overwhelming and stressful, often developing into maths or numbers anxiety. "
        },
        {
            "text": "About 1 in 20 people have dyscalculia in the UK. As a comparison, about 1 in 10 to 20 people have dyslexia. "
        },
        {
            "text": "If diagnosed early enough, younger people can be supported with interventions that break maths down into manageable chunks, using different ways of learning."
        },
        {
            "text": "But for adults who have gone undiagnosed, many have learned over time to cope, avoided situations or just lived with the limitations of not understanding numbers and the impact that has on everyday life."
        },
        {
            "heading": 2,
            "text": "It’s not just people with dyscalculia that struggle with numbers"
        },
        {
            "text": "Low numeracy affects half of the working-age adults in the UK. That’s nearly 17 million people. 1 in 5 people say they would avoid jobs that involve frequent use of numbers."
        },
        {
            "text": "Low numeracy makes it harder and more stressful to manage money. For example, a Financial Conduct Authority 2020 survey found that those that had fallen into debt felt it might have been avoided if they had understood their options better. (It was hard for us to read the results from the financial conduct authority survey because they were all in percentages!)"
        },
        {
            "text": "How can people understand the consequences if they don’t understand their options?"
        },
        {
            "heading": 2,
            "text": "Designing for people who struggle with numbers"
        },
        {
            "text": "We need to deliver services which convey numbers plainly and in a way that is easy for everyone to understand. "
        },
        {
            "text": "It's challenging because, unlike plain English, there is little guidance on presenting numbers and data. "
        },
        {
            "text": "Some of the concepts we work with are complicated, like pensions, tax, interest rates, and net income. These all require some ability to perform calculations and understand percentages."
        },
        {
            "text": "There are simple ways we can design to help people make better sense of numbers. And this is vital. It could mean the difference between people using a service to access the support they need or not being able to use it at all."
        },
        {
            "text": "Research published, found that making small changes to the way bills and statements are presented, doubled the number of customers who understood them. "
        },
        {
            "text": "We can:"
        },
        {
            "text": "There is no alternative to government services, so we must make numbers accessible to everyone. Design to be inclusive, and everyone benefits."
        },
        {
            "heading": 2,
            "text": "Forming a cross-government dyscalculia network"
        },
        {
            "text": "We are designers (some of us have dyscalculia) from HMRC and DWP raising awareness of dyscalculia. We have produced an accessibility poster called ‘Designing for people with dyscalculia and low numeracy’. "
        },
        {
            "heading": 3,
            "text": "Get the poster"
        },
        {
            "text": "The poster is available to download in accessible formats from the DWP Accessibility Manual."
        },
        {
            "text": "The poster is general guidance. If someone cannot do all the things we have listed, we want them to do as much as possible. It will make a difference."
        },
        {
            "text": "The poster is a first step in our campaign. We are building a cross-government dyscalculia network, sharing our experience and research with the government design community."
        },
        {
            "heading": 3,
            "text": "Thank you!"
        },
        {
            "text": "A big thank you to:"
        },
        {
            "heading": 2,
            "text": "More helpful links "
        },
        {
            "text": "What is dyscalculia?"
        },
        {
            "text": "What it’s like living with dyscalculia."
        },
        {
            "text": "Some differences between dyscalculia and dyslexia. "
        }
    ]
}