{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/28/field-officers-the-best-job-in-the-world/",
    "title": "Field Officers: \"The best job in the world!\"",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2022-11-28T15:44:49+00:00",
    "content": [
        {
            "text": "With the introduction of a more supportive, partnership-based approach to site visits, moving away from the penalty-based system of inspections under the EU, to farmer-focused visits for schemes such as the Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS), Field Officer Ben Hastings talks about his role and the difference it’s making to farmers. "
        },
        {
            "text": "Hi, I’m Ben and I’ve a been Field Officer for 18 years. I take great satisfaction from my role advising farmers on numerous topics, which is very rewarding. Meeting all generations of farmers, landowners and agents is fascinating, listening to their problems and stories, and for me, there’s nothing more rewarding than spending time walking in the countryside, seeing an abundance of wildlife, landscapes and terrain. So, for me folks, it’s the best job in the world!"
        },
        {
            "text": "I was very fortunate to have been brought up on my grandparent’s dairy farm in Cumbria where I gained extensive agricultural knowledge and experience, as well as many years spent working in the animal pharmaceutical industry and in my spare time managing and acting as game-keeper for my own pheasant and partridge shoot. My experiences and knowledge of agriculture, the countryside, crops, wildlife, and birds has definitely given me an advantage and helped me develop my career and role as a Field Officer."
        },
        {
            "text": "I started with RPA carrying out cattle and sheep identification inspections and began to build a sound knowledge of the regulations and requirements. I soon learnt that every farm is different, every farmer is unique, and each have their own methods, practices, and traditions as to how they farm and I’ve learnt to adapt and work alongside each farmer, understand their concerns, listen to their problems and advise and guide them."
        },
        {
            "text": "Field officers cover a vast range of schemes and farm visits, some of which can be very complex, which means we have to have a sound understanding of farming, the countryside, farming calendars, crops, soils, Nitrate Vulnerable Zones, land use categories, pesticides, fertiliser applications, livestock feeds, stewardship options, prescriptions and management requirements. This means keeping up to date with current legislation, rules, and regulations.  I’m sure all my fellow Field Officers will agree that we cover a wide range of topics and have not only become very skilled in multiple schemes, but we border on being agronomists, farm and arable consultants, FACT advisors and even on some occasions vets as we certainly must have the knowledge when covering these topics."
        },
        {
            "text": "When I’m allocated an inspection, I put a considerable amount of time and thought into diligently planning and preparing a dossier. I check applicants’ agreements, prescriptions, and management requirements, checking locations of land, making risk assessments, and using all the systems we have available, such as IMIS, SITI Agri, Land inspection device, CRM, Animal Movement Licence Service (AMLS) & Cattle Tracing System (CTS)."
        },
        {
            "text": "I discuss the visit process, clearly advising all parties what’s required of them. The initial conversation is crucial and as a Field Officer, being able to clearly explain what the visit involves, why it’s necessary, what’s needed from the farmer and how long the visit is likely to take, is so important. Field Officers may also need to answer on the spot questions, so it’s important to have a vast knowledge of all schemes and be aware of what activities could be going on around the times we make contact, such as lambing, calving and harvest. This sets the way for everyone to work together during a visit because we, as field officers, and RPA in general, need to be able to work with farmers and land owners and offer them sound advice and support."
        },
        {
            "text": "The job does come with its stressful moments, when we find ourselves at certain times of the year, under pressure to write up reports and meet deadlines, while still completing physical inspections. I still get great satisfaction when I press that submit button, knowing I’ve put my all into both the physical and report elements of the visit, as well as offering guidance to farmers for the future."
        },
        {
            "text": "In addition to physical farm visits, I undertake daily tasks such as completing my diary, updating my calendar to show my whereabouts to ensure my safety and attending meetings. I also submit a weekly predictions sheet, with the work I’ve completed and what I forecast for the week ahead, all of which can take several hours."
        },
        {
            "text": "I’m also currently mentoring several Field Officers who are new to RPA and thoroughly enjoying it. I feel very confident in explaining everything from the basics of farming in general, knowledge about crops, wildlife, farming activities, how to navigate around farms safely and giving them an insight into the schemes and visits we carry out, offering tips and advice that I feel will set them in good stead for when they go solo. The new recruits have come into the job at the perfect time, to help deliver the more advisory and guidance approach, in line with the new Future Farming Programme. I feel it’s paramount they’re trained to deliver this approach and work alongside farmers and land owners and offer as much support and guidance as possible, to help the future of farming in this country."
        },
        {
            "text": "In my spare time I train regularly in a physique and fitness category and I also help coach and create diets for people. I run my own established game shoot which I have built over the last 20 years and I have three working spaniels and one Labrador that are trained in the field. I help on my family’s farm and I’m a dedicated Sunderland AFC Supporter, attending games regularly in the EFL Championship."
        }
    ]
}