{
    "url": "https://defrafarming.blog.gov.uk/2022/11/28/free-business-advice-latest-list-of-providers/",
    "title": "Free business advice: latest list of providers",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Future Farming and Countryside Programme",
        "Transition support"
    ],
    "pub_date": "2022-11-28T12:26:21+00:00",
    "content": [
        {
            "text": "Through the Future Farming Resilience Fund, any farmer or land manager in England who receives BPS (Basic Payment Scheme payments) is eligible to receive free business advice from an independent provider during the early years of the agricultural transition. "
        },
        {
            "text": "We've been offering this support in phases. The final phase of support is now underway. It will run until March 2025. In this phase, 17 known and trusted organisations in the farming community have been funded by us to give advice to 32,000 people.  "
        },
        {
            "text": "To access this advice, take a look at the list of advice providers on GOV.UK. It is arranged by county. "
        },
        {
            "text": "Check what each adviser offers and choose the one that suits your needs. You can contact them directly. "
        },
        {
            "text": "If you have trouble accessing the list online, call Defra on 0345 933 5577. "
        },
        {
            "text": "We’ll share a list of advisers in your county, describe the type of support on offer and provide you with contact details. You’ll need to contact that adviser directly by email or phone. "
        },
        {
            "text": "There are various types of support to choose from. For example:  "
        },
        {
            "text": "You are welcome to get introductory help and information from multiple providers and you can attend as many opening webinars or workshops as you like, but you can only receive detailed 1-to-1 support from a single provider."
        },
        {
            "text": "To help you prepare, visit the funding for farmers page on GOV.UK. It gives an overview of the new ongoing payments and one-off grants available to farmers in England. "
        },
        {
            "text": "The New Farming Policies and Payments in England booklet explains when you can expect each scheme and grant to be available. "
        }
    ]
}