{
    "url": "https://ipo.blog.gov.uk/2022/11/28/hornits-story-the-sme-who-used-ip-to-combat-the-counterfeiters/",
    "title": "Hornit’s story: the SME who used IP to combat the counterfeiters",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Design",
        "Design right",
        "Enforcement",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-11-28T14:31:28+00:00",
    "content": [
        {
            "text": "Wheeling their way into the future, are Hornit - an innovative and creative British business that produces a wide range of cycling products. We spoke to their CEO Tom de Pelet about how Hornit has grown and how intellectual property rights have strengthened his business."
        },
        {
            "heading": 2,
            "text": "‘The world’s loudest and the world’s smallest’"
        },
        {
            "text": "The Hornit business started with the invention of the loudest bicycle horn in the world, the Hornit dB140. Created to make riding in busy towns and cities safer and less stressful for everyone, the dB140 puts the rider in control of their safety by letting other road users know they’re there."
        },
        {
            "text": "From this initial product, Hornit has expanded to produce a number of bikes and cycling accessories including the CLUG – the world’s smallest bike rack."
        },
        {
            "text": "When you think of a bike rack, you may envisage the large metal poles that are dotted around our town centres. Or complex mounted structures designed to be used within garages. Tom and his team flipped this idea around, to create a minimalist clip that grips the bike tyre."
        },
        {
            "text": "The CLUG can be fitted to any wall, offering an easy way to store bikes vertically or horizontally and is almost invisible when the bike isn’t there."
        },
        {
            "heading": 2,
            "text": "Putting an end to infringers"
        },
        {
            "text": "In the below video, Tom explains how registering his IP has given him the legal right to act against those selling fake versions of his products."
        },
        {
            "text": "Tom registered his IP rights globally, which gave him a strong standing when defending his business against fake sellers. He described how this has allowed him to work with brand protection consultancy, SnapDragon to carry out searches of digital markets for counterfeit versions of the CLUG."
        },
        {
            "text": "By taking down dozens of adverts of fake products and many thousands of listings on third party websites, Tom has been able to create a stronger brand image of the quality of his products."
        },
        {
            "heading": 2,
            "text": "So, you have a brand and a product, what next?"
        },
        {
            "text": "Searching for current trade marks, design registrations and patents will aid your application by allowing you to see if similar rights already exist. The IPO has a range of tools available to allow you to check if your trade mark is likely to be granted, and to see what exists already before applying for a patent. This is exactly what Tom did, which helped him when applying for Hornit as a brand name."
        },
        {
            "heading": 2,
            "text": "Tom’s tips for protecting your business’ IP"
        },
        {
            "heading": 3,
            "text": "Get specialised advice from a lawyer"
        },
        {
            "text": "Tom explained how there are many things to consider when looking at the IP that exists across a business. From the strategy of filing in different jurisdictions to drafting applications, the costs and the likely return on investment. He shared why it was so important for them to seek professional help:"
        },
        {
            "heading": 3,
            "text": "Future proof your protection"
        },
        {
            "text": "Tom advised other businesses to think about the possible markets or goods classes you may want to trade in the near future, so that your applications will keep you protected if you expand into these areas. This can also help you save money rather than filing a new application."
        },
        {
            "text": "For a trade mark in the UK, each additional class after the first costs £50 but it’s worth noting that if you do not use the trade mark in these areas within 5 years, this class could be invalidated."
        },
        {
            "heading": 2,
            "text": "More than bike mounts"
        },
        {
            "text": "Hornit currently sells much more than bike mounts, with children’s bikes, helmets, horns and cycling protection making up their range. Part of their future plan is to look at what else there’s a market for, as Tom continues to invest in product development."
        },
        {
            "text": "Not only this, but he and the team hope to grow the brand further in the different markets they already operate in."
        }
    ]
}