{
    "url": "https://hmlandregistry.blog.gov.uk/2022/11/28/the-hm-land-registry-portal-redesign/",
    "title": "The HM Land Registry portal redesign",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services (Head of Product)"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-11-28T15:00:21+00:00",
    "content": [
        {
            "text": "Since it was launched in 2009, our customer portal has become the front door into HM Land Registry for the majority of our customers."
        },
        {
            "text": "While new features and services had been added over the years, one thing that hasn’t changed is the way it looks, but from 30 November that is going to change."
        },
        {
            "heading": 2,
            "text": "Digital by default"
        },
        {
            "text": "We will be launching the first phase of our portal redesign on the day we go digital by default: 30 November. This is the day the Digital Registration Service will become the default application submission service on the portal and the redesign is a key component in making it easier to submit digital applications."
        },
        {
            "heading": 2,
            "text": "What will be changing?"
        },
        {
            "text": "Starting with the homepage, the portal will have a new look and feel and has been designed to make the portal easier to use and to better support customers in submitting digital applications and managing their applications. This redesign won’t be changing any of the services, but it will change how our customers use and interact with the portal – beginning with a personalised homepage."
        },
        {
            "text": "Users of the portal will see:"
        },
        {
            "text": "We’ve made these changes not only to improve the service provided by the portal, but that this streamlined approach will ultimately help customers complete their work faster."
        },
        {
            "text": "From 30 November our customers will see the redesign on the portal homepage, Digital Registration Service and View Applications. We’ll be completing further work to bring the login page and the rest of the portal into this design in the coming months."
        },
        {
            "text": "We have put together more detailed guidance on our portal guidance page."
        },
        {
            "heading": 2,
            "text": "The design"
        },
        {
            "text": "We’ve received a lot of feedback from customers that the portal currently looks clunky and old fashioned, a fair criticism given it’s 13 years old!"
        },
        {
            "text": "The design we’ve gone for aligns with other government designs along with using design patterns approved by GDS (the Government Digital Service) – the Cabinet Office unit tasked with helping people interact with government and to support government to operate more effectively and efficiently."
        },
        {
            "text": "By using the GDS design patterns, we have drawn on their years of research and expertise to create a simple design that has ease of use at its heart, along with ensuring that it meets the most recent accessibility and user experience standards."
        },
        {
            "text": "I’m proud of the work we’ve completed to make this possible. Our objective is to support the development of a simpler, paperless, transparent and user-friendly process for buying and selling property. This update to the portal, and the move to digital by default, is a major milestone in achieving this objective which we hope will ultimately lead to better services and quicker applications, when combined with the other changes and updates we’re making to our services and processes."
        },
        {
            "text": "We welcome your comments about this blog in the comments below. Please note that we are unable to discuss individual cases through the comments section and would request that all such queries be directed to our Contact Us web form where you will receive a response as soon as possible."
        }
    ]
}