{
    "url": "https://forestrycommission.blog.gov.uk/2022/11/28/what-you-need-to-know-before-applying-for-the-local-authority-treescapes-fund-and-the-urban-tree-challenge-fund/",
    "title": "What you need to know before applying for the Local Authority Treescapes Fund and the Urban Tree Challenge Fund",
    "authors": [
        "Rhiannon Leyden-Preece"
    ],
    "categories": [
        "Tree Planting",
        "Urban trees"
    ],
    "pub_date": "2022-11-28T08:00:41+00:00",
    "content": [
        {
            "text": "The Local Authority Treescapes Fund (LATF) and the Urban Tree Challenge Fund (UTCF) are key components of the Government’s £750m Nature for Climate Fund and provide funding to plant trees outside of woodlands."
        },
        {
            "text": "Trees outside of woodlands are very valuable because they provide such a wide range of benefits, such as:"
        },
        {
            "heading": 2,
            "text": "So, what are the LATF and UTCF?"
        },
        {
            "text": "The LATF offers funding for local authorities to restore tree cover in non-woodland areas which may have been impacted by issues such as disease, habitat degradation or ageing tree stock. The fund is focused on planting and natural colonisation of trees outside of woodlands in urban and rural areas, including parklands, near ponds and rivers, beside roads and footpaths as well as trees in hedgerows and field boundaries."
        },
        {
            "text": "First launched in 2021, it’s great to see that so far 77 projects in England have been successful in securing funding, with over 190,000 trees planted last winter, and nearly 230,000 trees projected for planting this coming winter."
        },
        {
            "text": "The UTCF supports planting of large ‘standard’ trees in urban areas – that make an immediate impact to communities. It is available to anyone who has management control of the land, including local authorities and private landowners, to level up access to nature across the country. Tree planting can take place in urban areas, with higher scores awarded for planting in socially deprived areas with low canopy cover, in proximity to healthcare or educational facilities."
        },
        {
            "text": "First launched in 2019 it has, to date, funded the planting of approximately 160,000 trees, with a further 22,000 projected for planting this coming winter."
        },
        {
            "heading": 2,
            "text": "So, what are the key differences between the funds?"
        },
        {
            "text": "So that you can identify which fund is more appropriate for you and your tree planting project, we’ve put together a table that compares the differences between the two:"
        },
        {
            "heading": 2,
            "text": "What are the key changes to LATF and UTCF from last year?"
        },
        {
            "text": "In previous rounds both funds had application windows but when they reopen they will now be open year-round. In addition to this there have also been individual changes made to them."
        },
        {
            "text": "An exciting development for round 3 of the LATF is that individual applications are now welcomed from Borough, District and City Councils, as well as County Councils, Unitary and Metropolitan Boroughs. Group applications from multiple local authorities within an upper tier local authority area are still strongly encouraged, as partnership working maximises the shared benefits for each partner, and groups will therefore score more highly and will be more likely to receive funding."
        },
        {
            "text": "For UTCF the recipient previously had to provide match funding of 50%, whereas when the it reopens next year, we’ll now pay 80% of standard cost items (such as supply and plant standard tree), meaning recipients will only need to supply 20%. We have also increased the menu of standard cost items to include payment rates for planting in a range of surfaces and undertaking trial pits and removed the older multiple funding thresholds for different sizes of grants (and now only have a minimum application value of £10,000)."
        },
        {
            "heading": 2,
            "text": "Which grant should a local authority apply to for planting different sized trees?"
        },
        {
            "text": "There are different benefits to planting different sizes of tree. Smaller ‘whips’ are much cheaper to buy and maintain, and establish their roots more quickly than larger trees - catching up in size with larger specimens in as little as three to five years. However, whips aren’t suited to all areas: so, you could also think about larger ‘standard’ trees which provide immediate benefits to communities and are more robust against vandalism."
        },
        {
            "text": "The UTCF specifically funds projects planting new, large ‘standard’ trees in urban areas, whilst LATF projects can plant trees of any size – although you need to be aware that, with LATF, ‘standard’ trees in urban areas can only be planted where they are replacing trees that have been lost, for example due to old age or disease."
        },
        {
            "text": "The flowchart and table below outline which fund will support funding for each size of tree in different locations."
        },
        {
            "text": "Whilst both funds support tree planting in urban areas, the LATF also supports the planting of trees outside of woodlands in rural areas, and bids can contain a mix of the above eligible tree sizes in both rural and urban areas."
        },
        {
            "heading": 2,
            "text": "What do we mean by a “replacement urban standard”?"
        },
        {
            "text": "When we talk about “urban”, we are referring to areas that in the ‘UTCF Trees Close to People’ map layer of the Forestry Commission Map Browser. This map layer shows areas with a population of at least >2,000 people buffered to 1km."
        },
        {
            "text": "To show that standard trees are replacements for an LATF application, you must be able to demonstrate that there have been trees lost in the locations you intend to plant urban standards within the last three years, for instance, empty tree pits."
        },
        {
            "heading": 2,
            "text": "What can I do now to get ready to apply?"
        },
        {
            "text": "In order to get ready to apply, there are some steps you can take now to apply for both LATF and UTCF:"
        }
    ]
}