{
    "url": "https://nda.blog.gov.uk/how-much-radioactive-waste-is-there-in-the-uk/",
    "title": "How much radioactive waste is there in the UK?",
    "authors": [
        "James Woodfield"
    ],
    "categories": [
        "Waste management"
    ],
    "pub_date": "2023-01-08T13:00:40+00:00",
    "content": [
        {
            "text": "The UK Radioactive Waste and Materials Inventory (‘the Inventory’) provides detailed information on radioactive wastes and materials in the country."
        },
        {
            "text": "Information collected for the 2022 Inventory is presented in a suite of four reports available on the NDA’s website."
        },
        {
            "text": "The reports, plus much more info on the waste lifecycle and management of waste will also be found on the UK Radioactive Waste  Inventory website."
        },
        {
            "heading": 2,
            "text": "What is the Inventory and why do we have it?"
        },
        {
            "text": "The Inventory is essentially a huge dataset with information about all the radioactive waste and materials that we have in the UK, and that we estimate will arise in future."
        },
        {
            "text": "In addition to nuclear power stations and decommissioning sites, many important medical, industrial, research and defence activities also produce radioactive waste."
        },
        {
            "text": "We need the Inventory to understand how much waste there is and where it is located. We also need to understand what the waste is made from, including its physical, chemical and radiological characteristics. We can then use this information to plan safe and efficient ways to manage the waste and materials."
        },
        {
            "heading": 2,
            "text": "Radioactive waste data in context"
        },
        {
            "text": "More than 94% of all radioactive waste to be produced in the UK will be Low Level Waste (LLW) or Very Low Level Waste (VLLW). This includes both existing waste (called in stock) and waste estimated to arise over the next 100 years or so. Most of this waste will be produced during the dismantling of existing nuclear facilities and the clean-up of sites. LLW is defined as having a radioactive content not exceeding 4 Gigabecquerels per tonne of alpha activity or 12 Gigabecquerels per tonne of beta/gamma activity. VLLW is a sub-category of LLW, it comprises waste that can be safely disposed of with municipal, commercial or industrial waste, or can be disposed of at specified landfill sites (see the Waste Report for more detail)."
        },
        {
            "text": "Less than 6% of all radioactive waste to be produced in the UK will be Intermediate Level Waste (ILW) and less than 0.1% will be High Level Waste (HLW). ILW is defined as wastes exceeding the upper boundaries for LLW, but which do not generate sufficient heat for this to be taken into account in the design of storage or disposal facilities. HLW is waste in which the temperature may rise significantly as a result of radioactivity, so this factor has to be taken into account in the design of storage or disposal facilities."
        },
        {
            "text": "When packaged, the total amount of radioactive waste produced in the UK (including waste in stock and estimated to arise over the next 100-plus years) would fill a volume around 4.5 million cubic metres, roughly the size of Wembley stadium."
        },
        {
            "text": "Although the majority of radioactivity is associated with HLW, this waste category represents a very small volume relative to other categories in the 2022 Inventory. In contrast, very little radioactivity is associated with LLW and VLLW although these waste categories represent most of the waste volume in the 2022 Inventory."
        },
        {
            "heading": 2,
            "text": "Why does the data change? Where can I find out more?"
        },
        {
            "text": "Data about radioactive waste and materials can change due to a range of technical, commercial or policy reasons, such as:"
        },
        {
            "text": "Read more about specific changes in the 2022 UK Inventory compared to the 2019 UK Inventory"
        },
        {
            "heading": 2,
            "text": "So, how accurate is the data?"
        },
        {
            "text": "The inventory is based on the best available information about waste and materials at a specific point in time (the ‘stock date’).  Even so, there are some uncertainties in the data, which we need to carefully consider. The uncertainties may relate to the nature of the waste, how much will arise or when it will arise. Some of the biggest areas of uncertainty are associated with:"
        },
        {
            "text": "Where there are uncertainties, sites and producers use the best available information to make reasonable estimates. They may use data from waste samples, surveys and historical evidence to support their assumptions. The final figures are reviewed internally by the site. They are checked again by the contractor who compiles all UK Inventory data on our behalf. This helps to ensure that the assumptions used are as realistic as possible."
        },
        {
            "heading": 2,
            "text": "How is the UK improving data on radioactive waste and materials?"
        },
        {
            "text": "All waste producers are responsible for managing their own inventory improvement plans. As part of the UK Inventory process, we identify areas where improvements would be most valuable and provide guidance on specific areas where data quality could be improved."
        },
        {
            "text": "In addition to these specific technical improvement plans, an improvement was completed ahead of the data collection for the 2022 Inventory. The project reviewed the method for collecting the information that makes up the UK Inventory and the nature of the data provided. Through the findings of this project changes have been implemented which improve the accuracy and value of this inventory and future inventories."
        },
        {
            "text": "The Inventory project undertaken in collaboration with the National Inventory Forum (NIF), which brings together all of the organisations who manage the waste and materials in the UK inventory."
        }
    ]
}