{
    "url": "https://planninginspectorate.blog.gov.uk/2024/02/05/apprenticeships-how-to-start-one-and-tips-for-success/",
    "title": "Apprenticeships: How to start one and tips for success!",
    "authors": [
        "Sam Pusar"
    ],
    "categories": [
        "apprenticeships",
        "Diversity and Inclusion",
        "Innovation",
        "People"
    ],
    "pub_date": "2024-02-05T16:35:15+00:00",
    "content": [
        {
            "text": "Hello, future apprentices! I'm Sam Pusar, the Apprenticeships and Outreach Officer at The Planning Inspectorate. As we celebrate National Apprenticeship Week from 5 to 11 February 2024, I want to share with you the exciting opportunities that await at The Planning Inspectorate and the immense benefits of undertaking an apprenticeship. "
        },
        {
            "text": "As a former apprentice myself, I can say with confidence that apprenticeships are a fantastic way to gain a professional qualification while continuing to work. They offer a unique blend of theoretical learning and practical experience, allowing you to apply new knowledge and skills in real-time. This combination of earning while learning sets apprenticeships apart from traditional education pathways. "
        },
        {
            "heading": 2,
            "text": "How to start an apprenticeship  "
        },
        {
            "text": "Anyone can complete an apprenticeship, whether you are taking first steps in your career or have lots of experience behind you. "
        },
        {
            "text": "Some apprenticeships require you to have a previous qualification or a certain amount of experience within a role. Before applying, find out what the minimum requirements are and whether an apprenticeship would be the most suitable option for you. The Institute of Apprenticeships website is a great resource for researching and finding apprenticeships. "
        },
        {
            "text": "If you haven’t got a minimum of a grade C/4 in Maths and English GCSE (or equivalent), you will need to complete a functional skills qualification alongside your apprenticeship. \n"
        },
        {
            "heading": 3,
            "text": "Join us: 5 vacancies for a Business Administration apprenticeship! "
        },
        {
            "text": "Are you interested in a Business Administration apprenticeship? We currently have 5 vacancies to work within one of our casework teams while gaining a formal qualification (Level 3 Business Administrator). Apply at Civil Service Jobs by Wednesday 14 February."
        },
        {
            "heading": 2,
            "text": "Tips for success in an apprenticeship "
        },
        {
            "text": "Apprenticeships take commitment, and the more you put in the more you get out. Here are some tips to help you succeed: "
        },
        {
            "heading": 2,
            "text": "Our apprentices’ success stories "
        },
        {
            "text": "Let’s hear directly from our apprentices about their experiences at The Planning Inspectorate: "
        },
        {
            "text": "Harrison, Business Administrator Level 3: "
        },
        {
            "text": "Nick, Chartered Manager (Degree) Level 6:  "
        },
        {
            "text": "Max, Chartered Town Planner Apprentice Level 7:  "
        },
        {
            "text": "Madeleine, Chartered Town Planner Apprentice Level 7:  "
        },
        {
            "text": "Aamina, Chartered Town Planner Apprentice Level 7: "
        },
        {
            "text": "Amy, Senior Leader Level 7:"
        },
        {
            "text": "These are just a few examples of the many success stories at The Planning Inspectorate. The hard work our apprentices have put into their studies, alongside the brilliant support they’ve received by our line managers and colleagues has made our apprenticeship programme something to be truly proud of. "
        },
        {
            "heading": 2,
            "text": "Useful resources: "
        }
    ]
}