{
    "url": "https://defrafarming.blog.gov.uk/2024/02/05/farming-in-protected-landscapes-our-progress-and-a-spotlight-on-the-3000th-project/",
    "title": "Farming in Protected Landscapes: our progress and a spotlight on the 3,000th project",
    "authors": [
        "Mark Ward"
    ],
    "categories": [
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2024-02-05T13:16:58+00:00",
    "content": [
        {
            "text": "I'm pleased to share a Farming in Protected Landscapes (FiPL) milestone: we have funded the 3,000th project through the programme!  "
        },
        {
            "text": "In this post, I'll shine a light on this milestone project, reflect on 2.5 years of FiPL and share details of a new series on the blog.  "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "When the FiPL programme launched in June 2021, it aspired to recognise the unique features of England's protected landscapes by supporting activities that: "
        },
        {
            "text": "3,000 projects later, farmers and land managers working in collaboration with FiPL officers, are fulfilling these aspirations.  "
        },
        {
            "text": "FiPL projects have: "
        },
        {
            "text": "Additionally, FiPL projects have enabled greater public access to green spaces with the creation or improvement of over 90 miles of permissive paths and funded more than 2,000 educational visits and open days.   "
        },
        {
            "text": "The bespoke and flexible nature of projects and dedicated support of FiPL officers has helped empower farmers and land managers to design and develop projects that align with their interests and fit their geographical context.  "
        },
        {
            "text": "This has helped create large demand for FiPL, which was extended with an additional £40 million funding for an additional year until March 2025. "
        },
        {
            "heading": 2,
            "text": "The 3,000th project "
        },
        {
            "text": "The 3,000th project fantastically demonstrates how collaboration between farmers, FiPL advisers and other organisations can achieve a range of brilliant outcomes. "
        },
        {
            "text": "Gam Farm is located just north of the quaint village of Grassington in the Yorkshire Dales. Nestled between rolling moors and framed by dry stone walls, the farm is home to many varieties of rare breeds which include Whitefaced Woodland sheep, Bagot goats and Northern Dairy Shorthorn cattle – some of the rarest native breeds in the UK.  "
        },
        {
            "text": "The farm works with the Rare Breeds Survival Trust to host workshops, open days and demonstrations with the purpose of increasing knowledge and awareness of rare breeds – both amongst farmers and the public alike. The farm also hosts visits through the Open Farm Sunday Initiative. "
        },
        {
            "text": "Farm Manager Helen Wray is using FiPL funding to further her passion: providing more opportunities for the public to access the farm.  "
        },
        {
            "text": "In planning their FiPL project, Gam Farm worked alongside Access the Dales, a non-profit organisation devoted to improving access to the outdoors."
        },
        {
            "text": "With FiPL funding, and with the help of volunteers, the farm is using permeable materials to install a wheelchair access track, an accessible car park, as well as funding a Paratrekker wheelchair for public use.  "
        },
        {
            "text": "To further engage visitors with farming, they are creating and installing educational interpretation panels and signage, including in their farm machinery museum. The programme is also funding 5 educational visits for groups of young people to visit the farm as well as website design and promotional materials to help promote the project to schools.  "
        },
        {
            "text": "Finally, Gam Farm is using FiPL funding to both increase biodiversity connectivity and preserve heritage through the creation of new hedgerows and restoration of dry-stone walls.  "
        },
        {
            "text": "The project should be complete this summer."
        },
        {
            "heading": 2,
            "text": "A new FiPL spotlight series"
        },
        {
            "text": "Hopefully you have enjoyed reading about this project. If you have, I'm pleased to report that there is more to come!  "
        },
        {
            "text": "In a recent post, I shared the results of the FiPL interim evaluation and a reader asked if we could share examples of projects.  "
        },
        {
            "text": "We thought this was a great idea and so we're launching a new spotlight series."
        },
        {
            "text": "Teams from across England will showcase their projects and we'll publish one every month, bringing their brilliant work to life. "
        },
        {
            "text": "Look out for the first spotlight post next month. Subscribe to the Farming blog for an e-mail notification whenever a post is published."
        }
    ]
}