{
    "url": "https://insideDIO.blog.gov.uk/2024/02/05/from-apprentice-to-technical-director-and-an-obe-tom-meadows-career-journey-in-defence/",
    "title": "From apprentice to Technical Director and an OBE: Tom Meadow’s career journey in Defence",
    "authors": [
        "Tom Meadows OBE"
    ],
    "categories": [
        "Apprentices"
    ],
    "pub_date": "2024-02-05T16:10:08+00:00",
    "content": [
        {
            "text": "My name is Tom Meadows and I am Technical Director and Deputy Head at the Security Services Group (SSG). This National Apprenticeship Week, I'm sharing my journey and how I came to be awarded an OBE."
        },
        {
            "text": "I joined Defence as an apprentice Electrical Fitter in August 1974, and I can honestly say I have never looked back."
        },
        {
            "text": "Over the last 50 years, I’ve had a varied career holding most roles within SSG including installation and maintenance of security systems, leading the team that designed the government’s in-house high security intruder alarm system and consulting on integrated security systems including intruder detection systems, perimeter intruder detection systems, CCTV, automated access control systems and physical security measures, among many others!"
        },
        {
            "text": "In December 2016, I was appointed to the role of Head of SSG Technical Solutions, where I led specialist teams delivering high security advice, professional support and quality and compliance services to customers across other government departments, the MOD estate and critical national infrastructure. I was also responsible for research and development, technical support, training and production. After a 6-month period in 2020 caretaking the Head SSG role, I now hold the position of Deputy Head SSG and Technical Director"
        },
        {
            "text": "So far, it’s been an eclectic, challenging and at times both exciting and scary career, one that I hadn’t planned, but as the opportunities arose, I’ve embraced them and been rewarded with promotion, life experience and memories of times shared with equally minded colleagues."
        },
        {
            "heading": 2,
            "text": "Receiving an OBE"
        },
        {
            "text": "I’ve been honoured with an OBE for my services to Defence and I’m extremely proud and humble by the award in recognition of the 50 years I have served.  This is not only an honour for me, but also for SSG and I hope that I have shown everyone the art of the possible and that sometimes our efforts are recognised… not bad for a lad from a council estate in Warrington."
        },
        {
            "text": "The OBE was established by King George V in 1917. The Order of the British Empire originally honoured those who served in a non-combative role and was later expanded to reward contributions from the arts, sciences, charitable work and public service.  This is the second honours list for HM King Charles III since his Coronation in May 2023"
        },
        {
            "heading": 2,
            "text": "Career highlights"
        },
        {
            "text": "I’ve covered countless miles, by aeroplanes, trains and automobiles (not to forget the odd helicopter ride to some dangerous places and also a submarine!), I’ve covered the UK top to bottom and side to side and even underground, seen buildings and establishments that if I were just a member of the general public, would never have seen. I’ve travelled as far as the Falklands, Ascension Island, Cyprus, Kathmandu, Belize, the United States and several European countries."
        },
        {
            "text": "My fondest memories would have to be a flight around Mount Everest and on another occasion, being flown to a facility on a coral island. After undertaking a survey and awaiting the return flight, I swam on a coral reef, walked around the island six inches above an aquamarine sea on white sand through palm trees and huts on stilts – and yes, I really did buy the T-shirt!"
        },
        {
            "text": "So, 50 years and counting. I look back on how fast they have passed and know that I’d do it all again, given the chance. That said, my next big challenge may be sailing off into the sunset on my narrowboat!"
        }
    ]
}