{
    "url": "https://teaching.blog.gov.uk/2024/02/05/inspiring-and-enabling-pupil-and-learner-voice/",
    "title": "Inspiring and enabling pupil and learner voice",
    "authors": [
        "Sue Matthews",
        "Lynn Whitehead-Lewis",
        "Emma Scelsi"
    ],
    "categories": [
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2024-02-05T11:26:41+00:00",
    "content": [
        {
            "text": "This week is Children’s Mental Health Week and the theme this year is ‘My Voice Matters’. Three mental health leads share how their schools are enabling pupil voice within their wider whole school and college approach to mental health and wellbeing."
        },
        {
            "text": "Lynn Whitehead-Lewis, is the mental health lead and school counsellor at Catchgate Primary School, Durham. "
        },
        {
            "text": "We, as adults like to be heard but I am also a firm believer pupils need to be heard to ensure that their wishes, opinions, experiences and interpretations are actively listened to and considered."
        },
        {
            "text": "We were fortunate to be part of Schools North East, Voice of the Pupil Trailblazer Project in 2018. The project developed a framework for engaging children and young people in discussion about mental health, and having their voices heard. As a result, we have seen an increase in pupils asking for help with their mental health. Pupils have also been presenting with growing confidence and self-worth, a clearer sense of purpose, trust, and sense of belonging."
        },
        {
            "text": "There are so many ways that education settings can ensure that children’s voices are heard. We involved them in the development off our wellbeing page, suggestions for the wellbeing display board and developing a Mental Health Anti Stigma campaign, in collaboration with Investing in Children. The training programme is now being delivered in schools across the North East."
        },
        {
            "text": "Putting your approach into practice can feel a little daunting. It doesn’t have to be. As the mental health lead, I also took advantage of the £1,200 grant available from the DfE to fund quality assured senior mental health lead training. After completing the training, I feel we have a stable foundation on which to build a solid and effective platform for our pupil’s voices."
        },
        {
            "text": "We have also put the following into place to enable pupil voices to be heard:"
        },
        {
            "text": "Emma Scelsi is the mental health lead at St Vincent’s School. "
        },
        {
            "text": "In recent years, our approach to promoting mental health has undergone significant transformation. To give our pupils a genuine voice and ensure they feel listened to and understood, we transitioned from traditional paper surveys to an online format, incorporating questions from the Anna Freud Centre's, Me and my feelings questionnaire. This allowed us to engage with our pupils on their mental health needs in a more meaningful way."
        },
        {
            "text": "Another pivotal shift was introducing \"You said, we did\" assemblies to demonstrate to our students that their voices are heard and their concerns matter. For example, pupils expressed concern about rushed lunchtimes, so we've created a dedicated table for those who need more time, with plans to extend the option to eat outside in the summer and we reported this change back to them in assembly. By addressing hygiene issues in the toilets, we're empowering children with gentle reminders and peer support to take better care of shared spaces."
        },
        {
            "text": "Here are some of the further strategies we employ to enable pupil voice beyond the classroom:"
        },
        {
            "text": "Sue Matthews is the mental health lead at Blessed Hugh Faringdon Catholic School and Sixth Form. "
        },
        {
            "text": "We have recently introduced Mental Health Ambassadors who are year 12 pupils, trained by the Education Mental Health Practitioner (EMHPs) in the linked Mental Health Support Team and closely supervised by teaching assistants, who intervene and refer for further support if needed."
        },
        {
            "text": "Once trained, MH Ambassadors work with pupils that need early support, providing a valuable opportunity to speak to a peer about an issue that is troubling them. This provides valuable CPD for staff and the opportunity for older pupils to provide peer support and amplify pupil voice across the school."
        },
        {
            "text": "We also enable pupil voice through a student council that meets once a term with representatives from every year group who gather points from tutor groups to take to the council meeting. A twice-yearly pupil voice survey about all curriculum subjects is also completed in tutor time. The survey helps us understand how pupils feel about their learning in all subjects and what works for them. We feedback to pupils using a “you said this, and we are doing that” approach, which is very important to us."
        },
        {
            "text": "Pupil voice can also inform subtle adjustment to our curriculum approach as it can make the difference between teachers teaching and pupils learning. Building trust and mutual understanding is vital, so feedback from pupils is integral. Where staff need help to build their confidence in this technique, we do whole school training – it an open, interactive approach."
        },
        {
            "text": " "
        },
        {
            "text": "Further information:"
        }
    ]
}