{
    "url": "https://mhclgdigital.blog.gov.uk/2024/02/05/national-apprenticeship-week-my-journey-to-become-a-cyber-security-apprentice-at-dluhc/",
    "title": "National Apprenticeship Week: my journey to become a cyber security apprentice at DLUHC",
    "authors": [
        "Tarun Wagjiani"
    ],
    "categories": [
        "Apprenticeships",
        "Careers",
        "Cyber"
    ],
    "pub_date": "2024-02-05T10:51:38+00:00",
    "content": [
        {
            "text": "Like so many people after completing their A levels, I was encouraged to go to university and get a degree. Also, like so many people, I had no idea what I wanted to study or what career was for me.  "
        },
        {
            "text": "I had A levels in maths, chemistry and history, and chose to study history simply because it was what I had always done well in.  "
        },
        {
            "text": "During my first year of university, however, I made the decision to leave. It was a difficult time. My friends were all over the country and loving university life and I didn’t have a clear idea of what I wanted to do. I did know that I needed to find what I was passionate about.  "
        },
        {
            "text": "To figure this out, I had to get out there and try things. So that’s what I did.  "
        },
        {
            "heading": 2,
            "text": "How I got into cyber security "
        },
        {
            "text": "After a week of work experience at a media company in London with their Cyber Security Incident Response team, I decided cyber security was something I wanted to pursue. "
        },
        {
            "text": "In the last few years, cyber security has grown to become the priority of every big organisation. The sector continues to grow rapidly. "
        },
        {
            "text": "It has become more and more common to hear about big company data breaches in the news, and that’s initially what piqued my interest. "
        },
        {
            "text": "I’ve always been someone who loves to investigate and solve problems. I’ve always been quite tech-savvy and I have the analytical skills to match. "
        },
        {
            "text": "So, after completing a Level 3 Infrastructure Technician qualification, accredited by BCS, in March 2021, I joined DLUHC shortly after, in December 2021, as a Level 4 Cyber Security Technologist apprentice.   "
        },
        {
            "text": "I spent many hours researching exactly what an apprenticeship was and read countless blog posts and articles from previous apprentices. As I had previously learnt at university, it’s best to fully know what you’re getting into before committing yourself! "
        },
        {
            "heading": 2,
            "text": "Hunting threats, preventing attacks and keeping DLUHC resilient"
        },
        {
            "text": "I currently work in the Cyber Security team, specifically the Security Operations Centre (SOC). In an organisation, the SOC monitors people, processes and technology to improve its security posture — its overall cyber security strength and resilience to cyber threats. "
        },
        {
            "text": "It’s better to prevent rather than react. However, the SOC is also responsible for escalating alerts and responding to cyber incidents.  "
        },
        {
            "text": "A typical day in the team is varied. Tasks include managing alert notifications across a number of systems and analysing security incidents with a view to preventing an attack or minimising the impact of an attack.  "
        },
        {
            "text": "Threat hunting is also a big part of my role. This involves proactively seeking out threats within the core IT network, including the use of various threat intelligence sources on threat actors, recent cyber attacks and so on.  "
        },
        {
            "text": "I work collaboratively alongside the wider DLUHC Technology Team and our managed service provider for the SOC.  "
        },
        {
            "heading": 2,
            "text": "What I’ve learnt from the apprenticeship "
        },
        {
            "text": "The cyber security apprenticeship has been a valuable experience for me. It’s provided me with the knowledge to really excel within my role, whilst still being challenged with different types of work projects I would never have been exposed to. It also helped with the transition from classroom to office. The flexibility has been good too. I’m in the office twice a week and work remotely for the rest of the week, and though joining a team can be daunting, I’ve been made to feel very welcome. "
        },
        {
            "text": "It has confirmed that I want to stay in the space and progress into more senior cyber security roles. Now my apprenticeship is at an end, I am looking to complete some vendor-specific qualifications to further develop my knowledge in the field, to then think about specialising in an area of cyber security I am particularly passionate about.   "
        },
        {
            "heading": 2,
            "text": "Considering cyber? "
        },
        {
            "text": "If a career in cyber security interests you, I suggest researching the big apprenticeship training providers to see what apprenticeships they offer. Build a rapport with their recruitment and onboarding teams and you'll always be notified when new vacancies become available. It’s how I secured my first one. My current apprenticeship with DLUHC was advertised on Civil Service Jobs, so do sign up to their alerts too.   "
        },
        {
            "text": "Subscribe to the blog for more stories from the DLUHC Digital team."
        }
    ]
}