{
    "url": "https://insidedvla.blog.gov.uk/2024/02/05/national-apprenticeship-week-at-dvla-growing-talent-and-creating-new-opportunities/",
    "title": "National Apprenticeship Week at DVLA: growing talent and creating new opportunities",
    "authors": [
        "Amy Taaffe-Evans"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2024-02-05T14:00:07+00:00",
    "content": [
        {
            "text": "Today marks the start of National Apprenticeship Week 2024, which recognises the difference made by apprentices across the country. The theme for this year’s campaign is ‘skills for life’, reflecting on how apprenticeships can develop the skills and knowledge required for a rewarding career, while helping employers to develop a workforce with skills for the future."
        },
        {
            "text": "At DVLA, we’re committed to making long-term, consistent investment in our talent pipelines. Within our digital teams, we have a clear vision which sees us established as a Centre of Digital Excellence (CoDE), not just for the services we provide but for our investment in talent, now and for the future. We’ve developed a generational approach to talent attraction based around 4 key pillars…"
        },
        {
            "heading": 2,
            "text": "Inspire, attract, grow and retain"
        },
        {
            "text": "We invest in outreach, typically through local education providers and third sector organisations, to provide everyone with the opportunity to develop digital skills, no matter what their background is. This includes attending careers fairs in the region and engaging with children and young people by showcasing how fun IT and coding can be!"
        },
        {
            "text": "Our outreach programme also delivers familiarisation sessions to signpost prospective students to the apprenticeship opportunities available at DVLA. We aim to attract exciting talent, who may not have had the experience of working within the industry but can bring new and diverse ideas to DVLA."
        },
        {
            "text": "We know that our approach to creating new opportunities and growing our own talent is working, with many learners securing a promotion or permanent position following their development journey. A great example of this is Lewis Jones, who started as an apprentice with us in 2018. He won DfT Apprentice of the Year in his first year and has since achieved 3 promotions to his current role as a Senior Software Engineer."
        },
        {
            "heading": 2,
            "text": "Looking back at our development programmes"
        },
        {
            "text": "Our CoDE Apprenticeship and Development programme continues to go from strength to strength and now covers 13 development programmes with academic qualifications from Level 3 to Level 7. More than 155 individuals have successfully joined DVLA through this route. Last year also saw the launch of our new Digital Academy foundation learning programme - we’ve already seen the first cohort successfully complete the bootcamp before joining their teams this month."
        },
        {
            "text": "As a leading digital and technology employer, we play a critical role in supporting the development of a strong digital skills economy in the region and across Wales. This year, we’re preparing to release several exciting new opportunities, including for members of staff already within the agency."
        },
        {
            "heading": 2,
            "text": "New year, new opportunities…"
        },
        {
            "text": "We’re excited to launch our 2024 apprenticeship programme, which continues from our previous successes, as well as introducing new development schemes across several business areas. Software engineering, data engineering, data and reporting, infrastructure engineering, ethical hacking and business analysis are all areas that will have opportunities in the very near future. These ‘earn as you learn’ apprenticeship and development opportunities will sit alongside our Year in Industry programme and wider Digital Academy."
        },
        {
            "text": "Recruitment has opened across a number of Year in Industry placements, and we welcome applicants from a range of backgrounds and experiences. If you have the skills to excel in digital or the experience from other careers, our apprenticeship and Year in Industry programme could be your next career milestone. View our current vacancies, including any development programmes."
        },
        {
            "text": "Read our blog to find out more about the journey and experiences of DVLA’s Year in Industry students and apprentices, who form part of the Centre of Digital Excellence."
        }
    ]
}