{
    "url": "https://educationhub.blog.gov.uk/2024/02/nhs-doctor-apprenticeships-everything-you-need-to-know/",
    "title": "Medical doctor apprenticeships: Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Higher Education"
    ],
    "pub_date": "2024-02-05T09:10:28+00:00",
    "content": [
        {
            "text": "The NHS confirmed pilot funding for a new Medical Doctor Degree Apprenticeship in January 2023."
        },
        {
            "text": "The apprenticeships are also part of the NHS England Long Term Workforce Plan, which will see the biggest expansion of training in its history to help upskill, retain talent and create a healthcare workforce fit for the future."
        },
        {
            "text": "Apprentices will earn a wage while training to nationally recognised standards, and like most degree apprenticeships, they won’t have to pay any tuition fees. The first applications for the small pilot scheme are likely to open in spring, with the aim that the first apprentices start in September 2024."
        },
        {
            "text": "Of course, trainees will need to meet the same high standards as those who do a traditional undergraduate medical degree."
        },
        {
            "text": "They will be required to attend medical school, complete an accredited medical degree like all other medical students, and meet all other criteria to qualify as a doctor as set out by the General Medical Council."
        },
        {
            "text": "This marks an important step in making careers in medicine more accessible, helping to recruit frontline medics into the NHS."
        },
        {
            "text": "Providing an alternative route into medicine will help more people of different backgrounds get into the profession, making the NHS workforce more representative of the local communities it serves."
        },
        {
            "heading": 3,
            "text": "Does this mean school leavers will be able to work as doctors without going to university?"
        },
        {
            "text": "Medical Doctor Degree Apprentices will be required to undertake an approved university medical degree programme as part of their apprenticeship. They will work as an apprentice while studying towards their medical degree."
        },
        {
            "text": "Students who qualify via the traditional medical school route don't receive a salary until after they have completed their degree."
        },
        {
            "text": "However, this doesn’t mean apprentices will be treated as qualified doctors from the beginning. They will work safely under supervision at an appropriate level that is suitable to their stage of training."
        },
        {
            "heading": 3,
            "text": "Will doctors who study an apprenticeship be less qualified than someone who went to university?"
        },
        {
            "text": "People who complete the Medical Doctor Degree Apprenticeship will have the same academic qualifications as those who complete their degree through medical school."
        },
        {
            "text": "There will also be options for graduates with non-medical degrees. Individual employers will set applicant criteria themselves, which will ensure that applicants possess the values and behaviours to become a medical doctor."
        },
        {
            "text": "The apprenticeship will typically last five years and apprentices will have to complete all academic elements of medical training, including a medical degree and the Medical Licensing Assessment."
        },
        {
            "text": "They will also have to meet all requirements set out by the General Medical Council for entry onto the Medical Register."
        },
        {
            "text": "This means that by the end of their training, apprentices will achieve the same high-quality qualifications as someone who has got their medical degree through a traditional route."
        },
        {
            "heading": 3,
            "text": "Will apprenticeships lower standards of the NHS?"
        },
        {
            "text": "Medical Doctor Degree Apprentices will be subject to the same rigorous requirements as doctors with traditional training, and will achieve a medical degree just like a medical student."
        },
        {
            "text": "The apprenticeship will help to build a highly skilled NHS workforce, following on from the nursing and healthcare apprenticeships which already exist."
        },
        {
            "text": "The apprenticeship will also boost the NHS workforce and help it to meet the growing demand for highly trained professionals, allowing it to benefit from a new pool of diverse talent."
        },
        {
            "heading": 3,
            "text": "How can I apply for a doctor apprenticeship?"
        },
        {
            "text": "Start dates are yet to be confirmed and we expect candidates will be able to apply to the pilot scheme from spring, with first candidates to start from September 2024."
        },
        {
            "text": "Those who are interested in applying should periodically check  NHS Jobs  or the government’s  Find an Apprenticeship website for any apprenticeship vacancies."
        }
    ]
}