{
    "url": "https://educationhub.blog.gov.uk/2024/02/05/supporting-children-and-young-people-mental-health/",
    "title": "6 ways we’re supporting children and young people with their mental health",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Mental Health"
    ],
    "pub_date": "2024-02-05T11:57:11+00:00",
    "content": [
        {
            "text": "Schools and colleges play an important role in promoting and supporting the mental health and wellbeing of students through creating safe, calm and supportive learning environments."
        },
        {
            "text": "Student voice is key to schools and colleges having an effective approach to wellbeing and is part of our mental health guidance for schools and colleges."
        },
        {
            "text": "Involving students in decisions that impact them can benefit their mental health and wellbeing by helping them to feel part of the school, college and wider community."
        },
        {
            "text": "Here are 6 ways we’re supporting the mental health of children and young people."
        },
        {
            "heading": 3,
            "text": "1. Grants for Senior Mental Health Leads"
        },
        {
            "text": "We’re supporting schools and colleges to provide learning environments that promote mental wellbeing, identify individuals’ needs and offer appropriate targeted support to children and young people."
        },
        {
            "text": "Over 15,000 schools and colleges have now claimed a grant to train a senior mental health lead, helping them to develop their approach to mental health and wellbeing."
        },
        {
            "text": "Mental health leads and others can access a resource hub and toolkit to provide mental wellbeing support in school or college. This includes resources which support student voice, such as surveys on child wellbeing, guides on how to manage conversations with young people, and training for student wellbeing ambassadors."
        },
        {
            "text": "Schools and colleges that haven’t already done so are encouraged to claim a £1,200 grant to attend DfE quality assured training."
        },
        {
            "text": "Schools or colleges that previously claimed a grant can claim a second grant to train a replacement if the trained mental health lead has now left."
        },
        {
            "text": "You can find out more about who’s eligible and how to apply  here."
        },
        {
            "heading": 3,
            "text": "2. Promoting wellbeing"
        },
        {
            "text": "Building positive wellbeing is just as important as supporting those who are struggling with their mental health."
        },
        {
            "text": "The NHS recommends 5 steps to mental wellbeing, including:"
        },
        {
            "text": "Taking part in enrichment and extracurricular activities is a great way to help build these steps into a child’s life. Schools and other settings have the flexibility to adapt their extracurricular activities to suit their pupils – we encourage them to listen to student voice to ensure they design an enrichment offer which suits them and supports children’s wellbeing."
        },
        {
            "text": "We’re working on a pilot scheme with the Department for Culture, Media and Sport (DCMS) to test a new approach to supporting schools with their enrichment offer, including a strong focus on pupil voice. This aims to help more children to access high quality enrichment activities."
        },
        {
            "text": "We also support a range of initiatives which expand access to extra-curriculars, including working with DCMS to offer the Duke of Edinburgh’s Award to all state secondary schools in England, and supporting DCMS with the National Youth Guarantee, which aims to give young people access to more activities, trips away from home, and volunteering opportunities."
        },
        {
            "text": "In addition, we’ve pledged a total of over £600 million in funding across the next two years for the PE and Sport Premium. Designed to help children get an active start in life, the PE and Sport Premium gives more children access to high quality PE lessons and sporting opportunities, helping children stay physically active."
        },
        {
            "heading": 3,
            "text": "3. Mental Health Support Teams"
        },
        {
            "text": "We’re increasing the number of Mental Health Support Teams (MHSTs). These offer mental health and wellbeing support in schools and colleges, including for common mental wellbeing issues such as anxiety and low mood."
        },
        {
            "text": "They also support schools and colleges to develop their approach to mental health and wellbeing and to liaise with specialist services in the community where needed. We’re rolling out more MHSTs to cover at least 50 percent of pupils and students in England by March 2025."
        },
        {
            "text": "You can find out more about what schools and colleges have to say about being supported by an MHST here."
        },
        {
            "heading": 3,
            "text": "4. Teaching about mental health in schools"
        },
        {
            "text": "We want to support all children and young people to be happy, healthy and safe. This is why, as of September 2020, our Relationships, Sex and Health Education (RSHE) curriculum has a strong focus on mental health and wellbeing."
        },
        {
            "text": "Pupils are taught how to recognise the early signs of mental wellbeing concerns, including common types of mental ill health, such as anxiety and depression, in themselves and others."
        },
        {
            "text": "They are also taught where and how to seek support, including who they can speak to in school if they are worried about their own or someone else’s mental wellbeing or ability to control their emotions, including issues arising online."
        },
        {
            "heading": 3,
            "text": "5. Support for colleges"
        },
        {
            "text": "Senior Mental Health Leads, Mental Health Support Teams and our online resource hub operates across both schools and colleges."
        },
        {
            "text": "We’ve also appointed our first ever FE Student Support Champion, who is working with us to improve colleges' ability to support learners, including with their mental health and wellbeing."
        },
        {
            "heading": 3,
            "text": "6. Help with attendance"
        },
        {
            "text": "We know that some pupils, such as some of those with social, emotional or mental health needs, may face greater barriers to attendance than others."
        },
        {
            "text": "In addition to the existing advice on the holistic approach to promoting wellbeing, funding for training and the roll out of mental health support teams, we have published attendance guidance titled ‘working together to improve school attendance’.  "
        },
        {
            "text": "This aims to ensure all pupils receive the support they need to remove these barriers, including those with mental health and wellbeing related challenges."
        },
        {
            "text": "This makes clear the expectations on schools where a child experiences a mental health issue that is affecting attendance, including that they work with parents and carers at an early stage so that children receive the individual support that they need to keep them coming to school."
        }
    ]
}