{
    "url": "https://nationalscreening.blog.gov.uk/2024/02/05/uk-nsc-explores-potential-developments-in-bowel-cancer-screening/",
    "title": "UK NSC explores potential developments in bowel cancer screening",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-02-05T14:10:21+00:00",
    "content": [
        {
            "text": "Horizon scanning principles underpin the UK National Screening Committee’s (UK NSC’s) evidence review processes and align with the recommendations of the chief medical officers for the UK NSC’s expanded remit. "
        },
        {
            "text": "The committee uses horizon scanning to identify early signs of important developments in research, international policy making and emerging technologies. This helps ensure its screening recommendations are based on the best evidence and that opportunities to improve existing screening programmes are identified early. "
        },
        {
            "text": "The NHS Bowel Cancer Screening Programme has evolved significantly since its rollout across the UK began back in 2006. There are many more potential developments that could transform bowel cancer screening in the years to come, so the UK NSC sought to explore these at a horizon scanning event in Edinburgh. "
        },
        {
            "text": "The event, chaired by the UK NSC Director of Screening, Professor Anne Mackie, featured patient organisations, leading academics, clinicians, public health professionals and screening policy experts. "
        },
        {
            "text": "Topics discussed included risk stratification in screening, novel screening tests and the potential pros and cons of AI (Artificial Intelligence) technologies and interventions to increase screening participation. The presentations can be viewed by clicking on the links in the text below. "
        },
        {
            "text": "Prof Mackie said:"
        },
        {
            "heading": 2,
            "text": "Risk stratification"
        },
        {
            "text": "Professor David Weller, of the University of Edinburgh, set out a vision for the potential future introduction of risk stratification in the bowel cancer screening programme. This would involve using data to divide the eligible screening population into groups based on their risk status to improve health outcomes. This has been proposed as a means of helping to focus more screening effort on those individuals who are most at risk of the condition. "
        },
        {
            "text": "Demonstrating if such a risk-stratified programme would be safe, acceptable, and feasible will require large scale research. To this end, a large multicentre research study, funded by Cancer Research UK, is due to start across the UK in May 2024. Prof Weller explained that this study will set out to predict the long-term impacts of risk-stratified screening on the number and type of cancers detected, and on health inequalities."
        },
        {
            "text": "David Weller- Risk stratification in bowel cancer screening prog"
        },
        {
            "heading": 2,
            "text": "Novel screening tests"
        },
        {
            "text": "Sally Benton, director of the NHS Bowel Cancer Screening South of England Hub, gave delegates a presentation on the evaluation of new non-invasive screening tests for bowel cancer. "
        },
        {
            "text": "She described a rigorous approach, developed by the World Endoscopy Organisation, for evaluating any such emerging tests. This approach, set out in 12 principles, would help to make sure any approved new test would be flexible, improve test sensitivity, maintain acceptable specificity, and improve detection rates and participation.  "
        },
        {
            "text": "A standardised approach to test validation in screening programmes is also a key workstream of the UK NSC secretariat."
        },
        {
            "text": "Sally Benton -Edinburgh_evaluation of non-invasive screening tests_Jan2024_final"
        },
        {
            "heading": 2,
            "text": "Multi-cancer early detection tests"
        },
        {
            "text": "UK NSC member Prof Bethany Shinkins gave delegates an update on the development of multi-cancer early detection tests (MCEDs) and their potential future use in bowel cancer screening. "
        },
        {
            "text": "Prof Shinkins, Professor of Health Economics, Diagnosis and Screening at the University of Warwick, summarised the findings of completed prospective research studies into the effectiveness of MCEDS. She also updated delegates on the aims and scope of several large ongoing prospective studies, but stressed that current evidence does not support the use of MCEDs in population screening for bowel cancer."
        },
        {
            "text": "Beth Shinkins MCEDS in bowel screening"
        },
        {
            "heading": 2,
            "text": "Targeted screening for Lynch syndrome"
        },
        {
            "text": "Gerrard McMahon, Bowel Cancer UK’s Head of Policy & Influencing (Devolved Nations), set out the case for introducing a targeted screening programme for Lynch syndrome. "
        },
        {
            "text": "Lynch syndrome is a genetic condition which can increase the risk of developing bowel cancer by up to 80% as well as increasing the risk of other cancers​. An estimated 175,000 to 200,000 people in the UK are unaware they have Lynch syndrome. "
        },
        {
            "text": "Bowel Cancer UK is proposing a targeted screening programme for the diagnosis, management and support of people affected by Lynch syndrome. This would involve screening people who test positive for bowel cancer and others who are diagnosed with Lynch syndrome, as well as offering cascade testing to their family members.​ "
        },
        {
            "text": "Such a targeted programme, which was proposed in the 2022 UK NSC annual call for topics, would aim to identify people with the condition and improve outcomes by preventing associated cancers, increasing early diagnosis and through appropriate surveillance."
        },
        {
            "text": "Bowel Cancer UK - Lynch Syndrome and Cascade Screening"
        },
        {
            "heading": 2,
            "text": "Future research needs and innovation"
        },
        {
            "text": "Sian Taylor-Phillips, Chair of the UK NSC Research Methodology Group and Kevin Dunbar, Deputy Director of Public Health in the Vaccination and Screening Directorate of  NHS England, led an interactive session to get delegates’ views on which clinical and technical innovations should be prioritised in bowel cancer screening. "
        },
        {
            "text": "Delegates ranked their priorities on innovations ranging from risk stratification strategies to optimising AI in the bowel cancer screening programme and provided feedback on the many challenges that would be involved in introducing each of them."
        },
        {
            "heading": 2,
            "text": "Screening thresholds based on sex"
        },
        {
            "text": "Gavin Clark, Principal Information Analyst at Public Health Scotland, presented data indicating that the bowel cancer screening faecal immunochemical test (FIT) is a less sensitive test for women than for men."
        },
        {
            "text": "This suggests that different referral thresholds could be set for the 2 sexes in order to increase the cancer detection rate in women. However, this could also lead to more colonoscopies, false positive results and complications."
        },
        {
            "text": "Gavin Clark - Fit Thresholds based on sex"
        },
        {
            "heading": 2,
            "text": "Testing low-cost interventions to increase participation"
        },
        {
            "text": "Katie Robb, Professor of Behavioural Science and Health at the University of Glasgow, presented the findings of the TEMPO randomised controlled trial into low cost behavioural interventions​ aimed at increasing screening uptake."
        },
        {
            "text": "This trial found that adding a simple suggested 2-week deadline for the return of FIT kits to screening invitation letters could increase participation by 1.9%. If this was extrapolated across the UK, it could save an estimated 268 lives per year."
        },
        {
            "text": "Katie Robb - Bowel horizon scanning_Jan2024_tempo"
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "We will aim to run more horizon-scanning events such as this and last year’s multi-cancer early detection tests information-sharing day. In addition, the committee will meet with clinical, user and expert stakeholders and continue to scan online to ensure we stay up to speed with developments. "
        },
        {
            "text": "It is important for the UK NSC to keep the research and innovation sectors up to date with screening programme challenges so that developers of screening tests and technologies understand how they can help. We will use this blog to keep the academic world and industry informed.  "
        },
        {
            "text": "Individuals and organisations are reminded they can submit proposals for screening programme modifications to the UK NSC via the annual call for topics process. Researchers can also submit requests for advice on screening study proposals to the UK NSC’s Research and Methodology Group. "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}