{
    "url": "https://insidehmcts.blog.gov.uk/2024/02/05/update-on-the-implementation-of-automated-track-case-management/",
    "title": "Update on the implementation of Automated Track Case Management",
    "authors": [
        "Daniel Flury"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Digital services"
    ],
    "pub_date": "2024-02-05T14:00:06+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "I’m Daniel Flury, Crime Programme Director and I’d like to share an update on the implementation of Automated Track Case Management (ATCM) – one of the digital services that underpins the Single Justice Service (SJS)."
        },
        {
            "heading": 2,
            "text": "What is Automated Track Case Management? "
        },
        {
            "text": "ATCM is our end-to-end digital service that processes SJS work."
        },
        {
            "text": "ATCM enables prosecutors, like the DVLA and TV Licensing, to directly upload their Single Justice Procedure (SJP) cases digitally. It allows defendants to enter a plea online along with any supporting details or ‘mitigation’. It provides an interface for legal advisors and magistrates to access and record decisions, notify parties of decisions, and generate orders and notices."
        },
        {
            "text": "Each user can access and see information that is relevant to them and their role, which means very large volumes of paper do not need to be moved around the justice system and the need for manual data entry is significantly reduced. Lists are published online for public scrutiny. The media also have access to lists (before hearings) and court records (after hearings), so that they can scrutinise SJS cases and their outcomes."
        },
        {
            "text": "Since 1 April 2019 we have received over 3 million SJS cases and over 700,000 of these have been on ATCM. We expect this number to grow as more prosecutors start to use the system."
        },
        {
            "text": "My colleague Sian Jones from our Legal Operations team wrote an excellent blog post which explained in detail about SJP in the magistrates’ court."
        },
        {
            "heading": 2,
            "text": "Direct access for magistrates"
        },
        {
            "text": "Following a successful pilot, magistrates who have completed the relevant training are able to enter and submit the results of SJP cases directly onto ATCM"
        },
        {
            "text": "They have direct access, using ATCM, to record their own decisions without needing to wait for them to be entered by a court official. However, they are still advised and supported by a qualified legal professional."
        },
        {
            "text": "Moving to this new way of working will gradually increase the number of cases which can be dealt with during each session."
        },
        {
            "text": "It also means that legal advisers have the capacity to deal with other responsibilities when their support is not required by magistrates – although supporting magistrates is their primary focus."
        },
        {
            "text": "The rest of the process, and the way in which magistrates make decisions about remains unchanged. You can read more about this in the news story we published online back in October 2023."
        },
        {
            "heading": 2,
            "text": "Digital systems, better data"
        },
        {
            "text": "As well as the environmental benefit of reducing the amount of paper we use and its transportation, another benefit of a digital system is that we can review data more easily, spot any problems swiftly, and fix them quickly."
        },
        {
            "text": "We had reason to do this at the end of last year. A colleague noticed that ‘financial means’ information was not showing as it should for magistrates online. We investigated and identified the issue – looking back we could see it had started on 27 November 2023 and we fixed it on 21 December 2023."
        },
        {
            "text": "When defendants enter a guilty plea, they’re also asked to provide information about their financial means (their income and outgoings) so that magistrates can factor this into any fine they might issue. It’s the same process for pleas made in person, by letter or online. In this instance the information showed on the screens used by legal advisors, but not on all the screens where it should also have for magistrates."
        },
        {
            "text": "While the cause of the issue was new to us, the impact is something that could happen as part of postal pleas process too, where supporting information does not arrive in time for a hearing. But this time, with a digital system, we were in a better place to fix the issue."
        },
        {
            "text": "We reviewed all 18,793 ATCM cases heard during the period, that could have been impacted by the issue and identified a total of just 19 (or 0.1%) that needed reopening for judicial reconsideration. When errors like this happen on paper or on our online systems, they can only be corrected by a judicial office holder. So, it’s standard practice to reopen a case, have it reconsidered and relisted if necessary. We wrote to the 19 defendants to apologise and explain the action we were taking."
        },
        {
            "text": "I’m pleased to say that ATCM is now working as it should. We’ve introduced additional system checks but we will continue to monitor it and respond to user feedback to ensure that all users can have confidence in it."
        },
        {
            "text": "As with all magistrates’ court decisions, if a user thinks the decision was wrong - for example if there was a mistake or they do not think the court followed the right steps - they can always ask the court to reconsider a sentence or conviction."
        },
        {
            "heading": 2,
            "text": "Next steps for ATCM"
        },
        {
            "text": "A limited number of police forces currently use ATCM to prosecute cases such as traffic offences for speeding and no insurance. Even so, over 25,000 police cases have been disposed of using ATCM to date. After we complete the onboarding of several other police forces, we’ll conduct a comprehensive evaluation on whether the approach is sustainable and appropriate and allows more time for more serious offences to be heard in-person, in magistrates’ courts. But also, we need to be sure that police forces are ready for such a change."
        },
        {
            "text": "Later this year, we’ll engage with organisations such as the Environment Agency, the Driver and Vehicle Standards Agency, train and tram companies and local authorities. They are all non-police prosecutors, and we want to understand their requirements and on using ATCM."
        },
        {
            "text": "Adding cases to ATCM provides the media, with the opportunity for greater scrutiny which can then be shared with the public for their awareness – upholding the principle of open justice. The system of holding hearings in open court relied upon someone being present in the courtroom to listen to proceedings. ATCM enables journalists to look in detail at cases wherever they were dealt with, and without having to travel to a court. We hope that over time, all SJP cases will be available to view through ATCM."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Diweddariad ar weithrediad Trac Awtomataidd ar gyfer Rheoli Achosion"
        },
        {
            "text": "Daniel Flury ydw i, Cyfarwyddwr y Rhaglen Drosedd a hoffwn rannu’r wybodaeth ddiweddaraf am weithrediad Trac Awtomataidd ar gyfer Rheoli Achosion (ATCM) – un o’r gwasanaethau digidol sy’n sail i’r Gwasanaeth Un Ynad (SJS)."
        },
        {
            "heading": 2,
            "text": "Beth yw Trac Awtomataidd ar gyfer Rheoli Achosion?"
        },
        {
            "text": "ATCM yw ein gwasanaeth digidol o’r dechrau i’r diwedd sy'n prosesu gwaith SJS."
        },
        {
            "text": "Mae ATCM yn galluogi erlynwyr, fel y DVLA a Trwyddedu Teledu, i lanlwytho eu hachosion Gweithdrefn Un Ynad (SJP) yn ddigidol yn uniongyrchol. Mae’n caniatáu i ddiffynyddion gofnodi ple ar-lein ynghyd ag unrhyw fanylion ategol neu ‘liniariad’. Mae’n darparu rhyngwyneb ar gyfer cynghorwyr cyfreithiol ac ynadon i gael mynediad at benderfyniadau a’u cofnodi, hysbysu partïon o benderfyniadau, a chynhyrchu gorchmynion a hysbysiadau."
        },
        {
            "text": "Gall pob defnyddiwr gael mynediad at, a gweld gwybodaeth, sy'n berthnasol iddyn nhw a'u rôl, sy'n golygu nad oes angen symud llawer iawn o bapur o gwmpas y system gyfiawnder ac mae'r angen i fewnbynnu data â llaw yn cael ei leihau'n sylweddol. Cyhoeddir rhestrau ar-lein i'r cyhoedd graffu arnynt. Mae gan y cyfryngau hefyd fynediad at restrau (cyn gwrandawiadau) a chofnodion llys (ar ôl gwrandawiadau), fel y gallant graffu ar achosion SJS a'u canlyniadau."
        },
        {
            "text": "Ers 1 Ebrill 2019 rydym wedi derbyn dros 3 miliwn o achosion SJS ac mae dros 700,000 o’r rhain wedi bod ar ATCM. Disgwyliwn i'r nifer hwn dyfu wrth i fwy o erlynwyr ddechrau defnyddio'r system."
        },
        {
            "text": "Ysgrifennodd fy nghydweithiwr Sian Jones o’n tîm Gweithrediadau Cyfreithiol bostiad blog ardderchog a oedd yn esbonio SJP yn y llys ynadon yn fanwl."
        },
        {
            "heading": 2,
            "text": "Mynediad uniongyrchol i ynadon"
        },
        {
            "text": "Yn dilyn cynllun peilot llwyddiannus, gall ynadon sydd wedi cwblhau’r hyfforddiant perthnasol gofrestru a chyflwyno canlyniadau achosion SJP yn uniongyrchol i ATCM"
        },
        {
            "text": "Mae ganddynt fynediad uniongyrchol, gan ddefnyddio ATCM, i gofnodi eu penderfyniadau eu hunain heb fod angen aros iddynt gael eu cofnodi gan swyddog llys. Fodd bynnag, maent yn dal i gael eu cynghori a'u cefnogi gan weithiwr cyfreithiol proffesiynol cymwys."
        },
        {
            "text": "Bydd symud i'r ffordd newydd hon o weithio yn cynyddu nifer yr achosion y gellir delio â nhw yn ystod pob sesiwn yn raddol."
        },
        {
            "text": "Mae hefyd yn golygu bod gan gynghorwyr cyfreithiol y gallu i ymdrin â chyfrifoldebau eraill pan nad oes angen eu cymorth gan ynadon – er mai cefnogi ynadon yw eu prif ffocws."
        },
        {
            "text": "Mae gweddill y broses, a’r ffordd y mae ynadon yn gwneud penderfyniadau yn parhau heb newid. Gallwch ddarllen mwy am hyn yn y stori newyddion a gyhoeddwyd gennym ar-lein yn ôl ym mis Hydref 2023."
        },
        {
            "heading": 2,
            "text": "Systemau digidol, gwell data"
        },
        {
            "text": "Yn ogystal â’r budd amgylcheddol o leihau faint o bapur a ddefnyddiwn a’i gludo, mantais arall o system ddigidol yw y gallwn adolygu data’n haws, canfod unrhyw broblemau’n gyflym, a’u datrys yn gyflym."
        },
        {
            "text": "Roedd gennym reswm i wneud hyn ddiwedd y flwyddyn ddiwethaf. Sylwodd cydweithiwr nad oedd gwybodaeth ‘modd ariannol’ yn ymddangos fel y dylai ar-lein ar gyfer ynadon. Fe wnaethom ymchwilio i’r mater a’i nodi – wrth edrych yn ôl gallem weld ei fod wedi dechrau ar 27 Tachwedd 2023 ac fe wnaethom ei ddatrys ar 21 Rhagfyr 2023."
        },
        {
            "text": "Pan fydd diffynyddion yn pledio’n euog, gofynnir iddynt hefyd ddarparu gwybodaeth am eu modd ariannol (eu hincwm a’u gwariant) fel y gall ynadon gynnwys hyn mewn unrhyw ddirwy y gallent ei godi. Dyma’r un broses ar gyfer pledion a wneir wyneb yn wyneb, trwy lythyr neu ar-lein. Yn yr achos hwn roedd yr wybodaeth yn ymddangos ar y sgriniau a ddefnyddir gan gynghorwyr cyfreithiol, ond nid ar yr holl sgriniau lle dylai fod yn gwneud ar gyfer ynadon hefyd."
        },
        {
            "text": "Er bod achos y mater yn newydd i ni, gallai’r effaith fod yn rhywbeth a allai ddigwydd fel rhan o'r broses pledion trwy’r post hefyd, lle nad yw gwybodaeth ategol yn cyrraedd mewn pryd ar gyfer gwrandawiad. Ond y tro hwn, gyda system ddigidol, roeddem mewn lle gwell i ddatrys y mater."
        },
        {
            "text": "Fe wnaethom adolygu pob un o’r 18,793 o achosion ATCM a wrandawyd yn ystod y cyfnod, y gallai’r mater fod wedi effeithio arnynt a nodi cyfanswm o 19 yn unig (neu 0.1%) yr oedd angen eu hailagor ar gyfer ailystyriaeth farnwrol. Pan fydd gwallau fel hyn yn digwydd ar bapur neu ar ein systemau ar-lein, dim ond deiliad swyddfa farnwrol all eu cywiro. Felly, mae'n arfer safonol i ailagor achos, ei ailystyried a'i ail-restru os oes angen. Gwnaethom ysgrifennu at y 19 o ddiffynyddion i ymddiheuro ac i egluro'r camau yr oeddem yn eu cymryd."
        },
        {
            "text": "Rwy’n falch o ddweud bod ATCM bellach yn gweithio fel y dylai. Rydym wedi cyflwyno gwiriadau system ychwanegol ond byddwn yn parhau i’w fonitro ac ymateb i adborth defnyddwyr i sicrhau y gall pob defnyddiwr fod yn hyderus ynddo."
        },
        {
            "text": "Fel gyda phob penderfyniad llys ynadon, os yw defnyddiwr yn meddwl bod y penderfyniad yn anghywir – er enghraifft os bu camgymeriad neu os nad yw’n meddwl bod y llys wedi dilyn y camau cywir – gallant wastad ofyn i’r llys ailystyried dedfryd neu euogfarn."
        },
        {
            "heading": 2,
            "text": "Y camau nesaf ar gyfer ATCM"
        },
        {
            "text": "Mae nifer cyfyngedig o heddluoedd ar hyn o bryd yn defnyddio ATCM i erlyn achosion fel troseddau traffig am oryrru a dim yswiriant. Serch hynny, mae dros 25,000 o achosion heddlu wedi cael eu datrys gan ddefnyddio ATCM hyd yma. Ar ôl i ni gwblhau’r broses o gynefino nifer o heddluoedd eraill, byddwn yn cynnal gwerthusiad cynhwysfawr i weld a yw’r dull yn gynaliadwy ac yn briodol ac yn caniatáu mwy o amser i droseddau mwy difrifol gael eu clywed wyneb yn wyneb, mewn llysoedd ynadon. Ond hefyd, mae angen inni fod yn siŵr bod heddluoedd yn barod ar gyfer newid o’r fath."
        },
        {
            "text": "Yn ddiweddarach eleni, byddwn yn ymgysylltu â sefydliadau fel Asiantaeth yr Amgylchedd, yr Asiantaeth Safonau Gyrwyr a Cherbydau, cwmnïau trenau a thramiau ac awdurdodau lleol. Maent i gyd yn erlynwyr nad ydynt yn heddlu, ac rydym am ddeall eu gofynion wrth ddefnyddio ATCM."
        },
        {
            "text": "Mae ychwanegu achosion i ATCM yn rhoi’r cyfle i’r cyfryngau graffu’n well y gellir wedyn ei rannu â’r cyhoedd er mwyn sicrhau ymwybyddiaeth – gan gynnal yr egwyddor o gyfiawnder agored. Roedd y system o gynnal gwrandawiadau mewn llys agored yn dibynnu ar rywun yn bresennol yn ystafell y llys i wrando ar achosion. Mae ATCM yn galluogi newyddiadurwyr i edrych yn fanwl ar achosion lle bynnag yr ymdriniwyd â nhw, a heb orfod teithio i lys. Gobeithiwn, dros amser, y bydd holl achosion SJP ar gael i'w gweld trwy ATCM."
        }
    ]
}