{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2025/12/10/100-days-of-cyber-specialist-operations-command/",
    "title": "100 Days of Cyber & Specialist Operations Command",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-12-10T16:01:55+00:00",
    "content": [
        {
            "text": "On 1 September, Cyber & Specialist Operations Command (CSOC) was officially stood up. It has been an extraordinary 100 days since then, with the transition representing more than just a change of name - it has marked a fundamental evolution in how Defence organises itself to meet the threats of modern warfare."
        },
        {
            "heading": 3,
            "text": "Operational excellence meets strategic transformation"
        },
        {
            "text": "At CSOC we have strengthened our position as a four-star Command alongside the Royal Navy, Army and Royal Air Force, sharpening our focus on our core mission: to generate and operate specialist capabilities, ready to fight across all domains, to make the United Kingdom secure at home and strong abroad."
        },
        {
            "text": "Throughout these 100 days, our 26,000 specialists across 130 sites worldwide have continued to deliver operational effects that matter. Every single day, our cyber warriors have defended critical networks, our intelligence analysts have armed decision-makers with operational advantage, our medical personnel have kept our forces fit to fight, our special forces have operated where others cannot, our educators have prepared the next generation of defence leaders, and our Defence Attachés have strengthened partnerships through the Integrated Global Defence Network."
        },
        {
            "heading": 3,
            "text": "Delivering innovation and operational impact"
        },
        {
            "text": "Across CSOC, our organisations have demonstrated the breadth of our specialist capabilities. "
        },
        {
            "text": "At jHub Med, Project VERITAS has enabled medics to speak directly to patients in their own language through an offline voice-to-voice interpretation app, building trust and improving outcomes. While our Defence Medical Services have introduced the revolutionary Deployed Telemedicine System, enabling remote consultations and treatment delivery across vast distances. "
        },
        {
            "text": "At PJHQ, our teams provided critical oversight and planning for Carrier Strike Group 25 and Operation HIGHMAST. And at the Defence Academy, we welcomed a Ukrainian officer to the Advanced Command and Staff Course - a powerful example of how CSOC advances UK influence and strengthens partnerships with our allies."
        },
        {
            "heading": 3,
            "text": "Building our new identity and operating at the heart of Defence's future"
        },
        {
            "text": "At DSEI London, we showcased our leadership in digital targeting, cyber workforce development, and AI integration, evidencing how we combat cyber and electromagnetic threats on behalf of Defence."
        },
        {
            "text": "Our work on the Digital Targeting Web and the launch of the Defence Cyber and Electromagnetic Force has positioned us at the forefront of the Strategic Defence Review's vision for accelerated warfighting readiness."
        },
        {
            "text": "To strengthen our operational advantage in cyberspace, we welcomed 26 new Cyber Direct Entry Scheme graduates who will now secure defence's networks at Corsham, helping protect critical national infrastructure against cyber-attacks on UK defence. While we announced the expansion of the Digital and Cyber Bursary programme to 500 students, breaking down barriers to cyber careers."
        },
        {
            "text": "We also launched the International Defence esports games with over 40 allied nations to develop cyber skills that are critical for modern warfare through competitive gaming. "
        },
        {
            "heading": 3,
            "text": "Our people"
        },
        {
            "text": "Over the last 100 days, our personnel have demonstrated what \"Always On\" truly means - maintaining operational tempo whilst embracing significant change. "
        },
        {
            "text": "We honoured some of our outstanding personnel at the Commander's Commendations for their exceptional service, dedication, and professionalism, making a lasting impact on the Command; and we thank all of our personnel for the work they do every day and what they have achieved over the last 100 days."
        }
    ]
}