{
    "url": "https://environmentagency.blog.gov.uk/2025/12/10/buncefield-20-years-since-the-incident-that-changed-how-we-regulate/",
    "title": "Buncefield: 20 years since the incident that changed how we regulate ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2025-12-10T10:58:58+00:00",
    "content": [
        {
            "text": "In the early hours of Sunday 11 December 2005, a dense fog formed around the Buncefield fuel depot on the edge of Hemel Hempstead. A large petrol storage tank was overfilling, and vapours spread across and beyond the site. "
        },
        {
            "text": "Then, what has been described as one of the largest explosions and fires in peacetime Europe took place. The event was reported around the world and was heard as far away as the Netherlands. Fires burned for five days, destroying much of the depot, damaging nearby businesses and properties, and injuring more than 40 people. Thankfully, no lives were lost, but many were affected. "
        },
        {
            "text": "With estimated costs exceeding £1 billion, Buncefield remains the UK's most costly industrial accident. In the days that followed, large volumes of fuel, firewater, firefighting foam and contaminated rainwater escaped the site and entered the ground, polluting the underlying groundwater. "
        },
        {
            "text": "Our role in the response "
        },
        {
            "text": "The Environment Agency played a central role in responding to the incident and overseeing the clean-up and long-term remediation. As part of the COMAH (Control of Major Accident Hazards) Competent Authority, we worked closely with the Health and Safety Executive (HSE) to investigate what happened and assess the environmental impact. "
        },
        {
            "text": "Our teams gathered evidence from the site, analysed samples from the surrounding area, and reviewed how the operating companies and their contractors had managed their activities. The investigation uncovered a range of technical and management failings. Five companies were found to have committed offences, resulting in fines and costs of £9.5 million, including £1.3 million in fines for pollution offences. This was a record at the time for a single incident in the UK. "
        },
        {
            "text": "Read the full details here: Buncefield: Why did it happen? "
        },
        {
            "text": "Turning learning into action "
        },
        {
            "text": "Our investigation and enforcement work were only part of our response. In the years that followed, we worked with industry and other regulators to apply the lessons from Buncefield. "
        },
        {
            "text": "We collaborated with HSE, trade associations, professional institutions and standards bodies to publish Safety and Environmental Standards for Fuel Storage Sites. This report set out the learning from the incident and helped raise expectations across the fuel storage sector. "
        },
        {
            "text": "Since then, we have continued to ensure these lessons are part of good industry practice. This work has led to an improvement in safety. In the past 13 years, there has not been a single accident from a COMAH site with serious off-site environmental impacts. "
        },
        {
            "text": "Continuing work at Buncefield "
        },
        {
            "text": "Our work at Buncefield continues. We have worked with the site operators to make sure the standards recommended after the incident, known as the Process Safety Leadership Group (PSLG) guidance, have been implemented. "
        },
        {
            "text": "A long-term plan for soil and groundwater remediation was put in place, including pump and treat systems and activated carbon beds to remove pollutants such as fuel and firefighting foam. Contaminated soils and damaged structures were also removed and disposed of. "
        },
        {
            "text": "The operator continues to monitor the groundwater to help us understand and manage any long-term impacts. The cost of the clean-up and remediation work has run into the tens of millions. "
        },
        {
            "text": "There have been known challenges in managing Per- and polyfluoroalkyl substances (PFAS) contamination, as large amounts of firefighting foam were used at the time, which helped contain the fire. As our understanding of PFAS evolves, we continue to monitor and manage this issue in line with the latest known best practices and the Environment Agency and HSE are currently working on a proposal to restrict the use of PFAS in firefighting foams under UK REACH legislation. "
        },
        {
            "text": "In the next blog, we will share personal stories from Environment Agency staff who were part of the response and recovery. They reflect on the scale of the challenge and what it meant to be involved in one of the UK’s largest industrial incident responses. "
        },
        {
            "text": "Our Chief Regulator Director, Jo Nettleton, will also share her perspective on Buncefield’s lasting influence on environmental regulation and how it continues to shape our work today. "
        }
    ]
}