{
    "url": "https://defrafarming.blog.gov.uk/2025/12/10/combinable-crop-contracts-have-your-say/",
    "title": "Combinable crop contracts: have your say",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Supply chain",
        "Ways to get involved"
    ],
    "pub_date": "2025-12-10T09:49:04+00:00",
    "content": [
        {
            "text": "From the food on our plates to fuel in our tanks, combinable crops (crops that are cut using a combine harvester) are part of all our lives.  "
        },
        {
            "text": "That is why we have opened a public consultation to hear views on how contracts operate across the combinable crops sector."
        },
        {
            "text": "Improving fairness across the supply chain is a government priority, and a stronger, more transparent system is essential to long-term food security.  "
        },
        {
            "text": "The consultation is one step towards improving how farmers are treated when selling crops such as wheat, barley, oats and oilseed rape. In this post, we share the background and a link to the consultation.  "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "After one of the most difficult harvests in years, with rising costs, unpredictable markets, challenging weather and tighter margins, concerns about how contracts work have grown."
        },
        {
            "text": "Many producers report that current arrangements leave them exposed to risk with little negotiating power. "
        },
        {
            "text": "The Contractual practice in the UK combinable crops sector consultation seeks views on how contracts operate and whether they are fair. In particular, the consultation asks farmers, traders and processors about: "
        },
        {
            "text": "Feedback will help shape proposals for clearer contracts and fairer treatment for producers. The aim is to ensure farmers receive a transparent price for their produce and understand how that price is set. "
        },
        {
            "text": "This consultation is an opportunity to share experiences and evidence. "
        },
        {
            "heading": 2,
            "text": "Respond to the consultation"
        },
        {
            "text": "Contractual practice in the UK combinable crops sector "
        },
        {
            "text": "The consultation is public and open to all, but if you work in the arable supply chain, your voice is especially important. Please share it with: "
        },
        {
            "heading": 2,
            "text": "Towards a fairer supply chain"
        },
        {
            "text": "The Agriculture Act 2020 gave government new powers to intervene in cases where farmers are treated unfairly by buyers.  "
        },
        {
            "text": "Those powers have already been used to try to improve contracts in the dairy and pig sectors, with new rules introduced to protect producers and promote transparency."
        },
        {
            "text": "For example, in August, the Fair Dealing Obligations (Pigs) Regulations 2025 came into force, meaning pig farmers now have better protection against unfair contract terms. "
        },
        {
            "text": "Additionally, all milk purchase contracts must now meet the requirements of the Fair Dealing Obligations (Milk) Regulations 2024."
        },
        {
            "text": "You can learn more about this by listening to our recent podcast with the Agricultural Supply Chain Adjudicator: Farming podcast: how to build a fairer, more transparent supply chain.  "
        },
        {
            "text": "Eggs and fresh produce are currently under review. "
        },
        {
            "text": "The Contractual practice in the UK combinable crops sector consultation complements wider work to protect farmers in trade deals, strengthen supply chain resilience, lower costs for consumers, and deliver a thriving, innovative food sector through the Good Food Cycle. "
        },
        {
            "text": "We’ll update you with our progress. "
        },
        {
            "text": "Subscribe to the Farming blog for the latest updates from Defra’s Farming and Countryside Programme. By subscribing, you’ll receive an email notification whenever we publish a new post. "
        }
    ]
}