{
    "url": "https://gds.blog.gov.uk/2025/12/10/designing-public-services-that-work-for-everyone/",
    "title": "Designing public services that work for everyone ",
    "authors": [
        "Alasdair Hewitt, Senior Product Manager, GDS"
    ],
    "categories": [
        "Digital inclusion",
        "Digital, Data and Technology"
    ],
    "pub_date": "2025-12-10T12:55:00+00:00",
    "content": [
        {
            "text": "At the Government Digital Service (GDS), we’ve always been passionate about delivering public services that work for everyone, including people who aren’t confident online or who can’t afford or access the right technology. As part of the services pillar of the Digital Inclusion Action Plan, we’re working to remove barriers to accessing digital services by improving the standards, guidance and tools that help service teams build with inclusion in mind.  "
        },
        {
            "text": "This post shares what we’ve done so far this year, what we’ve learned, who we’ve worked with, and where we’re heading next. This post also highlights how GDS is leading the Services pillar of the Digital Inclusion Action Plan to deliver Point 1 of the blueprint for modern digital government: joining up public services to improve digital access and support the digitally excluded. "
        },
        {
            "heading": 2,
            "text": "What we’re aiming for  "
        },
        {
            "text": "Our Inclusive Services work has three main goals:  "
        },
        {
            "text": "Together, this will help ensure public digital services are designed and built for the full diversity of users across the UK.  "
        },
        {
            "heading": 2,
            "text": "What we’ve done so far  "
        },
        {
            "heading": 3,
            "text": "1. Digital Inclusion Action Plan: "
        },
        {
            "text": "Released in February 2025, the Digital Inclusion Action Plan: First Steps outlines the government’s vision for improving digital inclusion across four pillars: skills, access, services, and trust. GDS leads the services pillar, working to ensure government services are accessible, inclusive, and easy to use. "
        },
        {
            "heading": 3,
            "text": "2. Discovery phase: "
        },
        {
            "text": "To inform our approach, we mapped digital inclusion initiatives in the UK and internationally. We explored what already works, where the gaps are and how others measure success. This helped us understand how services are (or are not) meeting the needs of people who are digitally excluded, and where guidance and best practice could better support teams. "
        },
        {
            "text": "We found that many local authorities and third-sector organisations deliver effective inclusion initiatives, but challenges remain around sustainability, affordability, rural connectivity and long-term impact tracking. International examples, such as Singapore’s community-based hubs, provide useful models of strong leadership and inclusive design. "
        },
        {
            "heading": 3,
            "text": "3. In-depth research sessions: "
        },
        {
            "text": "Building on the discovery work, we carried out a series of in-depth research sessions with government service teams tackling inclusion challenges first hand, from veterans' services to asylum seekers. These honest, reflective conversations showed what it’s like to build for inclusion in practice.  "
        },
        {
            "text": "Some clear themes emerged:  "
        },
        {
            "heading": 3,
            "text": "4. Cross-government workshops: "
        },
        {
            "text": "We also brought together service teams from across government for two workshops. These sessions gave designers, researchers, policy specialists, and others space to share experiences, test ideas, and explore how we can make services more inclusive. Discussions focused on practical topics such as doing inclusive user research, understanding impact and designing effective alternative pathways for those who cannot use digital channels. We’re now analysing the findings to inform the next stage of our work.  "
        },
        {
            "heading": 2,
            "text": "Next steps: "
        },
        {
            "text": "Over the coming months we’ll:  "
        },
        {
            "text": "We’re committed to building services that work for everyone and will continue to share our progress. "
        },
        {
            "heading": 2,
            "text": "Spotlight: support for care leavers: "
        },
        {
            "text": "A great example of creating services that work for everyone comes from the Department for Education (DfE), who launched the Support for Care Leavers website. It brings together advice and support for the 88,000 care leavers in England and those who support them - including local authorities, charities, agencies and individuals. "
        },
        {
            "text": "Key to the design of the service was understanding the needs of diverse user groups. This included young people leaving care, unaccompanied asylum-seeking children, and those in custody. The team also considered the needs of support workers and professionals who help care leavers navigate services. "
        },
        {
            "text": "To ensure the service was inclusive, the team undertook extensive user research. This included: "
        },
        {
            "text": "The team worked closely with gatekeepers and community organisations to build trust and ensure participants felt safe and comfortable. In some cases, this meant offering warm food and peer support in familiar locations to encourage engagement. Research was always voluntary, and participants were given clear information about how their input would shape the service. "
        },
        {
            "text": "This approach led to a thoughtfully designed service that offers real, usable guidance for young people transitioning out of care — and for those supporting them. "
        },
        {
            "text": "If you’d like to learn more about inclusive service design and the government’s approach to digital inclusion: "
        },
        {
            "text": "We’ll keep sharing updates as this work progresses. If you have examples, challenges, or ideas to contribute, join our cross-government Slack community. Alternatively, reach out to us directly or you can contact us via email at service.transformation@dsit.gov.uk. Together, we can make services that work for everyone."
        }
    ]
}