{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/10/understanding-residents-experiences-of-housing-safety-and-quality/",
    "title": "Understanding residents' experiences of housing safety and quality",
    "authors": [
        "System Design Team"
    ],
    "categories": [
        "Design",
        "System Design"
    ],
    "pub_date": "2025-12-10T10:55:58+00:00",
    "content": [
        {
            "text": "The System Design team at the Ministry of Housing Communities and Local Government (MHCLG) includes designers, researchers and analysts. We bring user-centred design and systems thinking skills to complex building safety challenges. We work with policy teams on a range of projects, applying strategic systems thinking.  "
        },
        {
            "text": "Earlier this year, we completed a project to understand the housing safety and quality system and provide a shared view of that complex system to better inform policy development and decision making. You can see the outputs of this work in our most recent blog post. This work highlighted knowledge gaps and laid the foundations for our next project. "
        },
        {
            "heading": 2,
            "text": "The ask  "
        },
        {
            "text": "In June, we supported the development of policy thinking about the future of how the built environment is regulated. This was informed by the recommendations set out in the Grenfell Tower Inquiry’s Phase 2 Report. We  were asked to build evidence for what residents might need from a new regulator.  "
        },
        {
            "text": "We did in-depth qualitative user research to understand residents' experiences and needs around housing safety, quality and its regulation. The research looked at how residents access support and view the role of regulators, how much trust they have in the system and the role consumer power plays in how they make decisions. You can read the full report from this research in our GitHub repository. "
        },
        {
            "text": "Housing is a fundamental need. It affects everything – from education and work to relationships and community life. When housing is unsafe or poor quality, it can seriously harm people’s lives. Maslow’s hierarchy of needs is a simple model explaining what people generally need to live well and feel fulfilled. It illustrates how important it is to have basic needs met.   "
        },
        {
            "heading": 2,
            "text": "Where we started  "
        },
        {
            "text": "Before starting user research with residents, we reviewed what we already knew. That involved secondary research, stakeholder interviews, and conversations with internal policy teams. "
        },
        {
            "text": "Then we did 40 in-depth user research interviews. We spoke to residents across England, from different backgrounds and housing situations. In each session, we asked questions about housing safety, quality and what residents  expect when asking for help. "
        },
        {
            "heading": 2,
            "text": "What we learnt "
        },
        {
            "text": "Residents think about safety and quality in many ways. From how secure they feel to the materials used in their homes. But they don’t always feel confident prioritising or assessing these things when choosing a place to live. "
        },
        {
            "text": "How residents raise issues depends on their housing type, how confident they feel and their socio-economic background. But many face the same problem: it’s hard to find someone who’s responsible and willing to help. Most people  don’t escalate problems beyond their landlord or housing provider. This is  often because they’ve had bad experiences in the past or don’t know how to get help. "
        },
        {
            "text": "Residents in unstable housing, with a disability or who speak English as a second language face even more barriers. Many don’t believe they’ll be listened to or that anything will change. "
        },
        {
            "heading": 3,
            "text": "Trust is fragile "
        },
        {
            "text": "Trust in housing is easily broken – and hard to rebuild. Many residents told us they don’t trust people involved in housing. This included government bodies,  and ranged from landlords to contractors because of past failures and poor experiences. "
        },
        {
            "text": "We found that, to rebuild trust in an organisation, two types of trust are  needed: "
        },
        {
            "text": "Residents’ faith in those responsible for safety and quality of their homes is  currently low due to poor experiences and past failings. Residents feel that  many organisations put profit over quality and safety, and that little is done to hold bad actors to account.  "
        },
        {
            "text": "Residents expect regulators to make sure safety and quality standards are met and to hold others to account. But they need to see evidence that  regulators are doing this. "
        },
        {
            "text": "It is possible to build trust within the housing system. Community groups and Citizens Advice were often mentioned as trusted organisations. Residents trust these organisations because they put residents’ wellbeing first and  follow through on promises.  "
        },
        {
            "heading": 3,
            "text": "Regulation needs to work for residents "
        },
        {
            "text": "Residents don’t expect to have direct contact with regulators, if others like  landlords or agents are doing their jobs properly. Instead, they expect that  people and processes are regulated so that they work first time. And that if things go wrong, they can be resolved with those responsible. "
        },
        {
            "text": "The research we’ve done is being used to help shape the policies and design of the new regulator being introduced by MHCLG to meet one of the  recommendations set out in the Grenfell Inquiry Phase 2 Report. The Inquiry's   report describes that the recommendation intends to consolidate how the sector is regulated and drive culture change in the industry. Ultimately this will deliver better outcomes for residents.  "
        },
        {
            "text": "MHCLG is clear that the new regulator must protect residents by making sure the buildings residents live in are safe, and the wider housing system must support the regulator to do this.   "
        },
        {
            "heading": 2,
            "text": "Want to learn more or get involved? "
        },
        {
            "text": "If you’d like to learn more about how we are applying system design to building safety challenges, you can access our maps and reports on our GitHub repository. "
        },
        {
            "text": "You can sign up to take part in future user research sessions.  "
        },
        {
            "text": "For more information, contact us at:  SystemDesignTeam@communities.gov.uk."
        }
    ]
}