{
    "url": "https://lifeathmrc.blog.gov.uk/2023/10/16/celebrating-success-joseph-takes-home-apprentice-of-the-year-award/",
    "title": "Celebrating success: Joseph takes home Apprentice of the Year Award",
    "authors": [
        "Joseph"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-10-16T09:34:51+00:00",
    "content": [
        {
            "text": "Joseph is on a mission to inspire. At the Multicultural Apprenticeship Awards hosted in Birmingham on 5 October, the judges were unanimous in naming him Apprentice of the Year 2023, beating more than 140 other nominees.  "
        },
        {
            "text": "We caught up with him to find out more about his apprenticeship, why he received the award and what’s next for him and his career.  "
        },
        {
            "heading": 2,
            "text": "Becoming an apprentice at HMRC "
        },
        {
            "text": "I started my career at 18 when I discovered Civil Service policy apprenticeships while researching online. I opted for an apprenticeship over university and studied to be a Policy Officer in HMRC. "
        },
        {
            "text": "My apprenticeship has allowed me to get involved in some very interesting work and has been a gateway into a world where I can make a real difference. "
        },
        {
            "text": "As a policy adviser, I led the VAT policy input into the Chancellor’s zero-rate for energy materials. I have been involved in Brexit work, and in my new role as a Senior Strategy Adviser I work on shaping the future of HMRC through effective strategies. "
        },
        {
            "text": "In addition, I am the regional lead for the HMRC Stratford Apprenticeship Network where I mentor new apprentices, and champion apprenticeships across HMRC as well as at external events. "
        },
        {
            "text": "I am also Vice-chair of a local school’s governing board. "
        },
        {
            "heading": 2,
            "text": "Apprentice of the Year Award "
        },
        {
            "text": "I was honoured to be nominated for ‘Apprentice of the Year 2023’ at this year’s Multicultural Apprenticeship Awards. "
        },
        {
            "text": "The awards celebrate those working to break down barriers, challenge the norm, and overcome adversity to achieve their goals through apprenticeships. "
        },
        {
            "text": "To attend the event with such an inspirational group of people, and to represent HMRC, was an honour. But to then find out that I had won ‘Apprentice of the Year’ and ‘Accounting and Finance Apprentice of the Year’ for the work I have done, was both amazing and totally surreal. I still can’t believe it! "
        },
        {
            "text": " "
        },
        {
            "text": "Photo credits: Edwin Ladd – Mr Ladd Media.  "
        },
        {
            "heading": 2,
            "text": "What’s next for me? "
        },
        {
            "text": "I want to use this award as a platform and show the value of apprenticeships both for the employer and the apprentice. I am involved in a range of projects to promote apprenticeships, encourage new talent into the Civil Service and use my story to inspire young people to explore alternative routes to a career. "
        },
        {
            "text": "I am on a mission to see more young people in leadership roles, taking their careers into their own hands and using apprenticeships to unlock their potential.  "
        },
        {
            "heading": 2,
            "text": "A career in your hands "
        },
        {
            "text": "At HMRC, we offer a variety of professions and opportunities for you to develop yourself personally and professionally. "
        },
        {
            "text": "Visit HMRC Careers to find out what programmes we have on offer to help you progress in your career. "
        },
        {
            "text": "To discover our current vacancies and to apply, visit Civil Service Jobs. "
        }
    ]
}