{
    "url": "https://ruralpayments.blog.gov.uk/2023/10/16/celebrating-25-years-of-bcms-with-bjorn-andreassen/",
    "title": "Celebrating 25 years of BCMS with Bjorn Andreassen",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "BCMS"
    ],
    "pub_date": "2023-10-16T13:54:47+01:00",
    "content": [
        {
            "text": "It’s 25 years since the formation of the British Cattle Movement Service (BCMS), which is responsible for maintaining the central online database of all bovine animals in Great Britain. This is the Cattle Tracing System (CTS), which animal keepers use to report the births, deaths and movements of their bovine animals. In the fourth of our series of blogs talking to BCMS staff past and present, Bjorn Andreassen talks about his 23 years with BCMS. "
        },
        {
            "text": "Hello, I’m Bjorn and I’m an Operational Delivery Administration Officer with BCMS. I’ve worked for BCMS since May 2000, starting when I was just 21. My primary responsibilities are to adapt to the demands of the department, meet the customer needs and assist management whenever needed in whatever role required."
        },
        {
            "text": "Every bovine animal in the UK has a unique number, shown both on an ear tag in each ear and on a paper cattle passport held by the animal’s keeper. The number and passport remain with the animal throughout its life, and are recorded by the slaughterhouse at its death, allowing traceability of the beef. The tracing system provided by BCMS works alongside the physical passport to record the births, deaths and movements of all cattle. Specifically, I’m responsible for processing the passport applications following a cattle death, and I also action herd register and barcode label requests and oversee the general housekeeping of the department."
        },
        {
            "text": "I’m proud to work for BCMS and feel that my role makes life easier for keepers by helping them to keep their cattle records up-to-date. One of the aspects of my role that I think has the greatest impact is when I help cattle keepers who aren’t computer literate by actioning barcode label requests and sending out herd registers that they struggle to download."
        },
        {
            "text": "I also really enjoy working with people in my department - helping them, supporting them, encouraging them, learning with, and from them, and in doing so being an effective multi-skilled all-round team."
        },
        {
            "text": "I’ve thoroughly enjoyed my 23 years with BCMS and we’ve seen lots of changes in that time. I was very impressed with the way that management and staff alike adapted to working from home during the COVID lockdown era. Management went to great lengths to contact homeworkers to see how they were adapting to working from home - they were absolutely brilliant throughout in checking up on the health and wellbeing of all of us."
        },
        {
            "text": "You will have read in the three previous blogs about BCMS and its 25 year anniversary Celebrating 25 years of the BCMS, Celebrating 25 years of the BCMS with Terry Gadd and Celebrating 25 years of BCMS with Lee McMullen, that the Livestock Information Service (LIS) sheep bureau has moved into RPA and will now manage the movement traceability for sheep, goats, and deer for England, alongside the existing cattle services. This forms part of the wider Livestock Information Transformation Programme, which will replace the existing traceability databases with one multi-species platform."
        },
        {
            "text": "These changes are exciting for BCMS and what excites me personally for the future is that it’s unpredictable. There will always be new work to learn and new challenges to face. There will occasionally be new technology updated within the business and new processes of learning to adapt to."
        },
        {
            "text": "I was born in Workington where BCMS is based and raised just up the coast in Maryport, with a Norwegian father, English mother and five sisters. Away from work, I enjoy browsing HMV for the latest releases, as well as looking for decent, inexpensive places to eat at. I particularly enjoy going to the cinema as I love films and also television – I could give you a list of my all-time favourites, but we’d run out of room……."
        }
    ]
}