{
    "url": "https://traderemedies.blog.gov.uk/2023/10/16/know-your-tariff-getting-to-grips-with-the-different-forms-of-trade-remedy-measures/",
    "title": "Know your tariff: getting to grips with the different forms of trade remedy measures",
    "authors": [
        "Harry Pearson, Economist"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2023-10-16T11:54:02+01:00",
    "content": [
        {
            "text": "At the Trade Remedies Authority, we conduct investigations and recommend  trade remedy measures to counter imports which are causing or threatening injury to domestic industry. These measures can take alternative forms, but ultimately have the same effect of making it more expensive to import certain products. "
        },
        {
            "heading": 2,
            "text": "What are the different forms of trade remedy measures? "
        },
        {
            "text": "There are two primary forms of measure that countries can apply to protect their domestic industries from unfair trading practices: tariffs and Tariff Rate Quotas (TRQs). "
        },
        {
            "text": "Tariffs are essentially taxes imposed on imports on goods, which make them more expensive.  "
        },
        {
            "text": "There are different types of tariffs, also known as import duties:  "
        },
        {
            "text": "In certain cases, the exporters may agree with the investigative authority to not sell below a certain price. This is known as a price undertaking, and it avoids the need for a duty. "
        },
        {
            "text": "Tariff Rate Quotas (TRQs) combine elements of both tariffs and quotas (quantitative restrictions), which limit imports of goods. An example of when the TRA imposed a TRQ was the safeguard measure on steel products. In this instance a TRQ allows domestic industry to adjust to new international market conditions. Here the TRQ is time-limited and progressively liberalised by increasing the quota of the duty-free rate.   "
        },
        {
            "heading": 2,
            "text": "Tariffs "
        },
        {
            "heading": 3,
            "text": "Most common: ad valorem and specific duty"
        },
        {
            "text": "Ad valorem duty: this form of measure is based on a percentage of the value of the goods (for example, 5% of the value of imported steel). This is the most common form of measure implemented by the TRA. "
        },
        {
            "text": "Specific duty: this form of measure is a specific level of duty added on top of the price of the imported product (for example, £5, per tonne of imported steel). It is based on quantity rather than value of imports, and it can be based on any quantifiable unit of measurement (for example, per kilogramme of sugar, per tonne of imported steel, per square meter of ceramics). This duty is more appropriate when the goods come in a form mixed with other products. For instance, at customs it could be hard to determine the value of certain chemicals when they are packed together. It is much easier to apply a duty per weight in this instance. "
        },
        {
            "heading": 3,
            "text": "Ad valorem or specific duty: which works better for the protected industry? "
        },
        {
            "text": "Imagine that because of an unfair trading practice there is an anti-dumping duty that applies to imported steel. Let’s consider an importer who buys a tonne of imported steel from abroad. Initially, the price of imported steel is £100 per tonne but later the price goes up to £150 per tonne.  "
        },
        {
            "text": "An advantage of an ad valorem duty is the measure keeps up with changes in market price. With an ad valorem duty of 20% on imported steel, the initial amount of duty payable is £20.  "
        },
        {
            "text": "If the price of imported steel increased from £100 to £150 per tonne, then the duty payable would increase from £20 to £30. Whether this provides more protection to the domestic industry depends on price changes in exporting countries. "
        },
        {
            "text": "A disadvantage of an ad valorem duty is that it can be hard to determine the correct amount which should be applied based on the value of the imports and domestic prices. A duty based on the value of the good must follow the rules outlined in the World Trade Organisation (WTO) Valuation Agreement. This can be challenging and time consuming because a lot of data and evidence is needed from multiple parties. "
        },
        {
            "text": "Instead of an ad valorem duty, with a specific duty of, say, £20 per tonne of imported steel, there would be no change in the amount of duty payable if prices changed. Therefore, if prices were to increase or decrease, the amount of protection for the domestic industry would not adjust in response to price movements. This would arguably provide more certainty to traders, but could lead to under- or over-protection of domestic industry if prices change significantly.  "
        },
        {
            "text": "Another advantage of a specific duty is that it is easier to administer than an ad valorem duty as you are only concerned with the quantity of the imports and not their current valuation. "
        },
        {
            "text": "However, a specific duty more severely penalises lower grades of an imported commodity. For instance, importers of cheaper grades of imported steel would have to pay the same duty as importers of the more expensive grades. "
        },
        {
            "heading": 3,
            "text": "Other options: compound duty and mixed duty "
        },
        {
            "text": "A combination of ad valorem and specific duty can also be used as a form of measure.  "
        },
        {
            "text": "A compound duty is a combination of a fixed amount based on the quantity of the imported good and an amount based on the value of the imported good: for example, a combination of £50 per tonne of imports (a specific duty component) and 20% of their value (an ad valorem duty component). If the price of imported steel equals £100 per tonne, the importer would have to pay a £70 compound duty per tonne of imported steel. "
        },
        {
            "text": "In contrast to a compound duty where both ad valorem and specific duty apply, for a mixed duty only one applies (for example, the mixed duty of either £50 per tonne of imports or 20% of their value). Which applies depends on which generates the most (or sometimes least) tariff revenue. Let’s assume that policy choice is to generate higher tariff revenue. If the price of imports was £100 per tonne, the importer would have to pay a mixed duty of £50 per tonne of imported steel. "
        },
        {
            "text": "Variable duty – Minimum Import Price (MIP) "
        },
        {
            "text": "A variable duty raises the import price to a level that is at least as high as a predetermined level, which could be, for instance, the domestic price. This duty is adjusted frequently in response to changes in world market prices to ensure that the import price after payment of the duty is equal to a predetermined domestic market price. "
        },
        {
            "text": "An advantage of a variable duty is that it insulates the domestic industry from movements in international prices. This is particularly beneficial when protecting domestic industry from unfair trading practices in highly volatile international markets, where prices change frequently. "
        },
        {
            "text": "A disadvantage of a variable duty is that it could involve constant changes and adjustments, which could be seen as less predictable from the perspective of importers. Also, on a wider scale these duties being “price-insulating” in nature within a single market can be associated with an increase in global market volatility more broadly. When a country insulates a price of a certain good, it is effectively leaves other countries more exposed to the impacts of global supply and demand shocks.  "
        },
        {
            "heading": 3,
            "text": "Price undertakings "
        },
        {
            "text": "A price undertaking is an agreement by a foreign exporter to raise the export price to non-dumping or non-injurious levels. It is an alternative to an anti-dumping duty, and it is based on trust between the investigating authority and the foreign exporter. The foreign exporter has a motive to keep to the agreement as generally the foreign exporter can sell at a higher price under this agreement than with a duty in place. "
        },
        {
            "text": "An advantage of price undertakings is that they can be revised and terminated at short notice and therefore have greater flexibility for the investigative authorities than tariffs. "
        },
        {
            "text": "A disadvantage of price undertakings is that they require a lot of monitoring by the investigating authority and/or the domestic industry to ensure that foreign exporters comply. This is also the main reason why investigating authorities may be reluctant to impose them. Further, undertakings allow overseas exporters to benefit from charging higher prices, rather than government benefitting from revenue generated by import duties.  "
        },
        {
            "heading": 3,
            "text": "Tariff Rate Quotas (TRQs) "
        },
        {
            "text": "TRQs combine both tariffs and quotas (quantitative restrictions, which limit the value, volume or weight of a certain good that a country can import during a particular period). This works by applying a reduced (or zero) duty rate up to a certain quota of imports, and then increasing the duty rate once that quota is reached and exceeded. For instance, 100 tonnes of steel could be imported duty free, but once the quota is filled, importers can must pay an ad valorem duty of 20%. "
        },
        {
            "text": "An advantage of TRQs is that they offer protection from unfair trading practice to domestic industry whilst also guaranteeing a fair level of market access for foreign exporters. "
        },
        {
            "text": "A disadvantage of TRQs is that they could cause increased fluctuations in domestic supply and therefore prices throughout the year. As TRQs are administered on a first-come, first-served basis, foreign exporters could be incentivised to get their shipments delivered near the start of the quota year. This attempt at avoiding the out-of-quota duty could cause an unnecessary dip in domestic prices at the start of the year and possible shortages towards the end of the year. "
        },
        {
            "heading": 2,
            "text": "Measures recommended by the TRA "
        },
        {
            "text": "The below table lists cases where we have published our initial or final findings to recommend trade remedy measures so far. Most of these have been ad valorem duties.   "
        },
        {
            "text": "Find out more about our investigations on our public file. "
        },
        {
            "text": "In many of our transition reviews so far, we have maintained the original measures imposed by the EU, which were also in the form of ad valorem duties.  "
        },
        {
            "heading": 2,
            "text": "So, why does all this matter? "
        },
        {
            "text": "As you have read, there are different forms of trade remedy measures, all of which come with their advantages and disadvantages. "
        },
        {
            "text": "In all our investigations we would seek to recommend the best form of measure that protects the UK industry against unfair trading practices and seems most appropriate given the nuances of the good under investigation, the wider industry and supply chain. However, it seems likely that ad valorem duties will continue to be the most common form of measure recommended by the TRA. They are also the most frequently used form of measure by investigating authorities around the world."
        }
    ]
}