{
    "url": "https://equalities.blog.gov.uk/2023/10/16/menopause-in-construction-improving-support-for-women-in-the-industry/",
    "title": "Menopause in Construction: Improving support for women in the industry",
    "authors": [
        "geostrategiccomms"
    ],
    "categories": [
        "GEO team",
        "Women"
    ],
    "pub_date": "2023-10-16T08:28:19+01:00",
    "content": [
        {
            "text": "To mark Menopause Awareness Month, the Equality Hub is shining a light on employers like Willmott Dixon who are showing leadership in the construction sector in supporting women experiencing the menopause."
        },
        {
            "text": "With around 74,000 women working in the construction sector aged between 45-54 in 2021, it is important that workers within the industry are supported in the workplace."
        },
        {
            "text": "With a fifth of their female employees between the ages of 45-55, Willmott Dixon are keen to raise awareness of the support that is currently available to women, their partners and family. "
        },
        {
            "text": "Sally Cleaver, Group Diversity Manager at Willmott Dixon, shares some of the measures the company has put into practice over the last few years. These include:"
        },
        {
            "text": "Sally shares some feedback from one of her colleagues about the benefits of the Menopause Health Plan:"
        },
        {
            "text": "“From start to finish, the journey with the Medical Health Plan was an easy experience. I only had to wait approximately four weeks for an online appointment and clear instructions were emailed to me of how to join. The 45min appointment was thorough, all the points I had raised were discussed in full. I now wish I’d been offered this opportunity years ago when I first started the menopause transition when I was 46 years old. The menopause specialist had a plan and realised that I had been plodding along for the last four years and made some tweaks to my already prescribed medication. You also get a 15 min review 12 weeks after your initial appointment. My advice would be, don’t hesitate to book up and get  reassurance from an experienced specialist. They really do put your mind at rest and help you make an informed decision for your journey during the menopause and after.”"
        },
        {
            "text": "Below, Sally shares the testimonies from colleagues who have found the Menopause Cafes beneficial, including one from its founder, Simone Harding."
        },
        {
            "text": "“Starting the Menopause Café two years ago was something that was very personal for me and happened very naturally. It went from talking to someone in Willmott Dixon in a similar position to me to us thinking that we could do more for others.  Within the cafés, we provide a safe space to talk about the subject and offer each other practical advice and support, all with good humour… it’s needed! We are keen to encourage anyone, whatever gender or age, to talk about menopause as it affects all our lives, whether at home or work. We will continue with these cafés to enable conversations to overcome the taboo of talking about menopause and make it normal.”"
        },
        {
            "text": "Another female colleague added:"
        },
        {
            "text": "“Discovering the Menopause Café has been a real lifesaver as I no longer feel like 'Is it just me?'.  Finding this most supportive group has absolutely changed the way I feel about asking for help when I'm struggling with a particular symptom. The group are always on hand with advice or something new to try and all with the grace of fabulous humour, which is very much appreciated. Knowing you can share your thoughts in an open group without judgement is the most powerful thing about 'our' group, and I would hate to be without it now!”"
        },
        {
            "text": "One of our male colleagues, Mark French, Chief Health, Safety and Env Officer highlights:"
        },
        {
            "text": "“The ‘Menopause Café’ session that is held regularly for our male colleagues has turned out to be very helpful. The great thing is that it is there as an option to attend rather than something mandated. It’s so good to raise awareness that many of our people are feeling the impact of menopause and now have a platform to discuss any issues or concerns openly  Just to get the topic of menopause out in the open has been very enlightening for all and very encouraging.”"
        },
        {
            "text": "Menopause Workplace Pledge"
        },
        {
            "text": "Willmott Dixon has signed up to the Menopause Workplace Pledge. By signing up, the business has committed to:"
        },
        {
            "text": "Learn more about the Menopause Workplace Pledge and how your workplace can get involved by visiting: https://www.wellbeingofwomen.org.uk/menopause-workplace-pledge/."
        }
    ]
}