{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/10/16/our-same-sex-adoption-story/",
    "title": "Our same sex adoption story",
    "authors": [
        "Ian Tomney-Bell"
    ],
    "categories": [
        "Adoption"
    ],
    "pub_date": "2023-10-16T08:00:37+01:00",
    "content": [
        {
            "text": "Ian Tomney-Bell shares his family’s inspiring adoption journey - from challenging parts of the journey, to the special moment they met their daughter Aspen. "
        },
        {
            "text": "About us"
        },
        {
            "text": "My partner Darryl and I met 10 years ago, in 2013, at a conference in Blackpool. We had a whirlwind romance and were due to be getting married in 2020. We were well into wedding planning when the Covid-19 pandemic hit, and everything was put on pause. This opened the opportunity to allow us to discuss our future even more and we kept talking about a child. At the time, we both had concerns and doubts."
        },
        {
            "text": "Are we too old to be parents now? Could we offer the support needed when we’re both career focused? Would we be accepted as we’re a gay couple?"
        },
        {
            "text": "After lots of talking we decided it was the right time and started by researching adoption stories, advice and information about the process. We spoke to some adoption agencies, friends, family and our local authority. We decided to fill in a brief introductory form with Rotherham One Adoption Agency to start our journey."
        },
        {
            "text": "The relationship with your social worker"
        },
        {
            "text": "Around 2 weeks later we heard back from Rotherham who then arranged an initial meeting with our social worker. In this introduction we started to form our working relationship and got to know each other better. The strong level of trust needed between the social worker and ourselves was something we weren’t prepared for. In truth, the process can be a hard slog, so having a trusted social worker who can guide you throughout the process is so important. Essentially, your social worker should be someone you would trust to understand all your personal details and eventually set you up with the right child. Also, particularly as a LGBT+ couple you want someone with an understanding of same sex couples and holds no preconceived ideas. If you’re not comfortable with your current social worker, you can ask to change. You will not be judged for doing this and it will help you in the long term."
        },
        {
            "text": "The adoption process"
        },
        {
            "text": "Something my partner and I found very stress-inducing were panel meetings. In our case, the first panel meeting which determined whether we were the right people to adopt, happened at the mid-point of the process. Our second and final panel meeting happened once we had met our child, to review the match."
        },
        {
            "text": "I think it’s important to remember though that they only want the best for you - they don’t want to stop an adoption going ahead.  It is important to look after your mental health at this point and if you struggle, speak with your friends, partner, your support, your social worker and if needed the many charities available to you such as You Can Adopt."
        },
        {
            "text": "Aspen"
        },
        {
            "text": "Once we got through the process it didn’t take too long to get a match. For some this takes time which is no judgement on you, it’s much more about creating the right match. We were introduced to Aspen, a 16-month-old baby girl with beautiful blonde hair and gorgeous blue eyes. I can tell you now, at that moment it was sealed."
        },
        {
            "text": "Aspen had grandmothers who wanted to keep contact with her. We were so nervous about this. We were worried their expectations would be too much and Aspen may have too much family. We got to meet them, and we started a bond straight away. We’ve developed a friendship and embraced new in-laws. We are so lucky they are in Aspen’s life as they will help her identity as she grows and starts to have questions."
        },
        {
            "text": "Aspen has been a part of our family now for 18 months and she’s such a character. The worry about homophobia and people treating her differently because she has 2 dads has yet to appear and Aspen has become a confident toddler. We constantly get compliments about how brilliant she is from teachers, friends and family and anyone who gets to meet her. She really has given us, her Daddy and Pops, meaning to our lives and eternal happiness."
        },
        {
            "text": "If you’re stuck wondering as a same sex couple if this the right path for you, don’t worry. One in 6 adoptions in England are to same sex couples. Your journey will have highs and lows, but your family is worth it. Get the right support behind you and make it your goal. You can do this, you’re not alone."
        },
        {
            "text": "To read about other adoption stories, or to find further information and support about adoption, visit You Can Adopt UK.  "
        },
        {
            "text": "Help us inspire future adoption families by sharing this blog to your social media channels using the buttons below.  "
        }
    ]
}