{
    "url": "https://gfie.blog.gov.uk/2023/10/16/prison-leaver-recruitment-in-the-civil-service/",
    "title": "Prison Leaver Recruitment in the Civil Service",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "build capability",
        "Inclusion",
        "levelling up",
        "Life Chances",
        "Lived Experience",
        "Prison Leavers",
        "Social mobility"
    ],
    "pub_date": "2023-10-16T13:00:13+01:00",
    "content": [
        {
            "text": "Fiona Ryland, Government Chief People Officer shares her recent experience from a visit to HMP Standford Hill, and her commitment and support for Prison Leaver Recruitment in the Civil Service."
        },
        {
            "text": "I recently visited a Prison with colleagues from the Going Forward into Employment (GFiE) Team. It was an enlightening day. I had visited a young offenders Institution before, as part of a previous role, but never a Prison.  Several things struck me as important as I looked around the training facilities and spoke with Prisoners that day, one of which was the clear commitment of Prison staff to the training and education of the men in their care (and it was all men in this prison) from day one of their time at HMP Standford Hill."
        },
        {
            "text": "Another was a reminder of the value of this kind of outreach and the brilliant engagement of the men we met who wanted to hear about what the civil service might offer as an employer as they start to consider their next steps after release. But more than anything it reinforced my existing view that the civil service as a large national employer must have a role to play in providing roles for prison leavers and we cannot be complacent about expecting people to understand the civil service, all it does and all it can offer as an employer - we need to go out and tell people who we are and why the civil service is a great place to work."
        },
        {
            "text": "If your Department would like to arrange a Prison visit please get in touch with the Going Forward into Employment (GFiE) Team by sending an email to GFiE@Cabinetoffice.gov.uk"
        },
        {
            "heading": 3,
            "text": "Civil Service Prison Leaver Recruitment Event"
        },
        {
            "text": "At a recent event we held to promote Prison Leaver recruitment supported by the Rt Hon Jeremy Quin Minister for Cabinet Office and Rt Hon Damian Hinds Minister for Ministry of Justice, I was delighted to hear from colleagues with lived experience about how positive they had found their time so far in the Civil Service and I was encouraged to see that many of my colleagues are as committed to this work as I am."
        },
        {
            "heading": 3,
            "text": "How your Department can get involved:"
        },
        {
            "text": "You can find out more about Going Forward into Employment (GFiE) and how your department can get involved with Prison Leaver Recruitment, by visiting the GFiE Complete Guide to Prison Leavers and Lived Experience page"
        },
        {
            "text": "The Going Forward into Employment (GFiE) Team share a monthly Job Fair calendar mail update of Employment Fair opportunities within Prisons nationwide which your civil service department can attend, if your department is not on the mailing list and would like to receive these updates please get in touch with the team at GFiE@Cabinetoffice.gov.uk"
        },
        {
            "text": " "
        }
    ]
}