{
    "url": "https://valuationoffice.blog.gov.uk/2023/10/16/understanding-your-propertys-valuation/",
    "title": "Understanding your property’s valuation",
    "authors": [
        "VOA",
        "John Berry - Director of Property Professional Services"
    ],
    "categories": [
        "Business Rates",
        "Valuation"
    ],
    "pub_date": "2023-10-16T09:31:22+01:00",
    "content": [
        {
            "text": "It is important that you ensure the details we hold about your property are accurate and up to date.  "
        },
        {
            "text": "If you have not already, we recommend you read our introduction to business rates and how we value for business rates before you read on.  "
        },
        {
            "text": "More about your valuation  "
        },
        {
            "text": "Through a business rates valuation account on GOV.UK, you can:  "
        },
        {
            "text": "If you don’t already have a business rates valuation account, you need to register for one. You will need a Government Gateway User ID. You will have this if you use secure online government services like the HMRC portal. "
        },
        {
            "text": "The next step is to claim your property. We have useful resources to help you do this, including a YouTube video.  "
        },
        {
            "text": "You should allow about 15 days for your property to be linked to your account. "
        },
        {
            "text": "Checking your property’s details "
        },
        {
            "text": "Once you have your property linked to your business rates valuation account, you can: "
        },
        {
            "text": "You might need to update the details we have about your property. These changes can include things like floor area and parking. "
        },
        {
            "text": "This process is called a Check. It involves agreeing the correct factual details about your property with us.  "
        },
        {
            "text": "You can do a Check and manage your business rates yourself. You do not need to use an agent.   "
        },
        {
            "text": "Once you have submitted a Check, we have 12 months to process it – but we do this within 3 months for most Checks.  "
        },
        {
            "text": "If you make a Check there are some important things to keep in mind so you give us the correct information. Read our tips on how to update your property details correctly.  "
        },
        {
            "text": "We randomly review where a Check has been made so we know information provided to us is accurate.   "
        },
        {
            "text": "What’s the difference between a Check and a Challenge? "
        },
        {
            "text": "A Check is the first stage in our Check, Challenge, Appeal process of managing business rates.  "
        },
        {
            "text": "You must complete a Check – and agree the facts of the property with us – before you can Challenge your rateable value if you think it is wrong. "
        },
        {
            "text": "If you are thinking of Challenging your valuation, sit down and read our guidance on Check and Challenge before you get started.  "
        },
        {
            "text": "If you decide to Challenge a valuation, you must do this within 4 months of the Check decision. In some situations, you might have longer. Our aim is to clear 90% of Challenges within 12 months. "
        },
        {
            "text": "You can Appeal to the independent Valuation Tribunal if you do not agree with our decision on your Challenge. You need to do this within 4 months of our decision. Once a case goes to this stage it is managed by the tribunal. "
        },
        {
            "text": "Do I need to use an agent? "
        },
        {
            "text": "You can manage your business rates yourself. You do not have to use an agent or ask someone to help you. "
        },
        {
            "text": "If you do want to use one, read about appointing an agent for business rates. We also have a checklist to help you avoid rogue agents.  "
        },
        {
            "text": "How can I find out more? "
        },
        {
            "text": "Set up a business rates valuation account to find out more about how your rateable value has been calculated. "
        },
        {
            "text": "If you want to find out more about what we’ve covered here, watch our webinar on understanding business rates on our YouTube channel.  "
        },
        {
            "text": " "
        }
    ]
}