{
    "url": "https://defradigital.blog.gov.uk/2023/10/16/what-a-content-designer-does-in-discovery-part-two/",
    "title": "What a content designer does in discovery: Part Two",
    "authors": [
        "Sandeep Dhaliwal",
        "Ruth Fryer"
    ],
    "categories": [
        "Defra content design",
        "User centred design",
        "User research"
    ],
    "pub_date": "2023-10-16T08:00:52+01:00",
    "content": [
        {
            "text": "In the second post of this two-part blog, Defra content designers, Ruth Fryer and Sandeep Dhaliwal explore artefacts, approaches, analysis and how to finish discovery and prepare for alpha."
        },
        {
            "text": "Examples of content design tasks during a discovery:"
        },
        {
            "heading": 2,
            "text": "Choose a name for the service"
        },
        {
            "text": "Content designers can help the team to decide on a name for the service. This may change as the service goes into private and public beta."
        },
        {
            "text": "The service manual has a section for naming your service. It lists several ways to get user insights for a service name."
        },
        {
            "heading": 2,
            "text": "Record ideas to test in alpha"
        },
        {
            "text": "As a content designer, you should:"
        },
        {
            "heading": 2,
            "text": "Analysis: what have we found out"
        },
        {
            "text": "A content designer's findings will overlap with other areas of the team as the project grows."
        },
        {
            "heading": 2,
            "text": "Analysis to help you define measures of success"
        },
        {
            "text": "At this point, you might start to get a sense of what you’re going to need to focus on for alpha to make things better. The stats you’ve collected and the business goals you’ve found out about help to shape this."
        },
        {
            "text": "With alpha just around the corner, it’s a good idea to create some success measures first. This will help you to check if your planned improvements solve the problem."
        },
        {
            "text": "Your team might begin to think about things like:"
        },
        {
            "heading": 2,
            "text": "Finishing the discovery"
        },
        {
            "text": "Your discovery should come to a natural close when the team agrees you’ve found out enough to go into design exploration. The service team will need to prepare artefacts for the end of discovery workshop."
        },
        {
            "text": "Throughout discovery, you will list assumptions and hypotheses as a team. By the end, you should prioritise the riskiest assumptions. This will give you the focus for your research activities in alpha."
        },
        {
            "text": "By the end of discovery, you should have:"
        }
    ]
}