{
    "url": "https://naturalengland.blog.gov.uk/2026/01/07/a-biodiversity-net-gain-solution-for-a-high-value-brownfield-site/",
    "title": "A Biodiversity Net Gain Solution for a High Value Brownfield Site",
    "authors": [
        "David Feige"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Natural England"
    ],
    "pub_date": "2026-01-07T15:10:37+00:00",
    "content": [
        {
            "text": "By David Feige, Northumberland County Council"
        },
        {
            "text": "In this guest blog, David Feige, County Ecologist for Northumberland, explains the approach taken to approve a major new industrial development on a brownfield site at Cambois. The site contained a significant amount of open mosaic habitat (OMH), which is an important and complex type of wildlife habitat."
        },
        {
            "text": "To make sure the project could go ahead while still protecting biodiversity, an alternative solution was found.  This approach allowed the development to proceed while ensuring that nature was not only protected but enhanced at a landscape scale."
        },
        {
            "heading": 4,
            "text": "Introduction"
        },
        {
            "text": "In May 2025, Northumberland County Council gave initial approval for plans to build a campus of ten data centres at Cambois, in southeast Northumberland."
        },
        {
            "text": "The site covers 102 hectares and was once used as the coal yard for Blyth Power Station, which closed in 2001. Since then, the land has remained unused. Over time, different plant species have grown across the area, creating a mix of habitats typical of land that has previously been developed and then left to nature."
        },
        {
            "text": "Arcadis, the ecological consultants working with QTS (the developer), did a great deal to protect existing habitats and create new ones on site wherever possible. However, despite this, the project still faced a shortfall of 289 biodiversity units. This included 152 units of an ecologically important brownfield habitat known as open mosaic habitat (OMH) - by which we mean areas that are typically characterised by a mosaic of bare ground and other habitat types such as flower rich meadows, short, patchy grassland, scrub and wet areas. The individual compound habitats may not be notable in their own right, however, in combination they can create areas of high value for biodiversity."
        },
        {
            "text": "This was a serious challenge. At the time, there simply weren’t enough OMH units available to buy on the private market. Purchasing statutory biodiversity credits was not considered a financially attractive option in this case."
        },
        {
            "heading": 4,
            "text": "Creating a Habitat Bank to Support Jobs and Investment"
        },
        {
            "text": "Before QTS showed interest in the Cambois site, Northumberland County Council had already recognised the need for a clear biodiversity net gain (BNG) solution across the county’s key employment sites. This was seen as vital for attracting major investors, who often compare different locations. By reducing the risks around meeting BNG requirements, the Council aimed to keep Northumberland competitive."
        },
        {
            "text": "One site identified as central to this plan was Potland Burn near Ashington. Recently restored after surface mining, the 275-hectare site is mainly covered in temporary grassland and does not contain high-quality agricultural soils. This made it an ideal “blank canvas” for creating a habitat bank – a place where new habitats can be developed to offset biodiversity losses elsewhere."
        },
        {
            "text": "The land was owned by Advance Northumberland, the Council’s arm’s length development company who quickly set up a new company, Advance Green Futures Ltd, to take the project forward."
        },
        {
            "heading": 4,
            "text": "Tackling the Open Mosaic Habitat Challenge"
        },
        {
            "text": "Although the creation of a habitat bank at Potland Burn helped provide a biodiversity net gain solution for employment sites across Northumberland, it didn’t immediately solve the specific challenge at Cambois. The issue centred on OMH, a rare and valuable type of habitat."
        },
        {
            "text": "One option considered was to create OMH on a large scale at Potland Burn. However, this idea was ruled out for several reasons:"
        },
        {
            "text": "In short, while Potland Burn was a good site for other types of habitat, it wasn’t a practical or sustainable solution for OMH."
        },
        {
            "text": "Next to the new habitat bank is a small but very valuable area of land containing a mix of grassland, scrub, and wetlands, with plants such as dyer’s greenweed, pepper saxifrage, and agrimony. This mosaic of habitats is not only important for its plant life but also supports a wide variety of birds, like Black Redstarts insects such as the Shrill Carder Bee and reptiles like grass snakes and common lizards."
        },
        {
            "text": "It seemed clear that copying this successful mix of habitats on the wider habitat bank land would be a good idea. Doing so would bring both botanical and wildlife benefits. This thinking led to exploring how Rule 4 of the Statutory Biodiversity Metric could apply in this situation, helping ensure that the new habitats deliver genuine ecological value."
        },
        {
            "heading": 4,
            "text": "Applying Rule 4 to Potland Burn"
        },
        {
            "text": "Rule 4 allows flexibility in exceptional ecological circumstances, provided certain conditions are met. One of these conditions is the creation of a highly complex habitat mosaic on a large, landscape scale."
        },
        {
            "text": "While the guidance does not clearly define these terms, we were confident that Potland Burn could qualify. The site is exceptionally large at 275 hectares. For comparison, the average size of nature conservation sites in lowland Northumberland is 41.2 hectares, with many others being much smaller."
        },
        {
            "text": "Potland Burn also sits within the Southeast Northumberland Habitat Network, identified in the Local Plan, and forms the southernmost part of a chain of closely connected wildlife sites stretching north through Druridge Bay. Taken together, this gave us confidence that the project met the requirements of Rule 4."
        },
        {
            "text": "To be certain, Advance Northumberland asked the Natural Capital team at Freeths law firm to review the case. Their expert opinion confirmed our assessment."
        },
        {
            "heading": 4,
            "text": "Conclusion"
        },
        {
            "text": "Close collaboration between the client, Arcadis, Northumberland County Council, and Advance Northumberland has delivered a practical BNG solution for the Cambois project. By applying Rule 4 in this way, the £10 billion investment in the QTS data centre campus was able to move forward, with enabling works starting in October 2025."
        },
        {
            "text": "The approach will also create a rich mix of grassland, scrub, and ponds across the Potland Burn Habitat Bank. This will establish valuable habitats on a large scale, supporting wildlife and strengthening Northumberland’s natural environment for the future."
        }
    ]
}