{
    "url": "https://socialcare.blog.gov.uk/2026/01/07/building-on-the-positives/",
    "title": "Building on the positives",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2026-01-07T14:47:37+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A New Year message of thanks and hope for adult social care"
        },
        {
            "text": "Happy New Year! I hope every adult social care colleague, carer and those accessing care and support had a lovely Christmas and welcomed in 2026 with rest, reflection and renewed energy."
        },
        {
            "text": "I want to start by saying thank you to our amazing profession. Across adult social care, your commitment, compassion and professionalism continued to make an extraordinary difference to people’s lives every single day."
        },
        {
            "text": "As we look back on 2025, there have been some significant and encouraging developments for adult social care nursing and the wider workforce."
        },
        {
            "text": "Not least, we welcomed the launch of the first ever student placement strategy for social care nursing by Skills for Care, developed in partnership with the Council of Deans of Health."
        },
        {
            "text": "This strategy is helping more nursing students experience high-quality placements in social care, with practical tools for providers, stronger collaboration and structured preceptorship for those newly qualified."
        },
        {
            "text": "By opening the door earlier, we are showcasing social care as a rewarding, skilled and person-centred area of specialist practice."
        },
        {
            "heading": 2,
            "text": "Focus on enhancing skills and research"
        },
        {
            "text": "Upskilling our existing workforce has also been a key priority."
        },
        {
            "text": "I am delighted the Department of Health and Social Care invested £461,000 in the Adult Social Care Nurse Prescribing Pilot."
        },
        {
            "text": "Six Integrated Care Boards took part, enabling nurses to gain NMC-approved prescribing qualifications, contribute to advanced practice pathways and improve outcomes for the people we support."
        },
        {
            "text": "Throughout the pilot, impact on care quality, hospital admissions, discharge and workforce capacity was measured and analysed. This crucial step recognises and strengthens nurses' clinical leadership roles in social care."
        },
        {
            "text": "2025 also saw us continue to build a research-active profession."
        },
        {
            "text": "The Researcher Development Programme for Social Care Nurses offers nurses the opportunity to develop research skills, work directly with people who use services and help embed a culture of learning and improvement across organisations"
        },
        {
            "text": "Research led by social care nurses has the power to drive meaningful, evidence-based change."
        },
        {
            "heading": 2,
            "text": "Equity, diversity and belonging remain central to our work"
        },
        {
            "text": "Over 2025, we strengthened support for professionals from ethnic minoritised backgrounds, including the launch of the Global Majority Nursing Network and the ongoing Group for Ethnic Minority Social Workers."
        },
        {
            "text": "These networks provide safe spaces for connection, leadership development, shared learning and honest conversations, helping individuals to thrive and supporting organisations to become more inclusive."
        },
        {
            "text": "Another advance has been the launch of a dedicated preceptorship package for adult social care, funded through the “Small but Mighty” programme."
        },
        {
            "text": "Tailored support for newly registered nurses and nursing associates is essential for confidence, retention and high-quality care, particularly as care continues to shift into communities and neighbourhoods."
        },
        {
            "text": "Alongside this, work continues on delegation, clearer care career pathways and the Fair Pay Agreement consultation, all of which signal a shared ambition to professionalise, value and sustain our workforce."
        },
        {
            "heading": 2,
            "text": "Faith in the future"
        },
        {
            "text": "As 2026 gets underway, I am genuinely optimistic. Adult social care remains rich in expertise, innovation and leadership, the qualities which draw in, sustain and inspire so many of us."
        },
        {
            "text": "By continuing to invest in skills, inclusion and opportunity, we are building a stronger, more confident sector, one that supports people to live well, values its workforce and plays a vital role in our health and care system."
        },
        {
            "text": "Thank you for all that you do. Have a healthy, productive and rewarding 2026."
        }
    ]
}