{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2026/01/07/progress-towards-enabling-the-use-of-digital-verification-services-for-alcohol-sales-in-england-and-wales/",
    "title": "Progress towards enabling the use of digital verification services for alcohol sales in England and Wales",
    "authors": [
        "Eleanor Curry"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2026-01-07T10:00:00+00:00",
    "content": [
        {
            "text": "In December 2024, the then Secretary of State for Science, Innovation and Technology (DSIT) announced that changes would be made to the Mandatory Licence Conditions (MLCs) under the Licensing Act 2003 to allow digital verification services (DVS) to be used as proof of age for alcohol sales in England and Wales. We remain committed to making those changes."
        },
        {
            "heading": 2,
            "text": "Considerations for the new requirements"
        },
        {
            "text": "Since the announcement, the Home Office has been considering what requirements would be necessary and appropriate for enabling the use of a DVS for age verification for the sale of alcohol in England and Wales. It is clearly important to ensure the process is robust and secure."
        },
        {
            "text": "The OfDIA team has been helping the Home Office to consider and test possible requirements for age verification, given our links with stakeholders from the DVS, and retail and hospitality sectors. In light of this, the Home Office has been considering the following conditions which may need to be satisfied in respect of the digital information used for this age verification:  "
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "The Home Office is committed to making this change and is working on drafting the secondary legislation (a statutory instrument) in light of the considerations above."
        },
        {
            "text": "This is a complex area of law, and it has not been possible to change the MLCs last year as had been planned. The Home Office is working at pace with a view to making the changes as soon as possible this year."
        },
        {
            "heading": 2,
            "text": "What happens after the legal changes are made?"
        },
        {
            "text": "For DVS to be widely adopted as proof of age for alcohol sales in England and Wales, there is more to be done than simply changing the law."
        },
        {
            "text": "We envisage the following steps:"
        }
    ]
}