{
    "url": "https://nationalscreening.blog.gov.uk/2026/01/07/uk-nsc-online-seminar-on-screening-effectiveness/",
    "title": "UK NSC online seminar on screening effectiveness",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "Abdominal Aortic Aneurysm Screening",
        "Adult screening"
    ],
    "pub_date": "2026-01-07T13:28:14+00:00",
    "content": [
        {
            "text": "On 1 December 2025 the UK National Screening Committee (UK NSC) held its latest online seminar. This focused on screening effectiveness, using the Abdominal Aortic Aneurysm (AAA) Screening Programme as a case study. We had a great turnout on the day with nearly 200 attendees."
        },
        {
            "text": "First up, Phil Gardner (UK NSC Lead for Screening Data, IT, Standards and effectiveness and Harriet Strachan (UK NSC Screening Data and Effectiveness Analytical Manager) led us through a vibrant presentation on what effectiveness looks like in screening, how to assess it, and how important it is."
        },
        {
            "text": "Mr Jonothan Earnshaw (Consultant Vascular Surgeon (retired) and former NHS AAA Screening Programme Director) then gave a detailed insight into the AAA programme. He explained the development and implementation of the programme (beginning back in 2009), and talked us through the data showing that:"
        },
        {
            "text": "Finally, our NHS England colleagues Dr Robyn Fletcher (Consultant in Public Health, Senior Clinical Lead for the NHS Abdominal Aortic Aneurysm and Diabetic Eye Screening Programmes) and Holly Wilson-Guy (Pathway Implementation Lead for AAA and Diabetic Eye Screening (DES)) explained how they use the UK NSC effectiveness report to both confirm, and help maintain, effectiveness in AAA screening. They also looked to the future, sharing AAA screening objectives for 2026 and beyond."
        },
        {
            "text": "The seminar ended with a busy question and answer session, and it was really positive to see attendees sharing knowledge and tips in the meeting chat."
        },
        {
            "heading": 2,
            "text": "Presentation slides"
        },
        {
            "heading": 2,
            "text": "Future seminar topics"
        },
        {
            "text": "Our online seminars have looked at a range of topics to date, covering:"
        },
        {
            "text": "If you have ideas for future topics, please email us at uknsc@dhsc.gov.uk"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}