{
    "url": "https://ukhsa.blog.gov.uk/2026/01/07/what-are-the-symptoms-of-adenovirus-and-how-does-it-spread/",
    "title": "What are the symptoms of adenovirus and how does it spread?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health and Wellbeing"
    ],
    "pub_date": "2026-01-07T11:45:10+01:00",
    "content": [
        {
            "text": "Adenovirus might not be a household name like flu or the common cold, but it's one of the most common causes of viral infections. Most people will have had at least one adenovirus infection before they turn 10, and because there are many different types, it's possible to be infected more than once throughout your life."
        },
        {
            "text": "At UKHSA, we monitor weekly positivity data for common respiratory viruses include adenovirus, human metapneumovirus (hMPV), parainfluenza and rhinovirus, and you can see the latest figures on the Data Dashboard. This happens alongside our surveillance of flu and COVID-19."
        },
        {
            "heading": 2,
            "text": "What is adenovirus?"
        },
        {
            "text": "Adenoviruses are a group of viruses that cause a range of infections. Unlike flu, which typically peaks in winter, adenovirus doesn't follow a seasonal pattern - infections can occur at any time of year."
        },
        {
            "text": "While adenovirus infections are most common in babies and young children, people of any age can be affected."
        },
        {
            "heading": 2,
            "text": "What are the symptoms of adenovirus?"
        },
        {
            "text": "Symptoms are usually mild and similar to a common cold:"
        },
        {
            "text": "Adenovirus can also cause other illnesses, including conjunctivitis (pink eye), lung infections (like bronchitis and pneumonia), croup (a barking cough in children), ear infections, and gastroenteritis (tummy bug). Adenovirus can be more severe in people with weakened immune systems."
        },
        {
            "heading": 2,
            "text": "How does adenovirus spread?"
        },
        {
            "text": "Adenovirus is highly contagious and spreads easily in settings where people are in close contact, such as nurseries, schools, hospitals and care homes."
        },
        {
            "text": "The virus can spread through:"
        },
        {
            "text": "Adenoviruses can survive on surfaces for a long time, which is why shared objects can become sources of infection. Symptoms typically appear between 2 days and 2 weeks after exposure."
        },
        {
            "text": "People can continue to shed the virus after recovering, sometimes without any symptoms, meaning they can still pass it on to others. This is particularly common in those with weakened immune systems."
        },
        {
            "heading": 2,
            "text": "How is it treated?"
        },
        {
            "text": "Most adenovirus infections clear up on their own with rest and plenty of fluids. Paracetamol can help if fever is causing discomfort, and a humidifier or saltwater nose drops may ease congestion."
        },
        {
            "text": "Those with vomiting and diarrhoea who cannot drink enough fluids may need treatment for dehydration. In more severe cases, particularly in very young babies, elderly people, or those with weakened immune systems, hospital treatment may be necessary."
        },
        {
            "text": "Most infections last from a few days to a week or two, though severe cases may take longer to resolve."
        },
        {
            "heading": 2,
            "text": "How can I avoid catching it or passing it on?"
        },
        {
            "text": "Good hygiene is your best defence against adenovirus:"
        },
        {
            "heading": 2,
            "text": "When should I seek medical advice?"
        },
        {
            "text": "Contact a doctor if you or someone you care for:"
        },
        {
            "text": "While adenovirus infections are common and usually mild, knowing what to look out for can help you manage symptoms at home and recognise when professional advice is needed."
        }
    ]
}