{
    "url": "https://environmentagency.blog.gov.uk/2025/03/17/4000-inspections-and-counting-how-were-driving-water-industry-performance/",
    "title": "4000 inspections and counting: How we’re driving water industry performance",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Regulated industry",
        "Rivers",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2025-03-17T17:33:22+00:00",
    "content": [
        {
            "text": "In 2023 we announced significant changes to the way we regulate so that we can better address the underperforming water industry. At the heart of our plan was a significant increase in both our workforce and the number of inspections we carry out. We have achieved both; exceeding our target of 4000 inspections for the year to the end of March and recruiting hundreds of specialist staff."
        },
        {
            "text": "But this isn’t just about the numbers. Following intensive specialist training our teams are delivering everything from boots on the ground regulation to improving our data systems to give us the intelligence to spot problems and understand the root causes."
        },
        {
            "text": "The water industry is fundamental to the future health of people, wildlife, growth and the economy. Over the past five years, it’s been in the spotlight for all the wrong reasons. Water companies have to do more to keep pace with growth, climate change, ageing infrastructure and their reliance on using storm overflows. We are here to ensure they do what the public expect them to do."
        },
        {
            "text": "Delivering stronger regulation"
        },
        {
            "text": "We have delivered on two of the major commitments we set out last year and this is testament to the dedication of our new and existing staff to improve the water environment through better scrutiny of the water industry."
        },
        {
            "text": "We know more enforcement action is something that people want to see from us, and with more resources and the introduction of the Water Special Measures Act, we will be able to act more quickly. Our approach is to look at the whole regulatory cycle combining increased inspections and more enforcement action using a broader range of powers, along with new digital tools. This combination we’ll be able to deliver meaningful improvements in water industry performance, hold persistent offenders to account and ultimately see a cleaner water environment."
        },
        {
            "text": "Uncovering more non-compliance"
        },
        {
            "text": "As we expect, with more inspections, we are identifying more instances of non-compliance. Of the 4284 inspections carried out so far this year, we found that:"
        },
        {
            "text": "*A breach is when a water company fails to comply with the conditions set out in its environmental permit. This can happen for various reasons, such as releasing more pollutants into rivers than the permit allows or failing to carry out required water quality monitoring."
        },
        {
            "text": "We are following up on all these breaches, some of which can be rectified easily, and water companies have shown they can act quickly on our advice as shown by the before and after pics of a storm tank below. However, inspections can also uncover longer-term issues such as deteriorating assets that take longer to investigate and put right."
        },
        {
            "text": "The data and intelligence we collect through these inspections are crucial to really understanding the scale of the problem. But even more important is the opportunity it provides in being able to reduce potential pollution incidents in the future. We’re making this possible through identifying failures quicker and providing evidence on the root causes of issues so companies can take appropriate action."
        },
        {
            "text": "Inspections and their resulting outcome can also feed into water companies’ review of their short, medium and long-term infrastructure investment planning. This can result in problems and failures not happening in the first place. Our intelligence will feed into new statutory Drainage and Wastewater Management Plans which set out how companies plan to extend, improve and maintain a robust and resilient drainage and wastewater system over the next 25 years. They will be key in enabling growth by delivering capacity ahead of time as we face pressures from climate change and urban creep and a growing population."
        },
        {
            "text": "Case Study: Strengthening compliance through more boots on the ground "
        },
        {
            "text": "One of our new Principal Regulatory Officers has seen first-hand the impact of increased inspections."
        },
        {
            "text": "“With the additional resources, we are now inspecting a much wider range of assets. Previously, our focus was on the highest-risk sites, such as sewage treatment works. Now, my team, covering one water company, has been able to inspect:"
        },
        {
            "text": "\"We are also seeing water companies investing in their sites more because of our findings. With our strengthened approach, we are identifying problems earlier and preventing serious environmental damage.”"
        },
        {
            "text": "Looking ahead: 10,000 inspections by March 2026"
        },
        {
            "text": "Going from 1409 inspections in 2023/2024 to more than 4,000 in 2024/25 in a relatively short space of time is a major milestone and evidence of our determination to hold water companies to account and achieve a cleaner water environment. We are gearing up to deliver more inspections - our next target is 10,000 inspections by March 2026."
        },
        {
            "text": "The data and evidence gathered from more inspections, greater legal powers through the Water Special Measures Act and with more data on water quality than ever before will lead to stronger enforcement action and is already driving improvements in water company performance. For too long, the water industry has been focused on fixing failure and not ensuring the long-term resilience of our water infrastructure. We are turning this round."
        }
    ]
}