{
    "url": "https://naturalengland.blog.gov.uk/2025/03/17/a-brighter-future-for-cornwalls-willow-tits/",
    "title": "A brighter future for Cornwall’s willow tits",
    "authors": [
        "Daveron Smith"
    ],
    "categories": [
        "Biodiversity",
        "Landscapes",
        "Monitoring",
        "National Nature Reserve",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature-based solutions",
        "Parks, trails and nature reserves",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-03-17T16:18:58+00:00",
    "content": [
        {
            "text": "Weighing as much as two teaspoons of sugar, with a round body and a ‘sooty black cap’ on their heads, willow tits are some of the sweetest looking birds in the country. But they are in danger – the willow tit is also Britain’s fastest declining resident bird."
        },
        {
            "text": "NE Senior Data Scientist and University of Exeter PhD student Daveron Smith explains what Natural England and partners are doing to help."
        },
        {
            "text": "Goss Moor National Nature Reserve in Mid-Cornwall is the focal point for one of southern England’s last populations of willow tit. "
        },
        {
            "text": "As site managers, Natural England is working in partnership with the University of Exeter and Cornwall Birds to reverse the decline of the species now perilously close to extinction. A community is forming that shares a common goal of working at a landscape scale to achieve this goal."
        },
        {
            "text": "Thanks to an enormous survey effort by the project team and dedicated volunteers last year, we now have a clearer picture of how the species is faring in mid-Cornwall. "
        },
        {
            "text": "Alarmingly, the River Camel population has been lost, and many formerly occupied habitat patches are now devoid of willow tits. They now occupy less than half the area they did 20 years ago, with their last strongholds in mid-Cornwall being the SSSIs of Goss Moor and Helman Tor."
        },
        {
            "text": "Modelling performed by the University of Exeter, alongside the local knowledge of Cornwall Birds members, has provided habitat management recommendations for Goss Moor. These have been carefully developed in collaboration with Natural England to be sensitive to the site's incredible biodiversity, which includes dormice, rare vascular plants, and the Marsh Fritillary butterfly. "
        },
        {
            "text": "This evidence-based approach has unlocked funding, allowing reserve manager Ian Moye to make crucial changes that enhance the habitat for willow tits and many other species. Specific efforts include increasing the age diversity of vegetation, maintaining open areas, allowing scrub to regenerate, and ensuring the availability of old, dead wood suitable for nesting. "
        },
        {
            "text": "You may have heard about this in our recent radio and TV features on BBC news!"
        },
        {
            "text": "Alongside targeted surveys, there is an ongoing, long-term monitoring programme of willow tit numbers and distribution on Goss Moor over time. This data is crucial to evaluating the effectiveness of our interventions. Early results are encouraging, with a nest site discovered in an area that has recently undergone habitat enhancement."
        },
        {
            "text": "While strengthening Goss Moor as a key stronghold is critical, ensuring a resilient population requires action at a landscape scale. "
        },
        {
            "text": "The Cornwall Willow Tit Project is actively engaging with a range of stakeholders, including local mining interests and farming communities, through Cornwall Wildlife Trust’s rewetting and Tor to Shore projects. By fostering these partnerships, we hope to create a connected habitat network that will allow willow tits to recover and thrive."
        },
        {
            "text": "On a national scale, this NE project is one of many committed to tackling biodiversity loss and preserving the diverse ecology of our country. If we look after nature, nature looks after us, and projects like this are vital for strengthening our health, wealth and security."
        },
        {
            "text": "The road ahead is challenging. Working with a species on the brink of extinction presents uncertainties, but through persistence, collaboration, and evidence-led conservation, we remain hopeful that the willow tit can have a future in Cornwall."
        }
    ]
}