{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/03/17/a-message-of-thanks-from-isabelle-trowler-cbe-chief-social-worker-for-children-and-families-2/",
    "title": "A message of thanks from Isabelle Trowler CBE, Chief Social Worker for Children and Families",
    "authors": [
        "Isabelle Trowler"
    ],
    "categories": [
        "Leadership",
        "Working in children's social care"
    ],
    "pub_date": "2025-03-17T10:12:56+00:00",
    "content": [
        {
            "text": "Firstly, one of the most important messages to give this week and across the year, is a huge thanks to you all for everything you do. I have seen some amazing practice over the last year, and everyone is working so hard - your commitment and the ambition you hold for children, young people and their families, always, always, shines through."
        },
        {
            "text": "The last 12 months has been a big year on all fronts for social workers. We’ve seen a general election, a new government, and a new Children’s Minister (who was previously a social worker!). It has also brought a key focus on reducing child poverty and supporting family stability, plus new money for local authorities which is ring-fenced for prevention work with families. You should know that this is all a result of the very encouraging social work practice across England over recent years. "
        },
        {
            "heading": 2,
            "text": "Workforce recruitment and retention"
        },
        {
            "text": "We are also seeing better workforce recruitment and retention with more social workers in permanent posts, lower caseloads, and fewer vacancies. This is for the second year running so we have our fingers crossed that this shift will continue in the years ahead. So much of that best practice is now also enshrined in the new statutory Children’s Social Care National Framework, which gives absolute clarity of purpose to children’s social care, but also what you need to enable you to do the social work you came into the profession to do - strong, practice-focused leadership, a strong workforce, and effective multi-agency contributions."
        },
        {
            "heading": 2,
            "text": "New standards"
        },
        {
            "text": "We will shortly launch new post qualification standards for newly qualified social workers, increasing the amount of time from one to two years, for you to embed your initial learning whilst getting to grips with the demands of child and family social work. There will be a consultation on this so do share your thoughts with the Department for Education (DfE)!"
        },
        {
            "heading": 2,
            "text": "Meeting colleagues in the profession"
        },
        {
            "text": "I met with some of the National Principal Social Worker Network in early March at their in-person meeting and will meet the network again on the 18 March with the Centre for Sexual Abuse. It’s really important that you get your views to your Principal Social Worker for them to share at a network meeting. Even if I’m not there, my colleagues from the DfE always are and they are very keen to get your perspectives, too! I’ll be meeting soon with Principal Social Workers in the West Midlands to chat through their thoughts and work towards the Children’s Social Care reform programme. I’m really looking forward to getting into the discussion. "
        },
        {
            "text": "I’ve recently met Nana Yabbey-Hagan who produces and presents with his colleague, Robert Dyer, the Social Worker and Mentor Podcast (do watch - it’s great). We have decided to do some work together to help bridge the gap between practitioners and senior leaders. I think all in all, we are held in good stead for the year ahead."
        },
        {
            "heading": 2,
            "text": "Out and about"
        },
        {
            "text": "I am often visiting social workers and connected projects across the country. Highlights for me have included:"
        },
        {
            "text": "I’m looking forward to getting out and about on more visits over the coming months, where I am sure I will meet many of you. If you would like me to visit your place of work or a group of practitioners to hear about your work, please get in touch."
        },
        {
            "heading": 3,
            "text": "Useful links"
        }
    ]
}