{
    "url": "https://ipo.blog.gov.uk/2025/03/17/belfast-based-arc-regulatory-talks-top-tips-for-safeguarding-ip/",
    "title": " Belfast-based ARC Regulatory talks top tips for safeguarding IP ",
    "authors": [
        "Heather Taylor, ARC",
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-03-17T17:30:00+00:00",
    "content": [
        {
            "text": "Specialist regulatory consultancy ARC Regulatory Limited has been a success story since its start in 2010. We spoke to ARC’s Chief Commercial Officer (CCO), Heather Taylor, to find out more about the organisation’s rapid rise and how protecting its intellectual property (IP) has played a significant part in ARC’s growth journey.  "
        },
        {
            "heading": 3,
            "text": "Tell us about ARC - what services does it provide? "
        },
        {
            "text": "The ARC team provides expert consultancy services in precision medicine. Heather captured its function succinctly: “ARC helps clients bring kinder patient treatments to the market”. "
        },
        {
            "heading": 3,
            "text": "Where did ARC’s story start? "
        },
        {
            "text": "Heather described how this niche regulatory consultancy grew up in Moneymore, Northern Ireland.  In time, the business expanded both at home and abroad. The ARC team was soon joined by Heather, an experienced marketer and former US-based Chief Marketing Officer, to help elevate ARC’s brand health.  "
        },
        {
            "heading": 3,
            "text": "When did the ARC team recognise the need for IP protection? "
        },
        {
            "text": "An early audit showed that the brand had little protection. By now ARC’s CCO, Heather knew that in order to safeguard the company’s global growth plans, it was essential to mitigate brand risk. Simultaneously, the company was investing heavily in ‘Software as a Service’, or SaaS (a cloud-based service that allows users to access and use applications over the Internet) to support its customers. "
        },
        {
            "text": "“Not only did we need to look at brand protection for ‘ARC’ as a name but also the IP of our new digital product, ARC360, too,” she said. "
        },
        {
            "text": "You can view ARC's trade marks, including ARC360, here (link)"
        },
        {
            "heading": 3,
            "text": "Tell us about your experience accessing IP funding, support and advice "
        },
        {
            "text": "Invest Northern Ireland, working closely with the Intellectual Property Office (IPO) helped ARC navigate the IP pathway right from the outset. “They kindly recommended the most suitable grant funding available - IP Audit and IP Access grant support complemented by Invest Northern Ireland’s Technical Development Incentive (TDI) grant” Heather told us.  "
        },
        {
            "text": "“We recognised that finding funding for IP could be a challenge, not least because experience told us that legal costs can escalate tenfold quickly,” explained Heather. “Exploring funding mechanisms was key. That’s where the support and guidance of Invest Northern Ireland came in”.  "
        },
        {
            "text": "Following research, ARC connected with someone Heather describes as ‘really supportive’, Sean McDonagh, Trade Mark Director at HGF, to get the ball rolling. “Half the battle was determining just what markets mattered most and how to maximise your coverage through blanket trade marking in the EU, to name but one saving”, Heather said.  "
        },
        {
            "heading": 3,
            "text": "ARC’s IP funding timeline "
        },
        {
            "text": "ARC’s  IP journey took approximately 18 months from start to end. The team focused on the home market first, UK, then expanded to Europe, USA and China.  "
        },
        {
            "text": "“We learnt early on about road blocks and met with the HGF trade mark team to reconsider our options. After careful consideration, we reduced our geographic expansion, focusing first on getting the UK IP completed, abandoning China and refocusing fewer trade marks in the US”.  "
        },
        {
            "text": "In early February 2025, the organisation secured both US and EU registrations for both ARC and ARC360 to conclude its IP package commitments. Heather was delighted with the results, concluding “brand protection should not be underestimated today. Thanks to the collaborative approach of our partners, Invest Northern Ireland, IPO and HGF, ARC Regulatory, now Belfast-based, has positioned itself for our exciting global expansion plans. This includes a new research laboratory to support pharmaceutical and diagnostic clients at home and abroad.’’"
        },
        {
            "text": "If, like ARC, you’re a business wanting to understand more about how to protect your IP, take a look at our free guidance: Welcome to IPO’s online support tools. These have been designed to help you: | Intellectual Property Office"
        },
        {
            "text": "Subscribe to our blog to get our SME IP stories delivered straight to your inbox! "
        }
    ]
}