{
    "url": "https://ruralpayments.blog.gov.uk/2025/03/17/countryside-stewardship-and-environmental-stewardship-revenue-claims-are-open-for-2025/",
    "title": "Countryside Stewardship and Environmental Stewardship revenue claims are open for 2025",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2025-03-17T14:00:00+00:00",
    "content": [
        {
            "text": "You can now submit your 2025 revenue claim for Countryside Stewardship (CS) or Environmental Stewardship (ES). "
        },
        {
            "text": "You have until 11.59pm on 15 May 2025 to submit your claim without reduction."
        },
        {
            "text": "Countryside Stewardship"
        },
        {
            "text": "Before you submit your CS claim, please make sure you have updated your land use codes by signing into the Rural Payments service. If you’re unable to access the Rural Payments service, email us at ruralpayments@defra.gov.uk."
        },
        {
            "text": "If you’re a CS agreement holder who submits an annual revenue claim, an annual declaration will be available to you in the Rural Payments service. If there’s no change to your claim from last year, you can submit an automated revenue claim with a single click and without needing to complete each section of the claim form."
        },
        {
            "text": "Watch: How to submit a revenue claim using the Rural Payments portal"
        },
        {
            "text": "If there are any changes to your claim from last year or your agreement includes rotational options, you’ll need to tell us."
        },
        {
            "text": "Environmental Stewardship"
        },
        {
            "text": "If you’re an ES agreement holder, you’ll receive your claim form by either email or post. You need to complete it and return it to us to submit your claim."
        },
        {
            "text": "Reductions applied to late claims"
        },
        {
            "text": "The deadline for submitting your 2025 CS or ES claim without reduction is 11.59pm on 15 May."
        },
        {
            "text": "If you miss this deadline, you still have until 11.59pm on 1 September 2025 to submit a claim, but a reduction will be applied to the value of your claim. The later you submit it, the greater the reduction."
        },
        {
            "text": "The reductions will be applied in the following way:"
        },
        {
            "text": "Date we receive your claim - reduction applied to claim value"
        },
        {
            "text": "On or before 15 May - no reduction - full value paid"
        },
        {
            "text": "Between 16 May and 2 June - 5% reduction"
        },
        {
            "text": "Between 3 June and 30 June - 10% reduction"
        },
        {
            "text": "Between 1 July and 1 September - 25% reduction "
        },
        {
            "text": "After 1 September or not received at all - 100% reduction - no claim paid"
        },
        {
            "text": "Read our guidance on GOV.UK for more information on how to make a Countryside Stewardship or Environmental Stewardship revenue claim."
        }
    ]
}