{
    "url": "https://stratcommand.blog.gov.uk/2025/03/17/from-hobby-to-classroom/",
    "title": "From hobby to classroom",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-03-17T09:15:40+00:00",
    "content": [
        {
            "heading": 4,
            "text": "As part of the Defence Experimentation and Wargaming Hub’s (DEWH) People in Wargaming series we recently spoke to a panel of people/experts about their experiences in the field of wargaming."
        },
        {
            "text": "Interviewer: Can you briefly introduce yourself? "
        },
        {
            "text": "Iain - I'm Dr Iain Farquharson, I'm a lecturer in Global Challenges at Brunel University, London. I’m also, as of this year, the convener of Brunel’s new Master of Arts (MA) degree in Wargaming and Resilience Planning."
        },
        {
            "text": "Steven - I'm Dr Steven Wagner, I'm a senior lecturer in International Security at Brunel. Have an MA in Intelligence and Security Studies, and we'll also be teaching this on the new MA in Wargaming."
        },
        {
            "text": "Interviewer: Can you briefly describe your role/experience in wargaming? "
        },
        {
            "text": "Iain - I use wargaming in my undergraduate teaching as a culmination exercise to test student learning over the course of the entire three years. I also use quite a few off-the-shelf board wargames as ways to teach students key principles and ideas that can be quite complex to get across in standard teaching.  "
        },
        {
            "text": "Steve – I’ve always loved wargaming but very few people in my life share this love; and so, I make my students do it. I’ve developed a matrix style game for my Intelligence Studies MA students. Where the students are put into a crisis scenario and meant to evaluate, after the fact, what value intelligence has for them in that specific setting. This mirrors work and advice given to me by Rex Brynen [Prof Political Science, McGill University] and Rob Johnson [now Director of SONAC] which I’ve added structure to be more suitable in the university classroom setting."
        },
        {
            "text": "Interviewer: Can you please explain the role of the Defence Experimentation and Wargaming Hub?  "
        },
        {
            "text": "Iain - For me, I see it as a strategic-level way for the British Defence establishment to get itself back into the practice of wargaming on a regular basis and in different contexts. As a historian of military education, I go back to the Imperial Defence College idea that it’s a place to bring people together to better understand the upcoming challenges or the potential issues that British Defence is dealing with or will deal with in the future. As its role develops, it will start to look a little bit more at how Defence operationalises at the inter-service level? "
        },
        {
            "text": "Steven - I have nothing to add to that, only to say that from a Brunel point of view, we're just very keen to work with the DEWH both on the research and knowledge transfer side. It would be good to expose our students to the DEWH. "
        },
        {
            "text": "Interviewer: What are some of the key skills required for success in the wargaming field?  "
        },
        {
            "text": "Steven - It's all about methodology, certainly in terms of wargame design, I mean that in the academic sense. How you structure a project to achieve the goals that you set out to accomplish, while limiting risks and other hazards such as bias for example. A lot of this is termed red teaming, for example, in industry it strikes me as simply another word for risk research methodology and rigour. To me, those are the basics building blocks. "
        },
        {
            "text": "Iain - People management and the ability to make sure that when you're running and facilitating wargames, you can keep the players on course without feeling like you're limiting their field of options. This feeds into getting buy in from whoever's playing the game. Being able to explain and get people to understand what they're doing is helpful in the future is a core skill. I feel like I'm going down the softer side of things than Steven does. Its people skills, people management and also understanding the softer side of social science, bringing in sociology and anthropology."
        },
        {
            "text": "Interviewer: What current trends are you seeing in wargaming? "
        },
        {
            "text": "Iain - At the minute there is a rapid expansion in all kinds of different fields. Defence has obviously been the one where it's been present for the longest, but we're seeing a resurgence again in terms of interest and in what it can do and how it can add value. Equally, we're also seeing a greater level of interest outside of Defence, particularly in business wargaming. I think the expansion beyond the Defence field is probably one of the biggest trends I've seen in the last few years."
        },
        {
            "text": "Steven – From a mainly academic stance, we're seeing new papers being published on this topic, not just about wargaming, but about its methodology, basically suggesting that it is a research methodology. This is huge, as it elevates wargaming to a discipline in social sciences. "
        },
        {
            "text": "Interviewer: How do you think wargaming will evolve over the next five years? "
        },
        {
            "text": "Iain - The introduction of a master's degree in wargaming is going have a big influence on that evolutionary process. We're seeing a lot more academic engagement with wargaming. I think that is going to drive a significant community of interest within academia. I think we'll see more experimental wargaming happening at a number of different institutions, driving the idea of it as a research methodology and giving wargaming more academic rigour."
        },
        {
            "text": "More solid integration of academia and professional wargaming could see further growth in rigour and applicability. "
        },
        {
            "text": "Steven - I would not be surprised to see more handbooks coming out of Dstl even a joint doctrine publication with clear specification about what kinds of wargames are good for which purposes. New approaches to rigour like ways of ensuring that your results are going to be valid. So overall, I’d say professional standards in the form of more handbooks. This would benefit from academic collaboration, of course, but also increased international collaborations."
        },
        {
            "text": "Interviewer: What is your favourite wargame and why? "
        },
        {
            "text": "Steven – I have always liked Axis & Allies – Pacific edition because it's so hard. I like this series because the dice have a logic, they represent something, not just insanity. It's been a long time since I played it, but I still think about it."
        },
        {
            "text": "Iain - I think for me there are two games, they're both GMT games [a creator and publisher of wargames]. The first is Operation Overlord Normandy because I’ve spent hours playing it with friends. I find it really interesting the impact a single change could have had on the outcome of the operation, for example, the weather. For instance, if it was poor weather meaning no allied air support, then the Germans could have completely stopped the Canadian and British armies. The other game is the Counterinsurgency series on Cyprus. For a similar reason, it's a point of history I don't know as much about but being able to identify some of those core principles of counterinsurgency and how you can enact them, in a hobby environment, is really fascinating. It adds an extra level of enjoyment to be able to go ‘oh, OK, this is why this stuff happens’. "
        },
        {
            "text": "Interviewer: What do you see as the biggest challenge facing Defence Wargaming?   "
        },
        {
            "text": "Iain - Potentially the culture within Defence. It's always tricky to introduce anything new within an organisational context. This isn't saying Defence is bad at this, I just think introducing a new concept to force change quickly is always a difficult challenge; you need buy in. I was having a conversation with someone the other week and they were saying they don't see history and historical games as being useful in shaping future context, I sort of bit my tongue quite strongly at that point."
        },
        {
            "text": "Steven - I've observed in the last two years a craving for better ways to do and to present verification and validation. Essentially to address the key question, does the methodology suit the research question? And is the design nourishing this goal? That's the validation. I think we have a lot to collaborate on that front and finding the right way to communicate that to your customers."
        },
        {
            "text": "Interviewer: What advice would you give to someone aspiring to enter the wargaming industry? "
        },
        {
            "text": "Iain - From a selfish perspective, I'd say come and do the MA at Brunel which will give you a good grounding in the key skills you need. Other than that, I think just play games. Playing is a core part of this because the more you play, the more you can critically appraise what you're playing; and the more you can understand what's needed to go into that game design process and how you can draw people in, keeping people interested in what you're doing. "
        },
        {
            "text": "Steven – Play, read, organise, tinker, experiment, but ultimately just show up."
        },
        {
            "text": "Interviewer: What drives you as an individual? "
        },
        {
            "text": "Steven - My topic of study gets me out of bed in the morning, that's for sure. I'm the director of our departmental PhD programme and I get a real sense of purpose when giving advice to perspective applicants toying with the idea of a PhD.Iain - Curiosity is the main thing that probably drives me as an individual, particularly from the research perspective. It's not the most glamourous of military topics, but military learning, military organisation, organisational function is fascinating, and it drives me to keep picking up those books that aren't necessarily directly related and to keep thinking about different ways I can apply that knowledge to my research. "
        }
    ]
}