{
    "url": "https://medregs.blog.gov.uk/2025/12/22/2025-in-medtech-a-year-of-innovation-global-leadership-and-regulatory-milestones/",
    "title": "2025 in MedTech: a year of innovation, global leadership and regulatory milestones",
    "authors": [
        "Rob Reid"
    ],
    "categories": [
        "AI Airlock",
        "Diagnostics",
        "Health Institution Exemption",
        "IMDRF",
        "IVD",
        "Med Tech Regulations",
        "Medical Devices",
        "Post-Market Surveillance",
        "Pre-market statutory instrument",
        "Uncategorized"
    ],
    "pub_date": "2025-12-22T15:53:38+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Rob Reid, MHRA deputy director of innovation devices, at AI Airlock Connect, October 2025"
        },
        {
            "text": "As the end of 2025 rapidly approaches, I find myself searching out those articles and lists that reflect on key moments across the year. Whether it is films, music, sporting achievements, or politics, remembering the year through this myriad of moments helps me to reflect on the highs and lows of the year, and prompts me to think about our own achievements in the world of med tech regulation."
        },
        {
            "text": "Our list of achievements may not have the glamour of a top 50 albums of the year list, but it reflects an enormous amount of work that could not have been delivered without the engagement and support of an entire ecosystem of partners. This includes colleagues from across the MHRA, other government departments, devolved administrations, the wider healthcare system, approved bodies, and the health tech sector, all working towards the same goals: that UK patients can safely and rapidly access the medical technologies they need, for innovation to flourish, and for the UK’s health tech sector to grow. So, to match this enormous effort, I want to start this blog with a sincere thank you to all who have supported us in our work this year!"
        },
        {
            "text": "And so on to that (non-exhaustive) list and whistle stop tour of some highlights from 2025…The year began with the publication in January of guidance to support the implementation of the new Post-Market Surveillance regulations that passed through Parliament at the very end of 2024. Marking an important step in UK regulatory reform programme, these new rules came into force in June and has led to increased reporting by manufacturers. While more reports of incidents might seem worrying, it’s actually a sign that the regulations are working and issues can now be found and resolved faster, for the benefit of patients. These changes have laid a strong foundation for future reforms in medical technology regulation."
        },
        {
            "text": "February saw the publication of more excellent guidance, this time the focus was on Digital Mental Health, recognising the rapid growth in digital tools to support mental health and the need for clear guidance for manufacturers on when and how to follow medical device regulations. The guidance was an output from a Wellcome-funded project that has seen the MHRA recognised as a thought leader globally in the regulatory approach to Digital Mental Health Technology (DMHT). And in December the Agency announced that it had been awarded further funding to continue the great work of the project team well into 2028."
        },
        {
            "text": "And March continued the theme of global leadership as the world first regulatory sandbox for AI as a medical device, the AI Airlock, completed its pilot phase and published its findings. This groundbreaking approach to understanding the unique regulatory challenges posed by AI technologies has provided valuable insights that will help to maintain the UK’s reputation as a global leader in this space. The success of the pilot phase was outlined by the announcement of funding for a second phase in the government’s Regulatory Action Plan."
        },
        {
            "text": "March also saw the team represent the UK at the 27th in-person meeting of the International Medical Devices Regulators Forum in Tokyo, providing updates on the UK’s regulatory reforms, the developing approach to International Reliance, and leading Working Group updates on AI and software as a medical device and clinical evidence for in vitro diagnostics. The team returned to Japan in September to continue this international engagement, leading discussions on real world evidence in regulatory submissions."
        },
        {
            "text": "A rundown of the year’s events would not be complete without acknowledging Lawrence Tallon joining the MHRA as Chief Executive in April. From day one Lawrence has championed a regulatory approach to devices that has patient safety at its heart while focusing on improving patient access, driving innovation and growth, and building on UK and international partnerships. Alongside our Chair Anthony Harden, Lawrence’s enthusiasm and belief in the transformative potential of medical technologies have been clear to all and will be a driving force as we move into 2026."
        },
        {
            "text": "Throughout May and June the focus turned very much to the legislative agenda with new regulations coming into force to retain key pieces of EU law in GB, the PMS regulations coming into force, and the team working to analyse and respond to two key consultations. The first explored a key pillar of our regulatory strategy: the introduction of international reliance pathways. The second confirmed our intention to amend the Medical Devices Regulations 2002 for Great Britain to incorporate EU Common Specifications for high-risk in vitro diagnostic (IVD) devices and to repeal regulations on Coronavirus Test Device Approvals (CTDA)."
        },
        {
            "text": "The government response to the consultations in July were positively welcomed by many stakeholders. We heard loud and clear the message from across consultees and we acted on these, confirming that we would consult on the indefinite recognition of CE-marked medical devices, and that we would repeal the CTDA regulations; two measures which could reduce regulatory duplication and burden on manufacturers considerably."
        },
        {
            "text": "Earlier in the month, government published the 10 Year Health Plan for England and the Life Sciences Sector Plan, two important documents that set out a vision for the UK’s medical devices regulatory system that combines international reliance and recognition routes with a domestic route to market focused on support for innovation. Having confirmed our approach to the first of these aims in the consultation response, at the very end of July we published a statement of policy intent setting out a key element of our proposed approach to the second: an early access service for innovative devices. The statement set out at a high level our policy intent for early access and the team has since been working hard to develop and flesh out this policy approach and will be reaching out to key stakeholders to develop it further in the new year."
        },
        {
            "text": "The early access service is a key element of our future enhancements work: policy development that will inform and shape future approaches to key attributes of our regulatory framework. August and September saw us publish two surveys aimed at gathering evidence to support policy development for two other elements of this work on future enhancements. The first of these asked for views on the Health Institution Exemption, an important exemption from the medical devices regulations for organisations that qualify as a ‘Health Institution’. The feedback we have received has informed updates to existing guidance on the exemption published this month and will support further policy developments next year. The second asked for stakeholder views on priority designated standards. The responses have supported us to identify the priority standards for designation in demonstrating conformity with the medical device regulations. We will publish the updated list in the coming weeks."
        },
        {
            "text": "September also saw the launch of the National Commission into the Regulation of AI in Healthcare. The Commission is packed with expertise on AI, health technologies, law, regulation, and the healthcare system and supported by specialist working groups with domain expertise. The Commission will work to develop recommendations to the MHRA for a future framework for the regulation of AI in healthcare. You can input directly to the work of the Commission through the new Call for Evidence up to 2 February. I would encourage you all to respond to influence this important piece of work!"
        },
        {
            "text": "The Commission’s work will also be informed by the outcomes of the second phase of the AI Airlock. In October, the Airlock team announced a new cohort of seven innovative AI technologies that would utilise the AI Airlock to explore key challenges with the regulation of AI as a medical device. The next phase of the Airlock will complete in March of next year and I am excited to see how the work will continue to drive forward innovative regulatory thinking in this space."
        },
        {
            "text": "November and December has seen a focus on two crucial pieces of work for our future framework. Firstly, finalising the legal text for the Pre-Market Statutory Instrument. The legal text details proposed changes to the regulatory requirements that must be met before a device can be brought to market. It will bring us in line with international best practice, respond to key patient safety concerns, and introduce new international reliance pathways. After years of work to get to this stage we will be delighted to publish the text on the WTO’s notification portal early in the new year alongside a survey to establish the business impact of the changes, and in doing so, we will be one step closer to laying the legislation in Parliament."
        },
        {
            "text": "The second crucial piece of work has been the drafting of the consultation on the indefinite recognition of CE marking, as we committed to in our response to the routes to market consultation. This will be a key opportunity for stakeholders to inform the approach that we will take to accepting CE-marked medical devices on the GB market. We will be publishing the consultation early in the new year."
        },
        {
            "text": "As I drafted this blog and selected the key pieces of work it highlights, it struck me just how much work the team has delivered this year. The outputs listed above are pivotal pieces of work but there is so much more. The enquiries we have responded to, the approvals we have processed, and the external meetings we have attended and presented at. This has been a truly remarkable year for the MHRA; one in which we have delivered more than enough to populate our own version of a ‘Top albums of the year’ list. I want to thank all the people at the MHRA who have contributed to this work, our partners across government, and our external colleagues for their support and engagement."
        },
        {
            "text": "Looking forward to next year, we have a lot to deliver, but doing so will ensure that UK patients will rapidly and safely benefit from the most innovative medical devices, and I relish the opportunity to work with such a wonderful team to deliver on this extremely important goal."
        }
    ]
}