{
    "url": "https://defrafarming.blog.gov.uk/2025/12/22/animal-welfare-strategy-for-england-published/",
    "title": "Animal Welfare Strategy for England published",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Animal Health and Welfare",
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2025-12-22T11:17:24+00:00",
    "content": [
        {
            "text": "The government has today launched the Animal Welfare Strategy for England."
        },
        {
            "text": "It sets out a comprehensive programme of reforms to improve the lives of millions of animals across England, from farm animals and pets to wildlife."
        },
        {
            "text": "In this post, we’ll summarise what this means for livestock keepers and the wider rural community. "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "With over 150 million farmed animals in England, animal welfare has significant implications for animal and human health, as well as for the economy. It is an issue that many people care deeply about.   "
        },
        {
            "text": "Plans for an animal welfare strategy were announced in 2024 by Baroness Hayman of Ullock. Since then, the government has worked with stakeholders to develop it. "
        },
        {
            "text": "Today’s strategy reinforces the UK’s long-standing commitment to high animal welfare standards. It takes a practical and proportionate approach that recognises the realities of farming and food production.  "
        },
        {
            "text": "We want to explore where these standards can be raised further.  "
        },
        {
            "text": "The strategy sets out what only the government can do, such as establishing a regulatory framework and providing a clear direction of travel. It also establishes the need to work in partnership with industry and others to collectively improve animal welfare, underpinned by effective enforcement.  "
        },
        {
            "text": "By improving animal welfare, we are supporting healthier, more productive livestock that delivers better outcomes for farmers, improves farm profitability, and strengthens food security. "
        },
        {
            "text": "This approach also supports the conclusions of the Farming Profitability Review, which highlights the importance of enabling farmers to earn fair returns from the market. "
        },
        {
            "text": "High animal welfare standards are a core strength of British agriculture and help to build trust with consumers, add value to food produced in England, and support strong domestic demand. "
        },
        {
            "text": "By protecting farmers from unfair competition while promoting the quality and integrity of British produce, we are helping to ensure that high standards translate into improved profitability and more resilient farm businesses. "
        },
        {
            "heading": 2,
            "text": "A joined-up approach to welfare and productivity "
        },
        {
            "text": "The Animal Welfare Strategy for England considers animal welfare in the round, recognising the close link between animal health, welfare and profit. "
        },
        {
            "text": "The strategy sets out reforms under 4 areas: "
        },
        {
            "text": "It complements the Animal Health and Welfare Pathway, which supports farmers with practical advice, vet input and funding to prevent disease, reduce antibiotic use and make ongoing improvements to animal health and welfare on farms. "
        },
        {
            "text": "The strategy includes plans to: "
        },
        {
            "text": "We will work closely with charities, farmers, vets, and industry to ensure these reforms are practical and deliverable, and that farmers are given enough time to adapt. "
        },
        {
            "text": "We recognise the potential for increased divergence between our standards here in the UK and those of other countries."
        },
        {
            "text": "We will always consider whether overseas produce benefits from an unfair advantage because it is not required to meet the same animal welfare, environmental, or other domestic standards as UK producers."
        },
        {
            "text": "We are prepared to take appropriate steps to protect our most sensitive sectors and uphold those standards where necessary. "
        },
        {
            "heading": 2,
            "text": "Animal welfare in rural communities  "
        },
        {
            "text": "The strategy also addresses the government's manifesto commitments, including:"
        },
        {
            "heading": 3,
            "text": "Banning the use of snare traps on wild animals "
        },
        {
            "text": "Banning the use of snare traps on wild animals means stopping the use of wire loops that tighten around an animal when it is caught, often leaving it injured or distressed for long periods. "
        },
        {
            "text": "This matters because snares can cause serious suffering and often catch animals they were not meant to, including pets and protected wildlife. Ending their use would improve animal welfare, reduce accidental harm, and help promote safer, more humane ways of managing wildlife in rural areas. "
        },
        {
            "heading": 3,
            "text": "Banning trail hunting "
        },
        {
            "text": "Trail hunting is a practice where hounds follow an animal scent, but it can be possible for them to pick up the scent of wild animals and chase or kill them.  "
        },
        {
            "text": "Ministers have confirmed their intention to ban trail hunting. The strategy commits to consult in the new year on how to deliver an effective ban. "
        },
        {
            "heading": 3,
            "text": "Introducing a close season for hares during breeding "
        },
        {
            "text": "We will be considering how best to bring forward a close season for hares. Introducing a close season for hares protects vulnerable leverets born above ground. Fewer leverets will be left motherless and vulnerable to starvation and predation.  "
        },
        {
            "text": "It encourages sustainable wildlife management by restricting control during the most sensitive breeding period and brings hares into line with conservation principles that already apply to many other species. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "The Animal Welfare Strategy for England sets a clear direction of travel, but many of the proposals will be taken forward through consultation and ongoing engagement with farmers and industry. "
        },
        {
            "text": "This includes further detail on reforms affecting livestock systems, alongside continued rollout of the Animal Health and Welfare Pathway to support improvements on farms. "
        },
        {
            "text": "From 22 January 2026, payments for the animal health and welfare review and the endemic disease follow-up will increase."
        },
        {
            "text": "Additionally, a recent update to the law means that farmers will soon have clearer and stronger legal protection against livestock worrying under the Dogs (Protection of Livestock) Act 1953.   "
        },
        {
            "text": "Farmers and stakeholders will have opportunities to share their views as consultations are launched and guidance is developed.  "
        },
        {
            "text": "We are committed to working closely with the sector to ensure changes are practical, proportionate and deliver real benefits for animal health, welfare and farm businesses. "
        },
        {
            "text": "To stay up to date with the latest announcements, consultations and support available, subscribe to the Farming blog. You’ll receive a notification as soon as we publish a new post.  "
        }
    ]
}