{
    "url": "https://aphascience.blog.gov.uk/2025/12/22/colorado-beetle-eradicated-in-the-uk/",
    "title": "Colorado beetle eradicated in the UK ",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2025-12-22T09:00:00+00:00",
    "content": [
        {
            "text": "Colorado beetle has officially been eradicated from the United Kingdom (UK)."
        },
        {
            "text": "And that is not just good news, it is fantastic news for our potato growers, gardeners, and allotment holders and it is a real boost for plant health and food security. "
        },
        {
            "text": "But before we break out the celebratory chips, let us take a moment to talk about why this matters, what it took to get here, and the incredible teamwork that made it happen. "
        },
        {
            "heading": 2,
            "text": "What is the big deal about Colorado beetle?"
        },
        {
            "text": "If you are not in the potato business, you might be wondering: What is all the fuss about a beetle? "
        },
        {
            "text": "Well, Colorado beetle is not just any beetle. It is a serious pest that poses a major threat to potato crops and several other plants, including tomatoes, aubergines, and peppers. These little striped invaders can completely strip the leaves from plants, reducing yields and causing significant economic damage if left uncontrolled. "
        },
        {
            "text": "The beetle is highly distinctive: orange-yellow in colour with 10 bold black stripes across its body. It does not pose a risk to human health, but it is a nightmare for farmers."
        },
        {
            "text": "That is why, when the first outbreak was detected in Kent in July 2023, alarm bells rang. We knew we had to act fast… and we did."
        },
        {
            "heading": 2,
            "text": "Outbreak to eradication"
        },
        {
            "text": "The story of eradication is one of determination, expertise, and collaboration."
        },
        {
            "text": "When the outbreak was confirmed, APHA operational teams swung into action. Our surveillance specialists worked tirelessly to track the beetle’s movements, while field teams hit the ground to contain and eliminate the pest. Every sighting was investigated, every lead followed up."
        },
        {
            "text": "Surveillance activities included regular inspections of the original outbreak fields and selected potato fields in Kent to rule out incursions from mainland Europe. We also kept a close eye on imported plant products as Colorado beetle has previously been detected on leafy vegetables, salad leaves, and fresh herbs."
        },
        {
            "text": "And it was not just APHA working alone. This was a true team effort involving Defra colleagues, the potato industry, and even members of the public who kept their eyes peeled for suspicious beetles."
        },
        {
            "text": "Thanks to this combined effort, we were able to stamp out the outbreak and prevent the beetle from spreading further."
        },
        {
            "heading": 2,
            "text": "Two years of vigilance"
        },
        {
            "text": "Eradication is not something you declare lightly. It takes time, patience, and proof."
        },
        {
            "text": "Since the last confirmed sighting, our teams have been carrying out extensive surveillance to make sure the beetle has not made a comeback. That means checking fields, monitoring traps, and staying alert for any signs of trouble."
        },
        {
            "text": "And here is the result: two years with no sightings. That is the gold standard for declaring eradication."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "Potatoes might seem humble, but they are a staple crop and a vital part of our food system. Protecting them from pests like Colorado beetle is essential for food security and for the livelihoods of growers across the country."
        },
        {
            "text": "By eradicating this pest, we have not only safeguarded the potato industry but also demonstrated the strength of our plant health system. It shows what can be achieved when science, operations, and collaboration come together."
        },
        {
            "heading": 2,
            "text": "A massive thank you"
        },
        {
            "text": "This success belongs to everyone who played a part, from the scientists who designed surveillance strategies to the field teams who carried out inspections in all weathers."
        },
        {
            "text": "It also belongs to our partners in Defra, the potato industry, and the public who reported sightings and supported our work."
        },
        {
            "text": "Plant health often operates behind the scenes, but moments like this deserve to be celebrated. So, to everyone involved: thank you. You have made a real difference."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "While we are thrilled to close the chapter on Colorado beetle, plant health is an ongoing challenge. New pests and diseases can emerge at any time, and climate change is altering the landscape in ways we are still learning to predict."
        },
        {
            "text": "That is why APHA will continue to invest in surveillance, research, and rapid response. Our goal is simple: to keep Britain’s plants healthy and resilient."
        },
        {
            "text": "And if you want to help, keep an eye out for unusual pests and report them through the usual channels. Together, we can keep our crops safe."
        },
        {
            "heading": 2,
            "text": "What to do if you spot one"
        },
        {
            "text": "Although Colorado beetle is now eradicated, vigilance remains key. If you find what you suspect to be a Colorado beetle in England or Wales, do not let it go. Capture it in a secure container and report it to APHA as soon as possible by:"
        },
        {
            "text": "Please include a photograph and location details with your report."
        },
        {
            "text": "So next time you tuck into a plate of chips, remember: behind every bite is a network of dedicated people working hard to protect our food. And today, thanks to their efforts, we can say goodbye to Colorado beetle. For good."
        }
    ]
}