{
    "url": "https://forestrycommission.blog.gov.uk/2025/12/22/oaks-and-invaders-why-protecting-our-iconic-oak-matters/",
    "title": "Oaks and invaders: why protecting our iconic oak matters",
    "authors": [
        "Sam Cooke"
    ],
    "categories": [
        "Tree health"
    ],
    "pub_date": "2025-12-22T09:00:00+00:00",
    "content": [
        {
            "text": "For centuries, the oak has stood at the heart of British identity – woven into our folklore, stitched into royal emblems and rooted deep in our landscapes. But this year marks an unwelcome anniversary: 20 years since the arrival of a small, silent invader: the oak processionary moth (OPM)."
        },
        {
            "heading": 2,
            "text": "Living landmarks throughout history"
        },
        {
            "text": "Throughout history, oak has held a sacred place in the human imagination. Ancient Druids worshipped in oak groves. Roman emperors and Celtic kings wore crowns of oak leaves as symbols of honour and strength. Couples were wed beneath ancient oaks, trusting in the tree’s longevity to bless their union."
        },
        {
            "text": "Said to be Robin Hood’s hideout, the veteran ‘Major Oak’ still stands tall in Sherwood Forest, whilst the ‘Royal Oak’ in Shropshire once concealed King Charles II, as he fled from Cromwell's men. Admired for their distinctive appearance, great size and long lifespans, these living landmarks are found and admired in deciduous woodlands, hillsides, ridgetops, parks and gardens across the country."
        },
        {
            "text": "The timber of these trees remains highly prized for its strength, durability and resistance to decay, and its value has been utilised for thousands of years in the construction of great ships, churches and cathedrals."
        },
        {
            "text": "It is also the crucial role oaks play in supporting biodiversity that inspires such reverence. Oak trees are home to an extraordinary diversity of life, supporting thousands of species, and provide essential ecosystem services, offering cooling shade, shelter from wind and rain and stabilising the soil with their root systems. "
        },
        {
            "text": "Squirrels and badgers feed on acorns, helping to scatter them far and wide. Bats roost in holes and under loose bark, banqueting on a plethora of insects alongside birds like the great spotted woodpeckers, nuthatches and treecreepers. Wild primroses, bluebells and wild garlic all rely on the rich soil beneath oaks to grow and thrive."
        },
        {
            "heading": 2,
            "text": "Growing threats to our oak"
        },
        {
            "text": "Today, however, our iconic oaks are facing a growing number of compounding threats, from climate change to invasive pests and diseases such as acute oak decline, weakening trunks and branches which is leaving trees vulnerable to further stress."
        },
        {
            "text": "One of the most concerning threats in recent decades has been the oak processionary moth. OPM caterpillars pose a serious risk to the health of oak trees and can be hazardous to the people and animals who come into contact with them."
        },
        {
            "heading": 2,
            "text": "What is oak processionary moth?"
        },
        {
            "text": "Native to central and southern Europe, the oak processionary moth (Thaumetopoea processionea) gets its name from the characteristic way their caterpillars march nose-to-tail in a hungry procession along oak trunks and branches. These caterpillars feed on oak leaves, sometimes causing alarming defoliation to host trees, and leaving them vulnerable to other pests, diseases or drought."
        },
        {
            "text": "But OPM is not just a threat to the health of trees. It also has the potential to cause health problems in humans and animals. The caterpillars are covered in thousands of tiny toxic hairs that can cause irritation to the skin, eyes and respiratory system. Reactions can range from mild rashes to breathing difficulties and eye irritations. These hairs can be carried on the wind or left behind in nests on tree trunks, which often persist long after the caterpillars have left."
        },
        {
            "heading": 2,
            "text": "20 years of dealing with oak processionary moth"
        },
        {
            "text": "This year marks 20 years since OPM first appeared in the UK. Found in south-west London in 2006, it is thought to have been accidentally imported on oak trees in 2005. Since then, the population has slowly expanded, particularly across Greater London and surrounding counties, despite sustained efforts to contain it."
        },
        {
            "text": "The Forestry Commission, alongside local authorities, landowners and tree care specialists, have been at the forefront of tackling OPM since its arrival. Over the past two decades, our response has involved a combination of surveillance, treatment, improving regulation and public awareness campaigns – monitoring outbreaks through trapping and inspection, targeted pesticide and nest removal programmes, tighter plant import controls and guidance to help the public identify and report sightings."
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "If you are in an area where oak processionary moth is known to be present, particularly in the south-east of England, your vigilance can make a big difference in the tracking and control of this pest."
        },
        {
            "heading": 3,
            "text": "Where to look for OPM"
        },
        {
            "text": "OPM feed on oak trees, including our native species English and sessile oak, as well as commonly found species like Turkey oak and the evergreen holm oak. Their nests can often be spotted on trunks and the undersides of branches. You can find where they are most commonly found in the UK on our OPM 2024 management zones map."
        },
        {
            "heading": 3,
            "text": "What to look for"
        },
        {
            "text": "You can usually spot OPM caterpillars in the spring, from May to July. They have dark grey bodies and black faces with long white hairs, and are often marching in their signature processions. Their nests, found in the summer, are white with silken trails leading to them, although they become discoloured and brown over time."
        },
        {
            "heading": 3,
            "text": "Don't touch"
        },
        {
            "text": "Never touch the caterpillars or their nests. Even old nests can contain harmful hairs. If you are in an area where OPM is present, keep children and pets away from infested trees."
        },
        {
            "heading": 3,
            "text": "How to report OPM sightings"
        },
        {
            "text": "You must report any oak processionary moth sightings via TreeAlert and include photographs. Or contact us at OPM@forestrycommission.gov.uk."
        },
        {
            "text": "As we mark two decades of dealing with OPM, the work is far from over. Climate change and global trade continue to create pathways for pests and diseases to arrive and spread. But through continued research, partnership and public engagement, we are committed to protecting the UK's oaks, and the rich ecosystems they support, for generations to come."
        }
    ]
}