{
    "url": "https://actuaries.blog.gov.uk/2023/12/19/adopting-tcfd-recommendations-in-the-public-sector-part-1/",
    "title": "Adopting TCFD recommendations in the public sector (part 1)",
    "authors": [
        "Will Stobbs - Senior Trainee Actuary"
    ],
    "categories": [
        "Climate change",
        "Finance"
    ],
    "pub_date": "2023-12-19T16:59:20+00:00",
    "content": [
        {
            "text": "I am writing this blog as we in the Government Actuary’s Department (GAD) are preparing to produce climate-related financial disclosures for the first time. So, I wanted to share some of the knowledge we’ve already built up."
        },
        {
            "text": "The Task Force on Climate-related Financial Disclosures (TCFD) published its final recommendations in summer 2017. Since then, organisations have been incorporating these into their business operations and reporting."
        },
        {
            "text": "In the UK (United Kingdom), the government has made this compulsory for some organisations. This requirement started with large public and private companies and has been gradually extending to more areas of the economy."
        },
        {
            "text": "The 2023 Green Finance Strategy committed central government departments (including GAD!) to a phased implementation of TCFD recommendations by 2025-26. Some government departments are ahead of this timeline, with UK Export Finance already including TCFD in its annual report and accounts."
        },
        {
            "heading": 2,
            "text": "Where to start?"
        },
        {
            "text": "Getting started with TCFD reporting is daunting with thousands of pages of resources across the 4 pillars of the framework:"
        },
        {
            "text": "With a bit of help this wealth of information can be turned into a positive and provide inspiration and aspiration for your disclosures."
        },
        {
            "text": "As well as this you won’t be starting from nothing as you will already meet some requirements through existing reporting or business processes."
        },
        {
            "text": "A good first step therefore is to undertake a gap analysis to help you to understand how your current sustainability reporting compares to the TCFD recommendations. You can then prioritise key areas of improvement and set realistic targets, subject to statutory deadlines."
        },
        {
            "text": "Organisations often develop their approach over multiple reporting periods."
        },
        {
            "text": "The phased implementation outlined by HM Treasury provides a pathway to implementation:"
        },
        {
            "heading": 2,
            "text": "Identifying best practice"
        },
        {
            "text": "Several reviews have identified the progress different organisations have made towards disclosing in line with the TCFD recommendations, as well as the ongoing challenges they face."
        },
        {
            "text": "The 2023 TCFD Status Report notes there has been an increased regulatory focus on climate-related disclosures made in financial statements."
        },
        {
            "text": "In the UK the Financial Reporting Council (FRC) published a 2023 thematic review of metrics and targets (the fourth pillar of TCFD). This report builds on the FRC’s 2022 thematic review of TCFD in the UK which identified metrics and targets as a key area for further progress."
        },
        {
            "text": "The 2023 FRC report found that despite incremental improvement, there is still a wide range in the maturity of such disclosures."
        },
        {
            "text": "The report highlights the importance of transparency in the reporting, including details of methodologies where not standard. Also discussed was the need to ensure metrics reported were company specific as appropriate and that they were used to effectively monitor progress towards targets."
        },
        {
            "text": "It’s generally accepted that implementing the TCFD recommendations into an organisation’s reporting requires work over multiple reporting periods; each year building on the lessons learnt."
        },
        {
            "text": "The 2023 FRC report acknowledges this. It notes that, in places, those disclosing for the second year had done some aspects better than those who were reporting for the first time."
        },
        {
            "text": "The Climate Disclosure Standards Board has also published a TCFD Good Practice Handbook which gives specific examples of how organisations have implemented the TCFD recommendations."
        },
        {
            "text": "The handbook provides some helpful commentary on the disclosures identifying best practice and areas for improvement."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "In part 2 of this blog series, which will come out in the new year, I will discuss some of the challenges organisations may face when implementing TCFD recommendations as well as information on how actuaries at GAD can help."
        },
        {
            "text": "If you have any questions or would like to discuss how GAD could support you and your organisation, please contact TCFD.support@gad.gov.uk."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}