{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/12/19/championing-kinship-care/",
    "title": "Championing kinship care",
    "authors": [
        "Hayley, Yvonne and Adelaide - kinship carers"
    ],
    "categories": [
        "Kinship care",
        "SEND & Alternative Provision",
        "Social work: the profession"
    ],
    "pub_date": "2023-12-19T14:47:26+00:00",
    "content": [
        {
            "text": "The National Kinship Strategy ‘Championing Kinship Care’ shines a spotlight on the incredible kinship carers - grandparents, aunts, uncles, siblings and wider family networks - that step up to provide loving homes to children who cannot live with their parents."
        },
        {
            "text": "In this blog Hayley, Yvonne and Adelaide share their personal experiences of being kinship carers, from overcoming bumps along the way to helping the children and young people thrive."
        },
        {
            "text": "Hayley  "
        },
        {
            "text": "We’ve been kinship carers to Harry for over eight years. There was a lot of delay and uncertainty for Harry in the beginning, which has had a huge long-term impact on him.  He has a disability which means he needs a lot of support and attends a special school part-time. Harry is not related to us; we were his mum’s boyfriend’s parents. He was placed with my husband and I at the age of two by children’s services, at 40 minutes notice, as his mum was having a mental health breakdown and needed medical attention. He arrived in a car seat, with very little else. We know now that this is the usual way that most kinship families are made – a loving response to a crisis situation."
        },
        {
            "text": "Our journey has been an incredible learning curve, and at times we were shocked by the complexity and overwhelming nature of the process of going through children’s services procedures and the court. Looking back, we would all have benefited from more support."
        },
        {
            "text": "Harrys’ older sister was brought up by his mum’s parents. From the beginning we worked together with them to ensure that Harry sees his mum, who now has ongoing treatment from mental health services, his sister, and the wider family, regularly. It just so happened that we were there for him at a time when he needed a family with the time and patience to meet his many needs. His Mum and Grandma often tell him that he’s lucky to have two mums and a dad. He knows he is so very loved. And isn’t that the most important thing in life?"
        },
        {
            "text": "Yvonne"
        },
        {
            "text": "My name is Yvonne and I’m a full-time kinship carer for my 12-year-old granddaughter, Caitlyn, who has high level, complex needs. She was placed in my care 4 months old. It became pretty evident at an early stage that she wasn’t meeting her development milestones. After seeking medical help, Caitlyn was diagnosed with FASD, ASD, ADHD, and developmental trauma and attachment."
        },
        {
            "text": "As a result of her diagnosis, I enrolled in multiple courses to learn more about her conditions and the special care that she requires. These really helped me feel in a better place to confidently meet all of her needs."
        },
        {
            "text": "My family unit faced many challenges due to court proceedings. My daughter choosing not to see Caitlyn also meant that we as a family have sadly lost a daughter and sister. However I must add, that despite our journey being full of bumps along the way, I wouldn’t change any of it."
        },
        {
            "text": "Caitlyn is now in a specialist setting, which is nurturing to her needs. It fills me with joy now, to see her absolutely thriving, because of the hard work and dedication I put into our lives to ensure she has the right support. I’ve also since used the knowledge I’ve collected along the way to volunteer with our local authority to help other parents / carers in a similar position."
        },
        {
            "text": "Adelaide "
        },
        {
            "text": "I’m Adelaide and I’m ‘mum’ to a wonderful 15-year-old boy with additional needs who I’ve cared for since he was 3. Biologically he is my great-great nephew. I have two adult daughters who are extremely supportive but as they live independently, he and I are the ‘team’."
        },
        {
            "text": "I became involved in his care proceedings at my family’s request. I supported his parents in every way possible. However, the court decided that he couldn’t be returned to them or placed with anyone else in our family. Suddenly, I was asked to turn my whole life upside down and care for him."
        },
        {
            "text": "It’s not been an easy journey and there many challenges along the way. I discovered Family Rights Group which has an excellent, free, and confidential advice line. Their support has been invaluable to me."
        },
        {
            "text": "If I had one piece of advice to give to a prospective kinship carer, as harsh as it may be, it would be that you have to be prepared to do it alone.  It’s great when others can help you, but life can get in the way and you may have days, months or even years, when no one is able to come and help you."
        },
        {
            "text": "Another essential point is that as a special guardian, you have to, “guard” your child against anything that might cause them harm.  Many of them have experienced early life trauma so it’s your responsibility to ensure as much as possible, that certain situations and contact with others is not re-triggering for them."
        },
        {
            "text": "But whenever I’m down, I look at him. He is imperfectly perfect, and I’m so glad I decided to care for him. He has definitely changed my life and hopefully, every single day I am positively changing his."
        },
        {
            "text": "Further reading"
        },
        {
            "text": "Read about the national Kinship Strategy ‘Championing Kinship Care’"
        },
        {
            "text": "The kinship care charity"
        },
        {
            "text": "Helping families Helping children - Family Rights Group (frg.org.uk)"
        },
        {
            "text": "The Family Justice Board"
        }
    ]
}