{
    "url": "https://educationhub.blog.gov.uk/2023/12/19/gender-questioning-children-guidance-schools-colleges/",
    "title": "Gender questioning children: Everything you need to know about new draft guidance for schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Colleges",
        "Schools"
    ],
    "pub_date": "2023-12-19T13:19:23+00:00",
    "content": [
        {
            "text": "In recent years, an increasing number of children have been questioning their gender. This is why we have published new guidance for teachers on how best to support these students in schools and colleges."
        },
        {
            "text": "In England, children can’t obtain a Gender Recognition Certificate so their legal sex will always be the same as their biological sex. There is also no general duty that says schools and colleges must support a child to take steps that are part of ‘social transition’ – such as agreeing to change their name or pronouns."
        },
        {
            "text": "This guidance is clear that schools and colleges have a duty to safeguard and promote the welfare of all children, which means that a cautious approach should be taken when responding to requests to social transition."
        },
        {
            "text": "Schools and colleges should create an environment that is respectful of all beliefs. This means no one should be expected to use preferred pronouns and they should not be sanctioned for making honest mistakes. In all cases, bullying must not be tolerated."
        },
        {
            "text": "While the guidance is there to help teachers, parents’ views should be at the centre of every decision schools make about their child."
        },
        {
            "text": "This is draft guidance for consultation and we would like to encourage schools, colleges, parents and the sector to share their feedback. The consultation will run for 12 weeks."
        },
        {
            "heading": 3,
            "text": "What does it mean for a child who asks to socially transition at school or college?"
        },
        {
            "text": "Teachers shouldn’t initiate or suggest to a child that they socially transition – they should begin to consider a request if a student has asked to do so."
        },
        {
            "text": "If a child does ask to socially transition, for example, to use a pronoun that is different to their biological sex, then teachers shouldn’t automatically agree."
        },
        {
            "text": "Parents have a right to know and teachers should discuss the child’s request with their parents or guardian and take into account their views, except in exceptional circumstances where this risks significant harm to the child."
        },
        {
            "text": "They should also consider whether it’s in their best interest, considering the wider context, including whether it will have an impact on the wider school, and allow a good amount of time  to think before rushing into a decision."
        },
        {
            "heading": 3,
            "text": "What about single-sex spaces like toilets and changing rooms?"
        },
        {
            "text": "It’s important that single-sex spaces such as toilets, showers and changing rooms, remain single-sex, and schools should continue to ensure children aged 11 or older should not be made to get changed or wash in front of children of the opposite sex."
        },
        {
            "text": "Schools and colleges should also not allow children to share a room overnight with those of the opposite sex."
        },
        {
            "text": "Where possible, schools and colleges should consider providing alternative facilities for gender questioning children who aren’t comfortable using the single-sex areas designated for their biological sex."
        },
        {
            "text": "These alternative facilities, however, should never undermine the single-sex facilities, for example a boy should never be allowed to go into a girls toilet, or vice versa."
        },
        {
            "heading": 3,
            "text": "How will this affect PE and sports?"
        },
        {
            "text": "It’s important that sports are safe and fair."
        },
        {
            "text": "Physical differences between children of different sexes should be considered in deciding who can take part in games so there is no risk of harm and it doesn’t make the competition unbalanced."
        },
        {
            "heading": 3,
            "text": "What if a school supports a child to change their name or pronoun?"
        },
        {
            "text": "These are significant decisions that impact both the child and those around them. As a result, particularly for pronouns, we expect changes to be rare."
        },
        {
            "text": "And even in these rare occasions, children and teachers shouldn’t be made to use ‘preferred pronouns’. Instead, alternatives should be found, such as using first names and bullying mustn’t be tolerated."
        },
        {
            "text": "Schools must still record a child’s legal name and sex in the admissions register."
        },
        {
            "heading": 3,
            "text": "How will this affect school uniforms?"
        },
        {
            "text": "Our guidance is clear that schools can set different uniforms for boys and girls and that, generally, gender questioning children should be held to the same uniform standards as everyone else."
        },
        {
            "text": "However, where a request is made, schools may agree to some flexibility having consulted with the child’s parents, especially given many schools already operate a unisex uniform policy."
        }
    ]
}