{
    "url": "https://socialcareinspection.blog.gov.uk/2023/12/19/how-the-childrens-social-care-reforms-will-affect-inspection/",
    "title": "How the children’s social care reforms will affect inspection",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "Care Review",
        "children's homes",
        "children's services",
        "kinship care",
        "local authorities",
        "social care regulation"
    ],
    "pub_date": "2023-12-19T10:00:49+00:00",
    "content": [
        {
            "text": "The Department for Education (DfE) has published several documents as part of the children’s social care reforms:"
        },
        {
            "text": "This blog will give some early views on what these will mean in practice and how they will affect inspection."
        },
        {
            "text": "We know you will be interested in how Ofsted will inspect in the coming months, while these changes are happening. Our inspections of local authority children’s services have always focused on the progress and experiences of children and families. That will not change."
        },
        {
            "text": "You should continue to make the best decisions you can for children through child-centred, family-focused work. We will continue to focus on the impact for children. We will continue to inspect against our framework, rather than any individual guidance."
        },
        {
            "text": "We have also discussed the publications with our partner inspectorates, and we all remain committed to the reforms as a tool for improvement."
        },
        {
            "text": "Alongside the publications, we also welcome the government’s response to the national panel recommendations about safeguarding disabled children. We must all learn from the awful abuse that happened at the Hesley schools. We will work with the government as they strengthen the whole system that safeguards children. And we welcome the opportunity to work with the CQC on improving the regulation of services. We will respond in June 2024."
        },
        {
            "text": "Impact on our inspections"
        },
        {
            "text": "Returning to the publications, they set out how the early implementation of the reforms will work. Our inspecting local authority children’s services (ILACS) framework, sets out what good looks like. And our overall definition of good has not changed. However, we will be re-balancing ILACS to reflect the reforms."
        },
        {
            "text": "This will be about language and emphasis rather than wholescale change. You can find out more for each of the new documents."
        },
        {
            "text": "The National Framework and CSC dashboard"
        },
        {
            "text": "The National Framework describes the outcomes that local authorities should achieve for children, young people and families. This fits well with how ILACS already describes positive experiences and progress for vulnerable children and their families. So, we will not be measuring compliance with the framework, but hope it helps you to deliver good services."
        },
        {
            "text": "The dashboard is a tool for local and national learning. We understand that all indicators need to be considered in context, not on their own. As is so often the case in children’s social care, data is the start of a conversation rather than a set of answers. So, the dashboard will not prompt an inspection, but it may help you to talk to inspectors about what is happening locally."
        },
        {
            "text": "Working Together to Safeguard Children"
        },
        {
            "text": "We know that local areas will be looking carefully at the changes to Working Together, making sensible decisions about how to help and protect children, with careful oversight of practice. Having the child’s welfare as the first principle sets the right context."
        },
        {
            "text": "We fully support focusing on and engaging with families. We already see this in many local areas. We will want to see how local areas are engaging with families and drawing on family networks to improve children's lives. And we want to see decisive practice when it is needed to protect children from harm."
        },
        {
            "text": "Inspectors will continue to focus on how arrangements for children in need have:"
        },
        {
            "text": "The additional guidance on supporting children at risk of, or experiencing, harm outside the home is helpful. But we do want to see clearer pathways for these children in the next review of Working Together. And we want to see greater clarity about what works."
        },
        {
            "text": "Children’s needs must be matched to practitioners with the right knowledge and skills, so children get the right help, at the right time. The new arrangements as to who can be the lead practitioner for children in need (under section 17 of the Children Act) are more explicitly permissive. But they will need to be overseen closely by leaders, including the multi-agency safeguarding arrangement. Appropriate and proportionate social work oversight in these arrangements remains important for children."
        },
        {
            "text": "We still see a lot of confusion and inconsistency around information sharing. There must be consistent understanding across all agencies and professionals of what can be shared, with whom, and when. There must be good systems for information sharing. And professionals must be knowledgeable about them and confident in using them."
        },
        {
            "text": "The Kinship Strategy"
        },
        {
            "text": "We welcome the focus on kinship and are pleased to see clarity on the regulatory framework for the approval of all forms of kinship care, which remain at the heart of inspectors’ evaluation of planning for children who can no longer live with their birth parents. The strategy aims to improve the help available for extended families who step in to care, and provide stability, for children. These families must have timely access to sensitive, proportionate, and wide-ranging support that meets their child’s needs. Many of these children will have had difficult experiences in their lives that are like those typically experienced by those who have entered the care system. That is why the emphasis on clarifying the kinship carer role to determine the right level of assessment and support is both important and welcome."
        },
        {
            "text": "ILACS inspections will continue to focus on the quality of support for children in kinship care. This reflects its status as the right path to permanence and stability for many thousands of children. We will be making some adjustments to language in the framework so that our existing practice is clearly labelled as kinship."
        },
        {
            "text": "Over the years, we have continued to see an improving picture of local authority practice. This is despite the disruption of the pandemic, sufficiency challenges and increasing demand. I have every confidence that the sector will use the reforms to improve further – maintaining a relentless focus on bettering children's lives, supporting children to be at home or in their wider family wherever possible and acting decisively where not."
        },
        {
            "text": "Next Steps"
        },
        {
            "text": "Please do read the publications and take the time to consider how they will be implemented in your area, but be reassured that Ofsted’s focus remains on evaluating the impact for children."
        }
    ]
}