{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/12/19/its-beginning-to-look-a-lot-like-christmas/",
    "title": "It's beginning to look a lot like Christmas",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Ageing",
        "Care and support",
        "Communities",
        "Guidance",
        "Mental health",
        "Our profession",
        "Recognition",
        "Recruitment",
        "Safeguarding"
    ],
    "pub_date": "2023-12-19T17:40:18+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Unified in helping others"
        },
        {
            "text": "As the year draws to a close, I find myself reflecting on the journey we have undertaken together over the last year. We have continued to relentlessly seek improvement in the health and wellbeing of individuals, families, friends and carers. We have done this in collaboration with our colleagues in the social care workforce who, together with us, work alongside people and communities to enable them to lead the best possible lives."
        },
        {
            "text": "We have benefited from the amazing leadership of our Principal Social Workers throughout the year and I want to thank them for the contribution and support they have given me and my colleagues in the Department of Health and Social Care (DHSC). Together with the Principal Occupational Therapists and people who have experience of drawing on care and support, they coproduced guidance for proportionate assessment approaches."
        },
        {
            "text": "They have also played a vital role in preparing for CQC assurance and have led on various webinars to support local authorities in their preparations. Recognition that strengths based professional practice is now front and centre of local authority approaches in responding to people’s need for care and support is really something to celebrate!"
        },
        {
            "text": "The Chief Social Worker for Adults office is now also providing support for the Principal Occupational Therapists Network and recognition of the contribution that OTs in social care make is well overdue."
        },
        {
            "heading": 2,
            "text": "Peace of mind"
        },
        {
            "text": "Jason Brandon has been an outstanding mental health social work lead in the CSW office and I want to thank him, especially for the work he has done with the sector on the Approved Mental Health Professional Workforce Plan and supporting and profiling mental health social work in key areas, both within DHSC and across the sector."
        },
        {
            "text": "Colleagues from the sector have helped improve approaches to safeguarding practice, including transitional safeguarding and working with people experiencing homelessness and multiple needs. This is an area where more improvement is always needed, as we respond to the changing landscape of needs and pressures that people face."
        },
        {
            "text": "We have also continued to provide support to retain and sustain the social work workforce, through provision of bursaries and placement fees, as well as the graduate scheme for mental health social work students, ThinkAhead."
        },
        {
            "text": "More and more employers are utilising the apprenticeship route to employ social work and occupational therapy trainees, who can work and gain a qualification. This is a ‘win win’ all round. Drawing our future workforce from local communities is vital if we are to improve retention and reflect the communities we serve."
        },
        {
            "heading": 2,
            "text": "Celebrating our value"
        },
        {
            "text": "Social work with adults doesn’t get the recognition it deserves, but I do think we have gained ground over the last decade, and I hope that more social work students will consider working in the varied settings where our practice is making a positive difference."
        },
        {
            "text": "Hospital discharge has been a priority for DHSC and I am clear that social workers working in hospitals, as part of multi-disciplinary support and decision making ,is vital if people are to receive the right help and that right time in the right place."
        },
        {
            "text": "Aligned with this area, social work with older people is increasingly important and as part of the National Institute for Health and Care (NIHR) research funding for social care, this area has benefited from research which illuminates what a difference our practice can make."
        },
        {
            "text": "We have made significant progress in investing in social work research, as well as growing our research capacity for social work, with a number of local authority social workers now benefitting from fellowships and PhD funding."
        },
        {
            "text": "I also want to give special thanks to Mark Osterloh who has supported me in managing and editing blogs on this site over the years. He has been amazing and I hope will support my final blog before I step down at the end of January."
        },
        {
            "heading": 2,
            "text": "Seasonal reflections"
        },
        {
            "text": "I have visited several social work teams and social care provision over the last couple of weeks and it was so lovely to see all the twinkly lights and festive decorations adding cheer to the early darkness as we approach the shortest day. I know how hard people have worked throughout the year and people are looking forward to much needed time out to have a bit of a break and enjoy festivities with friends and families."
        },
        {
            "text": "Of course, that always reminds me of those who continue working throughout the Christmas and new year period, especially social workers in out of hours teams, care workers continuing to support people every day and the ongoing care that family and friends provide to their loved ones."
        },
        {
            "text": "I'm also reminded that some people who need care and support are often without friends and family. Christmas can be a particularly difficult time of the year for those already experiencing some degree of loneliness or isolation."
        },
        {
            "text": "Many colleagues in social care often go beyond their normal duties to make sure people have festive food and companionship and I know many teams collect donations and deliver hampers and presents to people who may otherwise have nothing to open on Christmas day."
        },
        {
            "text": "So, whatever you are doing over the festive season, I want to wish you all a peaceful and happy time and to thank you being a vital part of social care and for all that you have done throughout the year. You are all helping people to live the best possible lives."
        }
    ]
}