{
    "url": "https://nationalscreening.blog.gov.uk/2023/12/19/three-chapters-added-to-uk-nsc-screening-manual/",
    "title": "Three chapters added to UK NSC screening manual",
    "authors": [
        "Miranda Lawton"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-12-19T10:41:07+00:00",
    "content": [
        {
            "text": "In October 2022, we published the UK National Screening Committee screening in healthcare manual."
        },
        {
            "text": "The manual gives an overview of best practice for implementing health screening programmes anywhere in the world."
        },
        {
            "text": "It initially comprised 5 core chapters:"
        },
        {
            "heading": 2,
            "text": "What’s new"
        },
        {
            "text": "In recent months we have added 3 more chapters to the manual:"
        },
        {
            "heading": 3,
            "text": "Screening quality assurance:"
        },
        {
            "text": "This chapter sets out the activities required to assess the quality of screening programmes, monitor compliance with standards and support quality improvement."
        },
        {
            "text": "It includes the principles of successful quality assurance (QA), screening QA functions, QA visits and learning from screening incidents."
        },
        {
            "heading": 3,
            "text": "Screening standards:"
        },
        {
            "text": "This chapter sets out the principles for developing, reviewing and publishing screening standards."
        },
        {
            "text": "Screening standards are a defined set of measures that providers must meet to make sure local screening services are safe and effective. They provide reliable and timely information about the quality of screening and support continuous improvement."
        },
        {
            "heading": 3,
            "text": "Screening glossary of terms:"
        },
        {
            "text": "This chapter lists clear and concise definitions of words and phrases that are used in relation to population, targeted and stratified screening programmes."
        },
        {
            "text": "The expanded manual is a helpful reference guide for policy makers, public health leaders, commissioners and screening stakeholders."
        },
        {
            "text": "We will continue to expand the resource over time to provide guidance on best practice for condition-specific screening programmes."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}