{
    "url": "https://cddo.blog.gov.uk/2025/03/12/community-connect-creating-data-community-cohesion/",
    "title": "Community Connect - creating data community cohesion",
    "authors": [
        "Rachael Richards, Data Community Lead, CDDO"
    ],
    "categories": [
        "Cross-government strategy",
        "Data",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-03-12T14:05:02+00:00",
    "content": [
        {
            "text": "The role of our data communities is fundamental to helping the government achieve the aims and aspirations for use of technologies such as AI, as set out in the government response to the AI Opportunities Action Plan. Community Connect was the first in-person meeting of data communities from across government on 10 February."
        },
        {
            "text": "130 data architects, data governance leads, programme directors, and heads of knowledge and information management came together from across government, along with members from a range of groups including AI for Government Knowledge and Information Management (GKIM) Cross-government Data Sharing Practitioners Community, and Data Sharing Network of Experts. "
        },
        {
            "text": "Jenny Brooker, GDS Chief Data Architect welcomed attendees by setting out the collaborative aim: “Today is about bringing us together, strengthening our collective voice, and hopefully starting to shape the future of government.”"
        },
        {
            "text": "She also acknowledged: “We are in a pivotal place for data, and there hasn’t been such a big movement behind it across government, since the launch of open data. AI is coming, and therefore data is more important than ever. We have a manifesto commitment to the National Data Library, and even having the word ‘data’ in the manifesto feels monumental. "
        },
        {
            "text": "“Communities need to get ready for these innovations, and through collective thought members can help navigate issues, shape good practice, and agree how your organisation will adopt AI.”"
        },
        {
            "heading": 3,
            "text": "Getting ourselves ready for the future"
        },
        {
            "text": "We need to nurture civil service talent and encourage cross-government training to implement ‘cross-economy AI adoption’ and encourage the public sector to ‘pilot and scale AI products and services and encourage the private sector to do the same’ and with this in mind we hosted a panel session to discuss with our communities what we can all do for us and our data to be ready for these opportunities."
        },
        {
            "text": "Peter Kyle, the Secretary of State for Science, Innovation and Technology, recently launched the blueprint for modern digital government. This tactical plan sets out the vision for the future of digital government over the next ten years. It emphasises the need to build communities of practice, and outlines how we must create  centres of expertise involving practitioners across government, in particular in AI, risk and resilience, service delivery and data. The power of communities and collective thinking can’t be underestimated, and these hubs for specialists will help deliver a modern digital government. "
        },
        {
            "heading": 3,
            "text": "Common themes in community meetings"
        },
        {
            "text": "Communities of practice ran individual breakout meetings. These provided a forum to reflect on improving data practices across government departments. Some of main themes raised were:"
        },
        {
            "heading": 3,
            "text": "Cross departmental collaboration"
        },
        {
            "text": "Matt Thompson, Head of Data Strategy at the UK Health Security Agency, stated:"
        },
        {
            "text": "“The Data Maturity Community shared success stories around business areas taking ownership of their data maturity action plans, linking data challenges to risks and operational delivery, and funding training programmes."
        },
        {
            "text": "“The public sector is an enormous, data-rich world full of talented people working hard to solve very similar problems, however we are all siloed. We all need to be better at breaking out of our bubbles, building our networks, sharing and learning, not just from colleagues in our own specialisms, but from other expert communities as well.”"
        },
        {
            "heading": 3,
            "text": "Training and guidelines"
        },
        {
            "text": "Firoze Salim, Head of Frameworks and Standards at the GDS, discussed the ongoing struggle to align departmental objectives with available resources. He remarked:"
        },
        {
            "text": "\"The Data Sharing Practitioners Community discussed how aligning departmental objectives with available resources is a constant challenge. Training for effective data usage is crucial for progress. Members agreed that they all need clear guidance on AI integration, consistent data language, and recognition of data’s strategic value by senior leadership.\""
        },
        {
            "heading": 3,
            "text": "Risks of AI"
        },
        {
            "text": "Alex Smith, Head of Data Security at GDS, highlighted the need to recognise the risks associated with AI technologies and the importance of sharing best practices across departments, indicating a cautious approach to technological advancements. "
        },
        {
            "heading": 3,
            "text": "Challenges in data sharing"
        },
        {
            "text": "Murat Soncul, Head of Privacy and Data Protection at GDS, pointed out the challenges related to data sharing, including issues of funding, resource allocation, and the need for common data models. "
        },
        {
            "heading": 3,
            "text": "Save the date for future events"
        },
        {
            "text": "Community members from across-government are invited to attend upcoming in person and virtual events to upskill, share best practice, showcase innovation, and debate challenges. Future diary dates to note are: "
        },
        {
            "heading": 3,
            "text": "Community Connect North"
        },
        {
            "text": "Calling all public sector data professionals who struggled to attend Community Connect in London, you are now invited to register for Community Connect North. The northern version of the all data communities meet-up will be held in Manchester city centre, during June. "
        },
        {
            "text": "The venue and agenda are being finalised.The afternoon event will follow a similar agenda to Community Connect. It will offer the same in person networking opportunities and opportunity to hear from a panel of senior guests. To register your interest for Community Connect North please complete this form on Hopin."
        },
        {
            "heading": 3,
            "text": "DataConnect25"
        },
        {
            "text": "Now in its fourth year, DataConnect25, government’s largest virtual data conference, will move from September to November. To attend DataConnect, please register on Hopin. In September, we will launch this year’s themes, and open up submissions for civil servants to propose a session or panel discussion."
        }
    ]
}