{
    "url": "https://socialcareinspection.blog.gov.uk/2025/03/12/how-local-authorities-can-help-young-carers/",
    "title": "How local authorities can help young carers",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "inspectors",
        "local authorities"
    ],
    "pub_date": "2025-03-12T10:51:23+00:00",
    "content": [
        {
            "text": "Today is Young Carers Action Day, an annual event organised by Carers Trust to call for better support for young carers."
        },
        {
            "text": "Just over a year ago, we amended our inspections of local authority children’s services (ILACS) to help inspectors and local authorities refocus on the experiences of young carers. In this blog, we will discuss what those inspections have found."
        },
        {
            "text": "Since the beginning of 2024, we have inspected 48 local authorities and talked about young carers in 38 of those inspection reports. This doesn’t mean we didn’t look at young carers in the other 10 inspections. We report on strengths and areas for improvement, so sometimes things may have just been ‘middling’ or ‘okay’ so we wouldn’t go into as much detail."
        },
        {
            "text": "Our inspectors want to see whether young people are identified as young carers and whether, as a result, they receive the help they need to achieve sustainable progress."
        },
        {
            "heading": 2,
            "text": "How the best local authorities are helping young carers"
        },
        {
            "text": "First, I want to talk about the strengths we’ve seen in the best performing local authorities that are making a real difference for their young carers."
        },
        {
            "text": "We saw a comprehensive support offer for young carers through a range of activities, groups and one-to-one sessions. This helps young people understand their own needs alongside the needs of the person they are caring for and provides time away from their caring tasks. Senior leaders have strategies that have improved how they identify and support young carers."
        },
        {
            "text": "In some local authorities, increasing numbers of young carers benefit from innovative, holistic early help provided through family hubs. These hubs offer a wide range of early help tailored to the specific needs of children and their families. Young carers receive bespoke individual support alongside group work, allowing them to meet others with similar experiences and share their views with council leaders. Assessments are tailored to the needs of young carers, whatever their age. Professionals understand and address their specific situations."
        },
        {
            "text": "We also saw young carers benefit from a range of commissioned services. These include personal budgets for short breaks and recreational activities, as well as carers’ groups that provide opportunities for fun and skill development."
        },
        {
            "text": "Young carers are supported by a range of professionals, including social workers and youth engagement workers, who provide timely and effective support. This coordinated approach improves children's welfare and, importantly, their attendance and progress at school, which is great news."
        },
        {
            "text": "It is great to report that young carers have access to a wide range of activities, including school holiday clubs, residential holidays, therapeutic support, and enrichment activities. These activities help reduce isolation and increase resilience."
        },
        {
            "heading": 2,
            "text": "What other local authorities need to work on to help young carers"
        },
        {
            "text": "Unfortunately, the story is not always so positive. In these local authorities, inspectors focus on what children’s services need to do to make things better for young carers."
        },
        {
            "text": "Some support services for young carers are underdeveloped, which leads to inconsistencies in the quality and availability of support. There is a lack of awareness of young carers, and this means they are sometimes not identified. If children with caring responsibilities are not recognised as young carers, they cannot receive the support they need."
        },
        {
            "text": "The quality of assessments for young carers varies significantly. Some assessments are not timely, and some do not adequately reflect the children's roles and the impact of their caring responsibilities on their needs."
        },
        {
            "text": "There is not enough oversight of the delivery of services for young carers. This means local authorities cannot understand what impact these services have on the children's lives."
        },
        {
            "text": "Due to increased demand, some families experience delays in receiving support. This can leave young carers without the help they need for long periods. Some children are left at risk because their needs have not been assessed well enough, which means those needs are not met."
        },
        {
            "text": "Many of these local authority children’s services recognise that they need a cultural change in order to create the best conditions for effective practice and support for young carers. Inspection has a part to play but ultimately the responsibilities sit with local authorities to support young carers well."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "Finally, I’d like to wish you all the best with raising awareness and advocating for change on this day. I know many of you are in London today making sure MPs hear your important views."
        },
        {
            "text": "I know you will be doing this not only for yourselves, but because you are absolutely dedicated to making sure services for future young carers are the very best they can be."
        },
        {
            "text": "Very well done to all of you and thank you."
        }
    ]
}