{
    "url": "https://ukhsa.blog.gov.uk/2025/03/12/nanoplastics-are-everywhere-what-is-the-health-impact-of-these-tiny-particles/",
    "title": "Nanoplastics are everywhere: what is the health impact of these tiny particles?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2025-03-12T12:50:31+01:00",
    "content": [
        {
            "text": "Nanoplastics are plastic particles smaller than 1,000 nanometers in diameter, or 100 times smaller than the diameter of a human hair, and they are polluting our environment and our food, to the extent that they are now being found in human blood, lungs, placenta, and even breast milk. "
        },
        {
            "text": "The study of microplastics is still a relatively new field. In this blog post we’ll explore how scientists are investigating the effects nanoparticles are having on the human brain and its defences."
        },
        {
            "text": "It's estimated that microwaving food in plastic containers for 3 minutes could release as much as 4 billion nanoplastic particles from one square centimetre of plastic."
        },
        {
            "heading": 2,
            "text": "The blood brain barrier: our brain's defence system"
        },
        {
            "text": "The blood brain barrier (BBB) is the thin shield around the brain that protects against threats like bacteria, toxins and chemicals. At the same time, the barrier allows oxygen and nutrients to pass through tiny holes guarded by specialist cells."
        },
        {
            "text": "Nanoplastics are so incredibly small that they can slip past these defensive cells, known as pericytes, or hitch a ride on nutrients making their way to the brain. These pericyte cells primarily help to maintain the barrier and clear toxins that threaten the brain."
        },
        {
            "heading": 2,
            "text": "Potential links to neurodegenerative diseases"
        },
        {
            "text": "Diseases such as Alzheimer’s and Parkinson’s disease are associated with dysfunction in pericyte cells, which raises the question as to whether miniscule pieces of plastic, or a build-up of them in these cells, could bring about similar diseases. A question scientists are investigating."
        },
        {
            "heading": 2,
            "text": "Nanoplastic research project"
        },
        {
            "text": "To study potential effects of plastic particle exposure on pericytes, scientists made their own particles, similar to those widely used for food containers and drink bottles."
        },
        {
            "text": "Human brain pericytes grown in the lab were exposed to chronic levels of nanoplastic particles, concentrations 31.25 times higher than normally detected in the blood, for 3, 6 and 10 days. These high levels were used to replicate the potential exposure and accumulation of nanoplastics at the BBB over time."
        },
        {
            "text": "As nano particles are so incredibly small, we worked with scientists at Arts et Metiers, Institute of Technology, Paris, and Glasgow University who used 3 cutting-edge techniques to monitor the concentration and molecular make-up of plastic particles in the pericytes."
        },
        {
            "text": "Fourier-transform infrared spectroscopy, thermogravimetric analysis, and differential scanning calorimetry (DSC) help scientists take precise measurements of microscopic light levels and temperature changes.  "
        },
        {
            "text": "These measurements were then used to assess whether PET particles can lead to oxidative stress - a build-up of waste in the cell; and whether this build-up of waste damages the mechanism in each cell which generates energy. Damage to the powerhouse of the cell - the mitochondria - and a lack of energy means the eventual the death of the cells and a deterioration in brain function."
        },
        {
            "heading": 2,
            "text": "Research findings and future directions"
        },
        {
            "text": "The study demonstrated that human pericytes grown in the lab exposed to high levels of PET nanoplastics over 3 days, slowed down mitochondrial functions. Interestingly, it also showed a recovery of the mitochondrial functions from 6 days until the 10-day exposure timeline tested."
        },
        {
            "text": "More research is needed to understand the full extent of chronic exposure to PET nanoplastic particles and the mitochondrial function recovery in human pericytes cells."
        }
    ]
}