{
    "url": "https://healthmedia.blog.gov.uk/2025/03/12/nhs-patient-screening-invitations-what-you-need-to-know/",
    "title": "NHS Patient Screening Invitations: what you need to know",
    "authors": [
        "cnewton"
    ],
    "categories": [
        "Cancer"
    ],
    "pub_date": "2025-03-12T09:26:21+00:00",
    "content": [
        {
            "text": "You may have heard that a small minority of people have not been invited to screening appointments because of an error in how GP offices have registered them."
        },
        {
            "text": "This issue affects screening invitations for bowel cancer, breast cancer, cervical cancer, and abdominal aortic aneuryism screening. Other screening programmes have not been impacted."
        },
        {
            "text": "Since this issue was spotted, we have worked with NHS England to quickly resolve the underlying issue and put a plan in place for those affected."
        },
        {
            "text": "From this week, everyone affected by this issue will receive a letter with more information on how to access their missed screening and the support that available for those affected.  "
        },
        {
            "text": "We understand this may be unsettling news, and that you may have some questions. We hope this post helps answer some of those questions."
        },
        {
            "text": "Have I or someone I know been affected?"
        },
        {
            "text": "NHS England has now identified all of the people that have been affected by this issue and their addresses."
        },
        {
            "text": "Anyone that has been affected will receive a letter from the NHS, which will include information on how to book a missed screening appointment or access the relevant services."
        },
        {
            "text": "If you have any concerns about this issue, NHS England’s dedicated helpline is available Monday to Friday, 9am-5pm at 0345 877 8962."
        },
        {
            "text": "I haven’t received a letter, but I think I have missed an invitation?  "
        },
        {
            "text": "Everyone who has been affected will be contacted via letter by the end of next week, to the address held by their GP."
        },
        {
            "text": "If you think you have missed an invitation and have not received a letter, please contact your GP practice directly."
        },
        {
            "text": "Which screening programmes have been affected?"
        },
        {
            "text": " We can confirm that only a small minority of patients eligible for the following screening programmes have been affected:"
        },
        {
            "text": " Other types of screening programmes have not been affected."
        },
        {
            "text": " Why did this happen?"
        },
        {
            "text": " The error behind this problem occurred when patients had registered at a new GP practice and key data relevant for screening was not entered or was incorrect."
        },
        {
            "text": "A patient was not informed of this error, and it did not affect their access to other NHS services because the issue only relates to a validation process specific to transferring patient details to the NHS screening IT system."
        },
        {
            "text": "NHS England has assured us that this issue has now been rectified and that incomplete or inaccurate data will be flagged and corrected promptly."
        },
        {
            "text": "We are working closely with GP practices and regional health providers to ensure records are kept accurate up to date."
        }
    ]
}