{
    "url": "https://nationalscreening.blog.gov.uk/2025/03/12/sma-screening-ise-partnership-board-update-february-2025/",
    "title": "SMA Screening ISE Partnership Board update February 2025",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General",
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2025-03-12T15:08:27+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) and partners continue to work on the planning of an in-service evaluation (ISE) of newborn screening for spinal muscular atrophy (SMA)."
        },
        {
            "text": "Results from the ISE, along with a new SMA screening modelling study for the UK screening context, will inform the UK NSC’s recommendation on whether SMA, a rare inherited condition, should be added to the newborn blood spot (NBS) screening programme. The ISE will also help to inform any future newborn screening arrangement so it optimises newborn screening for SMA to ensure the best possible outcome for patients and families."
        },
        {
            "text": "The SMA Screening ISE Partnership Board, which is overseeing the planning of the ISE, met on 18 February. Board members include screening experts from the 4 UK governments and NHS’s, the National Institute for Health and Care Research (NIHR), organisations with a shared interest in newborn screening for SMA, clinicians, academics, genomic experts and parent, patient and public voice members."
        },
        {
            "text": "The NIHR Health Technology Assessment (HTA) brief for the research component of the ISE has been approved in principle. "
        },
        {
            "text": "The Sheffield Centre for Health and Related Research (ScHARR) provided an update on the new modelling study it is developing into SMA screening for the UK context. The ScHARR team, which presented encouraging interim results to the UK NSC’s fetal, maternal and child health (FMCH) sub-group in November, is now focusing on completing the model and incorporating stakeholder feedback. Caveats and uncertainties include the cost of treatment, the long-term benefits for children and families and that 2 SMA drug treatments are available under a National Institute for Health and Care Excellence (NICE) managed access agreement (MAA) at present."
        },
        {
            "heading": 2,
            "text": "News from expert sub-groups and partners"
        },
        {
            "text": "The chairs of the partnership board’s 3 expert sub-groups gave updates on their respective workstreams."
        },
        {
            "text": "Rachel Knowles reported that the data and methodology sub-group had reviewed the research brief in light of ScHARR’s interim findings to ensure requirements for the ISE remain accurately described."
        },
        {
            "text": "Laboratory sub-group chair Prof Jim Bonham explained that 6 English newborn screening laboratories are offering Severe Combined Immunodeficiency (SCID) testing using a multiplex PCR technology. These 6 labs are in a good position to begin testing for SMA and together could test samples from approximately 370,000 births per year. He explained that the ISE would provide a good opportunity to optimise the screening pathway to ensure that the best health outcomes could be gained from treatment.  "
        },
        {
            "text": "Clinical pathway sub-group chair Dr David Elliman shared the sub-group’s draft screening pathway. Steps needing further clarification include information given at the point of first contact with parents of babies where SMA is suspected, clinical management if SMN2 copy numbers are not available at the first clinical visit and defining where the screening pathway ends and the care pathway takes over. A smaller task and finish group has been working on information for parents and staff training materials. First drafts have been shared for comment with the clinical pathway task and finish group, prior to wider consultation."
        },
        {
            "text": "Partnership board chair Prof Anne Mackie informed the board that the UK NSC secretariat continues to engage with NICE about the MAA for 2 of the  SMA drug treatments. NICE’s revised evaluation of these treatments is estimated to report at the start of 2026."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}