{
    "url": "https://cspl.blog.gov.uk/2025/03/12/the-seven-principles-of-public-life-reflections-during-30th-anniversary-year/",
    "title": "The Seven Principles of Public Life: Reflections During 30th Anniversary Year",
    "authors": [
        "Sir Laurie Magnus"
    ],
    "categories": [
        "30th Anniversary",
        "Ministerial Code",
        "Nolan Principles"
    ],
    "pub_date": "2025-03-12T11:29:36+00:00",
    "content": [
        {
            "text": "To mark the 30th anniversary of the Nolan Principles, the Committee will be publishing a new series of blogs about the work of a range of standards bodies in England. Our third blog is from Sir Laurie Magnus CBE, Independent Adviser on Ministerial Standards."
        },
        {
            "text": "Independent Adviser on Ministerial Standards"
        },
        {
            "text": "The role of Independent Adviser to the Prime Minister on Ministerial Standards (“IA”) has existed with various titles since 2006."
        },
        {
            "text": "The IA’s principal duties are to advise ministers on the management of their financial and other interests in the context of their portfolio responsibilities and to advise the Prime Minister on ministers’ compliance with the Ministerial Code (“Code”). The Code is issued by the Prime Minister and, whilst he is always accountable to Parliament, it is his absolute prerogative, to advise The King on who serves as ministers in HM Government. The IA therefore has never had any power beyond the parameters approved by the Prime Minister, but it is significant that those parameters have been materially broadened during the last five years, with greater public awareness of the IA’s status."
        },
        {
            "text": "Debate continues as to whether, in the light of recent political upheavals, it remains appropriate for officer-holders such as the IA to draw their authority solely from the Prime Minister and not to have some form of statutory footing. The IA now has the power unilaterally to initiate investigations of ministers in relation to their compliance with the Code, including their adherence with the Seven Principles of Public Life, and importantly demonstrating exemplary leadership and setting “the tone from the top”. The IA can also require that any resulting advice to the Prime Minister is published. This independence and transparency is very significant but, as Head of the Executive, it is solely the Prime Minister’s decision as to the outcome that follows such advice. Of course, the IA would have the option to resign if his advice is overruled, but the Prime Minister has the final word, as arbiter of ministerial conduct, albeit remaining ultimately accountable to Parliament."
        },
        {
            "text": "It is not my place to express a preference between a statutory and the current non-statutory framework for the IA, but I consider that the status quo is effective, particularly where the Prime Minister remains demonstrably supportive and the IA can genuinely “speak truth unto power”."
        },
        {
            "text": "How then do I see my role in the context of CSPL’s aspirations? Opinion polls in recent years have shown low levels of public trust in politicians, including ministers, with the risk that people are deterred from becoming involved in political activity and public life. This perception, which is distorted by the actions of a small minority and also the changing nature and polarisation of political discourse, differs markedly from what I believe to be the reality based on my interaction with ministers. Since my appointment in December 2022, I have found that the holders of ministerial office in general understand the privilege of their positions, recognise their responsibilities under the Ministerial Code and are diligent in upholding high standards of behaviour. My job is to advise the Prime Minister and, where appropriate, his ministers to ensure good practice and thereby, with others responsible for upholding standards in public life, to help move the dial of public confidence in a more positive direction."
        },
        {
            "text": "Sir Laurie Magnus"
        }
    ]
}