{
    "url": "https://naturalengland.blog.gov.uk/2025/03/12/tracking-jack-snipe-our-quest-to-understand-the-uks-most-elusive-bird/",
    "title": "Tracking Jack Snipe: Our quest to understand the UK’s most elusive bird",
    "authors": [
        "Kevin Clements"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Monitoring",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Wildlife"
    ],
    "pub_date": "2025-03-12T13:57:14+00:00",
    "content": [
        {
            "text": "By Kevin Clements, West Midlands Area Delivery Team"
        },
        {
            "heading": 4,
            "text": "The project"
        },
        {
            "text": "The Jack Snipe is probably our most elusive and least understood bird. But a Natural England project aims to change that."
        },
        {
            "text": "It’s small and secretive bird which, arguably, a lot of people won’t have heard of let alone been lucky enough to see. So, I consider myself extremely lucky to be leading a project to understand its habits and movements. "
        },
        {
            "text": "Breeding in northern Eurasia, Jack Snipe are a winter visitor to the UK, being present mostly from September to April. They prefer marshes, wet grasslands and the muddy fringes of reedbeds, but will also feed overnight in fields of short grass or stubble, feeding feasting on insects, worms and snails."
        },
        {
            "text": "An estimated 110,000 Jack Snipe winter across the UK, making them one of our most widespread and numerous visitors, but due to their secretive and nocturnal nature this population estimate is deemed unreliable. However, with Natural England’s input and advancing technology, our understanding of them is improving. "
        },
        {
            "text": "From 2000 to 2015, on average fewer than 120 Jack Snipes were caught and ringed across the UK each year. With the advent of thermal imaging cameras making detection of birds both during the day and night much easier, the annual average of birds ringed has since increased to over 420, with a record 738 in 2023. However, up to 2023, just 121 birds had been recaught and only 21 of those abroad. So, very little is known about their migration routes and choice of stopover sites."
        },
        {
            "text": "In 2023/24, Natural England funded ten archival GPS tags (accurate to ten metres) to be fitted to Jack Snipe at two sites in the Midlands Heathland Heartland project area in south Staffordshire. The use of such tags on Jack Snipe had not been attempted before in the UK."
        },
        {
            "text": "Working in partnership with the British Trust for Ornithology, Belvide Ringing Group, Game and Wildlife Conservation Trust and University Centre Sparsholt (University of Portsmouth), the aims of the project are to investigate winter foraging and day roosting behaviour, habitat use and migration strategies of Jack Snipe."
        },
        {
            "text": "By identifying important feeding, roosting and stopover sites, we hope to provide evidence to inform landscape scale conservation and nature recovery.  For example, by assessing their habitat requirements, we will be able to enhance and create sites to better benefit Jack Snipe and other wildlife."
        },
        {
            "heading": 4,
            "text": "Our Findings"
        },
        {
            "text": "Two birds were recaught at the same sites where they were tagged, six and thirteen days after tagging. Both birds roosted each day at the same site, but they visited two or three different feeding areas, visiting the same field(s) for up to four nights in a row, before visiting another area and sometimes returning to a previous field on a later night. "
        },
        {
            "text": "For the first time, this indicated that birds habitually returned to the same roosting and feeding sites, giving an insight into how birds wintering in the UK use their local landscape."
        },
        {
            "text": "In December 2024, we recaught another tagged bird - this time one that had migrated to its breeding grounds and returned to winter in Staffordshire. Unfortunately, the tag battery failed on the bird’s outward migration, but it did reveal for the first time the migration route of a UK Jack Snipe."
        },
        {
            "text": "Having wintered in south Staffordshire, regularly roosting at the same wetland (occasionally elsewhere and once on Cannock Chase) and feeding in local grass and stubble fields, it flew overnight in mid-April to a wetland in Essex."
        },
        {
            "text": "The next day it had flown to Germany and the day after that to Poland, having flown over 1,000km in three days. It stayed there for a further 15 days, rebuilding its energy reserves, before flying to another site in Poland and two locations in Latvia by the end of the next day, when the signal was lost. The bird was still migrating and would no doubt have continued north-eastwards into Russia."
        },
        {
            "heading": 4,
            "text": "Next steps"
        },
        {
            "text": "This is not the end of the story, as there are still other tagged birds out there. Furthermore, we have secured further funding through the Midlands Heathland Heartland project, West Midland Bird Club, Hampshire Ornithological Society and University Centre Sparsholt for another 40 tags."
        },
        {
            "text": "These include a brand-new design that will allow us to download data remotely rather than having to recatch the birds, which should provide us with even more information about their local and migratory movements and habitat requirements."
        },
        {
            "text": "We hope to calculate how many Jack Snipe each site could support and undertake habitat assessments, which can be applied to other sites across the country and thereby potentially extrapolate a more accurate picture of the population and distribution of Jack Snipe in the UK."
        },
        {
            "text": "Watch our BBC Breakfast clip below to learn more about the project!"
        }
    ]
}