{
    "url": "https://food.blog.gov.uk/2025/03/12/understanding-the-true-burden-of-infectious-intestinal-disease-in-the-uk/",
    "title": "Understanding the true burden of Infectious Intestinal Disease in the UK",
    "authors": [
        "Aileen Mill, Professor of Modelling, Evidence and Policy. Newcastle University. Principal Investigator on the third study of infectious intestinal disease (IID3)"
    ],
    "categories": [
        "Foodborne disease",
        "Science"
    ],
    "pub_date": "2025-03-12T15:47:24+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The third study of infectious intestinal disease (IID3) aims to quantify the rates of infection reported across primary care and NHS 111/NHS 24 call services and quantify the level of underreporting in order to make new estimates of the true rates of IID infections across the UK."
        },
        {
            "heading": 4,
            "text": "How many people in the UK get norovirus?"
        },
        {
            "text": "Since December it seems that there hasn’t been a week go by without hearing of someone being off work sick with 'noro'. Are these poorly friends and colleagues self-diagnosing and using a catch all term to describe a bout of illness? Or have they had a formal diagnosis of norovirus from a medical professional?  Perhaps they have consulted NHS 111/NHS 24 or have been to their GP and had a stool sample submitted for testing and had a positive result?  "
        },
        {
            "text": "There are a range of reasons why a person may, or may not, seek medical advice when they have a 'stomach bug'. However not knowing how many do and don’t seek medical attention makes it difficult to estimate the scale of the problem.  Understanding the true burden of infection (or cost inferred from missed work days) is important and will inform what we can do about it (read more in the why IID research matters blog)."
        },
        {
            "heading": 4,
            "text": "Understanding infectious intestinal disease reporting in the UK"
        },
        {
            "text": "The IID3 study isn't just looking at norovirus, although this pathogen is the third most common pathogen being detected in our study samples. Our study is being supported by over 8,000 volunteer participants who are alerting us when they have diarrhoea and vomiting symptoms - typical of IID. These participants have enrolled through their GP practice and are recording their symptoms using a specially designed app (read more about this on the IID3 technology blog) to report if they become ill.  "
        },
        {
            "text": "To date we have analysed over 3,000 stool samples to identify the array of pathogens that are making people ill. We will compare the results from our study of participants’ samples with those reported through regular routes such as visits to the GP or calls to NHS 111 (NHS 24 in Scotland) and records in national surveillance laboratories over the same period to determine the true rates of underreporting at each stage."
        },
        {
            "heading": 4,
            "text": "Sample testing"
        },
        {
            "text": "The IID3 study is collecting participant data from Sept 2023 - August 2025. So far diarrhoeagenic Escherichia coli (enterotoxigenic, enteropathogenic & enteroaggregative strains), Campylobacter, norovirus, Clostridium perfringens (toxin positive) and sapovirus are among the mostly commonly detected pathogens in our study.  "
        },
        {
            "text": "We find this out by conducting PCR tests at Liverpool Clinical Laboratory. These PCR tests look for a wide range of pathogens (including less common pathogens such as Shigella, Aeromonas and Vibrio).  When we detect a pathogen, we also send the sample to national reference laboratories, including The Gastrointestinal Bacteria Reference Unit (GBRU) for bacterial infections such as Salmonella, Campylobacter, Yersinia and Cryptosporidium Reference Unit (CRU) at Public Health Wales for parasite related infections such as Cryptosporidium, Giardia and Cyclospora.  "
        },
        {
            "text": "At these labs researchers carry out further PCR testing and additional tests such as Whole Genome Sequencing and strain typing so we can learn more about the pathogens.  Norovirus samples are sent to the enteric virus unit at the UKHSA for further characterisation. These tests allow us to determine which genogroup and type of norovirus is present in a sample - things we wouldn’t find out about samples following routine care.  "
        },
        {
            "text": "The results from these additional lab tests are beginning to come in and we are seeing some interesting trends that mirror national trends in emerging norovirus strain types (see national reports on norovirus). Our analysis has also shown that participants in the IID3 study are being infected by a wide range of norovirus strains."
        },
        {
            "heading": 4,
            "text": "Linking to National Data"
        },
        {
            "text": "The IID3 study is UK-wide so includes researchers from across all four nations who are working together to align datasets and compare national reporting procedures. The UKHSA have been leading on developing code to extract and compare these data. This involves many hours of checking details to make sure we don’t have duplicate records and are capturing the information about all the same pathogens we are testing for in the Liverpool labs, which may be stored differently in each country’s data. When we have our complete datasets, we will analyse the trends in seasonality of each of the pathogens detected. By comparing this with the trends seen in national reporting we will learn about the different routes people take to reporting illness (or not)."
        },
        {
            "text": "Some of the pathogens being detected may affect different people in the population. For example rotavirus will impact young children more than adults and some pathogens are more closely associated with food (Campylobacter/Salmonella), or recent overseas travel (Giardia). Understanding more about our study participants is useful, so we ask participants to complete a questionnaire about their health and lifestyle.  "
        },
        {
            "text": "We don’t always successfully detect an infectious pathogen in the stool samples we test, and we want to understand why this is, as the participants are reporting the symptoms. There are a range of potential reasons, for example are we getting the samples too late (e.g. the pathogens haven’t survived in the sample) or is something else causing disease?  We hope to be able to use this data to better understand lack of pathogen detection and to inform decisions about how to intervene or reduce the risk of infection."
        },
        {
            "text": "One of the largest challenges in answering the question ‘How many people in the UK get norovirus?’ is that it requires a study of this scale and a huge diversity of roles and experts to work together, including GP practice liaison teams, epidemiologists and modellers, microbiologists, data managers, ethic experts and public health researchers. Working with this team is a huge learning experience for us all.  "
        },
        {
            "text": "By the end of the study we will have new estimates of disease prevalence in the UK and how it is reported. In the meantime you can see our current results on the IID3 study dashboard."
        },
        {
            "heading": 1,
            "text": "Deall gwir faich Clefydau Perfeddol Heintus yn y DU"
        },
        {
            "text": "Nod y drydedd astudiaeth o glefydau perfeddol heintus (IID3) yw mesur cyfraddau’r clefydau a adroddir ar draws gwasanaethau gofal sylfaenol a gwasanaethau galwadau GIG 111/NHS 24, yn ogystal â nodi lefel y tanadrodd er mwyn gwneud amcangyfrifon newydd o’r gwir gyfraddau o glefydau IID ledled y DU."
        },
        {
            "heading": 4,
            "text": "Faint o bobl yn y DU sy’n dal norofeirws?"
        },
        {
            "text": "Ers mis Rhagfyr, mae’n siŵr nad oes wythnos wedi mynd heibio heb glywed bod rhywun i ffwrdd o’r gwaith yn sâl gyda ‘noro’. Ydy’r ffrindiau a’r cydweithwyr sâl hyn yn hunan-ddiagnosio ac yn defnyddio term gor-gyffredinol i ddisgrifio pwl o salwch? Neu ydyn nhw wedi cael diagnosis ffurfiol o norofeirws gan weithiwr meddygol proffesiynol? Efallai eu bod nhw wedi cysylltu â GIG 111/NHS 24 neu wedi bod at eu meddyg teulu a chyflwyno sampl carthion i’w phrofi ac wedi cael canlyniad positif?"
        },
        {
            "text": "Mae yna amrywiaeth o resymau pam byddai person yn gofyn am gyngor meddygol, neu beidio, pan fydd ganddo ‘fola tost’. Fodd bynnag, mae peidio â gwybod faint sy’n ceisio sylw meddygol – a faint sydd ddim – yn ei wneud yn anodd amcangyfrif maint y broblem. Mae deall gwir faich clefydau (neu’r gost yn sgil colli diwrnodau gwaith) yn bwysig, a bydd yn llywio’r hyn y gallwn ni ei wneud amdano (darllenwch fwy yn y blog pam mae ymchwil IID yn bwysig)."
        },
        {
            "heading": 4,
            "text": "Deall adroddiadau am glefydau perfeddol heintus yn y DU"
        },
        {
            "text": "Nid yw’r astudiaeth IID3 yn ystyried norofeirws yn unig, ond y pathogen hwn yw’r trydydd pathogen mwyaf cyffredin sy’n cael ei ganfod yn ein samplau astudio. Mae ein hastudiaeth yn cael ei chefnogi gan dros 8,000 o gyfranogwyr gwirfoddol sy’n rhoi gwybod i ni pan fydd ganddyn nhw symptomau dolur rhydd a chwydu, sy’n nodweddiadol o IID. Mae’r cyfranogwyr hyn wedi ymrestru drwy eu meddygfa ac yn cofnodi eu symptomau gan ddefnyddio ap sydd wedi’i ddylunio’n arbennig (darllenwch fwy am hyn yn y blog ar dechnoleg IID3) i roi gwybod os byddan nhw’n mynd yn sâl."
        },
        {
            "text": "Hyd yn hyn, rydym wedi dadansoddi dros 3,000 o samplau carthion i nodi’r amrywiaeth o bathogenau sy’n gwneud pobl yn sâl. Byddwn yn cymharu’r canlyniadau a gawn o samplau’r sawl sy’n cymryd rhan yn ein hastudiaeth â’r rhai a adroddwyd drwy lwybrau arferol fel ymweliadau â’r meddyg teulu neu alwadau i GIG 111 (NHS 24 yn yr Alban) a chofnodion mewn labordai gwyliadwriaeth cenedlaethol dros yr un cyfnod, a hynny er mwyn pennu’r gwir gyfraddau tanadrodd ar bob cam."
        },
        {
            "heading": 4,
            "text": "Profi samplau"
        },
        {
            "text": "Mae’r astudiaeth IID3 yn casglu data cyfranogwyr o fis Medi 2023 i fis Awst 2025. Hyd yn hyn, mae Escherichia coli sy’n peri dolur rhydd (straeniau enterotocsigenig, enteropathogenig ac enteroagregatif), Campylobacter, norofeirws, Clostridium perfringens (tocsin positif) a sapofeirws ymhlith y pathogenau a ganfyddir amlaf yn ein hastudiaeth."
        },
        {
            "text": "Rydym yn darganfod hyn trwy gynnal profion PCR yn Labordy Clinigol Lerpwl. Mae’r profion PCR hyn yn edrych am ystod eang o bathogenau (gan gynnwys pathogenau llai cyffredin fel Shigella, Aeromonas a Vibrio). Pan fyddwn yn canfod pathogen, rydym hefyd yn anfon y sampl i labordai ymchwil cenedlaethol, gan gynnwys yr Uned Ymchwil Bacteria Gastroberfeddol (GBRU) ar gyfer heintiau bacteriol fel Salmonela, Campylobacter ac Yersinia, a’r Uned Gyfeirio Cryptosporidium (CRU) yn Iechyd Cyhoeddus Cymru ar gyfer heintiau sy’n gysylltiedig â pharasitiaid fel Cryptosporidium, Giardia a Cyclospora."
        },
        {
            "text": "Yn y labordai hyn, mae ymchwilwyr yn cynnal profion PCR pellach a phrofion ychwanegol fel Dilyniannu Genom Cyfan a theipio straen fel y gallwn ddysgu mwy am y pathogenau. Anfonir samplau norofeirws i’r uned feirysau enterig yn UKHSA i’w disgrifio ymhellach. Mae’r profion hyn yn ein galluogi i bennu pa genogrŵp a pha fath o norofeirws sy’n bresennol mewn sampl – pethau na fyddem yn eu darganfod am samplau wrth ddilyn y llwybrau gofal arferol."
        },
        {
            "text": "Mae canlyniadau’r profion labordy ychwanegol hyn yn dechrau cyrraedd, ac rydym yn gweld rhai tueddiadau diddorol sy’n adlewyrchu tueddiadau cenedlaethol mewn mathau o straeniau norofeirws sy’n dod i’r amlwg (gweler adroddiadau cenedlaethol ar norofeirws). Mae ein dadansoddiadau hefyd wedi dangos bod cyfranogwyr yn yr astudiaeth IID3 yn cael eu heintio gan ystod eang o straeniau norofeirws."
        },
        {
            "heading": 4,
            "text": "Cysylltu â Data Cenedlaethol"
        },
        {
            "text": "Mae’r astudiaeth IID3 yn berthnasol i’r DU gyfan, felly mae’n cynnwys ymchwilwyr o bob un o’r pedair gwlad sy’n cydweithio i alinio setiau data a chymharu gweithdrefnau adrodd cenedlaethol. Mae UKHSA wedi bod yn arwain ar ddatblygu cod i echdynnu a chymharu’r data hyn. Mae hyn yn golygu oriau maith o wirio manylion i sicrhau nad oes gennym gofnodion dyblyg a’n bod ni’n casglu’r wybodaeth am yr holl bathogenau yr ydym yn profi amdanynt yn labordai Lerpwl, a allai gael eu storio’n wahanol yn nata pob gwlad. Pan fydd gennym ein setiau data cyflawn, byddwn yn dadansoddi’r tueddiadau o ran natur dymhorol pob un o’r pathogenau a ganfuwyd. Trwy gymharu hyn â’r tueddiadau a welir mewn adroddiadau cenedlaethol, byddwn yn dysgu am y gwahanol lwybrau y mae pobl yn eu cymryd i adrodd am salwch (neu beidio)."
        },
        {
            "text": "Gall rhai o’r pathogenau sy’n cael eu canfod effeithio ar wahanol bobl yn y boblogaeth. Er enghraifft, bydd rotafeirws yn effeithio ar blant ifanc yn fwy nag oedolion, ac mae rhai pathogenau yn fwy cysylltiedig â bwyd (Campylobacter /Salmonela), neu deithio tramor diweddar (Giardia). Mae deall mwy am y bobl sy’n cymryd rhan yn ein hastudiaeth yn ddefnyddiol, felly gofynnwn i gyfranogwyr gwblhau holiadur am eu hiechyd a’u ffordd o fyw."
        },
        {
            "text": "Nid ydym bob amser yn llwyddo i ganfod pathogen heintus yn y samplau carthion rydym yn eu profi, ac rydym am ddeall y rheswm dros hyn, wrth i’r cyfranogwyr adrodd am y symptomau. Mae amrywiaeth o resymau posib, er enghraifft, a ydym yn cael y samplau yn rhy hwyr (er enghraifft, nid yw’r pathogenau wedi goroesi yn y sampl) neu a yw rhywbeth arall yn achosi’r clefyd? Gobeithiwn allu defnyddio’r data hwn i ddeall yn well y diffyg canfod pathogenau ac i lywio penderfyniadau ynghylch sut i ymyrryd neu leihau’r risg o glefyd."
        },
        {
            "text": "Un o’r heriau mwyaf wrth ateb y cwestiwn ‘Faint o bobl yn y DU sy’n dal norofeirws?’ yw ei fod yn gofyn am astudiaeth o’r raddfa hon ac yn dibynnu ar gydweithio ar draws proffesiynau a chan amrywiaeth enfawr o arbenigwyr, gan gynnwys timau cyswllt meddygfeydd, epidemiolegwyr a modelwyr, microbiolegwyr, rheolwyr data, arbenigwyr moeseg ac ymchwilwyr iechyd y cyhoedd. Mae gweithio gyda’r tîm hwn yn brofiad dysgu enfawr i bob un ohonom ni."
        },
        {
            "text": "Erbyn diwedd yr astudiaeth, bydd gennym ni amcangyfrifon newydd o ba mor gyffredin yw’r fath glefydau yn y DU a sut y rhoddir gwybod amdanynt. Yn y cyfamser, gallwch weld ein canlyniadau cyfredol ar ddangosfwrdd astudio IID3.   "
        }
    ]
}