{
    "url": "https://defrafarming.blog.gov.uk/2025/03/12/update-on-the-farming-budget/",
    "title": "Update on the farming budget",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2025-03-12T18:45:52+00:00",
    "content": [
        {
            "text": "This government is proud to have secured the largest budget for sustainable food production in our country’s history, with £5 billion being spent to support farmers over a 2-year period.  That has helped us get record numbers of farmers into our farming schemes, with 50,000 farm businesses and more than half of all farmed land managed under our environmental land management schemes.  We also know that farmers want to better understand how that money is being spent as we deliver on our commitment to support farmers in achieving sustainable food production and nature recovery. This table sets out how that £5 billion is split across the different schemes, grants and other payments which are supporting farmers across England. "
        },
        {
            "text": "N.B: These are not ring-fenced figures and have the potential to change as needed for outcomes. We set a £1.05 billion cap on SFI in 2024/25 and 2025/26. "
        },
        {
            "text": "We can now confirm that this cap has been reached with record numbers of farmers in the scheme and 37,000 live agreements.  As of 11 March, every penny of this has now been paid to farmers or committed for payment through existing agreements or submitted applications. This is why, as a responsible government committed to the careful management of a fixed budget, we had to stop accepting new applications to SFI. "
        },
        {
            "text": "We will set out details on the next phase of the SFI scheme in due course – and we will address the issues with the previous scheme that led to us having to take this decision now. We publish full data on the uptake of SFI actions on a quarterly basis. The most recent data is published on GOV.UK and the next update will follow in May.   The wider farming offer"
        },
        {
            "text": "SFI is an important offer, but it is part of a wider package.   We’ve shared regular updates about the progress of Landscape Recovery and Farming in Protected Landscapes with project spotlights, Animal Health and Welfare and the grants designed to support productivity and innovation.   In recent weeks, we've made a number of announcements about: "
        },
        {
            "text": "These announcements are unaffected by the SFI decision and we are working with the Rural Payments Agency (RPA), farmers and stakeholders to implement and take those policies forward. "
        }
    ]
}