{
    "url": "https://cddo.blog.gov.uk/2024/08/22/dataconnect-is-back-this-september/",
    "title": "DataConnect is back this September",
    "authors": [
        "Rachael Richards, Data Community Lead, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Government Digital and Data"
    ],
    "pub_date": "2024-08-22T11:31:43+01:00",
    "content": [
        {
            "text": "DataConnect24 will be taking place next month, from 23 to 27 September. The week-long event will bring together UK public sector data leaders, academics, innovative thinkers, data scientists, data engineers, and AI specialists."
        },
        {
            "text": "This free event is run ‘for the community, by the community’, and organised by Central Digital & Data Office (CDDO). Now in its fourth year, it aims to up skill, connect and inform public sector data professionals through a series of presentations and panel discussions. "
        },
        {
            "text": "For the first time, DataConnect will offer attendees the opportunity to watch back recorded sessions, network virtually, and attend expo stands."
        },
        {
            "text": "Last year, over 6,000 data professionals attended DataConnect from multiple cross government departments, universities, institutes and arms length bodies."
        },
        {
            "heading": 3,
            "text": "This year’s programme"
        },
        {
            "text": "There are already over 40 sessions to choose from and all are aligned to three themes:"
        },
        {
            "text": "We’re delighted to see and hear from a diverse range of speakers including from the Met Office, Open Data Institute, Ordnance Survey, GCHQ, Ada Lovelace Institute, Alan Turing Institute, British Council, Cambridgeshire County Council, Greater Manchester Combined Authority, Greater London Authority, Kirklees Council, University of Exeter, Oxford University, Transport for London and the Estonian Government."
        },
        {
            "text": "In addition to a keynote from CDDO’s Craig Suckling, Chief Data Officer for Government, here’s a taste of some of this year’s sessions:"
        },
        {
            "text": "You can view the full programme online."
        }
    ]
}