{
    "url": "https://stratcommand.blog.gov.uk/2024/08/22/inside-bfsai-hms-forth-officer-of-the-watch/",
    "title": "Inside BFSAI: HMS FORTH Officer of the Watch",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-08-22T11:59:37+01:00",
    "content": [
        {
            "text": "HMS FORTH is the first of five Offshore Patrol Vessels (OPV). Beginning service in 2018, she is a leading maritime security asset in the British Forces South Atlantic Islands (BFSAI). Her remit offers reassurance and protection in the Falkland Islands. She has a flight deck and is armed with an array of weaponry, allowing her to support a diverse range of operations."
        },
        {
            "text": "We interviewed Lt Dodd, who is currently deployed as one of the Officers of the Watch on HMS FORTH. The Officer of the Watch is primarily responsible to the captain for safety operations of the ship."
        },
        {
            "text": "What is your role on HMS FORTH? "
        },
        {
            "text": "My primary roles onboard FORTH are as one of two Gunnery Officers and as an Officer of the Watch."
        },
        {
            "text": "Do you cover any other roles on the ship? "
        },
        {
            "text": "Personnel within the Ship’s Company have multiple roles, both in everyday life and in emergencies. I act as the Workforce Co-ordinator (the movement of personnel to assist with emergencies). During Damage Control incidents and during warfighting serials I am the Weapon Director, indicating and directing the Guns crews to provide protection to FORTH."
        },
        {
            "text": "How long have you been deployed on HMS FORTH? "
        },
        {
            "text": "I joined FORTH in Walvis Bay, Namibia back in early November 2023 prior to her transit back to the Falkland Islands."
        },
        {
            "text": "Do you have a team when you drive the ship? "
        },
        {
            "text": "A normal watch is just me, and the Quartermaster on the bridge with a Marine Engineer always on call.  However during any incident members of the Ship’s Company will close up to their respective areas depending on the type of incident we are facing."
        },
        {
            "text": "What are your biggest challenges?"
        },
        {
            "text": "The rate at which stuff can happen when at sea can go from zero to 100 very quickly. As a result, the challenge for me is being able to adapt quickly as no two incidents in my career have been the same thus far."
        },
        {
            "text": "How have you engaged with the Royal Air Force and British Army Roulement Infantry Company (RIC) whilst being deployed on HMS FORTH?"
        },
        {
            "text": "We have completed joint force work on multiple occasions. During a transit to South Georgia, we engaged in Fighter Bomber Manoeuvring with the Typhoons from 1435 Flight. This is something I had not done before and proved a challenging serial. Our work with the RIC involves exercises whereby we insert them to locations on the Island and then proceed off for unit level training before re-embarking them. During these exercises we managed to conduct a few settlement visits for the more remote areas of the Falklands."
        },
        {
            "text": " "
        }
    ]
}