{
    "url": "https://vets.blog.gov.uk/2024/08/22/new-mandatory-bird-registration-what-do-keepers-need-to-know/",
    "title": "New mandatory bird registration: what do keepers need to know",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2024-08-22T12:36:47+01:00",
    "content": [
        {
            "text": "Like microchipping for pet dogs (and cats if you live in England), new rules make it a legal requirement for everyone in Great Britain who keeps birds to register with the Animal and Plant Health Agency (APHA).Keepers must register before 1 October 2024 in England and Wales and between 1 September and 1 December in Scotland. Why bird registration is importantIt’s often said we are a nation of animal lovers, and it’s true. Alongside dogs and cats, birds are one of the most popular animals to keep, including chickens, geese, ducks, pigeons and even birds of prey. The numbers of chickens kept in back gardens has particularly increased in recent years. For many keepers, these birds are valued like a member of the family and there’s nothing more important than keeping them safe – whether that’s from the elements, opportunistic foxes, or sickness and disease. As keepers will be all too familiar, since 2021, the UK has seen its largest ever outbreak of avian influenza or ‘bird flu’. This is a disease of birds caused by influenza viruses and even a very small amount of virus can often be fatal to birds. It is primarily spread by wild birds and has had terrible impacts on endangered populations of native species, both on land and at sea, including Great Skuas, Barnacle Geese and Black Headed Gulls. It’s also posed big challenges for commercial poultry and egg producing businesses, backyard bird keepers and zoos.We have seen that backyard flocks of any size are also vulnerable to avian influenza. Since October 2021, there have been 83 confirmed outbreaks amongst backyard poultry or small captive bird flocks across Great Britain. This is around a quarter of all confirmed outbreaks. Each one of these instances can be devastating for those bird keepers.I applaud backyard and hobbyist bird keepers that have worked hard in recent years to protect their flocks – maintaining strong standards of biosecurity and housing birds when necessary in order to protect them and prevent the spread of the virus.One of the most straightforward and impactful ways that backyard keepers can help to tackle the ongoing risk of avian influenza and other bird diseases is by registering with the Animal and Plant Health Agency (APHA). This is the organisation committed to safeguarding the health of all types of kept animals in Great Britain. What happens when you registerBy sharing some simple information, such as your contact details, how many birds you keep and what kind of birds they are, you’ll help to improve the overall picture of where at-risk birds are located across Great Britain. This helps APHA know where to focus its resources, as they work to prevent and mitigate the spread of notifiable animal disease outbreaks.This also means APHA will be able to contact you if there’s a disease outbreak, such as bird flu, in your local area. This free service is a helpful heads-up on when you should take extra precautions to protect your flock.In the 10km Surveillance Zone (disease control zone) of a confirmed case of notifiable animal disease, most keepers will just be sent information and guidance. Most premises within the 3 km Protection Zone (disease control zone) will receive a veterinary inspection to provide reassurance that their birds are fit and healthy. This is also performed at no cost to the keeper. In some cases, sampling of waterfowl may be needed, as these birds often do not show signs of infection, but could still be carrying (and spreading) the virus to other birds. What registration does not involveBirds will only ever be culled if avian influenza is confirmed in your birds following laboratory testing of samples, or a veterinary risk assessment indicates a strong likelihood that a premises keeping birds has significant links to a confirmed infected premises. These links could be via movements of birds, poultry products, people, equipment, or vehicles between the two premises.When infected birds are humanely culled, this is for both disease control and animal welfare purposes. Compensation is paid to keepers in such cases, where appropriate. There is no cure for highly pathogenic avian influenza and for the majority of infected birds, the disease will lead to severe distress and death. Which bird keepers don’t need to registerCertain birds are exempt from these new requirements, such as budgies, parrots, canaries and similar species that are kept without any access to the outside. Given they have no access to wild birds or the open air, these birds are at very low risk of being exposed to viruses. How the registration process worksRegistering is a quick, free and simple process. Keepers’ information will be managed in full compliance with UK data protection legislation and will only be shared with those involved in the response to an outbreak, in line with GDPR rules. England and WalesIn England and Wales, you can choose the most convenient option for how to register. We have introduced a streamlined online service, which allows new keepers to register their birds online and should take less than 10 minutes to complete. You can also complete a poultry registration form, which can be returned by email or post. Alternatively, if you have no access to the internet, you can call APHA on 03000 200 301 and apply over the phone. ScotlandRegistration in Scotland will also be a quick and simple process through the Scottish Kept Bird Register (SKBR) online site, which will be launched on 1 September 2024.Alongside the good standards of biosecurity that many keepers have practiced so diligently in recent years, registration is a valuable tool to help keep our birds safe from the persistent threat of avian disease. I urge all keepers with birds covered by the new rules to make sure they are registered before the deadlines. "
        }
    ]
}