{
    "url": "https://socialcareinspection.blog.gov.uk/2024/08/22/supported-accommodation-it-can-be-right-for-some-older-children-but-not-for-all/",
    "title": "Supported accommodation – it can be right for some older children, but not for all",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care experienced",
        "local authorities",
        "social care regulation",
        "supported accommodation"
    ],
    "pub_date": "2024-08-22T13:03:10+01:00",
    "content": [
        {
            "text": "Ahead of inspections starting next month, Yvette Stanley gives an update on our registration work and sets out some ‘red lines’ when considering supported accommodation as an option for looked-after children and care leavers."
        },
        {
            "text": "Ofsted’s registration of supported accommodation providers"
        },
        {
            "text": "It’s now more than 15 months since we began registering providers of supported accommodation. To operate legally, providers either needed to register, or have an application accepted by Ofsted as ‘complete’, by 28 October 2023. Nearly 800 providers met that deadline."
        },
        {
            "text": "We have received far more applications than predicted, and many came in close to the deadline. By the beginning of July, we had received more than 1,300 ‘complete’ applications, and at the time of writing more than 400 providers are now fully registered."
        },
        {
            "text": "We are dealing with the registrations as quickly as we can. To help us reach a swift decision, we continue to ask applicants to respond promptly to requests for any additional information we require. Similarly, chasing up references can speed up the process for applicants."
        },
        {
            "text": "Who is supported accommodation for?"
        },
        {
            "text": "Many providers are delivering well-targeted and appropriate support to young people who are ready for more independence and responsibility and do not require additional care. But we are also encountering a worrying number of children who should not be in supported accommodation."
        },
        {
            "text": "The regulations make it clear that supported accommodation is not right for all older children:"
        },
        {
            "text": "Some of the children we are encounter through our work are clearly in need of a higher level of care than supported accommodation is equipped to provide. For some, the plans for increased independence are aspirational rather than realistic."
        },
        {
            "text": "Of course, there is not an absolute or clear line between support and care. They exist on a spectrum. From time to time, all 16- and 17-year-olds will need elements of help similar to the type of care that is more typically provided by a children’s home or by foster carers. If supported accommodation providers offer that kind of sensitive help (usually short-term in nature and responding to a specific need), they will not usually be straying outside the scope of their registration. We expect providers to be able to respond flexibly to children’s changing needs as they develop life skills for future adulthood."
        },
        {
            "text": "But there are clear and sensible limits to the flexibility within the government’s regulations and standards."
        },
        {
            "text": "Increasingly, we have begun to hear the use of terms such as ‘higher needs support’ or ‘high support’, which stretch the parameters of supported accommodation too far. These terms are unhelpful and misleading. They can mask what is actually being commissioned or provided. In some cases, it means that providers are operating unregistered children’s homes and that children are not getting the care they need from people who are suitably skilled and qualified."
        },
        {
            "text": "Providers should not accept referrals for children who are not ready for supported accommodation at the point of referral. We do not expect to see children moving into supported accommodation if:"
        },
        {
            "text": "Providers who stray outside their registration"
        },
        {
            "text": "Providers must be suitably registered in order to operate within the law and, most importantly, to have shown that they are properly equipped to meet children’s individual needs. Registration for supported accommodation does not mean that a provider is able to meet the different standards of care that are required for a children’s home."
        },
        {
            "text": "If we believe a supported accommodation provider is either operating as an unregistered children’s home, or not providing the level of care that the child clearly needs, we will act."
        },
        {
            "text": "This action will always be in the best interests of children. We will use our powers carefully, and act proportionally. Any action will be made on a case-by-case basis. This may mean that we work with a provider to make sure that it becomes suitably registered. But, when we have immediate concerns for the safety and welfare of children, we will not hesitate to take more urgent and serious action."
        },
        {
            "text": "Supported accommodation and the wider sufficiency context"
        },
        {
            "text": "We are, of course, very aware of the pressures that local authorities are under to identify suitable placements for children. We continue to work with the government and colleagues throughout the sector to seek urgent solutions to the wider sufficiency difficulties."
        },
        {
            "text": "The high number of applications to register has, to some extent, reduced earlier concerns about any resistance to regulation, but it remains open to question whether the number and nature of the applications accurately reflects the need. The high (and growing) number of 16- and 17-year-olds in supported accommodation should give us all cause for concern that, as a result of gaps in provision elsewhere, too many children are being pushed towards an independence for which they are not properly prepared."
        },
        {
            "text": "We hope everyone in the sector will work with us to make sure children end up in the most appropriate place to care for them, meet their needs, and, if appropriate, prepare them for their next steps."
        },
        {
            "text": "As our work with the supported accommodation sector progresses, we will share our insights with government and other children’s social care colleagues. We hope they will contribute to a greater understanding of this newly regulated sector and the development of effective policy."
        },
        {
            "text": "Find out more"
        },
        {
            "text": "Last month, we posted a recording of a webinar on our registration of supported accommodation and our inspections which will begin in September 2024."
        },
        {
            "text": "In the meantime, if you have any general questions about Ofsted’s regulation and inspection of supported accommodation, please contact us at EYRegulatoryandSocialCare@ofsted.gov.uk."
        },
        {
            "text": "For questions about individual applications to register, please get in touch with us at sc.suppacc@ofsted.gov.uk."
        }
    ]
}