{
    "url": "https://defraenvironment.blog.gov.uk/2024/08/22/world-first-project-launched-to-track-hedgehogs-and-reverse-decline/",
    "title": "World-first project launched to track hedgehogs and reverse decline",
    "authors": [
        "Danielle Greaves"
    ],
    "categories": [
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2024-08-22T14:06:01+01:00",
    "content": [
        {
            "text": "Hedgehogs, our beloved garden visitors, are in decline."
        },
        {
            "text": "Surveys in the latest State of Britain's Hedgehogs report estimate that hedgehog numbers have decreased by up to 75% in rural areas since the turn of the century."
        },
        {
            "text": "I’m Danielle and I work as a Natural England Higher Officer in Species Recovery and Reintroduction in one of the area teams, which includes collaborating with a variety of partners to achieve nature recovery."
        },
        {
            "text": "An invaluable contribution to Defra’s work is also made by non-government organisations like charities, universities and businesses, who use their specialist expertise to focus on particular habitats or species."
        },
        {
            "text": "One example of this is the National Hedgehog Monitoring Programme."
        },
        {
            "text": "Hedgehogs are treasured in their own right, but they are also an indicator species. This means that a decline in their numbers indicates a broader decline in the health of the natural world. And the natural world, in turn, supports our food systems, provides clean water, and helps regulate our climate."
        },
        {
            "text": "Hedgehog numbers have traditionally been monitored by counting hedgehog road casualties and using these as an indication of changes in the wider population."
        },
        {
            "text": "These surveys give a snapshot of information on the location of hedgehogs at the time, but don’t monitor how that population is faring, meaning we won’t know until it’s too late. There is little evidence to explain the reasoning behind their decline."
        },
        {
            "text": "The National Hedgehog Monitoring Programme, launched this year, seeks to change that."
        },
        {
            "text": "World-first monitoring "
        },
        {
            "text": "The Monitoring Programme is trialling a world-first combination of trail cameras, artificial intelligence (AI) and help from volunteers to establish robust hedgehog population estimates."
        },
        {
            "text": "The images captured are sorted using AI algorithms, which remove images of humans and vegetation. Volunteers then review the remaining images and classify them depending on species shown."
        },
        {
            "text": "Once classified, the images are analysed to reveal population numbers. This could also uncover information on population density, different habitats, and changes to populations over time."
        },
        {
            "text": "This information will be vital in producing insights into the factors causing hedgehog population decline. It will enable conservationists to implement practical conservation measures to address this challenge."
        },
        {
            "text": "The Monitoring Programme is being piloted in multiple locations across the country, with an initial target number of 40 survey sites by the end of the project."
        },
        {
            "text": "Working together to reverse hedgehog decline"
        },
        {
            "text": "The groundbreaking project is being delivered by a variety of organisations, with People’s Trust for Endangered Species and The British Hedgehog Preservation Society coordinating the programme."
        },
        {
            "text": "To bring together expertise from across England partnerships with groups have been formed, including Nottingham Trent University (NTU), Zoological Society of London, London Hogwatch, MammalWeb and Durham University, with co-funding provided by Natural England."
        },
        {
            "text": "The East Midlands has been chosen as one of the target locations, with NTU leading the way in Nottinghamshire. The university is acting as a ‘hub’, which means they are responsible for co-ordinating the installation of cameras in up to 5 sites in the local area. These sites will encompass a variety of habitats including farmland, woodland and an urban park."
        },
        {
            "text": "Connecting with the university has allowed me to see the project develop first-hand in my area and witness the first steps towards helping hedgehogs, making a local contribution to a national effort."
        },
        {
            "text": "How you can help "
        },
        {
            "text": "This project will be invaluable in gaining information on the status of hedgehog populations in England. It will provide evidence to support future long-term conservation efforts."
        },
        {
            "text": "The project’s success is underpinned by its volunteers, who can take part from the comfort of their own homes."
        },
        {
            "text": "Images from the first year of the programme have been uploaded to MammalWeb, a platform to collate, validate and curate camera trap data. Help is needed to classify the animals in these images."
        },
        {
            "text": "If you’re interested in getting involved, please visit the National Hedgehog Monitoring Programme website. Free training and ID guides are available online to help you volunteer."
        },
        {
            "text": "You can also help hedgehogs by creating safe environments in your garden or allotment by leaving a corner as a wildlife sanctuary. You could:"
        },
        {
            "text": "By taking these steps, you can support wildlife and enjoy the pleasure of observing hedgehogs in your area."
        }
    ]
}