{
    "url": "https://teaching.blog.gov.uk/2024/02/11/how-were-striving-to-get-more-girls-into-computing/",
    "title": "How we’re striving to get more girls into computing",
    "authors": [
        "Oliver Brotherhood"
    ],
    "categories": [
        "Computing and Computer Science",
        "STEM"
    ],
    "pub_date": "2024-02-11T09:00:53+00:00",
    "content": [
        {
            "text": "Oliver Brotherhood, Curriculum Lead for Computing and Computer Science at Penrice Academy, discusses the importance of adopting a whole-school approach to addressing gender imbalance in computer science."
        },
        {
            "text": "The gender imbalance"
        },
        {
            "text": "I began teaching computing four years ago, after transitioning from working in the tech industry. Computer science can be a great accelerator of social mobility, and I want to equip all young people at our academy with a skillset that will enable them to take up the opportunities the subject offers."
        },
        {
            "text": "Since I started teaching, I’ve always seen an obvious gender imbalance in computing - my current Year 11 cohort has no girls, and our Year 10 cohort has just three. We have trialed different initiatives over the past couple of years to try and tackle this, with varying degrees of success. The number of girls engaging with the subject has increased but to nowhere near the extent that we would like to see."
        },
        {
            "text": "The ‘I Belong’ programme"
        },
        {
            "text": "After completing the National Centre for Education’s I Belong: encouraging girls into computer science programme, it became clear that tackling gender imbalance doesn’t just result out of a singular initiative. It requires a whole school approach with buy-in from senior leadership, changes to the approach to teaching, and a focus on increasing the visibility of women who study and work in computing."
        },
        {
            "text": "How we’re striving to get more girls into computing"
        },
        {
            "text": "Since completing I Belong, our department has focused on three key areas:"
        },
        {
            "text": "Looking forward, we plan to implement a peer mentoring programme which will enable students considering taking computer science as a GCSE option to ask questions to someone already studying the subject. We hope this will further embed a culture of computing across our school and create a sense of belonging within the subject."
        },
        {
            "text": "A whole school commitment  "
        },
        {
            "text": "Computing offers a world of opportunity to young people; it is paramount those opportunities are open and accessible to everyone, regardless of gender. Working to fix the gender imbalance in computing requires commitment not just from those who teach it, but from all those working and studying in a school environment."
        },
        {
            "text": " "
        },
        {
            "text": "Visit the National Centre for Computing Education website to find out more about the I Belong programme. It is free to all state-funded schools and colleges, and provides resources, training and implementation support to help get more girls into computer science."
        }
    ]
}