{
    "url": "https://naturalengland.blog.gov.uk/2024/11/10/harnessing-innovative-technology-for-nature-based-solutions-in-norfolk-amp-suffolk/",
    "title": "Harnessing Innovative Technology for Nature-Based Solutions in Norfolk & Suffolk",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Farming",
        "Flood Management",
        "Mapping",
        "Marine environment",
        "Monitoring",
        "Natural England",
        "Nature Recovery",
        "Nature-based solutions",
        "Science and evidence",
        "Species recovery",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2024-11-10T08:00:00+00:00",
    "content": [
        {
            "text": "In celebration of World Science Day (10th November), we’re taking a look at the surprising ways Natural England uses technology in its day-to-day operations. "
        },
        {
            "text": "In Norfolk & Suffolk, a number of projects are using innovative technology to improve efficiency and better protect the environment. From protecting rivers to revolutionising agriculture and even understanding wildlife, advanced tools like drones and artificial intelligence (AI) are being used to better manage and protect our natural world. "
        },
        {
            "text": "Using artificial intelligence to protect seals"
        },
        {
            "text": "Natural England is using drones alongside AI analysis to monitor seals and their pups off the coast of Norfolk. This will help us to understand how these important colonies are changing over time, and whether these changes are related to human activity."
        },
        {
            "text": "Instance segmentation (a type of AI) is being trained to recognise individual seals from drone imagery, draw a line around them, and count them. It is intelligent enough to distinguish between older seals and whitecoat pups, and also between multiple seals grouped closely together."
        },
        {
            "text": "Historically, collecting this type of data has been a challenge when using the traditional method of manual ground surveys and aerial surveys. Drones can reach sand banks and rocky beaches inaccessible to human observers. With powerful zoom lenses, the drones can record the seals and their pups from a height of 110m, minimising disturbance to the mammals."
        },
        {
            "text": "Drones meet Natural Flood Management"
        },
        {
            "text": "One inspiring initiative focuses on the River Wissey, where our farm advisers and in-house drone team are using drones to capture detailed images along a 6.6 km stretch of the river. This footage will be shared with landowners and environmental partners to discuss restoration proposals and explore Natural Flood Management (NFM) solutions."
        },
        {
            "text": "NFM is an approach that works with nature, not against it. Instead of relying on traditional flood defences like walls and dams, NFM focuses on natural techniques like tree planting, wetland creation, and river re-meandering to slow water flow."
        },
        {
            "text": "This, in turn, creates and interconnects habitats for wildlife and improves soil structure and quality by reducing uncontrolled flooding, run-off and loss of topsoil. This approach can turn less productive farmland into vibrant wetlands that not only absorb excess water and carbon but also support biodiversity."
        },
        {
            "text": "Seed-sowing drones"
        },
        {
            "text": "Drones aren’t just helping with flood management—they’re also transforming the way we farm."
        },
        {
            "text": "At Eves Hill Farm in Norfolk, our Catchment Sensitive farming colleagues watched drones being used to sow cover crop seeds, offering a revolutionary way to improve soil health. These crops help reduce soil erosion, increase soil fertility, and encourage biodiversity, all while benefiting the crops harvested later by making nitrogen more available in the soil."
        },
        {
            "text": "Cover crops are another ecological method we can use to help combat flooding; the crops help fix the soil and avoid run-off into our waterways, preventing pollution and enhancing productivity.  "
        },
        {
            "text": "The drone used for this task is impressive, flying at 22 mph and just 6 meters above ground level, using radar to follow the contours of the land. In only one hour, it can plant 15 hectares of land!"
        },
        {
            "text": "This method also avoids soil compaction, a common issue with heavy farming machinery, helping maintain soil quality and offering a low-carbon solution to planting. "
        },
        {
            "text": "Technology is unlocking possibilities at Natural England and helping us to inform nature-based solutions. Whether it's managing flood risk, improving farming practices with precision planting by a drone, or understanding wildlife behaviour along our coasts, these innovations are showing how modern tools can work in harmony, not against, nature."
        }
    ]
}