{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/06/20/apha-defra-and-bbsrc-have-today-announced-a-major-new-research-consortium-in-the-uks-battle-against-bird-flu/",
    "title": "APHA, Defra and BBSRC have today announced a major new research consortium in the UK’s battle against bird flu.",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Collaborating & Networking"
    ],
    "pub_date": "2022-06-20T22:15:42+01:00",
    "content": [
        {
            "text": "APHA, Defra and BBSRC have today announced a major new research consortium in the UK’s battle against bird flu. "
        },
        {
            "text": "Eight of the UK’s top scientific organisations are coming together to find new ways to contain bird flu outbreaks, backed by £1.5 million investment to fund new research to help poultry farmers protect their flocks."
        },
        {
            "text": "The eight-strong consortium, headed by our own Ian Brown has received £1.5 million from the Biotechnology and Biosciences Research Council (BBSRC) and Defra and has been tasked with informing strategies to prevent and control future bird flu outbreaks."
        },
        {
            "text": " APHA’s Professor Ian Brown in the lab."
        },
        {
            "text": "This year’s bird flu outbreak has been the largest and longest ever experienced in the UK. The outbreak started earlier than previous years after the virus continued to circulate in Europe over summer 2021 and has led to over 120 cases in the UK so far."
        },
        {
            "text": "The news will be a significant boost to the UK’s poultry sector and rural economy, which has experienced significant disruption from this year’s outbreak with compulsory indoor housing measures put in place to protect poultry."
        },
        {
            "text": "The consortium will focus on building our understanding in a number of key areas, including:"
        },
        {
            "text": "UK’s Chief Veterinary Officer Christine Middlemiss said:"
        },
        {
            "text": "“This new consortium will allow us to combine our expertise at a national level to increase the speed and quality of our research, ensuring we can develop new strategies to aid our efforts against this insidious disease and hopefully in time reduce the impact on the poultry sector”"
        },
        {
            "text": "Professor Ian Brown, APHA’s Head of Virology and project manager, said:"
        },
        {
            "text": "“This investment in a new research consortium will bring together the greatest minds from eight world-leading British institutions to address gaps in our understanding of bird flu, helping us to control the spread of the disease, while furthering UK animal health science and ensuring we maintain our world-leading reputation in the field.”"
        },
        {
            "text": "Professor Melanie Welham, Executive Chair of BBSRC, said:"
        },
        {
            "text": "“One of the real strengths of the UK’s scientific response to disease outbreaks is the way that we can draw on leading researchers from all over the country, who can pool their expertise to deliver results, fast. This new national consortium will study the unprecedented avian influenza outbreak to better understand this latest strain and how to tackle it. This will feed rapidly into government decision-making and new strategies to protect the poultry industry and reduce the risk of future transmission to humans.”"
        },
        {
            "text": "UK researchers are already world-leaders in studying bird flu, with the APHA hosting an International Reference Laboratory for avian influenza. The knowledge gathered will also be shared with international partners to aid their efforts to tackle the disease with benefits for global risk mitigation."
        },
        {
            "text": "Members of the consortium will also attend a global session this month, hosted by the US Department of Agriculture, where they will influence and coordinate future investment into animal influenzas on an international basis."
        },
        {
            "text": "The research gaps addressed by the consortium have been identified from the recent International Research Consortium on Animal Health Animal Influenza Report and knowledge gaps identified during the current outbreak."
        },
        {
            "text": "Within APHA we refer to the project as FluMap, so please do look out for APHA’s social media regarding this announcement and do share widely."
        },
        {
            "text": " "
        },
        {
            "text": "Further Information"
        },
        {
            "text": "Find out more about APHA’s avian influenza work"
        },
        {
            "text": "If you have any questions please contact ian.brown@apha.gov.uk"
        },
        {
            "text": " "
        }
    ]
}