{
    "url": "https://actuaries.blog.gov.uk/2022/06/20/how-to-ace-your-gad-job-application/",
    "title": "How to ace your GAD job application!",
    "authors": [
        "Shamailla Rashid - Head of HR Operations"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Careers"
    ],
    "pub_date": "2022-06-20T09:06:27+01:00",
    "content": [
        {
            "text": "Job applications and interviews, in all their guises, are a common fact of working life. They’re a necessary part of the way organisations find their new staff."
        },
        {
            "text": "If you’ve ever applied for a role and got through to an interview, you may recall them as being stressful, challenging and quite involved."
        },
        {
            "text": "From an employer’s point of view though, the purpose is to find the best candidates with the correct skills and knowledge."
        },
        {
            "text": "As Head of HR Operations here in the Government Actuary’s Department (GAD), I’ve been on both sides of the table or even nowadays, the screen. So, I’m able to make assessments of the best candidates."
        },
        {
            "text": "In my 30 years’ experience of HR, application processes and interviews have developed. They can range from CVs and an informal chat with the new boss to several application stages with detailed panel interviews."
        },
        {
            "heading": 2,
            "text": "Nuggets of knowledge"
        },
        {
            "text": "As a prospective candidate, make sure you prepare and research the organisation and the role. Ask yourself what do you need to have in your essential toolkit?"
        },
        {
            "text": "Planning for success - the golden nuggets you need to know when applying to work at GAD."
        },
        {
            "text": "I’ve always found the STAR technique to be a useful way to structure the evidence in your supporting statement:"
        },
        {
            "heading": 2,
            "text": "We need to know what you know"
        },
        {
            "text": "If you’ve managed to get an invite to an interview, well done! You were one of the candidates who best matched the criteria at the shortlisting stage."
        },
        {
            "text": "In readiness, again, do let us know if you need us to make any reasonable adjustments. Make sure you read your application and check the selection criteria again. Think of examples from your current and previous work or academic experience that demonstrates how you meet the criteria and are the best candidate."
        },
        {
            "text": "Remember, as well as making it clear what the role is all about, we want your experience to be positive. We want the process to be as smooth and clear as possible."
        },
        {
            "text": "Don’t forget, it’s a 2-way relationship between you and us. This is a mix of what you bring by way of interests and talent and what we offer and what we’re about."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "GAD is a shared service supplier to the UK government and the devolved administrations. This is a team of highly qualified, dedicated experts including qualified actuaries, those training towards the actuarial qualifications, analysts, and other business professionals."
        },
        {
            "text": "Everyone in the department, whatever their role, contributes to our successes. We offer rewarding careers in a supportive environment. We aim to be a workplace that champions diversity, inclusion, and wellbeing; a place for all, working together as one team to achieve our shared aims."
        },
        {
            "text": "As an HR professional of more than 30 years expertise, I believe everyone should be able to progress and reach their potential."
        },
        {
            "text": "Here in GAD, we want highly skilled leaders and managers who embrace inclusion and realise the potential of their teams. We can provide the support and structure to help make this happen."
        },
        {
            "heading": 2,
            "text": "Share your knowledge"
        },
        {
            "text": "We have different types of interviews depending on the role you are applying for. They are all designed for you to share your knowledge and your expertise."
        },
        {
            "text": "In our annual graduate recruitment programme for example, we look for trainee actuaries and for analysts to join us. As each of these have distinct career paths, then interviews and online assessments are tailored accordingly."
        },
        {
            "text": "However, you may have been successful in getting an interview for one of the roles in Central Services. These include HR, finance, or project management. In that case interviews and assessments vary depending on grade. Entry level roles have more task-oriented assessments whereas applicants seeking more senior roles are assessed according to their strategic knowledge and understanding."
        },
        {
            "heading": 2,
            "text": "Continue learning"
        },
        {
            "text": "We aim to be a great place to work – treating everyone as individuals and allowing people to flourish. The ever-changing environment requires us all to embrace lifelong learning."
        },
        {
            "text": "Here in HR, we too are continually developing our skills and learning from others (and sharing) new experiences. Our aim is to provide fulfilling careers for others."
        },
        {
            "text": "So, keep an eye on our LinkedIn page and Civil Service Jobs where you may just see your next role!"
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        },
        {
            "text": " "
        }
    ]
}