{
    "url": "https://insideDIO.blog.gov.uk/2022/06/20/how-dio-supports-the-uk-armed-forces/",
    "title": "How DIO supports the UK Armed Forces",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Armed Forces",
        "Reserve Forces"
    ],
    "pub_date": "2022-06-20T17:40:16+00:00",
    "content": [
        {
            "text": "The UK Armed Forces led the Queen's Platinum Jubilee Pageant in London earlier this month [Crown Copyright / MOD 2022]This week is Armed Forces Week, which provides an opportunity to celebrate the enormous contribution that UK Service Personnel, veterans, and cadets have made and continue to make to the nation."
        },
        {
            "text": "In DIO, we are very proud of our role in supporting our Armed Forces to live, train and deploy. From managing the vast MOD training estate to providing cleaning and catering services, our job is to enable military capability by planning, building, maintaining, and servicing infrastructure. To do this, we work closely with the Armed Forces as well as many partners from across multiple industries, ranging from construction companies to catering contractors."
        },
        {
            "text": "Here is a run-through of some of our key responsibilities in supporting the UK Armed Forces:"
        },
        {
            "heading": 2,
            "text": "Providing a safe and secure place to train"
        },
        {
            "text": "More than two thirds of the 230,000 hectares of MOD land in the UK is held solely for military training, and DIO is responsible for the safe and sustainable management of this estate."
        },
        {
            "text": "We deliver military training facilities that prepare personnel for worldwide operations. Some of the many ways our Armed Forces use the training estate include practising fighting in built-up areas, firing artillery, amphibious landings and assaults, driving tanks and other vehicles, and firing from naval vessels and aircraft. Across our numerous UK training areas, exercises run regularly with an average of 9,000 service personnel using the training estate daily."
        },
        {
            "text": "Soldiers conducting an exercise on Salisbury Plain Training Area [Crown Copyright / MOD 2015]Our military are also stationed and train across the globe, and DIO is responsible for the MOD’s overseas estate in locations as diverse as Belize, Cyprus, the Falkland Islands and Kenya."
        },
        {
            "heading": 2,
            "text": "Managing facilities"
        },
        {
            "text": "A substantial part of managing the MOD’s estate involves ensuring that the many thousands of buildings and facilities it encompasses are working as well as they can be."
        },
        {
            "text": "Together with our facilities management partners, we ensure that maintenance of the Defence estate is carried out efficiently and effectively, so that our Armed Forces have the facilities they need. Last summer, we awarded a series of new contracts for maintenance work, repairs, servicing and hard facilities management across the UK Defence estate, as part of the £3bn Future Defence Infrastructure Services (FDIS) programme. These new contracts cover everything from lighting, plumbing, heating and air conditioning to fire safety systems."
        },
        {
            "text": "DIO is also responsible for what’s known as ‘soft’ facilities management across the many sites and military bases our estate covers. Working with our industry partners, we deliver services ranging from catering and cleaning to retail outlets and waste management. All of these key services are geared towards supporting personnel with their day-to-day requirements while living and training on the Defence estate."
        },
        {
            "heading": 2,
            "text": "Maintaining and improving Service Family Accommodation"
        },
        {
            "text": "More than 39,000 families live in Service Family Accommodation (SFA) across the UK, so it’s vital that we ensure homes of the right quality are available for them wherever and whenever they are assigned."
        },
        {
            "text": "Service Family Accommodation at Beacon Barracks, Stafford [Crown Copyright / MOD 2015]April this year marked the commencement of our five new accommodation contracts, worth £640m in total, to improve housing services for our Armed Forces customers as part of the wider FDIS programme. We’ve introduced a new National Service Centre, which acts as a single point of contact for all customer requests, as well as four Regional Accommodation Maintenance Services contracts, worth £499m. These provide repair and maintenance services to military homes, ensuring the SFA estate is maintained to the required standards."
        },
        {
            "heading": 2,
            "text": "Delivering Major Programmes and Projects"
        },
        {
            "text": "Every day, the airfields we maintain put aircraft in the sky, while the channels we dredge allow our ships to dock. DIO has a specialist Major Programmes and Projects team which manages these kinds of vital works to improve UK military capability."
        },
        {
            "text": "HMS Queen Elizabeth visiting the Northern Ammunition Jetty in March 2021, when renovation work was in progress [Crown Copyright / MOD 2021]Projects we’ve recently completed include a state-of-the-art training facility for submariners at HMNB Clyde and the refurbishment of the Northern Ammunition Jetty in Scotland to support the Royal Navy’s latest aircraft carriers. Our current programme of work includes a range of infrastructure upgrades at RAF Lakenheath to support the operation of US Air Force F-35 fighter jets, for which the airbase has recently become home."
        },
        {
            "heading": 2,
            "text": "Protecting the Defence estate "
        },
        {
            "text": "Last but by no means least, DIO is responsible for the Ministry of Defence Guard Service (MGS), a professionally qualified body of Civil Servants who provide unarmed guarding services at over 100 MOD sites across Great Britain. This includes locations such as MOD Main Building in London and the Naval bases at Portsmouth, Devonport and on the Clyde in Scotland."
        },
        {
            "text": "As well as ensuring the safety of our military sites and Service personnel who use them, MGS officers are very often the public face of the MOD, being the first point of contact for visitors, staff and contractors."
        },
        {
            "text": "Be sure to check our blog page regularly for future updates on how we are supporting the UK Armed forces to live, train and deploy at home and overseas."
        }
    ]
}