{
    "url": "https://ruralpayments.blog.gov.uk/2022/06/20/introducing-you-to-6/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Introducing You To"
    ],
    "pub_date": "2022-06-20T09:21:19+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Hi, my name is Rachel and I’ve worked for the Rural Payments Agency (RPA), previously Ministry of Agriculture, Fisheries and Food (MAFF) since June 1998. I’m based at the Exeter office."
        },
        {
            "text": "I currently work within the Basic Payments Scheme (BPS), processing annual BPS applications. BPS is the largest of the available rural grants and payments which provide help to the farming industry. There are a range of processes throughout the year, including checking the eligibility of an applicant’s claim (farmers need more than five hectares of agricultural land and five ‘entitlements’ to support their land to apply), the transfer of land and entitlements between applicants, processing young and new farmer applications, answering customer queries, processing remote sensing (aerial photography) inspections, payment queries…..the list goes on! Historically, the payment window ran from 1 December to June, although from this year, with many farmers facing rising costs, the BPS payment will be made in two instalments each year with the first payment of 50% from the end of July and the second from December."
        },
        {
            "text": "I also support the Customer Service Centre during the BPS application window between March and May, answering BPS telephone queries and helping customers complete their application forms, paper and online. Although extremely busy, I really enjoy this role. Coming from a farming background I find it easy to communicate with farmers and agents alike; I love the buzz of being able to offer help and support."
        },
        {
            "text": "This year, both the RPA and our customers face changes with the introduction of the Sustainable Farming Incentive (SFI) and the progressive reductions applied to BPS payments between 2021 and 2024. I want to continue to be there for our farmers, helping where I can and making a difference."
        },
        {
            "text": "Over the past 24 years I have mainly worked within the BPS and its predecessors; Integrated Administration and Control System (IACS) and Single Payment Scheme (SPS) although I spent some time with the British Cattle Movement Service (BCMS), National Reserve (NR), Rural Development Programme for England (RPDE) and helped with the 2001 Foot and Mouth disease outbreak."
        },
        {
            "text": "I remember everything being on paper, letters, telephone calls and face to face meetings before the RPA went digital! We used to greet farmers and agents daily in reception at our old Clyst House offices, with our busiest day being Friday as that was market day in Exeter too."
        },
        {
            "text": "Outside of work, I love being outside! I am spoilt where I live with both the coast and Dartmoor being very close. I love walking, cycling, and exploring rivers and coves. I am kept busy with my two teenage children although my eldest has recently passed her driving test which has helped lighten the load."
        },
        {
            "text": "Through experience, mainly as a child / teenager, I (mainly) believe that honesty is the best policy!"
        }
    ]
}