{
    "url": "https://ipa.blog.gov.uk/2022/06/20/reflecting-on-the-new-elizabeth-line-by-alex-milbank/",
    "title": "Reflecting on the new Elizabeth line by Alex Milbank",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Climate resilience",
        "Construction",
        "digital infrastructure",
        "Infrastructure",
        "Major projects",
        "Modern Methods of Construction",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2022-06-20T11:02:53+01:00",
    "content": [
        {
            "text": "Project Delivery Advisor, Alex Milbank, from the Infrastructure and Projects Authority (IPA) shares his experience of supporting the Department for Transport (DfT) in their delivery of the Crossrail project and attending an opening event for the Elizabeth line this May (2022).  "
        },
        {
            "text": "On Tuesday 24 May 2022, just over 13 years since construction on the Crossrail project formally began on 15 May 2009, the Elizabeth line opened for service. "
        },
        {
            "text": "Launch day "
        },
        {
            "text": "The months leading up to the opening of the Elizabeth line consisted of operational testing, including five large-scale staff volunteer exercises and I was privileged to take part in one of them. "
        },
        {
            "text": "I was delighted to be one of the first people to take a train from Woolwich to Farringdon as part of the trial exercise, where we were evacuated from the train before walking a short distance through the tunnel to Farringdon station, where we took part in a station evacuation. "
        },
        {
            "text": "During the stakeholder launch event, I was able to ride the Elizabeth line again, this time from Paddington to Canary Wharf, the day before the railway opened to the public."
        },
        {
            "text": "Above, (from left to right) the IPA team of Alex Milbank (Project Delivery Advisor), Becky Wood (Commercial Advisor - Infrastructure Transformation) and Stephen Dance (Director Commercial Advice and Delivery) celebrate the launch of the elizabeth line at the new Canary Wharf station."
        },
        {
            "text": "The railway has a total of 41 stations, all of which will have step-free access from the platform to street-level. The ground-breaking approach to accessibility drew on lessons learned from the London 2012 Paralympic Games, with the result being that the new railway will unlock parts of London that were previously very difficult for people with disabilities to access. "
        },
        {
            "text": "Ten of the stations on the line are brand new, each one demonstrating modern engineering and cutting-edge architecture. The 70 brand new purpose-built trains will significantly cut journey times across London and relieve pressure on the Transport for London (TfL) network by increasing rail capacity in central London by 10%. The trains are walk-through for wheelchair users, and have temperature-controlled air conditioning, Wi-Fi, and real-time travel information in each carriage. "
        },
        {
            "text": "Best practice "
        },
        {
            "text": "Reflecting on the project and the work completed before I joined the IPA two-and-a-half years ago, particularly when cross-referencing the work on Crossrail with the themes from the IPA’s Transforming Infrastructure Performance (TIP) initiative, it’s clear that there are notable successes to be celebrated, particularly within environment and sustainability. "
        },
        {
            "text": "One of Crossrail’s most prominent achievements is the use of three million tonnes of material excavated from the sites of tunnels and stations for a flagship nature reserve at Wallasea Island in Essex, as part of a landmark partnership with the RSPB (The Royal Society for the Protection of Birds). Additionally, the Elizabeth line created 55,000 jobs across the UK, recruited over 1,000 apprentices, and trained a new generation of engineers in tunnelling, underground construction, and railway engineering."
        },
        {
            "text": "On the TIP theme of data and insight, Crossrail used building information modelling (BIM) in the design, construction and project management of the railway. This includes the use of 3D and 4D modelling, for example to manage construction fit-out of mechanical, electrical, and plumbing systems. The use of BIM had multiple direct and indirect cost and time benefits, for example the analysis of 3D models with different planning scenarios at Farringdon station enabled £8m of potential costs to be saved."
        },
        {
            "text": "Reflection"
        },
        {
            "text": "DfT, IPA and Crossrail have documented the lessons learned so far from the Crossrail project in an accessible way so that future projects can learn from past challenges. I would urge fellow project professionals to consider the lessons documented in the joint DfT and IPA report on Lessons From Transport for the Sponsorship of Major Projects, the IPA’s brand new Project Routemap module on Systems Integration, and Crossrail’s own Learning Legacy site. "
        },
        {
            "text": "Continued development "
        },
        {
            "text": "The Elizabeth line is the culmination of a vision first conceived in its current form in the 1990s. Three decades later, the word ‘Crossrail’ evokes a wide spectrum of opinions and emotions, but there’s no doubt that the launch day on Tuesday 24 May 2022 represented an historic moment in UK infrastructure delivery. Further work is now being done to deliver the fully-connected line from Reading and Heathrow in the west to Shenfield and Abbey Wood in the east."
        }
    ]
}