{
    "url": "https://educationhub.blog.gov.uk/2022/06/t-levels-what-courses-are-available/",
    "title": "T Levels: What courses are available?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "T Levels"
    ],
    "pub_date": "2022-06-20T11:48:59+01:00",
    "content": [
        {
            "text": "Our ground-breaking new qualifications, T Levels - equivalent in size to three A Levels – are proving hugely popular."
        },
        {
            "text": "We launched the first T Levels in 2020 and now we’ve added new courses to the growing list of subjects you can do."
        },
        {
            "text": "Here’s everything you need to know about T Level qualifications and what’s available:"
        },
        {
            "heading": 3,
            "text": "What are T Levels?"
        },
        {
            "text": "T Levels are technical courses – equivalent in size to three A Levels – that combine study in a learning environment with a substantial industry placement so that students gain the skills and experience they need to progress into work, further study or an apprenticeship."
        },
        {
            "text": "T Levels have been designed so that not only are they of the highest standards, but also so that they equip those who study them with the skills and knowledge that will prepare them for the workplace, with content designed with over 250 employers including Fujitsu and Amazon."
        },
        {
            "heading": 3,
            "text": "When were T Levels introduced and how do they work?"
        },
        {
            "text": "The first wave of T Levels were introduced in 2020. They offer students a mixture of classroom-based learning and ‘on-the-job’ experience during an industry placement of at least 9 weeks."
        },
        {
            "text": "T Level courses include the following elements:"
        },
        {
            "heading": 3,
            "text": "What subjects are available at T Level?"
        },
        {
            "text": "The first three T Levels in Design, Surveying and Planning for Construction; Digital Production, Design and Development; and Education & Childcare were introduced in 2020."
        },
        {
            "text": "A further seven became available from September 2021 in subjects such as Health, Digital Support Services and Onsite Construction - and a further 13 subjects including Engineering and Manufacturing, Finance, Creative & Design and Legal will be introduced from 2022 and 2023."
        },
        {
            "text": "We recently announced plans to introduce a new Marketing T Level from 2025, which will give learners the chance to build skills in a growing sector."
        },
        {
            "heading": 3,
            "text": "What will the new Marketing T level offer?"
        },
        {
            "text": "The content of the course is still being developed but we want all T Levels to meet the needs of employers, while delivering the skills that students need to help them get a good job – so the content will reflect that."
        },
        {
            "text": "We know that marketing is a very popular profession for young people, and marketing companies are crying out for experienced talent."
        },
        {
            "text": "That is why we’re introducing a marketing T Level so that students can get on the route to a job or a top university or college course, and ultimately into a great career."
        },
        {
            "text": "You can find a list of available T Levels and more information here."
        },
        {
            "text": "The National Careers Service has all the information and advice about your choices to help you find the best path, including T Levels - visit www.nationalcareers.service.gov.uk/careers-advice."
        }
    ]
}