{
    "url": "https://ukhsa.blog.gov.uk/2022/06/20/the-siren-study-two-years-on/",
    "title": "The SIREN study: Two years on",
    "authors": [
        "Susan Hopkins"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-06-20T17:21:30+01:00",
    "content": [
        {
            "text": "Two years ago, we launched the SARS-CoV2- Immunity and Reinfection Evaluation Study, known as SIREN, the largest of its kind globally. The study set out to find answers to some of the most important questions about COVID-19."
        },
        {
            "text": "The SIREN study monitors infections in a large group of healthcare workers who provide samples for regular PCR and antibody testing.  Analysis of these samples helps the UK to evaluate the immune response to COVID-19, provides insight into COVID-19 reinfections and has helped us to build an understanding of the level of protection offered by vaccines."
        },
        {
            "text": "The scale of the SIREN study has been staggering. In two years, it has carried out over a million PCR tests, over 400,000 blood tests and engaged with almost 45,000 participants from 135 NHS sites across the UK."
        },
        {
            "text": "The number of tests, sites, participants and nations involved in the SIREN study. Data correct as of June 2022."
        },
        {
            "text": "We have helped answer some of the most pressing questions about COVID-19, enabling decision-makers – both national and locally – to control the spread of the disease. Two years into our research, here are the main things we have learnt:"
        },
        {
            "heading": 2,
            "text": "How effective is previous infection and vaccination against COVID-19?"
        },
        {
            "text": "In our first year we found that previous infection with COVID-19 offered high protection against reinfection for several months, during wild-type and Alpha-variant dominant periods. We also found that COVID-19 vaccination was highly effective in reducing infections (both symptomatic and asymptomatic) in the immediate months after vaccination."
        },
        {
            "text": "In our second year we investigated the durability of protection following vaccination and among those vaccinated after a previous infection, during the Delta-variant dominant period."
        },
        {
            "text": "We found evidence of waning protection six months after two vaccine doses in those without previous infection, and this informed advice on deploying booster doses. We also demonstrated the value of vaccination on those with previous infection, with those subsequently vaccinated having protection consistently higher than 90% for a longer period of time compared to those with previous infection who remained unvaccinated."
        },
        {
            "text": "When the Omicron variant emerged in December 2021, we found protection from either two doses of the vaccine or previous infection to wane, while a booster dose helped to restore some of this waning immunity. This research helped to inform the widening of the booster vaccination campaign."
        },
        {
            "text": "We have built collaborations with immunologists in multiple academic organisations to understand why some individuals get reinfections and breakthrough infections – this will be critical to understanding future vaccine targets."
        },
        {
            "heading": 2,
            "text": "How do we keep the study going? "
        },
        {
            "text": "The SIREN study would not be possible without the efforts and dedication of participants from around the UK, and we would like to say a huge thank you to these individuals. These participants have volunteered to undergo fortnightly testing and provide quarterly blood samples all while carrying out their day jobs in the NHS under some of the most challenging conditions the workforce has ever seen."
        },
        {
            "text": "We would also like to thank the 135 NHS sites who have encouraged their staff to participate in the study, including the all-important laboratory and research teams."
        },
        {
            "text": "Our approach to maintaining participant interest in the study included newsletters, webinars, video messages and celebration events. We also recruited a Participant Involvement Panel:"
        },
        {
            "heading": 5,
            "text": "SIREN Participant Involvement Panel, June 2022"
        },
        {
            "text": "We have also built strong multidisciplinary collaborations with academics from leading UK research institutions, enabling us to combine epidemiological, viral, immunological, genomic and clinical expertise."
        },
        {
            "heading": 2,
            "text": "What next? "
        },
        {
            "text": "We are really pleased that the SIREN study has been funded to continue participant follow-up in all four nations through to 31 March 2023. This is testament to how well SIREN is valued by those leading the COVID-19 response."
        },
        {
            "text": "As community testing has reduced, the surveillance role of SIREN in monitoring infection trends and emerging variants has become increasingly important to inform the national COVID-19 response.  SIREN will have an important function throughout the coming Winter while the NHS deals with seasonal pressures, with influenza, seasonal viruses and resulting staff absence."
        },
        {
            "text": "Going forward we will maintain our commitment to addressing vital research questions. What is the impact of new variants? What effect does reinfection have post vaccination? What is the impact of COVID-19 vaccine booster programmes?"
        },
        {
            "text": "This research would not be possible without the efforts and dedication of so many people, including participants, NHS sites, laboratory teams and more."
        },
        {
            "text": "A webpage to share more information about the SIREN study can now be found here."
        }
    ]
}