{
    "url": "https://mojdigital.blog.gov.uk/2022/06/20/unlocking-the-world-with-our-faces-and-fingertips/",
    "title": "Unlocking the World with our Faces and Fingertips",
    "authors": [
        "Kaushal Tailor"
    ],
    "categories": [
        "connected online",
        "Women in Tech"
    ],
    "pub_date": "2022-06-20T12:33:59+01:00",
    "content": [
        {
            "text": "We are blissfully hurtling around the universe with technology here on Earth and in space, where we literally unlock the world with our faces and fingertips. This got me thinking a little deeper."
        },
        {
            "text": "Being connected online, in most parts of the world, has been commonplace for many years. A global pandemic has boosted numbers and as of April 2022, 63% of the worldwide population are internet users - that’s 5 billion people, and 4.65 billion of them are social media users. "
        },
        {
            "text": "The conversations in digital technology change every week, and being immersed in this landscape for the best part of over 14 years professionally means keeping up, but also realising that not all technology stays for the long haul."
        },
        {
            "text": "It is so tempting to delve into the addictive world of NFT (non-fungible tokens) and own a little piece of something new, as well as possibly jumping into crypto social networking. "
        },
        {
            "text": "I never used to consider myself as a ‘Woman in Tech’ let alone a ‘Diverse Woman in Tech.’ Maybe I should have, but in my naivety I mostly forgot that I was the only female in all male teams, and the only ethnically diverse person in many meeting rooms - until in parts I was reminded, but then quickly forgot again!"
        },
        {
            "text": "As the times have changed, I now own these titles and embrace my journey from public service at the BBC, to the biggest tech company Google, and now here at Justice Digital working on such meaningful projects."
        },
        {
            "text": "Staying in this world of ‘Digital’ and ‘Technology’ always inspires and brings about continuous growth, development and wonder. The possibility of ‘What's next for the future of… (and this is where I can take my pick) Automation/Gaming/AI/VR/Social - The list is endless.  "
        },
        {
            "text": "My old film cameras are now considered vintage and cool, and I’m even thinking about raiding my parents garage for those sought after VHS tapes to sell on the many online marketplaces available."
        },
        {
            "text": "All that nostalgia aside, I wouldn’t want to be in any other industry at a time where the doors have opened even further for this messy, noisy, connected ‘other world’ we all seem to live and breath in. "
        },
        {
            "text": "Being online for many of us is who we have become and who we are. "
        },
        {
            "text": "Work and personal reasons make this statement true for some. I do feel like I am one of those people, but I also have found ways to be my former self from 1995! "
        },
        {
            "text": "Technology is wonderful when used and consumed for the right purposes, changing our spinning globe and beyond, challenging the human race with more questions than answers at times, but also empowering our decisions for the future."
        },
        {
            "text": "There is also a ‘Power Off’ button. "
        }
    ]
}