{
    "url": "https://childrenssocialcare.blog.gov.uk/2024/03/18/a-message-of-thanks-from-isabelle-trowler-cbe-chief-social-worker-for-children-and-families/",
    "title": "A message of thanks from Isabelle Trowler CBE, Chief Social Worker for Children and Families",
    "authors": [
        "Isabelle Trowler"
    ],
    "categories": [
        "Leadership",
        "Working in children's social care"
    ],
    "pub_date": "2024-03-18T09:30:01+00:00",
    "content": [
        {
            "text": "Social Work Week is the perfect time of year to acknowledge and appreciate the vital role that social workers play in our communities. Your dedication, compassion, and tireless efforts to support and protect vulnerable children and families are truly commendable. It's a time to reflect on the significant impact you make in improving the lives of others and how we can work together to try and resolve day to day barriers to the best that social work can be."
        },
        {
            "text": "Every social worker deserves this recognition for all your outstanding contributions to supporting families and protecting children."
        },
        {
            "text": "Your resilience, kindness, and expertise are central to effective practice, whatever the context; and through your knowledge and skill you can make a profound difference in the lives of children, young people and their families and communities every single day."
        },
        {
            "text": "The themes of this year’s Social Work Week are learning, connecting, and influencing and present a significant opportunity to acknowledge the importance of building a connected workforce, with a diversity of thought that enables you to effectively address the complex and multifaceted issues that children, young people and families encounter."
        },
        {
            "text": "In Social Work Week, I’m keen that you use the time together, to share good practice and most importantly, enhance your skills and expand your knowledge to continually improve the support you offer to the children, young people and families that you work with."
        },
        {
            "text": "There is lots of change on the horizon. In December 2023, the Department for Education published several documents, marking the first opportunity to ask all parts of the system to respond to the vision set out in ‘Stable Homes, Built on Love’."
        },
        {
            "text": "These publications, supported by a series of local pathfinders and pilots, will enable us to start to move closer to supporting families at an earlier stage, to introduce improved arrangements for child protection, and to promote the stronger use of data and evidence across children’s social care."
        },
        {
            "text": "I’d encourage you to read and reflect on the documents above and what they might mean for your practice and for practice within your local area. Also take a look at the Foundations website which is full of information about best evidence when working with children and families. Only last week they published the results of a successful therapeutic programme for unaccompanied asylum-seeking children; and very recently have published groundbreaking research into family group decision making, which I would love to see in action across all local authorities."
        },
        {
            "text": "I hope you have a great week! I am out and about so will definitely see some of you. Always remember to connect with your Principal Social Workers and your Practice Leaders. They are in very frequent contact directly through their respective national networks, with both myself and the department. Hearing your views about social work practice helps make our policy making better."
        },
        {
            "text": "Further information "
        }
    ]
}