{
    "url": "https://geospatialcommission.blog.gov.uk/2024/03/18/geospatial-summit-planet-people-place/",
    "title": "Geospatial Summit: Planet, People, Place",
    "authors": [
        "Isabella McGuinness, Senior Policy Advisor, Geospatial Commission"
    ],
    "categories": [
        "AI",
        "Data",
        "International",
        "Technology"
    ],
    "pub_date": "2024-03-18T10:04:47+00:00",
    "content": [
        {
            "text": "Mission one of the UK Geospatial Strategy 2030 highlights that geospatial applications are being transformed by technology innovation, from satellite technology to Artificial Intelligence, 3D mapping and insights into population movement. These changes are impacting the way geospatial applications can help to tackle global resilience challenges. "
        },
        {
            "text": "Communities all over the world face resilience challenges, which include increasingly severe and frequent shocks and stresses related to natural hazards, economic uncertainty, global supply chain disruption and a changing geopolitical landscape. The geospatial community has an important role to play in this area, from being integral parts of resilience planning efforts to providing information to help with measuring, modelling and mitigating global risks. "
        },
        {
            "text": "The Geospatial Summit, which is being held later this month, will seek to bring together a small group of leading policy, data and technology stakeholders to explore the ways in which new technology innovation will impact three resilience issues in particular: food security, natural hazards and sea level rise.  "
        },
        {
            "text": "The overall aim of the Summit is to further build a collective understanding of how geospatial technology innovation is impacting on planning, mitigation and adaptation for these resilience issues. This could include new types of analysis that can be undertaken, considerations around speed, scale and cost, the management of shocks in real time or in the preparedness to and mitigation from resilience challenges. Outputs from the Summit discussions will be published later this year. "
        },
        {
            "heading": 2,
            "text": "Discussion topics "
        },
        {
            "heading": 3,
            "text": "Remote sensing  "
        },
        {
            "text": "At the capture phase, advances in sensor technology are allowing more data to be captured at increasingly higher resolution and more frequently. The combination of satellite, aerial and ground-based LiDAR sensors are also allowing us to rapidly move from the 2D to 3D world, and increasingly to consider a fourth dimension of time. "
        },
        {
            "heading": 3,
            "text": "3D mapping "
        },
        {
            "text": "Whilst the ability to process data in 3D is nothing new, machine learning (ML), AI, cloud computing and increasing processing power are key enablers to making this data usable at scale. These innovations are enabling more rapid processing and interpolation of data. This gives us an opportunity to understand our environment, both natural and manmade, with an unprecedented frequency and level of detail. They also offer new opportunities to combine, interrogate and analyse data, creating new insights and knowledge in the process. "
        },
        {
            "heading": 3,
            "text": "Population movement data "
        },
        {
            "text": "On the human side, technology and behavioural change in relation to our use of mobile devices is creating new sources of data and an increasing ability to understand aggregated trends in population movement and behaviour. The billions of data points produced daily have great potential to support improved resilience planning, while also raising data management challenges and ethical questions that need to be considered. "
        },
        {
            "text": "You can sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on X and LinkedIn. "
        }
    ]
}