{
    "url": "https://insidehmcts.blog.gov.uk/2024/03/18/inspiring-justice-for-the-future/",
    "title": "Inspiring justice for the future",
    "authors": [
        "James Simmonds, Team Leader"
    ],
    "categories": [
        "Crime",
        "General",
        "Training and support"
    ],
    "pub_date": "2024-03-18T11:00:23+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Over 200 children, from Year 6 to Year 13 (10 - 18 year olds) recently attended Cardiff Magistrates’ Court to experience a real-life court environment as part of their studies. "
        },
        {
            "text": "Working alongside the National Justice Museum, we have been accommodating school visits to educate them about the justice system and how it functions.  "
        },
        {
            "heading": 2,
            "text": "Supporting local children "
        },
        {
            "text": "Earlier this year,  on one of these visits, Owen Pennell, Head trainer from the National Justice Museum hosted a weeklong training course on “Cyber Bullying“ for four Cardiff based schools; Cantonian, Whitchurch, Christ the King School and Fitzalan. "
        },
        {
            "text": "The training sessions were conducted in court two (our largest courtroom in Cardiff Magistrates’) and provided a fantastic backdrop for the children to experience a real-world court environment. "
        },
        {
            "text": "Every pupil received personal roles and responsibilities to act out (either speaking or non-verbal), which captivated the groups interest throughout the day. "
        },
        {
            "text": "This led to a high level of interaction and engagement from all participants, and it was great to witness first-hand how all the age groups got immersed in the experience. "
        },
        {
            "text": "Using our courtrooms to facilitate these sessions provided the perfect “real life” setting to fully captivate the audience and ensure all our visitors (teachers included) received a fully interactive, immersible journey through how courts work. "
        },
        {
            "heading": 2,
            "text": "Tackling cyber bullying "
        },
        {
            "text": "According to research from the University of Warwick, 29% of UK teenagers reported being bullied, with cyber bullying often now being used as an additional tool to supplement traditional forms of bullying.  "
        },
        {
            "text": "With this in mind, a real “cyber bullying” scenario was used to conduct the training, which allowed the children to delve into a hot topic, which remains a current and a growing area of concern across the UK right now.  "
        },
        {
            "heading": 2,
            "text": "The future is bright!"
        },
        {
            "text": "If we can provide lasting impressions of the legal environment to schools who participate in these learning sessions, then we can have a very positive influence on young people’s lives, behaviours - and potential career paths. "
        },
        {
            "text": "The feedback from both Owen and all the schools was fantastic, and they felt this unique opportunity should be made available to more schools and colleges, something that we’d also advocate for.  "
        },
        {
            "text": "This positive collaboration between the National Justice Museum and HMCTS is a great example of how we can work together for future generations and who knows, maybe we will see some of the recent attendees go on to become legal advisors, judges or our future HMCTS colleagues.  "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Ysbrydoli cyfiawnder ar gyfer y dyfodol"
        },
        {
            "text": "Yn ddiweddar, mynychodd dros 200 o blant, rhwng Blwyddyn 6 a Blwyddyn 13 (10 – 18 oed) Lys Ynadon Caerdydd i brofi amgylchedd llys go iawn fel rhan o'u hastudiaethau."
        },
        {
            "text": "Gan weithio ochr yn ochr â'r Amgueddfa Gyfiawnder Genedlaethol, rydym wedi bod yn darparu ar gyfer ymweliadau ysgolion i'w haddysgu am y system gyfiawnder a sut mae'n gweithredu."
        },
        {
            "heading": 2,
            "text": "Cefnogi plant lleol"
        },
        {
            "text": "Yn gynharach eleni, ar un o'r ymweliadau hyn, cynhaliodd Owen Pennell, Prif hyfforddwr Amgueddfa Gyfiawnder Cymru gwrs hyfforddi a oedd yn para wythnos ar \"Seiberfwlio\" ar gyfer pedair ysgol yng Nghaerdydd; Cantonian, Yr Eglwys Newydd, Ysgol Crist y Brenin a Fitzalan."
        },
        {
            "text": "Cynhaliwyd y sesiynau hyfforddi yn llys dau (ein ystafell llys fwyaf yn Llys Ynadon Caerdydd) a bu i hynny roi profiad a chefndir gwych i'r plant brofi amgylchedd llys go iawn."
        },
        {
            "text": "Cafodd pob disgybl rôl a chyfrifoldebau personol i’w hactio (naill ai'n siarad neu’n ddi-eiriau), a bu i hyn ennyn diddordeb y grwpiau drwy gydol y dydd."
        },
        {
            "text": "Arweiniodd hyn at lefel uchel o ryngweithio ac ymgysylltu gan yr holl gyfranogwyr, ac roedd yn wych gweld yr holl grwpiau oedran yn mwynhau’r profiad."
        },
        {
            "text": "Mi wnaeth defnyddio ein ystafelloedd llys i hwyluso'r sesiynau hyn greu amgylchedd “bywyd go iawn” perffaith i gadw sylw’r gynulleidfa yn llawn a sicrhau bod ein holl ymwelwyr (yn cynnwys yr athrawon) yn cael profiad gwbl ryngweithiol o weld sut mae’r llysoedd yn gweithio."
        },
        {
            "heading": 2,
            "text": "Mynd i'r afael â seiberfwlio"
        },
        {
            "text": "Yn ôl ymchwil gan Brifysgol Warwick, nododd 29% o bobl ifanc yn eu harddegau yn y DU eu bod yn cael eu bwlio, gyda seiberfwlio yn aml bellach yn cael ei ddefnyddio fel ffordd ychwanegol i ategu mathau traddodiadol o fwlio."
        },
        {
            "text": "Gyda hyn mewn golwg, defnyddiwyd senario \"seiberfwlio\" go iawn i gynnal yr hyfforddiant, a oedd yn caniatáu i'r plant ymchwilio i bwnc llosg, sy'n parhau i fod yn faes pryder cyfredol a chynyddol ledled y DU ar hyn o bryd."
        },
        {
            "heading": 2,
            "text": "Mae'r dyfodol yn ddisglair!"
        },
        {
            "text": "Os gallwn ddarparu argraffiadau parhaol o'r amgylchedd cyfreithiol i ysgolion sy'n cymryd rhan yn y sesiynau dysgu hyn, yna gallwn gael dylanwad cadarnhaol iawn ar fywydau, ymddygiadau pobl ifanc - a llwybrau gyrfa posibl."
        },
        {
            "text": "Roedd yr adborth gan Owen a'r holl ysgolion yn wych, ac roeddent yn teimlo y dylai'r cyfle unigryw hwn fod ar gael i fwy o ysgolion a cholegau, rhywbeth y byddem hefyd yn dadlau drosto."
        },
        {
            "text": "Mae'r cydweithrediad cadarnhaol hwn rhwng Amgueddfa Gyfiawnder Cymru a GLlTEF yn enghraifft wych o sut y gallwn gydweithio ar gyfer cenedlaethau'r dyfodol a phwy a ŵyr, efallai y byddwn yn gweld rhai o'r mynychwyr diweddar yn mynd ymlaen i fod yn gynghorwyr cyfreithiol, barnwyr neu ein cydweithwyr yn GLlTEF yn y dyfodol."
        }
    ]
}