{
    "url": "https://ipa.blog.gov.uk/2024/03/18/mind-the-gap-lessons-learned-from-crossrail-as-a-project-delivery-advisor/",
    "title": "Mind the gap! Lessons learned from Crossrail as a project delivery advisor",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "IPA Project Profession and Standards",
        "Major project assurance",
        "Major projects",
        "Project Delivery",
        "Project Delivery Profession"
    ],
    "pub_date": "2024-03-18T16:50:15+00:00",
    "content": [
        {
            "text": "Alex Milbank, a project delivery advisor at the Infrastructure and Projects Authority, reflects on his time working on the delivery of Crossrail, one of the most transformational infrastructure projects ever delivered in the UK. "
        },
        {
            "text": "Today (Monday 18 March), the Department for Transport (DfT) and Infrastructure and Projects Authority (IPA) published a joint report into the lessons learned from the sponsorship and governance of Crossrail. "
        },
        {
            "text": "I have had the privilege of supporting the delivery of Crossrail since I joined the IPA in 2019, and I am very proud to have played a small part, along with tens of thousands of others, in making the railway a reality."
        },
        {
            "text": "Our role at the IPA is to provide expert project delivery advice, support and assurance to government departments and their major projects. The vast majority of our effort is focused on those projects in the Government Major Projects Portfolio (GMPP). These projects represent the largest and most complex in government, and it follows that they are often the most expensive and difficult to deliver. It is therefore crucial that we take the time to properly learn the lessons from past GMPP projects and embed them fully into our delivery practices, so that we can realise our ambitions for public services and infrastructure, and secure the best value from the large sums of public funding invested in our major projects."
        },
        {
            "heading": 5,
            "text": "Source: Shutterstock"
        },
        {
            "text": "How can we learn from Crossrail?"
        },
        {
            "text": "The Elizabeth line is now so popular that it is hard to imagine life in London without it - around 700,000 journeys are made on midweek services, far-exceeding post-pandemic expectations. The popularity of the railway is perhaps not surprising given the savings in journey times that it has delivered, coupled with its accessibility and ultra-modern trains. But bringing the Elizabeth line into existence was not easy, and it is important that now the Crossrail project has been delivered, that we reflect on the challenges that we experienced and take the time to learn from those."
        },
        {
            "text": "I was delighted to support the production and publication of the joint DfT and IPA report into the lessons learned from the sponsorship and governance of Crossrail. The report was created as a follow-up to the 2019 IPA and DfT publication ‘Lessons from transport for the sponsorship of major projects’, and it tests whether the 24 lessons highlighted in that original piece of work remain relevant and impactful. "
        },
        {
            "text": "The report published today focuses primarily on the joint sponsorship model, which was established between Transport for London (TfL) and the DfT to deliver Crossrail, and the interaction of the joint sponsors with Crossrail Limited (CRL), which was the delivery body for the project. Many projects in government use this type of model where a government department acts as the project sponsor - responsible for setting requirements, owning the business case, and ensuring that the expected benefits are delivered – but where the hands-on delivery is managed by a separate entity that has the necessary capacity and capability to design and deliver the project, and contract suppliers as part of that. "
        },
        {
            "text": "This report will be particularly relevant to government colleagues working to deliver projects through that model, however I am confident that there will be value in the report for all project delivery professionals, especially those with an interest in the role of the project sponsor."
        },
        {
            "text": "The report highlights 9 key lessons relevant to project sponsorship, across areas such as capacity and capability, assurance, roles and responsibilities, and governance. These lessons are underpinned by over 90 interviews with key project stakeholders, multiple workshops, and hours of reading, in order to ensure that the lessons are based on reliable evidence. Its publication is the culmination of the hard work of its author (Matthew Symes, supported also by Rob Brighouse), the concerted efforts of DfT, TfL, and IPA, and also expertise and peer review supplied by the Association for Project Managers (APM) and the Major Projects Association (MPA). "
        },
        {
            "text": "It is an important piece of work, and together with the original ’24 lessons learned’ and the Crossrail learning legacy website, it ensures that the value of Crossrail and the Elizabeth line goes beyond the railway itself, and is extended into our ability to deliver major projects successfully, now and in the future. "
        },
        {
            "text": "Click here to read the full report. "
        }
    ]
}