{
    "url": "https://educationhub.blog.gov.uk/2024/03/social-work-week-2024-how-qualify-child-family-social-worker-free/",
    "title": "Social Work Week 2024: How to qualify as a child and family social worker for free",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Careers",
        "Social work"
    ],
    "pub_date": "2024-03-18T14:25:18+00:00",
    "content": [
        {
            "text": "Social workers play a crucial role and provide essential support to children and families facing a wide range of challenges, from poverty and mental health issues to domestic abuse and dealing with disabilities. "
        },
        {
            "text": "There are several fully-funded entry routes into a career in social work which allow you to train for free and earn a wage while you get the qualifications you need.  "
        },
        {
            "text": "Here’s everything you need to know. "
        },
        {
            "heading": 3,
            "text": "What do child and family social workers do?  "
        },
        {
            "text": "If you’re interested in improving the mental and emotional well-being of families, preventing crises, protecting children, and supporting parents, then a career in social work could be for you.  "
        },
        {
            "text": "Child and family social workers work to understand the unique circumstances and challenges that families face and develop tailored care plans to support them. "
        },
        {
            "text": "Read more about the role of a social worker via the National Careers Service. "
        },
        {
            "heading": 3,
            "text": "How do I become a child and family social worker? "
        },
        {
            "text": "To be a social worker, you must be registered with Social Work England.  "
        },
        {
            "text": "There are a range of different pathways to getting registered and becoming a child and family social worker, and several of these are fully funded.  "
        },
        {
            "heading": 3,
            "text": "Apprenticeships "
        },
        {
            "text": "Through an apprenticeship, you’ll earn a wage while gaining valuable on-the-job experience and working towards a recognised qualification in social work.  "
        },
        {
            "text": "Apprenticeships in social work are available at different levels, allowing you to enter the profession at the right career stage for you. Eligibility requirements will depend on which apprenticeship you are applying for.  "
        },
        {
            "text": "A degree apprenticeship in social work is now available, allowing you to earn a degree while gaining on-the-job experience. On completion, you will register with Social Work England as a qualified social worker. "
        },
        {
            "text": "Follow this link to find an apprenticeship in social work. "
        },
        {
            "heading": 3,
            "text": "Step Up to Social Work"
        },
        {
            "text": "Step Up to Social Work is a fully funded 14-month, full-time programme.  "
        },
        {
            "text": "If you want to become a child and family social worker and already have a degree but not in social work, you can train through this route.  "
        },
        {
            "text": "Trainees on the Step Up to Social Work course gain real social work experience, knowledge and skills, in combination with academic study. "
        },
        {
            "text": "There are no tuition fees to pay, and trainees also receive a bursary. "
        },
        {
            "text": "To apply to the programme, you’ll need to have: "
        },
        {
            "text": "This is a fast-track course which means participants qualify after 14 months and will be able to register with Social Work England. "
        },
        {
            "text": "Read more about Step Up to Social Work here. "
        },
        {
            "heading": 3,
            "text": "Frontline"
        },
        {
            "text": "The Frontline programme is a fully-funded fast track to Social Work programme.  At the end of the first year, participants will receive a Postgraduate Diploma in Social Work and can register as a social worker in England. "
        },
        {
            "text": "Participants can study towards a master’s degree in social work while working with children and families, combining academic study with practical experience.  "
        },
        {
            "text": "In their first year, trainees receive a bursary to contribute to living and travel costs, and typically go on to be employed and earn a salary in years two and three. "
        },
        {
            "text": "You can find out more about Frontline and apply here. "
        },
        {
            "heading": 3,
            "text": "How much do social workers earn? "
        },
        {
            "text": "Average salaries start at £27,000 a year for a newly qualified social worker and can rise to above £40,000.  "
        },
        {
            "text": "To support social workers early in their career, we’re also introducing a new framework which will give them the best start in the job. "
        },
        {
            "text": "Social workers can also access fully funded training programmes throughout their career. Explore these using a new tool for social workers looking to develop their careers. "
        }
    ]
}