{
    "url": "https://defradigital.blog.gov.uk/2024/03/18/why-were-celebrating-neurodiversity/",
    "title": "Why we’re celebrating neurodiversity",
    "authors": [
        "Robert Walker",
        "Lizzy Miller",
        "Tara Sanders",
        "Lauren Stephenson"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2024-03-18T13:30:27+00:00",
    "content": [
        {
            "text": "In Neurodiversity Celebration Week Lauren Stephenson, Tara Sanders, Robert Walker, and Lizzy Miller tell us how the Civil Service is celebrating its neurodiverse colleagues through supportive networks."
        },
        {
            "text": "We are all members of the Defra Neurodiversity Network, set up in 2008 to cultivate and integrate a workplace culture that embraces and celebrates all neurodifferences, with the aim to create a collaborative work environment where individuals can thrive."
        },
        {
            "text": "The network is working towards achieving this aim through two primary arms - visibility and action; we raise visibility of neurodiversity through various communications activities and providing educational resources, using these methods to promote inclusivity and empower individuals."
        },
        {
            "text": "Through action, our network champions the diversity of our members, advocating for change improvements and driving supportive initiatives that enable colleagues to work to their best ability."
        },
        {
            "text": "The network currently comprises of just under 1,000 members, from 35 Defra organisations, and is run by a group of volunteers. Each of us wanted to explain more about why we got involved; so if you’re interested, read on…….."
        },
        {
            "heading": 2,
            "text": "Rob Walker"
        },
        {
            "text": "I originally founded Defra’s Neurodiversity Network in 2008, and have worked for Defra for 33 years, first joining the Animal and Plant Health Agency, and now working in the core department."
        },
        {
            "text": "My school days were challenging due to my difficulties in reading and writing. The school considered me to be disruptive because of my struggles and placed me in the remedial class, never expecting me to achieve anything."
        },
        {
            "text": "I joined Defra many years ago, doing a ‘hands-on’ role. I respected the civil service as an employer and wanted to develop and progress within it, but my lack of academic achievements held me back, as did my self-criticism. I was diagnosed with dyslexia later in life, quickly recognising there was a stigma attached to neurodiversity. Something about being dyslexic seemed to stop people from wanting to employ me."
        },
        {
            "text": "After years of ‘imposter syndrome’, I decided that my dyslexia would not hold me back. I obtained new skills through private tuition with a dyslexic specialist, night schools, and self-learning. I was open with my manager about where I needed to develop. My employer supported my learning and development needs in work, as well as giving me access to Assistive Technology software."
        },
        {
            "text": "Without this software and support, I would never have recognised my own strengths of organisation and people engagement and would never have been able to move into the world of Project Management."
        },
        {
            "text": "As I shared my story, I spoke to many people who faced similar struggles, finding barriers to self-development and progression due to the stigma attached to neurodiversity, a stigma often only there because people don’t understand their neurodivergent selves, or the personal requirements of their neurodiverse colleagues."
        },
        {
            "text": "In Defra, we aim to be ambitious and inclusive, but I found some neurodiverse colleagues were unable to thrive. That’s when I founded the Neurodiversity Network, to build a community of support, empowerment, and understanding, to help these colleagues be the best version of themselves…and it’s working."
        },
        {
            "text": "I now see colleagues understanding themselves and their needs for the first time, feeling safe enough to speak to others who suffer the same struggles to discuss how to overcome barriers. I hear colleagues thanking us for educating them about the needs of their neurodiverse co-workers so they can adapt the way they work to create a more suitable and inclusive environment for all."
        },
        {
            "text": "I speak to colleagues who are progressing through the civil service, offering a new, unique and diverse perspective in projects, which helps those projects work for all end users."
        },
        {
            "text": "I have been on quite a journey in life, but inside of work, I am now in a role that I enjoy and am good at, and outside of work, I am a football and badminton coach, and volunteer as a chairperson for a community group which has raised tens of thousands of pounds to improve local facilities. I am achieving things now that I never would have dreamed to do as a child, and I am also helping others to do the same through the network. "
        },
        {
            "heading": 2,
            "text": "Lizzy Miller"
        },
        {
            "text": "I’m the Chair for Defra’s Neurodiversity Network, having worked for the Environment Agency for five years. My story is a little dark and sad, but sharing it has helped others, so I always try to be open about my struggles. I have a different childhood and didn’t grow up with people 'like me'."
        },
        {
            "text": "I was diagnosed with dyslexia where I received support throughout my university years due to my additional needs, but when I moved into the world of work, I felt lost."
        },
        {
            "text": "I was overwhelmed with office noise, I received feedback that my emails were too blunt, I couldn’t retain names of colleagues and I would lose my train of thought if I were interrupted. I felt that I wasn’t being as productive as I could be but didn’t know why. My team leader wanted to help me but didn’t know how to."
        },
        {
            "text": "Team leaders make a conscious effort to try to support colleagues, but if they don’t understand the needs of the individual, support doesn’t come naturally. No one else knew how to help me either and I didn’t know how to help myself, so I felt so alone."
        },
        {
            "text": "I reached out for support from the Dyslexic Network, but found they didn’t quite meet my needs, and was signposted to the Neurodiversity Network. Once I joined the Neurodiversity Network, it was like I had found ‘my people’."
        },
        {
            "text": "They understood my barriers, my struggles, they were asking the questions that I wanted to ask, they felt the same as me, they’d been in my situation before. I no longer felt alone, I finally felt like I’d found my identifiable family, with people celebrating me and my individuality."
        },
        {
            "text": "Since joining the Network I have been on my own autism journey, further being diagnosed with ADHD. Through being a Network member and understanding myself better, I have been able to understand how to adapt, to work to my best ability."
        },
        {
            "text": "I was able to identify that I needed counselling and have sought help, which has meant that I could move forward with my life. The network has allowed me to feel like I am me, that I can be me, I am not my condition and that I don’t have to mask who I am or hide away."
        },
        {
            "text": "Because I didn’t want other people to feel as alone or in as dark a place as I had been, I spoke to the Network about being more of an active member and volunteering for the committee. I became a deputy co-chair a year ago and have now moved into an acting chair role."
        },
        {
            "text": "I want to create awareness of our Neurodiversity Network so that others, who may not feel as though they can see a way forward, can find a community who can support them through the difficult times. I have discovery calls with new Network members and, for many of them, this is the first time they are speaking to someone who understands their situation or their feelings."
        },
        {
            "text": "A neuro-inclusive workplace is a brilliant place to be, but a neuro-inclusive workplace with a community of people pulling you out of the dark is even better. Navigating the world of work has helped me find a new community, which in turn has helped pull me into a better place."
        },
        {
            "heading": 2,
            "text": "Lauren Stephenson"
        },
        {
            "text": "As Head of Communications for Defra’s Neurodiversity Network I’m passionate about inclusive communications. Being part of the network has really helped me to develop into a role that I never had imagined I’d be able to do."
        },
        {
            "text": "Seven years ago, I was diagnosed with dyslexia after discussing my challenges with focus, overstimulation, and tasks heavy on words with my workplace's Employee Assistance Programme. Receiving this diagnosis brought clarity to various aspects of my life, with many elements finally making sense."
        },
        {
            "text": "As I have learned to manage with my diagnosis over the years, I have found Defra to be a very inclusive employer; treating colleagues as people and not a number, supporting people’s mental health and wellbeing issues, and putting reasonable adjustments in place to help people to thrive, no matter their disability. But, despite all of this, I still sometimes felt alone in my struggles with dyslexia."
        },
        {
            "text": "And that’s when I found the network. After seeing a presentation by Rob, I found myself resonating with much of what he said and made the decision to join in 2023. I finally found a community of people like me, who understood what I was going through."
        },
        {
            "text": "Being part of the network is amazing as I no longer feel alone, and I have learned so much about how to manage my dyslexia further, subsequently enabling me to be more productive in work. The great thing about the network is that it has colleagues who are neurodiverse joining, and colleagues who are not, but all simply wish to learn more to help themselves and their colleagues. Everyone is respectful, we work together to help each other, and the network really does feel like my family."
        },
        {
            "text": "As the network had given me so much, I wanted to give back and become an active member to help spread the message. Struggling with reading and writing, I wasn’t sure a role which would include written communications was for me, but I soon realised that, had it not been for Rob’s communications, I would not have found this Network and would not be so well supported. So, I decided to jump in headfirst and accept the role, not letting my dyslexia stop me from helping others."
        },
        {
            "text": "I’ve developed my communication skills, building a supportive team behind me to promote the network within Defra. Working tirelessly with my Head of Relationships to expand our reach to all 35 linked organisations, our aim is to ensure that no one feels left behind. Through creating engaging and supportive sessions, where colleagues can learn and share experiences, to collaborating on the production of the network’s very first communications strategy, I have proven to myself just how capable I actually am."
        },
        {
            "text": "Having really struggled with communications before my diagnosis, I am passionate about promoting inclusive communications, tailoring them for our neurodiverse colleagues. Aiming to lead by example within the Network, whilst educating others. It’s amazing how much more productive an organisation can be when their communications resonate with anyone, no matter their communications needs, and it is amazing how much more colleagues thrive when they feel ‘heard’."
        },
        {
            "text": "I’m so glad I took on the opportunity and challenge of being involved with this etwork, something I never thought I would do, being dyslexic. I hope I can inspire others to recognise their own abilities, not seeing their neurodiversity as a barrier."
        }
    ]
}