{
    "url": "https://forestrycommission.blog.gov.uk/2023/01/25/apply-now-for-the-forestry-apprenticeship-2023/",
    "title": "Apply now for the Forestry Apprenticeship 2023",
    "authors": [
        "Gareth Hopkins"
    ],
    "categories": [
        "Careers",
        "Woodland management"
    ],
    "pub_date": "2023-01-25T10:40:43+00:00",
    "content": [
        {
            "text": "Back in September we welcomed the first 15 people onto our apprenticeship - the UK’s first degree-level apprenticeship in forestry, which we're leading with the University of Cumbria and the Institute of Chartered Foresters."
        },
        {
            "text": "Four months on, I think it’s fair to say we are well and truly underway. Friendships have been forged, modules have been completed, and there’s still a genuine buzz of enthusiasm among our apprentices and the Forestry Commission area teams that they’ve joined."
        },
        {
            "text": "Everyone has put in so much hard work and made some great memories, from getting a glimpse inside the forestry industry at the APF event in Warwickshire, to a rainy but enjoyable week in Ambleside in the Lake District for our silviculture module. They also couldn’t resist getting up into the treetops at Go Ape in Cannock Chase, Staffordshire on a team building session."
        },
        {
            "text": "One of the big successes is how well the group has gelled, and all our apprentices agree that there’s a great sense of camaraderie and support in the group."
        },
        {
            "text": "Applications are now open (closing date Sunday 26 February, 2023) for our next 15 apprentices. Might you be one of them? If you have a passion to pursue a career in Forestry and are looking for an exciting pathway into the industry, we’d love to hear from you."
        },
        {
            "text": "Perhaps you’re interested but keep thinking of all the reasons not to. We’ve addressed some of those reasons here. If you’ve been talking yourself out of applying, keep reading…"
        },
        {
            "heading": 3,
            "text": "I haven’t studied for years. Will I have to take exams?"
        },
        {
            "text": "No. There are no exams. It’s a continual assessment process with assignments submitted throughout the course and an endpoint assessment interview at the end of the three-year course.\nEach module has a tutor, offering expertise and support, and the programme has its own trainers, myself among them, who you’ll be in regular contact with and who provide ongoing support throughout the course.\nMost of our current apprentices have joined us after a break from formal education. It’s important to remember that only 20% of the course is academic study and 80% is on-the-job training. For most of the time, you’ll be based with one of the Forestry Commission’s area teams for hands-on learning among professionals."
        },
        {
            "heading": 3,
            "text": "I haven’t got any experience in Forestry"
        },
        {
            "text": "That’s precisely what the course is for. We will help you gain the experience, qualifications and connections that will help you find a job in the industry when the course ends. Our current apprentices joined us from a real mix of professions. We’ve got former teachers, someone from the military, a company director, and IT professionals...what really counts is having a passion for forestry and the commitment to see the three-year course through."
        },
        {
            "heading": 3,
            "text": "I can’t afford to take time out from working to study."
        },
        {
            "text": "This is a paid role (£23,098 pa), so you’ll earn as you learn and become qualified. Course fees are covered, as well as essential books, equipment, and student membership to The Institute of Chartered Foresters. Every eight weeks the group gets together for training, so travel, accommodation and meals for these trips are all taken care of."
        },
        {
            "heading": 3,
            "text": "Will it improve my chances of getting a job in Forestry?"
        },
        {
            "text": "Yes. On completion, you’ll have a Level 6 Apprenticeship in Professional Forestry, BSc (Hons) Professional Forester, and the potential to be an accredited member of The Institute of Chartered Foresters. You’ll also have valuable first-hand experience and contacts. The Forestry sector is fully supportive of the apprenticeship because there’s a real need for skilled foresters to enter the industry. It will open up some great opportunities."
        }
    ]
}