{
    "url": "https://socialcare.blog.gov.uk/2023/01/25/the-principles-of-delegated-healthcare/",
    "title": "The principles of delegated healthcare",
    "authors": [
        "Deborah Sturdy",
        "Oonagh Smyth"
    ],
    "categories": [
        "Care and support",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2023-01-25T15:19:58+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Building on current practice"
        },
        {
            "text": "These voluntary principles will complement rather than replace existing person-centred practice to support safe and effective delegated healthcare activity to social care workers by regulated healthcare professionals in a range of social care settings."
        },
        {
            "text": "We know delegation to social care isn’t new and where it works well with the right governance, protocols, education, training and support, it can bring wider benefits to people drawing on care and support."
        },
        {
            "text": "These guiding principles can demonstrate where appropriate delegation can enable people drawing on care and support to have greater choice and control. Person-centred decision making allows people more flexibility to suit their needs and lifestyle, giving a better experience of care and a positive impact on their health and wellbeing."
        },
        {
            "heading": 2,
            "text": "Our progress"
        },
        {
            "text": "In developing the principles, we have engaged with health and social care professionals, people with lived experience, regulators and our colleagues in Wales, Scotland and Northern Ireland, as well as establishing an expert reference group. We’ve gathered a wealth of information that will shape the principles with publication planned for late spring 2023."
        },
        {
            "text": "Feedback from our engagement has been positive, recognising the value of delegation for all involved. Key themes include the focus on a person-centred approach to delegation with consent, choice and control at the heart of decision-making. Other themes include resourcing and commissioning practices, the importance of clear and defined roles and responsibilities and how to create the right conditions for collaborative working."
        },
        {
            "text": "Our partnership work with the National Care Forum, Association of Directors of Adult Social Services (ADASS), St Martins Care, Lincolnshire Care Association (LINCA) and the Foundation of Nursing Studies (FoNS) has been invaluable.  We have gathered insight and learning from their networks and individual projects, resulting in tools and resources to support implementation of the guiding principles."
        },
        {
            "heading": 2,
            "text": "The work continues"
        },
        {
            "text": "We continue to meet with as a quarterly steering group and held the second meeting of the Expert Reference Group this month, bringing together key sector stakeholders to shape the principles and share ideas. Our engagement will continue as the guiding principles work on delegation evolves."
        },
        {
            "text": "The guiding principles will provide a solid foundation for safe and effective delegation and our next steps will be to support implementation across a number of areas, using the learning to make continuous improvements with sector led accountability and ownership."
        }
    ]
}