{
    "url": "https://earlyyears.blog.gov.uk/2023/01/25/what-do-i-need-to-do-to-prepare-for-my-early-years-inspection/",
    "title": "'What do I need to do to prepare for my early years inspection?'",
    "authors": [
        "Wendy Ratcliff HMI, Principal Officer, Early Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2023-01-25T12:30:23+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "This is probably the question that early years providers and practitioners ask us most."
        },
        {
            "text": "Our answer is always the same… nothing!"
        },
        {
            "text": "We want you to have the confidence and freedom to do what you do every day. Our inspectors are tasked with finding out what it is like to be a child at your setting every day and not just on the day of the inspection. Therefore, we ask that you don’t to do anything differently just for the inspection. In our experience, ‘preparing for inspection’ merely puts unnecessary pressure on you and your staff to ‘perform’ on the day. This may result in staff feeling less confidence in knowing that what they are doing is right for their children. And apart from anything else, the children are always the first to tell our inspectors if anything is out of the ordinary for them!"
        },
        {
            "text": "As providers and practitioners, you know the children in your setting best. If you have an ambitious curriculum that sequences the knowledge that children need, and children know and remember that curriculum, inspectors will see this. There is absolutely no need to do anything other than what you have already planned."
        },
        {
            "heading": 2,
            "text": "Paperwork"
        },
        {
            "text": "Talking of plans, they do not need to be written down just for inspectors’ benefit. You can explain to inspectors what you want children to learn and why. That said, if you choose to make written plans because it works better for you, that is absolutely fine as well. Just don’t do it because you think we want to see them."
        },
        {
            "text": "This leads me onto one of the other commonly asked questions about preparing for inspection:"
        },
        {
            "text": "’Should I have a folder of paperwork marked ‘Ofsted’?’"
        },
        {
            "text": "Despite what you may have heard, inspectors do not want to see a particular amount or type of paperwork. The early years foundation stage (EYFS) sets out what you must record. You should use whatever approach to paperwork suits you and you are free to file it however you like. But please do not be offended if our inspectors would rather understand your plans, policies and procedures by talking about them rather than reading them. We’ve told inspectors not to ask to see paperwork unnecessarily."
        },
        {
            "heading": 2,
            "text": "The post-inspection survey"
        },
        {
            "text": "You may have heard about our strategic priority to give all children ‘the best start in life’. As part of fulfilling this aim, we’ll continue to engage with the sector and share our insights from our inspections. One of the ways you can help us is by completing the post-inspection survey. This short survey asks for your views on inspection and the impact it is likely to have in improving your own practice. We use these valuable insights to help us improve what we do."
        },
        {
            "heading": 2,
            "text": "Finding out more"
        },
        {
            "text": "We are open and transparent about what we expect from our inspectors and from providers. We know inspection can make you and your staff nervous. So if you want to find out about what will happen on an inspection, have a look online. We’ve refreshed our education inspection framework (EIF) and EYFS page, where we address individual aspects of inspection. And if parents of the children you look after have questions, you can point them to the inspection guides that we’ve recently published specifically for them."
        },
        {
            "text": "We hope you find these resources helpful, but please do not think you have to scour every line of these documents in preparation for an inspection – you don’t as that’s not what they’re there for. We want these resources to be helpful for you. I said at the start, that our inspectors want to know what it’s like to be a child in your setting. If they’re looked after and learning well, we will recognise that, without needing to see reams of paperwork."
        },
        {
            "text": "Have the confidence to do what you do everyday and please don’t do anything different, just because an inspector calls."
        }
    ]
}