{
    "url": "https://deframedia.blog.gov.uk/2022/09/01/new-guide-on-mitigating-impact-of-avian-influenza-in-wild-birds-published/",
    "title": "New guide on mitigating impact of avian influenza in wild birds published",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories",
        "Wildlife"
    ],
    "pub_date": "2022-09-01T11:32:54+01:00",
    "content": [
        {
            "text": "There has been positive coverage including in the Independent, Farming UK and Wales Online, of our announcement that practical guidance has been published to support land managers, the public and ornithological and environmental organisations in their response to the growing threat of avian influenza to wild birds."
        },
        {
            "text": "The ‘Mitigation Strategy for Avian Influenza in Wild Birds in England and Wales’ advises land managers on how to make natural areas safe for the public, for example by adding signage warning visitors of the risk of avian influenza and what they can do to protect themselves, and having contingency plans to allow them to quickly respond to outbreaks."
        },
        {
            "text": "The guidance also sets out the government’s approach to monitoring the spread of avian influenza in wild bird populations and better understanding how the disease is distributed geographically and in which species of birds, with international best practice and the latest scientific and ornithological evidence underpinning this."
        },
        {
            "text": "Defra Biosecurity Minister Lord Benyon said:"
        },
        {
            "text": "This year’s avian influenza outbreak has been the largest and longest ever on record in the UK and in many parts of Europe, with infections continuing beyond the normal winter period and now hitting wild birds and breeding colonies of seabirds that are not typically affected."
        },
        {
            "text": "This comes as the UK’s Deputy Chief Veterinary Officer has declared an Avian Influenza Prevention Zone across Cornwall, Devon and parts of Somerset to mitigate the risk of further outbreaks of disease occurring."
        },
        {
            "text": "Covered extensively in regional media, the prevention zone means that all bird keepers in the area must follow strict biosecurity measures, such as cleansing clothing, footwear and equipment before and after contact with birds, reducing movement to and from areas where birds are kept, and thoroughly cleansing and disinfecting housing on a continuous basis."
        }
    ]
}