{
    "url": "https://defrafarming.blog.gov.uk/2022/09/01/sustainable-farming-incentive-more-farmers-can-apply-without-being-invited/",
    "title": "Sustainable Farming Incentive: more farmers can apply without being invited",
    "authors": [
        "The Team"
    ],
    "categories": [
        "environmental land management schemes",
        "Things we're doing"
    ],
    "pub_date": "2022-09-01T11:00:36+01:00",
    "content": [
        {
            "text": "In June, we opened the Sustainable Farming Incentive (SFI) for applications.  "
        },
        {
            "text": "We’ve put a new online service in place to make it easier for farmers to apply. The automated service lets you see which parts of your land are eligible for each SFI standard. This, in turn, makes it quicker for us to process applications."
        },
        {
            "text": "Last month, we shared an early update on how things were going. In that post, we described our steps to make sure that everyone who applies had a smooth and straightforward experience."
        },
        {
            "text": "The early rollout of our new service was gradual and managed carefully by design. We wanted to refine it based on what we learned."
        },
        {
            "text": "In the first few weeks of the new service, we asked farmers with land in Countryside Stewardship (CS) and Environmental Stewardship (ES) to get in touch with the Rural Payments Agency to arrange access to the service."
        },
        {
            "text": "We’re finding that our new service is working well for people. As expected, we're turning around people’s applications much faster than before. It’s currently taking about 2 weeks (sometimes quicker). This compares with an average of 6 months in our SFI pilot."
        },
        {
            "text": "Having seen how the online service works for people and refined it based on our learning so far, we’re now ready to allow more farmers to access directly, without needing to contact the RPA first."
        },
        {
            "text": "From 1 September, if you have land in a CS or ES agreement, but not on common land, you can now apply online directly by signing into the Rural Payments service."
        },
        {
            "text": "Around 82,000 farmers will be able to access the service directly."
        },
        {
            "text": "Common land is more complex, because it generally involves multiple parties and rights. We are working with commons farmers and other experts to refine and test the automated service so that they can also access it directly."
        },
        {
            "text": "Meanwhile, farmers who wish to apply on common land, or who have common land as part of their farm business on the Rural Payments service, still need to contact the RPA first and they will support them to apply."
        },
        {
            "text": "If you’re thinking of applying and would like to learn more first, the SFI guidance on GOV.UK contains information about eligibility, payment rates and standards."
        },
        {
            "text": "You can also listen to a podcast on the subject, with SFI lead Jonathan Marsden and Cambridgeshire farmer, Martin Lines."
        },
        {
            "text": "Don’t forget, there is no application window so you can apply whenever it suits you."
        },
        {
            "text": "For updates on our work, subscribe to the Future Farming blog. We post every week."
        },
        {
            "text": "Watch our video to find out how to apply for a Sustainable Farming Incentive standards agreement."
        },
        {
            "text": " "
        }
    ]
}