{
    "url": "https://queensawards.blog.gov.uk/2022/09/01/top-tips-for-a-successful-queens-awards-application-2/",
    "title": "Top Tips For a Successful Queen's Awards Application",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Innovation",
        "International trade",
        "Promoting opportunity",
        "social mobility",
        "Sustainable development"
    ],
    "pub_date": "2022-09-01T10:53:45+01:00",
    "content": [
        {
            "text": "UK businesses have less than one week left to apply for The Queen’s Awards for Enterprise.  "
        },
        {
            "text": "Now more than ever, is a vital time for great UK businesses to be celebrated and recognised, so The Queen’s Awards Office have compiled a list of top tips to help you put together a winning application!"
        },
        {
            "text": "You will then be able to download a PDF and Word version of the application form, which will help you to plan your responses and share the form with others in your business such as your accountant, marketing team and CEO. "
        },
        {
            "text": "Winning applications avoid technical jargon when describing their product/service/approach and why it is particularly successful, innovative or sustainable. The application must be easy to read and understand to assessors, even if they are not necessarily experts in your sector. "
        },
        {
            "text": "Please provide qualitative and quantitative evidence to support your statements.  "
        },
        {
            "text": "For example:\na) If you are talking about how innovation has increased efficiency of your business, provide quantitative evidence of this increase.\nb) If you are talking about a social mobility programme, provide evidence of how your programme has benefited your organisation, community, staff and workforce. We also need to see evidence that your organisation has improved the employability of the people engaged in your programme. "
        },
        {
            "text": "We cannot emphasise enough how important it is to tell your story in your own words. We want to hear about your personal journey; why did you start the business and the key drivers for you in making your business successful and how you have tackled any hurdles along the way.  "
        },
        {
            "text": "This will allow others such as the business owner, and colleagues to help and contribute to your application, as well as ensuring that someone else will have access to the form in your absence. You can also add external collaborators such as a PR agency or other contractor. "
        },
        {
            "text": "Plan your application properly, to allow enough time to complete it. You can do this by:  "
        },
        {
            "text": " "
        },
        {
            "text": "The Queen’s Awards Office are here to help you with any questions you may have. \nOur Helpline is available Monday – Friday, 9-5pm:\nContact us:\nEmail: queensawards@beis.gov.uk\nTelephone Helpline: 020 7215 6880 "
        },
        {
            "text": "The deadline for the 2023 Queen’s Awards for Enterprise is 1pm on 6 September. Apply now, before it's too late: https://www.gov.uk/queens-awards-for-enterprise "
        },
        {
            "text": "Good luck to all the UK businesses applying for the Awards. We look forward to receiving your application! "
        }
    ]
}