{
    "url": "https://aphascience.blog.gov.uk/2025/07/15/apha-scientific/",
    "title": "Behind the scenes at APHA Scientific",
    "authors": [
        "Michelle Felstead"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2025-07-15T12:49:12+01:00",
    "content": [
        {
            "text": "If you have not come across APHA Scientific before, you are not alone. We are a small part of a big agency, but we are doing some pretty important work, and now we have a new website to help us shout about it."
        },
        {
            "text": "APHA Scientific, our Business Development team, sits within the Animal and Plant Health Agency (APHA). While the agency delivers vital work for the UK government, like controlling disease outbreaks, testing for new threats, and researching ways to protect animal and plant health, APHA Scientific is the team that takes that work and makes it available to the wider world."
        },
        {
            "text": "It might mean offering biological reagents to veterinary companies overseas. Or it might mean offering something more bespoke like helping a company identify viruses in their samples, using scientific expertise to support research and development, or providing access to high containment laboratories and specialist animal housing. Whatever it is, the aim is the same: to help protect animals, people, the environment, and the economy."
        },
        {
            "heading": 2,
            "text": "Taking great science beyond government"
        },
        {
            "text": "Our job in APHA Scientific is to take what the agency does so well and offer it, responsibly, to people outside of UK government."
        },
        {
            "text": "This can include organisations such as private veterinary laboratories, universities and research institutions, pharmaceutical and biotechnology companies, regulators and overseas governments, vets, farmers, and others working in the animal health industry."
        },
        {
            "text": "If there is a way to make something useful, relevant, and ethical, and if we are not competing with UK industry, we find a way to offer it."
        },
        {
            "text": "We do not do it just to bring in income (although that helps!). We do it to make the most of the agency’s expertise, reach more people, and reinvest in research that benefits everyone. It is about keeping vital skills alive, sharing our knowledge, and making sure public investment in science goes further."
        },
        {
            "heading": 2,
            "text": "What we offer"
        },
        {
            "text": "Over the years, we have built up a wide range of specialist products and services — all backed by expert scientists, high-tech laboratories, and a business development team who help make it all happen."
        },
        {
            "heading": 3,
            "text": "Products and services available include:"
        },
        {
            "text": "It is a long list, which is constantly evolving as we respond to new challenges and opportunities. If you do not see what you are looking for, just get in touch – we might still be able to help or point you in the right direction."
        },
        {
            "heading": 2,
            "text": "Spotlight on VETQAS"
        },
        {
            "text": "A good example of what APHA Scientific does is VETQAS® Proficiency Testing (PT)."
        },
        {
            "text": "VETQAS was established in the 1970s as a way of checking the accuracy of APHA’s own laboratory work. Today, it is a market-leading proficiency testing service, helping veterinary laboratories across the world stay on top of their game."
        },
        {
            "text": "Diagnostic laboratories receive \"blind\" samples from VETQAS, carry out their usual tests, and report their findings. The laboratory then receives a confidential inter-laboratory report comparing their results with others. This helps them spot any issues, meet accreditation standards, and continually improve."
        },
        {
            "text": "VETQAS offers over 100 commercial PT schemes with customers spanning over 80 countries and is UKAS-accredited to ISO/IEC 17043."
        },
        {
            "text": "In short, we help laboratories make sure they are diagnosing animal diseases correctly, which is vital for animal health, food security, and trade."
        },
        {
            "heading": 2,
            "text": "Why our new APHA Scientific website matters"
        },
        {
            "text": "Our new website has brought everything together in one place. It is clearer, faster, mobile-friendly, and designed to make it easier for people to explore what we offer. It includes built in features like:"
        },
        {
            "text": "And this is just the start — we are already planning future updates to improve the experience even more."
        },
        {
            "heading": 2,
            "text": "Global reach, personal conversations"
        },
        {
            "text": "The website and digital marketing channels are a key part of how we connect with the world, but not the only way."
        },
        {
            "text": "Each year, our small team of business development managers, marketers (that is me!), and technical experts attend events across the UK and internationally. We go as delegates, exhibitors, and sponsors, and we use those opportunities to talk face-to-face with current and potential customers."
        },
        {
            "text": "From animal health expos in Europe to lab science conferences in Asia, these conversations help us understand what people need — and explain how we can help."
        },
        {
            "text": "It is not just about selling. It is about building partnerships, sharing knowledge, collaboration, and making sure the right people know how we can support them."
        },
        {
            "heading": 2,
            "text": "Behind the scenes: The people making it work"
        },
        {
            "text": "One thing I have come to really value in this role is the way our business development managers (BDMs) bridge the gap between science and business. Our BDMs bring a mix of expertise such as veterinary, scientific, technical, legal and commercial contract backgrounds. They can handle everything from technical discussions to negotiating License Agreements. They understand what our customers are asking for, but also what our scientists can realistically deliver. They manage expectations, spot opportunities, and keep projects moving."
        },
        {
            "text": "That close connection between science and service is what makes APHA Scientific work so well."
        },
        {
            "text": "And while we are a commercial team, our mindset is very much aligned with the wider APHA mission: to protect animal and plant health to benefit people, the economy and the environment."
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "I am really proud of the work we do, and I am proud that we have now got a platform that helps us tell that story better."
        },
        {
            "text": "This new website is not just a digital upgrade, it reflects how far we have come, how much we have learned, and how much more we have got to share."
        },
        {
            "text": "If you work in animal health, science, or just have an interest in what APHA does, have a look. Whether you are down the road or across the globe, we are here, we are open for business, and we are ready to talk."
        },
        {
            "text": "For further information and to speak to one of our Business Development Team please contact:"
        },
        {
            "text": "+44 (0)3000 600001 | aphascientific@apha.gov.uk | www.aphascientific.com"
        }
    ]
}