{
    "url": "https://environmentagency.blog.gov.uk/2025/07/15/managing-the-impacts-of-drought-in-the-midlands/",
    "title": "Managing the impacts of drought in the Midlands",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Drought",
        "Environment Agency",
        "Fisheries and biodiversity",
        "hydrometry",
        "Nature",
        "Ofwat",
        "Rivers",
        "Sustainability",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2025-07-15T11:10:17+00:00",
    "content": [
        {
            "text": "What is the situation in England? The National Drought Group met today (15 July) and a drought was declared in the West and East Midlands. The region joins the north-west and Yorkshire which officially declared drought last month. Dry weather continues to impact water resources across England requiring water companies to take action to manage demand with the public being urged to use water wisely. Across England, rainfall was 20% less than long term average for June. June was also the hottest on record for England, with two heatwaves driving unusually high demand for water. "
        },
        {
            "text": "What is the water situation in the Midlands?  In the Midlands, public water supplies are currently secure, but we are seeing adverse effects on the natural environment due to the ongoing lack of rain. And while groundwater levels have been normal across the region, they are starting to fall. Meanwhile, river levels are already low with some river flows in the region at their lowest for June since 1976. For example, the River Severn catchment received only two-thirds of the rainfall it normally does in June, while the Trent catchment fared worse, with only 37% of its long-term average for June. Lack of rain combined with warm temperatures lead to low water levels and less oxygen in rivers and streams – a stressful situation for the wildlife that depend on them. "
        },
        {
            "text": "How is wildlife being supported? One of the Environment Agency's roles is to ensure there is enough water for wildlife as well as for the public water supply. So, what is the Environment Agency in the Midlands doing to achieve this during the current prolonged period of dry weather? We operate water supplement schemes that support rivers – such as the River Severn Regulation, whereby releases from well-stocked reservoirs upstream of Bewdley in Shropshire add water to the river. "
        },
        {
            "text": "How is the Environment Agency working with abstractors? As the government body responsible for licensing abstractions in England (taking water from the environment), we encourage farmers and growers to take and use water in a sustainable way. This includes putting temporary limits on abstraction licences and supporting water transfers (where someone with water to spare supplies another abstractor). We also ensure water companies have robust drought plans in place, should they need to activate them (it's your water company who will decide whether or not a hosepipe ban is needed this summer). Find out more about how we are supporting the farming community to manage the impacts of dry weather. "
        },
        {
            "text": "How is the Environment Agency supporting fish? We respond to reports to our incident hotline of fish in distress, due to low water or low oxygen – or both. On just one weekend in June, Environment Agency officers rescued over 300 brown trout and salmon from the River Redlake in south Shropshire. You can report sightings of fish in distress to our incident hotline on 0800 80 70 60. We also help fisheries managers such as angling clubs to protect fish stocks – for example, by providing equipment to pump oxygen into the water. Last but not least, we monitor environmental indicators – including rainfall data provided by the Met Office as well as the water level information provided by our network of river and groundwater gauges. So that's what we do. But it's fair to say that everyone has a part to play in ensuring there's enough water for wildlife as well as for people – water companies, farmers and growers, businesses and the general public. "
        },
        {
            "text": "What can I do? You can do your bit by only using the water you really need to at home. There are lots of tips on the Water Wise website or you can follow Waterwise on Facebook to get more ideas."
        }
    ]
}