{
    "url": "https://educationhub.blog.gov.uk/2025/07/new-rshe-guidance-what-parents-need-to-know/",
    "title": "New RSHE guidance: what parents need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Relationships and Sex Education",
        "Schools"
    ],
    "pub_date": "2025-07-15T12:00:00+01:00",
    "content": [
        {
            "text": "Children are increasingly exposed to harmful content online, including misogynistic attitudes and unhealthy views about relationships. "
        },
        {
            "text": "That's why schools across England are getting new guidance to help teachers navigate these challenges and support children to develop positive attitudes. "
        },
        {
            "text": "The government has published updated guidance for relationships, sex and health education in schools, with a fresh focus on helping all children identify positive role models and challenge harmful ideas they might encounter online and in real life. "
        },
        {
            "text": "But what do these changes mean for parents and pupils? Here's what you need to know. "
        },
        {
            "heading": 3,
            "text": "Why has the guidance been updated? "
        },
        {
            "text": "New research shows just how widespread exposure to misogyny or harmful online content has become. When asked about just the past week, over a third of pupils aged 11-19 had heard comments that made them worry about girls' safety, and more than half witnessed comments they would describe as misogynistic. "
        },
        {
            "text": "Research also found that over one in five girls aged 7 to 10 had seen inappropriate images online, with the average age for exposure to pornography being 13.  "
        },
        {
            "text": "Schools need the right tools to help children understand these challenges and develop healthy attitudes to relationships from an early age. "
        },
        {
            "heading": 3,
            "text": "What will my child learn? "
        },
        {
            "text": "The approach starts early, with primary school children learning about positive relationships between friends and family.  This builds the foundation for understanding respect and kindness in all relationships whilst making sure kids know how to be safe and recognise what counts as abusive behaviour so they can ask for help if they need it. "
        },
        {
            "text": "In secondary school, all pupils learn about consent, and lessons focus on helping teenagers understand consent as well as kindness and respect as they’re getting ready for more intimate relationships. They will learn to identify positive role models and understand how to challenge harmful attitudes they might encounter online. "
        },
        {
            "heading": 3,
            "text": "How will these topics be taught? "
        },
        {
            "text": "Teachers will be supported to bring these topics to life in ways that stay with pupils as they leave the classroom - creating safe spaces where children can have meaningful discussions that have lasting impact. "
        },
        {
            "text": "The guidance sets clear safeguards to ensure teaching remains age-appropriate. This means making sure kids don't get taught things they are too young for, whilst allowing teachers to sensitively and safely respond to topics children have encountered on- or off-line.  "
        },
        {
            "heading": 3,
            "text": "Will I know what my child is learning? "
        },
        {
            "text": "Yes. The guidance makes clear that parents should be able to view all curriculum materials on request. Schools cannot agree to any contractual restrictions with external providers that would prevent parents from seeing content their school plans to use. "
        },
        {
            "text": "This transparency ensures you can stay informed about what your child is learning and have conversations at home to support their understanding. "
        },
        {
            "heading": 3,
            "text": "How will teachers be supported? "
        },
        {
            "text": "Teachers will receive proper training to handle these sensitive topics effectively. From early 2026, schools will be able to apply for training grants to help their staff tackle these challenges with confidence. "
        },
        {
            "text": "Oak National Academy has also developed new online safety lessons that help teenagers learn about harmful ideologies and other forms of misogyny they might encounter online. "
        },
        {
            "heading": 3,
            "text": "What about mental health support? "
        },
        {
            "text": "Alongside relationship education, children will learn about building resilience and managing everyday mental health challenges. They'll understand that some anxiety and low mood can be normal parts of life, while learning strategies to cope with these feelings. "
        },
        {
            "text": "Secondary schools will work closely with mental health professionals to discuss suicide prevention in age-appropriate ways. This goes alongside the government’s broader rollout of access to a mental health professional in every school, ensuring children have the support they need to achieve and thrive. "
        }
    ]
}