{
    "url": "https://marinedevelopments.blog.gov.uk/2025/08/20/coastal-planners-corner/",
    "title": "Coastal Planners Corner",
    "authors": [
        "Kathleen Telford, Marine Planner",
        "Mark Maguire, Coastal Planner",
        "Marie Canny, Coastal Planner",
        "Eva Turley, Coastal Planner",
        "Mae van Loaf, Coastal Marine Planner (South West)",
        "Ellie Hoad, Coastal Marine Planner (South West)",
        "Chloe Boyle, Coastal Planner",
        "Char Lewis, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-08-20T13:02:31+01:00",
    "content": [
        {
            "text": "North East"
        },
        {
            "text": "As the North East Coastal Planner and Heritage Assets Policy Lead, I’ve had the opportunity to meet a wide range of stakeholders across the region who are passionate about our marine environment. From the Port of Tyne to the Yorkshire Marine Nature Partnership, and local councils including Durham, North Yorkshire, and Sunderland, these early conversations are helping to build trust across all sectors, and laying the foundation for stronger collaboration, which is essential for integrating marine plans into terrestrial local plans and wider decision-making."
        },
        {
            "text": "For example, ports have provided valuable information that will feed into Explore Marine Plans, our interactive tool that helps users understand how marine planning policies apply in specific locations."
        },
        {
            "text": "We’re also supporting colleagues in the Isle of Man as they begin exploring marine spatial planning for their waters. Chloe and I have been invited to develop and deliver a workshop where we’ll introduce the benefits of marine plans, share insights from our own planning process, and use the MSP Challenge tool to demonstrate how planning can help manage competing demands on the sea in a sustainable way."
        },
        {
            "text": "East"
        },
        {
            "text": "Char and Mark have been engaging with port operators across the East Marine Plan area to collect and verify data that will be added to Explore Marine Plans. They are also contributing to the consultation on the Norfolk and Suffolk Local Nature Recovery Strategies (LNRS), ensuring that marine features such as saltmarshes, reedbeds, and coastal wetlands are fully aligned with marine planning priorities."
        },
        {
            "text": "Ongoing work brings together stakeholders from the ports, shipping, the Environment Agency, and local authorities to refine how shipping operations work in harmony with marine planning goals, ensuring it builds on existing strengths while preparing for future challenges."
        },
        {
            "text": "South East"
        },
        {
            "text": "As part of her focus on fisheries policy, Marie attended the joint All Party Parliamentary Group (APPG) on Fisheries and the APPG for Shellfish Aquaculture and the Coast in June. The meeting brought together parliamentarians, policymakers, and cross-sector professionals, to discuss what a targeted UK Fishing and Coastal Growth Fund could look like, and the steps needed to ensure the fund becomes an effective vehicle for investment in the future of our fishing and seafood communities. The Minister for Food Security and Rural Affairs, Daniel Zeichner MP, opened the event."
        },
        {
            "text": "Marie also joined the South East Coastal Group meeting in Sheerness, in Kent, which included a site visit to the Medway Estuary and Swale (MEAS) Coastal Erosion Risk Management 10-year scheme led by the Environment Agency. This project includes refurbishing the ageing sea defences to protect around 3,000 homes, businesses, and critical infrastructure from rising flood risks driven by climate change and sea level rise. In some parts of the Sheerness and Queenborough area land lies below the high tide level, making effective flood defence essential for community safety and resilience."
        },
        {
            "text": "South"
        },
        {
            "text": "Alongside her role as South Coastal Planner, Eva leads on water quality policy. Ahead of developing the East Marine Plan, she has been researching water quality issues through meetings and events, including a water governance workshop with DEFRA colleagues and a water quality summit hosted by LGA Coastal Special Interest Group. These discussions brought together a wide range of stakeholders, reflecting the growing importance of water quality in government priorities."
        },
        {
            "text": "With Charlotte now moving to a new role within the MMO, Eva is the main point contact for all South coastal planning matters."
        },
        {
            "text": "South West"
        },
        {
            "text": "In July, Ellie attended the Severn Estuary Forum annual conference on Weston-Super-Mare’s Grand Pier. The event showcased innovative cross-estuary projects addressing environmental, social, and economic challenges, with speakers from the Environment Agency, Project Seagrass, WWT, Natural England, the Severn Estuary Commission, Bristol Port, and the Severn Estuary Partnership."
        },
        {
            "text": "In June, Ellie delivered a presentation on the South West Marine Plan to Stroud District Council’s Strategic Advisory Planning Board, made up of councillors representing the council’s political makeup. The session clarified issues arising from a recent planning application, which had led to some confusion regarding the application of marine plans. Councillors found the session valuable, asking constructive questions throughout. We hope to return later this year to run a Marine Spatial Planning Challenge exercise to build on this engagement."
        },
        {
            "text": "North West"
        },
        {
            "text": "This summer, Chloe and Rosie attended the North West Marine Ecosystems (NWME) conference, which was the first of its kind within the region. NWME is an exciting initiative designed to improve the understanding of the region’s marine and coastal ecosystems among local communities and stakeholders."
        },
        {
            "text": "By bringing together academics, citizen scientists, and coastal and marine professionals, the programme aimed to build a collective network dedicated to advancing marine research and management. Its annual reporting will cover a wide range of themes, from oceanography, plankton, seabed habitats to fish, seabirds, and marine mammals, alongside key management topics, such as marine planning, protected areas, fisheries, water quality and plastic pollution."
        },
        {
            "text": "The conference and ongoing programme are led by the North West Coastal Forum, and more information, including details on how to get involved on their website."
        }
    ]
}