{
    "url": "https://hodigital.blog.gov.uk/2025/08/20/deciding-not-to-build-a-new-service-why-stopping-can-be-the-right-outcome/",
    "title": "Deciding not to build a new service: why stopping can be the right outcome ",
    "authors": [
        "Anne Wicks, Content Designer"
    ],
    "categories": [
        "Service design",
        "User centred design"
    ],
    "pub_date": "2025-08-20T13:21:56+01:00",
    "content": [
        {
            "text": "Putting users at the heart of service design means making decisions based on what they actually need, not just what design and delivery teams assume they need. Sometimes that leads to a surprising but important conclusion - that building a new service isn’t always the right thing to do."
        },
        {
            "text": "User-centred design (UCD) helps teams explore problems from the perspective of users. In agile delivery, the discovery and alpha phases exist to help us investigate whether a service is viable, valuable and feasible. In some cases, the most responsible and user-centred decision we can make is to stop."
        },
        {
            "text": "This post shares how and why UCD teams at the Home Office have advised stakeholders not to move beyond discovery or alpha, and how that can be considered a success, not a failure."
        },
        {
            "heading": 2,
            "text": "When not building a new service is the right outcome"
        },
        {
            "text": "The Service Manual sets clear expectations for moving between phases:"
        },
        {
            "text": "When those conditions aren’t met, moving forward risks delivering something that doesn’t work for users, and ultimately wastes public money."
        },
        {
            "text": "Some examples of why we might not continue include:"
        },
        {
            "text": "Making the decision to stop shows that we’re taking a truly user-centred, evidence-based approach. It puts users first, above delivery timelines or internal pressures, and demonstrates our commitment to achieving value for money."
        },
        {
            "heading": 2,
            "text": "Tips for teams thinking about not proceeding to build a service"
        },
        {
            "heading": 3,
            "text": "1. Bring your stakeholders with you"
        },
        {
            "text": "Stopping shouldn’t be a surprise. Share your findings early and often. Use approaches like regular mini-playbacks or collaborative analysis sessions to involve stakeholders in the learning journey. This builds trust and helps everyone understand the evidence."
        },
        {
            "heading": 3,
            "text": "2. Stay open to different ways of solving the problem"
        },
        {
            "text": "Frameworks like the opportunity solution tree help you explore and effectively communicate a range of options that relate to your desired outcomes, without jumping to conclusions. This mindset encourages teams and stakeholders to focus on outcomes for users, not pre-defined solutions."
        },
        {
            "heading": 3,
            "text": "3. Consider value versus effort"
        },
        {
            "text": "Think about whether the value of a new service justifies the effort to deliver it. Sometimes, the change needed is too complex or costly for the benefit it brings. In those cases, another approach might be more effective."
        },
        {
            "heading": 3,
            "text": "4. Test your riskiest assumptions"
        },
        {
            "text": "By framing assumptions as hypotheses, you can test them quickly and build a solid evidence base. This gives your team confidence in their recommendation to stop, and shows that that recommendation is based on user research and data."
        },
        {
            "heading": 3,
            "text": "5. Give your stakeholders actionable recommendations"
        },
        {
            "text": "Even if you're not continuing to beta, your work should support others. Use your end of phase playback to share what you’ve learned, and suggest next steps for policy, operations or other teams."
        },
        {
            "heading": 2,
            "text": "Stopping can still deliver value"
        },
        {
            "text": "It can feel like a setback to stop work on a service. But choosing not to build when it's the right thing for users is a powerful act of public service."
        },
        {
            "text": "Here's how we added value in our work with asylum operations after choosing not to move beyond alpha:"
        },
        {
            "heading": 2,
            "text": "Empowering users means better public services and value for money"
        },
        {
            "text": "Stopping the design of a service before it’s been built can be hard. But it’s often the most user-centred, responsible decision you can make. By putting user needs above assumptions and showing the evidence behind your thinking, you can help your department deliver better, and better value,  public services."
        }
    ]
}