{
    "url": "https://mhclgdigital.blog.gov.uk/2025/08/20/delivering-a-data-standard-to-support-awaabs-law-in-social-housing/",
    "title": "Delivering a data standard to support Awaab’s Law in social housing ",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Data",
        "Local Digital"
    ],
    "pub_date": "2025-08-20T13:10:10+01:00",
    "content": [
        {
            "text": "We’re pleased to share a milestone in our social housing data work, the delivery of a new data standard to support Awaab’s Law. In this blog, we explain what we’ve delivered, what we’ve learnt, and how the work will continue with the Housing Associations Charitable Trust (HACT) and Data Futurists. We’ll also share upcoming opportunities for housing associations and councils to explore the standard and its implementation. "
        },
        {
            "heading": 2,
            "text": "The importance of data standards "
        },
        {
            "text": "Over the past two years, our research into social housing data has shown how critical data standards are for effective housing services. But also, how a lack of good data standards can make it harder for repairs teams to complete jobs.   "
        },
        {
            "text": "Good data means repairs officers have the right information before arriving, such as the materials needed or tenant-specific requirements like hearing impairments. This leads to repairs being completed first time, higher tenant satisfaction, and less costly workarounds. "
        },
        {
            "heading": 2,
            "text": "What we’ve learnt "
        },
        {
            "text": "We’ve found that inefficiencies in data alone can cost housing repairs and allocations an estimated £400 million every year. This is a conservative figure that excludes other services. Poor data standards can cost large organisations over £1 million when migrating to new systems. According to the Building Research Establishment, the cost of substandard housing is more than £1 billion a year in poor life outcomes. "
        },
        {
            "heading": 2,
            "text": "Responding to Awaab’s Law "
        },
        {
            "text": "Data standards are not just about efficiency; they are essential for delivering new policy.  "
        },
        {
            "text": "The first phase of Awaab’s Law is expected to come into effect from 27 October. It focuses on tenant-specific vulnerabilities rather than general risk categories. For example, damp and mould are a greater risk to children, the elderly, and people with health conditions like asthma or chronic obstructive pulmonary disease (COPD).  "
        },
        {
            "text": "Many housing providers are finding it difficult to meet the new requirements. Some have chosen to address damp and mould across all properties as a preventative step – a welcome development. However, these homes will still need future repairs, and it's vital that processes are in place to support Awaab’s Law over the long term. In particular, housing providers must be able to identify and prioritise repair requests that involve vulnerable tenants. "
        },
        {
            "heading": 2,
            "text": "What we’ve developed "
        },
        {
            "text": "To support this, we worked with HACT to redesign their repair data standards. We developed a new module focused on damp and mould, along with implementation guidance to help housing providers integrate it into their existing systems. "
        },
        {
            "text": "The model records key parts of a repair request, including how it is raised, assessed, responded to, escalated, and closed, along with the data collected at each step. "
        },
        {
            "heading": 2,
            "text": "The data model "
        },
        {
            "text": "The structure behind the model is shown in an Entity Relationship Diagram, which includes:  "
        },
        {
            "text": "Each part includes data elements that help identify hazards, assess vulnerability, and locate issues. "
        },
        {
            "text": "The modular design means housing providers can add components to existing systems, reusing familiar HACT standards for repairs, property, and customer data. This makes it easier to update in future without large system changes. "
        },
        {
            "heading": 2,
            "text": "A new approach to policy and data "
        },
        {
            "text": "For the first time, a data product has been developed alongside new policy. Our research shows that when legislation is introduced and councils are left to interpret and implement it on their own, it can lead to inefficiencies. "
        },
        {
            "text": "Not all housing providers have the data skills to design effective data models. A modular standard that works with existing systems can help avoid workarounds and lead to better results. "
        },
        {
            "heading": 2,
            "text": "Ownership and next steps "
        },
        {
            "text": "We’ve worked closely with colleagues at HACT and Data Futurists so they can take this work forward. They manage the existing HACT standards and are best placed to lead the next phase. "
        },
        {
            "text": "The current version is a minimum viable product. It is the first working version of the data standard and includes core features and functionality. HACT and Data Futurists will test and refine the standard with housing providers to make sure it is robust and ready for adoption when Awaab’s Law comes into place. This includes running workshops and putting it through the Data Standard Authority’s endorsement process.  "
        },
        {
            "heading": 2,
            "text": "Opportunities to get involved "
        },
        {
            "text": "We are planning an in-person workshop in London on 12 September for housing associations and councils. If you'd like to take part, please contact localdigitalpolicy@communities.gov.uk.  "
        },
        {
            "text": "We’ll allocate places on a first-come basis, making sure there’s a good mix of technical and housing expertise and locations. "
        },
        {
            "text": "Follow our channels for the latest updates and opportunities: "
        }
    ]
}