{
    "url": "https://defencedigital.blog.gov.uk/2025/08/20/securing-the-future-skynet-6-wss-hits-a-landmark-milestone/",
    "title": "Securing the Future: SKYNET 6 WSS Hits a Landmark Milestone",
    "authors": [
        "J. Gnaneswaran"
    ],
    "categories": [
        "SKYNET"
    ],
    "pub_date": "2025-08-20T14:50:38+01:00",
    "content": [
        {
            "text": "The SKYNET 6 Enduring Capability project has just reached a major milestone with the release of the final Invitation to Negotiate for the Wideband Satellite System. This is a big step forward in delivering the UK’s next generation of military satellite communications."
        },
        {
            "text": " What is SKYNET 6"
        },
        {
            "text": "SKYNET is the UK Ministry of Defence’s satellite communications capability. It supports operations to deliver information to UK and allied forces around the world, enabling battlefield information advantage anywhere, anytime. The SKYNET 6 Programme is exploiting technological advances to deliver the next generation of military SATCOM capability to the MOD via space and ground-based assets that can meet growing demand in an increasingly challenging threat environment."
        },
        {
            "text": " The Wideband Satellite System"
        },
        {
            "text": "A key part of the SKYNET 6 Enduring Capability project is the Wideband Satellite System. The procurement covers up to three tranches of geostationary satellites, along with ground infrastructure and launch operations that are equipped with military-grade X-Band and Mil-Ka payloads to ensure high availability and hardened performance."
        },
        {
            "text": "The procurement process began in May 2023. Following initial bids from Airbus Defence & Space UK and Lockheed Martin UK, the MOD conducted two rounds of Bidder Engagement sessions to address the cost and risk drivers to optimise the capability offering, deliverability and affordability. A second and final Invitation to Negotiate reflecting all the agreed changes was then produced and formally released on 8th August 2025."
        },
        {
            "text": " Why This Matters"
        },
        {
            "text": "It represents the single largest space procurement nationally, supporting the growth of the UK sovereign space sector and the National Space Strategy. The WSS competition is built around a Technological Capital framework. This means prioritising sovereign access to critical space technologies, UK-based design authority, and domestic assembly, integration, and testing capabilities whichever bidder is chosen. It also encourages the growth of a skilled UK space workforce and a robust industrial base."
        },
        {
            "text": "With an estimated contract value above £1.5 billion, the WSS procurement is a strategic investment in the UK’s defence infrastructure and technological superiority, helping to ensure long-term operational advantage and secure communications capability for the UK and our allies into the 2040s."
        },
        {
            "text": " What Happens Next?"
        },
        {
            "text": "The release of the final Invitation to Negotiate marks a key moment in the ongoing competition phase. Negotiations with bidders are already underway, and the Ministry of Defence will continue working closely with industry to evaluate proposals and shape the final solution."
        },
        {
            "text": "A preferred bidder will be selected and a full business case taken forward in early 2026. This will lay the groundwork for contract award and delivery planning, moving the programme into its next phase."
        },
        {
            "text": "This milestone is a major achievement for the SKYNET 6 Programme and an important moment for UK space and defence communications. It strengthens the UK’s position in delivering secure satellite capability and supports long-term operational advantage for UK and allied forces."
        }
    ]
}