{
    "url": "https://naturalengland.blog.gov.uk/2025/08/20/thriving-together-nature-people-and-industry-in-the-tees-estuary/",
    "title": "Thriving Together: Nature, People and Industry in the Tees Estuary",
    "authors": [
        "Vicky Ward"
    ],
    "categories": [
        "Biodiversity",
        "Coast and access",
        "Development",
        "Marine environment",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Seabirds",
        "Seals",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-08-20T10:38:28+01:00",
    "content": [
        {
            "text": "By Vicky Ward, Tees Estuary Nature Recovery Partnership Project Manager"
        },
        {
            "text": "It is a bright summer’s morning, as I walk through a striking landscape of contrasts. Through the passing juggernauts and across the brine fields to my right, an abundance of industrial structures dominate the skyline, on my left, three Harbour seals glide along an estuary channel and playfully galumph their way out onto the nearest mudflat, flopping down to have a post-breakfast snooze in the sunshine."
        },
        {
            "text": "Nearby, Avocets, Little Egret and other wonderful wader’s gracefully forage for food, muddying their long beaks in the hunt for a snack or two."
        },
        {
            "text": "The Tees Estuary is a special place for both nature and people. Surrounded by large urban conurbations, the estuary and coastline draw people to enjoy its beauty and reap the physical, mental and wellbeing benefits it gifts to us. The estuary also carries an important industrial legacy that interconnects the northeast coast and the North Sea at the forefront of Britain’s Industrial Revolution, it’s maritime power and the birth of the Railway. Today, industry remains crucial as the region leads the way in the nation’s transition to green energy and Net Zero."
        },
        {
            "text": "A complex history"
        },
        {
            "text": "Complexity frames the estuary. Over the past 300-years, 90% of the estuary has been built upon to support agricultural and industrial growth, often with devastating effects on the environment. By the late 1970s, the River Tees was declared ecologically dead, with the riverbeds still trapping toxic waste from past human activity."
        },
        {
            "text": "Yet remarkably, nature has persevered. The estuary is home to an incredible array of wildlife and habitats, including internationally important bird populations, coastal habitats, sand dunes systems, grasslands, woodlands and wetlands. From the tiniest of rare money spiders through to critically endangered European Eel, the summer-visiting Little Terns to the iconic Tees Harbour Seal colony at Seal Sands at Teesmouth National Nature Reserve - nature has built a home here. "
        },
        {
            "text": "In recognition of its biodiversity significance, this landscape carries some of the highest formal conservation designations, however many habitats remain fragmented and in an unfavourable condition, due to poor air and water quality, nutrient overload and recreational pressure."
        },
        {
            "heading": 4,
            "text": "The Tees Estuary Nature Recovery Partnership (NRP)"
        },
        {
            "text": "Created and funded by Natural England as a Nature Recovery Project, our partnership was officially launched this month by Natural England’s CEO, Marian Spain. This landmark moment in the Tees Estuary’s environmental future facilitates organisations to pool their skills and expertise to join up nature recovery at landscape scale.  Our vision is for the Tees Estuary to be known for its nature, people and industry – where all are thriving in equilibrium, and for nature to be part of every aspect of life for the people who live in, work in or visit the Tees."
        },
        {
            "text": "As part of the Nature Recovery Network, connectivity is central to our work – reconnecting fragmented habitats, creating stepping stones for wildlife and improving access to nature for communities and visitors."
        },
        {
            "text": "As Project Manager for the NRP, I’m passionate about our collective work to achieve this. Over the past two years we’ve installed a new bird hide at Teesmouth National Nature Reserve, commissioned research to benefit european eel, water voles and purple milk vetch, mapped nature recovery opportunities along the King Charles III England Coast Path and supported RSPB Saltholme’s plans to restore 100 hectares of wetlands."
        },
        {
            "heading": 4,
            "text": "Recent projects making a difference"
        },
        {
            "text": "Tees Tidelands Footpath Trail"
        },
        {
            "text": "Working with RSPB Saltholme and the Environment Agency’s Tees Tidelands programme we’re creating an 8-mile circular walking trail that reconnects communities to the estuary’s original boundaries. The route travels through time, linking iron age, mediaeval and wartime heritage found along the route with today’s natural landscape. We’ve co-designed the route with local communities and are seeking funding for completion and interactive interpretation."
        },
        {
            "text": "In search of the Spider"
        },
        {
            "text": "Earlier this year, we surveyed for the wonderfully named Bend Bearing Blunt Brow spider - a nationally rare money spider with a red list status, found in fewer than 10 UK locations, one of these being Coatham dunes. We wanted to learn more about their prevalence so were very excited when the survey revealed an abundant population -of regional and national significance - across the Tees Bay and Durham Coast dunes systems!"
        },
        {
            "heading": 4,
            "text": "Looking ahead"
        },
        {
            "text": "Over the next two years we plan to study invertebrate populations in the dunes system, test interventions to benefit shingle-nesting birds, work with partners to monitor the Harbour seals, and develop investible propositions to attract green finance for nature recovery. We’ll also support the development of a Protected Site Strategy for the Teesmouth & Cleveland Coast Special Protection Area. "
        },
        {
            "text": "For more information about the partnership, or if you are interested in getting involved, please contact me on Northumbria.hub@naturalengland.org.uk."
        }
    ]
}