{
    "url": "https://aphascience.blog.gov.uk/2025/08/20/west-nile-virus-sequences-in-uk-mosquitoes/",
    "title": "APHA scientists find West Nile Virus sequences in UK mosquitoes:  what it means for wildlife and public health",
    "authors": [
        "Calam Bruce"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2025-08-20T09:00:10+01:00",
    "content": [
        {
            "text": "Earlier this year, West Nile virus was detected in a native mosquito population for the first time. Dr Calam Bruce talks about APHA’s role in this discovery as part of the Vector-Borne RADAR (Real-time Arbovirus Detection and Response) project."
        },
        {
            "text": "The Animal and Plant Health Agency (APHA) is the UK’s frontline service in the prevention and control of animal and plant diseases. Given three quarters of human disease originate from animals (COVID-19 and ‘flu being two examples), the work we do also has a direct impact on human health."
        },
        {
            "text": "Many zoonotic diseases (those that pass from humans to animals and vice versa) are spread by vectors like mosquitoes and ticks, and APHA is at the forefront of researching these. In recent decades, mosquito-borne diseases have undergone relatively rapid geographic expansion, including moving from tropic and sub-tropic environments into temperate regions (such as the UK), primarily driven by movement of people and global climate change."
        },
        {
            "heading": 2,
            "text": "The rising risk of Usutu and West Nile viruses in the UK"
        },
        {
            "text": "Historically, the UK had been considered relatively free of mosquito-borne diseases. However, in the summer of 2020, Usutu virus (USUV) was detected here for the first time in wild birds by APHA scientists in collaboration with the Institute of Zoology, following its spread in recent decades across mainland Europe. Since its emergence, we have seen a 50% decline in blackbirds (a highly susceptible host of the virus) in Greater London, and we are starting to see a signs of decline in blackbirds in eastern England as the virus expands its geographic range."
        },
        {
            "text": "USUV mainly affects birds, but research shows that where USUV emerges, West Nile Virus (WNV) may follow, as they have similar climatic requirements. WNV can cause significant disease in animals such as birds and horses and can be transmitted through mosquito-bites to humans, resulting in neurological disease in around 20% of those exposed to the virus. In very rare cases this can result in death. The virus is established in various regions across the globe, including Europe, Africa, the Middle East, and North America. The geographic range of WNV has expanded in recent years to more northerly and western regions of mainland Europe."
        },
        {
            "heading": 2,
            "text": "Real-time surveillance of mosquito-borne viruses in the UK"
        },
        {
            "text": "To improve our understanding of emerging mosquito-borne diseases the Vector-Borne RADAR (Real-time Arbovirus Detection and Response) project was established in 2023. This research programme is an APHA-led collaboration with the British Trust for Ornithology, Institute of Zoology and UK Health Security Agency. As part of the project, extensive mosquito monitoring was established in areas that were considered at high risk of viruses entering the country. Alongside this, we undertook retrospective screening for viruses in Aedes vexans mosquitoes that had been trapped for other projects."
        },
        {
            "text": "Two thousand Aedes vexans, collected from Nottinghamshire in July 2023, were submitted to APHA where we pooled them into groups of 10 and screened them for the presence of WNV. Two of these pools were positive and we recovered a fragment of the WNV genome. This is the first confirmed detection of WNV in the UK, and highlights that this virus can naturally enter the country, most likely through migratory bird movement. The remaining 198 pools from the same site tested negative for the virus, and from continued surveillance in mosquitoes and birds from across England, there is no current evidence at the time of writing that WNV is circulating, and there have been no locally acquired human WNV infections reported. "
        },
        {
            "text": "Aedes vexans is native to the UK and is a reasonably rare mosquito due to its habitat requirements. However, in a few locations in England, they can occur at high densities, associated with summer flooded river landscapes. While not a common occurrence, in areas where Aedes vexans are present they can cause a nuisance by biting."
        },
        {
            "heading": 2,
            "text": "West Nile Virus: low risk to the UK , vigilant measures in place"
        },
        {
            "text": "Although WNV was detected, based on our surveillance, the risk  from WNV is still considered to be very low. It also shows that our surveillance is working, that is, we have the correct tools to detect the virus even at very low levels. Surveillance and control activities are being enhanced in light of the findings so that rapid action can be taken in response to detection. Currently, the main risk of WNV infection for UK residents continues to be travel to areas overseas where the virus is circulating. In addition, as WNV infection is a notifiable disease of horses, APHA offers a Test to Exclude service for veterinarians.  "
        },
        {
            "heading": 2,
            "text": "About the Vector-Borne RADAR project"
        },
        {
            "text": "The Vector-Borne RADAR project, which runs until March 2026, aims to enhance surveillance for mosquito-borne zoonotic diseases where wild birds are a primary host.. The grant undertakes active surveillance in wild birds and mosquitoes, combined with citizen science initiatives to help us understand the emergence, spread and impact of mosquito-borne disease in the UK. To find out more, visit: https://www.vb-radar.com."
        }
    ]
}