{
    "url": "https://digitaltrade.blog.gov.uk/2021/07/06/breaking-through-the-grade-barrier-how-can-you-get-promoted-in-the-civil-service/",
    "title": "Breaking through the grade barrier: how can you get promoted in the Civil Service?",
    "authors": [
        "Amy Tsang, Senior Engagement and Strategic Adoption Manager"
    ],
    "categories": [
        "Careers",
        "People and Skills"
    ],
    "pub_date": "2021-07-06T12:12:01+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Amy hosting the breaking through the trade barrier talk for DDaT colleagues "
        },
        {
            "text": "Our Diversity and Inclusion group found that most civil servants in the DDaT team wanted to know how to progress internally and grow their career. As a result, the group have started several projects such as setting up a mentor network and running inspiring career events."
        },
        {
            "text": "The topic of moving to a higher grade within the team seemed elusive. For people such as myself who had come from the private sector, more knowledge was needed on how this was possible."
        },
        {
            "text": "Myself and two other colleagues, Elle Panes and Rachael Robinson put together a workshop event where people from all grades and professions could join. We wanted to have an open discussion about promotions, interviews and applications and invited our colleagues to speak about their experiences."
        },
        {
            "text": "Here are the key takeaways from some of our speakers:"
        },
        {
            "heading": 3,
            "text": "Sian Thomas, Chief Data Officer"
        },
        {
            "text": "I am hugely fortunate to have had fabulous line managers and mentors who supported me through my career journey."
        },
        {
            "text": "That’s why I am really passionate about building talent pipelines, particularly where these include people from under-represented groups. Some of my top work moments include achieving success through the great people whose talent I have had the honour and privilege of nurturing. There is huge reward in seeing great people succeed. But like so many others, I also have struggled to overcome barriers to progression that were not really mine to overcome."
        },
        {
            "text": "I encourage people to take time to think about what they want, and to make decisions based on this. I urge my teams to make full use of all the opportunities that present themselves, including temporary promotions, secondments and job shadowing. It is good to work outside your comfort zone from time to time."
        },
        {
            "heading": 6,
            "text": "Our presenters on the call (starting clockwise, Aleesha Hussain, Baljit Rakhra, Anais Reding and Amy Tsang)"
        },
        {
            "heading": 3,
            "text": "Arthi Vish, Talent Acquisition Lead"
        },
        {
            "text": "You might think that as long as you keep doing your job, progression within your grade and promotion to a higher grade will come naturally. Unfortunately, this doesn’t happen automatically within the civil service like in the private sector. You have to actively apply for roles advertised both internally and externally."
        },
        {
            "text": "Use every opportunity to go the extra mile, demonstrate your commitment and remember to:"
        },
        {
            "text": "To prepare your application (including a cover letter), read the job advert thoroughly to highlight the essential skills, experience and behaviours required for the role."
        },
        {
            "text": "During interviews, be prepared for a competency interview. You will need to give examples of essential skills, experience and behaviours demonstrated in your current and previous roles. Don’t forget to sell yourself, your individual achievements and goals right from the application stage of the process."
        },
        {
            "heading": 3,
            "text": "Baljit Rakhra, Head of Delivery"
        },
        {
            "text": "I have been a civil servant for the last 7 years. I have worked as an EO, HEO, SEO, Grade 7, Fast Streamer and I am currently working as a Grade 6 within DIT."
        },
        {
            "text": "Some of the key lessons I have learnt in my time as a civil servant are:"
        },
        {
            "heading": 3,
            "text": "Anais Reding, Chief Engagement and Design Officer"
        },
        {
            "text": "I was asked to talk about my experience of moving from Grade 6 to SCS. I was recently promoted to SCS1 in DDaT, having started my career in policy and joining government a few years in at HEO level. Some promotions were easier than others for me, and I wanted to encourage colleagues with some insight I was given."
        },
        {
            "text": "Did you know that at the more senior levels it is not uncommon for people to submit 30+ applications before being successful? At this level, it becomes as much about fit as it does skill. When you work to that number, overcoming rejection becomes normal and you recognise that part of it is being in the right place at the right time."
        },
        {
            "text": "Finally, when you think retirement comes at age 68, and you work backwards from there, there will be plenty of opportunities to progress in your career."
        },
        {
            "heading": 2,
            "text": "Careers, not jobs "
        },
        {
            "text": "This workshop has kickstarted a conversation about moving up into a new grade. I think this is an important subject to approach. I was personally surprised at the open and honest conversations about career progression that can be found at DIT. This encourages me to think about my long-term career goals at DIT and inspire those around me to progress in their careers not just their jobs."
        }
    ]
}