{
    "url": "https://socialcare.blog.gov.uk/2021/07/06/care-home-open-week-the-poetry-of-personalised-care/",
    "title": "Care Home Open Week: the poetry of personalised care",
    "authors": [
        "Emily Carver"
    ],
    "categories": [
        "Uncategorised"
    ],
    "pub_date": "2021-07-06T16:07:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Dispelling myths"
        },
        {
            "text": "Often when people think about moving into a care home, they might picture bingo at 3pm, lounges filled with old people watching endless re-runs of Corrie and early bedtimes."
        },
        {
            "text": "Here at Maycroft we do things very differently."
        },
        {
            "text": "The residents have lived rich, varied, interesting lives filled with exceptional food, travel and learning new things. So why should that end in later life? Our activities programme offers art history, architecture, sewing, quilting, yoga, choir, book clubs and art classes run by professional artists."
        },
        {
            "text": "In the past we have used Care Home Open week to open up to the community and invite them in to take part in all our classes and even stay for tea. I know it might seem a strange thing to say, but COVID-19 has actually given us many gifts."
        },
        {
            "text": "Our family zoom meetings have enabled relatives in Canada to join us, residents have renewed their interest and love of our outside spaces, and we’ve realised how brilliantly adaptable the whole team actually is. Although this year, visitors couldn’t physically walk into Maycroft, they did get a taste of who we are through our virtual event."
        },
        {
            "heading": 2,
            "text": "Strengthening connections"
        },
        {
            "text": "During COVID-19, we stopped all group activity and, for months on end, residents were in their rooms with 1-1 activities organised by the team.  One of the beautiful things to happen in the last year has been how well we have got to know each and every resident and their families, after months of 1-1’s each day."
        },
        {
            "text": "Our knowledge of their lives has become stronger and we have helped them stay in touch with all their friends and family on a daily basis, often facilitating 50+ calls a day. As a result, as we move out of lockdown, our activities have become even more personalised to the individuals in our care."
        },
        {
            "text": "So what can you expect from a normal day at Maycroft Manor?"
        },
        {
            "text": "Rather than me tell you, scroll down for the lowdown from our resident poet, Patsy O’Byrne!"
        }
    ]
}