{
    "url": "https://hmlandregistry.blog.gov.uk/2021/07/06/digital-land-registration-a-vision-for-the-future-of-digital-conveyancing/",
    "title": "Digital land registration – a vision for the future of digital conveyancing",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2021-07-06T12:18:33+01:00",
    "content": [
        {
            "text": "The pace of digital change within our society is accelerating, as government, companies and organisations seek to deliver services while working remotely."
        },
        {
            "text": "At HM Land Registry we are investing in more digital, intuitive services that make the land and property transaction process quicker and simpler. We want to provide and validate data across our portal and Business Gateway channels earlier in the conveyancing process. This will help our customers to complete and submit applications right the first time. Fewer errors will improve the speed of registration by reducing the number of requests for information (requisitions), which incur unnecessary costs for all."
        },
        {
            "heading": 2,
            "text": "Our new digital services"
        },
        {
            "text": "The launch of our new Digital Registration Service on our portal in April takes us a step closer towards our digital vision. The new enhancement automatically pre-populates certain data from the register, while on-screen guidance helps customers to reduce mistakes, ensuring applications are correct and complete. Some restrictions will apply as we continue to develop the service, but ultimately it will replace the existing electronic Document Registration Service, which relies on scanned copies. We expect Document Registration to be decommissioned in 2022 but we’ll provide customers with notice of this change, well in advance."
        },
        {
            "text": "In our portal channel we’ve added Estimated Completion Date, which provides users with an estimated date when outstanding applications will be complete. This provides greater visibility of our service."
        },
        {
            "text": "In addition, we are extending the new View My Applications service that went live last year. This new feature brings together details of a customer’s applications all in one place, clearly indicating the status and relevant documentation connected to the application."
        },
        {
            "text": "We plan to deliver similar enhancements for software developers through our API (application programming interface) Business Gateway channel. This is part of the significant investment we’re making to Business Gateway, to ensure our customers can achieve the same outcomes across our channels, through API services."
        },
        {
            "text": "To help identify our customers' priorities we recently launched the Business Gateway community. This forum allows us to work with customers to identify solutions, test new services and collaborate on the transformation of our API services."
        },
        {
            "heading": 2,
            "text": "Exploring digital solutions"
        },
        {
            "text": "We’re working with a cross-section of customers, stakeholders and experts in the property market to find new ways to improve the conveyancing process. Through an open forum we’re discussing new digital approaches to policy and developments, which will improve the conveyancing process and transform the market."
        },
        {
            "text": "Over the past year we’ve explored certain areas that can be fully digitised to improve and quicken the customer journey. The iterative approach we used to develop electronic signatures last year has informed the development of qualified electronic signatures, which we plan to pilot later this year."
        },
        {
            "text": "In March 2021 we published our standard for digital identity checks. While we don’t expect this to result in an overnight change in the way we receive applications, we are seeing more and more tools coming onto the market, which will help customers adopt a more digital way of working."
        },
        {
            "text": "We’ve also set up an industry group to explore digital deeds and better understand how we can use the technology to make fully digitised deeds a reality. New areas such as lawyer assurance are also being explored. This concept gives a conveyancer a unique digital identifier so they can attest that the information lodged is accurate. This process does not require conveyancers to do any more than normal. It simply guarantees the information digitally and reduces processing time."
        },
        {
            "heading": 2,
            "text": "Going forward"
        },
        {
            "text": "The pandemic has fundamentally changed the way we work. As more systems, tools and processes are digitised, land registration will become quicker and simpler for everyone. We’ll be sharing more details about our planned service enhancements in the coming months, as we transition from paper-based electronic processes to digital. And we’ll continue to update you on the progress of the digital solutions and tools we’re exploring, which all fall under the theme of digital registration, something you will hear us talking more about. All of which takes us closer towards our ambition of becoming the world’s leading land registry for speed, simplicity and an open approach to data."
        }
    ]
}