{
    "url": "https://educationhub.blog.gov.uk/2021/07/06/parents-pupils-teachers-and-students-find-out-what-step-4-of-the-covid-roadmap-means-for-you/",
    "title": "Parents, pupils, teachers and students. Find out what step 4 of the covid roadmap means for you.",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus",
        "Higher Education",
        "Primary Schools",
        "Secondary schools",
        "Universities"
    ],
    "pub_date": "2021-07-06T15:41:53+01:00",
    "content": [
        {
            "text": "On 19 July the country is expected to move on to Step 4 of the Government’s roadmap and further restrictions will be lifted."
        },
        {
            "text": "As the Prime Minister set out, this means that from that point most of the restrictions we have faced as a society in the last year-and-a-half will be removed, helping to minimise disruption to education."
        },
        {
            "text": "Many schools, colleges and universities will have started their summer breaks by then but it means the return to education in the autumn will feel very different as a result. There are schools, colleges and universities that will still be teaching on 19 July and they, along with early years settings, will be able to relax restrictions at that point."
        },
        {
            "text": "One of the key changes is that pupils or students will no longer be required to remain in year group or classroom bubbles and children will be able to mix freely in the early years. Face coverings will also no longer be recommended in any setting and social distancing will no longer be necessary."
        },
        {
            "text": "Of course, it is still necessary to be careful and that’s why it remains essential that secondary pupils, teachers, staff and their families continue to test themselves for the virus and isolate if positive or if they have been in close contact with a positive case – but we will be able to see the back of the wholesale isolation of groups of pupils from 16 August in time for the autumn term."
        },
        {
            "text": "Close contacts can be anyone who:"
        },
        {
            "text": "Here we answer your questions on what these changes mean for you, whether you’re a parent, carer, pupil, teacher or student."
        },
        {
            "heading": 2,
            "text": "Early years"
        },
        {
            "heading": 3,
            "text": "What will happen if there’s a confirmed case in an early years setting?"
        },
        {
            "text": "We’re removing the need to limit mixing between groups and contact tracing conducted by staff in the  early years settings, schools and colleges.  NHS Test & Trace will now oversee contact tracing in all education settings."
        },
        {
            "text": "Settings should continue to report cases to Ofsted as previously."
        },
        {
            "text": "From 16 August, the legal requirement to self-isolate for contacts of a positive case will end for everyone aged under 18 but children should stay at home if they have symptoms of Covid or a positive test result."
        },
        {
            "heading": 3,
            "text": "Will parents be allowed to go into nurseries at drop off and pick up? "
        },
        {
            "text": "There won’t be any national restrictions that say parents can’t enter early years settings at drop off and pick up – although we know many settings prefer parents to pick children up without coming inside regardless of covid."
        },
        {
            "heading": 2,
            "text": "Primary schools"
        },
        {
            "heading": 3,
            "text": "Will children have to stay in bubbles at primary schools?"
        },
        {
            "text": "No. Primary schools will no longer be expected to keep pupils in bubbles."
        },
        {
            "heading": 3,
            "text": "Are there any other changes for primary schools?"
        },
        {
            "text": "Not significant ones. Primary school pupils don’t have to regularly test nor have there been any expectations for them to wear face coverings. Teachers and other staff will no longer have to wear face coverings in communal areas."
        },
        {
            "text": "From 16 August, school children will no longer be required to self-isolate if they are a contact of a positive case. Close contacts should take a PCR test and only need to isolate if they test positive."
        },
        {
            "text": "Teachers and staff should keep on testing twice a week even if fully vaccinated. "
        },
        {
            "heading": 3,
            "text": "What things will be staying the same? "
        },
        {
            "text": "Guidance on hygiene measures, cleaning and keeping classrooms well ventilated will remain, as will local contingency measures if there are significant outbreaks. These may require greater levels of isolation, the reintroduction of face coverings and community testing."
        },
        {
            "heading": 3,
            "text": "What will happen if there is a positive case in a primary school? "
        },
        {
            "text": "From 16 August, children under the age of 18 years old will no longer be required to self-isolate if they are contacted by NHS Test & Trace as a close contact of a positive COVID-19 case. Instead, children will be contacted by NHS Test & Trace, informed they have been in close contact with a positive case and advised to take a PCR test."
        },
        {
            "heading": 2,
            "text": "Secondary schools and colleges"
        },
        {
            "heading": 3,
            "text": "Will secondary age pupils at schools and colleges have to stay in bubbles?"
        },
        {
            "text": "No. Secondary school and college students won’t have to stay in bubbles."
        },
        {
            "heading": 3,
            "text": "What about face coverings?"
        },
        {
            "text": "Face coverings are no longer recommended in education settings. Headteachers may still wish to recommend pupils wear them and pupils themselves remain free to wear face coverings if they decide to. Staff and visitors are free to wear a face covering in communal areas if they wish to. It may be the case that, in the event of a significant outbreak, face coverings in schools will again be recommended."
        },
        {
            "heading": 3,
            "text": "What happens to testing for all staff, secondary and college students?"
        },
        {
            "text": "Over the summer all staff, secondary school and college students should continue to test and report results online. You can test during the summer by ordering your free rapid Covid-19 tests online nhs.uk/GetTested, or by picking them up at pharmacies."
        },
        {
            "text": "You will continue to receive tests if you're attending summer schools, out of school activities based on education sites and settings that do not operate on a term time basis. In these cases, staff and students should continue to test twice weekly at home and it is important test results are reported regardless of whether they are positive, negative or void."
        },
        {
            "text": "This autumn asymptomatic testing will resume in secondary schools and colleges - including two tests in person on return – and continue until the end of September with a review at that point. It means apart from tests taken in person on the return to school, pupils will be expected to carry on testing themselves twice a week using LFD tests obtained online, through their school/college or via their local pharmacy."
        },
        {
            "heading": 3,
            "text": "What if there is a positive case in a secondary school or college?"
        },
        {
            "text": "From 16 August, children under the age of 18 years old will no longer be required to self-isolate if they are contacted by NHS Test & Trace as a close contact of a positive COVID-19 case. Instead, children will be contacted by NHS Test & Trace, informed they have been in close contact with a positive case and advised to take a PCR test. 18-year-olds will be treated in the same way as children until 4 months after their 18th birthday to allow them the opportunity to get fully vaccinated."
        },
        {
            "heading": 3,
            "text": "What things will be staying the same? "
        },
        {
            "text": "Guidance on hygiene measures, cleaning keeping classrooms well ventilated will remain, as will local contingency measures if there are significant outbreaks. These may require greater levels of isolation and community testing."
        },
        {
            "heading": 2,
            "text": "Higher Education"
        },
        {
            "heading": 3,
            "text": "What will the main changes be in universities?"
        },
        {
            "text": "For Higher Education, step 4 of the roadmap means there will be no further restrictions and in-person teaching can resume for the autumn term."
        },
        {
            "heading": 3,
            "text": "What about testing?"
        },
        {
            "text": "Testing remains important and students and staff should continue twice weekly testing either using home test kits or at an on-site facility. These tests should be taken three-four days apart."
        },
        {
            "text": "Tests are free and are available via gov.uk, your local pharmacy or community testing centre. It is important that you register your test result regardless of whether it’s negative, positive or void."
        },
        {
            "text": "If you do test positive for Covid, you will need to isolate for 10 days."
        },
        {
            "heading": 3,
            "text": "Do students or staff still need to wear a face covering?"
        },
        {
            "text": "No. Face coverings are no longer recommended in education settings. Individuals are free to wear a face covering in communal areas and classrooms if they wish to."
        },
        {
            "heading": 3,
            "text": "What if someone is not vaccinated, can they go back to university?"
        },
        {
            "text": "Vaccinations are not mandatory but we strongly encourage all students to get their jab before returning to university, as the COVID-19 vaccination programme continues and has been offered to everyone aged 18 and over."
        },
        {
            "text": "Students can access the vaccine programme via local sites run by GPs or community pharmacies, at larger vaccination centres and in some hospitals."
        },
        {
            "heading": 3,
            "text": "Will online learning continue during the autumn?"
        },
        {
            "text": "Universities are autonomous and it is for them to determine what their learning approach is, taking into account any government guidance."
        },
        {
            "text": "But as step 4 means in-person teaching can continue, we expect universities to ensure their tuition is accessible for all."
        },
        {
            "text": " "
        }
    ]
}