{
    "url": "https://foresightprojects.blog.gov.uk/2021/07/06/trend-deck-evidence-of-future-change-for-uk-policy-makers/",
    "title": "Trend Deck – evidence of future change for UK policy makers",
    "authors": [
        "helendoran",
        "Kelsy Dyer"
    ],
    "categories": [
        "Futures Capability & Resource",
        "Global Strategic Trends",
        "Trend Series"
    ],
    "pub_date": "2021-07-06T12:15:06+01:00",
    "content": [
        {
            "text": "Trends are patterns of change based on long-term data sets which we can use in foresight exercises to understand how individual trends and the interactions between them could shape the political, socio-economic and environmental context within which policy and strategy is delivered. This shaping is often influenced by technological and legal/regulatory change. The Government Office for Science Futures Toolkit outlines the methods for using trends in foresight exercises."
        },
        {
            "text": "We created Trend Deck by combining the published horizon scans of multiple organisations, focusing on a set of long-term  trends shaping the external context within which the UK government works. Earlier versions of Trend Deck have been shared and widely used across  government. The Spring 2021 version is the first to be made publicly available. It contains 118 trend cards, categorised into 10 themes. These are not a definitive set of trends but a starting point for those working in and outside of government who are interested in evidence of long-term change and how this might affect the success of planned policy outcomes. We encourage users of Trend Deck to select trends from the deck and add to them when conducting foresight exercises."
        },
        {
            "text": "Figure 1, “Rapid increase in the prevalence of dementia worldwide” is an example of  a trend card in the Health Section. The card shows the direction of travel of the trend (in this case increasing), provides a narrative of long-term change, supporting infographic and cites the evidence source. This format allows users of Trend Deck to think about the trend at different levels. In a foresight-mapping exercise using many trends, the trend title may be a sufficient level of detail. If the trend is a priority, the supporting narrative can lead to a more in-depth discussion about possible implications."
        },
        {
            "text": "Trend Deck is a live resource which we intend to update on a regular basis. We have produced a PDF of the full Trend Deck and PDFs of each section to make it easier to download for use in a workshop."
        },
        {
            "text": "The Government Office for Science offers a futures advisory service for those working in the UK government. If you would like to discuss the Trend Deck or how to use it, please contact us on futures@go-science.gov.uk."
        }
    ]
}