{
    "url": "https://companieshouse.blog.gov.uk/2021/07/06/working-for-companies-house-james-ws-story/",
    "title": "Working for Companies House: James W's story",
    "authors": [
        "James Williams - Operational Officer",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-07-06T13:00:20+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our series of features in which employees reflect on what makes Companies House so special continues with James Williams, an Administrator in the New Companies Team."
        },
        {
            "text": "Looking for a job after you’ve graduated can be scary and intimidating. Just ask James Williams."
        },
        {
            "text": "Two years ago, the rugby loving 23 year old from Llanelli had just graduated from the University of the West of England with a degree in Media and Communications."
        },
        {
            "text": "Like many of us, he’d held down temporary jobs while studying, including working:"
        },
        {
            "text": "He did whatever it took to, in his own words, “buy a few beers in the student union.”"
        },
        {
            "text": "That breakthrough job after graduation is, however, altogether different, being the first all-important step on the career ladder."
        },
        {
            "text": "James had heard good things about working in the Civil Service. So, having checked out the Civil Service website and seen there were jobs being advertised at Companies House, he decided to take the plunge."
        },
        {
            "text": "“The job I applied for was an administrator at Companies House beginning in January 2020,” James recalls. “I was one of quite a few people hired at the same time. We were then divided up according to operational needs with 3 of us going into what’s known as the New Companies team, overseeing companies that have recently been incorporated.”"
        },
        {
            "text": "Relaxed, open, comfortable – that’s how Companies House struck James during those first few weeks based at the organisation’s headquarters in Cardiff."
        },
        {
            "text": "And then, out of the blue, along came the coronavirus (COVID-19) pandemic, just when his career was starting to get going."
        },
        {
            "text": "Fortunately, James had 2 major things going for him – his own resourcefulness, and his employer’s progressive working practices and culture."
        },
        {
            "text": "“In some ways I was quite lucky, coming straight from university,” he adds. “The idea of working on a laptop from home wasn’t too alien to me. I’d spent the previous few months revising from my university bedroom. It was almost a case of going back into that mindset."
        },
        {
            "text": "“I was also quite lucky in that I didn’t have a set routine like many people in my team who’d been doing the same thing for several years. When you are used to seeing the same faces every day, then you’re going to miss those people."
        },
        {
            "text": "“At the same time there were other things that I did miss out on. For instance, I lost that safety net of having someone next to you who can double check your work to make sure you’re on the right lines. It really was a case of having to adapt quickly."
        },
        {
            "text": "“Then again everyone at Companies House was really supportive, right the way from my own team through to the people working in IT who got everybody working from home within a couple of weeks of the first lockdown happening. The priority was to keep everybody safe, which I found massively reassuring.”"
        },
        {
            "text": "Despite having only been in the post for a matter of months, James was soon on the move internally having been made aware of a temporary role in the Engagement Team providing maternity cover."
        },
        {
            "text": "“Being my first job, I was keen to experience as much of Companies House as I could, albeit working from home,” he adds."
        },
        {
            "text": "“Everyone who works here gets 3 days a year to volunteer as they see fit for causes they support. Because of that, we have a good network of companies in the community that we’ve worked with in the past."
        },
        {
            "text": "“My role involved reaching out and co-ordinating with those companies and communities, with the added perspective of COVID-19 on top. You know, ‘You might not have heard from us for a while, we’re still here, is there anything we can do at the moment to help you?’"
        },
        {
            "text": "“I did that for 7 months and absolutely loved every second of it. When the time came to go back to the New Companies Team, the Engagement Team sent me all sorts of gifts and even put together this presentation about the rugby team and the American football team that I support. I’d never met any of them face-to-face because of COVID-19, yet they still went to those lengths to thank me. That’s typical of Companies House.”"
        },
        {
            "text": "As if that was not enough, James has also been instrumental during his relatively short period at Companies House in setting up a men’s network, one of the many social and support networks which now exist within the organisation for employees."
        },
        {
            "text": "“Our first meeting was in May 2021 and we had a lot of people sharing stories about their personal thoughts and struggles both in general and during lockdown,” says James."
        },
        {
            "text": "“Growing up and playing rugby, I’ve always been a keen advocate for men’s mental health. I do think it’s something that, traditionally, has been a little bit neglected."
        },
        {
            "text": "“As soon as I came to Companies House I saw there was a refreshing, modern, forward-thinking attitude to mental health. The appetite was definitely there for a men’s network. It was just a case of reaching out to a few people and getting the ball rolling."
        },
        {
            "text": "“Hopefully now the network will kick on and go from strength to strength.”"
        }
    ]
}