{
    "url": "https://aphascience.blog.gov.uk/2021/07/06/zoonotic-disease-research/",
    "title": "Spotlight on APHA’s zoonotic disease research",
    "authors": [
        "Nick Johnson"
    ],
    "categories": [
        "Events",
        "One Health"
    ],
    "pub_date": "2021-07-06T10:00:06+01:00",
    "content": [
        {
            "text": "Today, Tuesday 6 July marks World Zoonoses Day - an opportunity to raise awareness of those diseases that affect both humans and animals. The origin of diseases has been on everyone’s mind over the past 18 months, particularly those that cause epidemics. Here Dr. Nick Johnson of the newly formed Vector-Borne Diseases group within APHA’s Virology Department discusses what a zoonosis is and what APHAs role is in responding to them."
        },
        {
            "heading": 3,
            "text": "What is a zoonotic disease?"
        },
        {
            "text": "The World Health Organisation (WHO) defines zoonoses as those “diseases and infections that are naturally transmitted between vertebrate animals and man”. About two thirds of the diseases that affect humans are zoonoses and many of the pathogens APHA test for, fall into this category."
        },
        {
            "heading": 3,
            "text": "Reverse zoonosis"
        },
        {
            "text": "The traditional approach to zoonotic disease has been to view animals as the source of disease and the human population as the “victim”. We now have the term “reverse zoonosis” to represent a change in the direction of transmission from humans to animals. One of the challenges for scientists at APHA during the COVID-19 pandemic has been to understand this process."
        },
        {
            "heading": 3,
            "text": "The role of mosquitos and ticks"
        },
        {
            "text": "My particular area of responsibility falls on those zoonotic viruses transmitted by mosquitoes and ticks. This includes a long list of potential viruses but top of the list is West Nile virus, a cause of neurological disease in humans and horses, which has been causing disease outbreaks during the summer months in mainland Europe."
        },
        {
            "text": "Despite seasonal surveillance in wild birds over many years, APHA has not detected the presence of West Nile virus in the UK. However, as the climate changes with the potential to boost the mosquito population, the risk of its emergence in the UK increases and it is definitely on our radar! Indeed, much of our research is focussed on investigating transmission of viruses by mosquitoes. Fortunately for horse owners, a vaccine is available and we know from a recent study we published that as many as 25% of horses in the UK are vaccinated against West Nile virus and protected from infection. With the rise in risk, preventative vaccination of horses is advantageous to protect them from infection and potential spread of the disease."
        },
        {
            "text": "Another zoonotic that we are preparing for is Rift Valley fever virus, a cause of haemorrhagic disease (think Ebola!) in cattle and sheep. Currently this disease is only found in Africa and parts of the Middle East, but like many mosquito-borne diseases it has the capacity to rapidly spread beyond its existing range and its impact on cattle and sheep can be devastating. In addition to causing diseases in humans and livestock, zoonoses like Rift Valley fever can disrupt livestock production and trade affecting both food supplies and the wider economy."
        },
        {
            "text": "Early identification and prevention is the key to controlling the emergence of these diseases. Research jointly conducted by APHA’s Virology Department and the Department of Epidemiological Sciences has mapped areas in the UK where livestock are present and potential vectors of disease occur to enable us to identify areas most at risk of this mosquito-borne disease."
        },
        {
            "heading": 3,
            "text": "Other areas of zoonotic work"
        },
        {
            "heading": 4,
            "text": "Brucella"
        },
        {
            "text": "Brucellosis is a zoonotic disease usually associated with abortion in livestock. It easily spreads to humans via unpasteurised dairy products or close occupational contact and can lead to serious chronic disease."
        },
        {
            "text": "The disease is no longer present in UK livestock following eradication, but it remains common in large parts of the globe, and is a significant issue in many low and middle income countries."
        },
        {
            "text": "APHA work widely in brucellosis delivering surveillance and diagnostics ensuring maintenance and assurance of disease freedom. This is supported by an applied research program delivering improved laboratory tools to rapidly detect, trace the source and mitigate in any future outbreaks to support international trade. Research work includes developing more reliable tools to detect the disease via blood or milk, better ways of identifying where a strain originates from and novel approaches to vaccines."
        },
        {
            "text": "APHA also serve as an International Reference Laboratory for brucellosis on behalf of both the World Organisation for Animal Health (OIE) and Food and Agriculture Organization (FAO), and our scientists work extensively with overseas partners to understand and support control of brucellosis globally."
        },
        {
            "text": "There are still sporadic cases of brucellosis originating from livestock in humans in the UK, always associated with travel to areas of the world where the disease is still common, and APHA work with the public health authorities to provide a confirmatory diagnostic service for human cases too."
        },
        {
            "text": "A recent development has been the identification of a significant number of cases of brucellosis in dogs, a disease only occasionally found in the UK. Cases are largely linked to importations of ‘rescue’ dogs from eastern Europe and, while no linked human brucellosis cases have been confirmed, APHA is working with health protection colleagues in responding to this emerging threat. If importing a dog from abroad, especially a rescue dog or a dog that has bred before, then it is advisable that the dog is tested for brucellosis in addition to testing for other diseases prior to import to avoid bringing infected dogs into the UK."
        },
        {
            "heading": 4,
            "text": "Avian influenza"
        },
        {
            "text": "Avian influenza (bird flu) is a notifiable animal disease mainly affecting birds but can also be passed from infected birds to humans and other mammals too although this pathway of transmission is extremely rare."
        },
        {
            "text": "As with brucellosis, APHA is an International Reference Laboratory for avian influenza and APHA’s work in this field is well documented on the APHA Science Blog. Note that APHA is designated a Reference Laboratory or Centre for 23 animal health science specialisms internationally and 48 specialisms nationally, some of which have been formally recognised recently as we build UK resilience in a post EU exit world."
        },
        {
            "text": "We found ourselves involved in the UK’s most recent unprecedented avian influenza  outbreak a little earlier than expected in November 2020. You can read about APHA’s response in this blog by APHA’s Professor Ian Brown, Dr Sharon Brookes and Dr Kirsty Line. Through laboratory testing and our teams on the ground, APHA provides rapid confirmation of cases of avian influenza. The analysis we do in our state-of-the-art facilities produces results as to whether a flock is infected within a matter of hours."
        },
        {
            "text": "When a new avian influenza case emerges, especially in Europe, we rapidly conduct a range of analyses to ensure our tests are effective. We look at the properties of the virus to define how it affects its host and how it might spread between poultry species and we decipher its genetic code using Whole Genome Sequencing to understand its relationship to other viruses and any unique characteristics."
        },
        {
            "text": "The APHA science and field service capabilities are critical in supporting Defra and the Devolved Administrations in preventing, detecting and controlling this disease as soon as confirmation of disease is received and immediate mobilisation of the National Emergency Epidemiology Group (NEEG) is activated. This triggers a well-rehearsed action plan to inform on the likely source and spread of the disease and provides advice to policy teams in the National Disease Control Centre (NDCC) to ultimately control the disease."
        },
        {
            "heading": 3,
            "text": "The role of high throughput sequencing and surveillance"
        },
        {
            "text": "APHA carries out over 800,000 tests a year to diagnose disease but there are other tools in our armoury to protect the country from zoonotic animal diseases, including veterinary surveillance and genomic sequencing."
        },
        {
            "text": "High throughput sequencing is non-selective and characterizes all of the nucleic acid in a sample and is used to routinely determine the whole genome sequence of known pathogens (such as SARS-CoV-2 or Influenza virus) in samples from animals. However, the same data can also be used to discover unknown pathogens in a sample."
        },
        {
            "text": "This involves computer analysis to remove the expected genome sequence of the host and focuses on any nucleic acids that are unexpected. Comparisons with sequence databases then leads to identification and characterization of novel pathogens."
        },
        {
            "text": "At APHA we have discovered novel lyssaviruses (similar to the Rabies virus), parasitic nematodes worms and the potential cause of elephant mortality event using this approach."
        },
        {
            "text": "The Surveillance Intelligence Unit (SIU) at APHA manages veterinary scanning surveillance activities to quickly detect, characterise and manage new and emerging threats in livestock and wildlife in the UK. Threats are diverse and can include diseases carrying public health concern due to zoonoses or toxicity, such as Salmonella."
        },
        {
            "text": "Where a potential threat is identified, investigation follows to characterise the threat, using information from farm visits, laboratory testing, scientific literature and subject experts. The risk is then assessed to determine the impacts to animal health and welfare, public health and interest, and international trade. The risks are then communicated to Government and industry to enable appropriate decisions and actions to be taken."
        },
        {
            "heading": 3,
            "text": "Protecting our staff in the line of duty"
        },
        {
            "text": "Animal and Plant Health Agency’s remit is to “safeguard animal and plant health for the benefits of people”, so zoonoses are at the core of what we do as an Agency. Since humans are susceptible to these diseases, protecting our staff is vitally important and our high containment laboratory facilities ensure we can safely store and work with zoonotic pathogens. Responding to zoonotic diseases in the future will be a key function of the National Science Centre for Animal Health (NSCAH) on behalf of the country. Yvonne Spencer, Director of Science Transformation for the Weybridge site redevelopment Programme, describes the role NSCAH will play in combatting zoonotic disease."
        }
    ]
}