{
    "url": "https://vets.blog.gov.uk/2021/07/06/zoonoses-day-2021-the-year-of-the-ferret/",
    "title": "Zoonoses Day 2021: The Year of the Ferret",
    "authors": [
        "Carmen Marco"
    ],
    "categories": [
        "Disease outbreak",
        "Government Veterinary Services"
    ],
    "pub_date": "2021-07-06T18:15:41+01:00",
    "content": [
        {
            "text": "Hi! My name is Carmen Marco and I work as a One Health Veterinary Advisor for the Animal Plant and Health Agency (APHA).  As part of my job I monitor emerging zoonotic diseases, which are new diseases that can pass from animals to people and vice versa to develop control measures and mitigate any risks to animal and public health."
        },
        {
            "text": "2020 and 2021 will be widely remembered as the years of the COVID-19 pandemic, affecting millions of people across the world.  COVID-19 is caused by a virus called Severe Acute Respiratory Syndrome Coronavirus type 2 (or SARS-CoV-2). The disease is transmitted mainly by inhalation or contact with infected respiratory droplets/aerosols generated by a person carrying the virus."
        },
        {
            "text": "In the early stages of the pandemic, the Hong Kong sanitary authorities sampled pets (cats and dogs) from owners who were affected by COVID-19. Some of these samples came back positive, although these animals only showed very mild signs of infection if any. This was followed by a cat in Belgium which showed similar mild respiratory and enteric signs."
        },
        {
            "text": "At the same time, researchers in the world were assessing the susceptibility of different animal species to the virus. Some studies showed that ferrets were affected by the virus, with mild respiratory signs and infecting other ferrets through infected respiratory droplets."
        },
        {
            "text": "Simultaneously, the Netherlands and Denmark experienced outbreaks of SARS-CoV-2 in farmed mink. In all cases, the virus was introduced to the mink by people and in certain farms, the virus changed within the mink. These mutated virus variants could sometimes be transmitted back to people from mink, and then spread within the community which raised concerns around the risk of new variants."
        },
        {
            "text": "Although the UK had banned farmed mink since the early 2000s, ferrets are present in the UK either as pets or as working animals. Ferrets can be infected by SARS-CoV-2 passed from people, so it was very important to prevent the spread of the virus to ensure the ferrets’ health and welfare."
        },
        {
            "text": "APHA and Defra collaborated with external organisations to create a voluntary ferret register that would help protect ferrets and their keepers’ health and welfare. This involved organisations with an interest and with expertise in ferrets such as ferret clubs, sanctuaries, and veterinarians. The register allows the ferret keepers to provide their details about location of the ferrets, numbers and the reason they are kept (e.g. pets, hunting rabbits, breeding, sanctuaries, agricultural colleges, open farms, zoos, and running underground internet cables to provide rural broadband)."
        },
        {
            "text": "Although called the ferret register, it also includes other species such as weasel and stoats, which belong to the Mustelinae group. The register is available for keepers in England, Scotland and Wales, in the following links:"
        },
        {
            "text": "England and Wales"
        },
        {
            "text": "Scotland"
        },
        {
            "text": "And advice on SARS CoV-2 for ferret keepers is available on Preventative Measures regarding SARs-CoV-2 and Ferrets in the UK."
        },
        {
            "text": "SARS-CoV-2 and ferrets have kept me happily busy this year providing a pace to my work that involved different groups of new and interesting people. I also enjoyed the job satisfaction of seeing a tangible final outcome that better protects animals, people and the environment. Just a few of the reasons why I love my job."
        }
    ]
}