{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/10/20/back-to-the-future-policy-memory-at-the-heart-of-reform/",
    "title": "Back to the future: policy memory at the heart of reform",
    "authors": [
        "Jonathan Mitchell"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2022-10-20T12:00:37+01:00",
    "content": [
        {
            "text": "Well-intentioned government initiatives can sometimes lose contact with policy memory, but this link is critical for stability and the emergence of truly integrated policies and services."
        },
        {
            "text": "Policy churn is the system"
        },
        {
            "text": "Just as the Institute for Apprenticeships (now IfATE) came into being in 2017, the Institute for Government (IfG) published a report entitled ‘All Change’, lamenting the quantity of policy churn and reinvention in three key sectors."
        },
        {
            "text": "“Nowhere is this tendency towards reinvention more acute than in the further education sector,” wrote IfG’s Emma Norris. “Since the 1980s there have been 28 major pieces of legislation, 48 secretaries of state with relevant responsibilities, and no organisation has survived longer than a decade. There are now around 13,000 technical qualifications.”"
        },
        {
            "text": "To those acquainted with the history of policy churn in the skills system, this was sadly familiar. The centuries of faltering and cyclical skills reform endure as a stimulus to IfATE’s aspiration: to deliver a stable, coherent and employer-led skills system that enjoys the confidence and understanding of learners and employers."
        },
        {
            "text": "In 2017, observers may have felt that we ourselves merely represented the latest ingredient in what IfG described as the “alphabet soup of providers, with acronyms that change every year”."
        },
        {
            "text": "They may have been right, as our acronym was itself set to change from IfA to IfATE within two years as we added other technical education to our brief. Since then, there’s been more legislation, quite a few more secretaries of state, and a range of new qualifications and technical education products introduced. Perhaps to some it looked like business as usual – more policy churn, more reinvention, more upheaval."
        },
        {
            "text": "Connect the past to the future"
        },
        {
            "text": "In IfATE’s case, reform arose from a number of key reports – principally the Wolf Review of Technical Education (2011), the Richard Review of Apprenticeships (2012) and Lord Sainsbury’s Report of the Independent Panel on Technical Education (2016). Each was suffused with policy history and articulated recommendations and proposals that drew on deep policy memory and the lessons of the past."
        },
        {
            "text": "But we’re now several years into the reforms. It would be no surprise to anyone if the memory of those reports’ carefully argued conclusions – about how a future system should be informed by what is known in skills policy history – was beginning to fade."
        },
        {
            "text": "As with any other maturing reform programme, it may be tempting to announce seductive new initiatives that clash with the logic and evidence underpinning live reforms. Or those that return to well-intentioned initiatives that have been known to fail in the past. Will we perpetuate the cyclical history of skills policy, where a market-led approach with minimal government interventions is replaced by top-down government control, with the pendulum swinging back and forth between the poles over time? These risks are probably greater in an area of policy that is subject to less informed public and media critique than our counterparts working on schools and universities."
        },
        {
            "text": "At IfATE we want to give our emergent skills system time to bear fruit, and we think part of that is retaining contact with the lessons learned from the past that have shaped the reforms as they are. But how?"
        },
        {
            "text": "A culture of looking to the past"
        },
        {
            "text": "The good news is that there is so much history to draw upon. Barnaby Lenon’s overview of skills system history in his book ‘Other People’s Children’ catalogues a helpful summary of ‘Failure in vocational education’ from 1800 to the near past. All these histories have been unpacked in papers, reports and research over the decades – including the Edge Foundation’s helpful ‘Learning from the past’ resources."
        },
        {
            "text": "Other publications, such as the City & Guilds ‘Sense & Instability’ reports, have sought to foreground key policy history lessons at critical moments. Quite aside from whether all would agree on the conclusions drawn by individuals and organisations from such policy histories, their mere existence has immense potential for policy makers."
        },
        {
            "text": "Yet despite this sizeable body of histories relating to our own field and others, stakeholders, commentators and researchers continue to complain that government doesn’t always learn the lessons of the past in its creation of new policy. Sometimes this is to weaponise policy history in the service of protecting vested interests, of course – but even then you’d expect those responsible for promoting policy to be prepared for this with a well-informed counter case."
        },
        {
            "text": "That this doesn’t always happen in the Civil Service is partly cultural: a tradition of rapid turnover in policy teams means individuals are not always in post for long enough to build the body of specific policy history knowledge they need. And recruitment tends to privilege the skill of solutions-finding through reinvention. Few civil servants have got jobs by commending the oft-restraining hand of policy memory. We understandably value those we believe will satisfy decision-makers not known for their affection for policy history, especially when it sounds like a technocratic barrier to an ostensibly attractive announcement or sufficiently swift action."
        },
        {
            "text": "Policymakers work hard to understand the precise nature of the problem that needs to be solved. But how routinely do they ask: what do we know about what’s been tried in the past, what happened, and why?"
        },
        {
            "text": "Build institutional memory "
        },
        {
            "text": "At IfATE, our desire to maintain and cohere the skills system and its recent reform is itself a manifestation of our commitment to policy memory. Unceasing policy churn and reinvention have been the enemies of success for too long in skills and technical education. We are taking care to know why."
        },
        {
            "text": "To help with this, we have consciously prioritised the recruitment and retention of domain-expert staff with deep, longstanding expertise in skills history – including our CEO alongside former education practitioners, regulators and training employers. We are deliberate in paying heed to what they are saying, even when those are inconvenient truths. For others, we’ve developed – with Gatsby and others – an ‘Education Knowledge’ training programme, available to all staff. It unpacks the history of policy successes and heroic failures in our field, ensuring all new staff have a deeper appreciation for the lessons of the past."
        },
        {
            "text": "Our work is driven by direct partnerships with thousands of employers – those who have experienced first-hand the fallout of earlier policies: we listen just as deliberately to these partners from the ‘real world’. Their insights are amplified by those addressing IfATE staff in a regular (and very popular) external speaker series at which relevant policy histories make frequent appearances. We’re also improving the critical systems required to maintain better records of our institutional memory, and why decisions were taken: the policy histories of the future will depend on these, and they insure us against mistakes today."
        },
        {
            "text": "No doubt there is space to do even more. For instance, we need new projects to embed evidence from policy history as a routine factor to be considered before policy proposals are devised. I want us, and particularly our senior team, to grow our skill in the sort of storytelling that helps secure the lessons from what has already happened in good policy for the future."
        },
        {
            "text": "None of this is to say that alertness to policy history is about closing the door on all initiatives (including where they echo the past), and we know we have to be open to listening and responding to emerging challenges in today’s changed context. But when these things arise, we’ll keep on track towards the goals that Sainsbury, Wolf and Richard originally set and deliver reform that sticks through strong policy memory."
        },
        {
            "text": "In these ways, and hopefully more in time, we aim to do even more to equip our people with the time and space to engage with what is already known from the past in the service of the best decisions today."
        }
    ]
}