{
    "url": "https://hodigital.blog.gov.uk/2022/10/20/building-digital-capability-through-our-ddat-profession-framework/",
    "title": "Building digital capability through our DDaT Profession framework",
    "authors": [
        "Laura Gregory, Head of DDaT Capability and Profession Management"
    ],
    "categories": [
        "Continuous improvement",
        "Recruitment"
    ],
    "pub_date": "2022-10-20T11:40:13+01:00",
    "content": [
        {
            "text": "Our Digital, Data and Technology (DDaT) Capability and Profession Management team supports the attraction, development and retention of our civil servants at the Home Office."
        },
        {
            "text": "Our DDaT Profession framework provides a dedicated career framework for every role, detailing the required skills and career pathways, as well as sideways movement, of civil servant technologists."
        },
        {
            "text": "We developed this structure using the Government Digital Service DDaT Profession Capability Framework as a template. The Framework describes the job roles in DDaT and provides details of the skills needed to work at each role level. We’ve created new role clusters and positions and aligned these to the Skills Framework for the Information Age (SFIA). SFIA defines the skills and competencies required by professionals who design, develop, implement, manage and protect data and technology."
        },
        {
            "text": "Our approach also aligns with the cross-government 2022 to 2025 Roadmap for Digital and Data, Transforming for a Digital Future, which sets out ambitions to transform digital public services, deliver world-class digital technology and systems, and attract and retain the best in digital talent."
        },
        {
            "text": "Mission 5: “Digital Skills at Scale” of the roadmap is close to our heart. We recognise that developing our colleagues is key to driving forward improvements and delivering for DDaT. Our latest people survey showed that 78% of DDaT colleagues felt they were given the ability to develop their skills through continuous professional development (CPD) and learning and development opportunities, something we are very proud of."
        },
        {
            "text": "We’re continuing to build on this by using a combination of approaches to help our people manage their own learning, guided by an annual CPD goal that we recently implemented."
        },
        {
            "text": "We also have a strong focus on entry level and emerging talent. We recognise the value of diversity in the workforce. That’s why our recruitment offers a variety of entry points from school leavers to fast streamers, apprentices, and internships. Having a mixed model of senior and junior entry routes into the Home Office helps us to support the Home Office Digital Strategy 2024 to deliver effectively at scale."
        },
        {
            "text": "We’re passionate about making a positive impact on our social diversity and offer placements, such as the Summer Diversity Intern programme, to really showcase our roles to people who might not consider the Home Office or Civil Service as their employer of choice. By diversifying the way we attract and grow civil servants we support the professional growth of DDaT and develop future leaders."
        },
        {
            "text": "One of our tools to showcase what we do and how we do it is the newly launched Home Office Careers site."
        },
        {
            "heading": 2,
            "text": "\"Rewarding and varied work\": Laura Gregory, Head of DDaT Capability and Profession Management"
        },
        {
            "text": "As Head of DDaT Capability and Profession Management I lead the team that designs and supports the DDaT Profession framework."
        },
        {
            "text": "Having spent most of my career at the Home Office as a civil servant I have a real passion for building our Profession capability for new and existing civil servants."
        },
        {
            "text": "It’s so rewarding being a civil servant. 18-plus years in and I'm still here! The variety of work that’s available in these roles is astonishing and it’s incredibly rewarding to know that what we do helps keep citizens safe and the country secure."
        },
        {
            "text": " "
        }
    ]
}