{
    "url": "https://educationhub.blog.gov.uk/2022/10/gcse-and-key-stage-4-vocational-qualifications-data-explained/",
    "title": "GCSE and Key Stage 4 vocational qualifications data explained",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "GCSE",
        "GCSE results",
        "Vocational education"
    ],
    "pub_date": "2022-10-20T13:22:39+01:00",
    "content": [
        {
            "text": "The 2021/22 academic year saw the return of the summer exam series in which pupils sat GCSEs and exams relating to other Key Stage 4 qualifications for the first time since 2019. Pupils got their results in August and on Thursday 20 October we released some of the statistics relating to these results."
        },
        {
            "text": "The previous two years saw two different methods for awarding GCSE and vocational grades without pupils sitting exams. In both those years overall results were better than in previous years. While exams returned this year, there was a degree of assistance the pupils didn’t have prior to the pandemic, reflecting the disruption they’d experienced to their education in the last two years."
        },
        {
            "text": "As part of the transition back to the summer exam series adaptations were made to the exams (including advance information) and the approach to grading for 2022 exams broadly reflected a midpoint between results in 2019 and 2021."
        },
        {
            "text": "These changes mean comparisons between years aren’t quite like-for-like."
        },
        {
            "heading": 3,
            "text": "What does the data you’ve published show?"
        },
        {
            "heading": 3,
            "text": "What are you doing to narrow the attainment gap?"
        },
        {
            "text": "The attainment gap narrowed to its lowest level in 2017 but has widened in recent years."
        },
        {
            "text": "We know the pandemic has had an impact on children’s and young people’s learning, which is why our ambitious recovery plan continues to roll out across the country, with nearly £5 billion invested in high quality tutoring, world class training for teachers and early years practitioners and additional funding for schools."
        },
        {
            "text": "Schools should continue to work with parents to make them aware of support on offer, including through the National Tutoring Programme, which is supporting children from all backgrounds to catch up on lost learning and has started over 2 million courses so far"
        }
    ]
}