{
    "url": "https://socialcare.blog.gov.uk/2022/10/20/get-vaccinated-boost-immunity-and-confidence/",
    "title": "Get vaccinated: boost immunity and confidence",
    "authors": [
        "Ade Williams MBE"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-10-20T16:57:09+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Safe and effective vaccination"
        },
        {
            "text": "The COVID-19 vaccination programme has helped to protect our patients and society, restoring cherished freedoms that we must safeguard, as we enter the winter months."
        },
        {
            "text": "Rigorous scientific research and ongoing monitoring have underpinned and guided this rollout. Even with over 126 million COVID-19 vaccines now administered in the UK, we know that maintaining our vaccinated status sustains their effectiveness and the safety of the wider population."
        },
        {
            "text": "Health and social care workers continue to be offered new bivalent vaccine types that tackle both the original virus and the recent Omicron variant. This autumn booster will make sure our immune systems can better cope with new variants which may emerge, while providing ongoing protection."
        },
        {
            "text": "''What a minute, I already had my vaccinations a few months back,'' you say."
        },
        {
            "text": "We know from ongoing research that vaccine protection will wane after some time. The autumn booster vaccination will ''top-up'' our fading immunity as we enter the winter months, when both COVID and flu-related infections tend to increase. The NHS and social care system has been under relentless pressure; we know colleagues continue to work so hard to look after many sick and vulnerable people. By protecting ourselves, we care for those who rely on us."
        },
        {
            "heading": 2,
            "text": "Leading by example"
        },
        {
            "text": "As a frontline health care professional working in community pharmacy, the most accessible gateway for NHS care, my colleagues and I have already had our jabs. We want to stay healthy and safe, protecting our patients and each other. We also know that when, as happens daily, our patients ask, ''Have you had your vaccination?'', our answer can always be \"Yes\". Not only does this give them confidence in the vaccine, but spurs them to follow suit."
        },
        {
            "text": "Please do take up these two separate and critically vital vaccinations on offer, the COVID-19 booster and flu jabs, but if you have any questions, speak to colleagues able to answer them or access information from reputable sources. Thank you again for all you do daily. Your commitment, dedication, and generous kindness makes all the difference."
        }
    ]
}