{
    "url": "https://grantscommunity.blog.gov.uk/2022/10/20/getting-ready-for-the-next-six-months/",
    "title": "Getting ready for the next six months",
    "authors": [
        "govtgrantscommunity",
        "pennyhornerlong1"
    ],
    "categories": [
        "Civil Service",
        "Digital transformation",
        "Expert Services",
        "Government Grants Management Function",
        "Learning and development",
        "Spotlight"
    ],
    "pub_date": "2022-10-20T14:21:51+01:00",
    "content": [
        {
            "text": "It’s starting to feel Autumnal with change in the air. The leaves are changing colour and the clocks will go back at the end of the month marking the official end of summer."
        },
        {
            "text": "It’s also mid-way through the business planning year. It’s the perfect time to take stock of your achievements and focus on priorities for the reminder of the financial year. Is change required? It’s a time to reflect, evaluate, reset priorities and recharge the personal and professional batteries. How can I be more efficient? What’s working well and not so well? What are the dependencies? What are the blockers? What training would help me deliver my objectives? "
        },
        {
            "text": "As part of this reflection and reset, I’d like to remind you that the Government Grants Management Function (GGMF) is here to help you!"
        },
        {
            "text": "As a government function, we set standards and provide guidance, tools, training and best practice to help individuals and teams design and deliver grants schemes effectively and efficiently. Grants are a vital tool for delivering government priorities in domestic areas, including education, research, civil society,  innovation and in other parts of the world through international aid projects.  The grants practitioner community is diverse - from those new to grants, to more experienced practitioners and to policy officials who, from time to time, may oversee a grant scheme to support a government priority."
        },
        {
            "text": "Whatever your experience and skills, GGMF can help you with training, advice and access to digital tools to automate parts of the grants making process. "
        },
        {
            "heading": 2,
            "text": "Be confident "
        },
        {
            "text": "GGMF has developed a wide range of learning and development opportunities to support the diverse grants community - including online webinars, best practice case studies, residential courses and in person training sessions. "
        },
        {
            "text": "You can tailor the training to your needs and your stage in your career. Many of the resources are self-service and available on the Grants Centre of Excellence (once you have registered). Our popular resources include:"
        },
        {
            "text": "Don’t forget the 70/20/10 training model - 70% on the job, 20% peer to peer and 10% classroom learning. GGMF professional development opportunities will keep your skills up to date and enable you to embrace best practice and new technologies and work efficiently and effectively. "
        },
        {
            "heading": 2,
            "text": "Be efficient "
        },
        {
            "text": "Automation can save time and money. Are you, as a grants practitioner, using the digital tools and services designed by GGMF to make sure grant spend goes to applicants with as little as possible going on administrative costs?"
        },
        {
            "text": "Here’s a summary of our tools:"
        },
        {
            "text": "We are working more closely with the Government Commercial Function to increase visibility across the circa £258bn of grant funding and the circa £50bn of procurement spend and allow more integrated ways of working to drive further efficiencies. Watch this space for updates!"
        },
        {
            "heading": 2,
            "text": "Be up to date "
        },
        {
            "text": "GGMF provides regular updates on ‘hot topics’ to share best practice and innovation. Recent topics covered include:"
        },
        {
            "text": "And don’t forget the annual grant spend data, recognised as an official statistic, to hold grant-makers to account and show where the money goes. "
        },
        {
            "heading": 2,
            "text": "What to do next"
        },
        {
            "text": "With your gov.uk email address, you can access the Grants Centre of Excellence for grant-making standards, guidance, training, best practice and latest news. You can also contact us on grants-management-function@cabinetoffice.gov.uk for details about our digital tools."
        },
        {
            "text": "We’d love to hear from you and any top tips you have at this time of the year to reset your priorities. "
        },
        {
            "text": " "
        }
    ]
}