{
    "url": "https://educationhub.blog.gov.uk/2022/10/20/how-we-are-helping-improve-pre-schoolers-early-development/",
    "title": "How we are helping improve pre-schoolers’ early development",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "childminders",
        "early years",
        "Home Learning Environment",
        "nurseries"
    ],
    "pub_date": "2022-10-20T14:40:02+01:00",
    "content": [
        {
            "text": "The early years of a child’s life are vital, not only in establishing important developmental skills, but also in building a lifelong love of learning that will help them in school."
        },
        {
            "text": "Nurseries and childminders do vital work in helping children learn through play and preparing young children for school including building their early language and numeracy skills."
        },
        {
            "text": "That’s why we have announced a package of crucial support for the early year’s workforce, a huge investment in their skills and professional development."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What have you announced?"
        },
        {
            "text": "Thousands of childminders and school based, private, voluntary, independent, and maintained nursey school workers will benefit from money to drive quality and training opportunities and to better support the next generation of children."
        },
        {
            "text": "Every region in England will benefit from programmes to improve teaching of children’s early speech, language and numeracy, along with professional development for practitioners to build strong leadership skills and improve their understanding of children’s development."
        },
        {
            "text": "Up to £180million of government funding over three years will support the sector to focus on children’s development in their earliest of years and help to address existing recruitment and retention challenges in the profession."
        },
        {
            "text": "New opportunities will also be provided for graduates looking to embark on a career in early years teaching, as well as staff looking to train as early years special educational needs coordinators (SENCOs)."
        },
        {
            "heading": 3,
            "text": "Why have you made this investment? "
        },
        {
            "text": "Evidence shows that access to early education is crucial in supporting children to thrive in school and go on to succeed in adulthood."
        },
        {
            "text": "There are benefits to society as a whole too - the Education Endowment Fund has also shown that improving young children’s pre-school language skills could boost the economy by up to £1.2 billion over the course of their lifetimes."
        },
        {
            "heading": 3,
            "text": "What kind of things does this package of support include? "
        },
        {
            "text": "The investment will benefit pre-school children all over England and includes early maths, language, and social development training for up to 10,000 professionals."
        },
        {
            "text": "More than 1,300 professionals in 51 local authorities will be provided with bespoke training designed to support the learning and development of children affected by the pandemic during the second phase of this programme, meaning around 20,000 children will have benefited from better trained, more confident staff."
        },
        {
            "text": "In addition, there will be a new universal online child development training offer to help staff improve their knowledge and understanding of how pre-school children develop, as well as training for early years professionals to help parents and guardians encourage their children’s development at home."
        },
        {
            "text": "There will also be the continuation of the Nuffield Early Language Intervention (NELI) programme during academic year 2022-23 – building on the two-thirds of primary schools which have already benefitted from this investment, improving the speech and language skills of an estimated 90,000 children in reception classes."
        },
        {
            "text": "You can find the full list of what the latest package of support includes here."
        },
        {
            "heading": 3,
            "text": "What can I do to help my pre-schooler learn at home too? "
        },
        {
            "text": "Every child is different and there’s no one-size-fits-all approach. What matters most is spending time with your child chatting, playing, and reading. Every little thing you do with them will set them up well as keen learners for when they start school."
        },
        {
            "text": "You can read our top ten tips from early years experts here."
        },
        {
            "text": "In partnership with the Department of Health and Social Care, we have launched a new ‘Better Health - Start for Life’ campaign, providing parents of children aged 0 to 4 with practical advice and tips to help them develop their child’s language and literacy skills before starting school."
        }
    ]
}