{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/10/20/improving-the-policymaking-environment/",
    "title": "Improving the policymaking environment",
    "authors": [
        "Rebecca Lester",
        "Serena Nϋsing"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2022-10-20T12:00:42+01:00",
    "content": [
        {
            "text": "Our team is on a mission to better understand policymaking environments across government. By this, we mean the way policymakers are supported to do their work and all the contextual factors that impact this. We believe that in order to improve policy, we need not only to build the capability and skills of individual policymakers but also to build an infrastructure around them that supports them to do their jobs and deliver better outcomes for citizens."
        },
        {
            "text": "Our end-goal is to build a model for government departments to diagnose the extent to which their environment is conducive to good policymaking and identify opportunities for improvement."
        },
        {
            "text": "Over summer we conducted research with policymakers across government to deep dive into the concept of the policymaking environment and to understand their needs in relation to this new model."
        },
        {
            "heading": 2,
            "text": "What does the ideal policymaking environment look like?"
        },
        {
            "text": "In one of our recent workshops, we asked participants to create their ideal policymaking environment by mapping what they need in place in order to make good policy, considering everything from the resources they require through to type of organisational culture that produces good policy outcomes. Having access to a range of diverse data, working with specialists, encouraging openness and creativity, and integrating citizens and stakeholders into policymaking from start to finish were all included as important factors in their ideal environments."
        },
        {
            "text": "These discussions also revealed how the policymaking environment is currently experienced by policymakers in reality day-to-day, exposing both significant issues and opportunities for improvement. For example, policymakers are frequently frustrated by poor organisational memory and knowledge management; report have to overcome major hurdles in order to engage with citizens and end users; and think that operational delivery teams should be more involved in developing policy as well as delivering it. Some of these issues are underpinned by practical barriers, others by complex cultural and/or structural factors that require deeper examination."
        },
        {
            "heading": 2,
            "text": "Motivations for change "
        },
        {
            "text": "Looking beyond the concept of the policymaking environment and towards a practical tool that departments can use to evaluate their own environments our research has revealed both a gap and a need. There is currently no systematic way for teams or departments to reflect on their policymaking environments, to try to understand the current situation, nor to identify how to make it better in the future."
        },
        {
            "text": "In contrast, there was a recognition among research participants of how valuable a profession-wide approach for improving policymaking environments would be. There was also an acknowledgement that at present when we think about improving policymaking, almost all of the focus is on the individual. In other words, building the skills and capability of policymakers themselves without looking at the contexts within which they are working:"
        },
        {
            "text": "Policymakers (and those who work alongside them) are motivated by the idea of a model that aims to address this and see three key opportunities:"
        },
        {
            "heading": 2,
            "text": "Research foundations"
        },
        {
            "text": "Our approach including in-depth interviews, ethnographic research in which we trained 18 policymakers to become participant-observers in their own departments, and workshops testing initial prototypes for how the model might work. So far, we have conducted research with almost 100 civil servants from 18 different departments, devolved authorities, and arms-length bodies, with participants ranging from AO to SCS1 grade often taking part in discussions together in the same (virtual) room."
        },
        {
            "heading": 2,
            "text": "Policymakers: share your views"
        },
        {
            "text": "Alongside cross-government research, we have recently finished working with a government department to test an early-stage prototype of the model in context. Our next step is to bring everything together. We will iterate, ideate and design what the model should look like and how it might work at government-wide level."
        },
        {
            "text": "Have you ever thought about your policymaking environment? What are the biggest issues that you’ve experienced and how do you think that your environment could be improved?"
        },
        {
            "text": "Share your views in the comments below..."
        }
    ]
}