{
    "url": "https://ruralpayments.blog.gov.uk/2022/10/20/introducing-you-to-13/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Introducing You To",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-10-20T15:07:33+01:00",
    "content": [
        {
            "text": "Hello, I’m Norma and I’m a Customer Service Centre operative working in the call centre, based in Workington."
        },
        {
            "text": "I’ve worked for RPA for 24 years, starting with the British Cattle Movement Service (BCMS). I currently answer calls on the Countryside Stewardship, Environmental Stewardship, BCMS and Sustainable Farming Incentive customer helplines."
        },
        {
            "text": "I really enjoy being able to help our farmers, particularly as my family have been involved with farming for generations – both my sisters farm too. I’ve always lived on farms and we currently keep sheep, but for 19 years prior to joining RPA, we ran a dairy herd and milk round, bottling our milk and delivering it around the local villages every day of the year."
        },
        {
            "text": "My primary responsibilities at RPA are to be a point of contact for farmers, providing the information they need. I believe my role helps farmers and makes their life easier as I’m able to give them reassurance that we take all their calls seriously and we’ll always look to address their concerns or questions. Being professional, whilst showing empathy and stating from the offset what’s possible and what’s not, managing expectations and being honest is the part of my role that has the greatest impact on those who ring the call centre."
        },
        {
            "text": "During my time at RPA I’ve worked in a number of roles, including on the foot and mouth help line in 2001, taking calls from desperate farmers at a dreadful time. I was also a team leader on a project that set up the poultry registration system where my knowledge of poultry farming came in very useful. I also had the best job in RPA when I was a point of contact between RPA and the farming support agencies. My knowledge and understanding of farmers helped to build trust, and I had the pleasure of working with wonderful people from across all departments to deliver help and support to our most vulnerable customers."
        },
        {
            "text": "A number of years ago I was fortunate enough to be successful in being awarded a place on the Defra ‘Releasing Talent Programme’ and this totally changed my outlook giving me the confidence to apply for opportunities and work with others from across RPA. I would encourage everyone to look for opportunities. I try to support others and RPA to the best of my ability, taking on responsibilities as both a first aider and mental health first aider, fire warden, and other roles providing support to colleagues. I’m a mediator, and also support new mediators, as well as undertaking cases for Defra and the Cabinet Office."
        },
        {
            "text": "I also enjoy attending external events such as agricultural shows, dairy events etc., with other brilliant colleagues, talking face-to-face with farmers, and I think this is vitally important because it helps to builds rapport and understanding."
        },
        {
            "text": "As well as farming, outside of work, I’m a director/secretary of Cockermouth & District Agricultural Show Society, and have organised this annual event since 1987. I’m the first female and longest serving secretary.  I’m also a member of the executive committee of the North West Association of Show and Agricultural Organisations (ASAO). I joined the Young Farmers Club in 1963 and am now on the third generation of members. I was also a Governor at the local Lakes College, serving seven terms of office, and I’m currently back as a member of their audit committee and a director of the company responsible for in-house catering and cleaning."
        },
        {
            "text": "When I left Cockermouth Grammar School in 1966, I was articled to a local accountancy firm for five years and since 1976 I’ve been the accountant - now company secretary - of a successful electrical retail company. We’ll celebrate 100 years of business next year, and I admit to being the oldest thing there, (even the shop fittings have been replaced three times)."
        },
        {
            "text": "In my spare time, I also enjoy reading, embroidery, knitting and crocheting. I’m also a keen gardener and collect fine china, much to my son’s disgust."
        },
        {
            "text": "You can hear more from Norma on our Youtube channel"
        }
    ]
}