{
    "url": "https://defencedigital.blog.gov.uk/2022/10/20/is-it-really-worth-it-for-an-extra-few-likes/",
    "title": "Is it really worth it for an extra few likes…?",
    "authors": [
        "D. Cottey-HIll"
    ],
    "categories": [
        "Cyber",
        "Cyber Confidence"
    ],
    "pub_date": "2022-10-20T11:31:18+01:00",
    "content": [
        {
            "text": "A huge proportion of our population now spend much of their day glued to laptop screens or monitors. This has only increased since the Covid-19 pandemic."
        },
        {
            "text": "Research shows that 57.6 million people in the UK (equivalent to 84.3% of the population) now use social media to keep in contact with friends and family, with the average user spending 110 minutes on social media per day! "
        },
        {
            "text": "Now, more than ever, you would think that we would be aware of the dangers of living and sharing our lives online. This is unfortunately not the case, especially in younger people. 55% of 5 to 15-year-olds use social media sites or apps, yet the minimum age requirement for most social media platforms is 13. This mean that many falsify their age, often without their parents knowing. "
        },
        {
            "text": "To add to this, the era of the ‘social influencer’ has led to many people leaving their social media profiles on open or ‘public’, in a bid to gain more ‘likes’ and increase their social media presence. I must admit I was guilty of doing this. Although I am not on platforms such as TikTok, up until recently, the privacy settings on my Facebook and Instagram accounts were set to public. Why did I do this? I wanted to share with the world how well travelled I was, and when I had been to events such as festivals, to show I was leading a fun life; all for a bit of an ego boost."
        },
        {
            "text": "It is only since I have started working in the cyber awareness area that I have truly learnt to understand the dangers of doing such a thing."
        },
        {
            "text": "Once posted online, it is very difficult to get your information offline. This is why it is so important to think about what you share online before you share it. Do I really want my 1,165 Facebook “friends” (most of which I have only met a handful of times and the majority of who I am no longer in contact with) really knowing that my house is vacant because I am on holiday? "
        },
        {
            "text": "I decided to look at my digital footprint (a collection of all the information surrounding you online) and I was quite shocked by what I found. Having quite a unique surname made it particularly easy to find information on me. A quick ‘Google’ displayed results from swimming galas I competed in years ago, and my Just Giving Page from when I completed the London to Brighton bike ride, shows the names of family and friends who donated. This could be a gold mine of information for any determined hacker. "
        },
        {
            "text": "Best practice is to delete any accounts you don’t use anymore and to conduct a breach check, to see if any of your passwords have been leaked. You can check via many online services including ‘Dehashed’, ‘Have I Been Pwned’ or free services via Apple and Google. "
        },
        {
            "text": "One thing that really shouldn’t be shared online is your level of security clearance. Listing whether you have Developed Vetting (DV) or Security Check (SC) clearance, on platforms such as LinkedIn, tells people that you are someone who may know or have access to important information. This is something that cyber criminals could exploit and use to their advantage. "
        },
        {
            "text": "If you haven’t already, take a look at the latest edition of the Revolt Magazine. Written by our fictional hacktivist group, the ‘Ministry of Defiance’, it is packed full of useful information on hackers’ tactics and how to avoid falling for their malicious attacks."
        },
        {
            "text": "This piece isn’t written to scaremonger. It is simply meant as a reminder to think about your digital footprint, and whether having public social media accounts is really worth it for a few extra likes."
        },
        {
            "text": "The simple message is; take action now to lock down your online presence, to prevent you, your family and colleagues from becoming the latest victims of a cyber attack."
        },
        {
            "text": "For more information, visit the Cyber Confident in Defence SharePoint, Cyber Confidence on Defence Connect or email the team at cyberconfident@mod.gov.uk."
        },
        {
            "text": "References:"
        },
        {
            "text": "https://www.statista.com/statistics/507405/uk-active-social-media-and-mobile-social-media-users/"
        },
        {
            "text": "https://cybercrew.uk/blog/social-media-statistics-uk/"
        },
        {
            "text": "https://www.ofcom.org.uk/__data/assets/pdf_file/0025/217825/children-and-parents-media-use-and-attitudes-report-2020-21.pdf"
        }
    ]
}