{
    "url": "https://socialcare.blog.gov.uk/2022/10/20/recruitment-vaccination-and-the-best-dementia-care/",
    "title": "Vaccination, recruitment and the best dementia care",
    "authors": [
        "James Rycroft"
    ],
    "categories": [
        "Care and support",
        "Dementia",
        "Workforce"
    ],
    "pub_date": "2022-10-20T09:10:39+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Protecting health and wellbeing"
        },
        {
            "text": "Vida Healthcare was established in 2010 with the aim of transforming the care available to people living with dementia. It was clear at the time that the majority of traditional residential care homes simply didn’t have the resources or expertise to fully support residents as they progressed on their journey with dementia."
        },
        {
            "text": "We set about challenging perceptions and practices in dementia care, with an emphasis on reducing medication use and providing bespoke environments and alternative therapies to improve wellbeing and quality of life."
        },
        {
            "text": "Not only is protecting the physical and mental health and wellbeing of our residents absolutely crucial to making sure they live happy and healthy lives, but our staff are also a primary focus for us to reduce the risk of burnout, enabling them to deliver high quality care, and for us to retain and attract talent to our homes."
        },
        {
            "text": "To this end, we have a range of initiatives in place to protect the health and wellbeing of our staff and residents."
        },
        {
            "heading": 2,
            "text": "Vaccination focus"
        },
        {
            "text": "We’ve recently been in the process of rolling out the latest batch of Covid-19 and flu vaccines to everyone living and working in our three care homes to protect them as we head into the winter months. The roll out commenced in mid-September and the clinic will support staff for as long as is required."
        },
        {
            "text": "We are actively promoting the vaccine rollout with our staff, and working hand in hand with our pharmacy supplier to deliver bespoke clinics to enable our staff to access the vaccines."
        },
        {
            "text": "Vaccines offer peace of mind to all residents, family members and staff that the risk of cross-infection is low and they will remain safe within our care homes. Wherever you are, if you haven't done so already, please book your COVID-19 booster and flu vaccinations as soon as possible."
        },
        {
            "text": "Alongside physical health, the mental health of our residents is also particularly important. We have a significant number of wellbeing activities and therapies in place that are delivered daily to give our residents a sense of purpose and self-worth."
        },
        {
            "text": "These include doll therapy, stretching and armchair exercise sessions, painting sessions, and hair appointments with our in-house hairdressers. These activities also give our staff the opportunity to socialise and bond with residents which is crucial to them delivering a high quality level of care."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Our vision and values"
        },
        {
            "text": "Our vision and values represent the business as a whole and our workforce. We’re committed to delivering the highest quality, person-centred care possible and so it’s important that we have an ethos of care that everyone can buy into."
        },
        {
            "text": "We are united as a team in excellence, from the care we give our residents to the opportunities that we provide our staff with. Our team is dedicated to generating trust with residents, their loved ones, and colleagues to provide peace of mind and understanding across the board."
        },
        {
            "text": "We view all of our people, whether they be residents or staff, as extremely important and we make sure that we’re in it together to focus on the details and always be kind to each other. This helps to ensure that we’re protecting the health and wellbeing of staff and residents along every step of the way."
        },
        {
            "heading": 2,
            "text": "Attracting and retaining talent"
        },
        {
            "text": "Looking after people living with dementia takes skill and dedication and we train and mentor all staff that join us through our Vida Academy. Solid, in-depth inductions offer a strong foundation to work from and then continuous mentoring and development. We are here to ensure our resident’s lifestyles and wellbeing needs are met and the satisfaction staff receive from achieving this is amazing."
        },
        {
            "text": "Since we opened our first care home we have always ensured that every member of staff that joins Vida has one simple characteristic and that is kindness. Our ethos of care is built around kindness and we simply cannot operate without it. Our residents deserve kindness as do their families and we are very proud to have received many testimonials confirming that we are achieving this."
        },
        {
            "text": "For more information on jobs available visit Vida Healthcare."
        }
    ]
}