{
    "url": "https://digitaltrade.blog.gov.uk/2022/10/20/the-civil-service-recruitment-process-explained-part-1/",
    "title": "The Civil Service recruitment process, explained: part 1",
    "authors": [
        "Helen Redmond, DDaT Resourcing Manager",
        "Sophie Keren, User Research Profession Lead"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-10-20T13:55:42+01:00",
    "content": [
        {
            "text": "The Civil Service recruits using a system called Success Profiles. This means for each role we advertise, we consider what you will need to demonstrate in your application and interview for us to assess whether you will be successful in the job. This makes the interview process fair and straightforward to prepare for, and gives us the best possible chance of finding the right person for the job, whilst improving diversity and inclusivity."
        },
        {
            "text": "Success Profiles is a ‘competency-based’ assessment framework. It assesses candidates against a combination of 5 elements – behaviours, experience, ability, technical skills and strengths. In the Digital, Data and Technology (DDaT) directorate, we have a specific DDaT Profession Capability Framework which lists the technical skills needed for each job. In this mini blog series our DDaT recruitment team, recent hiring managers and joiners will explain the DDaT recruitment process and share tips for success at each stage. This blog focuses on the statement of suitability and the Civil Service behaviours, with the second blog in the series focusing on technical assessments and overall success."
        },
        {
            "heading": 2,
            "text": "Statement of suitability"
        },
        {
            "heading": 3,
            "text": "Helen Redmond, DDaT Resourcing Manager"
        },
        {
            "text": "A CV and statement of suitability is the first part of our DDaT recruitment process via Jobvite. Statements of suitability (also known as a cover letter) are a really important part of your application. If you do not provide us with a statement of suitability, it is likely your application will not be considered."
        },
        {
            "text": "A statement of suitability is the place for you to tailor your application. It is where you tell us why you are interested in the role and provide further evidence of how you meet each of the ‘Essential Skills and Experience’ listed in the job advert.  It is your chance to set out your passion for the role and show us the skills and experience you can bring. We do not always specify a word count, but around 300 words is recommended."
        },
        {
            "heading": 3,
            "text": "A hiring manager’s perspective: Sophie Keren, User Research Profession Lead"
        },
        {
            "text": "As a hiring manager, the statement of suitability is where I hope to see applications come to life. It provides detail and narrative that expands on your CV and sets out how your experiences have prepared you for the role. It is also an opportunity to explain why you want the role and to highlight anything that makes you stand out as a candidate."
        },
        {
            "text": "Depending on how specific the job description is, it can sometimes be helpful to group your statement thematically or in a way that corresponds to the job advertisement. For example, you might want to use bullet points to respond to a list of essential or desirable criteria. This kind of format means we can directly compare your statement to our expectations for the role."
        },
        {
            "text": "My one piece of critical advice would be to stick to the word count if there is one! We must treat every application fairly and stop reading after the word limit, so think carefully about what information you want to prioritise."
        },
        {
            "heading": 2,
            "text": "Civil Service Behaviours"
        },
        {
            "heading": 3,
            "text": "Helen Redmond, DDaT Resourcing Manager"
        },
        {
            "text": "The Civil Service has a defined set of behaviours, specific to a job’s grade and duties. The behaviours being assessed for the role you are applying for will be outlined in the job advert – you will not need to demonstrate all the behaviours for one role. Your behaviours will be marked out of 7 at interview, with 7 being the highest mark. A good way to answer a behaviour-based question is to use an example of a time you have shown the behaviour in a professional situation in your current or previous role and structure your answer using the STAR (situation, task, action, result) method. You can read more about the Civil Service behaviours on GOV.UK."
        },
        {
            "heading": 3,
            "text": "A hiring manager’s perspective: Sophie Keren, User Research Profession Lead"
        },
        {
            "text": "A good behaviour answer tells me that:"
        },
        {
            "text": "We typically recommend using the STAR format described above to demonstrate your behaviour competency. This can feel formulaic but it means we understand exactly what you did and can easily relate your answer to the job we are sifting for. When we are interviewing a lot of candidates, the clear and concise answers really stand out!"
        },
        {
            "text": "It's important to know that we can only score you on evidence you provide. Using “I” statements and demonstrating ownership of your work is important in a good behaviour answer, especially if you’re describing a team effort. Specific details are also very helpful when explaining the results of your actions, as they give us a fuller sense of the scenario you’re describing."
        },
        {
            "text": "A word of caution – do not be tempted to embellish the truth! We are not looking for perfection or world-class behaviours in every answer. We want to know how you fit the role as an individual and what behaviours and experiences you bring to the table specifically."
        }
    ]
}