{
    "url": "https://forestrycommission.blog.gov.uk/2025/12/01/8-top-tips-for-successful-woodland-establishment-this-winter/",
    "title": "8 top tips for successful woodland establishment this winter",
    "authors": [
        "Polly Harries"
    ],
    "categories": [
        "Tree planting",
        "Woodland creation"
    ],
    "pub_date": "2025-12-01T09:00:00+00:00",
    "content": [
        {
            "text": "Last month marked the beginning of tree planting season, where colder temperatures and soil moisture levels provide dormant trees the best conditions for planting."
        },
        {
            "text": "If you’re thinking of planting trees this winter, here are 8 top tips to help your woodland creation project take root."
        },
        {
            "heading": 2,
            "text": "1. Plan before you plant"
        },
        {
            "text": "Before you reach for the planting spade, take time to think about your objectives and the long-term vision of your woodland. Whether it’s for timber, biodiversity, water quality or shelter, your objectives will influence your woodland design. Taking the time to plan gives you the basis for establishing a successful woodland."
        },
        {
            "text": "There is available funding to help design your woodland  to the UK Forestry Standard, with expert support on hand."
        },
        {
            "heading": 2,
            "text": "2. Choose the right tree species"
        },
        {
            "text": "Work with your land and not against it. Choose species that best match your site’s characteristics with your objectives."
        },
        {
            "text": "For example, if future woodland grazing is planned, consider including palatable species such as aspen, willow and hazel for browsing and avoid species that are toxic to livestock such as yew."
        },
        {
            "text": "Factor in climate change by considering species that will thrive in future environmental conditions. The Forest Research Ecological Site Classification tool can help you choose the right trees for your site."
        },
        {
            "heading": 2,
            "text": "3. Ground preparation"
        },
        {
            "text": "The amount of ground preparation your site will require will depend largely on its previous use. Former arable land may be compacted, hindering root development and may require loosening with subsoiling or ripping (techniques that loosen compacted soil layers)."
        },
        {
            "text": "Clearing competing vegetation is crucial as weeds compete with young trees for light, water and nutrients. Choose the right vegetation control method for your site. This can include mowing, targeted herbicide application or cultivation, and always follow best environmental practices."
        },
        {
            "heading": 2,
            "text": "4. Timing is key"
        },
        {
            "text": "Your timing for planting can make all the difference for tree survival rates. In the UK, the planting season usually occurs between mid-November and early March, when the trees are dormant."
        },
        {
            "text": "Aim to plant as early as possible, ideally before the end of January. This gives trees time to establish roots before drier spring and summer conditions."
        },
        {
            "heading": 2,
            "text": "5. Size matters"
        },
        {
            "text": "Bigger isn’t always better when it comes to planting trees. Young trees under 1 metre (whips) are often the best choice for a new woodland. These young trees establish quickly and adapt to their new environment. A 40-60cm whip can often catch up with a 6-foot tree within just a few years."
        },
        {
            "heading": 2,
            "text": "6. Handle with care"
        },
        {
            "text": "Appropriate handling minimises tree losses and helps to reduce establishment costs. It is important to:"
        },
        {
            "text": "Root desiccation and frost damage are among the most common causes of poor establishment and plant failure."
        },
        {
            "heading": 2,
            "text": "7. Planting"
        },
        {
            "text": "Plant your trees at the same depth they were growing in the nursery by making sure the ‘collar’, where the roots meet the trunk, sits level with the ground."
        },
        {
            "text": "When using canes or stakes for support, ensure they are placed in the ground firmly to avoid loosening which can cause damage to your trees."
        },
        {
            "heading": 2,
            "text": "8. Tree protection"
        },
        {
            "text": "Once your trees are in the ground, it’s important to protect them to ensure they survive. Effective tree protection not only helps them to establish but also prevents damage from wildlife and keeps competing plants at bay."
        },
        {
            "text": "Protect your trees by using tree shelters and guards, installing fencing and carrying out effective mammal management. It is important to consider:"
        },
        {
            "heading": 2,
            "text": "Further practical advice for woodland establishment"
        },
        {
            "text": "For more practical advice, check out our Woodland management: tips for early establishment video."
        },
        {
            "text": "For further information on woodland creation, including available grants and funding, visit our Tree planting and woodland creation: overview."
        }
    ]
}