{
    "url": "https://marinescience.blog.gov.uk/2025/12/01/from-listings-to-lasting-protection-strengthening-indonesias-capacity-to-safeguard-threatened-sharks-and-rays/",
    "title": "From Listings to Lasting Protection: Strengthening Indonesia’s Capacity to Safeguard Threatened Sharks and Rays",
    "authors": [
        "Joanna Murray"
    ],
    "categories": [
        "biodiversity",
        "Climate Change",
        "Field Research",
        "Fisheries",
        "Hydrology",
        "International",
        "Monitoring",
        "Science",
        "Uncategorized",
        "Vulnerable species",
        "Wildlife trade"
    ],
    "pub_date": "2025-12-01T13:31:14+00:00",
    "content": [
        {
            "text": "By Efin Muttaqin, Siti Zanuba Aisyah, Wahyu Putri Fajar Rahmalinda & Heidi Retnoningtyas from Rekam Nusantara Foundation, and Joanna Murray, Marine Wildlife Trade and Bycatch Lead at Cefas."
        },
        {
            "text": "Indonesia’s relationship with sharks and rays is as deep and vast as its oceans. For centuries, coastal communities have relied on marine resources for food and livelihoods. Today, Indonesia is also one of the world’s largest producers and exporters of shark and ray products, bringing with it both responsibility and opportunity. With so many species now threatened and regulated under the Convention on International Trade in Endangered Species of Wild Flora and Fauna (CITES), ensuring that trade is legal and sustainable is not just an international obligation, but a national priority for conserving marine biodiversity. As a CITES Party, Indonesia must ensure that all trade in listed species is legal, traceable, and sustainable, an increasingly complex task as more sharks and rays are listed on the Appendices of the CITES convention."
        },
        {
            "text": "As the CITES Conference of the Parties (CoP) convenes over the next two weeks in Samarkand, Uzbekistan, with governments from around the world debating and deciding on proposals for new species listings, work is underway across Indonesia to translate these commitments into practice. Strengthening species identification, monitoring, and enforcement capacity ensures that once new listings are adopted, implementation on the ground can begin."
        },
        {
            "text": "Yet on the ground, the challenges are real. Sharks and rays do not arrive neatly labeled; they come as whole specimens, frozen blocks, fin sets, dried products, and processed meat. Some species look deceptively similar. A misidentified specimen can lead to incorrect reporting, undetected illegal trade, or an overlooked opportunity to intervene. Addressing illegal trade requires more than regulations, it demands people are skilled, confident, and equipped to identify species accurately at landing sites, checkpoints, processing facilities, and export hubs. And for Indonesia to meet its ambition to reduce illegal trade through stronger cohesion among authorities, better tools, and improved compliance, one thing is clear: people must have the skills to recognise what they are looking at."
        },
        {
            "text": "To tackle this, nineteen officers from Marine and Coastal Resource Management Units from across Indonesia (Padang, Pontianak, Sorong, Denpasar, Makassar, and Serang), responsible for inspecting shark and ray products every day, travelled to Lombok in October 2025, to participate in shark and ray identification training. The workshop was hosted by the Directorate of Species and Genetic Conservation of the Ministry of Marine Affairs and Fisheries of Indonesia, co-organized by Rekam Nusantara Foundation and Cefas, and funded by the International Wildlife Trade Challenge Fund."
        },
        {
            "text": "Over five long and intensive days, participants immersed themselves in a learning journey with international expert Dr Rima Jabado, alongside national experts Dr Fahmi, Dr Andhika Prasetyo, and Benaya Simeon. Tanjung Luar Fishing Port became an outdoor laboratory. Here, amid the bustle of auction activities and the scent of the morning catch, participants rolled up their sleeves and applied what they had learned in the classroom. They practiced identifying whole shark and ray specimens, measuring biological parameters, as well as examining dried and processed products in local facilities. Trainers guided them in spotting subtle characteristics: fin shapes and coloration, vertebral counts, spine structure, details that can make the difference between a legal product and a protected species."
        },
        {
            "text": "Another highlight was the DNA sampling practical led by Andhika, an integral step of introducing novel monitoring technologies to identify sharks’ species. Ultra-processed products such as cartilage (used as pet chews among other things), fin needles (used in shark fin soup), and shark jaws (ornamental) can often make visual identification challenging, and this is where genetic approaches provide a clear advantage. Participants learned how to collect, preserve, and document tissue samples to support molecular identification, which is critical when visual cues are ambiguous or completely lacking."
        },
        {
            "text": "Capacity building is rarely glamorous, but its impact is profound. Every officer who can accurately identify a shark or ray species contributes to stronger enforcement and better compliance with national and international regulations. This training is one chapter in a much broader effort to support on the ground CITES implementation in Indonesia with support from our IWT Challenge Fund Extra project. Armed with new skills, participants of this training will return home to mentor colleagues across Indonesia, steadily increasing the country’s capacity to identify sharks and rays in trade with confidence. And while they lead the charge on the ground, one of our project’s PhD researchers continues to advance the development of molecular tools to uncover the true identity of products that can’t be identified by eye, ensuring no shark or ray slips through the cracks."
        }
    ]
}