{
    "url": "https://marinedevelopments.blog.gov.uk/2025/12/01/highlights-from-the-coastal-partnership-network-conference/",
    "title": "Highlights from the Coastal Partnership Network Conference",
    "authors": [
        "Chloe Boyle, Coastal Planner"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-12-01T13:20:49+00:00",
    "content": [
        {
            "text": "Members of the Marine Planning team and the Evidence and Evaluation team from the Marine Management Organisation (MMO) attended the Coastal Partnership Network (CPN) conference in Liverpool held in October. The CPN provide support for collaboration work across the UK coastline, connecting Coastal, Estuary & Marine Partnerships (CEMPs) and similar initiatives. Their goal for the conference was to support CEMPs while ensuring the value of their work and the coast is recognised nationally."
        },
        {
            "text": "Chloe Boyle (North West Coastal Planner) and Elizabeth Brett (Senior Evidence Specialist) presented on the MMOs functions with CEMPs, providing previous examples of positive working relationships and their benefits. They also shared numerous projects that the MMO and CEMPs have collaborated on across the coast, along with future opportunities to collaborate."
        },
        {
            "text": "Areas of collaboration between the MMO and CEMPs so far and their associated benefits have taken place in:"
        },
        {
            "text": "Collaborating with CEMPs improves communication, ensuring better access to information, reports, and local projects which may otherwise be restricted. It also enhances relationships with coastal stakeholders and decision-makers. Raising awareness of the MMOs functions amongst stakeholders and in turn providing access to participate in discussions and the decision-making process. "
        },
        {
            "text": "We would like to thank the CPN for giving us the opportunity to present and all those at the conference who engaged with us during our time there."
        }
    ]
}