{
    "url": "https://rpc.blog.gov.uk/2025/12/01/post-implementation-reviews-update-on-progress-across-government/",
    "title": "Post-implementation reviews: Update on progress across government ",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Evaluation",
        "Post-implementation reviews"
    ],
    "pub_date": "2025-12-01T15:09:25+00:00",
    "content": [
        {
            "text": "Post-implementation reviews (PIRs) play a vital role in ensuring that regulations remain proportionate and effective. They support ministers in deciding whether measures should be retained, amended, repealed or replaced.  "
        },
        {
            "text": "They also help demonstrate that regulations support the government’s growth agenda and help to deliver HM Treasury’s Regulation Action Plan to reduce the administrative burden of regulation by 25%. "
        },
        {
            "text": "In April 2025, we published a league table of departments who were lagging on regulatory evaluation and secured commitments from eight departments to address their backlogs of overdue PIRs. In July we published an update on the progress by two departments against their commitments. "
        },
        {
            "text": "This blog provides an update on the latest position on the number of outstanding PIRs and the progress by the eight departments with the largest backlogs against the commitments that they made to reduce their backlogs. "
        },
        {
            "heading": 2,
            "text": "Outstanding PIRs by department "
        },
        {
            "text": "We are pleased that following our actions, the total number of overdue PIRs has fallen from over 80 in April to 47 today, including 4 PIRs that have newly become overdue. This represents a significant improvement.  "
        },
        {
            "text": "However, it still means that some regulations affecting businesses and society have not been properly checked to ensure they are meeting their objectives or whether they could be improved in some way.  "
        },
        {
            "text": "*Revisions to the data mean that the number of PIRs outstanding for the Department of Health & Social Care and Food Standards Agency is higher than reported in April."
        },
        {
            "heading": 2,
            "text": "Progress since April in clearing outstanding PIRs"
        },
        {
            "text": "A full list of outstanding PIRs across government is published on our website for transparency."
        },
        {
            "heading": 2,
            "text": "Departmental performance against their commitments"
        },
        {
            "heading": 3,
            "text": "Impressive progress:"
        },
        {
            "heading": 3,
            "text": "Moderate progress, but missing commitments:"
        },
        {
            "heading": 3,
            "text": "Limited or no progress - departments where we have significant concerns:"
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "I have written again to the permanent secretaries of the eight departments who I previously wrote to in April. I have updated them on their department’s performance and reminded them of the importance of making further progress in completing all PIRs. In some cases I have asked them to firm up on their previous commitments by specifying a date by which they will have fully completed all outstanding PIRs."
        },
        {
            "text": "We will continue to monitor and publish departmental performance on addressing the backlog of PIRs and delivering on their commitments. We expect to provide the next update in early 2026."
        },
        {
            "text": "We expect all departments to renew their commitments and confirm a clear timescale for delivering outstanding reviews. We hope to be able to report meaningful improvements in our next update."
        },
        {
            "text": "The RPC is here to help, but the action must come from departments."
        },
        {
            "text": "All departments should now:"
        },
        {
            "text": "✓ complete all outstanding PIRs"
        },
        {
            "text": "✓ check their pipeline of regulations approaching their review date"
        },
        {
            "text": "✓ block time out now to complete PIRs due in the next 12 months"
        },
        {
            "text": "✓ speak to their chief economist's office about evaluation planning"
        },
        {
            "heading": 3,
            "text": "Resources available:"
        },
        {
            "text": "Follow our blog via email for further updates."
        }
    ]
}