{
    "url": "https://civilservice.blog.gov.uk/2025/12/01/removing-over-7500-weapons-from-our-streets-started-with-sistening/",
    "title": "Removing over 7,500 Weapons from our streets started with sistening",
    "authors": [
        "Adam Mazrani"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-12-01T18:02:24+00:00",
    "content": [
        {
            "text": "How the Home Office's knife surrender scheme succeeded by putting stakeholders at the heart of the campaign, and what it means for mission-led government"
        },
        {
            "text": "I’m Adam Mazrani and I work in the External Affairs team in the Home Office Communications Directorate. Over the past year, I’ve led stakeholder engagement on the government’s mission to halve knife crime within 10 years."
        },
        {
            "text": "Last July, ahead of introducing Ronan’s Law, we ran the government’s largest knife surrender scheme, funding 37 new surrender bins across London, the West Midlands and Greater Manchester. The scale was ambitious. The challenge? Even bigger."
        },
        {
            "text": "The truth is that the government will always struggle to reach communities and individuals most likely to carry or come into contact with knives. Our stakeholder network, particularly the Coalition to Tackle Knife Crime comprising charities, victim support organisations, youth hubs, and tragically, the families and friends of knife crime victims, would need to bridge that gap."
        },
        {
            "text": "So we did something simple but powerful: we listened from day one. Before launch, I brought stakeholders together to stress-test our messages and creative assets. What would land in their communities? What might fall short? "
        },
        {
            "text": "Then we kept the conversation going. Each Monday without fail, I ensured the network received email updates on progress, and key successes with photos of surrendered knives. These weren’t courtesy emails. Stakeholders used that content in their own social posts, amplifying the message in ways we never could. "
        },
        {
            "text": "And when they told us what else they needed, we delivered. More bespoke social media assets. Physical posters for boxing gyms and supermarkets. Communication tailored to real places and real conversations. "
        },
        {
            "text": "I felt proud of how we drew on the stakeholders’ knowledge and passion through every stage. My biggest challenge was how we’d keep stakeholders engaged, as the month progressed and attention on the scheme ebbed and flowed with ever-changing priorities. How could we avoid upsetting them? How could we keep them updated, demonstrating that their work was making a difference?"
        },
        {
            "text": "By August, at least 7,000 weapons had been taken off our streets. "
        },
        {
            "text": "The numbers tell part of the story: over 100 posts from stakeholders across  X and Instagram alone. But what really matters is that we now have non-government voices, some embedded in traditionally sceptical communities, independently telling their audiences that government is listening, doing good work and helping save lives."
        },
        {
            "text": "One stakeholder said: “It’s really incredible to know that the Home Office worked so closely and collaboratively with community groups on this campaign.” In an often difficult media environment, that’s gold dust. "
        },
        {
            "text": "This campaign reinforced something fundamental: halving knife crime demands we work beyond Whitehall’s walls. This proved we can. The best ideas and authentic voices often come from outside Whitehall. Every weapon surrendered is a  life potentially saved. That’s what happens when we build relationships, show respect and listen."
        },
        {
            "text": "I’m incredibly proud of what we achieved together, and I hope teams across government never lose sight of what’s possible when we work this way."
        }
    ]
}