{
    "url": "https://thebluebeltprogramme.blog.gov.uk/blue-belt-overseas-territories-showcase-work-at-impac5/",
    "title": "Blue Belt Overseas Territories showcase work at IMPAC5",
    "authors": [
        "Sue Gregory"
    ],
    "categories": [
        "Blue Belt Programme",
        "Marine Protected Areas",
        "UK Overseas Territories"
    ],
    "pub_date": "2023-02-23T09:52:11+00:00",
    "content": [
        {
            "text": "In February 2023 I joined representatives from across the UK Government’s Blue Belt Programme who travelled to Vancouver, Canada, to participate in the 5th International Marine Protected Areas Congress (IMPAC5). The tone for the week was set by an opening ceremony filled with inspirational speakers alongside song, dance and stories from the Indigenous people of the Musqueam, Squamish and Tseil-Waututh Nations, on whose unceded lands we were meeting."
        },
        {
            "text": "The message was clear: the oceans are under threat and there are some big challenges ahead, especially for those of us who manage the marine environment, but with a recognition that much good work is already being done across our seas and not all hope is lost."
        },
        {
            "text": "Aiming to bring together around 4,000 ocean conservation professionals from around the globe, IMPAC5 provided a forum for sharing knowledge, successes and best practices, and allowed for an exchange of ideas among a diversity of views, expertise, opinions and experiences. The Blue Belt Programme was proudly represented by delegates from the UK Overseas Territories (UKOTs) of Ascension Island, Tristan da Cunha, Turks & Caicos Islands, St Helena, and South Georgia & the South Sandwich Islands, and together with colleagues from the Foreign, Commonwealth and Development Office (FCDO), Marine Management Organisation (MMO) and the Centre for Environment, Fisheries and Aquaculture Science (Cefas), we were able to promote the incredible work being done across the 4.3million km2 of ocean that the UKOT’s protect and sustainably manage."
        },
        {
            "text": "At a lively and well-attended session dedicated to the Blue Belt Programme, four UKOT representatives shared experiences of managing their maritime zones (with one audience member saying they were the best presentations he had seen all week!). During the presentations, we explored issues from how you approach managing a vast Marine Protected Area (MPA) with limited resource, to how you measure the effectiveness of an MPA over time."
        },
        {
            "text": "This was followed by an equally successful side event, co-hosted with the Atlantic Guardians. This event was an opportunity to focus on the Blue Belt’s sub-programmes, through highlighting Blue Belt’s Global Ocean Wildlife Analysis Network (GOWAN), and the ongoing large scale remote surveillance and monitoring of the UKOT’s marine environments and use of innovative technologies to prevent illegal activity. Colleagues at Tristan da Cunha then took us through the journey to designating their large-scale marine protection zone in 2020."
        },
        {
            "text": "Throughout the Congress we each took turns managing a stand in the exhibition hall, which gave an opportunity for more in depth one-to-one conversations about our work with a wide range of delegates. The stand also featured videos from each of the UKOT’s, as well as a Baited Remote Underwater Video System (BRUVS) which drew great interest. This knowledge sharing, and what we in turn learned from other participants, was a fundamental part of the IMAPC5 experience."
        },
        {
            "text": " "
        },
        {
            "text": "As small islands it is very easy for the UKOTs to operate in their own ‘bubble’, and so being able to engage with other MPA practitioners from around the world illustrated how our work sits within a wider global context. This ‘bigger picture’ highlighted to me just how special the Blue Belt Programme is, individually, each of our Territories are doing incredible work managing vast areas of ocean but combined, our strength and influence as possibly the largest network of MPAs on the planet should not be underestimated. Whilst IMPAC5 was underway it was announced that Anguilla would be joining the Blue Belt programme, and as our family of Blue Belt UKOT’s grows so does our ability to be global leaders in best practice. It was also fantastic to see the Pitcairn Islands receive a Blue Park platinum award during IMPAC5. This is the highest level of award that the Marine Conservation Institute presents to MPA’s in recognition of outstanding efforts to protect marine ecosystems."
        },
        {
            "text": "After five days of presentations and hearing examples of MPA management from across the world, it is clear that not all MPAs are equal, be that in size, function, stage of development, management or effectiveness. There is no ‘one size fits all’ and it is important that those differences are recognised and understood. The diversity of marine management across our UKOT’s embodies this, but I think there is still work to be done to share the message that vast ‘no-take zones’ are not the only way to protect the ocean, and that responsibly managed, sustainable use MPA’s can also be highly effective. Another take home message was that designating an MPA is just the beginning – sustained investment in research, monitoring, compliance and enforcement is needed to ensure conservation objectives are being achieved. With the recent global commitment made to protect 30% of our oceans by 2030, initiatives like the Blue Belt Programme and the support they provide is critical for the UKOT’s in helping to meet this goal."
        },
        {
            "text": "Blog by Sue Gregory, Marine Environment & Fisheries Manager at Government of South Georgia & The South Sandwich Islands, and Blue Belt Steering Group OT Representative"
        }
    ]
}