{
    "url": "https://deframedia.blog.gov.uk/2023/02/23/coverage-of-pfas-chemicals/",
    "title": "Coverage of PFAS chemicals",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Pollution",
        "water"
    ],
    "pub_date": "2023-02-23T14:28:54+00:00",
    "content": [
        {
            "text": "There has been coverage in The Guardian today on a mapping project which claims to have found elevated levels of Perfluoroalkyl and polyfluoroalkyl substances (PFAS) at 17,000 sites across the UK and Europe."
        },
        {
            "text": "Since the 2000s, we have taken action to increase monitoring and support a ban or highly restrict specific PFAS both domestically and internationally, including perfluorooctane sulfonate (PFOS) and perfluorooctanoic acid (PFOA)."
        },
        {
            "text": "PFAS – also known as ‘forever chemicals’ - represent a group of thousands of chemicals, with hundreds used commercially across many sectors of industry and society. There is increasing evidence of the occurrence of PFAS in the environment and, once in the environment, PFAS are extremely persistent. This means we will continue to detect them for many years, despite restrictions."
        },
        {
            "text": "There is also growing concern regarding the risks to human health. Through UK REACH, Defra asked the Environment Agency and the Health and Safety Executive (HSE) to examine the risks posed by PFAS and develop a 'Regulatory Management Options Analysis’, which will set out further options for managing the risks of PFAS chemicals. This is due to be published by the HSE in the spring."
        },
        {
            "text": "Whilst the coverage speculates on the impact of PFAS on drinking water, water companies are required to carry out regular risk assessments and sampling for PFAS to ensure the drinking water supply remains safe."
        },
        {
            "text": "Work is underway across government to help assess levels of PFAS occurring in the environment, their sources and potential risks to inform future policy and regulatory approaches. We are developing a cross-government Chemicals Strategy to frame the work we are doing across chemicals which will put us on a path for improved chemicals management. It will set out our priorities and principles for taking regulatory action to protect human health and the environment."
        },
        {
            "text": "A Defra group spokesperson said: "
        },
        {
            "text": "Call to action: Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}