{
    "url": "https://dragonsden.blog.gov.uk/2023/02/23/dragons-den-series-20-episode-8/",
    "title": "Dragons’ Den, Series 20 Episode 8",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-02-23T21:05:39+00:00",
    "content": [
        {
            "text": "Plants cleared from gardens, plant-based food delivered to homes, dog snout scanners and adaptive designer wear…another intriguing evening of investor-innovator suspense beckoned as I settled down to watch this week’s Dragons’ Den. Two of these in particular attracted my attention. "
        },
        {
            "heading": 2,
            "text": "Can Sally and James make a clean sweep? "
        },
        {
            "text": "Now, while I would class myself as a keen gardener, I like some tasks less than others. Gathering leaves and clippings for disposal can be hard on the back, and that’s speaking as a low-growing variety myself, at 5’3. "
        },
        {
            "text": "Landscape gardener of 20 years, James Coneron, felt the same, and together with his wife Sally, he has developed a hybrid garden rake and gatherer they’ve called the Clear ‘n’ Collect. I’d describe it as a pair of clam-like scoops mounted on sticks. Simple but brilliant!  "
        },
        {
            "text": "Sally asked for £50k in exchange for a 10% stake in their company. Their aim is to branch out and conquer the garden-clearance market across the world.  "
        },
        {
            "text": "This was a proven concept in the UK, Sally claimed. After trading for almost 2 years, they’ve sold 11,000 units: 50% through Amazon and the remainder through their website. Amazon rates them 4.5 and they even have an ‘excellent’ rating on Trustpilot."
        },
        {
            "text": "I was impressed and found myself exercising self-control not to place an immediate online order. Sally’s pitch was compelling, however. The Dragons seemed curious, too, with Peter Jones jumping up to try the new rake.  Deborah Meaden asked impishly if Peter actually collects his own leaves himself…"
        },
        {
            "text": "Touker Suleyman came up with the first question: do the couple have any intellectual property protection for their product? With no hesitation, James explained that it is a registered design in Europe and the UK and has patent pending status in Australia, Japan, Europe, UK, US and Canada."
        },
        {
            "heading": 3,
            "text": "Patiently awaiting their ‘patent pending’"
        },
        {
            "text": "So, what is ‘patent pending’ and how does it help Sally and James?"
        },
        {
            "text": "Patent pending describes a patent application that has been filed, but not yet granted. It signals to the public that the underlying invention may be protected and that any copying could infringe it."
        },
        {
            "heading": 3,
            "text": "Leafing through past patents – where to start?"
        },
        {
            "text": "Sally and James have obviously done a great job launching their product. But where did they begin? We recommend a spot of research to start with."
        },
        {
            "text": "There’s some great advice in our video, ‘Should I get a patent?’."
        },
        {
            "text": "Back in the Den, the Dragons were impressed by the product but there was a reluctance to commit. All agreed that public demand was well established but doubted whether the Clear ‘n’ Collect will make enough profit in the long run to repay investors. With Touker, Peter and Steven out, Deborah followed suit."
        },
        {
            "text": "Then it was Sara’s turn to comment, congratulating the green-fingered pair for growing their business this far. They’ve picked the perfect time to come into the Den, they’ve done the research and done the learning, she beamed..."
        },
        {
            "text": "Sara cleaned up, offering all of the money for 25% of the Clear ‘n’ Collect business, more than double the 10% equity that Sally and James had been wanting to give away. A quick ‘chat with the wall’ followed by further negotiation saw smiles blooming all round - Sara will invest £50k for 25%, dropping to a 20% share after she regains the sum invested."
        },
        {
            "text": "Hopefully we'll soon see Sally and James raking in those profits across the world!"
        },
        {
            "heading": 2,
            "text": "Doing it for everyone who’s ever felt hidden"
        },
        {
            "text": "I was incredibly impressed with the passion shown by clothing technician and fashion designer, Victoria Jenkins, for wanting to make life better for the 1 in 5 people in the UK who are disabled. Her brand, ‘Unhidden’, designs innovative clothing made of quality fabric. The clothing is designed to help people with physical challenges (think stoma bags, feeding tubes, catheters, wheelchair users) dress comfortably and practically, yet fashionably."
        },
        {
            "text": "The Dragons were hugely encouraging but felt that high production costs would hamper profits. Victoria was encouraged to think about changing her model to that of an expert adaptive clothing design agency instead, advising and designing for retailers worldwide."
        },
        {
            "text": "Peter made the point that many brands around world will be struggling with this. Victoria could help brands embrace adaptive design to enable representation and inclusion- a massive opportunity, Peter felt. The Unhidden brand could still remain operative as part of the agency offering."
        },
        {
            "text": "Clothing designers like Victoria can consider registering their designs. This would cover the appearance, the physical shape, the configuration and any decoration. The registration gives exclusive rights for up to 25 years. If someone were to copy or steal a design, this would make legal action more straightforward. Even if a designer chooses not to register their design, they may still have automatic unregistered rights."
        },
        {
            "text": "While Victoria left the Den without a deal today, there was plenty of praise and admiration for her concept from all the Dragons. I feel sure that Victoria, her expert advice and her brand won’t stay hidden for long."
        }
    ]
}