{
    "url": "https://marinedevelopments.blog.gov.uk/2023/02/23/mmo-supports-new-lyme-bay-fishermans-cic/",
    "title": "MMO supports new Lyme Bay Fisherman’s CIC",
    "authors": [
        "Amy Blackham, Communications & Engagement Manager"
    ],
    "categories": [
        "Coastal",
        "fisheries",
        "Grant funding"
    ],
    "pub_date": "2023-02-23T12:21:45+00:00",
    "content": [
        {
            "text": "A new community interest company, Lyme Bay Fisherman’s CIC, has recently been formed, supported by funding through the UK Fisheries and Seafood Scheme from Marine Management Organisation."
        },
        {
            "text": "This week, Fishing News has shared an article about the project where the CIC’s chief executive provides the background to the formation of the group, which she suggests could be a blueprint for other fishing communities. This blog captures the highlights of that article and includes information on contacting our grants team to help with future applications."
        },
        {
            "heading": 2,
            "text": "‘From talks to plans to grant applications’: A CIC created by fishermen, for fishermen"
        },
        {
            "heading": 3,
            "text": "Chief executive Mandy Wolfe explains how the CIC got off the ground"
        },
        {
            "text": "For most of my 20 years working in and around the fishing industry, small vessel representation has been the elephant in the room. From Defra to MMO, and the MCA to Seafish, but particularly across the sector, it has long been understood that large swathes of the inshore fleet have no meaningful representation."
        },
        {
            "text": "That is not to say there is none. Some producer organisations, and specialist organisations like the South Devon & Channel Shell fishermen, do a good job of representing all their members, but on the whole, thousands of owner-operators around the coast simply don’t belong to groups that offer them support, or someone to represent them."
        },
        {
            "text": "But I have, in recent years been encouraged that this gap in representation has been talked about more openly in ports and harbours and on social media. Government organisations are also actively trying to engage better with skippers and owners, with more coastal pop-ups during consultations and workstreams – but the industry must also play its part."
        },
        {
            "text": "For five years I had worked as the fisheries liaison to Lyme Bay for the Blue Marine Foundation. This put me in weekly contact with a lot of the fishermen across the four ports of Beer, Axmouth, Lyme Regis and West Bay. They gave up their time throughout,  and continue to fill my personal knowledge gaps."
        },
        {
            "text": "Time and time again I heard about things that were ‘happening to them’. Sometimes fishermen didn’t even know about changes before they happened, let alone engage in designing these policies when they were being developed."
        },
        {
            "text": "Frustration was commonplace. The pivotal moment for most of us came when senior Defra officials and their team came to visit for a couple of days in 2019. They told me they wanted face-to-face, no-holds-barred discussions, and my fishermen were up for the task! We met in backrooms of pubs and cafés in the ports, and the discussions were lively."
        },
        {
            "text": "But what planted the nugget was how much the officials got out of it. There were of course things they had heard before, but some individual experiences and issues that fishermen raised had not been cutting through to their level. I picked up from them how vital to good policy this type of information is, but it took a while to work out how we could achieve that on a permanent basis, to get those voices in the room heard by those taking decisions."
        },
        {
            "text": "Everyone thought it was a great idea to try to form a representative body from across the four ports, and find funding to help staff and advocate for the local fleets. We knew what was needed, but there wasn’t a template for doing it."
        },
        {
            "text": "Blue Marine Foundation was keen to help support the local fleets to set up their own organisation – by fishermen, for fishermen. We are grateful for its support in this journey, and for allowing me to work with the fishermen to help set this up."
        },
        {
            "text": "It was really important to me that this organisation was truly representative, and the fishermen felt the same way. Everyone knows how difficult it is to get more than three fishermen in a room at the same time, but when you can, the ideas flow and the passion for this industry is palpable."
        },
        {
            "text": "So this journey progressed through 2021, with lots of one-to-one conversations with fishermen on quaysides. All four ports have ad hoc fishing organisations, and they too sat and talked through what this new organisation might look like, and what its goals and aspirations should include."
        },
        {
            "text": "Chief executive Mandy Wolfe: “I strongly believe that this grassroots, bottom-up approach is vital to a successful fishing organisation.”"
        },
        {
            "text": "In January 2022, these amazing pathfinding fishermen convened a workshop to decide everything from the organisation’s name, to who would sit on the board. What ensued was a day of back and forth discussing structure, goals, and the routes to them, and the plan was hatched and honed."
        },
        {
            "text": "The day-long workshop resulted in a report that was circulated to all who attended for approval, and the real journey then began. From registering the CIC at Companies House to tax and VAT registration, opening bank accounts and preparing bids, it has been full steam ahead."
        },
        {
            "text": "The new CIC was awarded a grant at the end of 2022 to deliver the vision the fishermen have over the next two years, which will provide a full-time- equivalent employee to run the CIC, get it up and functioning, and begin a number of projects."
        },
        {
            "text": "For those who follow our path, some advice: put everything down on your lists, leave nothing off, and then work with MMO to create a successful bid."
        },
        {
            "text": "The ‘pivotal’ 2019 meeting between Defra and fishermen that triggered the idea of creating a canopy group representing the four ports."
        },
        {
            "text": "Their grants team is there to help and advise, and while not everything we asked for was funded, we then understood why some aspects weren’t, and we discovered things we hadn’t thought of that could be."
        },
        {
            "text": "I strongly believe that this grassroots, bottom-up approach is vital to a successful fishing organisation, but I fully understand that this may be a daunting task for fishermen around the coast to get off the ground. We hope that our new CIC can secure funding to share the experiences and create a how-to guide for others who want to follow the path we took."
        },
        {
            "text": "This was a steep learning curve for us. None of us had set up a CIC or used FaSS for this type of project before – even opening bank accounts for a CIC is not as simple as you might think! So we want to share all our documents, from the workshop agenda and output report through to the details of our FaSS bid, so that others can literally cut and paste the things they like and want to do, and not have to go through the hard yards we did."
        },
        {
            "text": "This co-operative and collaborative working across the small-scale fleet around our coasts is more important now than ever, and anyone who knows our fishermen will not be surprised that they are eager to help others, where possible, to do the same."
        },
        {
            "text": "Creating a CIC is not going to magically make the problems facing the fishermen of Lyme Bay disappear. It will, however, help to ensure that their voices are heard by fisheries managers of all types, and that this is reflected in future policies."
        },
        {
            "text": "It’s my absolute honour to serve the fishermen of Lyme Bay as their first chief executive, and I could not be prouder of their individual and collective efforts to get us to this point. So my final but most personal and hugest thank you is to them – the fishermen who kept the faith, put in the time, and made all of this possible."
        },
        {
            "text": "Since launching in April 2021, the £30m Fisheries and Seafood Scheme (FaSS) has already awarded over £19m to almost 1,000 projects supporting seafood and maritime businesses."
        },
        {
            "text": "The MMO-led grant scheme provides funding to support food producers across the catching, processing and aquaculture sectors in England. Through project applications from seafood and marine businesses, charities and other organisations, FaSS has enabled health and safety improvements, developments in the processing and marketing of seafood products, business diversification, and port and harbour improvements."
        },
        {
            "text": "FaSS can also support the industry by funding projects focused on conservation and restoration of the marine environment, supporting national ambitions to achieve net zero through reducing emissions, and –as in the case of the Lyme Bay Fisherman’s CIC – supporting co-operative activities."
        },
        {
            "text": "Michelle Willis, MMO’s Director of Finance and Resources, said: “Our successful grants programme, FaSS, helps projects with real potential to boost business resilience and increase sustainability across our world-class fishing industry."
        },
        {
            "text": "“The Lyme Bay Fisherman’s CIC project is great example of how FaSS can support groups of fishers to co-ordinate their efforts, share best practice and ensure they maximise opportunities through funding, research and networking."
        },
        {
            "text": "“I wish them every success in achieving their goals and aspirations.”"
        },
        {
            "text": "The scheme is open throughout the year for applications. Projects costing £150,000 or more are considered by a panel. There are two remaining panels for 2023, with submissions due by 31 May and 30 September."
        },
        {
            "text": "The MMO dedicated grants team is there to help the fishing industry understand its options, discuss potential project ideas and assist applicants through the process. It is also looking to set up roadshows to promote the scheme."
        },
        {
            "text": "For more information, contact the MMO grants team by calling: 0208 026 5539 or emailing: FaSS.queries@marinemanagement.org.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}