{
    "url": "https://buyingforschools.blog.gov.uk/2023/02/23/my-experience-of-buying-transport-using-get-help-buying-for-schools/",
    "title": "My experience of buying transport using Get help buying for schools",
    "authors": [
        "Emma Foulkes, Chief Finance Officer, Holy Family of Nazareth Catholic Academy Trust"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-02-23T13:36:51+00:00",
    "content": [
        {
            "text": "Emma Foulkes is Chief Finance Officer for the Holy Family of Nazareth Catholic Academy Trust in the North West. Emma recently used the Get help buying for schools service to buy transport for one of the schools in the trust - All Hallows Catholic College. All Hallows is a larger than average secondary academy with a sixth form."
        },
        {
            "text": "In this blog post, Emma shares her experience of using Get help buying for schools and how it could help you with your buying too."
        },
        {
            "text": "Because All Hallows Catholic College is a faith school it has a very wide catchment area, which means it is not usually the most local school for many of our students. We run eight different bus routes to ensure all students who need to travel by bus can do so."
        },
        {
            "text": "I had two main two reasons for requesting support. First and foremost was compliance, particularly for a contract of this value. I wanted to be sure I was doing everything right. The second reason was to get access to a broader base of potential suppliers. A previous unsuccessful tender had already highlighted a lack of suppliers in my area that could deliver a service across such a wide catchment, and this was a problem for me."
        },
        {
            "text": "After being referred to the Get help buying for schools service, the team set up an initial conversation to introduce themselves and answer all my questions. This meeting proved to be an excellent sounding board for me. For example, I was considering running a different lot for each bus route but after our discussion, I decided it would be simpler to have a single supplier with one central contact point and flexibility between routes for split families. It would also remove the risk of potentially losing a route at a future date."
        },
        {
            "text": "The Get help buying for schools team kept the momentum going and were proactive in prompting me at every stage of the process. I drafted the initial specification and the team sense checked this for me, suggesting a few areas to tighten up on."
        },
        {
            "text": "They put the tender live for me and managed the QA process, answering any queries on my behalf. It was so helpful to know that I could contact them anytime with any queries I had."
        },
        {
            "text": "In advance of the bids being submitted, the Get help buying for schools team led a fantastic preparation session on how to evaluate our bids correctly so that we had a clear and transparent record, with a solid rationale behind all our answers and scores."
        },
        {
            "text": "When the bids were in and it was time to evaluate, the team were on hand to support me, prompting me for more information and evidence to support my responses where required and looking across the piece to ensure consistency. They also unpicked the technical details around pricing so that I was clear about what we were getting for our money from each supplier."
        },
        {
            "text": "The successful bidder was awarded the contract in July 2022 and the new supplier was up and running ready for the start of term in September 2022."
        },
        {
            "text": "I was so happy with the outcome of the tender. I found the service to be super helpful and clear. It gave me the reassurance I needed on compliant buying, plus access to a much broader base of suppliers than I would have otherwise had. I estimate that we will make savings of around £42,000 over the life of the 5-year contract, savings that will ultimately benefit our pupils."
        },
        {
            "text": "I will definitely use the Get help buying for schools service again. In fact, I am already in contact with them about my next tender, which will be school catering."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        },
        {
            "text": " "
        }
    ]
}