{
    "url": "https://ssac.blog.gov.uk/2023/02/23/thinking-about-joining-ssac-my-thoughts-on-why-you-should-get-stuck-in/",
    "title": "Thinking about joining SSAC? My thoughts on why you should get stuck in!",
    "authors": [
        "Dom Morris"
    ],
    "categories": [
        "About the Committee",
        "Consultation",
        "Disabled People",
        "DWP",
        "HMRC",
        "Legislation",
        "Public Sector",
        "social security",
        "SSAC Independent Work Programme",
        "SSAC Occasional Papers",
        "Stakeholders"
    ],
    "pub_date": "2023-02-23T17:31:54+00:00",
    "content": [
        {
            "text": "I wasn’t a 'Whitehall Warrior' and so thought I didn’t have a chance of being selected when I applied to become a member of the Social Security Advisory Committee (SSAC)! But it turned out they welcome and encourage a breadth of people, backgrounds and experience – it is the only way to build a team that is as comfortable in the depths of regulation scrutiny as it is comfortable talking to a benefits claimant as it is advising Secretary of State!"
        },
        {
            "text": "Far from being a Whitehall wonk, I’d first experienced our welfare state and social security system working alongside youngsters in rural areas of deprivation in the West Country. Spending time with people who bumped into the system every day showed me the granular side of our system and ignited a passion for making it better. Forced to leave the RAF due to chronic pain and an invisible disability, I spent several years working for organisations like the Prince’s Trust. Day in, day out, alongside young people who were formidably literate at navigating our then overwhelmingly complex system was an eye opener. It showed me both the best and worst bits about our social security system."
        },
        {
            "text": "SSAC gave me the opportunity to voice these challenges and opportunities in an environment where group think was actively discouraged in favour of a tremendous breadth of deep technical knowledge, experience and opinions which were embraced. And what a Committee it was."
        },
        {
            "text": "Whether scrutinising the deepest depths of social security regulations, advising a Secretary of State or talking with claimants in a Jobcentre (sometimes all in one day!), the Committee behaved the same. The breadth of membership, from academics specialising in legislation to leaders in the charity sector and strategic thinking makes SSAC an incredibly stimulating and enjoyable atmosphere within which to work."
        },
        {
            "text": "Every committee brings a different set of skills and experience to the table. This is reflected in the sheer quality and depth of the debate around the table when the Committee reviews new policies, legislation or DWP programmes. I have rarely been around a table where people are so knowledgeable in their fields, and the quality of discussion is so high, the outcomes clear and the atmosphere so enjoyable."
        },
        {
            "text": "There is also a larger amount of freedom on SSAC to pursue strategic interests and issues than I would have ever imagined. We were actively encouraged to identify strategic issues. Each and every member is free to contribute to the agenda and to pursue issues and opportunities with the full might of the fab SSAC ‘machine’ – this often meant the combined horsepower of the Committee, the secretariat, Ministers, officials, and a wide range of stakeholders including charities and the public! If we wished to go into even more detail on issues, SSAC’s more substantive analysis and advice can be found in our proactive reports which I believe provide leading deep dives on emerging issues. It is with these reports that SSAC leads the pack."
        },
        {
            "text": "Amidst a Whitehall that can tend towards stovepipes, SSAC is one of the few organisations that approaches challenges and opportunities from a systems perspective. Being part of a team, taking an overarching, strategic view of the social security system is a tremendous privilege, and I would encourage anyone thinking about it to get stuck in!"
        },
        {
            "text": "NOTE: The Department for Work and Pensions is seeking to appoint five new members to the Social Security Advisory Committee.  If you are interested in providing impartial, credible, evidence-based advice to the Secretary of State for Work and Pensions, and have the necessary skills and experience, find out how to apply here.  Closing date for applications is 10 March."
        }
    ]
}