{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/07/19/engineering-the-perfect-summer-for-your-stem-development/",
    "title": "Engineering the perfect Summer for your STEM development",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Engineering",
        "Learning & Development",
        "Science"
    ],
    "pub_date": "2024-07-19T12:17:00+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Summer learning for GSE members "
        },
        {
            "text": "The GSE Awareness courses have been refreshed and support the ambition to increase scientific literacy across government and help deliver on the GCSA's aim for a more scientific civil service. Check out the changes made to the courses in the GSE blog, Enhancing Science and Engineering Capability: A Year of the GSE Awareness Courses. "
        },
        {
            "text": "The two courses available online are:   "
        },
        {
            "text": "Understanding and Accessing Science and Engineering Advice; this course empowers all civil, crown and public servants in using science and engineering evidence and advice in their work, where this evidence and advice can be accessed, and explains how it will benefit their work. "
        },
        {
            "text": "Communicating Science and Engineering Advice; this course supports those in technical roles to effectively communicate science and engineering evidence and advice to various audiences.     "
        },
        {
            "text": "The courses are delivered in an interactive, online format and feature testimonies from the Government Chief Science Adviser, Professor Dame Angela McLean and the Head of the Policy Profession, Tamara Finkelstein, alongside other colleagues from across government.   "
        },
        {
            "text": "These courses provide a solid overview of science and engineering within government and will help you better communicate scientific concepts. "
        },
        {
            "heading": 3,
            "text": "Upcoming learning and development  "
        },
        {
            "text": "How to use AI to help your work in government \nThe ‘How to use AI in Government’ masterclass will show you how AI can streamline your daily tasks, making your work more efficient. Join industry experts in AI applications as they share practical strategies and real-world examples to help you integrate AI into your workflow seamlessly. Register to attend the masterclass.  "
        },
        {
            "text": "Career conversations\nApplications for the Career Conversations Workshop are now open. This two-hour virtual workshop provides a brief introduction into what you need to do as a manager to support your team members to progress their career. The course will provide tools and models for use in career conversations and an understanding of how the profession can help, giving you the opportunity to develop techniques and learn top tips for holding effective career conversations. Places for the Career Conversation Workshop are limited - complete the Career Conversations Workshop Form to apply.  "
        },
        {
            "text": "GSE Conference \nThe Biennial Government Science and Engineering (GSE) Conference is taking place on Wednesday 18 September 2024 at the Science Museum Exhibition Road, South Kensington, London, SW7 2DD. In-person tickets are limited, to attend, please register to join the waiting list. The event is hybrid so will be available to join online if you cannot attend in person. "
        },
        {
            "heading": 3,
            "text": "Suggested Summer STEM activities "
        },
        {
            "text": "Do you have curious minds at home who want to learn more about the world? Check out the resources below which are not only educational but fun! Remember to share your summer STEM stories with the GSE Profession by contacting us.  "
        }
    ]
}