{
    "url": "https://environmentagency.blog.gov.uk/2024/07/19/flood-coast-excellence-awards-2024-celebrating-innovation-and-collaboration/",
    "title": "Flood & Coast Excellence Awards 2024: Celebrating Innovation and Collaboration",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Flood"
    ],
    "pub_date": "2024-07-19T13:00:12+00:00",
    "content": [
        {
            "text": "This week, the Environment Agency hosted the Flood and Coast Excellence Awards. These celebrate some of the most innovative and impactful flood and coastal erosion risk management projects from across the country writes Caroline Douglass, Environment Agency Executive Director of Flood and Coastal Risk Management."
        },
        {
            "text": "It is a pleasure to reflect on the remarkable ingenuity and commitment of the nominees and winners to improving climate resilience, sustainability, and nature recovery."
        },
        {
            "text": "Over 90 nominations were put forward for this year’s awards, each showcasing innovative approaches to climate resilience. The judges and I were impressed by the people getting involved in community-driven projects and collaborations across sectors. It was also fantastic to see several nominees and winners from projects under the Flood and Coastal Resilience Innovation Programme (FCRIP)."
        },
        {
            "text": "Amongst the key themes of this year’s winners are nature-based solutions, a focus on the development in community engagement, and surface water risk management, an area where the Environment Agency is committed to leaning in more to support others to plan and adapt to surface water flood risks."
        },
        {
            "text": "The winners of each of the seven categories are:"
        },
        {
            "text": "Winner: Sustainable Drainage Systems (SuDs) for Schools, Department for Education Schools Commercial Team - The DfE Schools Water Strategy is an invest to save project aiming to reduce surface water flooding for schools across England."
        },
        {
            "text": "Winner: Mansfield Sustainable Flood Resilience (Phase 1), Arup - The largest sustainable drainage retrofit programme in the UK creating a number of nature-based solutions."
        },
        {
            "text": "Winner: Southsea Coastal Scheme (Frontage 1), Coastal Partners on behalf of Portsmouth City Council - The first phase of an innovative coastal management project and the largest local authority led scheme to help reduce coastal erosion."
        },
        {
            "text": "Winner: Nottinghamshire County Council Community Flood Signage Scheme - A resilience scheme that promotes road safety during times of flooding by training members of the community to become Flood Signage Wardens. It currently has over 180 wardens active in 15 areas across Nottinghamshire."
        },
        {
            "text": "Winner: Resilience and Innovation Northants (RAIN), West Northamptonshire Council – An innovative approach to delivering proactive, engaging flood resilience measures to the community. This project is one of the 25 initiatives under the Flood and Coastal Innovation Resilience Programme."
        },
        {
            "text": "Winner: Pioneering Flood Warning Expansion Project, Environment Agency\n- The Flood Warning service provides 78,000 properties at risk of flooding with access to warnings, thanks to new innovative monitoring solutions."
        },
        {
            "text": "Winner: Anna Hastings, East Sussex County Council – Anna innovates through collaboration and seeks innovative solutions that drive positive change. She has also been instrumental in delivering the Blue Heart project, which focuses on property resilience measures, surface water risk solutions, and engaging young people in flood resilience. The project is part of the Flood and Coastal Innovation Resilience Programme."
        },
        {
            "text": "The Environment Agency champions and celebrates projects like these that inspire us, share vital learning, and prioritise partnerships and collaboration, community involvement, sustainability, and forward-thinking solutions."
        },
        {
            "text": "I want to thank all participants, nominees, judges, and winners for their exceptional contributions. Your work is not only safeguarding our present but also shaping a safer, more resilient future. Together, we are creating better and more resilient places for everyone."
        }
    ]
}