{
    "url": "https://environmentagency.blog.gov.uk/2024/07/19/how-grass-cutting-on-flood-defences-reduces-the-risk-of-flooding/",
    "title": "How grass cutting on flood defences reduces the risk of flooding",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2024-07-19T08:01:02+00:00",
    "content": [
        {
            "text": "Abigail Ovenden, Asset Management Engagement Advisor in Lincolnshire and Northamptonshire, talks about how important it is to cut grass on flood defences and why such work is done."
        },
        {
            "text": "You may have seen our Environment Agency teams and contractors out cutting grass on the thousands of kilometres of banks that serve as flood defences. This includes the banks of Main Rivers such as the Nene, Welland, Witham and Ancholme. These banks are man-made and help reduce the risk of flooding to people and property."
        },
        {
            "text": "Embankments need regular maintenance. The Environment Agency bids for public funding every year to carry out this maintenance. Other watercourses (dykes/streams) are still important to local flood risk but are likely to be owned by the landowner who is responsible for its maintenance and conveyance."
        },
        {
            "text": "How do we cut the grass? "
        },
        {
            "text": "Grass cutting is carried out by using either a mechanical plant fitted with a flail, by hand or by remote controlled mowers where slopes are steep or unsuitable for larger plant."
        },
        {
            "text": "Why do we cut grass at certain times of year? "
        },
        {
            "text": "It is essential that flood defence embankments (coastal or river) are kept in good condition and so are mown regularly throughout the grass growing season."
        },
        {
            "text": "On embankments where we only mow the top of the slopes, we mow when plant growth is vigorous, this encourages nesting birds to make their nests lower down the embankment slopes in the longer vegetation, away from machinery."
        },
        {
            "text": "Why do we cut the grass? "
        },
        {
            "text": "Research has shown that regular close mowing (5-10cm) of grass improves the strength of the root network and erosion resistance of the grass. It also helps to protect the earth embankment underneath from external erosion caused by rainfall, wind, currents, wave action and traffic."
        },
        {
            "text": "Regular cutting also prevents broad leafed plants and woody vegetation from getting established. Such vegetation can damage the embankment beneath by root penetration, overturning, encouraging burrowing animals, discouraging adequate grass growth and concentrating flows which then cause scour."
        },
        {
            "text": "Shorter vegetation helps our teams monitor and inspect our defences, which we do regularly (six monthly, annually or every other year) to identify any signs of damage."
        },
        {
            "text": "How have we adapted our work to support biodiversity and wildflowers? "
        },
        {
            "text": "We have a team of biodiversity experts whose role it is to advise and help us adapt our maintenance work to support biodiversity where possible. For example, on appropriate embankments (where the impacts of flood risk are lower) we will only mow along the crest (top) of the embankment and a swathe (the width of the grass cutting head) at the top of the slopes. This is to ensure the crest edge is defined to provide safe access for driving machines.  The long vegetation that is left lower down the embankment slopes is cut later in the year, therefore allowing for most plants to flower (providing nectar for pollinators) and to set seed; as well as providing cover and food sources for other animals, including water voles."
        },
        {
            "text": "What checks do we put in place for nesting birds? "
        },
        {
            "text": "Some of our grass cutting and maintenance does need to be carried out during nesting bird season. Nesting birds are legally protected, and so we apply stringent environmental checks before any work is carried out. This includes working with our internal biodiversity experts and carrying out walkovers before cutting begins, ensuring nests are not damaged."
        },
        {
            "text": "If the grass is long, before mowing it, during the bird breeding season (1st April- 7th August) the machine operator will walk over the site to try and identify any nesting birds or other habitat or hazards. Our staff are diligent and will stop work if they see something of interest to get further advice."
        },
        {
            "text": "If a nesting bird is found, our machine operators will leave a 10-metre perimeter on either side of the nesting area, so as not to disturb the nest."
        },
        {
            "text": "Who can I contact for more information? "
        },
        {
            "text": "If you would like further information on maintenance, please get in touch using the contact details below:"
        },
        {
            "text": "Post - National Customer Contact Centre PO Box 544 Rotherham S60 1BY United Kingdom"
        },
        {
            "text": "Email - LNenquiries@environment-agency.gov.uk"
        },
        {
            "text": "Telephone - 03708 506 506 (Monday to Friday, 8am-6pm)"
        },
        {
            "text": "Incident Hotline - 0800 80 70 60 - to report flooding, blockages, pollution, unusual changes in flow of water, collapsed or badly damaged defences (24-hour service)."
        }
    ]
}