{
    "url": "https://ruralpayments.blog.gov.uk/2024/07/19/rpa-agency-management-board-visit-to-bearwardcote-farm/",
    "title": "RPA Agency Management Board visit to Bearwardcote Farm",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2024-07-19T13:31:33+01:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants and rural payments to farmers and businesses. In this blog, Robert from the Grants Service team writes about RPA’s Agency Management Board visit to Bearwardcote Farm in Derbyshire talking to the farmers about their experience of applying for grant funding under the Farm Productivity grant."
        },
        {
            "text": "Members of RPA’s Agency Management Board (AMB) were able to see first-hand how RPA’s grants benefit the farming community, when they spent a day with father and son farmers Andrew and David, who are both passionate about a long-term future in the dairy sector. The predominantly dairy farm has over 200 dairy cows and grows 100 acres of arable, as well as keeping around 60 beef animals."
        },
        {
            "text": "AMB members Elizabeth Passey, Tim Breitmeyer, Mark Suthern and Paul Dillon-Robinson were joined by RPA’s Chief Executive Paul Caldwell, Customer Director Marie Hardeman and Executive Finance Director Jessie Peramal on the visit."
        },
        {
            "text": "They were given a tour of the farm by Andrew and David, who told them about the support they’ve received from RPA and the Sustainable Farming Incentive (SFI). The farm has benefitted from an Improving Farm Productivity grant which they have used to upgrade and update their milking equipment with four brand new Lely Astronaut robotic milking machines."
        },
        {
            "text": "Before the grant was awarded, up to nine hours a day were spent in the parlour. The robotic milkers have helped the cows reach their full potential by being milked more frequently. This will help to improve the technical performance of the dairy herd, and improve animal health and welfare, refining both the productivity and efficiency of the business."
        },
        {
            "text": "Andrew told the AMB how the machinery freed up a lot of their time so they could carry out other tasks on the farm, allowing them to dedicate extra time and focus on other areas of the business. He said they’d found the process of applying “thorough” but ultimately easy to complete with a collaborative family effort. Both Andrew and David had praise for the helpful RPA Grants Service staff, as well as the quick and efficient process for receiving their funding once their claims had been submitted."
        },
        {
            "text": "Members of the AMB also got a hands-on show of the grant-funded equipment – with all the new machines named after family members! The AMB took some time to solicit feedback from David and Andrew on the process of applying for grants and will be exploring with relevant teams in RPA how the process can be made even simpler for applicants."
        },
        {
            "text": "Andrew also encouraged other farmers to apply for available grants and said the Farming Transformation Fund was well named as it had been “totally transformational” for the way the family now farms. He also plans to utilise other grants available through RPA, such as the Slurry Infrastructure Grant to assist with the cost of upgrading their facilities."
        },
        {
            "text": "David told members of AMB about SFI and how they’d applied for funding for the processes they were already doing on the farm. Both David and Andrew agreed that the scheme had been improved since its inception and were looking forward to any future changes."
        },
        {
            "text": "Whilst there was a lot to discuss, Andrew and David took the time to speak to all AMB members about their questions, with customer director Marie Hardeman and chief executive Paul Caldwell being particularly interested in how the RPA promotes the schemes, and the customer experience."
        },
        {
            "text": "Everyone had a great afternoon at the farm and RPA would like to thank David and Andrew for giving up their valuable time."
        },
        {
            "text": "Please visit our Funding for farmers page on GOV.UK which sets out every payment on offer, with links to learn more."
        }
    ]
}