{
    "url": "https://environmentagency.blog.gov.uk/2024/07/19/understanding-algal-blooms-in-the-river-wye/",
    "title": "Understanding algal blooms in the River Wye",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Rivers",
        "Water"
    ],
    "pub_date": "2024-07-19T09:26:53+00:00",
    "content": [
        {
            "text": "My name is Jason Doe and I’m a freshwater ecologist in the Environment Agency. I have been surveying algae in the River Wye for several years and find the interactions between aquatic life and its environment fascinating. Plants and invertebrates can tell us a great deal about the health of the environment."
        },
        {
            "text": "During the warm summer months, there’s an increase in the number of reports about rivers looking like pea soup, foul smells and oily substances floating on water surfaces. It’s easy to understand why so many people might be concerned."
        },
        {
            "text": "We are aware of changes to the vegetation in the Wye catchment. These changes are complex, and whilst there are issues with nutrient pollution in parts of the catchment, monitoring suggests that high summer river temperatures and possibly increased frequency and severity of winter floods are changing the vegetation structure in the Wye. Less perennial plant cover, including water crowfoot, potentially provides good conditions for fast growing opportunistic algae to occur."
        },
        {
            "text": "Data gathered through monitoring helps us to make decisions and prioritise our resources in areas likely to have the most beneficial impact. This data is also key to understanding what's happening in the environment, helping us to answer questions like are nutrients the main culprits in causing algal blooms?"
        },
        {
            "text": "Annually we gather our monitoring data to produce our Integrated Report and share our findings. This is the exciting part, which enables us to better understand conditions in the Wye. We can also compare monitoring data year on year to identify any trends. Recently we looked at the different conditions during 2022 and 2023."
        },
        {
            "text": "The question is then, to what extent does changing weather patterns have an impact on the water environment and ecology? More evidence is needed but evidence is growing that indicates climate change is likely to have a big impact in the years to come."
        },
        {
            "text": "What are Algae?"
        },
        {
            "text": "Algae are plant-like organisms that grow naturally in rivers, streams and lakes, and can also be found in coastal waters.  During periods of warm, settled, dry weather conditions are ideal for growth and algae can proliferate, leading to algal blooms. In the Wye two types of reported bloom occur:"
        },
        {
            "text": "Free-floating (planktonic) blooms, which are caused by single-celled (can be colonial), usually microscopic algae and cyanobacteria (e.g., A.)."
        },
        {
            "text": "Filamentous algal blooms on the riverbed, which are formed by multi-cellular algae, which can smother stones and submerged plants (e.g., B.)"
        },
        {
            "text": "Diatoms are a type of single-celled algae that have intricate silica shells called frustules. Some species are free-floating, but most freshwater species are attached to hard surfaces like stones or plants. The colonial diatom Melosira forms slimy brown growths that can smother the riverbed and submerged plants, especially in the spring and during warm weather."
        },
        {
            "text": "Risks to human and animal health from contact, ingestion or inhalation of algae that currently occur in UK waters are low. Generally, algae and algal blooms in the Wye are safe, and so far, our monitoring hasn’t found any evidence of toxic blooms occurring, but this is not always the case for other waterways. When blooms are reported to us, we take samples of the water to confirm if the algae are toxic or not and if a toxic bloom is identified, the relevant local authority or landowner will post warning signs."
        },
        {
            "text": "Our algae monitoring work is continuing in the Wye, although high river levels in the spring of 2024 have hindered our progress. We’ve recently acquired new equipment that measures algal biomass and we’ll be adding it to our survey methods in 2024. The ability to measure biomass, in addition to cover estimates should help to improve our understanding about algae and environmental interactions in the River Wye."
        },
        {
            "text": "You can’t tell if an algal bloom is toxic just by looking at it, so it’s safest to assume it is. Keep pets and children away from the water and avoid skin contact with the water or algae. Report it to our hotline 24/7 on 0800 80 70 60."
        },
        {
            "text": "Find out more about what is happening in the Wye catchment by visiting our River Wye HQ page at River Wye Water Quality | Engage Environment Agency (engagementhq.com) or by scanning the QR code below."
        },
        {
            "text": " "
        }
    ]
}