{
    "url": "https://deframedia.blog.gov.uk/2025/01/10/coverage-following-the-secretary-of-states-speech-to-the-oxford-farming-conference-2025/",
    "title": "Coverage following the Secretary of State’s speech to the Oxford Farming Conference 2025.",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2025-01-10T15:18:24+00:00",
    "content": [
        {
            "text": "The Secretary of State Steve Reed addressed the Oxford Farming Conference on Wednesday (9 January) to outline the Government’s long-term vision to make farming more profitable and put more money back in the pockets of British farmers."
        },
        {
            "text": "The speech was widely covered by live broadcasters and national media organisations The Guardian, The Telegraph and Sky News as well as trade media organisations Farmers Weekly, Farmers Guide, Fresh Produce Journal, Farmers Guardian and ENDS Report."
        },
        {
            "text": "An interview with BBC’s Farming Today followed the speech and the programme included a summary of the speech with reaction from farmers in attendance."
        },
        {
            "text": "The Secretary of State spoke about how the Government will work with farmers to deliver a profitable farming sector and unlock rural growth. This will include a cast iron commitment to food security while introducing reforms to help farmers diversify their income streams to support them during poor harvests.  "
        },
        {
            "text": "His speech included key announcements backing British produce, using planning reforms to support food production and making it easier for farmers to connect to the energy grid."
        },
        {
            "text": "In addition, the Secretary of State announced support to boost farmer-led, small-scale innovation to boost food productivity and sustainability through the Accelerating Development of Practices and Technologies (ADOPT) grant programme."
        },
        {
            "text": "Steve Reed, Secretary of State for Environment, Food and Rural Affairs, said:"
        },
        {
            "text": " You can read the Secretary of State’s full speech from the Oxford Farming Conference here."
        }
    ]
}