{
    "url": "https://mhclgmedia.blog.gov.uk/2025/01/10/deputy-prime-minister-promises-to-make-work-pay-in-scotland/",
    "title": "Deputy Prime Minister promises to Make Work Pay in Scotland  ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2025-01-10T13:31:48+00:00",
    "content": [
        {
            "text": "Scottish media outlets including The Scotsman, The National, the Daily Record and Glasgow Times have all positively reported on the Deputy Prime Minister’s visit to Glasgow yesterday (09/01/25), where she pledged her commitment to making work pay in Scotland through the UK Government’s flagship Employment Rights Bill - the biggest upgrade to workers’ rights in a generation."
        },
        {
            "text": "The Deputy Prime Minister heard from Glasgow employer, McAllister Litho – a company already leading the way with strong workers’ rights like guaranteed hours and flexible working, creating a happier and more satisfied workforce. These are protections that workers all over the UK including Scotland will benefit from, thanks to the Employment Rights Bill."
        },
        {
            "text": "The Bill will tackle insecure work through strong action to make work pay, with new laws coming in to ensure Statutory Sick Pay is paid from day one of illness and introducing guaranteed hours and compensation for lost income so those working irregular patterns are not short-changed by last-minute shift changes or cancellations."
        },
        {
            "text": "As The Independent highlights, the percentage of workers on zero hours contracts in Scotland has more than doubled since 2013. The Bill’s reforms will step in to protect these workers’ incomes, with around 100,000 people in Scotland on zero hours contracts expected to benefit."
        },
        {
            "text": "Articles also highlight the record pay boosts to the national minimum and living wages which will benefit workers in Scotland. From April 2025, the National Living Wage will pay eligible full-time workers £1,400 more a year, while 18 to 20-year-olds on the National Minimum Wage will get a record rise of £2,500."
        },
        {
            "text": "The Deputy Prime Minister will work with the Scottish Government, trade unions and employers to ensure Scotland benefits from the UK-wide Employment Rights Bill, as it progresses through parliament."
        },
        {
            "text": "Deputy Prime Minister, Angela Rayner said:  "
        },
        {
            "text": "“This is a government on the side of Scottish workers. Our landmark plan to Make Work Pay has already delivered one of the biggest pay boosts on record – and it is working people in Scotland who will benefit the most.”"
        },
        {
            "text": "\"Our Employment Rights Bill will make work pay in Scotland and tackle the insecurity, inequality and low pay that have held back workers and businesses for too long.  "
        },
        {
            "text": "\"We know there is business appetite to get going with our reforms and create a more modern, healthier and productive workforce – with businesses like McAllister Litho already leading the way.”  "
        }
    ]
}