{
    "url": "https://naturalengland.blog.gov.uk/2025/01/10/maximising-the-miracle-and-minimising-the-disaster-putting-nature-at-the-heart-of-food-security/",
    "title": "Maximising the miracle and minimising the disaster – putting Nature at the heart of food security",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Farming",
        "Natural Capital",
        "Natural England",
        "Nature Recovery"
    ],
    "pub_date": "2025-01-10T11:13:15+00:00",
    "content": [
        {
            "text": "I was invited to speak at a historic event this week – the first major joint gathering of attendees at the two Oxford farming conferences: the Oxford Farming Conference and the Oxford Real Farming Conference. After more than a decade of ploughing their separate furrows, about 200 attendees from the two meetings joined together in what was a highly symbolic rapprochement, at a joint dinner hosted at Somerville College by the Food, Farming and Countryside Commission*."
        },
        {
            "text": "The fact of this dinner taking place highlighted to me the changing direction of travel in farming, moving away from a discussion that has become polarised between advocates of regenerative farming on one side and industrial agriculture on the other, and towards a unifying theme whereby Nature is quite correctly seen as the bedrock of food security – a theme that came through strongly in Environment Secretary Steve Reed’s speech at Oxford."
        },
        {
            "text": "In this blog I’d like to touch on some of the points I made in my speech."
        },
        {
            "text": "Our food system"
        },
        {
            "text": "I began by reflecting on a comment made by Henry Dimbleby, the author of the 2021 National Food Strategy, who observed how our food system is simultaneously both a miracle and a disaster."
        },
        {
            "text": "During the 1960s and 1970s, some leading thinkers projected a kind of Malthusian crash in the world’s population as rapid growth in the number of people would outstrip agriculture’s ability to supply food. But the post-war Green Revolution that embraced investment in new crop protection chemicals, scaling up fertilizer production, new machinery, land clearance, irrigation and the development of new breeds of animals and plants, enabled the world to keep up, to the point where in 2025 we have enough food for everyone – albeit unevenly distributed and for some unaffordable – even with twice as many people as we had in the early 1970s. It's an absolute miracle."
        },
        {
            "text": "Set alongside that miracle, however, is the disaster, which we can see in the rapidly changing state of the global environment. The food system is, after fossil fuels, the second biggest contributor to greenhouse gas emissions globally. This is leading to an elevated level of heat-trapping gases in the atmosphere, to the point today where CO2 concentrations are at a level not seen for 14 million years. This is leading to rapid global warming and rising sea levels which threaten to obliterate entire countries, the Maldives and large areas of Bangladesh amongst them. Alongside long-term changes and disruptions to seasonal patterns are ever more serious extreme weather events. Nearly every day another headline comes in the wake of these changes. This week it’s Los Angeles suffering the effect of catastrophic fires."
        },
        {
            "text": "In the front line of this rapid climate change is agriculture. In this country in 2023, as a result of heavy rain, we saw farm incomes dented very severely and a £1 billion hit to GDP. Farmland was flooded for months on end, leading to reduced yields and thus diminished domestic food production."
        },
        {
            "text": "On top of this huge and profound climate issue, we have the decline of the natural environment. This is seen in the loss of natural habitats, an increasingly prominent trend with an estimated one million species at risk of extinction. And of course, this challenge gathers increasing momentum, not least as a result of still rising demand for more food, for example in the Amazon, New Guinea and Southeast Asia where more forested land is being cleared to make space for expanded crop production."
        },
        {
            "text": "So the disaster is happening at multiple levels. It's global and, in large part, is linked to our food system, and indeed the single biggest factor behind the decline of biodiversity is the food system. With this in mind it is very clear that we've some really big issues to sort out, and when you look at the context we're in now, with geopolitical tensions causing volatility across multiple aspects of our society, including our food system, following the invasion of Ukraine by Russia, the challenge is more acute than ever. Under these difficult circumstances with the knock-on impact on the cost of living there is evidently a temptation to conclude that we must choose food production as the priority over fixing environmental questions."
        },
        {
            "text": "Food security needs a healthy environment"
        },
        {
            "text": "As we ponder this choice, however, it is vital to take a broader view and to understand that our food security is dependent on a healthy environment. Healthy soils perform miraculous functions, with billions of microbes in just a handful of soil recycling nutrients, creating productive substrates for plant growth, which in turn sustains not only crops but, via grass, also animals. Global food production is also reliant on wild insects for pollination, as well as the benefits we gain from natural pest control role meaning less money needs to be spent on chemicals."
        },
        {
            "text": "And on top of all of that is the biodiversity which is in the agriculture. Very often when we think about biodiversity, we think about wild species. The fact is though that all of the plants and animals that we rely on for our food security are descendants of once-wild species, and while we hear a lot about the role of genetic technologies in supporting food security we hear less about the wild genetic resources that will sustain agriculture into the future, including our ability to deal with pressures arising from new diseases and climate change."
        },
        {
            "text": "The state of the environment is not separate from agriculture - it is bound into it in profound, fundamental ways, and we must protect Nature and climatic stability if we're going to have food security in 2050, 2080, and 2100."
        },
        {
            "text": "Leading by example"
        },
        {
            "text": "This is a huge thing, but one element that is generating huge optimism is the leadership being shown by people who are growing and producing food, leaning into this challenge in really quite impressive ways."
        },
        {
            "text": "During my time as Chair of Natural England, it's been my privilege and pleasure to meet many of them. A few that come to mind include Brian and Patrick Barker, who a few years ago took me around their farm in Suffolk to show how they worked out where the most productive and least productive areas were for crop production, turning those areas that were least productive into green infrastructure to encourage pollinators and birds back into the landscape. Their approach was not leading to reduced yield but was having a significant positive impact on biodiversity."
        },
        {
            "text": "Similarly impressive I found was the work of Richard Maxwell, whose herd of Black Galloways up in the Lake District at Ennerdale was not only producing food but having beneficial environmental impacts. He showed me his approach based on more naturalistic grazing, producing the most fantastic beef, but doing it in a way which is bringing the landscape back to life. The Small Pearl-bordered Fritillary butterfly is one species that is coming back as a result of the activity of the cattle while the land is holding more carbon, and it's regaining too its sponge-like qualities, holding heavy rain in the landscape, reducing flooding downstream, at the same time as producing food."
        },
        {
            "text": "I've had the pleasure to meet on several occasions with the brilliant Cambridgeshire farmer Martin Lines, founder of Nature Friendly Farming Network. He's bringing biodiversity back to his farm, in part through reducing his chemical inputs, which is saving him money. He's storing more soil carbon than he was before as well, by reducing ploughing, which is also saving on fertiliser costs. Again, yields are being sustained at the same time as carbon and wildlife benefits are being achieved."
        },
        {
            "text": "Working in partnership"
        },
        {
            "text": "Alongside the many examples of individual leadership is the exciting work being done by farmers cooperating at scale across entire landscapes, with clusters of farmers working to restore Nature together. I've seen several examples of this, including the very impressive Martin Down cluster working across the borders of Hampshire, Dorset and Wiltshire. This chalk landscape is coming back to life after the wildlife went off a cliff as a result of historic intensification that didn't pay much attention to the deleterious impacts on wildlife. Those farmers are working together with leadership coming from the bottom up, bringing people together to be able to do the right thing in an orchestrated manner."
        },
        {
            "text": "This multi-land-manager approach to landscape level changes is now being facilitated by the government's new Landscape Recovery scheme. Natural England is very excited indeed to be working with partners on more than 50 of these across the country, including with the north-east Cotswolds farmer cluster, where the landscape recovery programme in progress there is restoring woodlands and soils, in the process bringing back depleted wildlife, protecting the rivers while producing food and over time bringing big benefits to society, including food security for the long term. So there is a lot going on, and it's being led by farmers. And what we need to do, of course, is find ways to back that, to build the momentum, to spread the good practice so into the future we can maximise the miracle while minimising the disaster."
        },
        {
            "text": "Inequality and health"
        },
        {
            "text": "At the same time as we gear up efforts to restore the environment and reduce emissions, we have to recognize that there is a huge social dimension in all of this. That includes recognising that the pressures which drove us towards our miraculous food system 70 years ago have changed. During the post war years, it was the threat of hunger and starvation that pushed innovation. Today, and while hunger remains a challenge in some parts of the world, there are more obese people than there are hungry ones. And where there is hunger, this tends not to be down to the global lack of food, but due to poverty and how the distribution of food is highly uneven."
        },
        {
            "text": "With this in mind, we need to find ways to move beyond how our present food system works, with its focus on the production of as much cheap food as possible. It is creating major problems, not only for individuals but for society, as the price tag linked with diet-related ill-health threatens to bankrupt our National Health Service."
        },
        {
            "text": "So what are we going to do about all of this? I mentioned the leadership of some of the people working to produce food at the moment. They need to be supported, and we have a range of tools to do that. Some of them are in the policy space such as the Environmental Land Management schemes. We're working in Natural England to advise and support government as it moves things on, and hopefully in the coming years we’ll be able to implement with much more vigour the process of Nature recovery through the funding available for the Landscape Recovery, Countryside Stewardship and Sustainable Farming Incentive schemes."
        },
        {
            "text": "Sustainable agriculture"
        },
        {
            "text": "Alongside public payments, regulation has a place in creating a level playing field so that everybody's working to good standards. There’s also the broader economic context of all of this, not least seen in global trade agreements and how we can harness those for sustainable agriculture, rather than to get as much cheap food into the country as possible. That approach can undermine the good practice being delivered by British farmers, if we're importing food produced to lower environmental standards on the other side of the world. If we are serious about truly sustainable outcomes, we can't have that and must work harder in aligning trading arrangements with the sustainability of agriculture in this country."
        },
        {
            "text": "The private sector has got a huge role to play in this too. With investment flowing into businesses, products and brands that are based on sugary and fatty foods, we need to redirect finance and business plans toward providing healthy and affordable food for everybody, not just as much cheap food as possible."
        },
        {
            "text": "I must add how all of this will in some large part depend on fixing our broken food culture. Most of the people who go into those supermarkets, with the miraculous array of products from all over the world, are presented with food in brightly coloured packaging that takes us ever further from the reality of how food is produced, with its pathway to our kitchens ever more divorced from ecology, Nature and seasons, and indeed from the farmers who worked to produce it. We have to find ways of being able to fix that, because not only will we need to rely on the push of policy, we're going to have to harness the pull of consumers to move beyond where we are now - producing as much food as possible as cheaply as possible - and instead into a place where we produce sustainable healthy food for everybody, while creating the conditions whereby we can do that indefinitely into the future."
        },
        {
            "text": "Joined-up approach required"
        },
        {
            "text": "This is a huge multi-layered set of issues that we must draw together, and that in turn is going to require a really joined-up approach. It's going to require people from different sectors, different backgrounds, different expertise, different cultures, different political leanings, to be working together. We must devote ourselves with energy and ambition to this work, because there is no more important subject than food security, for without that our society will very quickly collapse. We won’t succeed if we continue to destroy Nature, change the climate or meet the needs of only some people."
        },
        {
            "text": "If we can start to form clearer and stronger synergies between policy, law, business, economics and food culture, driving towards sustainable and healthy food for everybody, we might get somewhere, even within the precious few five years that we have up to 2030. There is no better forum to address all of this than at the Oxford Farming Conferences."
        }
    ]
}