{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/01/10/mhra-good-clinical-and-laboratory-practice-symposia-11-and-12-february-2025/",
    "title": "MHRA Good Clinical and Laboratory Practice Symposia (11 and 12 February 2025)",
    "authors": [
        "Lynsay Hunter",
        "Rachel Mead"
    ],
    "categories": [
        "Events and symposia",
        "Good clinical practice",
        "Public involvement"
    ],
    "pub_date": "2025-01-10T13:55:38+00:00",
    "content": [
        {
            "text": "Come and join the next MHRA Symposia in February 2025 and hear the latest on Good Clinical Practice (GCP) and Good Laboratory Practice (GLP) in the UK from MHRA inspectors and regulators."
        },
        {
            "text": "Registration is available on the dedicated symposia website for in-person attendance in West London and virtual attendance from anywhere in the world. "
        },
        {
            "heading": 2,
            "text": "GCP Symposium (11 February 2025)"
        },
        {
            "text": "This symposium is the first for over 5 years solely dedicated to hearing from the MHRA GCP Team.  The agenda is packed with educational and insightful content including:"
        },
        {
            "text": "This event also affords the opportunity to ask questions of GCP inspectors, both at panel sessions and during Inspector Surgeries.  "
        },
        {
            "text": "For more information and to book your space, visit https://mhragcp-labs.co.uk."
        },
        {
            "heading": 2,
            "text": "Laboratories Symposium including GCP Labs and GLP (12 February 2025)"
        },
        {
            "text": "The Laboratory Inspection Team will explore themes informed by our recent inspections and metrics.  This will include GLP as well as hot topics in GCP clinical laboratories.  The content will include:"
        },
        {
            "text": "In addition to meeting your inspectors, these events provide stakeholders opportunity to network with others and discuss common topics."
        },
        {
            "text": "For more information and to book your space, visit https://mhragcp-labs.co.uk."
        }
    ]
}