{
    "url": "https://defencedigital.blog.gov.uk/2022/07/29/the-defence-digital-foundry-to-do-doing-and-done/",
    "title": "The Defence Digital Foundry - To do, doing and done",
    "authors": [
        "Robin Riley"
    ],
    "categories": [
        "Digital Foundry"
    ],
    "pub_date": "2022-07-29T10:03:29+01:00",
    "content": [
        {
            "text": "The Defence Digital Foundry is a new 'team of teams' in MOD which aims to create excellent digital services for defence users - and at the same time, provide platforms and tools that help others to build great services quickly and consistently. The Foundry is integral to how MOD is turning last year's Digital Strategy for Defence into action."
        },
        {
            "heading": 2,
            "text": "What have we been doing?  "
        },
        {
            "text": "Since we began on our journey to create the Defence Digital Foundry, our main effort has been – and always will be - delivering value to defence users:"
        },
        {
            "text": " "
        },
        {
            "text": "We've also been developing our organisation and how it will work, we have:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What are we going to be doing next?"
        },
        {
            "text": "The Foundry's teams have come together and agreed on their overall mission for the coming quarter. As well as continuing to deliver value to users, we will aim to achieve \"Critical Mass\" as an organisation, where our people feel part of a supportive 'team of teams', able to scale and recruit at pace and make collective resourcing decisions. We'll also aim to:"
        },
        {
            "text": "And finally - we'll aim to 'work out loud' - so watch this space for future blog posts from the Foundry's teams. A lot is going on, and we're keen to share as much as possible."
        }
    ]
}