{
    "url": "https://environmentagency.blog.gov.uk/2025/09/24/op-wolf-targets-waste-carriers-to-disrupt-waste-criminals/",
    "title": "Op Wolf targets waste carriers to disrupt waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2025-09-24T08:50:49+00:00",
    "content": [
        {
            "text": "In this blog, Hampshire police officer PC Terry Read shares how police teams in Hampshire have pooled their skills together and collaborated with partners to target crimes blighting the countryside, including fly-tipping."
        },
        {
            "text": "Hampshire & Isle of Wight Constabulary has a long-running operational effort known as ‘Op Wolf’. This provides regular opportunities for police and other agencies to engage with waste carriers on the road network, and disrupt any offenders including waste criminals."
        },
        {
            "text": "I work in the Neighbourhoods Policing Team based in the Hart district of Hampshire. I led our most recent Op Wolf in September, with support from other police teams including Roads Policing and the Country Watch Rural Crime Task Force (the Constabulary’s dedicated team of rural crime specialists)."
        },
        {
            "text": "Joining us were the Environment Agency, Hart District Council, the DVSA, HMRC, and the Motor Insurers’ Bureau."
        },
        {
            "text": "Based out of Blackbushe Airport off the A30 near Yateley, the op’s primary focus was to engage with motorists transporting waste to prevent any potential fly-tipping. Vehicles transporting other goods and machinery were also stopped and checked by all agencies present."
        },
        {
            "text": "Roads policing officers stopped 30 vehicles and directed them back to the site at Blackbushe where officers and partners got to work conducting necessary checks."
        },
        {
            "text": "Most vehicles were roadworthy and all in order. However, several issues were identified with some vehicles."
        },
        {
            "text": "Two vehicles were being driven with cracked windscreens, three drivers were ticketed due to their loaded vehicles being overweight, one driver was given a ticket for driving without a number plate, and other drivers were found with issues including defective tyres and driving without tax."
        },
        {
            "text": "The DVSA dealt with 11 vehicles for 25 identified issues including worn and defective tyres, and vehicles with brake problems rendering them dangerous on the roads."
        },
        {
            "text": "A pickup truck was seized for having no insurance, and the Environment Agency dealt with a waste carrier who was unable to provide evidence of their waste carrier’s licence or waste transfer note."
        },
        {
            "text": "Operations like this provide a great opportunity for police teams to pool their skills together and call upon the expertise of partner agencies to target offenders using the county's roads."
        },
        {
            "text": "Our focus was on rural criminality, including fly-tipping which blights our countryside, and we had the Environment Agency and local authority with us to support this work."
        },
        {
            "text": "Waste carrier licences were checked, and police teams and other agencies including DVSA and HMRC conducted additional checks and enquiries to deal with any further offences identified."
        },
        {
            "text": "Vehicle stops such as these enable police to check for any number of offences, including individuals potentially transporting stolen goods, and also ensure vehicles transporting heavy loads are safe and roadworthy."
        },
        {
            "text": "A huge part of Hampshire is rural, and we want the communities in these areas to feel supported and to know that we are out there being proactive. We encourage them to keep reporting concerns around rural crime and suspicious people or vehicles."
        }
    ]
}