{
    "url": "https://extremismcommission.blog.gov.uk/2018/11/15/the-commission-on-incivility-and-extremism/",
    "title": "The Commission on incivility and extremism",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Latest news"
    ],
    "pub_date": "2018-11-15T09:32:56+00:00",
    "content": [
        {
            "text": "Since the Commission for Countering Extremism came into existence in March this year, we have visited 13 towns and cities across England and Wales. Many of our meetings have been with frontline counter-extremists, community groups and local politicians. Almost all have expressed their sadness – and shock – at the level of abuse they have experienced, particularly online, but also offline."
        },
        {
            "text": "Extremists seek to silence their critics by intimidation and de-humanisation. We have heard that those who are legitimately challenging extremists have been labelled as ‘Islamophobes’, ‘native informants’, ‘sell outs’, ‘Uncle Toms’ and worse. They have had their home addresses revealed and targeted. Their work is deliberately misrepresented, denigrated and dismissed."
        },
        {
            "text": "A report this week by the think-tank Policy Exchange, by Hannah Stuart who is on secondment to the Commission, argues that there has been a “significant coarsening of public discourse”."
        },
        {
            "text": "The report’s authors claim that “it is no longer enough … to disagree with one’s political opponents; instead, it has become necessary to insist that they do not belong in the same moral universe”. They say this goes beyond the merely offensive or ill-mannered; we are now seeing an “incivility that is disfiguring public life”. This incivility reveals itself through misogyny, racism, Islamophobia, Anti-Semitism, homophobia, gross personal invective and accusations of treachery, and much else."
        },
        {
            "text": "Others have voiced similar concerns."
        },
        {
            "text": "Last year, the Committee for Standards in Public Life argued that the extent of intimidation now prevalent in UK politics posed a “threat to the very nature of representative democracy” and noted that there had been a shift in the scale and intensity of it."
        },
        {
            "text": " This goes far beyond arguments over politics, as the Home Affairs Select Committee said last year as part of its inquiry into abuse, hate and extremism. The cross-party group of MPs found that it is now “shockingly easy to find examples of material intended to stir up hatred” on YouTube, Twitter and Facebook."
        },
        {
            "text": "As a Commission, we want to understand better what the relationship is between this ‘incivility’ and the rise in extremism in our country.  As demonstrated in Policy Exchange’s report, this type of incivility contributes to dehumanising language, active hostility and the othering of “others” or whoever is deemed to belong to the “out-group.”  Such behaviour is also commonly displayed by extremists.  The slope from incivility to extremism is a slippery one; and one we are concerned about."
        },
        {
            "text": "We know online abuse can inspire the most tragic violence offline. Mrs Justice Cheema-Grubb, who earlier this year sentenced Darren Osborne for killing one man and injured nine others when he drove a van into a crowd of Muslims near a north London mosque last year, said his use of Twitter had “exposed him to racists and anti-Islamic ideology” and that he had been “rapidly radicalised over the internet by those determined to spread hatred of Muslims”. "
        },
        {
            "text": "But it goes beyond this. We know that, for some, this acts as a deterrent to get involved in counter-extremism work and is one of the main reasons why counter-extremists are understandably reluctant to talk publicly about their roles. This reduces their ability to deliver the crucial work of protecting others from harm, joining up our communities and building resilience. It also has a chilling effect on freedom of expression; where counter-extremists are fearful about the abuse and incivility they will receive if they publicly push back against extremism.  This harms our wider democracy in two ways: the curtailment of freedom of expression and the delivery of much needed counter-extremism work that seeks to defend and uphold our democratic values from extremists who actively seek to undermine them."
        },
        {
            "text": "Carl Miller, a Research Director at the think tank Demos, told the Home Affairs Select Committee that hate and extremism are growing in parallel with the exponential growth of all social media. Does this mean social media has a specific role in spreading extremism?"
        },
        {
            "text": "And when public discourse frequently resorts to personal invective and abuse, does extremist behaviour become more palatable, more mainstream, more believable? "
        },
        {
            "text": "We don’t yet have the answers to these questions, but over the next few months we will be calling on NGOs, all those who work in counter-extremism, academics and everyone concerned about extremism to share their experiences in our Call for Evidence. "
        },
        {
            "text": "We will be asking for insight and evidence on, among other things, how extremists operate and recruit, the harms they inflict, the interaction between online and offline, and what the government can do to strengthen its response. We will also be asking what a positive alternative to the extremists’ world view looks like. This will feed into a comprehensive study on all forms of extremism that we will publish next spring – our first step towards what we call a whole society response where we all play a part in defeating extremist ideas and activities. "
        },
        {
            "text": "Our fear is that where there is a normalised environment of invective incivility and intolerance, this can help nurture a climate which is conducive to extremism and favourable to extremists."
        },
        {
            "text": "Not just politicians, but every one of us must take responsibility to reinstate civility to public life."
        },
        {
            "text": "#PXCivility"
        },
        {
            "text": " "
        }
    ]
}