{
    "url": "https://ukhsa.blog.gov.uk/2022/10/28/answering-questions-on-monkeypox-vaccination/",
    "title": "Answering questions on monkeypox vaccination",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection",
        "Monkeypox"
    ],
    "pub_date": "2022-10-28T11:34:25+01:00",
    "content": [
        {
            "text": "With the support of partners and the public, we have made good progress tackling monkeypox in the UK since the outbreak was first identified in May 2022."
        },
        {
            "text": "The number of new cases per day peaked at 350 per week in July but has now reduced significantly to 13 per week on 17 October, with the majority of cases still being gay, bisexual and other men who have sex with men. We still continue to see new cases in the UK and cases continue to be identified worldwide, particularly throughout Europe, North America, and South America. Until this outbreak, monkeypox was considered a rare disease in these parts of the world."
        },
        {
            "text": "A combination of factors have contributed to this reduction. These include raised awareness leading to more people seeking clinical advice and testing, changes to people’s behaviour and vaccines. While the reduction is certainly good news, we will continue to prioritise this work because we want to stop spread in the UK."
        },
        {
            "text": "Vaccines and reducing exposure are the best defences we have against monkeypox – here we explain how the vaccine works, who it is being given to and the most important things to know about it."
        },
        {
            "heading": 2,
            "text": "Which vaccine is being offered? "
        },
        {
            "text": "While there is no specific monkeypox vaccine, a smallpox vaccine (called MVA-BN, also known as Imvanex or Jynneos) is being offered to some people at a higher risk of exposure to monkeypox, and some people who have had contact with confirmed cases. This is used because monkeypox and smallpox viruses are part of the same virus family and this vaccine has been used successfully in previous monkeypox outbreaks."
        },
        {
            "heading": 2,
            "text": "Who is eligible?"
        },
        {
            "text": "The Joint Committee on Vaccination and Immunisation (JCVI) has identified the following groups as eligible for the vaccine:"
        },
        {
            "heading": 2,
            "text": "How is the vaccine being rolled out?"
        },
        {
            "text": "The vaccine is being rolled out to eligible groups in several ways:"
        },
        {
            "text": "More information is available from NHS.uk/monkeypox"
        },
        {
            "heading": 2,
            "text": "How many doses are needed? "
        },
        {
            "text": "Whilst sexual health clinics will continue to prioritise offering first doses to those at highest risk, some clinics have also begun to offer those at highest risk a second dose to provide longer term protection. A single dose is effective at reducing both the risk of developing monkeypox and the severity of symptoms, this will provide some protection to as many people as possible, as quickly as possible."
        },
        {
            "heading": 2,
            "text": "How effective is the vaccine?"
        },
        {
            "text": "The evidence suggests even one dose reduces the risk of developing monkeypox. One dose should also reduce the severity of symptoms if someone does develop monkeypox. A single dose prepares the immune system to respond much more quickly if exposed to monkeypox."
        },
        {
            "text": "Like most vaccines, the smallpox vaccine takes time to generate an immune response. While some protection may start after a few days, the vaccine only offers the highest protection after four weeks."
        },
        {
            "text": "Even after receiving the vaccine, whether one dose or two, it remains important to be aware of monkeypox symptoms. Anyone who develops symptoms should stay at home and call 111 or a sexual health clinic for advice."
        },
        {
            "heading": 2,
            "text": "Why is there a limited global supply? "
        },
        {
            "text": "There is only a single global manufacturer of the smallpox vaccine which, until this outbreak, only made a small amount annually for national stockpiles. This outbreak has led to an unexpected and unprecedented increase in global demand."
        },
        {
            "text": "While the manufacturer is currently increasing production capacity, producing new batches of the vaccine takes a significant amount of time."
        },
        {
            "heading": 2,
            "text": "How many doses does UKHSA have? "
        },
        {
            "text": "UKHSA worked quickly at the beginning of the outbreak to secure doses to manage the current outbreak and has procured 150,000 vaccines to date. When administered intradermally, a single vaccine vial can be turned into at least 3 full doses, greatly increasing the number of people who can be vaccinated. More information on intradermal doses is below."
        },
        {
            "text": "The initial 50,000 vaccines – the maximum amount available at the time - were delivered in July. These were rolled out by the NHS and, by mid-August, most doses had been administered."
        },
        {
            "heading": 2,
            "text": "What is intradermal vaccination/fractional dosing?"
        },
        {
            "text": "Most vaccines are given by injection below the skin (subcutaneous) or into a muscle (intramuscular) – almost all health care workers can do this. Some vaccines can also be injected into the upper layer of the skin itself – this is known as intradermal vaccination. This requires specially trained staff and is done with a much smaller volume, using a smaller needle and syringe."
        },
        {
            "text": "The injection may take a few seconds longer and should produce a ‘bleb’ (a small blister) that disappears within a minute. This method is commonly used for skin testing and vaccination against tuberculosis (TB)."
        },
        {
            "text": "Even though the dose given is smaller, intradermal vaccination provides the same level of vaccine protection as giving a full dose via the other methods, while increasing the number of people who can be vaccinated."
        },
        {
            "text": "When vaccines are injected into the skin, rather than the muscle, the important proteins in the vaccine are more accessible to the cells of your immune system. This means that your body can make a good response to the vaccine, even with a much smaller dose. This ‘technique has been used commonly during outbreaks for other infections, such as yellow fever."
        },
        {
            "heading": 2,
            "text": "Why is this being used for monkeypox? "
        },
        {
            "text": "This safeand clinically-approved approach has been commonly used in other worldwide outbreaks when vaccine supplies are constrained. Intradermal vaccination maximises the number of doses that can be administered without compromising protection, turning one dose of the smallpox vaccine into more."
        },
        {
            "text": "After this smallpox vaccine was approved, a study in 2015 compared different doses and methods of giving the vaccine. Roughly 300 people were randomised to either 0.5mL subcutaneous or 0.1mL intradermally. After the second dose the peak antibody levels were similar and overall response rates were around 95% in both groups. On the basis of this evidence, JCVI has said that intradermal vaccination is considered equivalent to the standard route."
        },
        {
            "text": "To maximise the number of people vaccinated, more clinics will offer the vaccine using intradermal administration. This approach has been positively received by patients and staff where it has been used already."
        },
        {
            "text": "Eligible people aged 18 and over will be offered a 0.1ml intradermal dose of the smallpox vaccine, instead of the 0.5ml dose that is typically administered. This will potentially significantly increase the number of people that can be offered vaccination."
        },
        {
            "text": "When you are called for your vaccine, it’s important to show up, as missed appointments can lead to wastage and missed opportunities for others to be vaccinated because the vials can’t be kept for long once opened."
        },
        {
            "heading": 2,
            "text": "Is the vaccine safe?"
        },
        {
            "text": "The vaccine was approved by the EU in 2013 for use against smallpox and has already been successfully used in small monkeypox outbreaks. In the US it was approved for preventing smallpox and monkeypox in 2019.  The vaccine contains a virus which has been modified so it cannot grow in the human body, it does not contain the smallpox or monkeypox virus, and it cannot spread or cause smallpox or monkeypox."
        },
        {
            "text": "Like all vaccines, it may cause side effects, but most are mild and short-lived – and not everyone gets them. The vaccine has fewer side effects than the traditional smallpox vaccine and, unlike the traditional vaccine, doesn’t leave a scar."
        },
        {
            "text": "While side effects may be more common in people who previously received the traditional live smallpox vaccine, this group only needs one dose of this vaccine to boost their existing protection."
        },
        {
            "heading": 2,
            "text": "What should I do while waiting for the vaccine? "
        },
        {
            "text": "Whether waiting for the vaccine or having received one dose or even two, everybody should remain aware of the symptoms of monkeypox, especially those who have new or multiple sexual partners. While the vaccine will reduce the likelihood of developing monkeypox, no vaccine is 100% effective."
        },
        {
            "text": "Symptoms of monkeypox can take up to 3 weeks to develop. Check yourself regularly after intimate contact. Common signs of monkeypox include fever, headache, muscle aches, exhaustion, swollen lymph nodes, and development of a new rash. This could even be a single blister. People who suspect they may have monkeypox should take a break from sex, stay at home and call 111 or their local sexual health clinic."
        },
        {
            "text": "For more information on Monkeypox, please visit: www.nhs.uk/conditions/monkeypox"
        }
    ]
}