{
    "url": "https://aphascience.blog.gov.uk/2022/10/28/apha-science-on-the-global-stage/",
    "title": "APHA science on the global stage",
    "authors": [
        "Neil Wilkins"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-10-28T13:52:51+01:00",
    "content": [
        {
            "text": "Between 7—12 August 2022, 603 delegates representing over 200 organisations from 47 different countries descended on Halifax, Canada, where the 16th International Symposium of Veterinary Epidemiology and Economics (ISVEE16) was taking place."
        },
        {
            "text": "Lucky enough to be involved were myself and eight other scientists at APHA, alongside other notable organisations such as the World Organisation for Animal Health (WOAH), the World Health Organisation (WHO) and the European Food Safety Authority (EFSA)."
        },
        {
            "text": "ISVEE is a large gathering of students, researchers, and policymakers from different areas of expertise, where information is exchanged to advance the fields of veterinary epidemiology and economics and ultimately move towards a healthier world. This happens through a mixture of oral and poster presentations, question and answer sessions, panel discussions, workshops and social events."
        },
        {
            "text": "Since the first edition of ISVEE in 1976, which was hosted by Reading in the UK, the symposium has been held every three years, spanning all continents (apart from Antarctica!) and taking in locations such as Singapore, Nairobi, and Paris (proceedings are archived here)."
        },
        {
            "text": "As a relative newcomer to APHA, ISVEE offered me an opportunity to get up to date with research at the forefront of the field, build new connections with researchers from across the world, as well as to get feedback on my own research."
        },
        {
            "heading": 3,
            "text": "What did APHA have to offer?"
        },
        {
            "text": "In all, APHA contributed seven oral and five poster presentations at the symposium."
        },
        {
            "text": "My talk made it into Thursday morning’s session which was dedicated to epidemiological studies in swine. As this was my first ever presentation at a conference (thanks to COVID-19 interrupting my PhD), I was quite nervous, especially as there were so many people. A Monday morning slot would have been preferable to get it out of the way!"
        },
        {
            "text": "The topic of my talk was ‘A farm-to-consumption quantitative microbiological risk assessment (QMRA) for hepatitis E in pigs’, which is a project I have been working on for the past year in collaboration with partners in France and Austria, as part of the One Health European Joint Programme."
        },
        {
            "text": "While traditionally associated with travel to foreign countries, locally acquired human hepatitis E cases have risen significantly in developed countries over the past couple of decades, with consumption of pork products the suspected cause."
        },
        {
            "text": "The aim of my work is to use mathematical modelling to predict the number of human hepatitis E cases in France due to consumption of different pork products. The model simulates all stages of the pork supply chain, including on-farm transmission, the slaughterhouse, and consumer cooking."
        },
        {
            "text": "Aside from my presentation, APHA’s work on show at the Halifax convention centre spanned a broad range of topics. Matthew Coleman spoke about a model to simulate the spread of African Swine Fever in Great Britain, while Colin Birch presented a statistical analysis of the impact of badger control on bovine tuberculosis in England. Antimicrobial resistance, Salmonella in pigs and coronavirus in wildlife were some of the other topics we had to offer."
        },
        {
            "heading": 3,
            "text": "Takeaways"
        },
        {
            "text": "As an international conference, one thing that stood out for me at ISVEE was how different countries and regions face their own epidemiological challenges, with presentations ranging from highly pathogenic avian influenza in Europe to classical swine fever in Japan and foot-and-mouth disease in Africa. I particularly enjoyed a talk about a food-safety campaign for chicken consumption at urban food markets that was run in Ouagadougou, Burkina Faso. Also, as my role at APHA is in risk modelling, there were several presentations in this area that I found interesting."
        },
        {
            "text": "In summary, I came home from ISVEE with a long list of things to follow up on – including writing this blog! Here are some highlights as seen by others at APHA:"
        },
        {
            "heading": 3,
            "text": "Scientific recognition"
        },
        {
            "text": "Tuesday morning began with the ISVEE awards ceremony, where Professor John Wilesmith, former Head of Epidemiology at the Veterinary Laboratory Agency (which preceded APHA), won the Roger Morris ISVEE Award for Outstanding Contribution to Veterinary Epidemiology and Economics."
        },
        {
            "text": "Prof. Wilesmith was at the forefront of the UK’s battle against Bovine spongiform encephalopathy (BSE) or ‘mad cow disease’ in the 1980s and 1990s. In particular, his epidemiological work concluded that BSE had emerged due to the consumption of meat-and-bone meal that had been fed to cattle."
        },
        {
            "heading": 3,
            "text": "What is next?"
        },
        {
            "text": "ISVEE17 is set for Sydney, Australia from 11—15 November 2024, where I am sure APHA will have lots of new science to present all over again."
        }
    ]
}