{
    "url": "https://lifeathmrc.blog.gov.uk/2022/10/28/celebrating-black-history-month-meet-seun-taiwo/",
    "title": "Celebrating Black History Month: Meet Seun Taiwo",
    "authors": [
        "ebonydouglas"
    ],
    "categories": [
        "Culture & Values",
        "General",
        "Inclusion",
        "Recruitment"
    ],
    "pub_date": "2022-10-28T10:58:27+00:00",
    "content": [
        {
            "text": "Seun Taiwo works in the Borders and Trade directorate as a Programme Management Office (PMO) Portfolio Analyst, for Border Policy Driven Change. His team is responsible for providing governance and assurance activities to the Border Change Delivery team. He is passionate about change and growth and has been fortunate to be involved in some amazing teams and programmes at HMRC."
        },
        {
            "text": "Tell us a bit about you..."
        },
        {
            "text": "I’m a commonwealth citizen of Nigerian origin with Yoruba heritage, married with 3 children. I was born in Lagos and did all my schooling in Nigeria. My family and I moved permanently to the UK in 2010, for better opportunities."
        },
        {
            "text": "I joined HMRC in 2019 as an Administrative Officer in Operational Delivery Profession (ODP) and I am now a Higher Officer in the Project Delivery Profession. I have had the opportunity to complete lots of learning and development opportunities to help develop my career, all of which have been invaluable. I want to share with colleagues that there are so many opportunities available that can help you build an amazing career at HMRC."
        },
        {
            "text": "Have you been involved in any development schemes?"
        },
        {
            "text": "I have successfully completed my ODP Apprenticeship, gained Prince2 Practitioner qualification, Level 3 Operational Delivery qualification, and Agile Project Management qualifications. I have been fortunate enough to complete a 6-week development programme with the East Midlands regional careers aimed at colleagues from ethnic minorities. All these were made possible with the support of all my line managers and support from the senior leadership team, who have promoted and advocated continuous personal development."
        },
        {
            "text": "The vast number of opportunities available at HMRC for personal and professional growth is unbelievable."
        },
        {
            "text": "Sounds good, can you explain a bit more about the opportunities for professional growth at HMRC?"
        },
        {
            "text": "Firstly, the opportunities to become a professional in one’s chosen career path is available with various professional training. I have regular access to the right learning and development opportunities which has allowed me to thrive at HMRC for example, ILX, KPMG, Civil Service Learning, Kalidus Learning. There has been lots of support from career mentors who have continually inspired and motivated me."
        },
        {
            "text": "Development programmes like Leap, Embrace, Spring, Tax Specialist Programme and the Fast Stream provide opportunities to work on cross-government initiatives across the civil service - I was part of Civil Service Live in 2021 as a content support officer for 3 months."
        },
        {
            "text": "What do you enjoy about working for HMRC?"
        },
        {
            "text": "HMRC inspires me to do the best in my job and I am filled with pride when I tell others I work for HMRC. On my journey, I have recognised that HMRC respects individual differences, cultures, working styles and backgrounds and I am proud to champion all the amazing things on offer that make HMRC a great place to work."
        },
        {
            "text": "Work for us!"
        },
        {
            "text": "At HMRC, we’re committed to creating a great place to work for all our colleagues. We want everyone to feel valued, supported, and comfortable being their true self at work."
        },
        {
            "text": "We’re proud to be a diverse and inclusive employer, supporting social mobility by giving opportunities to people no matter what their background is. We want to maximise the potential of everyone who chooses to work for us and offer a range of flexible working patterns and support."
        },
        {
            "text": "We have a wide range of roles available, with vacancies being added to Civil Service Jobs each week. Look at our current vacancies and apply now"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}