{
    "url": "https://actuaries.blog.gov.uk/2022/10/28/start-ready-a-gad-actuary-takes-part-in-a-disaster-risk-financing-initiative/",
    "title": "Start Ready - a GAD actuary takes part in a disaster risk financing initiative",
    "authors": [
        "Andy Jinks - Chief Actuary"
    ],
    "categories": [
        "Actuary",
        "Climate change",
        "Finance",
        "Modelling",
        "Risk management"
    ],
    "pub_date": "2022-10-28T16:15:36+01:00",
    "content": [
        {
            "text": "The topic of disaster risk financing is a growing area of expertise for us in the Government Actuary’s Department (GAD). We recently supported a project to develop a standardised approach to estimating poverty and nutritional aspects of droughts in sub-Saharan Africa."
        },
        {
            "text": "That approach sets out a methodology which can be adapted for simulating drought measures in other countries."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "How do people in those areas get help? How does the money get to the people in need? This is where programmes like Start Ready come in. This is the Start Network charity's newest financial mechanism."
        },
        {
            "text": "It provides funding for what it terms as 'predictable crises' and I've just marked the first 6 months of sitting on the governance committee for the programme."
        },
        {
            "heading": 2,
            "text": "Funds and risks"
        },
        {
            "text": "I was so pleased to be involved right from the start of this initiative which is taking an innovative approach to helping countries badly affected by predictable risks."
        },
        {
            "text": "Basically, networks of members, with disaster risk financing systems in place, apply for Start Ready coverage. This means that the members must have the means to measure risks and set triggers for how pre-agreed finance will be used. Hence the member must be able to decide and articulate in advance “if a particular scenario occurs, funding will be released, for these actions, in these places.”"
        },
        {
            "text": "Once applications for coverage have been received, the governance committee allocates the funding, and the networks receive coverage certificates. This pool of money and the coverage are available for 12 months."
        },
        {
            "text": "It’s an innovative way of ensuring people in need get the funding they require. This then helps them recover more swiftly after they have endured a disaster. It means that for the first time, Start Ready allows Start Network members to receive predictable triggered funding for foreseeable crises."
        },
        {
            "text": "Start Ready operates as a risk pool – meaning that funds and risks are pooled across countries, hazards, and regions. This means the funds are stretching further than they otherwise would – because it is unlikely that all members will make a claim in the same year."
        },
        {
            "text": "This approach by Start Ready also means more people can be protected when it comes to predictable global crises."
        },
        {
            "heading": 2,
            "text": "Predictable crises"
        },
        {
            "text": "Start Ready sits alongside Start Funds to provide members with a range of funding options."
        },
        {
            "text": "These mechanisms help members to:"
        },
        {
            "text": "The Start Ready governance committee looks at how we can best provide funding to help people recover from smaller, and predictable risks."
        },
        {
            "text": "So far, the fund has already provided funding for heatwaves in Pakistan and drought in Zimbabwe. However, the fund provides cover to a wider range of countries which have experienced predictable events such as:"
        },
        {
            "text": "At this point I should add that the Start Network relies on funding. Funding for the first pool of risks was provided by 7 donors."
        },
        {
            "text": "The governance committee is an integrated part of the initiative, and we ensure that the programme has a strong but nonetheless flexible framework within which to operate."
        },
        {
            "heading": 2,
            "text": "Allocating funds"
        },
        {
            "text": "I work with colleagues on the governance committee to assess bids and authorise coverage. Together the 9 of us balance humanitarian needs with financial efficiency and security."
        },
        {
            "text": "At the very start of this, the issues we considered included how should the risk pool be structured? How do we share the money fairly? How do we balance the risk of providing more coverage with ensuring that the funds are sufficient?"
        },
        {
            "text": "We also considered how to manage 'basis risk'. This happens when the pre-agreed models fail to alert us that a foreseeable crisis has occurred, even when we know differently."
        },
        {
            "text": "As an actuary, my expertise feeds into fund allocation decisions across risks, considering the probabilities of their occurrence. We were provided with outputs from standard insurance models and techniques to help us assess the levels of risk."
        },
        {
            "heading": 2,
            "text": "Benefits and experience"
        },
        {
            "text": "Governance committee colleagues include people with extensive experience in governance, risk, and compliance, in climate science and humanitarian programme leadership."
        },
        {
            "text": "The committee also benefits from members who bring distinctive country-specific information by using insights from their teams on the ground. These include Nexus (Somalia), Friendship NGO (Bangladesh), ASECSA (Guatemala) and Rebuild Hope for Africa. Governance committee colleagues also include people from the Tearfund, Concern Worldwide and Plan International UK."
        },
        {
            "heading": 2,
            "text": "Lives and livelihoods"
        },
        {
            "text": "At the start, I wasn’t sure what to expect when I joined the Start Ready governance committee. I believe this work behind the scenes of a humanitarian organisation, is vital to helping people recover their lives and livelihoods more quickly, after a catastrophe."
        },
        {
            "text": "And I’m glad to say our work supporting the vital work of Start Ready, is continuing with the next risk pool expected to go live in the first half of 2023."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}