{
    "url": "https://nationalscreening.blog.gov.uk/2022/10/28/why-evidence-maps-are-the-uk-nscs-first-step-in-reviewing-screening-evidence/",
    "title": "Why evidence maps are the UK NSC’s first step in reviewing screening evidence",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-10-28T09:22:36+01:00",
    "content": [
        {
            "text": "A huge volume and variety of research evidence is published worldwide on health conditions, treatments and technologies. The PubMed database alone includes more than 34 million citations for biomedical literature from MEDLINE, life science journals, and online books. And it added more than a million last year."
        },
        {
            "text": "Sifting and evaluating this evidence is a large part of the work of the UK National Screening Committee (UK NSC) evidence review team."
        },
        {
            "text": "The team manages the UK NSC’s regular reviews of screening evidence for more than 100 conditions as well as carrying out reviews when:"
        },
        {
            "text": "The evidence review team manages evidence reviews and consultations for each condition before presenting its findings to the UK NSC, which in turn makes recommendations to ministers."
        },
        {
            "heading": 2,
            "text": "Proportionate approach"
        },
        {
            "text": "The evidence review process helps to assure stakeholders that the committee’s decisions are grounded in, and informed by, high quality, up to date evidence. But it has to be a proportionate approach in order to ensure timely reports are presented to the UK NSC."
        },
        {
            "text": "That is why this year the committee formally adopted evidence maps as the first step in its process of reviewing evidence for all screening topics."
        },
        {
            "text": "Evidence maps are widely used. They list the titles and research methods of scientific papers on screening questions such as ‘is there a good test?’ or ‘does anyone else in the world run a screening programme for this condition?’"
        },
        {
            "text": "Evidence maps are used to determine if:"
        },
        {
            "text": "Evidence maps have been particularly useful to identify topics where there is not enough new evidence to justify conducting a full new evidence summary every 3 years. They enable the committee to keep on top of developments in all the screening recommendations while focusing on more detailed work on topics where there is significant new evidence."
        },
        {
            "text": "They also enable the UK NSC to filter out topics where the evidence is less good and identify gaps in evidence that might need more research."
        },
        {
            "heading": 2,
            "text": "Examples"
        },
        {
            "text": "Several successive evidence summaries had found that the lack of a reliable screening test was a key barrier to the case for screening for bladder cancer. An evidence map found that this situation had not changed, so further work was not commissioned."
        },
        {
            "text": "The UK NSC received a programme modification proposal that it should explore the use of cell-free DNA (cfDNA) in the antenatal screening pathway for sickle cell and thalassaemia. An evidence map identified a limited volume of evidence and highlighted the need for research on the use of this biomarker. The UK NSC subsequently commissioned a project to consider the kind of research that could inform a recommendation."
        },
        {
            "text": "During the 2019 annual call for topics, the committee received a proposal for handheld ultrasound devices to be used to identify pregnancies at risk of breech presentation. An evidence map found an absence of evidence on the accuracy of this approach, so the National Institute for Health and Care Research (NIHR) Health Technology Assessment (HTA) programme called for expressions of interest in research to help understand the way in which handheld ultrasound devices could be used in a screening pathway."
        },
        {
            "text": "See the UK NSC processes and principles for more information on how the committee reviews evidence related to all population, targeted and stratified screening topics."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}