{
    "url": "https://insideDIO.blog.gov.uk/2020/01/20/fighting-ash-dieback-and-protecting-the-future-of-our-woodlands/",
    "title": "Fighting ash dieback and protecting the future of our woodlands",
    "authors": [
        "Jez Kalkowski"
    ],
    "categories": [
        "Forestry",
        "Public Access",
        "Public safety",
        "Salisbury Plain Training Area"
    ],
    "pub_date": "2020-01-20T17:18:12+00:00",
    "content": [
        {
            "text": "Most people will now have heard of ash dieback. It started to hit the news back in 2019, when the Forestry Commission first started to find infected trees in Kent and East Anglia. Also known as chalara, the disease attacks our native ash trees and has spread at an alarming rate across the UK. The disease was first identified in Poland in 1992, rapidly spreading across Europe and resulting in the death of millions of ash trees. I have been a forester for nearly 30 years, and this is without doubt the most significant woodland management issue the forestry industry has had to face since Dutch Elm disease.  "
        },
        {
            "text": "The disease is caused by a fungus called Hymenoscyphus fraxineus, and has been identified in ash trees across almost the whole of the UK. The disease kills young trees usually within 2 or 3 growing seasons and, while older trees can resist it for longer, most of these trees eventually succumb to secondary fungal infections due to their weakened condition. Hopefully some trees will have some resistance to the infection, but sadly these seem only to be a small minority. Ash dieback has spread so rapidly because the disease is spread by airborne spores. These are produced in summer from tiny fungal fruiting bodies which grow on the infected dead leaves. It's possible that some of our first outbreaks may have resulted from these spores being blown over from infected trees on the continent, which could explain why the disease was widely established in Kent. Ash is the third most common native broadleaf tree, with an estimated 98 million trees growing across the UK. This means that the ash is a massive component of our woodland cover and is an iconic tree of our landscape and cultural heritage.    "
        },
        {
            "text": "As a tree becomes infected with the disease, it begins to lose condition and structural integrity. The crown rapidly starts to die resulting in weak and brittle branches, which can lead to catastrophic failure of major limbs, or indeed the whole tree. This is obviously a huge health and safety risk and estate management issue.   "
        },
        {
            "heading": 1,
            "text": "Impact on the MOD estate "
        },
        {
            "text": "As we have at least 3 million ash trees across the MOD estate, managing this developing issue is a significant objective of our sustainable woodland management and long-term forest planning.  "
        },
        {
            "text": "In 2018 we had to fell large areas of infected ash woodland and individual roadside trees in the Cinque Ports Training Area on the south coast of England. "
        },
        {
            "text": "Unfortunately, we are now faced with the same situation on Salisbury Plain Training Area. It is such a sad situation to lose so many of these wonderful trees from our landscape. As a forester I think of it as an environmental disaster, but unfortunately the health and safety risk from dead and dying trees is too great to ignore, and we must do everything we can to ensure our estate is a safe place to train, live and work.    "
        },
        {
            "heading": 1,
            "text": "Salisbury Plain felling operation "
        },
        {
            "text": "We’ve been working closely with Landmarc, who manage the day to day business of the training estate on DIO’s behalf, as well as colleagues at the Forestry Commission, Natural England and Wiltshire Council to find a suitable solution to this ever expanding problem, and I’m grateful for everything they’ve contributed.  "
        },
        {
            "text": "Work has just started in Ashdown Copse and plans are underway for felling in other infected areas, including along both sides the A345. We’ve identified over 250 areas of infected ash across Salisbury Plain with over 14,000 infected trees. The tree removal work has been scheduled on a risk assessed basis, but it will not be be a quick process and we expect the programme to take about three years. This means that there will be some restrictions to public access while the work takes place for safety reasons.  "
        },
        {
            "text": "Where possible we will leave as many ash trees as we can. We are not trying to eradicate them, just remove the dangerous trees in areas where they are a hazard. I’m also pleased to say we will be replanting more trees than we fell, although the species and locations will vary. Fortunately, it's not all doom and gloom, as this will provide a great opportunity to develop our woodlands. With careful planning and species choice, we have the chance to improve the disease and climate change resilience of the woodlands across the Plain. We have also been working with the DIO’s ecologists on ways to mitigate the wider impact on animal habitats and other species of plants."
        },
        {
            "text": "We completely understand that people living close to Salisbury Plain and those interested in the health of our woodlands will want to know what is happening and its impact on public access. We have an information page on our website and you can also check Wiltshire Council’s website for more on road closures. Keep an eye on our Twitter account and Landmarc’s Facebook page for future updates too."
        }
    ]
}