{
    "url": "https://marinedevelopments.blog.gov.uk/2025/08/12/standardisation-of-post-consent-monitoring-for-offshore-wind-farms-2/",
    "title": "Standardisation of Post-Consent Monitoring for Offshore Wind Farms",
    "authors": [
        "Sophia Yakoob, Offshore Wind Advisor, Strategic Renewables Unit (SRU)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-08-12T07:54:20+01:00",
    "content": [
        {
            "text": "The MMO’s Strategic Renewables Unit has finalised their work with other government departments, Statutory Nature Conservation Bodies (SNCBs), The Crown Estate and Renewable UK to standardise the post-consent monitoring requirements for offshore wind farms. The aims is to make these requirements clear and ensure data is more consistent and useable."
        },
        {
            "text": "The team carried out a literature review and examined post-consent monitoring reports from the past 10 years, available through the MMO’s Marine Case Management System, to create an initial list of recommended standards. Following extensive feedback from a stakeholder workshop and an industry survey, the final standards were developed. These recommendations guide applicants to finalising their post-consent monitoring plans for marine mammals, seabirds, benthic habitats, underwater noise, fish and shellfish, and geophysical surveys."
        },
        {
            "text": "These standards will be used to make decisions on post-consent monitoring reports on whether applicants have completed sufficient monitoring that adhere to the recommended standards. The standards will be implemented by the MMO Licensing Team as a checklist."
        },
        {
            "text": "The standardised approach will allow data to be compared more easily between projects, which will bring multiple benefits, including making it easier to draw robust conclusions about cumulative impacts and allowing the conclusions from one monitoring programme to be used in assessing the impacts of another project. Over time, this will reduce the uncertainty in assessments by strengthening the feedback loop between data, evidence, and decision-making. This approach will also enable data to be more easily discovered, shared and re-used by stakeholders including industry, SNCBs, regulators and academics, as it will be presented in an accessible and widely understood format."
        },
        {
            "text": "For the full report and the accompanying guidance, visit: Marine licensing: Standardisation of Post-Consent Environmental Monitoring for Wind Farms in English Waters - GOV.UK"
        },
        {
            "heading": 2,
            "text": "Underwater Noise"
        },
        {
            "text": "Successful Coordination of Noisy Activities"
        },
        {
            "text": "The Southern North Sea Special Area of Conservation (SNS SAC) is designated to protect harbour porpoise, meaning underwater noise from offshore development must be carefully managed in the area."
        },
        {
            "text": "Management of underwater noise during the summer 2025 season (April – September) in the SNS SAC has been a great success so far. As in previous years, management has included twice-weekly coordination calls between offshore developers and operators to align their noisy activities and ensure that noise disturbance thresholds for the site are not exceeded."
        },
        {
            "text": "Pre-season projections indicated that this would be a very busy period of offshore development; however, thanks to excellent coordination by offshore developers and operators, all works to date have successfully taken place within the noise disturbance thresholds."
        },
        {
            "text": "This is the first year the developer and operator calls have been led by a coordinator, funded by the Offshore Wind Industry Council’s Pathways to Growth Programme. As a result, meetings have run efficiently, and communication between the group and regulators has significantly improved. Regulators hope the coordinator role can continue in future years, subject to available funding."
        },
        {
            "text": "Call for Information"
        },
        {
            "text": "Regulators and government departments are currently working together to plan for future seasons. On Monday, 4 August, the MMO and OPRED issued a call for information on planned impulsive noise activities within or affecting the SNS SAC for:"
        },
        {
            "text": "Developers and operators are encouraged to respond with this request as soon as possible, as early engagement with regulators is strongly encouraged."
        },
        {
            "text": "For queries, contact the underwater noise team at: sru@marinemanagement.org.uk."
        }
    ]
}