{
    "url": "https://naturalengland.blog.gov.uk/2025/04/05/happier-outdoors-londons-free-nature-festival/",
    "title": "Happier Outdoors: London’s Free Nature Festival",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves",
        "Wildlife"
    ],
    "pub_date": "2025-04-05T08:30:00+01:00",
    "content": [
        {
            "text": "By Laura Brown, Higher Officer for Health and Environment, Natural England"
        },
        {
            "heading": 4,
            "text": "What is Happier Outdoors?"
        },
        {
            "text": "Happier Outdoors began in 2023 as part of my work as the Health and Environment Higher Officer for London. I’m lucky to spend a lot of my time meeting grassroots organisations that connect Londoners with nature for health benefits."
        },
        {
            "text": "After many inspiring visits, I noticed two gaps in the way we were working, which I wanted to resolve. Firstly, I felt that these great organisations should be talking to one another as they shared common goals in bringing together nature and health in London, for Londoners. Secondly, I saw that we needed to spread the word further about these exciting activities so that more people could benefit."
        },
        {
            "text": "Gathering opinions from a formal consultation allowed me to identify how I could plug these two gaps: The London Happier Outdoors Network was born."
        },
        {
            "text": "The Network allows organisations and independent practitioners to talk to one another and share knowledge. After just two years, there are now nearly 200 organisations - ranging from The Conservation Volunteers to small Friends Groups for local parks."
        },
        {
            "text": "Our network is strong and valued – we hold an annual conference, regular local events, offer training sessions where required, and collaborate locally on projects. If you work in this field, do join us: https://happieroutdoors.london/plans/399434?bundle_token=20ec37e854a4ed096499612cc2c2ca0b. "
        },
        {
            "text": "The Happier Outdoors Festival, coordinated by Natural England, is an annual event where we celebrate London’s green and blue spaces with free activities. This April is the second festival. If you’re in (or can easily get to) London, we’d love for you to join."
        },
        {
            "heading": 4,
            "text": "Why Nature Matters for Your Wellbeing"
        },
        {
            "text": "Spending time outdoors has powerful benefits for our physical and mental health:"
        },
        {
            "text": "Nearly half of London is a green or blue space. This includes local parks, commons or village greens, and waterways. Yet many Londoners don't realise that these spaces are open to them, or the organisations that are there to support people in enjoying time in nature. The London Happier Outdoors Network aims to change that."
        },
        {
            "heading": 4,
            "text": "What's On at This Year's Festival?"
        },
        {
            "text": "This year’s Happier Outdoors Festival offers a treasure trove of free activities – from gardening sessions and nature walks, to events where you can learn about nature. Or why not try something off the beaten path, like brick painting, nature journalling or exploring the world of pollinators through virtual reality?"
        },
        {
            "text": "You might discover hidden natural spaces just minutes from your home, or be inspired by a new outdoor hobby. What’s great about the festival is that many activities showcase events you can join all-year round."
        },
        {
            "text": "I still smile thinking about last year's festival, where we were fortunate to see pipistrelle bats whilst on a guided bat walk at St John's Waterloo churchyard – incredible nature thriving right next to one of London's busiest stations!"
        },
        {
            "heading": 4,
            "text": "Our Thanks"
        },
        {
            "text": "Whilst the work of overseeing the London Happier Outdoors Network and festival is delivered by Natural England, the true heroes are the 35+ organisations running the events – from large organisations like The Conservation Volunteers and Thrive, to local community groups. "
        },
        {
            "text": "We wouldn’t have our website if it wasn’t for our partners at London National Park City Foundation, for example."
        },
        {
            "text": "Join Us!"
        },
        {
            "text": "Do something for yourself today and have a browse of the festival calendar. Pick an event that sparks your curiosity, and take your first step toward a happier, healthier connection with London's amazing natural spaces!"
        },
        {
            "text": "happieroutdoors.london/spaces/16774181/page"
        },
        {
            "text": "Don’t forget to share photos with us on social media using the hashtag #HappierOutdoorsFestival "
        }
    ]
}