{
    "url": "https://socialcareinspection.blog.gov.uk/2023/05/23/children-with-complex-needs-in-childrens-homes/",
    "title": "Children with complex needs in children’s homes",
    "authors": [
        "Yvette Stanley",
        "Alex Jones"
    ],
    "categories": [
        "children's homes",
        "local authorities",
        "mental health"
    ],
    "pub_date": "2023-05-23T14:00:36+01:00",
    "content": [
        {
            "text": "In the autumn, we will publish a research project on children with complex needs who live in children’s homes. This is a 2-stage project. The first stage, which we completed earlier this year, involved running a survey of all local authorities and children’s homes providers. We asked them what they associate with the term ‘complex needs’ and how often they have issues in finding homes for, or accepting referrals for, children with these needs. We were pleased that we had responses from 807 children’s homes and 78 local authorities."
        },
        {
            "text": "About the project"
        },
        {
            "text": "This project follows on from our recent research report which explored the challenges that local authorities face when planning for sufficiency. We highlighted the increase in the number of children who need specialist provision to support their complex needs. And we highlighted the difficulty that local authorities experience in trying to find suitable homes for them."
        },
        {
            "text": "Throughout the project, we want to develop a clearer understanding of:"
        },
        {
            "text": "What are ‘complex needs’?"
        },
        {
            "text": "'Complex needs' is often used as a catch-all term to refer to many different needs or risks."
        },
        {
            "text": "We asked local authorities and children’s homes which types of needs contribute to a child’s needs being considered complex."
        },
        {
            "text": "Respondents said that all types of need can contribute but a combination requiring support from multiple partner agencies is central to the definition."
        },
        {
            "text": "We found that the most common responses about what ‘complex needs’ are fell into four main groupings:"
        },
        {
            "text": "Individually, these areas may not be considered complex, but their frequent combination with other groupings contribute to the definition of ‘complex needs’."
        },
        {
            "text": "Finding homes for children with complex needs"
        },
        {
            "text": "Almost all (91%) of the local authority respondents said that they often or always experience difficulties finding homes for children with complex needs."
        },
        {
            "text": "On average, local authorities said that it takes four months to find a stable home for children with these needs. Some reported it can take as long as three years."
        },
        {
            "text": "Over three-quarters of local authority respondents said that children with complex needs often or always experience one or more of:"
        },
        {
            "text": "This confirms what we had already heard anecdotally from sector professionals."
        },
        {
            "text": "Systemic barriers that impact children"
        },
        {
            "text": "The research also points to some sector-wide and systemic barriers to finding homes for children with complex needs, or providing care for them within children’s homes. These, include issues with:"
        },
        {
            "text": "Children’s homes reported that poor communication and lack of transparency from some local authorities about the child’s needs is a barrier to referral decisions. In turn, local authorities reported that some homes are not able to deliver the care outlined in their statement of purpose documents. These views highlight just how important thorough and reliable information-sharing between children’s homes and local authorities is."
        },
        {
            "text": "Some children’s homes also still believe that caring for children with complex needs can result in lower inspection grades. This perception is understandable but it is incorrect. As we have said previously, how complex a child’s needs are will not affect how we grade a home. What we do on inspection is recognise where services are adapting and responding appropriately to children."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "The survey findings are informing the next stage of our research in this area. Over the summer, we will be speaking with children living in children’s homes and the professionals who are involved in their care. We also want to share examples of good practice with you."
        },
        {
            "text": "We would like to thank the local authorities and children’s homes who participated in our survey and look forward to sharing the full report in the autumn."
        }
    ]
}