{
    "url": "https://deframedia.blog.gov.uk/2023/05/23/coverage-on-nutrient-neutrality-2/",
    "title": "Coverage on Nutrient Neutrality",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Natural England",
        "Nature"
    ],
    "pub_date": "2023-05-23T11:46:37+01:00",
    "content": [
        {
            "text": "There has been coverage in The Times today which covers comments from the Home Builders Federation, who claim that Natural England has blocked the building of over 160,000 homes due to nutrient neutrality rules, causing development levels to fall to their lowest level since the 1920’s."
        },
        {
            "text": "Their reporting states that under the rules, developers in 74 councils have to demonstrate that new houses will not lead to more phosphates running into rivers but that critics argue the main causes of pollution are agricultural run off and the Victorian sewage system."
        },
        {
            "text": "To clarify, work is underway with developers and local authorities to ensure that housebuilding can take place while protecting nature. In fact 242,700 homes were delivered in 2019/20 – a 32 year high."
        },
        {
            "text": "In July, Defra and Natural England set out plans for a new nutrient mitigation scheme, and we have announced a series of measures to drive down nutrient pollution and help unlock construction of new homes across the country."
        },
        {
            "text": "Defra and DLUHC will provide up to £30 million of funding over the next three years, which will be compensated through developers purchasing ‘nutrient credits’ to remove requirements in providing mitigation."
        },
        {
            "text": "Local Planning Authorities can grant planning permission for developments which have secured the necessary nutrient credits."
        },
        {
            "text": "All affected areas can continue to access practical support backed by £100,000 (per catchment) from the government and Natural England in meeting nutrient neutrality requirements."
        },
        {
            "text": "The Government also launched the Local Nutrient Mitigation Fund Call for Evidence and Expression of Interest, seeking proposals from local authorities up to an indicative £10m threshold. Where high quality proposals are identified, we will provide funding to support clearer routes for housing developers to deliver ‘nutrient neutral’ sites, in line with their environmental obligations."
        },
        {
            "text": "There will also be a legal duty on water companies in England to upgrade wastewater treatment works by 2030 in designated areas: Government sets out plan to reduce water pollution."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "Edel McGurk, Regional Operations Director at Natural England said:"
        },
        {
            "text": "Please see here for further information on our nutrient mitigation scheme."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}