{
    "url": "https://deframedia.blog.gov.uk/2023/05/23/coverage-of-ivory-act-extension-to-five-new-species/",
    "title": "Coverage of Ivory Act extension to five new species",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-05-23T11:25:54+01:00",
    "content": [
        {
            "text": "There has been coverage today in BBC News, Guardian, Sky News, the Independent and the Evening Standard of our announcement that five new species are set to be protected under the Ivory Act extension."
        },
        {
            "text": "Hippopotamus, walrus, narwhal, killer whale (orca) and sperm whale are set to receive greater legal protections under the UK’s world-leading ban on importing, exporting and dealing in items containing ivory."
        },
        {
            "text": "BBC Breakfast filmed a live package with Naturalist Steve Backshall MBE and Border Force at Heathrow’s ‘Dead Shed’ and BBC Radio 4 Today Programme covered the announcement in the news bulletins."
        },
        {
            "text": "Hippopotamus is the species most at risk from the trade in its ivory after elephants. The other species are already threatened by climate change, and the continuing trade in their ivory may exacerbate these threats and make their long-term survival less likely."
        },
        {
            "text": "The Ivory Act is one of the toughest bans on elephant ivory sales in the world, with some of the strongest enforcement measures. Those found guilty of breaching the ban face tough penalties including an unlimited fine or up to five years in jail."
        },
        {
            "text": "Biodiversity Minister Trudy Harrison said:"
        },
        {
            "text": "Steve Backshall MBE said:"
        },
        {
            "text": "Since 6 June 2022, there has been over 6,500 registrations and certificates issued for exempted items so that they continue to form part of our artistic and cultural heritage. Owners can use our online service to register an ivory item or apply for an exemption certificate to deal in ivory."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}