{
    "url": "https://teaching.blog.gov.uk/2023/05/23/how-i-implemented-tutoring-in-my-school/",
    "title": "How I implemented tutoring in my school",
    "authors": [
        "Simrat Mavi"
    ],
    "categories": [
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2023-05-23T09:37:13+01:00",
    "content": [
        {
            "text": "Simrat Mavi, deputy headteacher of St Giles Church of England Primary School shares her experience of how she implemented tutoring and tips for other schools."
        },
        {
            "text": "Background of school:"
        },
        {
            "text": "St Giles Church of England Primary School is a voluntary controlled mixed school in Walsall. There are 441 pupils enrolled in the school, of which 35.9% of the pupils are eligible for free school meals."
        },
        {
            "text": "The school delivers tutoring using an academic mentor and tuition partners, Action Tutoring and Third Space Learning."
        },
        {
            "text": "‘If you value tutoring, then prioritise it” - Simrat Mavi, St Giles CoE Primary School"
        },
        {
            "text": "What did you consider when you were planning tutoring?"
        },
        {
            "text": "We focused on our key school priorities when considering how we planned to implement the National Tutoring Programme (NTP). We looked at our school development plan and how tutoring could help deliver our priorities of improving the quality of education and closing the attainment gap. This helped ensure more disadvantaged pupils made good progress in reading, writing and mathematics by the end of key stage 2."
        },
        {
            "text": "Another important consideration was how to provide an environment that was free from distractions for the pupils to be relaxed and be able to focus on their tutoring. We ensured that fast Wi-Fi and high-quality hardware was available, along with suitable furniture to create the right environment conducive for learning."
        },
        {
            "text": "How did you select pupils and tutors?"
        },
        {
            "text": "Pupil progress meetings with staff were used to identify pupils who required extra targeted support tailored to their specific needs - for example, revisiting foundational knowledge, practising basic skills, building reading fluency or pre-learning upcoming content linked to the age-related curriculum being covered in class."
        },
        {
            "text": "When selecting the most appropriate tutors, it was important that they were well versed with the national curriculum. Our tutors needed to show that they could deploy a range of approaches to successfully support the learning for a pupil from their unique starting point. A final factor we considered was the personality of a tutor - someone who is relatable and able to motivate learners in a positive manner."
        },
        {
            "text": "How did you choose a tutoring route? "
        },
        {
            "text": "We decided to use a combination of NTP tuition routes as it was the most practical way to fit around our pupils’ timetables."
        },
        {
            "text": "Do you think face-to-face or online tutoring works better? "
        },
        {
            "text": "In our experience, we have found that using a combination of face-to-face and online tuition proved to be most successful. Both approaches are having the intended impact to improve outcomes for the most disadvantaged learners."
        },
        {
            "text": "How do you schedule tutoring sessions?"
        },
        {
            "text": "To help us plan our 15-hour sessions, we use Action Tutoring to help schedule the sessions and focus predominantly on disadvantaged year 5 pupils who are just below age-related expectations in the summer term.  These pupils are then scheduled for an additional 15 hours when they are in year 6 in the autumn and spring terms to provide continuity of support and to reinforce learning."
        },
        {
            "text": "We also use Third Space Learning to support pupils with SEND from years 2 to 6 for maths intervention. The school is able to schedule these in line with the class timetables and targeted groups."
        },
        {
            "text": "For tuition delivered during school hours, we use an academic mentor who is a full-time member of staff and is contracted to deliver tuition across the whole academic year. The academic mentor uses their time to focus on key reading interventions to build the pupils’ vocabulary, their reading fluency and their comprehension skills."
        },
        {
            "text": "How do you share information with tutors?"
        },
        {
            "text": "To ensure our tutors are having impact and communicate progress information, we have an assessment lead who oversees the implementation of all tutoring. The assessment lead has regular discussions with our tutoring organisations and tutors to ensure there are no issues regarding data analysis, attendance, or technical issues. The reports are also shared with class teachers who use the key information to plan and target areas of weakness. Similarly, the academic mentor liaises with class teachers to celebrate good progress or identify any issues. Pupils’ outcomes are also shared with parents through certificates and book rewards."
        },
        {
            "text": "How do you ensure tutoring meets your pupils’ needs?"
        },
        {
            "text": "Talking to parents is invaluable in gaining an insight into how they view the tutoring programme. A termly pupil progress meeting is held with all staff to discuss the impact of tutoring on the target groups of pupils. Informally, we monitor the implementation as well as talking to pupils directly to seek their views on how tutoring is improving their learning and confidence."
        },
        {
            "text": "For more information on the National Tutoring Programme:"
        }
    ]
}