{
    "url": "https://defradigital.blog.gov.uk/2023/05/23/how-to-learn-from-learning-at-work-week/",
    "title": "How to learn from Learning at Work Week",
    "authors": [
        "Joya Snowden, Capability Development lead"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-05-23T08:00:42+01:00",
    "content": [
        {
            "text": "Joya Snowden, Digital Data and Technology Services Capability Development Lead, reflects on how we can all benefit from this annual celebration of learning, even discovering or acquiring new talents and curiosities."
        },
        {
            "text": "We are always learning. Finding your way to a new place, meeting new people, going to shows, reading, listening, and talking to others, attending a training course in person or online; all of these give us insights and learning. So, what is Learning at Work Week all about?"
        },
        {
            "text": "Helping to build your future\nThe week is observed UK-wide to bring this to our conscious mind as being an important thing to do. The theme this year is “Creating the Future”, and Defra has taken it a step further to call it “Build your Future”."
        },
        {
            "text": "Colleagues who have tips and advice for others across the wider Defra organisation were given the floor to present on topics that are close to their hearts, using webinars, ‘all staff’ calls, podcasts, and other ways to share their knowledge, insights, and experiences."
        },
        {
            "text": "What was happening in your organisation for Learning at Work Week? Did you too have opportunities to join learning sessions or take up new learning opportunities? Did you feel you had the time and capacity to take up those opportunities? Or were you just too busy?"
        },
        {
            "text": "Helping others to build their future\nI wrote earlier this year about why I enjoy being a mentor, and how I see my mentoring role being about helping, rather than simply to try and ‘fix’ someone’s problems."
        },
        {
            "text": "It’s a point I really emphasised in that blog - the fact that a mentor can’t fix things for the mentee; that’s not our role. The mentor might share resources and provide contacts for the mentee, but the mentee sets the agenda and follows it through.  The mentor does not “rescue” the mentee."
        },
        {
            "text": "Learning can benefit your mental health too\nLearning supports wellbeing too; this is so true. It can make you feel alive when it fires up your thinking, as your brain makes connections, whether at work or outside. Working with others and collaborating fires up thoughts within the group. The process itself sparks new ideas that spiral as others contribute to it."
        },
        {
            "text": "Last week also happened to be Mental Health Awareness Week, and the theme this year is anxiety. Anxiety is a normal emotion in us all, but sometimes it can get out of control and become a mental health problem. Lots of things can lead to feelings of anxiety, relationships, starting a new job (or losing one) or other big life events."
        },
        {
            "text": "Anxiety can be a blocker to learning too, for example many people really feel the pressure when it comes to exams. Anxiety can even put some off from taking up certain types of learning that might require a test or exam at the end. One study in 2018 showed that a quarter of Scottish parents believed that academic pressure was causing their children to feel stressed (Source: Mental Health Foundation)."
        },
        {
            "text": "The good news - learning can lead to fulfilment\nNot only does learning help the learner but our mentors will confirm that it is fulfilling for those who contribute to it. There are so many experienced Digital, Data and Technology Profession (DDaT), project, security, and other skilled practitioners in our organisation who share, support and mentor their colleagues, and in so doing deepen their own knowledge through questions that they are asked."
        },
        {
            "text": "And then when something works – it can be wonderful! Just think about the reward and recognition schemes that many employers now use to celebrate and recognise achievements."
        },
        {
            "text": "In Defra, our Special Thanks and Recognition (STaR) scheme is proving a real success when it comes to helping our people feel valued and motivating them to go that extra mile.  STaR recognises the hard work of Defra group employees by providing employee to employee recognition. Peer recognition is so powerful don’t you think?"
        },
        {
            "text": "And when something doesn’t work out, that too is a learning experience that takes us one step closer to our goal."
        },
        {
            "text": "So, what will you be doing to take advantage of Learning at Work Week? Will you take matters into your hands by seeking out new learning opportunities. Will you get yourself a coach or a mentor? How will you build your future?"
        }
    ]
}