{
    "url": "https://insidehmcts.blog.gov.uk/2023/05/23/improving-accessibility-at-the-royal-courts-of-justice/",
    "title": "Improving accessibility at the Royal Courts of Justice",
    "authors": [
        "Laura Marshall - Business Change Manager, Royal Courts of Justice, HMCTS"
    ],
    "categories": [
        "Training and support",
        "Working at HMCTS"
    ],
    "pub_date": "2023-05-23T15:12:52+01:00",
    "content": [
        {
            "text": "The Royal Courts of Justice (RCJ) is a historic building. It was built in the 1880s, and this sometimes makes it difficult to provide a 21st century, modern justice system in a 19th century building. This presents particular challenges for court users who have accessibility needs. Due to its listed status, there are legal restrictions as to what can be physically or visually changed, which adds to the complexity."
        },
        {
            "text": "The RCJ Group, which includes all the courts located within the Royal Courts of Justice, Rolls Building, and Chief Magistrate's Office, has been working creatively to improve support for court users with accessibility needs. Our staff play an important role in making sure our users can use our services, and sometimes we may need to provide additional support."
        },
        {
            "heading": 2,
            "text": "Disability Contact Officers"
        },
        {
            "text": "The RCJ Group recently relaunched its Disability Contact Officer (DCO) network after it paused during the pandemic. The DCOs (unique to the RCJ Group) are a network of staff who dedicate time to supporting users with disabilities. They undertake the role in addition to their existing jobs at the RCJ."
        },
        {
            "text": "Each division within the RCJ Group, such as the Court of Appeal, King’s Bench Division, or High Court Family, has DCOs who act as points of contact for users with disabilities. This means that when court users with disabilities need additional support or provisions when coming to court, the dedicated DCO can help put these support measures in place. These are also known as 'reasonable adjustments'."
        },
        {
            "text": "Examples of reasonable adjustments might be:"
        },
        {
            "text": "Having a single point of contact for users with disabilities aims to reduce the amount of people involved in arranging reasonable adjustments and simplifies the process. We also hope that users asking for reasonable adjustments find the process much simpler, by having a focused and dedicated DCO supporting them."
        },
        {
            "heading": 2,
            "text": "Accessibility awareness workshops"
        },
        {
            "text": "Alongside the network relaunch, we’ve introduced accessibility awareness workshops for all RCJ Group staff, including those located in the Rolls Building and Chief Magistrate’s Office."
        },
        {
            "text": "The workshops aim to raise awareness about accessibility, with a particular focus on disability, including:"
        },
        {
            "text": "The workshops include a walkaround of the building to highlight the physical difficulties our users may face when coming to the RCJ and how staff can help mitigate these, despite the limitations of a listed building."
        },
        {
            "text": "They will cover over 700 members of staff in total and the workshop content will be embedded into staff inductions. This will ensure that staff are equipped with the knowledge and tools to help our users."
        },
        {
            "text": "By increasing staff understanding and awareness of accessibility and the processes involved in arranging reasonable adjustments, we want our users to feel better supported and understood."
        },
        {
            "text": "I’m really proud of the work we have done at the RCJ, and the team are committed to continue making improvements. We’ve already received feedback from RCJ and Rolls Building court users on their improved positive experience with our staff. We hope that these positive experiences continue."
        },
        {
            "text": "Using the learning from the RCJ accessibility work, we will look to see where we can further improve our accessibility practices across HMCTS."
        }
    ]
}