{
    "url": "https://lifeathmrc.blog.gov.uk/2023/06/05/carers-week-2023-claire-louises-story/",
    "title": "Carers Week 2023: Claire-Louise’s Story",
    "authors": [
        "Claire-Louise"
    ],
    "categories": [
        "Diversity and inclusion",
        "Employee support",
        "General",
        "Mental Health"
    ],
    "pub_date": "2023-06-05T08:00:15+00:00",
    "content": [
        {
            "text": "In support of Carers Week 2023, we caught up with Claire-Louise, one of our inspirational colleagues who has caring responsibilities at home. Here she shares her personal story of becoming a carer including how she’s been supported in the workplace, and how the Carers Network comes together to support others."
        },
        {
            "heading": 3,
            "text": "My story"
        },
        {
            "text": "\"I’m married and have two children aged 11 and 14."
        },
        {
            "text": "I became a full-time carer for a disabled adult in December 2015 when my husband, Iain, was diagnosed with a brain tumour. This turned our lives upside down overnight. He went from being fit and healthy to lying in a coma within 5 days. Following 6 operations, radiotherapy, and chemotherapy, he has been left with an Acquired Brain Injury (memory and cognitive problems), mobility issues and brain fatigue. Iain’s tumour is now growing in his spine, which is inoperable, so we are in a constant round of scans and appointments to monitor his situation and decide when more treatment will be required. Because of his constant monitoring it’s difficult to plan even a holiday as you don’t know from scan to scan if treatment will start."
        },
        {
            "text": "Being a carer can be mentally exhausting, stressful and lonely. Iain changed and became completely dependent overnight and emotionally detached from life. His condition is degenerative, terminal and unpredictable. The children have also found coping with this hard, now they are getting older they also have to step up as young carers and help to support their dad the best they can. Some days are better than others."
        },
        {
            "heading": 3,
            "text": "Workplace support"
        },
        {
            "text": "During the initial treatment/diagnoses, work could not have been more supportive. I was given time off and was able to adjust my working pattern, including working from home (which wasn’t the norm then), and if required, just pop out to attend hospital visits/appointments with brain surgeons or just school stuff."
        },
        {
            "text": "I contacted the Carers Network where I received support and advice which was invaluable.  They suggested a carers passport would support my on-going needs. I put this in place in discussion with my manager, so he understood my situation and the impact on my time/mental health. The passport is a living document, so I update it whenever some change happens and discuss what support I need to let me still work effectively, to balance my caring needs and allow me to recharge my batteries by taking the majority of my leave as time off and not to cover endless appointments. Being a carer doesn’t mean I have to just deal with Iain’s medical appointments but also things like sorting out his benefits from the Department for Work and Pensions (DWP)."
        },
        {
            "text": "I now have a special working arrangement in place, so I work part year and take the holidays off with the children and work from home two days a week. Work is important to keep my identity and allow me to be Claire-Louise and not just a carer or mum. The support work has provided has allowed me to continue to have a career whilst being a full-time carer and I have even obtained a promotion since becoming a carer."
        },
        {
            "text": "I also need to give praise where it is due – my immediate colleagues and team have always been supportive and never questioned why I need to disappear but always ask how I am and if I need anything from them during stressful periods, of which there have been many! I nominated a colleague, for a Civil Service Carers Individual Support Award a couple of years ago and he won. I’m proud to say he has become a very good friend and not just a colleague over these last few years."
        },
        {
            "text": "In 2017, I joined the Carers Network Steering Committee to try and support others in my position. I became the regional representative for our office and arranged events and provided a one-stop-shop to support carers. During the pandemic we had to adapt to provide on-line support and now cover a lot of events across the whole HMRC community to bring carers together. Knowing you are not alone and there are others really helps. We have been developing a programme of events for Carers Week and work with the Civil Service Carers Network and the Charity for Civil Servants to make sure we provide correct, up-to-date information and support for our network."
        },
        {
            "heading": 3,
            "text": "What next?"
        },
        {
            "text": "I have no idea what is next. Does anyone? Iain initially was given 10 years, but medicine moves on, so you never know. He could live to 80, he could sadly leave us next year. That is one of the hard things to cope with. Following Iain’s latest scan, he’s now back in treatment. However, you just get on and live your life and try not to dwell on it too much.  As Doris Day sang “que sera, sera”."
        },
        {
            "text": "However, I do know that whatever happens I can still come to work be supported and be an individual.\""
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "At HMRC, we care about our colleagues and their wellbeing. If you’ve been affected by Claire-Louise’s story, or if you’re struggling with your own caring responsibilities, reach out to your colleagues or manager for support. If you would like to find out more about what it’s like to work at HMRC, including our values and culture, visit our careers website."
        }
    ]
}