{
    "url": "https://apprenticeships.blog.gov.uk/2023/06/05/carers-week-2023-celebrating-apprenticeships-in-care-services/",
    "title": "Celebrating apprenticeships in care services",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "The Institute"
    ],
    "pub_date": "2023-06-05T09:22:47+01:00",
    "content": [
        {
            "text": "Apprenticeships are a fantastic way to enter your chosen career, and help you develop the knowledge, skills and experience you need to progress in your role."
        },
        {
            "text": "Rachel, Laura and Lisa have experienced apprenticeships in care services at Hertfordshire County Council. Hear from their experiences in developing their careers through apprenticeships."
        },
        {
            "heading": 2,
            "text": "Rachel, Deputy Manager at Hertfordshire County Council  "
        },
        {
            "heading": 3,
            "text": "What apprenticeships have you done and why did you decide to do an apprenticeship? "
        },
        {
            "text": "I’ve completed the level 2, 3 and 5 adult social care apprenticeships because I wanted to further my career and professionally develop whilst within my role. I thoroughly enjoyed the learning, which I wouldn’t have necessarily ever delved into had it not been for the apprenticeship."
        },
        {
            "heading": 3,
            "text": "What would you say to people thinking about doing an apprenticeship?"
        },
        {
            "text": "I learnt a great deal from the apprenticeships I have been on and would encourage others to do the same should they wish to develop their skills, knowledge, and confidence in whichever sector they’re working in."
        },
        {
            "heading": 2,
            "text": "Laura, Student Social Worker at Hertfordshire County Council  "
        },
        {
            "heading": 3,
            "text": "What apprenticeship are you doing?"
        },
        {
            "text": "I started my career in social work through a level 2 apprenticeship. I am currently completing my social work degree through an apprenticeship."
        },
        {
            "heading": 3,
            "text": "Why did you decide to do an apprenticeship?"
        },
        {
            "text": "Being able to complete a degree whilst remaining in my role is a huge opportunity and it has enabled me to develop my understanding with opportunities to progress in my career. "
        },
        {
            "heading": 3,
            "text": "What have the highlights been so far?"
        },
        {
            "text": "My first apprenticeship enabled me to get into social work and I learned that social work was what I wanted to do for my career. Having the opportunity to experience different aspects of social work through the placements has been extremely valuable, I would not have had the chance to experience these teams without the apprenticeship."
        },
        {
            "heading": 2,
            "text": "Lisa, Social Worker at Hertfordshire County Council "
        },
        {
            "heading": 3,
            "text": "What apprenticeship have you done and why did you decide to do an apprenticeship?"
        },
        {
            "text": "l have completed level 2 and 4 apprenticeships in adult social care and I hope to progress to the level 5 leader in adult care apprenticeship this year. I wanted to develop practice-based skills, increase my experience working in various settings and learn whilst working."
        },
        {
            "heading": 3,
            "text": "How has an apprenticeship helped you?"
        },
        {
            "text": "The apprenticeship process has and will continue to support me within the workplace, providing me with the essential knowledge to fulfil my role. I feel it has enabled me to reflect and review my way of working, and supported me to feel more confident. I would always recommend it as it is a great opportunity and opens doors for growth within your career."
        }
    ]
}