{
    "url": "https://space.blog.gov.uk/2023/06/05/crowds-turn-out-for-launch-of-uk-space-agencys-space-for-everyone-tour/",
    "title": "Crowds turn out for launch of UK Space Agency’s Space for Everyone tour",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2023-06-05T16:46:14+01:00",
    "content": [
        {
            "text": "The first leg of the UK Space Agency’s Space for Everyone tour was a resounding success, as hundreds turned out to see the 72 ft model rocket at West Bar Gate, Southampton from June 1st to June 5th."
        },
        {
            "text": "The tour, which heads to Swansea next later this month before visiting a further 8 locations across the UK, aims to captivate and educate the next generation, showcasing the UK's flourishing space industry and the diverse array of career opportunities available."
        },
        {
            "text": "The Southampton leg was officially opened by Deputy CEO of the UK Space Agency, Ian Annett, and ESA reserve astronaut, Meganne Christian."
        },
        {
            "text": "UK Space Agency Deputy CEO, Ian Annett, said: “Our Space for Everyone tour was an exciting opportunity for young people, and their parents and teachers, in Southampton to see first-hand what it is really like to work in the space sector and to learn about careers in this growing and exciting industry."
        },
        {
            "text": "“The space sector requires various skills – many not traditionally associated with it – and champions inclusivity and the need for innovation."
        },
        {
            "text": "“You don’t have to be a rocket scientist, or even an astronaut, as there are a host of talents needed to bring space closer to our daily lives and improve our understanding of this critical part of the environment for the benefit of the planet and its people.”"
        },
        {
            "text": "UK ESA reserve astronaut, Meganne Christian, said: “I’m thrilled to be a part of the Space for Everyone tour. Space is such an exciting sector to work in, where the possibilities are truly endless."
        },
        {
            "text": "“I have worked with people of many different backgrounds and expertise in my journey to becoming a member of the European Space Agency astronaut reserve, so I know how important it is to make sure that young people everywhere have access to the learning and inspiration they need to consider a future in space.”"
        },
        {
            "text": "Throughout the event, local space and STEAM organisations, including In-Space Missions, Space South Central and the University of Southampton, were on hand, to highlight the range of exciting career opportunities available in the space industry in the South of England and beyond."
        },
        {
            "text": "The Space for Everyone tour is shedding light on the pivotal role that space plays in enhancing life on Earth. Visitors, including children, families, and teachers, have the unique opportunity to witness first-hand how space technologies benefit our daily lives and gain insights into the continuous efforts to explore the great unknown."
        },
        {
            "text": "Space for Everyone provides an immersive experience, incorporating state-of-the-art virtual reality headsets to provide unparalleled insights into what a launch from the UK looks like, and the job roles involved in making it happen."
        },
        {
            "text": "Visitors have the opportunity to explore various interactive areas, learning about the crucial role of satellites and discovering the diverse career paths available within the UK space industry."
        },
        {
            "text": "Admission to the roadshows is free, with no booking required, and while the event is primarily targeted towards children aged 9 to 18, it is guaranteed to ignite a passion for science, technology, engineering, arts and mathematics (STEAM) in individuals of all ages. Mums, dads, grandparents, and next-door neighbours are all invited to participate and experience the excitement of the Space for Everyone tour."
        },
        {
            "text": "For further information about the Space for Everyone: Rocket Roadshow, please visit spaceperson.co.uk/rocket-tour or follow @spacegovuk on social media."
        }
    ]
}