{
    "url": "https://civilservice.blog.gov.uk/2023/06/05/ensuring-support-for-our-carers/",
    "title": "Ensuring support for our carers",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary",
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-06-05T10:36:04+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Three years after launching the Civil Service Carers’ Strategy, Alex Chisholm and Rebecca Sudworth, Civil Service Permanent Secretary Lead and Deputy Lead for Carers, provide an update on progress.   "
        },
        {
            "text": "Today marks the start of Carers Week 2023."
        },
        {
            "text": "In the Civil Service, around a fifth of our colleagues are carers. They combine work with looking after an elderly relative, a child with a disability or a friend who depends on their support. The aim of our five-year Carers’ Strategy. which we launched in 2020, is to enable them to succeed in both their roles."
        },
        {
            "text": "Today we are launching our third progress update. This sets out what we have achieved over the last year and our plans for the future."
        },
        {
            "heading": 4,
            "text": "Progress in 2022-23"
        },
        {
            "text": "In this ‘Year of Implementation’, we have focused on ensuring that carers, their managers and our leaders know how to access our products. These include the carer’s passport, the carer’s passport video, the carers’ charter and our line manager toolkit."
        },
        {
            "text": "Across the Civil Service, we have been running sessions to raise awareness of the line manager toolkit and the carer’s passport with hundreds of staff taking part."
        },
        {
            "text": "We have continued to support departments and agencies to achieve Carer Confident accreditation. This benchmarking scheme assists employers to build a supportive and inclusive workplace for staff who are carers. This year the Department for Environment, Food and Rural Affairs Group and the Food Standards Agency are newly accredited at Level 2. HM Revenue and Customs and the Ministry of Justice have renewed their Level 2 accreditation. Well done to the organisations which now have this recognition."
        },
        {
            "heading": 4,
            "text": "Forward priorities"
        },
        {
            "text": "Over the next two years, we will work to ensure that carers are able to access the support they need whether they work in a large department or a small agency."
        },
        {
            "text": "Our priorities include a focus on the emotional impact of caring and what more we can do to help people best cope. This will form part of our wider work to support staff wellbeing. We have also identified the need to ensure a greater awareness of the challenges faced by our young adult carers. It is important that everyone recognises that young people can have significant domestic responsibilities."
        },
        {
            "heading": 4,
            "text": "Supporting line managers"
        },
        {
            "text": "This year’s update contains examples of the good work being done in departments to build awareness in their line managers."
        },
        {
            "text": "If you are a manager of a carer, it is important to be as flexible as you can, to listen empathetically to the challenges they face and, when things change, to work with the carer to amend their carer’s passport. Look out for the line manager toolkit on your intranet."
        },
        {
            "text": "We are grateful to Helen Waterworth of the Crown Prosecution Service for sharing her thoughts on line managing a carer."
        },
        {
            "text": "If you are a carer, please reach out to your manager for support and look on your intranet for the resources available. There may also be events in your department for Carers’ Week that you could attend."
        }
    ]
}