{
    "url": "https://buyingforschools.blog.gov.uk/2023/06/05/free-funding-available-for-national-professional-qualifications-npqs-for-teachers-and-school-leaders/",
    "title": "Free funding available for National Professional Qualifications (NPQs) for teachers and school leaders",
    "authors": [
        "Alistair Guest, DfE’s NPQ Policy Unit"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2023-06-05T12:00:37+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Teachers are the foundation of the education system – there are no great schools without great teachers. Alistair Guest from the DfE’s NPQ Policy Unit talks to Dave Ellison-Lee, Director of Education at RISE multi-academy trust about his experience of the departments support for teachers and leaders to develop their expertise."
        },
        {
            "text": "The Department for Education is committed to ensuring teachers and leaders across the country have access to world-class professional development opportunities at every stage of their career and deliver improved outcomes for schools and young people."
        },
        {
            "text": "National Professional Qualifications (NPQs) are a national, voluntary suite of qualifications, designed to support the professional development of teachers and leaders and are one part of the recent reforms into teacher development and training. They support teachers to develop expertise in specialist areas of teaching practice and in school leadership."
        },
        {
            "text": "Since Autumn 2021, over 51,000 teachers and leaders have accessed a qualification. Through fully funded training scholarships, state-funded schools can currently access the qualifications at no cost to themselves. Primary and other small schools may be also eligible for additional grant funding to incentivise uptake of NPQs in 2023-24."
        },
        {
            "text": "Targeted support fund"
        },
        {
            "text": "The Targeted support fund provides £800 for each teacher in a state-funded primary school with 150 or fewer pupils who starts an NPQ in 2023/24. For primary schools with more than 150 pupils and for secondary schools and 16-19 organisations with 1 to 600 pupils a £200 grant payment per teacher who starts an NPQ next academic year is available."
        },
        {
            "text": "Dave Ellison-Lee, Director of Education at RISE multi-academy trust, explains why your school should take advantage of the funded qualifications and additional funding available."
        },
        {
            "text": "One of the most effective ways to raise pupil outcomes is through effective teacher professional development, and the fully funded NPQs mean that more of our teachers and leaders than ever before can access the qualifications."
        },
        {
            "text": "We are seizing this opportunity to supplement our trust-wide learning offer as we want a network of professionals who are engaged in consistent, high-quality development opportunities, and the impact of those who have participated in the NPQs so far is evident at both school and trust level."
        },
        {
            "text": "NPQs have been designed using the latest evidence and programmes are delivered asynchronously and virtually so staff can complete them around their responsibilities. The final assessment has also been updated to make it more manageable, whilst maintaining academic rigor. "
        },
        {
            "text": "The fact that the qualifications are quality assured by experts from across the sector gives trustees confidence that we are investing our time and resources wisely, whilst also helping staff to feel confident that their knowledge and skills are rooted in what works in the classroom. By introducing greater specialism into our schools, we can accelerate school improvement across the trust through a consistent approach to teaching, learning and assessment, whilst supporting the career aspirations of our staff."
        },
        {
            "text": "Schools should absolutely engage with NPQs. In addition to supporting the development of your school, the huge amount of funding and support attached to the qualifications is unprecedented and means that training does not impact budgets hugely."
        },
        {
            "text": "We want to encourage all School Business Professionals, their leadership teams and governing bodies to discuss NPQs, to look at where and how they can support CPD within their school. Guidance is available on GOV.UK - NPQ targeted support funding: conditions of grant for the 2023 to 2024 academic year."
        },
        {
            "text": "To find out more about how the teachers and leaders at your school can access NPQs, visit GOV.UK: https://bit.ly/B4SNPQ"
        },
        {
            "text": "On 13 June 2023 the Schools Commercial Team are hosting a webinar to give you all the information you need about NPQs for the teachers and leaders in your school. You can sign up now for more details and a chance to ask questions."
        }
    ]
}