{
    "url": "https://valuationoffice.blog.gov.uk/2023/06/05/how-properties-are-valued-for-council-tax/",
    "title": "How properties are valued for Council Tax",
    "authors": [
        "Richie Roberts - Council Tax Customer Journey Owner"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2023-06-05T14:13:08+01:00",
    "content": [
        {
            "text": "Council Tax bands are based on the open market value of a property - the price a home could have been sold for - at a fixed point in time. "
        },
        {
            "text": "This is known as the antecedent valuation date (AVD). The date used is set in law, and it’s different in England and Wales. "
        },
        {
            "text": "Each Council Tax band covers a range of property values. This is why homes of different values are placed in the same band. For example, band C in England will be given to properties which would have sold for £52,001 to £68,000 on the AVD. "
        },
        {
            "text": "We consider three types of evidence when working out Council Tax bands – sales, banding and settlement evidence. In this blog, we’ll look at each type of evidence and how it helps us make decisions and the weighting (that is, the relative importance) we give to each type of evidence. "
        },
        {
            "text": "Sales evidence "
        },
        {
            "text": "To decide which Council Tax band is right for a property, we first look at the price properties actually sold for around the AVD. This is called sales evidence. "
        },
        {
            "text": "Sales evidence is the most reliable form of evidence, and we give the most weight to it. "
        },
        {
            "text": "Our starting point is to find sales evidence on the ‘subject’ property (the property we’re allocating the band to). The sale must have been close to the AVD – 1991 in England and 2003 in Wales – for us to be able to use it as evidence. If this is not available, we then look at how much other properties in the area sold for at that time. These properties do not need to be exactly the same as the subject property, but they must be similar enough for us to compare. "
        },
        {
            "text": "We compare each sale to the subject property, adjusting the price to reflect differences like size and location. This helps us to work out the value of the subject property, which then determines its Council Tax band. "
        },
        {
            "text": "We do not consider house price data from free house price or house price index websites as a good form of valuation evidence. "
        },
        {
            "text": "This is because price indexing tools can be unreliable as they generally use data from wide geographic areas and draw on a wide range of different property types and recent sales prices. "
        },
        {
            "text": "This means that they do not give an accurate estimate of the open market value of a property as at the AVD.   "
        },
        {
            "text": "Banding evidence "
        },
        {
            "text": "We always try to find sales evidence first, as this gives the closest estimate of the price a home could have been sold for. But if we’re valuing a new property, it will not exist. In these cases, we look at banding evidence. "
        },
        {
            "text": "As all properties are valued at the same date, we consider the bands already allocated to similar properties. This helps us to understand the pattern of banding for properties in the area and ensure that the band we apply is consistent with others. "
        },
        {
            "text": "Settlement evidence "
        },
        {
            "text": "When we look at the bands of similar properties, we give more weight to those that have been challenged and a decision has been made to change the band (this is what we mean by settlement). "
        },
        {
            "text": "This is because our initial decisions are tested during the challenge process, so the resulting Council Tax band carries more weight than a band that has never been challenged. "
        },
        {
            "text": "We give the most weight to decisions made at Valuation Tribunal. "
        },
        {
            "text": "At a Tribunal, an independent panel considers all available evidence before deciding on the right band for a property. The panel also looks at previous valuation decisions. "
        },
        {
            "text": "Next are Council Tax bands that have been settled through an agreement. This is when a challenge or proposal has been made, and we have agreed a change to a band. "
        },
        {
            "text": "If similar properties have had their challenges withdrawn or we haven’t changed the band following a decision, then we’ll also consider this in our assessment.  "
        }
    ]
}