{
    "url": "https://prisonjobs.blog.gov.uk/2023/06/05/leading-with-pride/",
    "title": "Leading with Pride",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Culture",
        "Personal stories"
    ],
    "pub_date": "2023-06-05T17:25:26+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Officer Upton has been working as a prison officer for a year. He spoke to us for Pride month about his career in the Prison Service and how he is proud to lead Pride in Prison and Probation (PiPP) – a support network for LGBT+ staff and allies.  "
        },
        {
            "text": "What’s it like working in the Prison Service?"
        },
        {
            "text": "There’s a real sense of camaraderie in the Prison Service – it’s like a family.  "
        },
        {
            "text": "Everyone has a role to play in the team and they make you feel welcomed. I have received lots of support and encouragement from colleagues to advance and progress in my career. I joined the service as an Operational Support Grade before applying for promotion and becoming a prison officer.  "
        },
        {
            "text": "The work in prison is hugely varied, and no two days are the same. It’s not like a 9 to 5 job.   "
        },
        {
            "text": "What are some of the most challenging aspects of the role? "
        },
        {
            "text": "As a prison officer, you can face hostility from prisoners, and anything can happen, but your colleagues look out and support you. "
        },
        {
            "text": "You need good judgement and the courage to hold yourself accountable for decisions so you can act confidently in the moment. Situations can quickly change so you need to think and act quickly too. You receive lots of training and support in the prison for these situations. "
        },
        {
            "text": "As a prison officer, you also learn that having a voice is much more effective than physical characteristics – it’s the best tool in your arsenal.  "
        },
        {
            "text": "Tell us about your work supporting the LGBT+ community in your role?"
        },
        {
            "text": "I lead the Pride in Prison and Probation support network for LGBT+ staff.   "
        },
        {
            "text": "The network supports staff and promotes that anyone can work in the Prison Service. There are loads of people from the LGBT+ community that work for HMPPS. Working here, you can be yourself, and I find my colleagues respect those who follow different paths. "
        },
        {
            "text": "I’m very passionate about my work on the network. I believe it contributes to a happier and more effective workplace. A lot of my colleagues have said as much to me too.   "
        },
        {
            "text": "It’s great to go to Pride events and hear what people say about the service and use that to improve what we do.   "
        },
        {
            "text": "What did you do before joining the Prison Service? "
        },
        {
            "text": "I was a professional dancer working on cruise ships, travelling, and entertaining people all over the world. "
        },
        {
            "text": "It might seem like a leap to go on to join the Prison Service, but it’s more about having a particular skill set. As a prison officer you need to be confident, a good communicator and someone who enjoys working with people. "
        },
        {
            "text": "What would you say to anyone considering joining the Prison Service? "
        },
        {
            "text": "If you are interested in our work and you want to make a difference to people’s lives, just go for it. There are lots of opportunities in the service. Even if the prison officer role isn’t for you, there are so many roles within the service that need a whole variety of different skill sets. There really is something for everyone.  "
        },
        {
            "text": " "
        }
    ]
}