{
    "url": "https://lifeathmrc.blog.gov.uk/2023/06/05/volunteers-week-2023-volunteering-and-outreach-team/",
    "title": "Volunteers Week 2023: Volunteering and Outreach team",
    "authors": [
        "Rachel"
    ],
    "categories": [
        "General",
        "Volunteering"
    ],
    "pub_date": "2023-06-05T07:32:53+00:00",
    "content": [
        {
            "text": "As part of Volunteers Week 2023, we caught up with Rachel from the Volunteering and Outreach team to learn more about the work the team do and the volunteering opportunities available across HMRC."
        },
        {
            "heading": 2,
            "text": "Volunteering at HMRC"
        },
        {
            "text": "I’m Rachel, I’m part of HMRC’s Volunteering and Outreach team (V&O) in the North East. We’re a small team who are all involved in volunteering and outreach activity on top of our day jobs as it’s something we’re really passionate about."
        },
        {
            "text": "HMRC supports volunteering in local communities to help develop transferable skills and experience and form a more connected regional presence. In the North East, our primary focus is on working with education providers and community groups. We want to showcase HMRC as a great place to work, with lots of fantastic career opportunities to offer, so we can influence people's career choices and attract great talent. For our 300+ volunteers, getting out into the community is a great way to improve confidence, build capability and meet new people, all while benefitting the local area."
        },
        {
            "heading": 2,
            "text": "My role within the team"
        },
        {
            "text": "My role within the team is to engage with local education providers and community groups to build relationships and seek out volunteering opportunities for our network of volunteers. We work with universities, colleges, schools and charities to build employment-related skills and capability – such as interviewing and networking – to help people make informed choices and to prepare them so they’re in the best possible position to apply for roles at HMRC. We also host regular webinars to let people know about vacancies we have available and what it’s really like to work for HMRC, which isn’t as scary or as daunting as some people may think!"
        },
        {
            "text": "We are usually inundated with requests from education providers and groups across the whole of the North East, and we’re often asked to support careers events, jobs fairs and mock interviews, to give talks and presentations, to participate in speed-networking events and to give tailored support to minority groups (mentoring, coaching etc). We also reach out to education providers to offer to run our Tax Facts programme which aims to help young people understand more about the tax system and the role of HMRC in society. It’s an award-winning programme which aims to educate the taxpayers of the future."
        },
        {
            "heading": 2,
            "text": "What have I learned?"
        },
        {
            "text": "On a personal level, I’ve attended a number of events on behalf of HMRC over the last few years and I’ve thoroughly enjoyed getting involved in the V&O network. It’s helped me to build confidence and new skills and I’ve worked with some fantastic people I probably wouldn’t have crossed paths with otherwise. Recently, we visited the Newcastle United Foundation’s new HQ to talk about how we can work together to support people across our region which was, as a lifelong Newcastle fan, very exciting! It was great to learn more about the charitable work they do and explore opportunities for future collaboration."
        },
        {
            "text": "Getting involved in volunteering is very rewarding and it always feel like a really good use of time. It’s brilliant to be able to give something back and to help to create opportunities for others. I love being able to break down barriers between HMRC and the local community and to help change people’s perceptions of what we’re all about. When I talk about HMRC as a great place to work, I really mean it."
        },
        {
            "text": "HMRC supports volunteering by giving volunteers up to 5 days of paid time off each year. The North East V&O team also gives bespoke support to individual volunteers, to help prepare them for the event they’ll be attending on behalf of the department. There are Volunteering & Outreach Leads in every region of HMRC who will support anyone who’s interested in taking the first steps to getting involved. We’re always looking for more volunteers in the North East and I’d encourage anyone – regardless of role, grade or experience to give it a go."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "To find out more about what it’s like to work at HMRC, including our benefits, culture and values, take a look at our careers website."
        }
    ]
}