{
    "url": "https://healthmedia.blog.gov.uk/2023/09/04/accessing-wegovy-for-weight-loss-everything-you-need-to-know/",
    "title": "Accessing Wegovy for weight loss: Everything you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-09-04T11:36:10+01:00",
    "content": [
        {
            "text": "Semaglutide (Wegovy) launched in the UK on 4 September and is available on the NHS as an option for weight management in line with NICE guidance, alongside a reduced-calorie diet and increased physical activity."
        },
        {
            "text": "Patients are eligible for treatment within a specialist weight management service if they have at least one weight-related comorbidity, such as hypertension or cardiovascular disease, and either a BMI of at least 35 or a BMI of 30 to 34.9, provided they meet the criteria for referral to specialist weight management services,  including that conventional treatment has been unsuccessful."
        },
        {
            "text": "NICE’s guidance on Semaglutide for managing overweight and obesity can be found here:  Overview | Semaglutide for managing overweight and obesity | Guidance | NICE"
        },
        {
            "text": "Here's everything that you need to know:"
        },
        {
            "heading": 2,
            "text": "What is Wegovy and how does it differ from Ozempic?"
        },
        {
            "heading": 2,
            "text": "Who is eligible for Wegovy on the NHS?"
        },
        {
            "heading": 2,
            "text": "How can I access Wegovy on the NHS?"
        },
        {
            "heading": 2,
            "text": "Can I get Wegovy privately?"
        },
        {
            "heading": 2,
            "text": "Can I get Wegovy through the pilot the Prime Minister announced?"
        },
        {
            "heading": 2,
            "text": "Are there supply issues for weight loss medicines?"
        },
        {
            "heading": 2,
            "text": "  What about receiving treatment digitally?"
        }
    ]
}