{
    "url": "https://hmlandregistry.blog.gov.uk/2023/09/04/fast-efficient-resilient-land-registration-fit-for-one-of-the-worlds-most-valuable-property-markets/",
    "title": "Fast : Efficient : Resilient – land registration fit for one of the world’s most valuable property markets",
    "authors": [
        "Mike Harlow, Deputy Chief Executive and Director of Customer and Strategy"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2023-09-04T13:29:50+01:00",
    "content": [
        {
            "text": "Our priority at the moment is to reduce the time taken to register changes in ownership. Our expedite service helps us to prioritise your urgent work, but we know how our processing times are impacting conveyancers."
        },
        {
            "text": "However, this is not a new problem for us or for other land registries. Whenever there has been a housing market bubble, we have to quickly process more cases. While we can hire more people it takes time to train them up."
        },
        {
            "text": "Some other land registries have worked with their markets to find a more efficient and resilient digital approach. We have developed an approach to do away with these cyclical strains, based on these countries’ success. We are determined that this will be the last time this happens."
        },
        {
            "heading": 2,
            "text": "A bright future"
        },
        {
            "text": "Most of the applications we receive are to register simple changes in ownership and mortgages. The great majority of these cases can be automated – processed immediately upon submission, without any requisitions (further questions on the application)."
        },
        {
            "text": "All other ownership changes would also be more efficiently processed, just with greatly reduced requisitions. Maybe none at all."
        },
        {
            "text": "Our caseworkers who currently work on these simpler cases could then join those working on our more ‘complex’ cases, such as first registrations or new leases. So they would also be processed more quickly."
        },
        {
            "text": "The benefits will be stark, post-completion admin will be greatly reduced for everyone and the history of speed of service problems once every decade or so will be at an end."
        },
        {
            "text": "We’ve already seen this with our information services. We automated most of them years ago and they were barely impacted by the surge in market activity of the last few years."
        },
        {
            "text": "Working together we can start to feel those benefits across the rest of our services quite quickly, particularly if we look at the system overall and not just our individual part in it."
        },
        {
            "text": "And I am confident we can do this because of the comparable examples elsewhere in the world, such as in Australia, Canada and parts of Europe. In New Zealand they were able to eliminate all but the most technical of requisitions, moving to instantaneous processing of 87% of previously manual cases. There are obviously differences in property law between here and there, but not that make a material difference to the opportunity to improve the process."
        },
        {
            "heading": 2,
            "text": "What we need to do"
        },
        {
            "text": "In general principle, a land registration decision is quite simple. We need to know a number of facts about a property transaction. Get those facts straight, then, in most cases, the registration decision is routine – formulaic – and therefore capable of automation."
        },
        {
            "text": "The hard bit is getting the facts straight. Or is it?"
        },
        {
            "text": "As a one-time property lawyer, I know how careful everyone is in getting the facts straight for completion day. Does the transfer say all the right things; has it been properly executed; have restrictions been met; has everyone been properly identified; can the money be handed over, and so on? There is a lot of effort in getting to that confident clarity that all can go ahead."
        },
        {
            "text": "If all those ‘completion facts’ can simply be taken and transmitted reliably to HM Land Registry then so much becomes easier and faster for everyone. That’s the aim."
        },
        {
            "text": "What we currently do is add in steps to that transmission: an application process; attaching deeds that also describe the transaction; requisitions; handling by different people. This leads to the possibility of gaps, inconsistencies, errors, loss of complete confidence, duplicated effort and wasted time and cost."
        },
        {
            "text": "We are going to bridge that gap in a number of ways."
        },
        {
            "text": "First, we are going to redouble our efforts to eradicate the simple errors – the admin slips. We all make minor mistakes sometimes."
        },
        {
            "text": "Our application systems can check certain things against both the register and what is written in the transfer or mortgage. We are already seeing a huge reduction in some errors through our Digital Registration Service on the HM Land Registry portal. Our internal systems – our application processing engine – will check other elements against the register, in much the same way caseworkers currently do."
        },
        {
            "text": "And we can improve our help to applicants. We are working through our registration requirements, so they are no more and no less than what is required for efficient and secure land ownership in a digital age. We also plan to make our guidance more accessible to everyone so that it is able to respond to your particular question in the moment."
        },
        {
            "text": "Second, we need assurance that the ‘completion facts’ that our systems cannot validate are correct. The sort of confirmation can only come from those who know – those who were worrying about just those things at completion."
        },
        {
            "text": "Being given that assurance by a regulated professional means we don’t have to double up in checking those things ourselves. It is not a change in the roles of the conveyancer and HM Land Registry. They tell us what happened and HM Land Registry decides how to register the transaction. It is just the most effective way of putting HM Land Registry in the position to make a secure decision, without an unnecessary to-and-fro."
        },
        {
            "text": "We know that this assurance process will only be a success if the new system works for conveyancers and the tech companies that support them. So we have been working in a pilot with a few high-volume firms: Enact, Eversheds Sutherland, Optima and O’Neill Patient. Thanks to them we have learned a lot about what would work and what might not work, and we’ve taken all their feedback on board as we continue to design the process whilst working with the grain of conveyancing practice. We’ll bring you more on that in another blog post soon, including on how lawyers and PropTech (property technology) businesses can get involved in its development as we continue and expand our tests."
        },
        {
            "text": "This is the future of land registration, as it has been in those other countries. Doing it well in England and Wales will take patient collaboration between HM Land Registry and its customers."
        },
        {
            "text": "With your help we can create something that benefits all property owners and lenders – a system fit for one of the world’s most valuable and important property markets."
        }
    ]
}