{
    "url": "https://educationhub.blog.gov.uk/2023/09/04/new-guidance-on-raac-in-education-settings/",
    "title": "Everything you need to know about the new guidance on RAAC in education settings",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School building",
        "Schools"
    ],
    "pub_date": "2023-09-04T16:30:03+01:00",
    "content": [
        {
            "text": "Nothing is more important than the health and safety of children and staff. This is why we’ve announced a change in our approach to managing a building material found in some school buildings and other education settings, known as Reinforced Autoclaved Aerated Concrete (RAAC)."
        },
        {
            "text": "We have been proactively monitoring all confirmed cases of RAAC closely. Recent cases have led to a loss of confidence in buildings containing the material, leading us to advise education settings (schools, colleges and maintained nursery schools) to vacate all spaces or buildings that are known to contain RAAC, unless they already have mitigations in place to make the building safe. We’re working hard to make sure any disruption to education is kept to a minimum."
        },
        {
            "text": "The vast majority of schools will be unaffected. Your child should attend school as normal in September, unless you hear differently."
        },
        {
            "text": "We have spoken to the education settings that are impacted and all of them will now be contacted by a dedicated caseworker who will support them through each step of this process."
        },
        {
            "text": "Here’s everything you need to know about RAAC, and how we’re supporting schools, colleges and nurseries across the country to manage it safely."
        },
        {
            "heading": 3,
            "text": "What is RAAC?  "
        },
        {
            "text": "RAAC is a lightweight form of concrete. The Standing Committee on Structural Safety (SCOSS) has noted that: \"Although called “concrete”, (RAAC) is very different from traditional concrete and, because of the way in which it was made, much weaker. "
        },
        {
            "text": "\"RAAC was used in schools, colleges and other building construction from the 1950s until the mid-1990s. It may therefore be found in any school and college building (educational and ancillary) that was either built or modified in this time period.\" "
        },
        {
            "heading": 3,
            "text": "How and why has the way you deal with RAAC changed?  "
        },
        {
            "text": "We have been helping schools and responsible bodies (such as local authorities and multi-academy trusts) to manage the potential risks of RAAC since 2018 by providing guidance and funding."
        },
        {
            "text": "However, new cases have made us less confident that buildings containing RAAC should remain open without extra safety measures in place."
        },
        {
            "text": "As a result, we’re changing our approach and advising education settings to close any spaces or buildings that are known to contain RAAC to allow them to put mitigations in place. This is a precautionary step, but the safety of young people and staff is always our priority."
        },
        {
            "text": "To minimise any disruption, all education settings with confirmed RAAC will be supported by a dedicated caseworker to help them through any necessary changes."
        },
        {
            "heading": 3,
            "text": "Why have you done this now? "
        },
        {
            "text": "The Government has been aware of public sector buildings that contain RAAC since 1994 and we have been monitoring their condition since 2018. We continually assess new information and research about RAAC to ensure the safety of schools and pupils."
        },
        {
            "text": "In 2022, the Department for Education sent a questionnaire to all responsible bodies, asking them to provide information to help us understand the use of RAAC across the school estate and make sure the correct support is in place."
        },
        {
            "text": "Recent cases have now changed our assessment of the risk that RAAC poses to building safety."
        },
        {
            "text": "We are taking immediate steps to ensure the safety of staff and pupils in line with this."
        },
        {
            "text": "Responsible bodies should continue to come forward with information, using the questionnaire, so we can help them to identify and manage RAAC."
        },
        {
            "heading": 3,
            "text": "How many schools are affected by RAAC and will all of them need to close? "
        },
        {
            "text": "There are over 22,000 schools and colleges and less than 1% are known to be affected."
        },
        {
            "text": "And no – not all schools affected by RAAC need to close."
        },
        {
            "text": "Just over 50 settings have already been supported to put mitigations in place this year, including through additional funding for temporary accommodation, and all children are receiving face to face learning."
        },
        {
            "text": "Last week, we contacted all 104 further settings where RAAC is currently confirmed to be present without mitigations in place, to ask them to vacate spaces or buildings that are known to contain RAAC."
        },
        {
            "text": "The impact of RAAC is varied – some settings may have very little RAAC present with limited disruption as a result. For example, this change in approach could lead to the temporary closure of one school space, like a single classroom. In most cases, children will be able to continue attending school as normal."
        },
        {
            "text": "A significant proportion of the school estate was built outside the period where RAAC was used so we have focused our efforts on buildings built in the post-war decades – 31% of our buildings were built since 2001."
        },
        {
            "text": "When we made our announcement, over 90% of the responsible bodies with buildings in the decades where RAAC was used had replied to our questionnaire."
        },
        {
            "heading": 3,
            "text": "How are you supporting schools and education settings where RAAC is present? "
        },
        {
            "text": "Most education settings will be unaffected by this change in approach.  "
        },
        {
            "text": "For those settings that are affected, we’re working to make sure there is minimal disruption to education and the vast majority will remain open for face-to-face learning from the start of term.  "
        },
        {
            "text": "All settings known to contain RAAC will be assigned a dedicated DfE caseworker who will work with the responsible body to assess the site’s particular needs and help them put in place individual solutions.  "
        },
        {
            "text": "This could include using other on-site buildings, local spaces, safety measures in the affected area and, in some cases, erecting temporary buildings.  "
        },
        {
            "text": "We have also published further guidance for schools and colleges on identifying and managing RAAC. This will set out how the department will provide support and capital funding to schools and other settings so that face-to-face education continues safely.  "
        },
        {
            "heading": 3,
            "text": "How will this be funded?  "
        },
        {
            "text": "We will do whatever it takes to keep children safe."
        },
        {
            "text": "This includes paying for the emergency mitigation work needed to make buildings safe, including alternative classroom space where necessary."
        },
        {
            "text": "Where schools need additional help with revenue costs like transport to other locations, we will work with every school affected to put appropriate support in place."
        },
        {
            "text": "We will then also fund the longer-term refurbishment or rebuilding projects where these are needed to rectify the RAAC issue in the longer term."
        },
        {
            "heading": 3,
            "text": "What should schools and other education settings do if they are worried about RAAC? "
        },
        {
            "text": "If they haven’t already, responsible bodies should fill out our questionnaire on RAAC at this link.  "
        },
        {
            "text": "Based on the answers given, settings with suspected RAAC will be brought forward for surveying. We hope to have all schools currently suspected as containing RAAC surveyed in a matter of weeks.  "
        },
        {
            "text": "If RAAC is confirmed, we will ensure appropriate rapid action is taken. This could include providing funding to remove any immediate risks and, where necessary, arranging temporary buildings to be put in place.   "
        },
        {
            "heading": 3,
            "text": "What about other education settings like colleges? Are they also at risk from RAAC? "
        },
        {
            "text": "The change in guidance covers state-funded educational settings, responsible bodies for maintained nursery schools and colleges should fill out the same questionnaire as schools so they can get the support they need. "
        },
        {
            "heading": 3,
            "text": "Is my child’s school closing because of RAAC and how can I find out the latest information? "
        },
        {
            "text": "Schools and other education settings will let you know directly if there is any change to the start of term. "
        },
        {
            "text": "Most schools will be unaffected, and children should attend school as normal in September, unless you hear differently. "
        },
        {
            "heading": 3,
            "text": "Where can I find a list of schools affected by RAAC?"
        },
        {
            "text": "We are waiting for schools to reach out to parents and we think it is important parents hear from the schools themselves rather than the media if this is going to impact them."
        },
        {
            "text": "It’s also important that we give schools time to focus on putting mitigations in space."
        },
        {
            "text": "We will publish a list of schools affected by RAAC later this week on Gov.uk."
        },
        {
            "heading": 3,
            "text": "How do I know whether my child’s school has been surveyed?"
        },
        {
            "text": "We have already carried out surveys at over 600 schools, colleges and nurseries. The remaining buildings that are suspected to have RAAC and have completed the questionnaire but have not yet been inspected will receive that inspection imminently."
        },
        {
            "text": "We are still waiting for some schools to respond to our questionnaire, which may identify more schools that are at risk due to RAAC. However, we expect the number of schools affected to be in the hundreds, not thousands"
        },
        {
            "text": "Parents unsure about whether their child’s school has undergone a RAAC survey should contact their school directly."
        },
        {
            "heading": 3,
            "text": "What if there is asbestos present in a school where RAAC is found? "
        },
        {
            "text": "Asbestos management in schools is regulated by the Health and Safety Executive (HSE) and we follow its expert advice. The HSE advises that, as long as materials are in good condition, well protected, and unlikely to be damaged or disturbed, it is usually safer to manage them in place."
        },
        {
            "text": "However, if the asbestos is found to be at a significant risk of disturbance or accidental damage and it’s not safe to leave where it is, it is the duty holder’s responsibility to make sure it is removed by a trained specialist."
        },
        {
            "text": "For when RAAC is not immediately visible, our guidance is clear that schools should consult guidance about managing asbestos and the building’s asbestos register before looking behind ceilings or finishes to assess whether RAAC is present."
        },
        {
            "text": "Asbestos may need to be removed before RAAC remediation can take place."
        },
        {
            "heading": 3,
            "text": "Is it safe for children to go to school?"
        },
        {
            "text": "Yes, unless advised by their school, children should be in school."
        },
        {
            "text": "We will always put the safety of children and staff first which why we are taking action now to mitigate RAAC found in older school buildings."
        },
        {
            "text": "It has always been the case that if the Department is made aware of a building that poses a safety risk, we will take immediate action to ensure safety and mitigate the situation."
        },
        {
            "heading": 3,
            "text": "How are you keeping school buildings safe? "
        },
        {
            "text": "We have given over £15 billion since 2015 to keep schools in good working order, including £1.8 billion committed for 2023-24. "
        },
        {
            "text": "We are also investing in 500 projects for new and refurbished school buildings through our School Rebuilding Programme.  "
        },
        {
            "text": "Our approach with this investment is working. Over 95% of school building elements surveyed between 2017 and 2019 were in good or satisfactory condition (condition grade A or B). Only a very small percentage (0.3%) of building components needed replacing straight away (Grade D). "
        },
        {
            "text": "You can read more about how we’re keeping school building’s safe on the Education Hub."
        },
        {
            "text": "This article was first published on 31 August and has been updated to reflect the latest information. "
        }
    ]
}