{
    "url": "https://defrafarming.blog.gov.uk/2023/09/04/protecting-hedgerows-consultation-closes-soon/",
    "title": "Protecting hedgerows: consultation closes soon",
    "authors": [
        "Leanne Joyce"
    ],
    "categories": [
        "Ways to get involved"
    ],
    "pub_date": "2023-09-04T12:03:56+01:00",
    "content": [
        {
            "text": "In June, we launched a consultation on hedgerow protections in England. "
        },
        {
            "text": "Hedgerows are a vital feature of the English countryside. Among their many benefits, they create habitats, support crop pollinators and store carbon. "
        },
        {
            "text": "We want to preserve the hedges we have, invest in their maintenance and support further planting. "
        },
        {
            "text": "Since the consultation opened, around 2,000 of you have shared your views.  "
        },
        {
            "text": "With 2 weeks to go before the consultation closes, I wanted to remind you that there’s still time for you to help shape future regulations so that they work for wildlife, the environment and farmers. "
        },
        {
            "heading": 2,
            "text": "The consultation "
        },
        {
            "text": "We want your views on maintaining and improving current hedgerow management rules, our approach to enforcing these, and what future hedgerow policy could look like. "
        },
        {
            "text": "Currently, farmers must not remove important hedgerows, must not cut or trim hedgerows during bird nesting and rearing season, and must maintain a buffer strip along their hedgerows. "
        },
        {
            "text": "We’re seeking feedback on our proposal to replicate the following measures in domestic law: "
        },
        {
            "text": "We’d also like your opinion on a proposal to introduce civil sanctions (non-criminal penalties and notices) for enforcing these measures. "
        },
        {
            "text": "Everything is set out in the consultation, linked at the very end of this post.  "
        },
        {
            "heading": 2,
            "text": "Contribute now "
        },
        {
            "text": "The consultation closes on 20 September. "
        },
        {
            "text": "We want everyone who cares about hedgerows to respond: from farmers and stakeholder organisations, to members of the public. "
        },
        {
            "text": "Please note that blog comments aren’t recorded in the official consultation, so please make sure to contribute using the link below. "
        },
        {
            "text": "Share your views on hedgerow protections in England."
        }
    ]
}