{
    "url": "https://educationinspection.blog.gov.uk/2023/09/04/school-inspection-update-september-2023-changes-to-how-we-inspect-schools/",
    "title": "School inspection update September 2023 - changes to how we inspect schools",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Education"
    ],
    "categories": [
        "education inspection framework",
        "inspection",
        "schools"
    ],
    "pub_date": "2023-09-04T10:10:58+01:00",
    "content": [
        {
            "text": "With pupils and teachers now returning to school for a new academic year, this blog gives an overview of some of the recent changes to the school inspection handbook and the way we inspect schools."
        },
        {
            "text": "In June 2023, we committed to making a number of changes to the way we inspect and report, including around safeguarding. We’ve now updated our guidance and reports to reflect these changes. We’ve also:"
        },
        {
            "text": "And we’ve made some updates to other areas, which this blog will outline."
        },
        {
            "heading": 3,
            "text": "Safeguarding"
        },
        {
            "text": "We want to make sure that our judgements around safeguarding are well understood. To help with this, we have:"
        },
        {
            "heading": 4,
            "text": "Culture of safeguarding"
        },
        {
            "text": "We have brought the references to schools having a safeguarding ‘culture’ into a single clear definition. It explains how we will evaluate this during an inspection. The definition makes clear that we expect all schools to have an open and positive culture around safeguarding that puts pupils’ interests first and protects them from serious harm."
        },
        {
            "heading": 4,
            "text": "Schools that require minor safeguarding improvements"
        },
        {
            "text": "We have also added more clarity on what we mean when we say that schools need to make minor safeguarding improvements. Minor improvements are only things that do not have an immediate impact on the safety of pupils. This could include administrative errors in paperwork or out-of-date policies."
        },
        {
            "text": "Schools may be able to make minor safeguarding improvements before the end of their inspection. If they cannot, provided they have taken steps to resolve the issue, safeguarding can still be judged effective. If minor safeguarding improvements are identified, this will not stop a school being judged good or outstanding."
        },
        {
            "heading": 4,
            "text": "Early monitoring inspections"
        },
        {
            "text": "For the small number of schools judged inadequate due to ineffective safeguarding alone, we will return for a monitoring inspection within 3 months. The process will broadly follow other monitoring inspections but will focus on whether safeguarding is now effective. If the school has resolved the safeguarding concerns, its overall grade is likely to improve."
        },
        {
            "heading": 3,
            "text": "Leadership and governance"
        },
        {
            "text": "Throughout the handbook, we have clarified what we mean when we refer to leaders in maintained schools and academies. For the purpose of inspection, leaders are those responsible for making decisions about how the school operates, including decisions relating to behaviour and the curriculum. This always includes the headteacher and other senior staff. For an academy, it includes leaders at a trust level as well."
        },
        {
            "text": "Where a school is part of a trust, the board of trustees is legally responsible for governance. Inspectors must, in most cases, speak to the chair and other trustees as well as trust employees. This can be done face-to-face or on a video call. Who else inspectors meet with will depend on the trust the academy is part of and will be decided following a discussion with leaders."
        },
        {
            "heading": 3,
            "text": "Quality of education"
        },
        {
            "text": "We have clarified who may participate in inspection activities, such as deep dives. For subject discussions, lesson visits and work scrutiny, middle leaders may be accompanied by a colleague, as long as this does not prevent them from participating fully in the discussion. Inspectors will also typically meet groups of pupils without school staff present, so that pupils can speak freely. There will also be the opportunity for staff to speak freely to inspectors without senior colleagues being in the room."
        },
        {
            "heading": 3,
            "text": "Attendance and behaviour "
        },
        {
            "text": "As the school year starts, attendance is particularly important so that all pupils benefit from the education and experiences that school provides. We have included new sections setting out how inspectors will evaluate attendance and behaviour, while recognising that the context in which schools operate has changed since the pandemic. We understand that schools cannot be everything to everyone, but we expect schools to do all they reasonably can to improve attendance and behaviour. We will look at a school’s capacity to improve and have defined what we mean by this."
        },
        {
            "heading": 3,
            "text": "Other updates to our guidance"
        },
        {
            "text": "We have made several other, smaller updates to our guidance that school leaders may want to know about. We have:"
        },
        {
            "text": "If you would like to learn more about these changes, we will be holding a school inspection update webinar on 11 September 2023. This forms part of a wider webinars for schools’ series for the autumn term, with further information and registration available via the link."
        },
        {
            "text": "We wish you the very best for the year ahead and thank you for all your work."
        }
    ]
}