{
    "url": "https://digitaltrade.blog.gov.uk/2023/09/04/women-in-tech-closing-the-gender-gap-in-ddat-dbt/",
    "title": "Women in Tech: closing the gender gap in DDaT DBT",
    "authors": [
        "Hannah Horn, Senior Engagement and Strategic Adoption Manager",
        "Imogen Barker, Engagement and Strategic Adoption Manager",
        "Liz Catherall, Delivery Manager",
        "Georgia Defeo, Head of DDaT Recruitment",
        "Jason Kitcat, DDaT Director"
    ],
    "categories": [
        "People",
        "Professions"
    ],
    "pub_date": "2023-09-04T13:56:15+01:00",
    "content": [
        {
            "text": "LinkedIn reported that only 19% of UK tech workers are women and women hold only 5% of leadership positions in the tech industry. The Digital, Data and Technology directorate (DDaT) in the Department for Business and Trade (DBT) aims to help close the gender gap by attracting and supporting women in the tech sector to develop their careers in DBT. With a majority female leadership team, DDaT is paving the way to diversifying the tech industry and closing the pay gap by supporting and developing women at all stages of their career in the industry."
        },
        {
            "text": "Imogen Barker, Product Adoption Manager"
        },
        {
            "text": "‘Joining DDaT this time last year I quickly noticed the strong female leadership within the directorate. I remember instantly feeling proud to be part of a department that showcases women in senior roles. Working in the tech profession has been a complete career change for me. Although I did not have previous tech experience, I have never felt disadvantaged. I feel well supported by my team and I am amazed at the wide range of learning and development opportunities offered within DDaT. Recently, I have been fortunate enough to deliver some great product adoption campaigns promoting the use of tech products created by DDaT. I am thankful to work in a department that prioritises self-development alongside career progression.’"
        },
        {
            "heading": 2,
            "text": "Women in Tech Employer Awards"
        },
        {
            "text": "The 2023 Women in Tech Employer Awards celebrates individuals and employers going above and beyond to help close the gender gap within the tech sector. DBT has been nominated for 2 consecutive years for the award of Best Public Sector Employer."
        },
        {
            "text": "DDaT were invited to attend the awards night, which allowed us to celebrate the work and success of many of our DDaT colleagues. We also had the opportunity to network, share ideas with other employers who were nominated and reflect on how we can improve our diversity, inclusion and development in the future."
        },
        {
            "text": "Liz Catherall, Head of Agile Delivery"
        },
        {
            "text": "'Attending the Women in Tech awards was quite an inspiration. I looked around the room and saw a diverse group of women supporting women; there was vunerability that was embraced as stories were shared and where people were being themselves. It was clear that strong relationships had been forged by those in the room - supporting growth, diversity and inclusion. I was proud to be sitting with the DDaT family."
        },
        {
            "text": "I've taken away inspiration to think through how we can use our networks, or build better, to understand how to break into untapped markets on recruitment. I am interested in exploring neurodiversity, social diversity, age and returning to work from breaks, not just a focus on gender or ethnicity."
        },
        {
            "text": "I'm keen to continue earlier in the year conversations with the DDaT capability team and DDaT recruitment on a returners scheme. We have nothing officially in DBT, yet. I'm also keen to speak with DBT HR (Becky, I'm going to reach out soon!), and I'd like to see what we can tap into with Cabinet Office and other government departments."
        },
        {
            "text": "On growth and development, I'm keen we build a personal offer for individuals. Where we can offer mentoring, coaching and support to help people understand and realise their skills and potential, and then channel that towards the right opportunities. I'd like to set out an 18-month growth offer for our delivery profession that factors in bespoke membership and other development opportunities."
        },
        {
            "text": "And back to women in tech. I'm going to be speaking to some of the attendees to find out what more we can learn on initiatives that are already tried, tested and successful.'"
        },
        {
            "heading": 2,
            "text": "Making diversity a priority"
        },
        {
            "text": "One of DDaT’s top priorities for the coming months and years is to become an industry leader when it comes to hiring diverse candidates. To do this, DDaT focuses on leading by example by making our recruitment process and development offer inclusive to all. There is a misconception across the board that to join the digital, data and tech profession you already need to be a DDaT career professional. This often puts off diverse candidates. In DDaT DBT we make it clear to prospective colleagues that we welcome new joiners from all careers, walks of life and stages of their career. From those on apprenticeships and the Civil Service Fast Stream to those making a career change – we offer support and development opportunities to make DDaT a welcoming place to build and develop a career in tech."
        },
        {
            "text": "Georgia Defeo, DDaT Head of Recruitment"
        },
        {
            "text": "‘Since joining DDaT recruitment in March this year, it is crystal clear that our DDaT function is committed to building a diverse team and recognises the importance that recruitment plays. We are proud to be above industry standard when it comes to recruiting females and have been nominated as ‘Best Public Sector Employer’ at the Women in Tech awards for 2 consecutive years. We also ensure our roles are reaching a diverse audience, posting relevant vacancies to the Technojobs Women in Tech jobs board. Earlier this year, we attended the women in tech’s brunch at the Silicon Milkroundabout careers fair. This was a great moment where we realised how many women, at all stages of their careers, were interested in the tech profession!"
        },
        {
            "text": "Despite our successes, DDaT continuing to work on improving diversity remains a priority. The recruitment team are always seeking new initiatives and implementing continuous improvements to make our roles and our recruitment processes more accessible to diverse candidates.’"
        },
        {
            "text": "Jason Kitkat, Director of Digital, Data and Technology"
        },
        {
            "text": "‘We are constantly re-evaluating and learning how best to recruit and promote women in DDaT. Every day we see and experience the value of having teams with diverse thinking, backgrounds and experiences. We use different methods of recruitment, promotion and roles to see what works best. We are well above the (sadly low) industry averages but keep striving to do better."
        },
        {
            "text": "One theme that keeps coming back is challenging the assumption that someone needs to be a “DDaT expert” to apply for roles. We’ve had so many successful female candidates from different professions and make a success of their career here in DBT. Whether formerly teachers, biochemists or librarians they’ve made a choice for a different type of work and flourished here. I’m currently spending lots of time with my teenage daughter helping her to decide her university course. Showing her the range of paths people take has helped to remind us that whatever you study doesn’t mean you have to do that always."
        },
        {
            "text": "With fantastic support for learning and development, apprenticeships up to Masters equivalent level and great communities of practice, we’re seeing our female colleagues expand their horizons whichever background they’ve come from.’"
        }
    ]
}