{
    "url": "https://defrafarming.blog.gov.uk/2022/03/24/animal-health-and-welfare-grants-your-chance-to-suggest-items/",
    "title": "Animal Health and Welfare Grants: your chance to suggest items",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to improve animal health and welfare",
        "Ways to get involved"
    ],
    "pub_date": "2022-03-24T09:52:01+00:00",
    "content": [
        {
            "text": "Through the Animal Health and Welfare Pathway, we’re offering financial incentives to support farmers who want to improve the health and welfare of their animals."
        },
        {
            "text": "One of the ways we’re doing this is through Animal Health and Welfare Grants. These grants will fund the purchase of equipment, technology and infrastructure."
        },
        {
            "text": "Smaller grants for items valued from around £50 to £10,000 will be available, as well as larger grants for bespoke infrastructure investments."
        },
        {
            "text": "We want our grant options to support health and welfare aspects that are applicable to most farms. We also want to make sure we provide grants suitable for all types of farmers that cover the latest innovations, so we hope you will take the time to contribute your suggestions"
        },
        {
            "text": "We’ve created sector specific questionnaires so you can share your ideas. It will take 10-15 minutes to complete."
        },
        {
            "text": "Pigs"
        },
        {
            "text": "Sheep"
        },
        {
            "text": "Dairy cattle"
        },
        {
            "text": "Beef cattle"
        },
        {
            "text": "Meat chicken"
        },
        {
            "text": "Laying hens "
        },
        {
            "text": "Suggestions will then be assessed and finalised with stakeholders. "
        },
        {
            "text": "Let us know your thoughts by Thursday 31 March."
        },
        {
            "text": "Some ideas include:"
        }
    ]
}