{
    "url": "https://dragonsden.blog.gov.uk/2022/03/24/dragons-den-episode-12-series-19/",
    "title": "Dragons' Den Episode 12 Series 19",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2022-03-24T21:04:57+00:00",
    "content": [
        {
            "text": "This week’s episode of Dragons’ Den had me feeling ready for the summer. With entrepreneurs sharing plant-based cocktails and squeezy sauce bottles, I was ready to head to the nearest beach…and that’s the famous Barry Island for me."
        },
        {
            "text": "With this week’s warmer weather, I’m sure I wasn’t the only one feeling the heat, including the Dragons. With successful investments and tough questioning, this week’s episode was full of sun and showers."
        },
        {
            "heading": 3,
            "text": "Not like any udder cocktail"
        },
        {
            "text": "The first entrepreneur to enter the Den was Paul Crawford with his plant-based cocktail business Panther Milk. Inspired by his time DJ’ing in Barcelona, Paul brought a collection of (not) milky beverages which had me eager to find out more."
        },
        {
            "text": "Paul was asking for a £50k investment for 7.5% of his business and Sara Davies was first to challenge him, asking about his goals for the business. "
        },
        {
            "text": "Paul had tapped into a unique part of the market: plant milk-based cocktails targeted at a young vegan audience with the potential to market them at festivals, bars and clubs. "
        },
        {
            "text": "With that wide possibility of stockists, I wondered if Paul had thought about licensing his intellectual property (IP)?"
        },
        {
            "text": "This would allow him to expand his business in multiple directions whilst retaining his IP rights and the profits. Find out more about licensing your IP in our video below. "
        },
        {
            "text": "Back to the Den, and the green queen Deborah Meaden was interested in the plant-based aspects of the product and the unique selling point for vegan consumers. She made a hard offer for all the money but for 30% of the business."
        },
        {
            "text": "Not ready to part with so much of his business, Paul haggled the deal down to 25% and left with smiles all round. "
        },
        {
            "heading": 3,
            "text": "Luxury in the face of adversity"
        },
        {
            "text": "The next daring business owners to try their luck in the Den were duo Caroline Kennedy Alexander and Sarah Bell Jones, with their luxury lingerie brand, Love Rose. "
        },
        {
            "text": "Caroline and Sarah asked for 70k in exchange for 15% of their business. Opening with the moving story of how Caroline lost her sister to breast cancer, the pair shared their product, thoughtfully-created post-operative lingerie."
        },
        {
            "text": "Deborah Meaden was first to question their pitch and my ears twitched when she asked about design protection. Caroline explained that they hadn’t applied for a patent for their lingerie products, because it can be difficult within the fashion industry."
        },
        {
            "heading": 3,
            "text": "How can you protect fashion designs? "
        },
        {
            "text": " Some designers use unregistered designs to protect their creations, since the design of the product is likely to change quickly and there is not always time to apply for a registered design. "
        },
        {
            "text": "Unregistered designs are automatic and protect the shape and configuration of your product for either 10 years after it was first sold or 15 years after is created. They also protect the physical appearance of your product for 3 years from when you go public with your design. Find out more about unregistered designs by visiting our website."
        },
        {
            "text": "There isn’t a register for these rights, however, you can prove your design protection by registering your designs or you can ask a solicitor to keep certified copies of your unregistered design as a record."
        },
        {
            "text": "Things were getting heated back in the Den, as Touker Suleyman and Steven Bartlett discussed the brand’s aims and potential future. As tensions rose, I admired Caroline and Sarah for keeping their cool as the Dragons’ debated their thoughts about the business."
        },
        {
            "text": "Sadly for the duo, the Dragons felt the product was too niche and difficult to market, so they walked away without a deal. "
        },
        {
            "heading": 3,
            "text": "A second attempt at squeezing a deal "
        },
        {
            "text": "Making a return to the Den, the final pitch came from Peter Neath and Ian Worton who shared their bottle attachment to add to glass sauce bottles, SauceStream. "
        },
        {
            "text": "We first saw the pair in 2009 when they pitched their barbeque rack which collected fat. All the talk of barbeques had me thinking of summer. With the warmer weather this week, I’m sure there have been a few people across the UK wheeling out theirs! "
        },
        {
            "text": "This time, Peter and Ian asked for a £75k investment for 10% of their business. The attachment makes any bottle squeezable and could help reduce use of single use plastics for condiments. "
        },
        {
            "text": "With some promising stats around the number of views they had on social media, they caught the attention of social tycoon Steven Bartlett. The duo confessed he was one of their preferred Dragons, along with Peter Jones. "
        },
        {
            "text": "The usability and broad market of the product proved that their business was worth investing in and they squeezed a three-way deal with Peter, Steven and Deborah. "
        },
        {
            "text": "And after all that, I’m ready to put on my shades and sip on a cocktail ready for next week’s episode. "
        },
        {
            "text": "If you have got a great business you would like to put to the Dragons, you can apply by clicking on this link."
        }
    ]
}