{
    "url": "https://civilservice.blog.gov.uk/2022/03/24/epilepsy-awareness-purple-day-26-march-2022/",
    "title": "Epilepsy Awareness - Purple Day 26 March 2022",
    "authors": [
        "Clare Shillan"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-03-24T09:12:24+00:00",
    "content": [
        {
            "heading": 3,
            "text": "On Purple Day, hundreds of thousands of people across the globe come together to start conversations around epilepsy to raise awareness and fundraise to make a difference for people affected by the condition.     "
        },
        {
            "text": "Clare Shillan, who works for the Cabinet Office as an HR Policy Lead, shares her story about her son Stephen, who has epilepsy. Clare describes how epilepsy affects Stephen and how the Civil Service has supported her. "
        },
        {
            "heading": 3,
            "text": "Clare’s Story"
        },
        {
            "text": "My son started to experience seizures when he was six years old. At this stage, he’d already been diagnosed with dyspraxia and ADHD, so this was the latest in a series of issues for us to overcome."
        },
        {
            "heading": 4,
            "text": "Complicated\n"
        },
        {
            "heading": 4,
            "text": "Stephen’s epilepsy journey has been complicated. He initially presented with focal impaired awareness seizures, although the tests suggested he had generalised seizures with photosensitivity. When Stephen reached adolescence, he started to experience tonic clonic seizures, previously known as a ‘grand mal’. It’s what most people think of as a typical epileptic fit and usually combines a loss of consciousness with a jerking of limbs and sometimes difficulty breathing. The seizure normally stops after a few minutes, but some last longer.\n\nSettled down"
        },
        {
            "text": "Some difficult years followed when Stephen experienced clusters of seizures and was hospitalised a few times. With medication, things eventually settled down and, although Stephen still has seizures (he has never been seizure-free), thankfully they are not as frequent."
        },
        {
            "text": "Stephen was also diagnosed with autism when he was 17. I hadn’t realised until then that there’s a link between epilepsy and autism, with around 30% of people with autism also having epilepsy and vice versa. Having autism makes Stephen’s epilepsy a bit harder to manage, as he perceives risk differently to most. This continues to present challenges to his neurologist to balance his medication in order to reduce seizure frequency."
        },
        {
            "text": "Even though Stephen is now nearly 22, he relies entirely on me to prompt him to take his epilepsy medication. He’s a strapping six foot tall man, and if he falls at the start of a tonic clonic seizure, it’s a long way down to the ground, and he has injured himself several times."
        },
        {
            "heading": 4,
            "text": "Knock-on effect"
        },
        {
            "text": "Stephen’s epilepsy has definitely had a knock-on effect on my work and personal life. Luckily since Stephen was small, I’ve had understanding and supportive line managers. Working in A Modern Civil Service, which has been flexible and made adjustments where needed, has been hugely helpful."
        },
        {
            "text": "The pandemic has been a mixed blessing. Whilst working at home, I am able to respond quickly if Stephen has a seizure, but I am now more worried whenever I have to be out of the house for long periods."
        },
        {
            "heading": 4,
            "text": "Carer’s Passport\n"
        },
        {
            "text": "As I prepared to come back into the office following the lockdown, I discussed my concerns with my manager who asked if I’d ever considered putting a Carer’s Passport in place."
        },
        {
            "text": "Like so many parents, I didn’t really think of myself as a carer. I am simply Stephen’s  mum and it’s my job to look after him. But hearing that question made me realise that the role of the parent and the role of carer for an adult child are distinctly different - and that it would be hugely helpful for me to use the Carer’s Passport to document the flexibilities that help me balance work with my caring responsibilities."
        },
        {
            "heading": 4,
            "text": "Peace of mind\n"
        },
        {
            "text": "These include simple things like being able to work a shorter day in the office (completing my day at home so that Stephen isn’t at home alone for such a long period of time) and agreement that I can leave at short notice if needed. These simple measures provide me with peace of mind."
        },
        {
            "text": "I’d encourage anyone with caring responsibilities to talk to their manager about the Carer’s Passport so that it’s clear what support you need and the agreed arrangements that help you work and care to the best of your ability."
        },
        {
            "text": "On a positive note, I want to share that it is possible to combine caring responsibilities with a fulfilling career, and I have worked in some great roles and been promoted on a number of occasions during my time in the Civil Service."
        },
        {
            "heading": 4,
            "text": "Sources of Support"
        },
        {
            "text": "Epilepsy affects people differently and is not just one condition, but a group of many different ‘epilepsies’ with one thing in common: a tendency to have seizures that start in the brain. More information about epilepsy can be found on the Epilepsy Society website. "
        },
        {
            "text": "Information about the Carer’s Passport and support available for Carers can be found on the Charity for Civil Servants website and through the Civil Service Carers Network."
        },
        {
            "text": "If you have epilepsy, talk to your manager about the workplace adjustments you might need, and complete a Workplace Adjustment Passport which is available on departmental websites. Support is also available through the Civil Service Disability Network."
        }
    ]
}