{
    "url": "https://naturalengland.blog.gov.uk/2022/03/24/licensing-diversionary-feeding-of-hen-harriers-on-and-around-grouse-moors/",
    "title": "Licensing ‘diversionary feeding’ of Hen Harriers on and around grouse moors",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Hen Harriers",
        "Natural England",
        "Protected sites and species"
    ],
    "pub_date": "2022-03-24T11:13:33+00:00",
    "content": [
        {
            "text": "This is one of a series of blogs intended to share updates on our Hen Harrier recovery work. The last blog was on Hen harrier monitoring, and the actions taken when a tagged bird is lost, while this one covers our work licensing ‘diversionary feeding’. "
        },
        {
            "text": " "
        },
        {
            "text": "What is diversionary feeding?"
        },
        {
            "text": "Hen Harriers are still exceptionally rare breeding birds in England, and Natural England continues to work alongside partners to support their recovery. One approach is licensing ‘diversionary feeding’ of nesting Hen Harriers on or near grouse moors. Illegal persecution on land managed for grouse shooting is the main threat to the recovery of Hen Harriers, and is often underpinned by the fact that nesting harriers are known to predate Red Grouse chicks. Extensive work carried out under the Langholm Moor Demonstration Project showed that providing substitute food to nesting harriers, such as dead poultry chicks or rats, can substantially reduce the number of Red Grouse taken by the parent harriers to feed to their chicks. Licences for diversionary feeding are offered as a legal method of enabling sustainable grouse shooting to co-exist alongside thriving Hen Harrier populations.  "
        },
        {
            "text": "While the purpose of diversionary feeding is to support the conservation of Hen Harriers, the act of approaching a nest poses a potential risk to birds. As for all birds, too much disturbance risks the parent birds abandoning their nests, leading to the failure of the eggs or death of the chicks. As a general rule, birds are most likely to abandon their nests if disturbed early in the nesting attempt, and least likely to abandon if disturbed later on, after the chicks have hatched. "
        },
        {
            "text": "Hen Harriers are specially protected, such that intentionally disturbing nesting Hen Harriers is an offence under the Wildlife and Countryside Act. Approaching to within several hundred metres of a Hen Harrier nest has the potential to cause disturbance, therefore a licence from Natural England to provide diversionary food is required in order for this activity to be legal and to ensure risks are minimised. Risks to the nest may also arise through the diversionary food attracting other predators or scavengers. "
        },
        {
            "text": "A key action under the 2016 Hen Harrier Action Plan is to increase uptake of diversionary feeding as a management technique. The updated Diversionary Feeding Class Licence (CL25) is available to landowners and land managers – gamekeepers and conservationists alike – in grouse shooting areas of northern England. The licence allows land managers to establish and maintain feeding stations near to active harrier nests. It is designed to ensure that the potential risks of nest disturbance are minimised, while the benefits – effectively diverting Hen Harriers from taking Red Grouse – are maximised. It should be noted that, to date, there is no evidence to suggest that diversionary feeding has ever led to any Hen Harriers abandoning their nests. In addition, there is some evidence that diversionary feeding has led to greater Hen Harrier fledging success.   "
        },
        {
            "text": " "
        },
        {
            "text": "Updates to the Diversionary Feeding Class Licence in 2022 "
        },
        {
            "text": "Some changes to the licence conditions were made in 2021 based on experience and feedback from licence users. However, following a number of issues related to diversionary feeding, and further feedback, a broader review was carried out over autumn/winter 2021. To inform this review, we spoke to people who had previously fed Hen Harriers under licence, both in England and in Scotland, Hen Harrier experts, and other key stakeholders. The aim of this review was to learn from all relevant experience, to discuss best practice techniques to reduce risks and maximise benefits, and also to make administrative improvements to registration and reporting. A summary of these changes is shown below: "
        },
        {
            "text": " Where to provide food"
        },
        {
            "text": "  When to start feeding"
        },
        {
            "text": " Reporting"
        },
        {
            "text": " Registration"
        },
        {
            "text": " "
        },
        {
            "text": "Partnership working to recover Hen Harrier populations "
        },
        {
            "text": "While the logistics and skill involved should not be underestimated, diversionary feeding is a nevertheless a straightforward, established, successful and low-risk activity when carried out by responsible, trained and experienced individuals. However, there are limitations to what can be achieved through diversionary feeding alone, and therefore the activity sits alongside a suite of other measures to tackle persecution and support Hen Harrier recovery under the Hen Harrier Action Plan, delivered by a range of partner organisations. "
        },
        {
            "text": "One of our partners is the British Association for Shooting and Conservation (BASC), who support the work of the Hen Harrier Action Plan. Via its Legacy Fund, BASC has committed £75,000 towards Natural England’s Hen Harrier recovery work over the next three years, part of which will go towards supporting the Natural England field staff who provide practical advice and reassurance to land managers on how to successfully implement diversionary feeding.  "
        },
        {
            "text": " "
        },
        {
            "text": "Looking to the future"
        },
        {
            "text": "We welcome the recent promising increase in breeding Hen Harriers in northern England, and are hoping to see a further increase in breeding numbers in 2022. This may lead to an increased demand for diversionary feeding licences, and we are grateful to all the groups and individuals we work with for helping us ensure that these licences are based on the best available evidence.  "
        },
        {
            "text": " "
        },
        {
            "text": "Notes: "
        },
        {
            "text": "The class licence, and associated registration and reporting forms, can be found here. "
        },
        {
            "text": "Future planned blogs will focus on the preparations for the breeding season, including the brood management trial. While we are not able to respond to all comments individually, feedback in the comments section below is welcomed. "
        },
        {
            "text": "We recognise the sensitivity of, and interest in, nesting Hen Harriers. If you have questions about activity around an active Hen Harrier nest, you can contact the Wildlife Crime Officer at your local police force (using non-emergency contact details or call 101). The police may contact Natural England to determine whether any licences are in place at that location, including specific permission to feed before the eggs have hatched. For any suspected wildlife crime, you can call 999 if you believe that a crime is in progress as you watch, or 101 if the potential offender is no longer present. "
        },
        {
            "text": "Acknowledgements\nA wide range of organisations are working together to support Hen Harrier recovery. These include: Natural England, Defra, RSPB, Forestry Commission, Moorland Association, United Utilities, National Trust, Hawk and Owl Trust, International Centre for Birds of Prey, Yorkshire Dales National Park Authority, Northumberland National Park Authority, Peak District National Park Authority, Nidderdale & Forest of Bowland Areas of Outstanding Natural Beauty, Northumberland Wildlife Trust, British Association for Shooting and Conservation, Game & Wildlife Conservation Trust, local police forces and the National Wildlife Crime Unit, various Estates and their representatives, and individuals including landowners, farmers, academic researchers and volunteer raptor enthusiasts. "
        }
    ]
}