{
    "url": "https://digitaltrade.blog.gov.uk/2022/03/24/our-new-strategy-digital-delivery/",
    "title": "Our new strategy: Digital Delivery",
    "authors": [
        "Miranda Pottinger, Chief Product and Delivery Officer"
    ],
    "categories": [
        "Culture",
        "Digital Services",
        "People and Skills"
    ],
    "pub_date": "2022-03-24T12:00:08+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our team "
        },
        {
            "text": "As Chief Product and Delivery Officer in the Digital, Data and Technology (DDaT) directorate of the Department for International Trade (DIT), I get to build, support and sustain our community of Product Managers and Delivery Managers. We’re the pathfinders for our multidisciplinary teams: knowing when to build, when to learn, and when we can only learn by building. This means helping our teams weigh up the value of different problem spaces, understanding the insight we already have, and balancing the risks of the unknowns within different approaches. We keep our teams motivated and on track from sprint to sprint and quarter to quarter, setting out the commitments we want to make.  "
        },
        {
            "text": "We’re a fun and collaborative bunch; you’re as likely to find us plotting great energisers for the next team meeting as setting up a (virtual) whiteboard with post-its and getting the team thrashing out the difficult problems together. That might be around thinking through a potential solution, or sketching ways to get the data and evidence we need for a key decision. "
        },
        {
            "heading": 2,
            "text": "Our background "
        },
        {
            "text": "As Anais wrote in our new strategy for user-centered design, DIT DDaT worked at a relentless pace to get ready for EU Exit.  Post-Exit, we have a wider variety of delivery approaches we might want to take. We now have the space to run more product experiments, building confidence that the services we develop can give the UK a competitive edge, increasing the reach of our exporters, and making sure we’re a destination for overseas businesses wanting to expand.  "
        },
        {
            "heading": 2,
            "text": "How we work "
        },
        {
            "text": "We believe successful product development and delivery is all about sizing up the bets you might make. We frame desirable outcomes as product hypotheses that we can quickly prove or disprove. We start small, test ideas quickly, and learn from those tests all to establish whether to invest further in an idea and make a bigger bet. A large part of this process is about partnering with our colleagues across DIT so that we collectively learn about the value of new initiatives. We work with an agile mindset by default, bringing together the latest digital thinking and our insight from the coalface of developing services, then finding ways to meet business objectives through meeting user needs. "
        },
        {
            "text": "To test rapidly and early, we need to minimise our start-up costs to figure things out. We can do that through prototyping our smaller bets and, once we’re ready to scale up, build those ideas we have most confidence in.  "
        },
        {
            "text": "We’re lucky to have a mature and sophisticated data infrastructure, with clear standards laid out in the Technology Code of Practice, the Functional Standard and the Service Standard. We also build cloud-native on the Government Digital Service (GDS) Platform as a Service (PaaS).  As a new department, we’re also not constrained by lots of legacy technology. This means many of the foundational elements have already been tackled, and we can focus on developing our best ideas, knowing that we’re building in the right way.  "
        },
        {
            "heading": 2,
            "text": "Empowered Product teams "
        },
        {
            "text": "Our Product and Delivery Managers actively balance building shiny new things with improving what we already have. We dedicate time to continuous improvement of our existing products and services, and use 'firebreak' weeks to allow teams to explore improvements that leadership wouldn’t think of. We continue to invest in our platforms, actively manage our technical debt, and keep our systems secure. Our ambition is to build high-performing, sustainable teams and technology, that are flexible and able to pivot quickly as our environment changes or as we learn more. We’re also not afraid to retire services that are no longer a good fit with our proposition. "
        },
        {
            "text": "So, with all these things on our plate and a ceiling to how much work we can have in progress at once, we knew we needed to look at our planning process going forward.  "
        },
        {
            "heading": 2,
            "text": "We focus on value for money projects "
        },
        {
            "text": "We want to make what we’re working on as transparent as possible, both to our partners across DIT, and within DDaT itself. In our strategy, we’ve committed to building a prioritisation model and “front door process” to assess new initiatives. Through this, we ensure that DDaT teams and effort are focused in areas that deliver most business value, most user value and provide good value for money.  "
        },
        {
            "text": "We started last year by running a centralised quarterly planning process: bringing our leadership together to compare all the potential work in progress and rebalancing our teams across different priorities, now we were past the EU Exit milestone. We needed to do this centrally for a while to get our bearings and orient ourselves in the new bigger picture. Everyone involved learned lots about how to decide on our priorities, and how to compare disparate ideas. "
        },
        {
            "heading": 2,
            "text": "Strategically creating and developing new projects "
        },
        {
            "text": "Now, we’re decentralising planning and prioritisation again, to give our teams the space to self-organise and set their direction within that big picture. We’re focused on coaching our individual teams around strategic thinking and assessing value of all kinds.  By doing this, we can do better and better at sizing up the bets we’re going to make, to discover and solve the problems we think are most valuable. We’re looking to fund teams, not projects, so that we have that flexibility to pivot by bringing new problems into multidisciplinary groups that are already high-performing. We’re also prioritising getting better at sharing what we already know about our users and insight into what’s working, so that teams don’t have to duplicate work. "
        },
        {
            "text": "Ultimately, we want to create new services and develop existing ones in the right way for the right reasons. We can’t do everything, so we are making sure that we invest in the work that will have the greatest impact, and has the best chance of giving the UK that competitive edge. We can only do this by building great teams, giving them the context and skills they need to create amazing services that deliver business outcomes by delighting our users."
        }
    ]
}