{
    "url": "https://forestrycommission.blog.gov.uk/2022/03/24/tree-production-innovation-fund-third-spotlight-on-successful-applicants/",
    "title": "Tree Production Innovation Fund - Third spotlight on successful applicants",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2022-03-24T11:55:50+00:00",
    "content": [
        {
            "text": "In 2021 it was announced that the Tree Production Innovation Fund would be making over £1 million available to 16 innovative projects striving to increase and diversify our domestic tree production"
        },
        {
            "text": "In our Tree Production Innovation Fund success stories blog post we gave a brief introduction into those 16 successful projects, and took a closer look at some of them in two previous blog posts."
        },
        {
            "text": "Here we take a look at three more projects in more detail and the organisations behind them."
        },
        {
            "heading": 2,
            "text": "SilviBio Ltd"
        },
        {
            "heading": 3,
            "text": "An investigation into the use of a moisture-retaining additive to develop peat-free alternatives for cell-grown tree production"
        },
        {
            "text": "Peatlands supply vital reservoirs for biodiversity and carbon sequestration. In fact, the world’s peatlands combined store twice as much carbon as the world’s forests. Thus, preserving these unique ecosystems is vital to securing a more sustainable future."
        },
        {
            "text": "However, peatlands are threatened by peat harvesting for horticultural uses. Peat has excellent water retaining properties and helps hold nutrients. Therefore, we need peat alternatives."
        },
        {
            "text": "Current alternatives, such as composted bark, coconut coir and wood fiber, do not provide as good water and nutrient retention and re-wettability properties as peat. Thus, we must discover and create better alternatives. Additionally, the forestry industry is shifting towards growing trees in glasshouses within cells. This shift away from field germinated tree seedlings is due to worker shortages and the phasing out of commonly used soil sterilants."
        },
        {
            "text": "Cell grown trees resolve both of these issues, but at the cost of increased peat usage within the tree cells. SilviBio’s project, supported by the Tree Production Innovation Fund, will blend our moisture-retaining soil conditioner into existing peat-free growing mediums with the aim of producing a product that better retains water and nutrients. Adding our soil conditioner may also help retain fertilisers and other amendments, thereby preventing runoff and reducing costs. Importantly, this feasibility study answers the urgent need to decrease peat use and increase the forestry industry’s sustainability."
        },
        {
            "heading": 2,
            "text": "University of Nottingham"
        },
        {
            "heading": 3,
            "text": "Tree Cutting Ps and Qs: propagation quality and production quantity"
        },
        {
            "text": "Creating new plants from cuttings is widely used for garden and commercial plant production because it’s quicker than seed-raising and resulting plants inherit the memory of past environmental stresses enabling them to better cope with future stress. This makes cutting propagation an excellent way to produce high numbers of environmentally resilient trees. However, cuttings need plant hormones like auxin (common in commercially available rooting gels) to produce roots and the exact timing, amount and mixture of hormones differs for each tree species."
        },
        {
            "text": "Understanding which trees require special hormone treatments and which already form roots is essential for our nurseries to scale up tree production. This pilot study is testing cutting propagation success of UK broadleaf tree species using existing rooting hormone treatments. Each species will be categorised as either – industry-ready; requires optimisation; or requires research – to enable nurseries (including our partners) to make informed choices about which species to target for intensive production and which require further research."
        },
        {
            "text": "Additionally, we are trialling the use of technologies from the pharmaceutical sector, which target delivery of actives, with tree cuttings to release plant hormones at specific times to improve cutting success. With the environment squarely in focus, our propagation media is peat-free and biodegradable cardboard propagation tubes (Ezeetrees) will replace plastic propagation pots."
        },
        {
            "text": "Our cross-sector team including nursery producers (Whetman Plants International), fruit tree specialists (NIAB-EMR), wider plant collecting community (including Plant Heritage) and academics (University of Nottingham) will ensure direct transfer of knowledge and know-how between all partners."
        },
        {
            "heading": 2,
            "text": "University Centre Myerscough"
        },
        {
            "heading": 3,
            "text": "Improving efficiency and resilience of water management in tree nurseries"
        },
        {
            "text": "Tree nurseries use substantial volumes of water to produce high-quality plant material. Efficient irrigation protocols on tree nurseries will help to manage future challenges to water supplies brought about as a result of climate change and an increasingly stringent regulatory framework."
        },
        {
            "text": "Currently, irrigation scheduling decisions on tree nurseries are based almost entirely on manager experience, which can result in over-application of water. High irrigation volumes promote individual tree size but are inefficient; this may limit overall nursery production as irrigation licences are capped at fixed volumes. Adopting more water-use-efficient irrigation techniques allows more trees to be produced without increasing current irrigation volumes."
        },
        {
            "text": "More precise irrigation scheduling can maintain or even enhance tree quality. However, implementing novel irrigation protocols requires new user-friendly tools that can be applied to the entire nursery and are translatable across species and stock size. Existing techniques based on soil moisture sensing or tree performance measurements have not been applied at scale in the UK. Coupling developments in (soil and tree) sensor technology to enhanced data analysis allows internet-based dashboards to be developed to inform irrigation scheduling decisions in real-time."
        },
        {
            "text": "The Internet of Things (IoT) allows a digital network to collect, analyse and visualise diverse information to inform management practices. By deploying an array of existing sensors that measure soil conditions, tree physiological status and the aerial growing environment at high-frequency, we will create time-series datasets that are not possible through visual observation or temporally dispersed datasets. Collectively analysing these data (in contrast to previous approaches on subsets of data) will more precisely establish irrigation set-points to be established and help to inform manager decision-making."
        },
        {
            "text": "Following proof-of-concept trials, a constellation of commercially available sensors will be established around Hillier Nursery will allow tree managers to respond to real-time data coming from the geospatially referenced soil moisture status, tree water-use and accumulated stress. New analytical tools that translate these high-resolution datasets into easy-to-read metrics (e.g., analogous to a fuel gauge) that can be viewed in real time will augment current approaches."
        },
        {
            "text": "Dr Andrew Hirons (Principal Investigator):"
        },
        {
            "text": " "
        }
    ]
}