{
    "url": "https://defradigital.blog.gov.uk/2022/03/24/why-im-celebrating-being-neurodivergent/",
    "title": "Me and my dyslexia: why I’m celebrating being neurodivergent",
    "authors": [
        "Anne Kemp"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Digital transformation",
        "Smarter working"
    ],
    "pub_date": "2022-03-24T07:40:29+00:00",
    "content": [
        {
            "text": "Hello. I'm Anne, a Business Support Officer, and this Neurodiversity Celebration Week I wanted to share how Defra and my colleagues have supported me to feel more confident in sharing being dyslexic."
        },
        {
            "text": "Neurodiversity Celebration Week is a worldwide initiative that challenges stereotypes and misconceptions about neurological differences. It aims to transform how neurodivergent individuals are perceived and supported by providing schools, universities, and organisations with the opportunity to recognise the many talents and advantages of being neurodivergent, while creating more inclusive and equitable cultures that celebrate differences and empower every individual."
        },
        {
            "heading": 2,
            "text": "How I got to Defra "
        },
        {
            "text": "I joined the Civil Service Fast Stream in September 2021. It’s a three-year leadership development programme that places Fast Streamers in a new role every year. Offering roles across every government department, the scheme opens up a huge range of opportunities."
        },
        {
            "text": "I was delighted to be placed in Defra because, having grown up in rural Cornwall and studied geography at university, I have a real interest in the department’s work. But I was apprehensive about how my dyslexia might impact my ability to learn about IT."
        },
        {
            "text": "In all honesty I’m a bit of a technophobe – on my first day I had to Google how to turn my laptop on! I wouldn’t have normally chosen a job in IT because I believed that I didn’t have the right skillset, and that it would be an environment full of acronyms, confusing lingo, and very intelligent techy people."
        },
        {
            "heading": 2,
            "text": "How I’ve been supported in Defra"
        },
        {
            "text": "While everyone’s experiences of dyslexia differ, my diagnosis highlighted slower speeds of processing information, which explained a relative weakness in literacy at school. I still face difficulties with spelling, reading, and assimilating information at speed, and producing effective written communication under time pressure."
        },
        {
            "text": "Since joining the Civil Service, I have felt supported and confident in sharing my dyslexia with colleagues. My line manager encouraged me to complete a Workplace Adjustment Passport. This is a simple document used across the Civil Service that outlines any adjustments which can be made to remove barriers."
        },
        {
            "heading": 2,
            "text": "Getting assessed really helps"
        },
        {
            "text": "An Occupational Health Assessment was organised, with someone external to the Civil Service, which allowed me to talk freely about any concerns I had about how my dyslexia would impact my job. The assessor wrote a report with recommendations to help me work effectively, including technology, software, training, coaching and workplace strategies."
        },
        {
            "text": "I was really impressed by some of the support available – even Dragon speech recognition software, which allows you to control your computer with your voice. I shared all the recommendations with my line manager. While she was very supportive, encouraging me to take up as many as I liked, we agreed on a handful that we could implement, and review them whenever I wanted to."
        },
        {
            "text": "I’ve been delighted to be able to use a dual monitor set-up, both at home and in the office. I’m able to work from home regularly, and when I go into the office, I can use the booking system to choose a desk that has minimal auditory and visual distractions. If I decide I want to work in a busier part of the office, to be close to my team, I can use noise cancelling headphones to help me focus."
        },
        {
            "heading": 2,
            "text": "Starting conversations about neurodivergence "
        },
        {
            "text": "I have found the most beneficial part of having a Workplace Adjustment Passport is that it has started conversations. One of these conversations signposted me to the Defra Dyslexia Plus Network, a fantastic active group with a Yammer channel that provides a forum for discussion and support from colleagues."
        },
        {
            "text": "A network event encouraged me to put a simple note on my email signature mentioning my dyslexia. I’ve been really surprised by how many colleagues have acknowledged the note, shared their own experiences of being neurodivergent, or offered support."
        },
        {
            "heading": 2,
            "text": "How my confidence has grown "
        },
        {
            "text": "I used to feel hesitant about sharing that I’m dyslexic, worrying that people may think I was less capable of doing my job. My colleagues have supported me to feel comfortable in trying new ways of working."
        },
        {
            "text": "I have never felt embarrassed to be dyslexic, in fact it has enabled me to meet people and better understand how I can work with all my colleagues, neurodivergent or not."
        },
        {
            "heading": 2,
            "text": "My seven tips for embracing your neurodiversity in the workplace"
        },
        {
            "text": "I’d like thank all my Defra DDTS colleagues, not just for being accepting of my dyslexia but for being so supportive in encouraging me to try new things and politely ignoring when I misspell their names!"
        },
        {
            "text": "Find out more about Neurodiversity Celebration Week."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}