{
    "url": "https://food.blog.gov.uk/2022/12/02/2022-a-year-in-fsa-science/",
    "title": "2022 - A year in FSA science",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2022-12-02T12:59:35+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Professor Robin May, FSA Chief Scientific Adviser reflects on the FSA’s commitment to science and the work delivered throughout 2022."
        },
        {
            "text": "The mission of the Food Standards Agency (FSA), as laid out in our strategy, is food you can trust. We use science, evidence and information both to tackle the challenges of today, and to identify and contribute to addressing emerging risks for the future. Science is front and centre of all that the FSA does."
        },
        {
            "heading": 2,
            "text": "Reflecting on 2022"
        },
        {
            "text": "2022 was an interesting year for the UK and indeed the global food system. With the food system still feeling the impact of COVID-19, fresh challenges emerged, including the global impact of the war in Ukraine and the significant increase in living costs. Tackling these issues often meant we had to redivert our efforts in order to ensure that our response was underpinned by the latest science and evidence."
        },
        {
            "text": "As ever, though, staff across the organisation rose to the challenge and I continue to be impressed with the volume, breadth and quality of work that our science teams are capable of, often at very short notice."
        },
        {
            "heading": 2,
            "text": "Winter 2022"
        },
        {
            "text": "To kick start 2022, we published our survey of consumer perceptions of alternative or novel sources of protein. This important piece of work enhanced our evidence base for this rapidly growing policy area. Since then, we have remained closely involved in national networks leading alternative proteins innovative research, and ensured a strong FSA presence at international meetings and forums such as the Singapore International Agri-Food Week."
        },
        {
            "text": "In February, we published the first antimicrobial resistance (AMR) survey of UK retail lamb and turkey meat, as part of our commitment to the AMR National Action Plan. This was the first time we had focused our research efforts on these meats, enabling us to monitor the impact of future interventions on AMR levels within them."
        },
        {
            "text": "Then in March, the food industry faced major disruption to the food supply chain following the Russian invasion of  Ukraine. Ukraine is the major global producer of sunflower oil, so teams at both FSA and Food Standards Scotland (FSS) had to pivot swiftly to conduct a rapid risk assessment to gauge the risk in terms of allergy to UK consumers if sunflower oil was substituted with refined rapeseed oil in the absence of updated labelling. This risk assessment, alongside consumer research and scientific information about the nutritional content and sustainability of the oils, informed the FSA policy advice to consumers and food businesses on the substitution of sunflower oil with refined rapeseed oil."
        },
        {
            "text": "Producing high-quality consumer advice at pace in the face of a rapidly evolving situation epitomises our core mission and values, enabling us to continue to ensure that the safety of UK food even in the face of a rapidly changing global situation."
        },
        {
            "heading": 2,
            "text": "Spring 2022"
        },
        {
            "text": "In April, we were delighted to welcome two new fellows as part of the £19.2 million cross-government Pathogen Surveillance in Agriculture, Food and the Environment (PATH-SAFE) programme. Our fellowships enable us to engage with external academic experts who are aligned with our Areas of Research Interest (ARIs), help to leverage FSA investment through strategic outreach and sustain national capability in the area of food safety and sustainability."
        },
        {
            "text": "In May we published our survey on Salmonella in frozen, breaded chicken products. This survey was commissioned amid a number of recalls and withdrawals of frozen partially cooked (ready-to-cook) breaded chicken products due to contamination with Salmonella. These recalls highlighted a data gap within current surveillance, which this survey allowed us to fill. It showed a marked decrease in Salmonella in these products since FSA interventions associated with this outbreak, showing the benefit of these interventions, as well as the use of science and evidence in policymaking and incident response."
        },
        {
            "heading": 2,
            "text": "Summer 2022"
        },
        {
            "text": "June was an exceptionally busy time for us in which we welcomed 12 new members to our scientific advisory committees (SACs), who provide the FSA with their independent, expert advice and challenge us to ensure that our consumer advice is always based on the best and most recent scientific evidence. We also launched the UK Food Safety Network, partnering with the Biotechnology and Biological Sciences Research Council (BBSRC) and Quadram Institute to tackle the problem of food poisoning, which costs the UK approximately £9 billion per year. The network ensures that the FSA is well-placed to tackle the challenges of foodborne illnesses by bringing together experts to address current and emerging issues of food safety in the UK."
        },
        {
            "text": "Also in June, to mark the launch of the FSA strategy and its expanded focus to include the health and sustainability of food, we published research focusing on UK consumer interests, needs and concerns around food. This research highlighted major concerns surrounding food affordability and insecurity, and the issues facing both consumers and the food industry and food aid charities. This research has informed policy intervention, and as part of our role as a govenor and collaborator we have since published updated guidance to make it easier for food aid charities to get safe food to people who need it."
        },
        {
            "text": "The Science Council, which set up Working Group 6 in 2021 to review the potential food safety implications arising from changes to primary food production practices and technologies that reduce carbon emissions in the next 10 years, published an interim report in July. This report summarised what has been learnt during phases 1 and 2 of the project and outlines the work planned in phases 3 and 4. This work is of considerable value to FSA in pre-empting future policy and evidence needs in this area and demonstrates the commitment to reach net zero carbon emissions by 2050."
        },
        {
            "text": "August brought us Wave 4 of The FSA flagship survey, Food and You 2 which provided us with a detailed snapshot of peoples’ perceptions and behaviours on food-related issues. This research continues to highlight a high level of consumer trust in the food we buy and in the food supply chain, and allows us to monitor our progress against our core vision and inform policy decisions."
        },
        {
            "heading": 2,
            "text": "Autumn 2022"
        },
        {
            "text": "In September, we refreshed our areas of research interest (ARIs). This forms the backbone of our future research ambitions, highlights current strategic priorities, and demonstrates our commitment to addressing the recommendations of the Government Science Capability Review (SCR). Our revised ARIs emphasise our continuing commitment to food safety and authenticity, and also the FSA’s new role in helping to ensure that food is healthy and sustainable."
        },
        {
            "text": "In October, we published the first of our monthly consumer insights trackers, which enables us to monitor trends in consumer behaviours and attitudes on issues like food security and food affordability. The FSA’s capability to track and report on consumer data continues to be invaluable to policy decisions."
        },
        {
            "text": "I am unbelievably proud of the extraordinary breadth and quality of FSA science that we have delivered this year. The examples above are just a small selection of our ongoing science projects, all of which happen alongside the critical day-to-day operations of the science team in, delivering risk assessments and data to allow policy interventions and ensuring that novel foods can be brought safely to the GB market."
        },
        {
            "text": "I have no doubt that 2023 will bring its own challenges, both anticipated and unexpected, but I know that our talented team of science and evidence experts will tackle these with the same professionalism that they have this and previous years, keeping UK consumers safe and delivering on our central mission of Food you can Trust."
        },
        {
            "heading": 1,
            "text": "2022 - Blwyddyn mewn gwyddoniaeth yn yr ASB"
        },
        {
            "text": "Yr Athro Robin May, Prif Gynghorydd Gwyddonol yr ASB, yn myfyrio ar ymrwymiad yr ASB i wyddoniaeth a’r gwaith a gyflawnwyd trwy gydol 2022."
        },
        {
            "text": "Cenhadaeth yr Asiantaeth Safonau Bwyd (ASB), fel y nodir yn ein strategaeth, yw bwyd y gallwch ymddiried ynddo. Rydym yn defnyddio gwyddoniaeth, tystiolaeth a gwybodaeth i fynd i'r afael â’r heriau rydym yn eu hwynebu heddiw, ac i nodi risgiau sy’n dod i’r amlwg yn y dyfodol a helpu i fynd i'r afael â nhw. Mae gwyddoniaeth yn ganolog i bopeth y mae'r ASB yn ei wneud."
        },
        {
            "heading": 2,
            "text": "Myfyrio ar 2022"
        },
        {
            "text": "Roedd 2022 yn flwyddyn ddiddorol i system fwyd y DU ac, yn wir, y system fwyd fyd-eang. Gyda'r system fwyd yn dal i deimlo effeithiau COVID-19, daeth heriau newydd i'r amlwg, gan gynnwys effaith fyd-eang y rhyfel yn Wcráin a'r cynnydd sylweddol mewn costau byw. Roedd mynd i’r afael â’r materion hyn yn aml yn golygu bod rhaid i ni ailgyfeirio ein hymdrechion er mwyn sicrhau bod ein hymateb yn cael ei ategu gan y wyddoniaeth a’r dystiolaeth ddiweddaraf. Fodd bynnag, ymatebodd staff ar draws y sefydliad i'r her yn ôl eu harfer. Mae maint, ehangder ac ansawdd y gwaith a wneir gan ein timau gwyddoniaeth, yn aml ar fyr rybudd, yn drawiadol."
        },
        {
            "heading": 2,
            "text": "Gaeaf 2022"
        },
        {
            "text": "Ar ddechrau 2022, cyhoeddwyd ein harolwg o ganfyddiadau defnyddwyr o ffynonellau protein amgen neu newydd. Fe wnaeth y darn pwysig hwn o waith wella ein sylfaen dystiolaeth ar gyfer y maes polisi hwn sy’n tyfu’n gyflym. Ers hynny, rydym wedi ymgysylltu’n agos â rhwydweithiau cenedlaethol sy’n arwain ymchwil arloesol i broteinau amgen, ac wedi sicrhau bod yr ASB yn cael ei chynrychioli mewn cyfarfodydd a fforymau rhyngwladol, fel Wythnos Bwyd-Amaeth Ryngwladol Singapore."
        },
        {
            "text": "Ym mis Chwefror, cyhoeddwyd yr arolwg cyntaf o ymwrthedd gwrthficrobaidd (AMR) mewn cig oen a thwrci manwerthu yn y DU, fel rhan o’n hymrwymiad i’r Cynllun Gweithredu Cenedlaethol ar AMR. Hwn oedd y tro cyntaf i ni ganolbwyntio ein hymdrechion ymchwil ar y cigoedd hyn, gan ein galluogi i fonitro effaith ymyriadau yn y dyfodol ar lefelau o fewn y cigoedd hyn."
        },
        {
            "text": "Yna ym mis Mawrth, wynebodd y diwydiant bwyd aflonyddwch mawr yn y gadwyn cyflenwi bwyd ar ôl i Rwsia geisio goresgyn Wcráin. Wcráin yw prif gynhyrchydd olew blodau’r haul yn fyd-eang, felly bu’n rhaid i dimau yn yr ASB a Safonau Bwyd yr Alban fynd ati ar frys i gynnal asesiad risg cyflym i asesu’r risg alergedd i ddefnyddwyr y DU pe bai olew blodau’r haul yn cael ei amnewid ag olew hadau rêp wedi’i buro, heb fod hynny wedi’i nodi ar y label. Roedd yr asesiad risg hwn, ynghyd ag ymchwil defnyddwyr a gwybodaeth wyddonol am gynnwys maethol a chynaliadwyedd yr olewau, yn llywio cyngor polisi’r ASB i ddefnyddwyr a busnesau bwyd ar amnewid olew blodau’r haul ag olew hadau rêp wedi’i buro. Mae darparu cyngor o ansawdd uchel i ddefnyddwyr yn gyflym yn wyneb sefyllfa sy’n datblygu’n gyflym yn crynhoi ein cenhadaeth a’n gwerthoedd craidd, gan ein galluogi i barhau i sicrhau diogelwch bwyd y DU, hyd yn oed wrth wynebu sefyllfa fyd-eang sy’n newid yn gyflym."
        },
        {
            "heading": 2,
            "text": "Gwanwyn 2022"
        },
        {
            "text": "Ym mis Ebrill, roedd yn bleser gennym groesawu dau gymrawd newydd fel rhan o’r rhaglen draws-lywodraethol ar gyfer Gwyliadwriaeth Pathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE), gwerth £19.2 miliwn. Mae ein cymrodoriaethau yn ein galluogi i ymgysylltu ag arbenigwyr academaidd allanol y mae eu gwaith yn cyd-fynd â’n Meysydd o Ddiddordeb Ymchwil, helpu i drosoli buddsoddiad yr ASB trwy allgymorth strategol a chynnal gallu cenedlaethol ym maes diogelwch bwyd a chynaliadwyedd."
        },
        {
            "text": "Ym mis Mai cyhoeddwyd ein harolwg ar Salmonela mewn cynhyrchion cyw iâr mewn briwsion bara wedi'u rhewi. Comisiynwyd yr arolwg hwn yn sgil nifer o achosion o alw a thynnu cynhyrchion cyw iâr wedi'u coginio'n rhannol (parod i'w coginio) wedi'u rhewi yn ôl, a hynny o ganlyniad i halogiad â Salmonela. Roedd galw’r cynhyrchion hyn yn ôl wedi tynnu sylw at fwlch yn y data gwyliadwriaeth cyfredol, a gafodd ei lenwi gan yr arolwg hwn. Dangosodd ostyngiad amlwg mewn Salmonela yn y cynhyrchion hyn ers i’r ASB roi ymyriadau ar waith mewn cysylltiad â’r brigiad hwn o achosion, gan ddangos budd yr ymyriadau hyn, yn ogystal â’r defnydd o wyddoniaeth a thystiolaeth wrth lunio polisïau ac ymateb i ddigwyddiadau."
        },
        {
            "heading": 2,
            "text": "Haf 2022"
        },
        {
            "text": "Roedd mis Mehefin yn gyfnod eithriadol o brysur wrth i ni groesawu 12 aelod newydd i’n pwyllgorau cynghori gwyddonol. Mae’r pwyllgorau hyn yn rhoi eu cyngor annibynnol, arbenigol i’r ASB ac yn ein herio i sicrhau bod ein cyngor i ddefnyddwyr bob amser yn seiliedig ar y dystiolaeth wyddonol ddiweddaraf a gorau posib. Gwnaethom hefyd lansio Rhwydwaith Diogelwch Bwyd y DU, mewn partneriaeth â’r Cyngor Ymchwil Biotechnoleg a Gwyddorau Biolegol (BBSRC) a Sefydliad Quadram i fynd i’r afael â phroblem gwenwyn bwyd, sy’n costio tua £9 biliwn y flwyddyn i’r DU. Mae’r rhwydwaith yn sicrhau bod yr ASB mewn sefyllfa dda i fynd i’r afael â heriau salwch a gludir gan fwyd trwy ddod ag arbenigwyr ynghyd i fynd i’r afael â materion cyfredol a materion sy’n dod i’r amlwg o ran diogelwch bwyd yn y DU."
        },
        {
            "text": "Hefyd ym mis Mehefin, i nodi lansiad strategaeth yr ASB a’i ffocws ehangach ar iechyd a chynaliadwyedd bwyd, cyhoeddwyd ymchwil gennym yn canolbwyntio ar fuddiannau, anghenion a phryderon defnyddwyr y DU mewn perthynas â bwyd. Amlygodd yr ymchwil hon bryderon mawr ynghylch fforddiadwyedd bwyd a diffyg diogeledd bwyd, a'r materion sy'n wynebu defnyddwyr, y diwydiant bwyd ac elusennau cymorth bwyd. Mae’r ymchwil hon wedi llywio ymyrraeth polisi, ac fel rhan o’n rôl fel cynullydd a chydweithredwr, rydym wedi cyhoeddi canllawiau wedi’u diweddaru ers hynny i’w gwneud yn haws i elusennau cymorth bwyd sicrhau bwyd diogel i bobl sydd ei angen."
        },
        {
            "text": "Ym mis Gorffennaf, cyhoeddwyd adroddiad interim gan y Cyngor Gwyddoniaeth, a sefydlodd Weithgor 6 yn 2021 i adolygu’r goblygiadau diogelwch bwyd posib sy’n deillio o newidiadau i arferion cynhyrchu bwyd sylfaenol a thechnolegau sy’n lleihau allyriadau carbon yn y 10 mlynedd nesaf. Roedd yr adroddiad hwn yn crynhoi’r hyn a ddysgwyd yn ystod cyfnodau 1 a 2 y prosiect ac yn amlinellu’r gwaith a gynlluniwyd ar gyfer camau 3 a 4. Mae’r gwaith hwn yn hynod werthfawr i’r ASB er mwyn gallu achub y blaen ar anghenion polisi a thystiolaeth yn y maes hwn yn y dyfodol, ac mae’n dangos yr ymrwymiad i gyflawni allyriadau carbon sero net erbyn 2050."
        },
        {
            "text": "Ym mis Awst, cynhaliwyd Cylch 4 o arolwg blaenllaw'r ASB, Bwyd a Chi 2. Darparodd gipolwg manwl i ni o ganfyddiadau ac ymddygiad pobl mewn perthynas â materion bwyd. Mae’r ymchwil hon yn parhau i dynnu sylw at lefel uchel o ymddiriedaeth defnyddwyr yn y bwyd rydym yn ei brynu ac yn y gadwyn cyflenwi bwyd. Mae hefyd yn ein galluogi i fonitro’r cynnydd a wneir yn erbyn ein gweledigaeth graidd yn ogystal â llywio penderfyniadau polisi."
        },
        {
            "heading": 2,
            "text": "Hydref 2022"
        },
        {
            "text": "Ym mis Medi, gwnaethom adnewyddu ein meysydd o ddiddordeb ymchwil. Rhain yw asgwrn cefn ein huchelgeisiau ymchwil yn y dyfodol, ac maent yn amlygu blaenoriaethau strategol cyfredol ac yn dangos ein hymrwymiad i fynd i’r afael ag argymhellion Adolygiad Gallu Gwyddoniaeth y Llywodraeth (SCR). Mae ein meysydd o ddiddordeb ymchwil diwygiedig yn pwysleisio ein hymrwymiad parhaus i ddiogelwch a dilysrwydd bwyd, ond hefyd yn tynnu sylw at rôl newydd yr ASB wrth helpu i sicrhau bod bwyd yn iach ac yn gynaliadwy."
        },
        {
            "text": "Ym mis Hydref, cyhoeddwyd y cyntaf o'n harolygon tracio misol mewnwelediadau defnyddwyr, sy'n ein galluogi i fonitro tueddiadau o ran ymddygiad ac agweddau defnyddwyr ar faterion fel diogelwch bwyd a fforddiadwyedd bwyd. Mae gallu'r ASB i olrhain ac adrodd ar ddata defnyddwyr yn parhau i fod yn amhrisiadwy i benderfyniadau polisi."
        },
        {
            "text": "Rwy’n anhygoel o falch o ehangder ac ansawdd rhyfeddol y wyddoniaeth rydym ni yn yr ASB wedi’i chyflawni eleni. Dim ond detholiad o’n prosiectau gwyddoniaeth parhaus yw’r enghreifftiau uchod, sydd oll yn digwydd ochr yn ochr â gweithrediadau hanfodol y tîm gwyddoniaeth o ddydd i ddydd, er enghraifft, cyflawni asesiadau risg a data i ganiatáu ymyriadau polisi a sicrhau y gellir dod â bwydydd newydd i’r farchnad ym Mhrydain Fawr yn ddiogel. Nid oes gennyf unrhyw amheuaeth y daw 2023 â’i heriau ei hun, yn rhai cyfarwydd ac annisgwyl, ond rwy’n ffyddiog y bydd ein tîm dawnus o arbenigwyr gwyddoniaeth a thystiolaeth yn mynd i’r afael â’r rhain yn gwbl broffesiynol yn ôl eu harfer, gan gadw defnyddwyr y DU yn ddiogel a chyflawni ein cenhadaeth ganolog, sef ‘bwyd y gallwch ymddiried ynddo’."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}