{
    "url": "https://environmentagency.blog.gov.uk/2022/12/02/bathing-water-sampling/",
    "title": "Bathing water sampling",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-12-02T17:45:52+00:00",
    "content": [
        {
            "text": "With more than 400 designated Bathing Water sites in England used by hundreds of thousands of people every year for their enjoyment, it is vital that bathing water quality is maintained and improved. We’ve just published the data for the 2022 bathing season."
        },
        {
            "text": "The EA has been monitoring bathing water sites since the 1990s and in this time there have been significant improvements. This year our network of officers took more than 7,000 samples – up to 20 separate visits to each of the bathing water sites."
        },
        {
            "text": "How we sample "
        },
        {
            "text": "We follow a strict protocol to ensure samples are taken consistently both in terms of location and depth of water, and also covering a range of tidal states where it is safe to sample. The standards come from guidelines produced by the World Health Organisation (WHO). These guidelines ensure classifications are representative of the quality of the water in which people are likely to swim."
        },
        {
            "text": "There are circumstances when a few samples are excluded from classification, either because these are highly unusual or because other measures - such as signage from local authorities - have advised bathers not to swim at the time these were taken. There are not many samples excluded this way – this year, for example, we only excluded 8 samples taken during incidents or extreme rainfall and 58 because bathers were proactively warned of weather conditions likely to lead to a drop in quality. This is the way the Regulations classifications scheme is a truly representative of the quality of the water in which people are likely to bathe."
        },
        {
            "text": "Improvements since the 1990s"
        },
        {
            "text": "When looking back to the early 1990s, just 28% of bathing waters would have met today’s standards which are stricter now than those in force at that time. Based on today’s data, more than 97% of sites now meet the minimum standard, with 72% reaching the highest standards of an ‘Excellent’ or ‘Good’ rating."
        },
        {
            "text": "While consistently high standards are being maintained year after year, there is still much more to be done to ensure cleaner and healthier waters for people to enjoy."
        },
        {
            "text": "More to be done"
        },
        {
            "text": "The Environment Agency is clear that more needs to be done on the part of water companies, and is taking robust action to ensure businesses, farmers and councils help clean up our waters."
        },
        {
            "text": "It is the responsibility of water companies to prevent serious water pollution incidents from their assets."
        },
        {
            "text": "Since 2015, the EA has required water companies to install Event Duration Monitors at sites including bathing waters. This captures data on the frequency and duration of storm overflow discharges, with all the data published online so the public can see what is happening in their local area."
        },
        {
            "text": "More than 12,000 of England’s 15,000 storm overflows now have these monitors, and the remaining 3,000 will have them by end of next year."
        },
        {
            "text": "Sampling for next season"
        },
        {
            "text": "In the spring we will start sampling again for the 2023 bathing season."
        },
        {
            "text": "Overall higher standards have driven improvements to water quality protecting bathing waters, tourism, health and local economies. The long-term trend remains upward but it is vital that all those responsible for protecting water work with the Environment Agency to ensure it stays this way."
        },
        {
            "text": " "
        }
    ]
}