{
    "url": "https://naturalengland.blog.gov.uk/2022/12/02/cop27-a-personal-perspective/",
    "title": "COP27 – a personal perspective",
    "authors": [
        "Mike Morecroft"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Natural England",
        "Uncategorized"
    ],
    "pub_date": "2022-12-02T14:07:41+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Another year, another climate change COP! COP27 (Conference of Parties) was my second, having attended COP26 in Glasgow last year. This year’s was distinctly different for me: partly because of the location – Glasgow and Sharm el Sheikh are very different in culture, climate, landscape and logistics were rather more complicated! However, more importantly from a personal perspective, this year I was there to present the results of the Intergovernmental Panel on Climate Change’s (IPCC) 6th assessment report, alongside some of my fellow authors. It’s nearly 4 years since we commenced work on the Impacts and Adaptation Report of which I was a ‘Coordinating Lead Author’, jointly leading a terrific international team in writing the Terrestrial and Freshwater Ecosystems chapter. It was a mammoth exercise, made harder by the challenges of Covid, so it was also great to be able to present our key findings alongside colleagues I’ve worked with remotely for so long. I contributed to 3 sessions on Nature-based Solutions, adaptation for ecosystems and climate resilient development: You can watch all of them – and many others - on the IPCC’s YouTube channel (https://www.youtube.com/@IPCCGeneva/streams)."
        },
        {
            "text": "The central business of the COP is the negotiations around the development and implementation of the UN Framework Convention on Climate Change (UNFCCC). This goes on in intense sessions between negotiating teams from most of the governments of the world. There is however a vast range of ‘side events’ and other activities that support this directly or indirectly. The IPCC reports were one of many subjects of discussion but play a critical role in the UNFCCC processes. They are the most comprehensive and reliable assessments of the scientific literature on climate change and the overarching ‘cover decision’ from COP27 makes several mentions of them."
        },
        {
            "text": "COP27 will probably be remembered as the point at which developed countries formally accepted a degree of responsibility for ‘Loss and Damage’ from climate change, as a result of historical emissions. Up to now developing countries have received funding to help develop green energy supplies and adapt to climate change. The Loss and Damage fund which was established, will go beyond this recognising that some adverse impacts of climate change can’t be prevented by adaptation and that the countries who are suffering most are often those who have emitted the least greenhouse gases. Recent examples, such as the floods in Pakistan and Nigeria, drought in East Africa and the impacts of rising sea levels on low-lying islands, featured prominently in many speeches and discussions at the COP. Agreement to establish a fund to address this is a massive step forward in the eyes of the most vulnerable and least developed countries, albeit that a lot of details need to be worked out, not least how big the fund should be and how much different nations will contribute."
        },
        {
            "text": "Less progress was made in securing additional commitments to reducing emissions, especially by some of the large fossil fuel producing and using states. Holding global warming to 1.5°C becomes more difficult with each year that passes and this lack of progress was deeply frustrating for many of us."
        },
        {
            "text": "My specific scientific expertise is in how we can reduce risks to ecosystems and how nature-based solutions (NBS) can contribute to climate change adaptation and mitigation. This featured prominently in our IPCC report and was what I talked about. The evidence base has developed substantially over the last 10 years. A key message is that we need to protect existing natural ecosystems and restore damaged and degraded ones on a large scale. This is important for reducing emissions, but also for making habitats and species populations more resilient. Healthy natural ecosystems can also reduce risks to people from, for example, floods, droughts and rising sea level. COP decisions recognised the importance of protecting and restoring nature and for the first time the official text explicitly encouraged countries to consider using ‘nature-based solutions’. It is also however clear that NBS can be badly implemented and need to be based on good scientific and practical understanding, respecting the needs and rights of local and Indigenous communities."
        },
        {
            "text": "International policy on nature is also shaped by other UN conventions, especially the Convention on Biological Diversity, which has its own COP15 in the coming weeks. We are increasingly aware of the importance of tackling climate change and loss of biodiversity in a joined-up way – neither can succeed without the other. In particular, the initiative for a ‘30 x 30’ target to protect and conserve 30% of the Earth’s surface by 2030 would make a significant contribution to climate change mitigation and adaptation as well as helping to stem biodiversity loss."
        },
        {
            "text": "Attending a COP is a tiring and sometimes overwhelming experience – approximately 30,000 people attended over the two weeks and there were large numbers of sessions happening in parallel: even finding your way around the vast conference centre was challenging! On the other hand, there is an undeniable excitement in seeing the nations of the world coming together and knowing that, at least for a few days, world leaders were turning their attention to climate change. COP may have grown too big, and it is right to minimise travel for carbon and other reasons: I am not likely to attend next year’s meeting now we have presented our report. However occasional face to face contact is valuable and refreshing and I certainly appreciated it after the countless Zoom and Teams meetings of the last few years!"
        },
        {
            "text": "By Mike Morecroft."
        }
    ]
}