{
    "url": "https://securityprofession.blog.gov.uk/2022/12/02/developing-an-inclusive-and-skilled-cyber-security-profession/",
    "title": "Developing An Inclusive and Skilled Cyber Security Profession",
    "authors": [
        "Angela Fisher"
    ],
    "categories": [
        "Events",
        "Government Security",
        "Training and qualifications"
    ],
    "pub_date": "2022-12-02T09:24:44+00:00",
    "content": [
        {
            "text": "The Government Cyber Security Conference took place on 16 November 2022. Run as a hybrid event for the first time, the plenary sessions on the main stage reached an audience of over 400 attending in person or online. The agenda boasted an impressive range of speakers including Alex Chisholm, Chief Operating Officer for the Civil Service and Permanent Secretary for the Cabinet Office, Vincent Devine, Government Chief Security Officer and Head of the Government Security Function. and Jeff Moss, Founder of BlackHat and DEF CON."
        },
        {
            "text": "Bella Powell, Director of the newly formed Cyber Directorate in Government Security Group (GSG) introduced the keynote address which was delivered by Baroness Neville-Rolfe DBE CMB. The Baroness focused on the need to strengthen Government Cyber Security."
        },
        {
            "text": "This theme was developed by Victor Zhora, (Deputy Head , Chief Transformation Officer at the State Service of Special Communications and Information Protection of Ukraine) who spoke about redefining good cyber resilience in light of the Ukraine Crisis. He also participated in an international panel discussion which focussed on driving down Government Cyber risks."
        },
        {
            "heading": 3,
            "text": "Why does cyber security remain our greatest challenge?"
        },
        {
            "text": "The topics covered were as wide ranging as the speakers. However one of the main themes was the need to recruit and retain skilled cyber professionals. This subject was raised by a number of audience questions and continued in a panel discussion about Developing An Inclusive and Skilled Cyber Security Profession moderated by Srishti Krishnamoorthy-Cavell, Head of Future Strategy  who described her own unique career path into cyber via a degree in English Literature."
        },
        {
            "heading": 3,
            "text": "What is it like to work in cyber?"
        },
        {
            "text": "Conference delegates were invited to share their motivations for working in Government Cyber Security. Their responses showed how passionately the majority felt about the importance of the work that they do and the pride that they feel about working in this sector which they described as:"
        },
        {
            "heading": 3,
            "text": "Government Cyber Security Strategy 2022-2030"
        },
        {
            "text": "Other highlights included updates on the delivery of the Government Security Strategy  by Pete Cooper, Deputy Director of Cyber Security and a breakout session focusing on two of its key deliverables:"
        },
        {
            "text": "The conference highlighted the challenges that cyber presents and the commitment and hard-work of those working in it."
        }
    ]
}