{
    "url": "https://lifeathmrc.blog.gov.uk/2022/12/02/emma-reflects-on-her-rewarding-volunteering-experiences-for-international-volunteers-day/",
    "title": "Emma reflects on her rewarding volunteering experiences for International Volunteers Day",
    "authors": [
        "ebonydouglas"
    ],
    "categories": [
        "Culture & Values",
        "Digital Apprentices",
        "General",
        "Inclusion",
        "Working with the community"
    ],
    "pub_date": "2022-12-02T11:24:05+00:00",
    "content": [
        {
            "text": "We celebrate solidarity through volunteering often here, as we have Enterprise Advisors who contribute their time to helping young people with their career choices by expanding their understanding of what it's like to work in an organisation like HMRC."
        },
        {
            "text": "For International Volunteer Day, we caught up with Emma as she shares her experience."
        },
        {
            "heading": 2,
            "text": "Tell us a bit more about your role? "
        },
        {
            "text": "My name is Emma - I am a Learning and Development Manager and support the developmental needs of colleagues in the finance directorate. My role is to design and deliver training and learning to over 2,500 people in the directorate."
        },
        {
            "text": "I absolutely love my role - I have found my passion, as I enjoy sharing my experiences and lessons with others, to help them better themselves."
        },
        {
            "heading": 2,
            "text": "Why volunteering? "
        },
        {
            "text": "I have always had an interest in helping people. This has been through mentoring, coaching and now actually making sure people get the resources and teaching they need to help them with their work. This led me into volunteering - I am an Enterprise Advisor which works with a local school or college, helping them with their Careers programme from a strategic perspective. I am linked to two local schools in my local area which motivates me even more."
        },
        {
            "text": "I also really wanted to pay something back to the school system, whilst growing our next generation’s working culture. There are so many myths out there that young people hear, and I want to break those stereotypes. Especially working at HMRC, young people assume if you work there, you will need to be good at maths. This is not necessarily the case as there are many jobs at HMRC and the Civil Service that are not mathematical."
        },
        {
            "heading": 2,
            "text": "What is the reaction from young people when you tell them about HMRC Careers and #LifeatHMRC "
        },
        {
            "text": "Working with young people is so rewarding, helping them to see what skills they have to offer, at school and extra curriculum activities, but also once they leave school. Once you start talking to people about the vast number of jobs and opportunities available, you get to experience their lightbulb moment where they start think, ‘I could do that’."
        },
        {
            "text": "A few months ago, I was talking to a group of year 10 students (14 – 15-year-olds) who are in their first year of GCSEs. I spoke to them about careers and what they are looking to do as a career, and some of them had no idea. The conversation moved on to talking about the skills they currently have. Let’s take team working; a skill most careers require, at first, none of them could think of any examples."
        },
        {
            "text": "Taking a different approach, I started talking to them about what they enjoyed doing for example football or playing on their computer with their friends. When you explain that their favourite activities incorporate a lot of team working, they stop and you see their eyes light up."
        },
        {
            "text": "It’s a magical moment when a student realises that they have skills needed in the workplace and can look forward to a career after their education."
        },
        {
            "heading": 2,
            "text": "You are also an Enterprise Advisor, is this why you can speak to young people about HMRC Apprenticeships? "
        },
        {
            "text": "I also go into schools to talk to them about the apprenticeships that HMRC offers and that you don’t have to amazing at maths or any one subject. This is also part of the Enterprise Advisor role, but something that anyone can get involved in as part of volunteering. Most of the students are so surprised to see that they can work, gain the benefits, and gain a qualification at the end."
        },
        {
            "text": "I use the strap line ‘earn while you learn’. This seems to resonate with students and they are curious as to what the Civil Service could be like for them. They realise there is a role for everyone regardless of your background, your race, your gender. We are all-inclusive."
        },
        {
            "heading": 2,
            "text": "Finally, any final thoughts about your volunteering experience overall"
        },
        {
            "text": "Being able to volunteer and do something I am passionate about is one of the most amazing opportunities at HMRC. It is not to say that every role can be as flexible, but everyone gets an opportunity to volunteer. Whether that is helping in schools with CV writing and interviewing skills or helping people on the Princes’ Trust. We all get to help each other as well with mentoring, coaching and other job opportunities. HMRC recognises the benefits of giving back to each other and to the community that we serve as civil servants."
        },
        {
            "heading": 2,
            "text": "Join Us"
        },
        {
            "text": "We have a wide range of roles available, with vacancies being added to Civil Service Jobs each week. Check our current vacancies and apply now."
        },
        {
            "text": " "
        }
    ]
}