{
    "url": "https://apprenticeships.blog.gov.uk/2022/12/02/from-paralympics-to-apprenticeship-marking-international-day-of-persons-with-disabilities/",
    "title": "From Paralympics to apprenticeship: marking International Day of Persons with Disabilities",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentice panel",
        "Apprentices",
        "Employers"
    ],
    "pub_date": "2022-12-02T16:09:08+00:00",
    "content": [
        {
            "text": "December 3rd is the United Nations' International Day of Persons with Disabilities."
        },
        {
            "text": "Former double Paralympic swimmer Amy Marren is a solicitor apprentice and member of IfATE's panel of apprentices. Here, she gives her thoughts as a disabled person in the workplace."
        },
        {
            "heading": 2,
            "text": "How was it moving from the Paralympics to the workplace?"
        },
        {
            "text": "I do not always think that disabled people feel that the world of work is as accepting of them. After competing in the Rio 2016 Paralympic Games, I continued competing at an elite level. In 2017, I moved into the world of apprenticeships (whilst still training and competing) and the work environment I suddenly found myself in made me realise that employers need more guidance on this matter. It was a weird dynamic to move between and witness that shift."
        },
        {
            "text": "At the Paralympics, everything to do with disabilities was celebrated and people were constantly having honest, open, and fun conversations with each other. We regularly used humour to describe the situations we found ourselves in and we trusted each other to set the boundaries around what we felt comfortable sharing. Everything had been thought about as well – the medals had braille and there were charging points for wheelchairs, for example."
        },
        {
            "text": "Meanwhile, in office settings, everything around disability was really quite cushioned and it seemed like people were walking on eggshells and only making adaptions to the environment when issues arose. Eventually, I found myself hesitating too and that’s why I want to now be proactive and help businesses get past this awkwardness."
        },
        {
            "heading": 2,
            "text": "What needs to happen to increase the understanding of disability in the workplace?"
        },
        {
            "text": "People today have so many different opinions, it is true you run the risk of offending, but conversations still have to be had. It’s the only way we will educate ourselves properly on the right and wrong way of doing things and make people with disabilities feel like they belong in any environment. I now advise IfATE on the best approach for this with all apprentice employers, as a member of their apprentice advisory panel."
        },
        {
            "text": "It's important to broaden your understanding of disability if you are looking to recruit disabled candidates. There is a huge spectrum of disabilities and whilst an individual may not be aware of all of them, educating all staff within the business as much as possible is very important."
        },
        {
            "heading": 2,
            "text": "How can businesses improve on accessibility?"
        },
        {
            "text": "Business need to showcase the disabled talent they already have – as a young apprentice it would have been a comfort to see someone with my disability having a successful professional career within the business. They also need to show people they belong in your business. Ensure the appropriate reasonable adjustments are already put in place for those who may need it, making sure they feel comfortable and that they can perform their best from the minute they arrive."
        },
        {
            "text": "Make sure that job advertisements are accessible to welcome more disabled applicants. Where possible, businesses should look to make websites, materials, and other recruitment tools easy to access for disabled people."
        },
        {
            "text": "And, importantly, see the person before the disability. Businesses and staff should approach disability with a positive attitude. Businesses should see the person rather than the disability, and in turn encourage staff to comfortably discuss and listen to the needs of the disabled colleagues."
        }
    ]
}