{
    "url": "https://defradigital.blog.gov.uk/2022/12/02/my-hidden-disability-story/",
    "title": "My hidden disability story",
    "authors": [
        "Clare Hussey"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-12-02T07:30:11+00:00",
    "content": [
        {
            "text": "Ahead of International Day of Persons with Disabilities (IDPD) Senior User Researcher Clare Hussey reflects on how she discovered that she has dyslexia, and the difference this has made to her working life, and to life outside of work."
        },
        {
            "text": "I didn’t know that I had dyslexia until I was diagnosed in 2018, at age 44. I’d managed to do a lot before that diagnosis (even completing a Design PhD in 2007) but the diagnosis was still hugely helpful."
        },
        {
            "text": "It helped my history ‘make sense’ (for example not having great working memory), and also set me on a mission to learn more about dyslexia and neurodiversity, more generally, not only to help myself, but to also help others."
        },
        {
            "heading": 2,
            "text": "Getting diagnosed"
        },
        {
            "text": "It was thanks to my line manager that I got a diagnosis. I was a user researcher at HMRC, on a stressful project at a stressful time, and I started having issues with my memory and even talking (anyone who knows me will know that I usually don’t have issues talking!)."
        },
        {
            "text": "When I searched online these came up as symptoms of dyslexia. My line manager’s son had just been diagnosed as having dyslexia, and she suggested that work could help get a diagnosis and support. An educational psychologist assessment confirmed that I had dyslexia."
        },
        {
            "heading": 2,
            "text": "Support and reasonable adjustments"
        },
        {
            "text": "My diagnosis made it easier to get advice on reasonable adjustments. I already knew about reasonable adjustments from previous work as a Health and Safety auditor. However, the diagnosis meant that I was able to have a specialist assessor come and give advice on what I needed. This included noise cancelling headphones, software to read text aloud, more time to do things, and some training. I also got a civil service disability passport."
        },
        {
            "text": "As someone with dyslexia, a lot of my support needs are often fairly simple, and about helping my working memory. I need space to concentrate, and for people to split long blocks of text into summaries and bullet points. These adjustments also usually make things better for everyone."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Helping others"
        },
        {
            "text": "After I got my diagnosis, I couldn’t find a support network. I saw a job ad for a voluntary post as the chair for the cross-government Civil Service Dyslexia and Dyspraxia Network (CSDDN) and applied. While I didn’t get the post, I was invited to be part of the board for leading diagnosis and support."
        },
        {
            "text": "Since I’ve joined the CSDDN, we’ve released a Dyslexia, Dyspraxia, Dyscalculia and Dysgraphia Line Managers Toolkit. We informally call this the “4 D’s Toolkit”. This month we also released a poster on how to design for people with dyscalculia and number anxiety."
        },
        {
            "text": "While I was at HMRC, I also managed to get a senior person in the department to sign off on a programme level neurodiversity network (this also includes ADHD and autism). Now that I’m at Defra, I’m co-chair of the Defra neurodiversity network, and attend the wider disability network."
        },
        {
            "text": "It’s a privilege to work with people that are neurodiverse, and I do so at a departmental and cross government level. The people that are involved are passionate about making a difference."
        },
        {
            "text": "I’ve also loved being able to use my skills as a user researcher in championing work on neurodiversity, especially the importance of evidence-based decision making. At the CSDDN I’m currently working on getting evidence to improve the civil service recruitment process for neurodivergent job applicants."
        },
        {
            "heading": 2,
            "text": "Being diagnosed has also helped me outside of work"
        },
        {
            "text": "My dyslexia brings challenges as well as strengths, they have always been there, but now I know to celebrate what is good, and be kinder to myself where I am not so good."
        },
        {
            "text": "For instance, I have excellent spatial awareness and sense of direction, and rarely get lost, anywhere. On the flip side, I don’t know my right from my left, so I am hopeless at giving others the directions to get somewhere or receiving directions; as soon as I hear them, my poor working memory has forgotten them."
        },
        {
            "text": "Numbers are something I really struggle with. I discovered this is one of the more common traits of dyslexia and other neurodivergent conditions. For me it’s particularly stressful each month using online banking to pay my credit card. I need to be in a relaxed frame of mind before I psych myself up to do it. I’ve learnt to have notepads, paper, calculator, also coded notes of passwords in case the facial recognition of the tech doesn’t work."
        },
        {
            "text": "You can tell I have devised my own workaround to help me with numbers. The exciting thing about the number anxiety poster, is its potential to help government departments and financial institutions see at a glance where people are struggling, in order to make improvements."
        },
        {
            "heading": 2,
            "text": "How we can all support colleagues, friends, or family members with disabilities"
        },
        {
            "text": "If you want to learn more about supporting colleagues, friends or family members with disabilities, the ACAS Disability at Work resources are really useful, with lots of examples, such as on reasonable adjustments."
        },
        {
            "text": "I’d also love to hear other people’s experiences, so do please leave me a comment here."
        }
    ]
}