{
    "url": "https://environmentagency.blog.gov.uk/2022/12/02/planning-new-development-in-a-climate-emergency/",
    "title": "Planning new development in a climate emergency",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2022-12-02T14:18:33+00:00",
    "content": [
        {
            "text": "By Sam Kipling, Senior Advisor on Coast & Development Planning"
        },
        {
            "text": "I experienced flooding once. Sort of. The ballcock broke on my header tank and, for some reason, it didn’t have an overflow, so water poured from my attic, down to the ground floor. Thankfully someone was there to shut the water off fairly quickly. Had they not been, the whole house would have filled up like a goldfish bowl. Thankfully it was clean water. We didn’t lose any personal possessions. We didn’t have to move out. We had insurance. Yet the whole experience was deeply stressful and unpleasant."
        },
        {
            "text": "I’ll never forget the noise from the industrial fans and dehumidifiers that filled our home for the following weeks. I can only image how much worse it would have been had it been floodwater mixed with raw sewage to a depth that would have committed our kitchen, sofas, carpets and personal possessions to landfill. Or if we’d been displaced from our home. Or if our insurers had said ‘no’. Or if our community had been similarly affected, leaving them less able to offer us the help and support we so desperately needed."
        },
        {
            "text": "It’s this tiny personal insight combined with the accounts of those who have experienced far worse, which motivate me to do all I can to ensure the planning system helps to prevent others from experiencing the same. Andrew Manser’s account of the 1953 east coast tidal surge stays with me every day. It’s the voice in my ear, guarding against complacency and hubris."
        },
        {
            "text": "There are already well over 5 million properties in flood risk areas. This number will get much bigger as climate change causes those flood risk areas to grow. We expect development trends to nearly double the number over the next 50 years. The planning system is uniquely placed to steer development away from flood risk areas. It will also play an absolutely crucial role in making sure that where development has to take place in flood risk areas, these trends don’t result in an increase in flood damages - and the misery that goes with it."
        },
        {
            "text": "New development has to stand on its own two feet. It won’t be eligible for the insurance safety net of FloodRE. Nor can new development be counted in the cost/benefit case for government grant-in-aid funding for things like new and improved flood defences. We also know that increasing awareness of climate risks among financial institutions like banks, building societies and insurers, is likely to lead to more sophisticated approaches to the availability and affordability of products like loans, mortgages and insurance, as they better account for both the location and the design of development."
        },
        {
            "text": "Our involvement in the government’s policy review in 2021 gave us some invaluable insights to what’s working well and where there is room for improvement. The good news is that, whilst there is a need for some improvements, the existing policies are fundamentally the right ones. However, the review also showed there are sometimes significant gaps between policy and its implementation on the ground."
        },
        {
            "text": "The strong message from local planning authorities (LPAs) is that they need more help and support on this topic. We’ve listened, so we’re partnering with organisations like the Town and Country Planning Association (TCPA), Construction Industry Research and Information Association (CIRIA) Susdrain and the Association of Sustainable Drainage Authorities (ASA) to try to help meet this need."
        },
        {
            "text": "We’re running a training session with the TCPA on the recent update to the planning practice guidance on flood risk and coastal change. The event is aimed at local authority planners and will take place on 13th December. You can find more details and register for the event here. The TCPA have also issued a training and skills survey for local planning authorities to help us better understand LPA training needs and priorities. Completing the survey will help steer our work with the TCPA over the next two years. The survey closes on 18th December."
        },
        {
            "text": "Creating climate resilient places lies at the heart of our Flood and Coastal Erosion Risk Management Strategy. Our FCERM Strategy Roadmap to 2026 sets out how we’ll work with partners to implement the Strategy over the next five years. The ‘Planning for the climate emergency’ video was the start of a much longer journey we need to go on with LPAs, Lead Local Flood Authorities and other place-makers to empower people to tackle the climate emergency head-on. I look forward to the ride."
        },
        {
            "text": " "
        }
    ]
}