{
    "url": "https://environmentagency.blog.gov.uk/2022/12/02/saline-incursion-on-the-norfolk-broads/",
    "title": "Saline incursion on the Norfolk Broads",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-12-02T09:49:16+00:00",
    "content": [
        {
            "text": "By Arnie Warsop"
        },
        {
            "text": "Fisheries officer, Arnie Warsop, explains what saline incursion is and how the work of the Environment Agency protects up to half a million fish from these incursion events on the Norfolk and Suffolk Broads.  "
        },
        {
            "text": "The Broads are a unique and important environment for wildlife, angling and tourism. They cover an area of 300 square kilometres, and the Environment Agency helps to manage and protect them with partners and volunteer groups. However, one issue the Broads face is saline incursion."
        },
        {
            "text": "A saline incursion is a naturally occurring phenomenon which happens when salt water from the North Sea travels up the River Yare at Great Yarmouth and into the freshwater Broadland Rivers. These typically occur with high tides and when there is a north-westerly wind. They can be particularly serious when high tides become ‘locked’ in the Broads and saltwater cannot drain away during the low tides."
        },
        {
            "text": "Freshwater fish are not able to tolerate highly concentrated saline conditions, so they move upstream or into ditches, boatyards, and dykes to try to escape. During winter months large numbers of fish naturally gather in these locations. Saline water can sometimes move into these fish ‘holding’ areas which can be problematic because the fish then struggle to escape."
        },
        {
            "text": "Subsequently, saline incursions can result in large-scale freshwater fish deaths, particularly of roach, rudd, bream, perch and pike. Other invertebrate populations can also be affected by the salinity which ultimately reduces food resource for fish and other wildlife if the incursion is far reaching or prolonged."
        },
        {
            "text": "To help protect fish stocks, the Environment Agency continuously monitors saline levels on the River Bure and River Yare. Our fisheries team also owns and operates a barrier across the entrance to Herbert Woods Marina boatyard at Potter Heigham. When this barrier is closed, it stops saltwater from entering the Marina. The barrier is located here to protect the large number of fish that spend the winter months at this site. It is important to note that closing the barrier only protects a very small area of the Broads and doesn’t prevent saline incursion happening in the rest of the system."
        },
        {
            "text": "When a saline event is forecast to reach the Potter Heigham boatyard and fish are likely to become trapped, we always aim to close the barrier on a precautionary basis. We work with the boatyard to do this, but it isn’t always possible due to the impact it can have on their business."
        },
        {
            "text": "To mitigate this, officers undertake fish rescues and remove fish from the affected areas. The fish are then released into areas not affected by the saline incursion. It is not possible to rescue all the fish due to the size and scale of the Broads. We prioritise the areas that are most at risk or contain the greatest fish populations. It is estimated that during a saline incursion up to half a million fish are rescued and better protected by the work of the Environment Agency."
        },
        {
            "text": "Anglers also play an important role by recording salinity concentrations in the Broads which helps our understanding of the extent and duration of these events. We are keen to continue this partnership working and explore what more can be done to protect fish. We are currently investigating fish deterrent methods to prevent fish from shoaling and becoming trapped within the many boat dykes, ditches and channels in the lower Broads system."
        },
        {
            "text": "Saline incursion events are likely to become more frequent with the impacts of climate change. As sea levels rise, saltwater will be pushed further up the Broads system. Meanwhile, drought and reduced summer rainfall lowers freshwater flow which reduces the natural flushing out of the system. Despite these saline events the fish population in the Broads is resilient and anglers continue to enjoy excellent catches in this beautiful part of the country."
        },
        {
            "text": "If you see fish in distress on any river or body of water, please contact the Environment Agency Incident Number on 0800 807060."
        }
    ]
}