{
    "url": "https://space.blog.gov.uk/2022/12/02/the-night-sky-in-december-3/",
    "title": "The night sky in December",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-12-02T15:11:41+00:00",
    "content": [
        {
            "text": "December brings the winter solstice on 21 December, where the lean of the northern half of Earth away from the Sun reaches its maximum point."
        },
        {
            "text": "This means the Sun will be lowest in the sky, bringing the shortest day and longest night of the year.  This marks the start of astronomical winter – and provides plenty of hours of darkness for stargazing!"
        },
        {
            "text": "This month, Mars and Earth are at their closest point to each other in their orbits around the Sun, which means Mars is at its brightest, sitting between the constellations of Taurus, Auriga and Orion."
        },
        {
            "text": "Mars will be completely eclipsed by the full Moon in the early hours of 8 December – a particularly spectacular sight through binoculars or a telescope.  Our Solar System neighbours will appear shortly before 5am (depending on your location) before Mars is eclipsed, with the red planet reappearing on the other side of the Moon around an hour later."
        },
        {
            "text": "December is a great time to try and spot some of the night sky’s most distinctive objects.  The Pleiades and Hyades star clusters sit in the east after dark in the constellation of Taurus.  Though it carries the nickname ‘the Seven Sisters’ because of its brighter members, Pleiades contains around 3,000 stars, while Hyades hosts around 500."
        },
        {
            "text": "Saturn is still visible in the south-west, though it is Jupiter in the south that is the brightest object in this patch of sky.  Those with darker skies may want to try and spot the Andromeda Galaxy.  This fuzzy patch of light sits high in the south and is the most distant object we can see with the naked eye, even though it is around 2.5 million light years away!"
        },
        {
            "text": "To the west, the constellations of Cygnus and Aquila drop towards the horizon soon after dark.  These constellations are made of bright stars that sit in the line of sight of one of the inner spiral arms of our Milky Way Galaxy, so appear more densely packed with stars than most of the constellations."
        },
        {
            "heading": 2,
            "text": "Meteor showers"
        },
        {
            "text": "December hosts one of the most spectacular meteor showers in the calendar, the Geminids, which peaks around 13 and 14 December and often produces over 100 meteors an hour.  More meteors will be visible after midnight, where tiny fragments of rock and dust left behind the 6km (3.5 mile)-wide rocky asteroid known as 3200-Phaethon will hit our atmosphere at 35km (20 miles) per second!"
        },
        {
            "text": "This asteroid’s orbit means that every year and a half, it travels in from beyond the orbit of Mars passing close to the Sun, heating up as it does so, and leaving a trail of dust and fragments of rock that Earth passes through every year."
        },
        {
            "text": "Don’t forget to look out for the Quadrantids meteor shower, another prolific and spectacular meteor shower that’s expected to peak around 3 – 4 January. It’s known for producing blue-ish meteors with occasional bright fireballs, so wrap up warm and spend some time watching the sky with your back to the moon for the best chance to see these meteors blazing through our atmosphere at 40km (25 miles) per second!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Space science and exploration"
        },
        {
            "text": "The Artemis I mission launched successfully last month, and NASA report that the Orion spacecraft that will carry astronauts to the Moon in the coming years has been performing well."
        },
        {
            "text": "The capsule is scheduled to return to Earth on 11 December.  It will re-enter Earth’s atmosphere at 40,000km/h (24,500mph), testing the heat-shield’s ability to slow it down to around 500km/h (300mph), before parachutes open to provide a gentle splashdown in the Pacific Ocean."
        },
        {
            "text": "The ‘Ingenuity’ helicopter that accompanied the Perseverance Rover to Mars in February 2021 completed its 34th flight last month.  When it began operations on the red planet, it was hoped the 1.8kg technology demonstration might achieve three or four flights, and survive around 30 days (or more accurately, 30 Martian nights, where temperatures drop to -90 degrees centigrade).  You can find out more about the mission here."
        },
        {
            "text": "Thanks for following these blogs. Wishing you a very happy, peaceful Christmas, clear skies and plenty of meteors!"
        }
    ]
}