{
    "url": "https://socialcare.blog.gov.uk/2022/12/02/vaccination-shared-responsibility-for-shared-lives-carers/",
    "title": "Vaccination: shared responsibility for Shared Lives carers",
    "authors": [
        "Mike Jacobs"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-12-02T11:12:40+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Good health is a shared endeavour"
        },
        {
            "text": "As a Shared Lives carer there's nothing more important than maintaining your own good health and thus availability to those you care for."
        },
        {
            "text": "Both flu and COVID-19 can take an individual out of action for several days at best, several months at worst. As carers, we have kept in frequent contact with our local NHS to get the necessary jabs as soon as possible."
        },
        {
            "text": "During the lockdown, which was a very difficult period, I ensured our whole family and the person we support were vaccinated as soon as possible, to make sure we were all safe. It was really simple too – I was surprised about how quick and well organised it was."
        },
        {
            "text": "When, as a couple you reflect on what it is you do as carers, the thought of the weekly tasks being undertaken by just one of you is quite a worry. If both of us fell sick together then the necessary arrangements would be considerable."
        },
        {
            "text": "It's also been very important for the person we support to get timely jabs. If he were to be sick, the task of effective care is all the more difficult. Covid-19 infections, especially, would present very significant difficulty, with the necessary physical separation."
        },
        {
            "text": "Flu and covid-19 vaccinations are an essential part of good health and physical well-being in order to undertake the rigours of caring and to be cared for. I urge all Shared Lives carers and, for that matter, everyone working in social care, to make sure they and their loved ones are vaccinated."
        }
    ]
}