{
    "url": "https://grantscommunity.blog.gov.uk/2022/05/19/co-creating-digital-services-for-everyone/",
    "title": "Co-creating digital services for everyone",
    "authors": [
        "emiliaokoye"
    ],
    "categories": [
        "Accessibility",
        "Civil Service",
        "Global Accessibility Awareness Day",
        "Government Grants Management Function",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2022-05-19T09:11:34+01:00",
    "content": [
        {
            "text": "If the statistics from Global Accessibility Awareness Day's website on people with disabilities worldwide are right, I am one in a billion. "
        },
        {
            "text": "But I really don’t want to be seen as a number but as a person who should also be able to experience digital services and content as successfully as everyone else.  "
        },
        {
            "heading": 2,
            "text": "Digital access and inclusion"
        },
        {
            "text": "For creators of new digital services to do this for me and others, they need our support to ensure digital access and inclusion for people with disabilities. "
        },
        {
            "text": "Many people I come across in government don’t just want to meet the accessibility standards, they want to really make sure their service works for the widest range of people and their needs as possible. "
        },
        {
            "text": "That is why I was delighted to respond to the call for support from the Grants Applicant Programme. They are actively looking for people with disabilities to help co-create, test and develop the new Find a Grant Service.  "
        },
        {
            "text": "After a short call with the team, I could tell that they are serious and in no way is this a tick box exercise for the team.  They have listened carefully to what my condition is and what my needs are, so that supporting them works for me and for them. And, I am booked for the first session next week - having only signed up a few weeks ago. "
        },
        {
            "text": "What will I be doing? As someone with a visual impairment, I will be making sure that someone like me can use the service fully. I really liked the way they explained their approach - that my job was to mark their homework and test their assumptions about what works. That it was absolutely not a test of my abilities but a test of theirs. How refreshing. "
        },
        {
            "heading": 2,
            "text": "You can get involved too"
        },
        {
            "text": "And the team is not just working with me - to test the system as a civil servant; they have the support of other people with other accessibility needs from government, the voluntary sector, community and social enterprise sectors and from small to medium-sized business. To make sure Find a Grant is fair, they have reached out to people with autism, dyslexia and other neuro-diverse conditions. However they could always do with more, as the team will be developing and expanding the pilot service between now and March 2023. "
        },
        {
            "text": "If you would like to support prospective and future grant applicants and prospective grant administrators who have accessibility needs like you, just get in touch with the team. You can sign up to the Government Grants Community by clicking here. And in the last question just let the team know that you are keen to support the accessibility testing. Then you will get an email to set up a video call to meet Lisa, Ari or Amy. They will give you an explanation of the work they are doing, answer any of your questions and discuss how, when and for how long you might like to support them to get this right. "
        },
        {
            "text": "Inclusion and accessibility is never about one day in the calendar. Accessibility is a vital part of delivering government services for the entire population and, by exploring the best way of doing this for Find a Grant, it's clear those with accessibility needs are being well and truly recognised in the design process."
        },
        {
            "text": "Do you want to help too? "
        },
        {
            "text": "Emilia Okoye "
        },
        {
            "text": "Government Commercial Function"
        }
    ]
}