{
    "url": "https://socialcare.blog.gov.uk/2022/05/19/dementia-action-week-social-cares-essential-role/",
    "title": "Dementia Action Week: social care's essential role",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Dementia",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2022-05-19T11:41:45+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Partners in person-centred support"
        },
        {
            "text": "At the risk of repeating myself, for pretty much every major disease or human condition, there is a social care dimension. For many reasons, some of them cultural and institutional, this vital thread in the wider web of health and care is frequently lost, as attention tends to be focused on the more clinical aspects of an innovation or strategy. Dementia care is no different."
        },
        {
            "text": "I welcome the Secretary of State for Health and Social Care’s recent announcement, during Dementia Action Week, of a 10 year Dementia Action Plan, to be launched later this year. The media has made much of the ambition to improve early diagnosis, treatment and boost research into finding a cure, and rightly so, but the social care sector remains an essential partner in the ongoing support of people living with dementia."
        },
        {
            "text": "We know already that demographic pressure, for now, is going only one way. By 2025, 1 million people in the UK are expected to have dementia, rising to 1.6 million by 2040."
        },
        {
            "text": "Social care nurses are arguably the experts in dementia care, not least because so many care home residents are already diagnosed with the condition. Many more colleagues have been specially trained in this area since the first G8 Dementia Summit of 2013. Indeed the Challenge on Dementia 2020 campaign, saw an important milestone reached, when one million care workers and one million NHS workers received dementia awareness training."
        },
        {
            "heading": 2,
            "text": "Holistic approaches"
        },
        {
            "text": "But more than the specific upskilling, we are specialists in person-centred care, we know that support goes beyond making sure residents take their medication. Great care is about listening to their needs, hopes and concerns and – in the case of pronounced dementia symptoms – creating environments and activities that help them retain their sense of self and encourage interaction with the world around them."
        },
        {
            "text": "I’ve said before in previous blogs how important research and evidence is in social care. We are absolutely equal partners with our NHS and clinical research counterparts, because so much dementia support involves sensory and environmental factors. The more we can prove what works in particular care settings, in tandem with clinical treatments and interventions, the more we can help replicate best practice elsewhere in the health and care system."
        },
        {
            "text": "Lastly, we should not forget our powers of advocacy. It is often social workers who are identified as playing this role and they perform it brilliantly, as they champion the rights and choices of people living with dementia and other cognitive conditions."
        },
        {
            "heading": 2,
            "text": "Experience is our advocacy"
        },
        {
            "text": "As social care colleagues, we can also be advocates for residents or those receiving domiciliary care, because we get to know them so well. We observe, understand and support them in their daily lives and provide insights to other health and care professionals about the strategies, therapies and interventions that may or may not work."
        },
        {
            "text": "The 10 year action plan is, therefore, an exciting opportunity for us to demonstrate the intrinsic value we bring to the support of people living with dementia. It’s also a spur to the ambitions of the recent white papers on social care reform and closer health and care integration, not least because dementia overlaps with so many other long term conditions."
        },
        {
            "text": "Our role as care professionals has never been so important or needed. We should be proud of the wisdom, compassion and experience we bring to supporting the lives of those living with dementia, and, by association, the peace of mind we give to their friends, families and loved ones."
        }
    ]
}