{
    "url": "https://aphascience.blog.gov.uk/2022/05/19/gardening-without-invasive-plants/",
    "title": "Gardening without invasive plants",
    "authors": [
        "Lucy Cornwell"
    ],
    "categories": [
        "Invasive Species",
        "Wildlife"
    ],
    "pub_date": "2022-05-19T09:00:57+01:00",
    "content": [
        {
            "text": "Plants are vital for our health and the environment. They improve air quality, boost our mood, improve our resilience to climate change, and provide a home for wildlife. Many of the plants in our gardens and ponds are not native to Britain - they have been introduced from all over the world by people. While non-native plants can add much to a garden, some may become invasive causing problems in the garden and the wider environment. Although only a small minority of non-native plants become invasive, the impact they can have is extensive and may be irreversible."
        },
        {
            "text": "Some invasive plants quickly form dense stands crowding out native plants reducing the local plant diversity and affecting other species that rely on native plants for food or shelter. The highly endangered tansy beetle (left) was reduced to a single population when its sole food source, the native tansy plant, became rare, partly due to competition from invasive Himalayan balsam (right)."
        },
        {
            "text": "Montbretia (left) is one of a number of invasive plants that have been introduced to the Lizard Peninsula in Cornwall, home to almost half of our native wildflower species, many of which are rare. Montbretia grows quickly outcompeting native species. Another introduced species, Hottentot fig (right), changes the soil conditions and nutrients, starving other plants."
        },
        {
            "text": "Rhododendron (left) can carry the plant disease organisms Phytophthora ramorum and P. kernoviae which are a serious threat to native species including oak, beech and larch. The Spanish bluebell (right) hybridises with our native bluebell, an iconic woodland species, which could lead to the loss of the native plant."
        },
        {
            "text": "Invasive aquatic plants such as water primrose (left) and floating pennywort (right) are particularly problematic if they escape into a natural waterbody, clogging waterways and reducing oxygen availability in the water, and interfering with recreation, making it harder for us to take part in activities such as fishing, sailing or paddling."
        },
        {
            "text": "Invasive plants can even harm our health. The sap of giant hogweed (left) can cause blistering of the skin on exposure to sunlight (right) and can leave the skin sensitised for years."
        },
        {
            "heading": 3,
            "text": "Removing invasive plants"
        },
        {
            "text": "Trying to remove problem plants from natural habitats, especially important nature conservation sites, is expensive and difficult. Often complete eradication is impossible, and millions of pounds are spent each year to limit their spread. Local Action Groups across the country are helping to control invasive plants, find out how APHA staff have been involved in efforts to tackle floating pennywort in our recent blog."
        },
        {
            "text": "Gardeners can help to prevent these problems by choosing plants which are less likely to become invasive, and making sure that all plants stay within the garden, pond, and aquarium, and aren’t planted or accidentally spread in the wild, find out more below."
        },
        {
            "heading": 3,
            "text": "Alternative plants to use in place of invasive species"
        },
        {
            "text": "Invasive non-native plants have sometimes been used in the past for difficult areas of the garden – a particularly exposed patch, for example, or where a bare wall needs to be covered quickly, but can quickly outgrow their space or become entrenched so that despite pulling out the original plant, new shoots keep on appearing."
        },
        {
            "text": "A new guidance booklet is available with over 160 plants that can be used in the garden in place of invasive plants. The list of plants was developed by Coventry University, based on a previous list produced by the RHS and Plantlife in 2010."
        },
        {
            "text": "Below are a few examples of species that you can plant to attract wildlife to your garden, but check the booklet for ideas for non-invasive trees, pond plants, climbers, architectural species, ground cover, and more."
        },
        {
            "text": "Yarrow (Achillea millefolium)"
        },
        {
            "text": "A compact herbaceous perennial that grows up to 50 cm tall, with aromatic ferny foliage and flat clusters of small pink/cream daisy-like flowers on upright stems from early summer to early autumn. Native to the UK and great for pollinators."
        },
        {
            "text": "Night-scented stock (Matthiola longipetala subsp. Bicornis)"
        },
        {
            "text": "A highly scented annual with grey green leaves and four petalled flowers in shades of pink and purple. Popular with pollinators."
        },
        {
            "text": "Purple angelica (Angelica gigas)"
        },
        {
            "text": "A striking biennial or short-lived perennial, grows up to 2 m tall, with toothed leaves. Produces dark red umbels of flowers on red stems in late summer. Great for pollinators and provides shelter for wildlife."
        },
        {
            "text": "Wintersweet (Chimomanthus praecox)"
        },
        {
            "text": "A deciduous shrub that grows up to 4 m tall, with long glossy leaves up to 20 cm long. Produces fragrant greenish-yellow flowers on the bare twigs in winter. Provides shelter for wildlife and food for birds."
        },
        {
            "text": "Burnet (Sanguisorba officianalis)"
        },
        {
            "text": "A herbaceous perennial with attractive leaves and small fluffy pink / purple flowers on branched stems. Provides shelter for wildlife and is great for pollinators."
        },
        {
            "heading": 3,
            "text": "Be Plant Wise"
        },
        {
            "text": "Even if you choose one of the plants above to grow in your garden, it’s still really important to Be Plant Wise:"
        },
        {
            "text": "Know what you grow - Choose the right plants for your garden, pond, aquarium and water features."
        },
        {
            "text": "Stop the spread - Keep your plants in your garden, don't plant them, or allow them to grow, in the wild. Even native plants can cause a problem if they are planted in the wrong place."
        },
        {
            "text": "Compost with care - Make sure nothing you remove from your garden or pond gets into the wild, you could be breaking the law if it does."
        },
        {
            "heading": 3,
            "text": "Submit your records"
        }
    ]
}