{
    "url": "https://deframedia.blog.gov.uk/2022/05/19/government-funding-backs-scallop-fishing-industry-breakthrough/",
    "title": "Government funding backs scallop fishing industry breakthrough",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-19T13:42:22+01:00",
    "content": [
        {
            "text": "Today we are looking at media coverage around the development of a world-first, environmentally-friendly technique for catching scallops which was supported by the UK Government’s Seafood Innovation Fund."
        },
        {
            "text": "Yesterday’s announcement received coverage across national, regional and trade titles, as well as regional broadcast, including the Independent, Evening Standard, ITV News, BBC South West and Express and Star."
        },
        {
            "text": "This new low-impact method was pioneered by scientists at Devon-based company Fishtek Marine and uses illuminated pots, dubbed ‘scallop discos’, to attract and catch scallops."
        },
        {
            "text": "Due to having 200 eyes, scallops were found to be particularly receptive to the lights and naturally moved towards them, making the lights an effective means to catch large quantities without trawling the seabed. Findings indicate this could replace traditional dredging methods which can have a damaging effect on valuable marine habitats."
        },
        {
            "text": "Fisheries Minister, Victoria Prentis, said:"
        },
        {
            "text": "“It is great to see Fishtek Marine benefitting from our Seafood Innovation Fund, and developing a world-first method for catching scallops in an environmentally sustainable way."
        },
        {
            "text": "“The funding is supporting innovation, helping industry use cutting edge technology and protecting the marine environment. It is also an important part of levelling up coastal communities – and it is great to see Devon leading the way.”"
        },
        {
            "text": "Suzanna Neville, Seafood Innovation Fund programme manager at Cefas, said:"
        },
        {
            "text": "“This is an important project that has the potential to make a real difference to the sustainability of the scallop fishery. The opportunity to transform commercial scallop harvesting has been made possible by providing funding for the development of early stage ideas. This is exactly the sort of innovative project that the SIF was set up to support, helping the UK lead the way in developing a sustainable seafood sector.”"
        },
        {
            "text": "The Seafood Innovation Fund, a multi-million programme funded by Defra and delivered by the Centre for Environment, Fisheries and Aquaculture Science (Cefas), is supporting innovative projects across the fishing, aquaculture and seafood industries that use cutting edge technology or new techniques to limit the impact of fisheries on the marine environment. The Fund brings together industry, academia and the UK’s wealth of scientific expertise to help the sector become more sustainable at every level."
        },
        {
            "text": "Bids for the next round of the Seafood Innovation Fund are due to open this summer."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}