{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/05/19/gse-connect-women-supporting-women-in-government-science-and-engineering/",
    "title": "GSE Connect: Women Supporting Women in Government Science and Engineering",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Collaborating & Networking",
        "Diversity & Inclusion",
        "GSE Profession Updates"
    ],
    "pub_date": "2022-05-19T18:24:53+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Introducing… GSE Connect"
        },
        {
            "text": "On 11 February 2021, International Day of Women and Girls in Science, the GSE Women’s Working Group began piloting a new scheme to support women in the GSE profession. GSE Connect is a networking and peer support scheme for women working in STEM-related roles. It aims to provide a space where women can come together and encourage one another in their career, and in their personal and professional development."
        },
        {
            "text": "The first 52"
        },
        {
            "text": "During the one-year pilot, 52 amazing women from across the GSE profession signed up to be partnered, at random, with someone from a different GSE organisation. Participants committed to meet regularly (virtually) with their partner throughout the next year for development-focused conversations. They were given suggestions around topics for discussion, how to structure their meetings, goal setting and how to support one another through active listening. However, they were also free to use their meetings however they chose. A key aim of the pilot was to understand whether this kind of peer support could have a meaningful positive impact for women in the GSE profession."
        },
        {
            "text": "The answer is “Yes!”"
        },
        {
            "text": "One year on, we are delighted to report that the answer is “Yes!” Participants’ responses to feedback surveys have been overwhelmingly positive. In the graphic above, you can see how participants summed up GSE Connect in one sentence. Participants supported each other to complete study courses, apply for promotion or development opportunities, build portfolios evidencing their skills, find out about new career opportunities, take on STEM volunteering roles and ease the stress of the pandemic. Many participants commented on the value of getting insights and perspectives from other parts of Government and the Civil Service. Survey responses also enabled us to make further improvements to the scheme."
        },
        {
            "text": "Onwards and upwards"
        },
        {
            "text": "Following the success of the pilot, we’re opening up GSE Connect to more participants. If you’re a woman working in Government Science and Engineering and you’d like to be part of a GSE Connect partnership, you can find more and sign up here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}