{
    "url": "https://forestrycommission.blog.gov.uk/2022/05/19/introducing-the-new-tree-production-capital-grant/",
    "title": "Introducing the new Tree Production Capital Grant",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2022-05-19T13:57:48+01:00",
    "content": [
        {
            "text": "Tree planting is a core part of the government agenda to reach net zero emissions by 2050. The government aims to at least treble tree planting rates in England and is committed to increasing planting across the UK to 30,000 hectares per year by the end of this parliament."
        },
        {
            "text": "The England Trees Action Plan outlined our commitment to increase sapling supply and build nursery capacity. To deliver this, we are providing funding to increase the domestic production of tree seed and saplings, with Forestry Commission shortly opening a new Tree Production Capital Grant. As planting rates go up, market demand for seed and saplings will increase, so this grant will help suppliers scale up and modernise their operations to meet a historic opportunity."
        },
        {
            "text": "This is part of the Nature for Climate Fund, and one of the multiple means through which the government is supporting the trees and forestry sector to grow sustainably, helping to meet the country’s goals for the environment, nature and the economy."
        },
        {
            "heading": 2,
            "text": "How will the Tree Production Capital Grant work?"
        },
        {
            "text": "The Tree Production Capital Grant is designed to help seed and sapling suppliers of all sizes, from established nurseries to smaller nurseries and new entrants looking to diversify into the sector. Any public, private, or third sector organisation who will use the funding to support their production of tree seed or saplings is encouraged to apply!"
        },
        {
            "text": "The grant will enable suppliers to bolster production at pace and has been designed to complement the innovation outputs of the Tree Production Innovation Fund, which provides support for research and development projects that will enhance UK tree production methods and has funded 16 projects to date. To learn more about projects funded by the Tree Production Innovation Fund, read our blog."
        },
        {
            "text": "The scale of funding available means that the Tree Production Capital Grant can support significant investments in expansion, automation and mechanisation of facilities and equipment. This will help to improve not only the quantity but also the quality, diversity, and biosecurity of supply."
        },
        {
            "text": "These multiple objectives will enable suppliers to produce a diverse range of planting material including a wide range of species and provenances, enabling creation of biodiverse, resilient woodlands which will be more resilient to climate change, pests and diseases. And by increasing domestic supply we will boost our green economy and mitigate against the biosecurity risks associated with importing planting material."
        },
        {
            "heading": 2,
            "text": "What level of funding can I apply for?"
        },
        {
            "text": "Between August 2022 and March 2025, £8.8m in capital grant funding will be made available through the TPCG. Funding will be split into two streams separating projects valued between £20,000 and £100,000 (Stream A), and those valued at greater than £100,000 (Stream B). Projects must have a minimum total cost of £20,000 to be eligible. The TPCG will provide 50% funding for projects up to a maximum of £175,000. Applicants may submit no more than one bid during each funding round."
        },
        {
            "text": "Applicants will be able to apply for up to 50% of the costs for capital projects and equipment. The types of projects and items eligible for funding under the Grant will include, for example:"
        },
        {
            "text": "The Tree Production Capital Grant is now open for applications, closing 30th June 2022. Through a single stage application process, applicants will be required to demonstrate how the grant contribution will enhance the quantity, quality, diversity and biosecurity of seed and or sapling production. Bids will be evaluated against a number of criteria in a competitive evaluation process."
        },
        {
            "text": "To apply for the grant visit www.gov.uk/guidance/tree-production-capital-grant."
        }
    ]
}