{
    "url": "https://socialcare.blog.gov.uk/2022/05/19/named-care-workers-the-case-for-expansion-across-adult-social-care/",
    "title": "Named care workers: the case for expansion across adult social care",
    "authors": [
        "Ewan King",
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Innovation",
        "Integrated care",
        "social work",
        "Workforce"
    ],
    "pub_date": "2022-05-19T14:18:32+00:00",
    "content": [
        {
            "text": "A named worker approach means providing dedicated caseworkers; main points of contact for people and their families and professional voices of challenge across the system. [Image by freepik.com]Ewan King: In 2018, we were part of a Department of Health and Social Care project looking at how people with learning disabilities, autism or mental health needs - and their families - can be in control of decisions about their own future."
        },
        {
            "text": "Crucially, in order to achieve this, it was important that people had access to a named social care worker. A named worker approach means providing dedicated caseworkers; main points of contact for people and their families and professional voices of challenge across the system."
        },
        {
            "text": "The 2018 project’s evaluation found that, not only did this approach greatly improve outcomes for people, but was it also delivered cost effectively. It’s been suggested that every £1 invested would anticipate a saving or costs avoided of £5.14. Now, the initiative of having a named worker is being extended to other people who draw on care and support. A recent SCIE webinar covered this issue."
        },
        {
            "heading": 2,
            "text": "The case for a named worker"
        },
        {
            "text": "It might be what the general public would naturally expect: Surely, people who draw on services have access to the same person so that they have they trust the person who supports them?"
        },
        {
            "text": "As with other public services there’s no unlimited pot of funding and, across social work and social care, it’s not always possible to have access to the same person. This can mean that the issue of trust is compromised, along with the person having to tell their story to other social workers and professionals."
        },
        {
            "text": "Yet people want to receive personalised and inclusive support, valuing strengths and aspirations. The worker knows that a person’s background, values and requirements are unique. We’re often told that folks want to experience a seamless care journey, where health and care services are joined up around them; and where they only have to tell their story once."
        },
        {
            "text": "So, it’s about having trusted relationships that provide meaningful opportunities for people to shape their plans that respond to individual communication needs and preferences."
        },
        {
            "heading": 2,
            "text": "Barriers"
        },
        {
            "text": "Where it does exist, it appears that the named worker model can be restricted to learning disabilities and mental health services. The big question is how we can extend it beyond that. It’s about developing the skills, confidence and leadership capabilities of named workers. This is a big step from traditional approaches to care management. Staff are likely to have concerns about the potential for a higher workload. In the webinar, a delegate asked how it’s possible to have a named worker and, at the same time, manage sickness, absence and a lack of staffing in teams?"
        },
        {
            "text": "But the alternative is what we’ve been hearing: that practice over time becomes task driven and case-management-led in its approach. There can be an obsession with risk management, a general poor understanding of the individual and a focus on tasks and protocols. Social work can be held back when these and other things are present."
        },
        {
            "heading": 2,
            "text": "Focus on Buckinghamshire"
        },
        {
            "text": "In Buckinghamshire, they say they want to get the basics of adult social care right and to work in partnership with the adults they support on a journey towards better outcomes. Elaina Quesada, who is Service Director for Adult Social Care Operations at Buckinghamshire Council, says there are outcomes for both the people they support and the social care workforce involved in the initiative."
        },
        {
            "text": "For the former, people are provided with a reliable point of contact who is interested in someone’s whole life; not just about the difficulties they might face. In turn, the named worker gets to be autonomous, see the impact of their practice and their professional judgement is trusted."
        },
        {
            "text": "As we come out of the worst of COVID-19 and revisit how we build strengths-based and person-centred approaches to care, there has been renewed interest in the named worker model. We’re hoping that, in widening the named worker focus more broadly than just learning disability and autism services, many more adults will receive care and support more appropriate and fine-tuned to their needs."
        }
    ]
}