{
    "url": "https://environmentagency.blog.gov.uk/2022/05/19/on-target-to-tackle-invasive-species/",
    "title": "On target to tackle invasive species",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-19T14:17:26+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "By Hannah Borrett "
        },
        {
            "text": "As this week is invasive species week, I wanted to highlight a project I am working on with colleagues."
        },
        {
            "text": "We are currently undertaking an Invasive Species Management Project which runs from May until September for the next five years. It involves work that is separate to our routine vegetation management programme and is carried out to reduce the impact of two invasive plant species, Alexanders and Sea Beet."
        },
        {
            "text": "Invasive species like these need management to reduce their negative impacts. Sometimes, members of the public might wonder what is happening when they see things being cut back, especially during ‘no mow May’– but there are important reasons."
        },
        {
            "text": "These plants are on coastal flood banks, which need to be able to withstand winter storms and high tides. Alexanders and Sea Beet grow vigorously, early in the growing season and prevent other species from establishing. If left uncut, these plants will seed and then die back in late summer leaving extensive areas of bare soil on the flood banks. To be able to withstand these weather circumstances, the banks need vegetation cover. Targeted cutting of these species helps because repeatedly cutting them weakens the plant and prevents it producing seed. Other species of wildflowers and grasses can then germinate and establish."
        },
        {
            "text": " "
        },
        {
            "text": "For the next five months we plan to cut these Alexanders and Sea Beet plants every six weeks and reseed the areas with a grass and wildflower seed mix to encourage pollinators, increase the local biodiversity and reduce flood risk."
        },
        {
            "text": "This project is a five-year trial and early monitoring results are promising. Our monitoring in 2021 found that as the summer progressed and other vegetation became established, the dominance of Alexanders and Sea Beet gradually reduced. As a result, we were able to reduce the extent of our targeted cutting."
        },
        {
            "text": "My job involves working with the environment. It is one of the things I love about it – it means observing what is happening and making decisions based on what we see, what has happened in the past, what has worked in the past, and what we know could happen in the future if we don’t take that action."
        },
        {
            "text": "Supported by evidence and monitoring, we are able to make the best, informed choices for the environment and do what we need to do."
        },
        {
            "text": "To find out more, contact the Norfolk Asset Performance Team on apnorfolk@environment-agency.gov.uk"
        }
    ]
}