{
    "url": "https://homeofficemedia.blog.gov.uk/2022/05/19/repairing-the-broken-asylum-system-is-a-moral-imperative/",
    "title": "Repairing the broken asylum system is a moral imperative",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Ministerial opinion"
    ],
    "pub_date": "2022-05-19T12:24:38+01:00",
    "content": [
        {
            "text": "Home Secretary Priti Patel and Vincent Biruta, Rwandan Minister for Foreign Affairs and International Co-operation, write for the Daily Telegraph."
        },
        {
            "text": "The global asylum system is broken. There are 80 million people who have been displaced, ripped from their homes by conflict, oppression and inhospitable environments. This huge number does not include economic migrants, who are on the move to find greater prosperity."
        },
        {
            "text": "Toxic additions to this mixture are the gangs that trade in human cargo. Be under no illusion; people smugglers are not humanitarians. They are organised criminals whose evil business finances other serious crimes."
        },
        {
            "text": "There are multiple safe and legal routes to the UK for genuine asylum seekers. Nobody needs to come illegally from France – another safe country with a functioning asylum system. But the smugglers take their money anyway, treat them abominably, and then send them on a lethally dangerous journey."
        },
        {
            "text": "Last year, on one tragic November day, 27 people, including several children, drowned while trying to cross the Channel. In 2019, 39 Vietnamese people died in a refrigerator lorry."
        },
        {
            "text": "Finding a sustainable solution fair to everybody"
        },
        {
            "text": "There is an urgent moral imperative to defeat these gangs and shut down illegal routes. Not only have lives been lost, not only should asylum be claimed in the first country reached, but illegal routes are totally unfair, giving those with the means to pay people smugglers an advantage over those in greatest need. The challenge, then, is to find a sustainable solution that is fair to everybody."
        },
        {
            "text": "Last month, the UK and Rwanda announced a world-leading Migration and Economic Development Partnership. As part of a significant investment by the UK in Rwanda, people who come to the UK illegally can be considered for relocation to Rwanda."
        },
        {
            "text": "Everyone included in the scheme will be safe and secure in a host country that is widely recognised for how it has welcomed and integrated migrants. Rwanda’s history gives its people a profound connection to those seeking safety and opportunity in a new land. This has shaped the country’s approach to migration and asylum."
        },
        {
            "text": "Rwanda has a strong, proud record of providing safety to those fleeing danger. It consistently ranks in multiple global indices as one of the world’s safest countries. It currently provides refuge for around 130,000 refugees from several countries and in 2019, at the request of the UNHCR, Rwanda offered sanctuary to people evacuated from Libya."
        },
        {
            "text": "We have personally seen many examples of people relocated to Rwanda thriving happily, some of them starting highly successful businesses."
        },
        {
            "text": "These examples underline the country’s global position as a safe country, and is a further reminder that migration is a shared, international issue – one which we must address collaboratively. That includes working with our multi-lateral partners: we pay tribute to the UNHCR and other key UN agencies, for their vital, ongoing work and expertise in supporting refugees."
        },
        {
            "text": "Setting a new global standard"
        },
        {
            "text": "We believe our ground-breaking, long-term partnership can set a new international standard for addressing illegal migration and asylum system abuse while offering migrants an opportunity to build prosperous lives in safety. Other countries are keen to engage in such international collaboration. Denmark recently confirmed that they also speaking to the Rwandan government about the transfer of asylum seekers."
        },
        {
            "text": "Rwanda and the UK want to build on this momentum, so we will be promoting this issue and partnerships like ours on global stages. For example, we are having discussions with key United Nations agencies in Geneva this week."
        },
        {
            "text": "Illegal migration is a complex issue, of course, and while we are proud to be setting an example, there is no single solution. The UK has recently announced that the Royal Navy will be in charge of disrupting illegal Channel crossings."
        },
        {
            "text": "Reception centres will reduce the asylum system’s reliance on expensive hotels. The UK’s crackdown on illegal migration is complemented by extensive support for refugees and their families, most recently from Syria, Hong Kong and Ukraine."
        },
        {
            "text": "And under the points-based system, introduced after its departure from the European Union, the UK welcomes highly-skilled workers based on what they can offer, not where they come from."
        },
        {
            "text": "The aim: a fairer and more effective asylum system"
        },
        {
            "text": "Reform will not be accomplished overnight. This summer will see another challenging period of migrants arriving by boat. We also know there will be continued opposition from politicians, in the media, and in the courts. These voices will offer no workable alternative plans, but rather perversely act as cheerleaders for the evil people smugglers. Alas, we will even hear bigoted and ignorant claims about Rwanda."
        },
        {
            "text": "Yet we will not be deterred. This is a first-class policy that will see major investment in jobs, skills, and opportunities in Africa. It further cements an excellent partnership and friendship between the UK and Rwanda."
        },
        {
            "text": "And it is a template for how to deliver a fairer and more effective global asylum system – one that deters criminality, exploitation and abuse, and promises a bright new future for those who find a new home in a wonderful country. That is something worth celebrating."
        }
    ]
}