{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/05/19/supporting-my-spouse-with-dementia/",
    "title": "Supporting my spouse with dementia",
    "authors": [
        "Heather Lawson"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2022-05-19T11:57:39+01:00",
    "content": [
        {
            "text": "by Heather Lawson, UK Health Security Agency"
        },
        {
            "text": "Many people have to balance a home-life with a work-life, but usually it is to bring up children. I did it to look after my husband who was diagnosed with behavioural variant frontal temporal dementia (bvFTD) at the age of 51."
        },
        {
            "text": "A few years after Andy’s diagnosis I started to work part time, starting at 13:30 to allow me the morning to get Andy up, dressed and fed. I would leave work after doing my paid 4 hours and usually another hour or so on top of this. I tried to fit in a full days worth of work into just 4 hours. After work I would make sure Andy was clean, fed and ready for bed."
        },
        {
            "text": "Some people have asked me why I haven’t given up work and become a full-time carer, my response has always been “That’s not for me”."
        },
        {
            "text": "Some people are not cut out to be carers and I am one of those. The role of a carer is much different to that of a parent, when caring for someone with a deteriorating mental illness. For many the stress of a bad day is managed with the understanding that, over time, things will improve."
        },
        {
            "text": "The investment of time is rewarded many times over as the child develops (at least this is my experience), but with FTD there is no hope of improvement, instead the carer is left heartbroken and struggling to cope as they watch their loved one travelling in the opposite direction- going from mature adult to teenager, to prepubescent child to toddler and finally little more than an infant."
        },
        {
            "text": "Work is a source of relief. It is a way I can lose myself and forget about what awaits me at home. I can concentrate on the job in hand. I know my job is important and can have an impact on the lives and health of others. Sometimes I concentrate too much and end up forgetting to make that appointment for the dentist, or to call the plumber to fix the leaking tap."
        },
        {
            "text": "Work is a source of company. Gone are the days when I would come home from work and have long discussions with Andy.  My shyness does not make it easy to make friends and yet I find that I need my colleagues. Not particularly for physical help, but just to talk to, share problems with and give support to each other. I like to feel needed and appreciated, which is why caring for Andy is difficult -yes I am needed, but I am not shown that I am appreciated."
        },
        {
            "text": "Work is a source of money. The mortgage still needs to be paid despite the significant decrease in household income. My son has just started university and needs financial support and there is the issue of the general high cost of living so close to London."
        },
        {
            "text": "Andy moved into a care home 2.5 years ago and work is more important to me than ever. Job security is critical to my family. I have been working full time during the pandemic, but that temporary change to my contract finishes end of June. My daughter works long days, including both Saturdays and Sundays, and my son is on summer break from university I am dreading September when he returns to University in St Andrews. I am scared of the loneliness."
        },
        {
            "text": " "
        },
        {
            "text": " Vicki Chalker, Chair of the Government Science and Engineering Profession Diversity and Action Inclusion Group:"
        },
        {
            "text": "“Thank you Heather for sharing this honest window into your world of working as a scientist whilst caring for Andy. All of us have or know and work with others that have difficulties or care for a loved one who needs support. Last week was mental health week. Care for your colleagues, be supportive and aware that for everyone life outside work is not always easy and restful. Be the support you will need in the future and the supportive friend and colleague needed now. If you need help, please reach out to someone you trust.” "
        },
        {
            "text": "Please ensure you undertake training and support those in your team to do so. The Civil Service COVID-19 wellbeing advice provides managers with advice on managing your mental health, working from home, supporting your team, practical issues including stress, financial wellbeing, bereavement and loneliness. The mental health charity Mind reports that 1 in 4 people experience a mental health problem each year in England, 1 in 6 people report experiencing a common mental health problem (such as anxiety and depression) in any given week in England. The Every Mind Matters website can help you to find simple ways to look after your mental health and wellbeing. Advice and support for carers and the people they care for is available from Carers UK - GOV.UK (www.gov.uk)."
        },
        {
            "text": " "
        }
    ]
}