{
    "url": "https://insolvencyservice.blog.gov.uk/2022/05/19/uncovering-potential-at-the-insolvency-service-learning-at-work-week/",
    "title": "Uncovering potential at the Insolvency Service: Learning at Work Week",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "Working for the Insolvency Service"
    ],
    "pub_date": "2022-05-19T12:53:36+00:00",
    "content": [
        {
            "text": "In our second blog to celebrate Learning at Work Week 2022 (LaWW), we spoke to Jaspreet Malhi and John Willis in our Talent, Capability and Learning Team where we discussed why learning at work is so important to the Insolvency Service and what activities took place during LaWW."
        },
        {
            "heading": 2,
            "text": "Learning at Work Week"
        },
        {
            "text": "LaWW is the brainchild of the Campaign for Learning. It’s held annually and this year’s event took place between 16 and 20 May. 2022’s campaign aims to shine a spotlight on the importance and benefits of continual learning and development."
        },
        {
            "heading": 2,
            "text": "Learning uncovered"
        },
        {
            "text": "John Willis, our Learning & Talent Manager, explained that this year’s theme is ‘learning uncovered’ and the agency’s objectives in celebrating LaWW was to further promote the benefits of continual learning and development, while raising awareness of what is happening around the agency that colleagues might not necessarily be aware of."
        },
        {
            "text": "“The Campaign for Learning challenged participating organisations to run activities that promote the benefits of lifelong learning to colleagues whatever they do, wherever they work and whatever their starting point,” said John."
        },
        {
            "text": "“Taking inspiration from this year’s three strands, Uncover learning potential, Uncover hidden powers and Uncover new dimensions, we wanted to organise a series of learning activities for every day of the week, whether it was publishing blogs, news items or training workshops. We also wanted to help colleagues uncover new opportunities they wouldn’t necessarily know about.”"
        },
        {
            "heading": 2,
            "text": "Continuous learning "
        },
        {
            "text": "Sessions during LaWW covered dealing with change, interviewing skills, introducing various internal departments and understanding the Civil Service’s Success Profiles."
        },
        {
            "text": "Learning and Talent Advisor, Jaspreet Malhi, said that LaWW is a great opportunity for colleagues to understand what skills and capability we need to perform at a high level in our roles, which is an important part of the agency’s people strategy."
        },
        {
            "text": "“We had very good attendance for our various sessions, which we are incredibly proud of,” said Jaspreet."
        },
        {
            "text": "“The feedback we received was very positive and we hope that colleagues were able to take something away that may have benefited their job, career or even personal development. Learning at work is continuous and life-long, we should never stop striving to improve.”"
        },
        {
            "heading": 2,
            "text": "What our colleagues thought"
        },
        {
            "text": "Business Support Executive, Michelle Clarke, said:"
        },
        {
            "text": "“I was glad I made the effort to take time and dial into the session. I learnt a lot of helpful and practical tips. The session was informative and fun. I would definitely recommend it to my colleagues.”"
        },
        {
            "text": "Distribution Clerk, Sara Hawkins, said:"
        },
        {
            "text": "“I love John’s presentations, they are always clear and easy to understand.  The Interview Skills LAWW session was no different. It has given me plenty to think about and lots of tips.”"
        },
        {
            "text": "Azhar Ahmed, Commercial Analyst, said:"
        },
        {
            "text": "“I found it (the interview skills session) extremely helpful. Admittedly a lot of it I already knew because I’ve been doing a lot of reading and attending plenty of interviews recently. It did however fill in some much-needed gaps, especially around hypothetical questions.”"
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}