{
    "url": "https://civilservice.blog.gov.uk/2022/05/19/why-weve-stopped-using-the-term-bame-in-government/",
    "title": "Why we’ve stopped using the term ‘BAME’ in government",
    "authors": [
        "Richard Laux",
        "Summer Nisar"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-05-19T13:10:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Richard Laux and Summer Nisar explain why the UK Civil Service has scrapped the label ‘BAME’ in referring to different ethnic minority groups within society."
        },
        {
            "text": "How we write about race and ethnicity matters a lot."
        },
        {
            "text": "As civil servants, we need to be as precise as we can in our language when describing different ethnic groups. We also need to be precise in developing solutions to address the gaps in outcomes between those groups."
        },
        {
            "heading": 4,
            "text": "Race inequality"
        },
        {
            "text": "In the summer of 2020, the Prime Minister appointed the Commission on Race and Ethnic Disparities to review the causes for race inequality in the UK. In its report, published on 31 March 2021, the Commission found aggregate terms like ‘BAME’ (black, Asian and minority ethnic) were no longer helpful. It recommended they  should be dropped, advocating instead a focus on understanding disparities and outcomes - such as in education or health - for specific ethnic groups."
        },
        {
            "text": "The government agreed. Its response to the Commission’s report, ‘Inclusive Britain’, was published on 17 March 2022. This sets out an action plan intended to tackle negative disparities, promote unity and build a fairer Britain for all. It also includes a commitment to no longer use the term ‘BAME’ in government. But why does this matter? "
        },
        {
            "heading": 4,
            "text": "Disguising differences"
        },
        {
            "text": "‘BAME’ is a catch-all term, frequently used to group all ethnic minorities together. This can disguise huge differences in outcomes between ethnic groups. For example, we know that the picture of educational achievement  across different ethnic groups is complex."
        },
        {
            "text": "In 2019, a higher than average percentage of children in state-funded schools from Chinese, Indian and Bangladeshi groups achieved strong passes in English and Maths GCSEs. But looking at these results from a ‘BAME’ perspective would have skewed the picture, masking the success of those particular groups and under-performance by others."
        },
        {
            "text": "Unintentionally divisive"
        },
        {
            "text": "The term ‘BAME’ emphasises certain ethnic minority groups (Asian and black) and excludes others, such as the ‘mixed’, Gypsy, Roma and Traveller and ‘other white’ ethnic minority groups that also face negative disparities. ‘BAME’ is also often used as a generic term  for ‘non-white’, which can be unintentionally divisive."
        },
        {
            "text": "Perhaps more importantly though, many ethnic minorities themselves say they dislike the term ‘BAME’, a finding that has been reinforced by recent research commissioned by the Cabinet Office Race Disparity Unit (RDU) during the pandemic. "
        },
        {
            "text": "So what should we say instead?"
        },
        {
            "text": "In 2019, the Race Disparity Unit issued guidance on how to write about ethnicity. This was updated last December and recommends that, wherever possible, we should use the specific ethnic classifications of the census. Where it is absolutely necessary to group together people from different ethnic minority backgrounds, we should say ‘ethnic minorities’ or ‘people from ethnic minority backgrounds’."
        },
        {
            "text": "We are not the only ones to have reached this conclusion. In December, the BBC and other UK broadcasters said they would no longer use the term BAME. This followed research by the Sir Lenny Henry Centre for Media Diversity which found a lack of trust around the term, with some arguing that it allowed organisations to ‘average out’ and hide a lack of representation or overlook issues faced by particular ethnic groups. "
        },
        {
            "text": "Doing so will help us to close these gaps in a more meaningful and sustainable way."
        },
        {
            "text": "Change doesn’t happen overnight, but a collective long-term goal towards achieving better outcomes for all is in everyone’s interests."
        }
    ]
}