{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/10/27/a-century-of-occupational-therapy-why-the-next-100-years-matter-more-than-ever/",
    "title": "A Century of Occupational Therapy: Why the Next 100 Years Matter More Than Ever ",
    "authors": [
        "Sarah McClinton",
        "Carolyne Hague"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Knowledge and skills",
        "Recognition",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2025-10-27T15:53:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "text": "To coincide with World Occupational Therapy Day, Carolyne Hague outlines the vital contribution that occupational therapy makes to people’s lives and sets out her call to action, emphasising the importance of a collective voice that includes occupational therapists alongside communities, social workers, nurses, policymakers and others to shape a national health and care system that reflects the values of inclusion, innovation and independence. As co-chair of the Principal OT network, Carolyne has made an outstanding contribution to raising the profile of OTs in adult services and we will miss her as she moves into her new role in the NHS."
        },
        {
            "heading": 2,
            "text": "From Radical Beginnings to System Shapers "
        },
        {
            "text": "Our story began in the 1920s, with pioneers like Dr Elizabeth Casson who believed — radically at the time — that meaningful occupation could heal and empower. That belief became the foundation of a profession that’s grown alongside the welfare state, through landmark legislation like the 1948 National Assistance Act, the 1970 Chronically Sick and Disabled Persons Act, and the Care Act 2014.  "
        },
        {
            "text": "Occupational therapists are solution-focused. We see the person first, their strengths, goals, and potential and work creatively to remove barriers and enable independence. In adult social care, we’re uniquely placed to turn policy into real-life outcomes, helping people live safely, independently and with purpose. Whether it’s through home adaptations, equipment and technology provision, moving and handling skills, reablement, or creative thinking to promote the independence of people with long term conditions, we bring wellbeing to life.  "
        },
        {
            "heading": 2,
            "text": "Policy, Economic Contribution and Impact "
        },
        {
            "text": "Occupational therapists are not only improving lives, they are also shaping systems and contributing to economic growth. By enabling people to live independently, return to work and avoid crisis care, occupational therapy reduces long-term costs and supports financial sustainability. From preventing hospital admissions, future proofing housing stock, improving practice quality, reducing reliance on statutory services and improving system efficiency through early intervention and prevention, the profession plays a vital role in system design and delivery. "
        },
        {
            "heading": 2,
            "text": "Building a National Voice "
        },
        {
            "text": "Five years ago, a group of us came together with a simple but bold ambition: to create a national voice for occupational therapists in adult social care leadership. We wanted to be seen not just as practitioners, but as strategic leaders shaping the future of care. "
        },
        {
            "text": "Through the National Principal Occupational Therapy Network, we’ve built a thriving community of leaders. We’ve strengthened relationships with the Department of Health and Social Care (DHSC), ADASS, NHS England, the Principal Social Worker and Approved Mental Health Professional networks, Royal College of Occupational Therapists and the Local Government Association. We’ve highlighted the evidence and impact of occupational therapy in prevention, reablement, and community wellbeing. We’ve created space for mentoring, peer learning, and innovation. And we’ve made sure our voice is heard in national policy — influencing integration and workforce reforms, the NHS Long Term Plan, and the future of social care. "
        },
        {
            "heading": 2,
            "text": "From reflection to action "
        },
        {
            "text": "As we celebrate 100 years of occupational therapy, we must honour the legacy of those who came before us, not by looking back, but by stepping forward. "
        },
        {
            "text": "Here’s my call to action: "
        },
        {
            "text": "Influence: Bring practical, person-centred solutions into the heart of system design. "
        },
        {
            "text": "Innovate: Use our occupational therapy creativity to reshape care pathways, housing, and community models. "
        },
        {
            "text": "Collaborate and connect: Use our collaborative leadership, system navigation skills and experience working across health, housing, and social care to build stronger relationships, communities and prevention-focused services. "
        },
        {
            "text": "Inspire: Mentor and empower others — so the next generation of occupational therapists and occupational therapy leaders is even stronger. "
        },
        {
            "heading": 2,
            "text": "Looking Ahead "
        },
        {
            "text": "We’re standing at a powerful moment in history. A century behind us. A century ahead. And a national network of leaders ready to shape what comes next. "
        },
        {
            "text": "Occupational therapy has always been about enabling people to live — not just exist. Our role in adult social care has never been more vital, and our collective influence has never been more needed.  "
        },
        {
            "text": "As we look ahead, we must work together with our communities, occupational therapists, social workers, nurses, policymakers, DHSC and other stakeholders to shape a national health and care system that truly reflects the values of inclusion, innovation and independence. Our collective voice is essential in designing policies and partnerships that enable people to live well. Let’s do things differently this time and ensure occupational therapy is embedded in every conversation about the future of care, and that our insights drive meaningful change across the system. "
        },
        {
            "text": "Because the future of adult social care needs our voice — grounded in occupation, driven by values, and focused on what matters most: people’s lives.  "
        },
        {
            "text": "This Local Government Association report, developed in partnership with national and regional occupational therapy leaders, explores the unique role of occupational therapists in councils. It highlights their impact across housing, health, care, and employment, and sets out what the Government can do to unlock their full potential and support delivery of their missions - Occupational therapists in councils: Unlocking capacity and driving change | Local Government Association "
        }
    ]
}