{
    "url": "https://aphascience.blog.gov.uk/2025/10/27/a-milestone-in-the-fight-against-antimicrobial-resistance/",
    "title": "A milestone in the fight against antimicrobial resistance (AMR)",
    "authors": [
        "Ramon Maluping"
    ],
    "categories": [
        "Antimicrobial Resistance",
        "International"
    ],
    "pub_date": "2025-10-27T09:16:08+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is antimicrobial resistance and why does it matter?"
        },
        {
            "text": "Antimicrobial resistance (AMR) is not just a scientific buzzword; it is a global crisis. When bacteria, viruses, fungi, and parasites outsmart antimicrobials (for example antibiotics), infections become harder or impossible to treat, diseases spread faster, and lives hang in the balance."
        },
        {
            "text": "Its impact is far-reaching: AMR threatens human health, animal welfare, food security and the environment. By 2050, the World Bank predicts it could reduce the GDP of low-income countries by more than five percent and push millions into poverty."
        },
        {
            "text": "One of the most important tools for monitoring AMR is antimicrobial susceptibility testing (AST). This involves isolating bacteria and exposing them to different antibiotics to determine which are effective. Reliable AST results are essential because they guide treatment, track resistance trends and help assess infection prevention measures, such as improved farm biosecurity. Standardised AST methods also enable laboratories worldwide to compare data, providing a clearer picture of how resistance spreads."
        },
        {
            "heading": 2,
            "text": "A UK–Philippines collaboration"
        },
        {
            "text": "Since 2022, the UK FAO Reference Centre for AMR has worked closely with the Philippines. Supporting the UK’s 2024 to 2029 National Action Plan (NAP) on AMR, which emphasises global partnerships, the Centre has been actively engaged in the implementation of the Philippines’ own 2024–2028 NAP. This includes strengthening laboratory capacity, improving surveillance systems and generating reliable AST data."
        },
        {
            "text": "The Philippines launched its first-ever national training workshop on antimicrobial susceptibility testing (AST) in July 2025 in Quezon City, Metro Manila. Lead by the Department of Agriculture – National Meat Inspection Service (DA-NMIS) and co-organised with the UK’s FAO Reference Centre for AMR and was supported by Scientific Biotech Specialties Inc. (SBSI), Thermo Fisher Scientific and the Department of Agriculture – Bureau of Animal Industry (DA-BAI). The workshop drew on the scientific knowledge of the Animal and Plant Health Agency (APHA), Cefas, and the Veterinary Medicines Directorate (VMD) to equip participants with the tools to tackle AMR head-on and brought together cutting-edge expertise and international collaboration with partners"
        },
        {
            "text": "The workshop became a hub of expertise; drawing veterinarians, scientists, and lab professionals from every corner of the Philippines. A total of 32 participants representing 28 institutions (including national and regional government bodies, academia, Food and Agriculture Organization (FAO), and private sector leaders) came together in a powerful show of unity. With backgrounds spanning terrestrial and aquatic animal health, environmental science, and public health, the cohort embodied a truly multidisciplinary force. The event also underscored a critical message: when government and industry join forces, the potential to elevate laboratory capacity and fight AMR multiplies."
        },
        {
            "text": "Across three days of lectures and practical sessions, participants strengthened technical skills and built lasting connections across animal, aquatic and food sectors. The workshop marked a turning point in harmonising laboratory methods nationwide and generating the high-quality data needed to guide treatment decisions, protect food systems and safeguard public health. The workshop demonstrated the progress possible through shared expertise and commitment."
        },
        {
            "text": "Recently, the centre also co-delivered another highly successful AST training workshop on bacterial pathogens affecting aquatic animals, serving AMR National Reference Laboratories from 11 countries across the Asia–Pacific region."
        },
        {
            "heading": 2,
            "text": "Learning through theory and practice"
        },
        {
            "text": "APHA scientists Dr. Ramon P. Maluping and Dr. Thomas Chisnall with Cefas counterparts Dr. Athina Papadopoulou and Dr. Andy Powell led the training and served as resource speakers, supported by colleagues from NMIS, BAI, SBSI and Thermo Fisher. The programme combined theory with hands-on practice, equipping participants with both the knowledge and confidence to conduct AST in their own laboratories."
        },
        {
            "text": "In lectures, trainers explained the science behind AST, introduced the international standards: Clinical and Laboratory Standards Institute (CLSI) and European Committee on Antimicrobial Susceptibility Testing (EUCAST), and highlighted the role of control strains in ensuring accurate results. Participants explored both manual and automated testing methods and learned how to interpret results using clinical breakpoints and epidemiological cut-off values. This theoretical foundation showed how AST data strengthens national surveillance and supports the responsible use of antibiotics."
        },
        {
            "text": "The hands-on sessions made the topics much easier to understand. Each participant carried out AST using a commercially available Sensititre system. They prepared the samples, set up the testing plates, and measured the minimum amount of antibiotic needed to stop bacterial growth (MIC)."
        },
        {
            "text": "The trainers guided everyone through each step, stressing the importance of doing the test correctly, recording results carefully, and following quality checks using control bacteria."
        },
        {
            "text": "Participants also did simple biochemical tests to confirm the type of bacteria and discussed how sharing AST results between laboratories helps strengthen the national surveillance system in the Philippines. The combination of classroom teaching and practical lab work helped reinforce what they learned through real-world application."
        },
        {
            "heading": 2,
            "text": "Voices from the workshop"
        },
        {
            "text": "The response from participants was overwhelmingly positive. One commented:"
        },
        {
            "text": "Another said:"
        },
        {
            "text": "Others praised the diversity of expertise in the room:"
        },
        {
            "text": "Key takeaways included new technical skills such as interpreting MICs, applying CLSI and EUCAST standards correctly, and understanding why every AST must be backed by quality control data. The workshop also deepened awareness of both passive and active AMR surveillance and reinforced the importance of using antibiotics responsibly."
        },
        {
            "heading": 2,
            "text": "Building a stronger future together"
        },
        {
            "text": "The Philippines workshop not only strengthened individual laboratory skills but also encouraged collaboration across animal health, aquaculture, food safety and academia. It demonstrated the value of a One Health approach, which recognises that human, animal and environmental health are interconnected."
        },
        {
            "text": "By helping deliver the Philippines’ first national AST training workshop, the UK FAO Reference Centre for AMR has supported a vital step forward in the country’s AMR response. With harmonised methods and stronger laboratory capacity, the Philippines is now better positioned to generate reliable data, guide treatment decisions and support more sustainable food systems."
        },
        {
            "text": "Through continued partnership, the Philippines and the UK, share a commitment to building the knowledge and capacity needed to tackle AMR – protecting health, livelihoods and the environment for generations to come."
        }
    ]
}