{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/27/coverage-of-awaabs-law-announcement/",
    "title": "Coverage of Awaab’s Law announcement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-10-27T14:42:49+00:00",
    "content": [
        {
            "text": "There has been widespread national, regional and broadcast coverage today on the department’s announcement on new laws now in force protecting social housing tenants from emergency hazards and damp and mould."
        },
        {
            "text": "Awaab’s Law is a legacy to two-year-old Awaab Ishak who tragically died from prolonged exposure to mould and the reforms will improve the lives for tenants and families living in all four million of England’s social rented homes."
        },
        {
            "text": "The changes mean landlords must fix emergency health and safety hazards within 24 hours of reporting, while they must also investigate significant damp and mould within 10 working days of being notified and then make properties safe in five working days. "
        },
        {
            "text": "National coverage can be seen in The Guardian, The Independent and The I who report the government has committed to extending Awaab’s law to the private rented sector through the Renters’ Rights Bill. The Mirror and Sky News also focus on Awaab’s story with comments from his father in the pieces, while Sky News have also run an explainer video sharing the story."
        },
        {
            "text": "An op-ed from the Secretary of State is carried in Manchester Evening News on the ‘tragedy’ and ‘moment of shame for Britain’ when Awaab Ishak died in 2020. The piece states, ‘this can never happen again’ and praises Awaab’s parents for ‘their incredible fight for justice’."
        },
        {
            "text": "Elsewhere, in broadcast coverage BBC News has run an in-depth piece on the introduction of Awaab’s Law and the history behind its name and carries comment from the Secretary of State highlighting the law will give tenants a ‘stronger voice and force landlords to act urgently when lives are at risk’. ITV News hasalso reported on the new rules coming into effect, focusing on the £1 million fund aimed at creating new ways of helping tenants engage with their landlords and have more influence over decisions affecting them."
        },
        {
            "text": "The Big Issue carry a piece by Joe Carpenter, an author and previous social housing maintenance worker, who wrote of his experience working on the frontline and seeing the challenges faced by the sector first hand."
        },
        {
            "text": "The Secretary of State took part in the morning broadcast round and was interviewed by Times Radio, Sky News, BBC Breakfast, LBC, Radio 4 Today programme, Good Morning Britain, Bauer and GB News, with much of the focus on Awaab’s Law."
        },
        {
            "text": "Housing Secretary Steve Reed said:   "
        },
        {
            "text": "“Everyone deserves a safe and decent home to live in and Awaab Ishak is a powerful reminder of how this can sadly be a matter of life or death. "
        },
        {
            "text": "“Awaab’s family has fought hard for change and their work to protect millions of tenants’ lives will live on as a legacy to their son.  "
        },
        {
            "text": "“Our changes will give tenants a stronger voice and force landlords to act urgently when lives are at risk, ensuring such tragedies are never repeated.”"
        }
    ]
}