{
    "url": "https://naturalengland.blog.gov.uk/2023/05/30/assessing-the-health-of-the-river-wye-and-its-catchment/",
    "title": "Assessing the health of the River Wye and its catchment",
    "authors": [
        "Emma Johnson"
    ],
    "categories": [
        "Biodiversity",
        "Farming",
        "Landscapes",
        "Protected sites and species",
        "Science and evidence",
        "Site of Special Scientific Interest",
        "Special Protection Area",
        "wildlife and farming"
    ],
    "pub_date": "2023-05-30T12:44:21+01:00",
    "content": [
        {
            "text": "By Emma Johnson, Area Manager - West Midlands Team"
        },
        {
            "text": "The Wye Valley is an iconic landscape, hugely important for biodiversity due to the wide range of rare river wildlife, loved by people and important for farming. It’s because it’s so special, that it has been designated as a site of special scientific interest (SSSI). In addition, together, the River Wye and part of the River Lugg form the ‘River Wye Special Area of Conservation’ (SAC), providing the rivers with the highest level of protection in the UK and of international importance."
        },
        {
            "text": "We want to restore the Wye catchment to a healthy condition, so its rivers can support the life that depends on them, provide the clean and plentiful water, be resilient to climate change all while providing spaces that people can enjoy the benefits of. It’s the outcome that Natural England is working in partnership to deliver with the Environment Agency and a range of stakeholders."
        },
        {
            "text": "To restore the health of the Wye and Lugg we need to have a clear understanding of the current condition, which in turn will provide a better understanding of what is needed to achieve this."
        },
        {
            "text": "How we assess the health of the River Wye and Lugg designated sites"
        },
        {
            "text": "The River Wye and Lugg designated sites have a relatively complex set of aquatic plant and animal life, known as interest features. Conducting a full condition assessment of every feature of the river is a significant operation. A full two-year assessment is planned to commence in 2024, but in the interim, Natural England has conducted a small-scale assessment, looking at four specific features, to create an indicative assessment of the site as a whole."
        },
        {
            "text": "Applying Common Standard Monitoring Guidance (CSMG) which is the standard used across the UK, we used data and evidence from the Environment Agency. Our assessment reviewed:"
        },
        {
            "text": "As per CSMG, if any one of the features or its indicators is classed as either ‘unfavourable’, ‘unfavourable - no change’ or ‘unfavourable - declining’, the whole unit of the river is classed as such, irrespective of the status of the other interest features."
        },
        {
            "text": "What the data is telling us"
        },
        {
            "text": "The SSSI condition status for the Wye and Lugg was largely previously classed as ‘unfavourable - recovering’. Our recent assessment identified that the River Lugg is showing declines in salmon, water quality and white-clawed crayfish. The River Wye is showing declines in macrophytes, salmon and white-clawed crayfish. Natural England regularly reviews the water quality targets  and the data tells us that the River Wye is not showing a decline in water quality."
        },
        {
            "text": "Further investigation is required before we are able to pinpoint specific causes of the declines, some of which may be beyond the catchment."
        },
        {
            "text": "As at least one interest feature in both the Wye and the Lugg are showing declines, we cannot be assured that all necessary management is currently in place. Despite the significant efforts of many stakeholders, we have updated the SSSI condition status for the Wye and Lugg to ‘unfavourable – declining’."
        },
        {
            "text": "These assessments are published on the Natural England Designated Site Viewer alongside detailed information about the SSSI and its interest features."
        },
        {
            "text": "What this change means"
        },
        {
            "text": "Any deterioration of river health is worrying to us and all those who share a love for these wonderful rivers. But it is important to provide context to this assessment.  These findings do not reflect a sudden decline in the health of the river but are the results of changing agricultural and industrial practices, climate change, urbanisation and a growing population over the last decades."
        },
        {
            "text": "We have updated the status as currently the interest features aren’t thriving which is an indication that the rivers can’t do all of the things we rely on them to do. Unless there are changes to the external pressures upon it, the SSSI cannot reach a favourable condition."
        },
        {
            "text": " "
        },
        {
            "text": "How we are addressing the issues"
        },
        {
            "text": "The scale and complexity of the challenge in the Wye catchment means that we need long-term solutions that are founded on a strong evidence base and developed collectively. Our area team is committed to working with local stakeholders, partners and landowners to improve the health of these rivers and for the species that depend on them. Much of this activity is focused on improving water quality, especially reducing phosphates, which we know is fundamental to the health of the river."
        },
        {
            "text": "We are working with the Environment Agency, Herefordshire Council, the Wye and Usk Foundation, Herefordshire Wildlife Trust and other local stakeholders via a Nutrient Management Plan. The plan, which is overseen by the Nutrient Management Board (NMB), aims to identify both the sources of nutrients and the steps that can be taken to enable growth in Herefordshire whilst conserving the river environment. We are working closely with Herefordshire Council and Partners (including those in Wales) to improve the operation of the NMB board and our joint projects."
        },
        {
            "text": "But we are also committed to stepping up actions we can take now in response to this worrying drop in condition."
        },
        {
            "text": "One of the many projects currently underway is the Integrated Wetlands project, a Nutrient Mitigation Scheme devised to protect our waterways from pollution and enable home building."
        },
        {
            "text": "Up to eight integrated wetlands will be constructed at a site close to the Dwr Cymru Welsh Water (DCWW) plant at Luston, which will essentially soak up phosphates before they reach the watercourse, mitigating the impacts of unavoidable nutrient pollution."
        },
        {
            "text": "Catchment sensitive farming continues to play a vital role, advising farmers so they can tackle pollution from agriculture. In partnership with Farm Herefordshire, our Catchment Sensitive Farming Advisers (CSFA) are working with landowners and suppliers to tackle phosphate reduction."
        },
        {
            "text": "In the last three years, our CSFAs have undertaken 1-to-1 visits across 269 holdings in the Wye catchment alone. This targeted approach works because our teams can identify specific areas to provide tailored advice that works for each individual landowner. Across those 269 site visits, our teams made over 2,400 recommendations to support farms in the Wye catchment. This includes encouraging take up of CS options such as buffer strips along watercourses."
        },
        {
            "text": "The EA are growing their inspection programme in the catchment, helping farmers to comply with legal requirements including the Farming Rules for Water."
        },
        {
            "text": "Alongside delivering best practice advice and guidance, our advisors are supporting and approving capital, land management and slurry infrastructure grant applications to ensure landowners have access to the resources they need to make improvements."
        },
        {
            "text": "As well as 1-to-1 visits, we regularly host community events which focus on particular areas, including slurry management, regenerative agriculture and agro-forestry. Due to the success of these events, we have many more planned throughout the year. With the Wye and Usk Foundation we are hosting events on carbon, soils and how to reduce potato sector-specific inputs for potato farmers. With the Rural Hub and Farm Herefordshire we’re developing a series of on-farm events to focus on positive soil management and soil assessments to help farmers meet their SFI soil standards."
        },
        {
            "text": "Reducing phosphates is just one intervention. Although there’s a shared local focus on water quality and poultry units being the cause, the situation is more complex than this. The Wye catchment is suffering from the same pressures that we see across the country. Our focus is on restoring nature and the ecosystem across the whole catchment, together with the Environment Agency, the Nutrient Management Board and stakeholders."
        },
        {
            "text": "You can find more information about projects underway in the Wye catchment with the new Environment Agency portal, Engagement HQ by visiting https://engageenvironmentagency.uk.engagementhq.com"
        }
    ]
}