{
    "url": "https://educationhub.blog.gov.uk/2023/05/30/freedom-of-speech-act-how-it-will-affect-university-students/",
    "title": "Freedom of Speech Act: How it will affect university students?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2023-05-30T12:30:29+01:00",
    "content": [
        {
            "text": "The Government’s Higher Education (Freedom of Speech) Bill became law 11 May 2023 in a huge step forward in protecting freedom of speech and academic freedom on university campuses."
        },
        {
            "text": "The Act will put more responsibility on universities to ensure students are able to speak freely in and out of the classroom, while offering more protection for academics who teach material that may offend some students."
        },
        {
            "text": "It will strengthen the duties already in place to protect freedom of speech and bring about a change of culture on our campuses."
        },
        {
            "text": "The right to have free and open debate is important in higher education and beyond."
        },
        {
            "text": "We have to be able to disagree and have conversations about complex or sensitive subjects in a constructive manner – it is essential to a civil society and democracy."
        },
        {
            "heading": 3,
            "text": "What does it mean for universities, colleges and students’ unions?"
        },
        {
            "text": "The Act will require universities, colleges and students’ unions in England to take steps to ensure lawful freedom of speech on campus. This doesn’t include unlawful speech, such as harassing others or inciting violence or terrorism."
        },
        {
            "text": "It is for universities, colleges and students’ unions to consider whether the speech is lawful, by taking into account criminal law such as the Public Order Act 1986 and legislation such as the Equality Act 2010. They will also set out and publish a code of practice for freedom of speech on campus."
        },
        {
            "text": "A new Director for Freedom of Speech and Academic Freedom will be appointed to oversee all the Office for Students (OfS) free speech functions, including the new complaints scheme and investigations where universities are accused of breaching their duties under the Act."
        },
        {
            "text": "The new OfS Director will champion free speech on campuses and ensure that the OfS takes action where needed."
        },
        {
            "heading": 3,
            "text": "What does it mean for students, lecturers and visiting speakers?"
        },
        {
            "text": "Under the Act, universities won’t be allowed to silence people who raise complaints of sexual misconduct, abuse, harassment or bullying by using non-disclosure agreements."
        },
        {
            "text": "This has been a real problem which we want to crack down on to protect students who have suffered harm."
        },
        {
            "text": "The Act will also establish a new free-to-use complaints scheme which will be operated by the OfS, the higher education regulator in England."
        },
        {
            "text": "Students, staff and visiting speakers will be able to bring claims to court if they feel they have suffered loss as a result of their free speech rights being unlawfully restricted."
        },
        {
            "text": "We expect the new duties and measures specified under this Act to come in to force before the 2024-25 academic year."
        },
        {
            "heading": 3,
            "text": "What should I do if I have concerns about free speech at my university?"
        },
        {
            "text": "The Act is not yet fully in force as the Government has to make regulations and set out more detail about how the Act will work."
        },
        {
            "text": "The OfS also has to consult on how the new duties should regulated and how the new complaints scheme should operate."
        },
        {
            "text": "In the meantime, if you have raised an issue with your university and are not satisfied with the outcome, you can raise the issue with the OfS and with the Office of the Independent Adjudicator for Higher Education, the students’ complaints scheme."
        }
    ]
}