{
    "url": "https://hmlandregistry.blog.gov.uk/2023/05/30/how-hm-land-registry-data-benefits-the-uk/",
    "title": "How HM Land Registry data benefits the UK",
    "authors": [
        "Lynne Nicholson, Head of Data Products & Services "
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2023-05-30T10:36:56+01:00",
    "content": [
        {
            "text": "You could argue that house prices are a national obsession. Who among us hasn’t wanted to know how much a property has sold for at one time or another? But where does that data come from? And how do we know what average house prices are, and how much they have gone up or down?  "
        },
        {
            "heading": 2,
            "text": "House price information "
        },
        {
            "text": "If you’ve ever wondered where websites such as Rightmove and Zoopla get their house price information from, the answer is us, alongside others such as Registers of Scotland. We register, on average, more than 100,000 residential sales each month. That means we are the main source for house price information in England and Wales and have a huge amount of data about what properties have actually sold for. "
        },
        {
            "text": "Our monthly house price index (HPI) is widely recognised as critical information about house prices, in fact it’s a National Statistic, meaning it meets the highest standards of trustworthiness, quality and value. It shows average house prices broken down by: "
        },
        {
            "text": "Having house price data so easily to hand means homebuyers and sellers are much better informed from the outset. For example, if you want to discover if an asking price is reasonable based on the type of property and area it’s in, you can easily find this out with a few clicks of a mouse. By making this kind of data more transparent, the whole housing market can operate more smoothly. "
        },
        {
            "text": "In addition to homebuyers and sellers, our historic and recent property sale prices data is used by: "
        },
        {
            "heading": 2,
            "text": "What other kinds of data do we have? "
        },
        {
            "text": "We have 13 datasets which are publicly accessible on our Use land and property data platform. These are bulk datasets suitable for business and professional use such as overseas companies that own property in England and Wales."
        },
        {
            "text": "Individuals wanting to find out information about a specific property can use our Search for land and property information tool. This provides information about the property such as: "
        },
        {
            "text": "Making this kind of data easy to access means there is transparency in the property market which allows people to make informed decisions more quickly. "
        },
        {
            "heading": 2,
            "text": "Speeding up homebuying "
        },
        {
            "text": "Another example of how we are making data easier to access is the creation of a central Local Land Charges (LLC) Register, one of the biggest ever government data transformation projects. It involves collating and transforming LLC data from all local authorities in England and Wales so that it is consistent in format and accessible in one place.  "
        },
        {
            "text": "Whenever someone buys a property, a conveyancer checks the local land charges which are restrictions on the use of a property or area of land such as planning conditions and tree preservation orders. Rather than dealing with a wide range of LLC registers in separate local authorities, in different formats and at different costs, the central register that we are creating offers: "
        },
        {
            "text": "By speeding up and simplifying this element of the conveyancing process, buying decisions can be made earlier, reducing the risk of property transactions falling through due to late revelations. These failed transactions cost buyers time and up to £2,700 per incident. When the project to centralise all local land charges data is complete, property buyers, developers and policymakers will all have easy access to LLC data across England and Wales. "
        },
        {
            "heading": 2,
            "text": "How our data is used"
        },
        {
            "text": "There is a well-known data sharing principle that you should never predict all potential uses of data once it’s released. We’ve certainly seen evidence of that with our location and ownership data being widely re-used outside of our traditional user base of conveyancing and lending, such as: "
        },
        {
            "text": "By supporting PropTech (property technology) start-ups through our Geovation Accelerator Programme, dozens of new uses of our data have been created to revolutionise the property market and beyond. For example, Skyroom uses our data to identify buildings which are suitable for airspace development, enabling landowners in London to build upwards rather than outwards. "
        },
        {
            "heading": 2,
            "text": "Calculating the value of our data"
        },
        {
            "text": "We’ve calculated that our top four datasets alone create an annual benefit to the economy of more than £300 million. How did we calculate this? We’ve been working alongside the Geospatial Commission to develop a new framework to measure the economic, social and environmental value of public sector location data. This guidance should benefit both the public and private sectors and boost the UK’s global geospatial expertise.  "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The quality of our data is even more important to us and our customers than the amount of data we release. Our focus over the next few years will be on making our data more FAIR - findable, accessible, interoperable and reusable. Our ambition is to make better quality data available to more people, and so unlock more value, in turn helping the property market and wider economy.\n"
        }
    ]
}