{
    "url": "https://ofsi.blog.gov.uk/2023/05/30/trust-services-sanctions-5-months-on/",
    "title": "Trust Services Sanctions – 5 months on",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Compliance",
        "Enforcement",
        "Financial Sanctions",
        "Licensing",
        "Russia",
        "Uncategorized"
    ],
    "pub_date": "2023-05-30T12:20:39+01:00",
    "content": [
        {
            "text": "The trust services sanctions came into effect on 16 December 2022. These are financial sanctions, for which the Office of Financial Sanctions Implementation (OFSI) is responsible, while the Department for Business and Trade is responsible for professional and business services sanctions.  "
        },
        {
            "text": "The trust services measure limits the ability of persons designated for the purpose of this measure, and persons connected with Russia, from accessing the UK’s trust services.  Since March 2023, over 1,820 persons have been designated for the purposes of trust services sanctions. "
        },
        {
            "text": "OFSI has engaged with over 500 stakeholders and international partners (including the Crown Dependencies and Overseas Territories) on the detail. Thank you to all participants for your involvement.  "
        },
        {
            "text": "This blog aims to provide further clarity on themes arising from questions OFSI has received, though some questions have been case specific. OFSI does not generally (in this blog or otherwise) provide legal advice, so independent legal advice should be sought when required.  "
        },
        {
            "text": "When do Trust Services Sanctions Apply? "
        },
        {
            "text": "Persons Connected with Russia "
        },
        {
            "text": "Since 16 December 2022, it has been prohibited to provide new trust services to or for the benefit of “persons connected with Russia” (“PCWR”). The PCWR legal definition can be found in section 19A(2) of the Russia (Sanctions) (EU Exit) Regulations 2019. "
        },
        {
            "text": "This definition should be considered against the facts of each person or individual to see if they meet the criteria, and therefore whether the provision of new trust services is prohibited. It would not normally apply to individuals who only occasionally travel to Russia while normally being resident or located in the UK. The definition also does not include Russian nationals who are not ordinarily resident or located in Russia. The “Domicile” test only applies to a person who is not an individual (e.g. a company). "
        },
        {
            "text": "Designated Persons  "
        },
        {
            "text": "Trust services must not be provided to or for the benefit of designated persons in accordance with these sanctions. This means trust services (not the trust itself) must be wound down, unless a relevant exception applies, or specific licence is obtained. OFSI’s General Licence (GL) and previous blog provide some background on wind downs. "
        },
        {
            "text": "Whether a service is provided “for the benefit of” a person or individual is also case-specific. Subject to that, “for the benefit of” is defined in sections 18C(5) and 18C(6). "
        },
        {
            "text": "OFSI’s consolidated list provides details of designated persons. "
        },
        {
            "text": "Where do these sanctions apply? "
        },
        {
            "text": "These prohibitions target the provision of trust services, by UK persons anywhere or by persons in the UK, to or for the benefit of PCWR and persons designated under the trust services sanctions. The prohibitions apply no matter the location of the trust or similar arrangement. "
        },
        {
            "text": "Like all UK sanctions measures, the trust services prohibitions also apply in the Crown Dependencies and Overseas Territories. However, some may have issued their own General Licences (GL), so please consult their websites for the latest information. "
        },
        {
            "text": "Key Exceptions "
        },
        {
            "text": "Assets of designated persons caught under Regulation 11 of the Russia (Sanctions) (EU Exit) Regulations 2019 must remain frozen. However, some exceptions and licences permit the provision of trust services where it would otherwise be prohibited under the trust services sanctions, and there are licensing grounds pursuant to which specific licences can be sought.   "
        },
        {
            "text": "The exceptions include: "
        },
        {
            "text": "OFSI’s Enforcement Powers  "
        },
        {
            "text": "OFSI can impose civil monetary penalties on a strict civil liability basis, meaning the previous requirement for OFSI to prove that a person had knowledge or reasonable cause to suspect that they were in breach of financial sanctions has gone.  "
        },
        {
            "text": "Licensing "
        },
        {
            "text": "The General Licence applies to persons designated under the trust services sanctions, it does not apply to PCWR. It includes a reporting obligation to let OFSI know that you are winding down provision of a trust service. "
        },
        {
            "text": "If you find that the GL does not apply and you need to submit a specific licence application, please read our guidance. If a licence is being sought under more than one financial sanction, check our form has been completed fully before submitting it early. If a trust and company service provider has reason to believe that trust services cannot be wound down within the 90 days provided by the GL, contact OFSI with details as soon as possible. "
        },
        {
            "text": "Useful Links "
        },
        {
            "text": "OFSI’s homepage on trust services sanctions\nHM Government guidance on arms embargoes and other restrictions"
        }
    ]
}