{
    "url": "https://digitaltrade.blog.gov.uk/2025/02/12/from-learning-to-leading-celebrating-apprenticeships-in-the-civil-service/",
    "title": "From Learning to Leading: Celebrating Apprenticeships in the Civil Service",
    "authors": [
        "Andy Palmer, Senior Capability Manager",
        "Hameda Akther, Head of Portfolio Management Office",
        "Julia Crompton – Service Owner for Employee Experience"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-02-12T09:37:31+00:00",
    "content": [
        {
            "text": "This week (10–16 February 2025) marks National Apprenticeship Week, a time to celebrate the opportunities apprenticeships provide. Apprenticeships are a fantastic route for young people starting their careers, those looking to advance or retrain, and employers seeking to fill critical skills gaps to drive growth."
        },
        {
            "text": "An apprenticeship offers the best of both worlds: a paid position alongside the chance to gain professional qualifications and valuable experience. It’s a pathway that empowers individuals and strengthens organisations."
        },
        {
            "heading": 3,
            "text": "Our commitment to apprenticeships"
        },
        {
            "heading": 4,
            "text": "Andy Palmer"
        },
        {
            "text": "The UK Civil Service is proud to be one of the largest employers of apprentices in the UK. We have hired over 40,000 apprentices since 2015. Apprentices are central to workforce planning across a wide variety of professions, playing a key role in shaping the future of the Civil Service."
        },
        {
            "text": "Here in the Department for Business and Trade (DBT), we recognise the impact of apprenticeships and the invaluable contributions of our apprentices. To celebrate National Apprenticeship Week 2025, we’ll share information about apprenticeship opportunities within Digital Data and Technology (DDaT) and hear from some of our apprentices. Their testimonials will shed light on how apprenticeships have positively shaped their careers and helped them achieve their goals."
        },
        {
            "text": "More than 1 in 20 of our DDaT Civil Servants in DBT are apprentices. We already work closely with training providers like Makers, where some of our best new staff currently train while working in teams with skilled and experienced colleagues. We are also eagerly awaiting our new Tech Track Apprentices –recruited as part of an exciting new cross-Government program to find our future technical experts. In addition to this, as part of our commitment to being a department of economic growth for all of the UK, our apprentices work and train across the country. We have a growing group of Apprentice Data Engineers in Wales!"
        },
        {
            "heading": 3,
            "text": "Apprentices at all stages"
        },
        {
            "text": "Of course, not all our apprentices are starting their careers. In fact, most apprentices in DBT DDaT are further along in their professional paths.  They have chosen to embark on apprenticeships as the perfect way to pick up new skills and qualifications while continuing their work. "
        },
        {
            "text": "Apprenticeships up to postgraduate level are popular choices with some of our most experienced colleagues, many of whom start decades into their careers. Some are career changers, including Civil Servants seeking a fresh challenge in digital, data, or tech roles."
        },
        {
            "heading": 3,
            "text": "Testimonials: Voices of experience"
        },
        {
            "heading": 4,
            "text": "Hameda Akther"
        },
        {
            "text": "\"One of the biggest lessons I’ve learned having been on the Chartered Management and Leadership Degree Apprenticeship is that real growth happens when you step outside of your comfort zone. At the start, it's easy to second guess yourself wondering if you have enough knowledge, if you're asking the right questions or if you're ready to take on bigger responsibilities. But I've found that the moments where I’ve felt a little out of my depth have been the moments where I've learned the most.\""
        },
        {
            "text": "\"The best thing you can do is get stuck in. Say yes to opportunities, ask lots of questions, and don't be afraid to make mistakes (that's where the real learning happens). It’s not just about the qualification at the end, but the people you meet, the confidence you build and the experience that help shape your career. So, if you’re considering an apprenticeship, take the leap, you won't regret it!\""
        },
        {
            "heading": 4,
            "text": "Julia Crompton"
        },
        {
            "text": "\"I undertook the Coaching Professional Level 5 Apprenticeship as part of my professional development within DBT. My role is a Deputy Service Owner in DDaT, working across DBT to help meet the need for digital services. My day job involves lots of collaboration, negotiation and decision-making – but I also see the professional development of my colleagues as very important.\""
        },
        {
            "text": "\"I identified this qualification as one which would help me support my colleagues in identifying and exploring their career goals and challenges, enabling their personal and professional growth. The apprenticeship has equipped me with comprehensive coaching skills suitable for complex coaching situations, including leadership coaching and organisational development. These enhance the management and leadership skills I have sought to develop over the years.\""
        },
        {
            "text": "\"The apprenticeship format combines both theoretical input, self-learning opportunities and practical coaching experience. DBT supported my learning by building study into the working week and offering internal opportunities for coaching practice.\""
        },
        {
            "text": "\"It was a commitment I was excited to undertake. I enjoyed all aspects (especially the psychology theory!) I can honestly say it is one of the best things I have done and I gained a real sense of achievement in gaining the qualification at the end of 18 months.\""
        },
        {
            "heading": 3,
            "text": "Summary"
        },
        {
            "text": "We hope that hearing from some of our former apprentices has sparked your interest in exploring opportunities within the Civil Service, or consider the benefits of having apprentices as part of your team. We encourage you to find out more about how apprenticeships are being celebrated this week."
        },
        {
            "text": "To learn more, visit National Apprenticeship Week 2025, 10 - 16 February 2025."
        }
    ]
}