{
    "url": "https://moderncivilservice.blog.gov.uk/2025/02/12/good-risk-taking-in-government-top-take-aways/",
    "title": "Good Risk Taking in Government: Top take aways",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-02-12T09:52:40+00:00",
    "content": [
        {
            "text": "At the recent One Big Thing Webinar on Good Risk Taking in Government, attended by over 800 colleagues, key leaders shared essential insights on risk management and innovation in the Civil Service. The session recording is now available on YouTube."
        },
        {
            "text": "The webinar’s host, Clive Martin, Head of the Government Risk Profession at HM Treasury, outlined five crucial principles:"
        },
        {
            "text": "Panellist Sarah Munby, Permanent Secretary at the Department for Science, Innovation & Technology, commented ‘We are rightly being asked to drive ambitious and far-reaching change. The discussion really reminded me that well-managed and thoughtful risk-taking is absolutely essential if we want to make bold things happen.’"
        },
        {
            "text": "Caroline Croft, Legal Director General at Government Legal Department, reflected on her experience on the panel: ‘I was delighted to join Sarah and Clive for this webinar and it was great to see so many people had dialled in to share our discussion about how we can support innovation by understanding risk management, so we can confidently seize opportunities.  Most of all, coming together across policy, risk and legal functions, it showed how crucial it is to combine our expertise across disciplines in the Civil Service- and how much we can achieve when we do.’"
        },
        {
            "text": "For those wanting to find out more about legal risk, Caroline highlighted two main documents:"
        },
        {
            "text": "You can find out more about One Big Thing 2024 in our recent blog article. If you'd like to find out more about the Government Risk Profession and risk management, get in touch with the team."
        }
    ]
}