{
    "url": "https://apprenticeships.blog.gov.uk/2025/02/12/national-apprenticeship-week-2025-rebecca-jones-shares-how-her-environmental-practitioner-degree-apprenticeship-is-helping-the-uk-achieve-net-zero-emissions/",
    "title": "National Apprenticeship Week 2025: Rebecca Jones shares how her environmental practitioner degree apprenticeship is helping the UK achieve net zero emissions ",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "National Apprenticeship Week"
    ],
    "pub_date": "2025-02-12T09:23:40+00:00",
    "content": [
        {
            "text": "As we celebrate National Apprenticeship Week 2025 (10-16 February), Rebecca Jones, a member of IfATE’s Apprentice Panel, shares her journey as an environmental practitioner degree apprentice at WSP. The apprentice panel brings together apprentices from a wide range of backgrounds, across all 15 of our routes.  "
        },
        {
            "text": "These apprentices’ experiences and views help inform all areas of our work, including IfATE’s environmental and climate change skills strategy. The strategy aims to ensure that technical education contributes to meeting environmental and climate change goals.  "
        },
        {
            "text": "Read on to discover how Rebecca’s apprenticeship is directly contributing to the UK’s commitment to net zero emissions by 2050, and why Rebecca thinks choosing an apprenticeship was the best decision for her career. "
        },
        {
            "heading": 2,
            "text": "What inspired you to pursue an environmental practitioner degree apprenticeship rather than a traditional university degree? "
        },
        {
            "text": "I always knew that I wanted to work in the environmental sector as I wanted to do something that would positively impact the world around us. I chose the apprenticeship route because I didn’t know which specific career path I wanted to follow.  "
        },
        {
            "text": "This route has given me the opportunity to work in a variety of earth and environment sectors such as Ecology, Landscape Architecture, and Hydrogeology. This has helped to define my interests and give me a better understanding of what kind of work I enjoy the most. "
        },
        {
            "text": "Attending university on block release has also been a great opportunity for me to connect and collaborate with other degree apprentices from different businesses who are following the same career path as myself, which has been insightful. "
        },
        {
            "heading": 2,
            "text": "What key skills have you developed through combining practical work experience with academic study? "
        },
        {
            "text": "Becoming effective at time management has been crucial whenin completing balancing university assignments alongside fulfilling work commitments.  I believe completing a degree whilst working full-time has enriched my experience compared to the average university student. With my apprenticeship, I have been able to see first-hand how what I have learned at university can be directly applied to my job role.  "
        },
        {
            "heading": 2,
            "text": "How does your apprenticeship directly contribute to the UK's net zero ambitions for 2050? "
        },
        {
            "text": "In my role at WSP, I’m already contributing to the UK's environmental goals. A key part of the job is advising businesses and organisations on how they can reduce their environmental impacts. It is important for consultants to keep up to date on the latest environmental policies so we can provide accurate information to clients.  "
        },
        {
            "text": "I am currently based in the Landscape Architecture team where I have had the opportunity to implement the 10% biodiversity net gain (BNG) requirement. BNG could help to achieve net zero by preserving and enhancing existing habitats as well as creating new ones which could help to reduce pollution. "
        },
        {
            "heading": 2,
            "text": "How do you see the role of environmental practitioners evolving as we move towards a net zero future? "
        },
        {
            "text": "I think there is currently a focus on complying with environmental regulations.  Moving forward, I predict there will be a greater emphasis on driving innovation and developing sustainable solutions across all environmental sectors, as well as future-proofing by taking a more proactive approach in anticipating and mitigating potential environmental risks. This could involve conducting thorough environmental impact assessments, developing robust strategies to combat climate change, and promoting preventative measures. "
        },
        {
            "heading": 2,
            "text": "What opportunities do you see for future apprentices in the environmental sector? "
        },
        {
            "text": "I believe the demand will grow for people to work in the environmental sector, to help achieve goals such as: "
        },
        {
            "heading": 2,
            "text": "What's been the most challenging and most enjoyable aspects of your apprenticeship?  "
        },
        {
            "text": "Deadline pressures can sometimes be challenging but I am surrounded by a supportive team which definitely helps with that. But overall, I love my job! I have had the opportunity to try a variety of career paths, giving me a wide range of knowledge to take forward. Experiencing so many options has helped me decide what to specialise in. As someone who enjoys learning, an apprenticeship was the perfect route for me as you are essentially paid to learn!  "
        },
        {
            "heading": 2,
            "text": "What are you most proud of from your apprenticeship journey? "
        },
        {
            "text": "I don’t think I give myself enough credit, but completing a degree alongside work is hard, so I am very proud of myself for taking on that challenge. I have also received great feedback from my colleagues which makes me feel valued and motivated to achieve even more than I already have. "
        },
        {
            "heading": 2,
            "text": "Further information: "
        }
    ]
}