{
    "url": "https://educationhub.blog.gov.uk/2025/02/national-apprenticeship-week-meet-santina-a-level-6-civil-engineering-degree-apprentice/",
    "title": "National Apprenticeship Week: Meet Santina - a Level 6 Civil Engineering degree apprentice",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Careers"
    ],
    "pub_date": "2025-02-12T12:00:00+00:00",
    "content": [
        {
            "text": "This series of National Apprenticeship Week Education Hub posts was curated and written by Lauren, the Department for Education’s new communications apprentice."
        },
        {
            "text": "During National Apprenticeship Week we are showcasing how apprenticeships impact the lives of people that choose them as a route into their preferred profession. "
        },
        {
            "text": "Apprenticeships are for everyone - no matter how old you are or where you’re from. They provide a combination of on-the-job training and class room learning, allowing you to earn while you learn – setting you on a path to a wide variety of jobs across all sectors and the knowledge and skills to progress in your career."
        },
        {
            "text": "Santina shares her story."
        },
        {
            "text": "What is your apprenticeship in?"
        },
        {
            "text": "“I am currently a Level 6 Civil Engineering Degree Apprentice at Arup, a global engineering consultancy firm. I work within the ground engineering team in our Birmingham office."
        },
        {
            "text": "My journey began in September 2021 when I started my Level 3 Civil Engineering Apprenticeship after completing my GCSEs at 16."
        },
        {
            "text": "I've been fortunate to work on international projects in places like India, Saudi Arabia, and Uganda. Each project is unique and presents different challenges, which keeps my work exciting. I also love the variety in my role, from database management and drawing production to engineering analysis. What I appreciate most is the diversity of projects I get to be involved in.”"
        },
        {
            "text": "Did you have any preconceptions about apprenticeships before starting yours?"
        },
        {
            "text": "“I always knew an apprenticeship wouldn’t be easy. From the beginning, I understood that I’d need to balance work responsibilities with academic studies, so I was prepared to work hard and manage my time effectively. It's important that anyone considering an apprenticeship recognises the level of commitment required to succeed."
        },
        {
            "text": "There’s also a common misconception that apprentices don’t have a social life, but that’s far from true! I’m lucky to work for a company that invests in early careers, providing opportunities for networking and social events.\""
        },
        {
            "text": "What made you pursue an apprenticeship?"
        },
        {
            "text": "“I attended a grammar school where the traditional A-levels-to-university route was strongly encouraged, and I wasn’t fully informed about apprenticeships as an alternative."
        },
        {
            "text": "Luckily, my mother worked in education and had always been a strong advocate for apprenticeships, even before they became more widely recognised. With her encouragement, I did my own research and quickly realised the many benefits of this route."
        },
        {
            "text": "One of the biggest attractions was the opportunity to continue my education while gaining hands-on experience—and getting paid without accumulating student debt. What more could you ask for?"
        },
        {
            "text": "By the time I finished my GCSEs, I knew I wanted to get straight into the workplace. At 16, I was the only student in my school to start an apprenticeship, joining Arup as a Level 3 Civil Engineering Apprentice. When given the opportunity to progress to a Level 6 Degree Apprenticeship, I jumped at the chance.”"
        },
        {
            "text": "What has surprised you most about your apprenticeship?"
        },
        {
            "text": "“I didn’t expect the amount of opportunities available if you put yourself out there. What truly inspires me is the impact engineers have on society.  Knowing that the projects I contribute to can improve lives is incredibly fulfilling.”"
        },
        {
            "text": " What has your apprenticeship helped you achieve?"
        },
        {
            "text": "“Over my three years at Arup, my responsibilities have grown significantly. Academically, my apprenticeship has enabled me to complete a BTEC Level 3 in Construction and the Built Environment, I also became a qualified Technician Member of the Institution of Civil Engineers."
        },
        {
            "text": "Beyond my technical skills, my apprenticeship has helped me develop invaluable interpersonal and leadership skills. At just 19, I was named the Greater Birmingham Chamber of Commerce Young Professional of the Year—the youngest winner in their 23-year history—as well as Apprentice of the Year. I was also recognised as the G4C Construction Excellence Apprentice of the Year.”"
        },
        {
            "text": "What do you hope to do with what you’ve learned during your apprenticeship?"
        },
        {
            "text": "“One of the best things about engineering is the vast number of opportunities available. Over the next five years, my main goal is to complete my degree apprenticeship in Civil and Infrastructure Engineering. By then, I’ll have eight years of industry experience, which is an incredible advantage compared to traditional graduates."
        },
        {
            "text": "Alongside my degree, I aim to achieve Incorporated Engineer status with the Institution of Civil Engineers, building on the EngTech recognition I gained through my Level 3 apprenticeship. Eventually, I hope to become a Chartered Engineer, continuing to develop my expertise and make a lasting impact in the industry.”"
        }
    ]
}