{
    "url": "https://ipa.blog.gov.uk/2021/11/19/all-aboard-platforms-for-buildings/",
    "title": "All aboard: Platforms for buildings",
    "authors": [
        "Will Varah"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-19T13:28:19+00:00",
    "content": [
        {
            "text": "With COP26 fresh in our minds, it has never been clearer that we need to build and maintain infrastructure that is sustainable, resilient and high quality in order to deliver the outcomes that we need for people and nature. This is central to this government’s vision for the future of the UK, as set out in the National Infrastructure Strategy and the National Infrastructure and Construction Pipeline 2021, which forecasts circa £650bn investment in the next ten years. "
        },
        {
            "text": "That investment will have to be delivered in a context where multiple challenges, ranging from sustainability and resilience to levelling up, need to be addressed simultaneously. So rather than chasing incremental improvements, Transforming Infrastructure Performance: Roadmap to 2030 (TIP) sets out a vision for a different way of intervening in the built environment, centred on collective prioritisation of societal outcomes."
        },
        {
            "text": "Against this backdrop, this month a small team from the IPA visited The Forge, on Summer Street, London, which aims to be the first net zero carbon commercial building. This means the building will be both constructed and operated in line with the UK’s Green Building Council’s (UKGBC) framework definition of net zero carbon buildings."
        },
        {
            "text": "Neil Pennell, Head of Design Innovation and Property Solutions for Landsec, described to the group how Landsec is aiming to deliver against multiple concurrent challenges; faster, better, greener, safer and more cost-effectively. The benefits being achieved by the project certainly look good, including, based on the latest assessment, a reduction in embodied carbon of 24% compared with a traditional build. I was struck by the alignment between the various challenges and the broader national context, and its relevance for government - and two areas in particular stood out to me."
        },
        {
            "text": "Firstly, it was clear that we were with a client that had thought deeply about the whole approach from the outset, and wasn’t afraid to try new things. Neil had recognised the constraints inherent in treating projects as bespoke. In adopting a Platform approach, he was re-thinking not just the design, but the whole approach to delivery. This meant progressing a significant amount of work outside of what would normally be considered the project context. Secondly, as we discussed the project with Neil, it was clear that the benefits weren’t achieved by targeting any one aspect of delivery in isolation. The challenges were interconnected, and the solutions needed to be equally interconnected. These ideas are explored in the Platforms focus area in TIP (and summarised in this animation)."
        },
        {
            "text": "Exploring the way in which the project achieved the reduction in embodied carbon, provided an example of this interconnectedness. "
        },
        {
            "text": "Jaimie Johnston, Board Director and Head of Global Systems at Bryden Wood, explained that to reduce the volume of material, in particular steel and concrete, the project used innovative reusable temporary steel supports to take the slab load down through the steel frame. That involved challenging both the design and the method of construction, and included engaging manufacturer Easi Space to explore the process and prototype the solution."
        },
        {
            "text": "To address concurrent challenges (like being faster and safer) robotic fabrication was used, alongside approaches such as casting fixings very accurately into the concrete rather than drilling into the slab. This meant moving to much more accurate tolerances. It wasn’t only fabrication that was automated though - the main structural design and modelling was automated using scripts and workflows, with design models directly informing robotic fabrication, and components then tracked using QR codes through the logistics and assembly process."
        },
        {
            "text": "With smaller suppliers in direct contract with the client right from the outset, Landsec needed a ‘Manufacturing and Assembly Manager’, via a Mace and Sir Robert McAlpine joint venture, rather than what might be described as a more traditional tier 1 contractor role."
        },
        {
            "text": "It was clear each time that we explored an aspect of the project, that the solutions had been developed in the context of a whole-system approach rather than an attempt to address an isolated issue. Ultimately the extent to which this approach is repeated across a wider portfolio will determine the extent to which continuous improvement enables benefits at an even greater scale."
        },
        {
            "text": "Government has already supported both the idea of Platforms (signposting a Platform mandate in TIP), and the delivery – with early development of the Platform approach taking place in the Ministry of Justice prison programme, and the automation and prototyping for The Forge having received government support via UK Research and Innovation."
        },
        {
            "text": "The opportunity now is to realise benefits against a range of societal outcomes across government’s social infrastructure pipeline. That will require clients to share learning and collaborate to harmonise demand across sectors, and to think deeply about the delivery models that can best achieve the desired societal outcomes."
        }
    ]
}