{
    "url": "https://planninginspectorate.blog.gov.uk/2021/11/19/cmon-chaps-its-time-to-admit-it/",
    "title": "C’mon chaps, it’s time to admit it…",
    "authors": [
        "pinscomms"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2021-11-19T14:00:32+00:00",
    "content": [
        {
            "text": "Today on International Men’s Day (19 November), a member of staff at the Planning Inspectorate (who remains anonymous) questions why mental health issues are such a taboo subject among men."
        },
        {
            "text": "…we are all rubbish at talking about mental health. We each give the impression we’re fine and all those we meet in the pub or at footie are fine too, when in reality such a lot of us have mental health issues to a greater or lesser extent."
        },
        {
            "text": "As many as 1 in 6 of us men are suffering from one of the more common mental health disorders, men account for 75% of suicides, and in Government surveys men report a significantly lower life satisfaction than women and have measurably lower social support."
        },
        {
            "text": "The majority of men would seek medical support for physical problems (heart conditions, unexpected lumps and so on), but only 19% would do the same for anxiety, and only 15% would get help if they were feeling low. It is a taboo subject. But why?"
        },
        {
            "text": "I’m certainly no expert on the matter, but I reckon there are a number of reasons why I never raise mental health issues:"
        },
        {
            "text": "I tell myself there’s nothing wrong with me – I’m just a little low. Everyone has bad days amongst the good: it doesn’t mean I’ve got mental health issues. That may be so and maybe there is nothing seriously wrong with me. Or it may be a refusal to face up to the symptoms. Like any health condition, the earlier you get help, the greater the chance of getting better. So often, people turn to support later than they should have, waiting until it has reached crisis point before they do anything."
        },
        {
            "text": "However much I try and not buy into stereotypes, I can’t get away from the expectation that men are strong and resilient, and mental health issues are seen to be a weakness. Yet if I had problems with my kidney or liver or (perish the thought) waterworks, that wouldn’t be seen as weakness – people would just accept it was ‘one-of-those-things’. Why should it be different with mental health issues? (34% of men would be embarrassed or ashamed to take time off work for mental health concerns such as anxiety or depression compared to 13% for a physical injury)"
        },
        {
            "text": "It’ll be held against me in the years ahead. People, both inside work and out, will have the impression I am ‘fragile’ and can’t cope with the pressure of 21st century life. Yet if I recovered from kidney disease or liver problems people would admire my courage and strength and praise me for my determination – why should those who have been through mental health issues and come out the other side be treated any differently? (38% of men would be concerned that their employer would think badly of them if they took time off work for a mental health concern – compared to 26% for a physical injury)."
        },
        {
            "text": "All too often, the unjustified stigma mental health issues carry mean we just don’t address it, we deny it, we push it under the carpet and we try to keep it hidden, and in doing so we allow it to grow and deepen in our lives."
        },
        {
            "heading": 3,
            "text": "What we can do?"
        },
        {
            "text": "Maybe you are confident you don’t have any of the ‘biggies’ like depression, anxiety, obsessive compulsive disorder or panic disorder. That’s great, but I reckon nearly all of us have a mental state that could, potentially be wobbly. If that better describes you, there are still things that can be done to improve this, enhance your life and maybe protect yourself from slipping into one of those bigger conditions: watch your diet, keep tabs on your alcohol intake, try and get enough sleep, make sure you get exercise and fresh air, endeavour to foster a positive attitude to life, relax properly, draw on spirituality (whatever that may mean to you), think carefully about your life/work balance, accept that an hour could be better spent walking round the park or doing the gardening rather than staring blankly at the screen, identify a trusted friend you can chat with etc – the list goes on…"
        },
        {
            "text": "Your mental state is so precious, whatever may be up with you. It is such an essential key to your wellbeing and the wellbeing of your loved ones. If you are in any doubt at all, doing nothing is not a sensible option. Please don’t be afraid to talk to friends, family or contact your GP: whatever you do, do something. It’s worth putting the effort in, it’s worth taking the risks for."
        },
        {
            "text": "Statistics referenced in this blog post are taken from menshealthforum.org.uk."
        }
    ]
}