{
    "url": "https://homeofficemedia.blog.gov.uk/2021/11/19/factsheet-proscription/",
    "title": "FACTSHEET: Proscription",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2021-11-19T13:51:02+00:00",
    "content": [
        {
            "text": "The key statistics section has been updated in this factsheet on 17 June 2022."
        },
        {
            "text": "What is proscription?"
        },
        {
            "text": "Proscription is the banning of an organisation based on an assessment that it commits or participates in, prepares for, promotes or encourages, or is otherwise concerned in terrorism."
        },
        {
            "text": "Proscription sends a strong message that terrorist organisations are not tolerated in the UK and deters them from operating here."
        },
        {
            "text": "What are the sanctions?"
        },
        {
            "text": "It is a criminal offence for a person in the UK to:"
        },
        {
            "text": "Where has legislation changed recently?"
        },
        {
            "text": "The penalties for proscription offences can be a maximum of 14 years. This has been increased from 10 years following the Counter-Terrorism and Sentencing Act 2021 coming into force."
        },
        {
            "text": "What is the process?"
        },
        {
            "text": "The Home Office works with operational partners and other departments through the Proscription Review Group (PRG) – a cross-Government group chaired by the Home Office that supports the Home Secretary in her decision making on proscription decisions. When a decision to proscribe, extend an extant proscription, or remove a group from the list of proscribed organisations is made, an order is laid in Parliament, before being debated and approved by the House of Commons and House of Lords."
        },
        {
            "text": "What determines whether proscription is proportionate?"
        },
        {
            "text": "If the statutory test is met, there are factors which the Home Secretary will take into account when deciding whether or not to exercise her discretion to proscribe. During the passage of the Terrorism Act 2000 five discretionary factors were set out to Parliament:"
        },
        {
            "text": "Which organisations have been proscribed?"
        },
        {
            "text": "The Government keeps the list of proscribed organisations under regular review. For more information, the list of proscribed organisations can be found here: Proscribed terrorist groups or organisations - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Key statistics"
        },
        {
            "text": "Can an organisation be de-proscribed? "
        },
        {
            "text": "Section 4 of the Terrorism Act 2000 provides that the organisation or any person affected by a proscription can submit a signed, written application to the Home Secretary requesting that they consider whether a specified organisation should be removed from the list of proscribed organisations."
        },
        {
            "text": "If the application is refused the applicant may appeal to the Proscribed Organisations Appeal Commission (POAC). The Commission will allow an appeal if it considers that the decision to refuse de-proscription was flawed, applying judicial review principles."
        },
        {
            "text": "Is there a process for keeping a proscribed organisation’s use of aliases under review?  "
        },
        {
            "text": "Mechanisms are in place to identify whether any proscribed organisations are operating under alternative names. Section 3(6) of the Terrorism Act 2000 allows the Home Secretary, by Order subject to the negative resolution procedure, to specify an alternative name for a proscribed organisation. The use of an alternative name which is not listed does not prevent the police and Crown Prosecution Service from taking action against an individual for proscription offences."
        }
    ]
}