{
    "url": "https://valuationoffice.blog.gov.uk/2021/11/19/how-we-value-football-stadiums/",
    "title": "How We Value: Football Stadiums",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2021-11-19T13:02:34+00:00",
    "content": [
        {
            "text": "Richard Gibson is a caseworker and advisor in the National Valuation Unit at the Valuation Office Agency. He is responsible for assessing a range of leisure and sports properties for business rates, including football stadiums. In this blog Richard talks about how we value the venues for the nation’s favourite sport."
        },
        {
            "text": "The breadth of the brief"
        },
        {
            "text": "Whether you follow football or not, it’s hard to miss the fact that it’s hugely popular up and down the country, and even a way of life for many fans. When we talk about football stadiums, we mean all Football League stadiums in England and Wales. These range from the glitz and glamour of the Premier League stadiums, all the way down to the National League – where walking around the ground might be a much muddier affair than it is at Chelsea’s Stamford Bridge."
        },
        {
            "text": "So, it’s fair to say there are vast differences in the facilities at these stadiums. Over half of current football stadiums are situated on the sites of grounds that were built before the First World War, and the expectations from clubs and from visiting supporters are wildly different today. So how can one scheme fit all?"
        },
        {
            "text": "Factors to consider"
        },
        {
            "text": "There are several elements that affect valuation. These include, as you might expect, the size or capacity and the quality of the stadium, but also attendances and income. The size in basic terms can be looked at by the stadium’s crowd capacity, while the quality is reflected in the price-per-seat adopted for the venue. Quality can reflect corporate accommodation, entertainment and hospitality too – you’ll find a difference in the kitchen facilities between Arsenal and Barnet for example, despite the clubs being in close proximity to one another. Location should not be discounted as a factor too though!"
        },
        {
            "text": "When it comes to attendances, these will often reflect the success of the club in the context of its own league, but other factors affect attendance too such as whether the club is situated in a ‘football town’. For example, some clubs struggle to draw crowds where rugby is more popular or where there is strong competition for supporters from other, more successful, clubs. Think about Gary Neville trying to fill the stadium at his club Salford City, when his old team Manchester United are playing down the road on a Saturday afternoon."
        },
        {
            "text": "Coming to a valuation"
        },
        {
            "text": "When we assess football stadiums for rating purposes we follow the decision in the Plymouth Argyle case. The case addressed the fact that the owner of the stadium, when renting to the club, would be bound to accept a rent which reflected that no one else was in the market. Any football stadium valuation must be “on the basis that the club was the only possible tenant”. In other words, the actual financial circumstances of the club in residence may be a factor."
        },
        {
            "text": "We therefore apply an allowance for the club’s income or ‘ability to pay’."
        },
        {
            "text": "On the face of things this doesn’t present any major issues as the valuations of many other property types for rating purposes reflect the trading position of the actual occupier. Some valuations are based on a detailed analysis of accounts while others on a percentage of gross receipts. Both are based on the actual trade of the occupier. In many cases when a business is suffering from poor performance the valuer will disregard this trade as they could make the case that other reasonable operators would do better."
        },
        {
            "text": "But with football stadiums it is a different matter. When a football club fails it suffers the consequences through relegation. Rather than vacating the premises the team will continue to operate from the same ground but with its attendance and income heavily impacted."
        },
        {
            "text": "Whether promotion or relegation qualify as a material change of circumstances has been considered by the courts and rejected. The decisions in the Wigan case, which considered this point, directly criticised the above method of valuation both at Valuation Tribunal and Upper Tribunal. Wigan Athletic suffered two relegations in three years from 2013 to 2015, and argued that the effect of relegation on ticket sales and television money was a material change of circumstance. However the Tribunals ruled that they were not physical changes in the stadium or its locality."
        },
        {
            "text": "We are engaging directly with the industry to ensure that an alternative approach can be considered and agreed as preparations are made for the 2023 Revaluation of business rates."
        },
        {
            "text": "Wrapping up and looking forward\n"
        },
        {
            "text": "Reflecting the changes going on at a club is a challenge for valuers - a week is said to be a long time in politics, but it is even longer in football. It is important for the valuer to establish the circumstances at the date of any change and to then consider how this would be reflected at the valuation date."
        }
    ]
}