{
    "url": "https://companieshouse.blog.gov.uk/2021/11/19/international-mens-day-2021-supporting-colleagues-through-our-mens-network/",
    "title": "International Men’s Day 2021: supporting colleagues through our men's network",
    "authors": [
        "Martin Swain - Director of Strategy, Policy and External Communications"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-11-19T14:48:04+00:00",
    "content": [
        {
            "text": "At Companies House we have a great record of setting up networks. We have a wide range of inclusive networks like the faith, allyship, culture and ethnicity (FACE) network, the women's network, working family network and many more."
        },
        {
            "text": "These networks support, educate and drive change. The inclusive and trusting environment enables people voice, engagement, connection, and influence in the things that matter. Our networks have done an awful lot to support people within our organisation, especially throughout the coronavirus (COVID-19) pandemic."
        },
        {
            "text": "As part of our strategy, it’s vital that we support our colleagues, allowing them to bring their whole self to work and to really feel like they are supported, even more so as we face the challenges and changes to our ways of working that have happened over the last 2 years."
        },
        {
            "heading": 2,
            "text": "International Men’s Day"
        },
        {
            "text": "International Men’s Day (IMD) is a global day of observance held every year in more than 60 countries around the globe. It invites everyone to come together and celebrate men and boys in all their diversity."
        },
        {
            "text": "IMD in the UK takes a gender inclusive approach and therefore believes in making sure that issues affecting women and girls are also resolved. It also recognises the intersection between gender and other factors such as race and sexuality which can compound the inequalities affecting men and boys."
        },
        {
            "text": "The 3 core themes for IMD in the UK are:"
        },
        {
            "heading": 2,
            "text": "Men’s health"
        },
        {
            "text": "A study conducted by the Men's Health Forum found some stark statistics. Three out of every 4 people who kill themselves are men. In fact, suicide is the biggest cause of death of men under 35. Men are nearly 3 times more likely than women to become alcohol dependant and a 2016 survey found that one in 10 men described themselves as severely or extremely stressed."
        },
        {
            "text": "Over the last few years, we’ve seen that these important issues have come out into the open more and it's no longer seen as taboo for men to talk about their mental health and how they're feeling. I want to champion anything we can do as an organisation that really promotes these honest conversations, so I’m proud to be executive sponsor of our men’s network."
        },
        {
            "heading": 2,
            "text": "Setting up the men’s network"
        },
        {
            "text": "We wanted to create a space for people to come together, to support each other and discuss important topics such as:"
        },
        {
            "text": "It’s also an opportunity to relax, destress and connect with likeminded colleagues."
        },
        {
            "text": "The network is only in its infancy, but I’ve already been really pleased with the engagement during the first meetings. People have been open and honest, and this had led to great conversations. It’s really important that we support each other, and it would be great to see this network grow to its full potential."
        }
    ]
}