{
    "url": "https://educationhub.blog.gov.uk/2021/11/19/school-uniforms-what-you-need-to-know/",
    "title": "School Uniforms – What you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School uniform",
        "Schools"
    ],
    "pub_date": "2021-11-19T00:16:48+00:00",
    "content": [
        {
            "text": "School uniforms can reduce peer pressure at school for the latest clothes and help children feel settled and prepared for school, but they can be costly for parents."
        },
        {
            "text": "This week, we have issued important guidance setting out how schools can work with parents to keep the costs of their uniforms down."
        },
        {
            "text": " Here’s what you need to know about your child’s school uniform."
        },
        {
            "heading": 3,
            "text": "What are the rules about school uniform?"
        },
        {
            "text": "It’s up to individual schools to set their own policies, they may even decide that they don’t want a uniform. Whatever they decide, their policy should make it fair for all."
        },
        {
            "text": "We believe uniforms provide a sense of belonging for students. They are helpful in fostering a good learning environment and can promote the ethos of a school."
        },
        {
            "heading": 3,
            "text": "How much should school uniform cost?"
        },
        {
            "text": "It will inevitably vary, but fundamentally no school uniform should be so expensive that it leaves pupils or their families feeling unable to apply to, or attend, a school of their choice, due to the cost of the uniform."
        },
        {
            "heading": 3,
            "text": "What does the new uniform guidance change? "
        },
        {
            "text": "We have just brought in guidance that sets out how schools should keep the costs of their uniforms down."
        },
        {
            "text": "From next autumn, schools will be required to help keep costs down by taking steps to remove unnecessary branded items and allowing more high-street options, like supermarket own-label uniforms."
        },
        {
            "text": "All schools should now review their school uniform policies to ensure they are in line with the guidance as it is statutory meaning schools must follow it."
        },
        {
            "text": "The key points to note from this guidance include:"
        },
        {
            "text": "We know that parents can sometimes be required to buy branded items of school uniform for their children, so our guidance makes clear that:"
        },
        {
            "heading": 3,
            "text": "Do schools need to consider religious beliefs regarding uniforms? "
        },
        {
            "text": "We believe that schools should be inclusive of all faiths and should be safe spaces where pupils are able to freely express their religious beliefs."
        },
        {
            "text": "Schools should be sensitive to the needs of different cultures, races and religions and act reasonably in accommodating these needs, without compromising important school policies, such as school safety or discipline."
        },
        {
            "text": "We advise schools to take on board the views of parents and pupils, and that policies should be flexible enough to accommodate the different needs of pupils."
        },
        {
            "text": "School governors should be willing to consider reasonable requests for flexibility in the uniform policy for an individual pupil to accommodate their religion or belief, ethnicity, disability, or other special circumstances."
        },
        {
            "heading": 3,
            "text": "What happens if a school doesn’t appear to be following the rules? "
        },
        {
            "text": "We expect schools to comply with the guidance."
        },
        {
            "text": "If parents are concerned that their child's school is not following the guidance, they should raise this with the school, through the school’s published complaints process."
        },
        {
            "text": "Where parents have gone through their school’s complaints process and feel the school has not adequately addressed their concerns, they may raise this with the Department for Education."
        }
    ]
}