{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/11/19/the-cost-of-school-uniforms-new-guidance-from-the-department-for-eduction/",
    "title": "The cost of school uniforms: new guidance from the Department for Eduction",
    "authors": [
        "Paul Kellaway"
    ],
    "categories": [
        "Competition law compliance",
        "Consumer protection"
    ],
    "pub_date": "2021-11-19T15:30:06+00:00",
    "content": [
        {
            "text": "The Department for Education (DfE) has published statutory guidance to schools on school uniform policy."
        },
        {
            "text": "My son’s school newsletter recently delivered the shock news that school photographs would be the following week. As proud parents we were looking forward to refreshing our mantlepiece and having an easy win for Christmas presents for friends and family. That was until we remembered our son’s collection of stains that he keeps on his school jumpers and the sense of obligation to buy a replacement."
        },
        {
            "text": "His school’s policy includes:"
        },
        {
            "text": "As the parents of a young child we are the owners of multiple supermarket jumpers to augment our rotation of branded uniform and this policy means that I have a choice of price, quality and convenience. Had I not been able to buy an embroidered jumper from any of the three named retailers, I could have bought a plain red jumper from wherever I wanted."
        },
        {
            "text": "Many families don’t have the degree of choice that we do and may be paying more than they need to."
        },
        {
            "heading": 2,
            "text": "The expense of school uniform"
        },
        {
            "text": "In some cases, schools have made themselves monopolists – requiring parents to purchase direct from the school while in other cases they may enter into long-term exclusive arrangements with a single supplier. By preventing parents having the freedom to choose between providers schools may be restricting competition and preventing parents and carers from getting a good deal."
        },
        {
            "heading": 3,
            "text": "Why school uniform policy matters"
        },
        {
            "text": "Setting uniform policy is an important decision for schools and impacts directly on the cost of living, hitting those on low incomes the hardest. Some schools have expressed concerns that allowing greater choice may lead to inconsistent quality and colours, or indeed threats to the availability of uniform items if an existing exclusive arrangement is ended."
        },
        {
            "text": "However, this fails to recognise that every item of school uniform bought from an exclusive supplier can be £5 to £10 more expensive than those bought in a competitive market."
        },
        {
            "heading": 2,
            "text": "New guidance on school uniform costs"
        },
        {
            "text": "We have previously called on the government to introduce statutory guidance for schools on how to reduce the cost of school uniforms. The DfE have done this, enabled by Mike Amesbury MP’s Private Members’ Bill. We have worked with the DfE on this guidance, providing advice and sharing our research and expertise on how to help schools ensure they use competition to deliver benefits to their pupils and their families. This guidance strongly endorses schools using more than one supplier."
        },
        {
            "text": "The guidance also makes clear that if schools enter into exclusive arrangements with suppliers to ensure that uniform is easily available, they should ensure that suppliers are required to compete for schools’ business at least every five years and that the benefits of this competition are passed through to families."
        },
        {
            "heading": 3,
            "text": "How was the CMA involved in developing this guidance?"
        },
        {
            "text": "We receive complaints from parents every year about the cost of uniform and we have used this to drive our engagement with DfE. We have been calling for change in this market for some time. We commissioned our own research on the impact of uniform policy on its price and wrote to 30,000 schools to encourage them to think about the impact of their school uniform policies. The introduction of this new statutory guidance will hopefully signal the end to families paying the price for school policies."
        },
        {
            "text": "The CMA champions the interests of consumers across the UK. Parents face a range of financial pressures – buying school uniform should not add to these."
        },
        {
            "text": "Our mission is to make markets work well in the interests of consumers, businesses and the economy and we actively look for opportunities to advise and inform government of how it can deliver policy that is pro-competition and pro-consumer, just as we have done for school uniforms."
        },
        {
            "text": "Read the Department for Education's guidance on school uniforms."
        }
    ]
}