{
    "url": "https://space.blog.gov.uk/2022/04/22/earth-day-fighting-dengue-with-satellites/",
    "title": "Earth Day: Fighting dengue with satellites",
    "authors": [
        "Gina Tsarouchi"
    ],
    "categories": [
        "Earth from space",
        "International Partnership Programme"
    ],
    "pub_date": "2022-04-22T10:42:48+01:00",
    "content": [
        {
            "text": "In the battle against dengue fever, those on the front line now have a new way to predict where and when the mosquito-borne disease will strike, thanks to funding from the UK Space Agency’s International Partnership Programme."
        },
        {
            "text": "Through this, HR Wallingford has developed a revolutionary dengue forecasting system, called D-MOSS, which allows health officials to act quickly to stop outbreaks."
        },
        {
            "text": "The system is already live in Vietnam, and has now been rolled out in Malaysia, as HR Wallingford’s Gina Tsarouchi explains.  "
        },
        {
            "heading": 2,
            "text": "What’s the problem? "
        },
        {
            "text": "Dengue fever is a huge problem. "
        },
        {
            "text": "Over half the world’s population is now at risk and, after unprecedented outbreaks in 2019, the World Health Organization (WHO) moved the disease into its top ten list of public health threats. "
        },
        {
            "text": "There are no antiviral drugs or vaccinations for dengue, meaning that predicting the next disease outbreak is key to preventing the huge burden dengue places on the wellbeing of people, healthcare systems and economies in the countries affected.  "
        },
        {
            "text": "Dengue is hyper-endemic in Malaysia and has the highest incidence rates compared to other communicable diseases in the country. "
        },
        {
            "text": "One study put the average annual cost of dengue to the Malaysian economy during the period 2002-2007 at US$133 million, with the amount of money spent on illness costs running at 11 times the amount of money spent on mosquito control."
        },
        {
            "heading": 2,
            "text": "How is D-MOSS helping? "
        },
        {
            "text": "D-MOSS can forecast outbreaks up to six months in advance using a combination of space technology, hydrological modelling, and statistical disease models, allowing health officials to take early action to prevent outbreaks before they happen. "
        },
        {
            "text": "This has already been demonstrated in Vietnam where, during pilots between 2017 and 2020, incidence rates decreased by an average of 19.3% in the regions of Dak Lak, Dong Nai, Hanoi and Khanh Hoa."
        },
        {
            "text": " This ability to predict and prevent outbreaks could lead to significant savings for the Malaysian government. "
        },
        {
            "text": "The project to implement D-MOSS was commissioned by the Disease Control Division of the Malaysian Ministry of Health, and HR Wallingford worked closely with the International Medical University and the Institute for Medical Research in Malaysia. "
        },
        {
            "text": "HR Wallingford was asked to develop weekly forecasts of dengue outbreaks, covering up to up to six months into the future. "
        },
        {
            "text": "Ministry of Health stakeholders can access the forecasts through a secure website and in a range of formats (maps, tables, graphs), together with supporting technical information.  "
        },
        {
            "heading": 2,
            "text": "How is it going? "
        },
        {
            "text": "So far, feedback has been encouraging. "
        },
        {
            "text": "Users have reported that D-MOSS has enabled preventative measures three to four months before cases were predicted to rise, with at least one outbreak reported to have been prevented due to such proactive action. "
        },
        {
            "text": "Applying space technology and new thinking means that forecasting and early intervention have the potential to alleviate misery for billions of people. "
        },
        {
            "text": "Ultimately, the HR Wallingford team’s ambition is to see D-MOSS used as a key weapon to combat mosquito-borne diseases worldwide. With Malaysia now online, the team is one step closer to reaching that goal."
        }
    ]
}