{
    "url": "https://lifeathmrc.blog.gov.uk/2022/04/22/managing-together-part-2-discover-what-its-like-to-be-one-of-hmrcs-13000-managers/",
    "title": "Managing Together (part 2) – discover what it’s like to be one of HMRC’s 13,000+ managers",
    "authors": [
        "Carol Vaughan"
    ],
    "categories": [
        "General",
        "Management"
    ],
    "pub_date": "2022-04-22T11:29:52+00:00",
    "content": [
        {
            "text": "Continuing on with our 5-part series on core manager functions, this week we hear from Carol."
        },
        {
            "text": "Carol explains how she uses 'engage and lead', communicating a clear purpose to her team and ensuring they remain engaged."
        },
        {
            "heading": 2,
            "text": "How I use 'engage and lead' in my everyday job"
        },
        {
            "text": "Creating an environment that openly welcomes feedback and challenge is a crucial way of engaging my team. By using performance and development conversations to build individual relationships, I’ve found that people feel comfortable enough to speak up and it ultimately encourages collaborative working."
        },
        {
            "text": "We’re all working smarter across the organisation and that includes flexible ways of working. When hybrid working was initially introduced, some of my team members experienced some new challenges. In addition to having some new team members starting, I also had some new processes that needed to be communicated to experienced team colleagues. Understandably, the changes caused some apprehension, but I made sure all my conversations and decisions considered individuals diverse needs and circumstances. Working in collaboration with the team, I developed a charter which defined the overall team objectives, resources and challenges. It was a really engaging way to get everyone involved in building the team’s direction. I listened carefully to what my team said and was able to find effective ways to solve issues or find adaptations where necessary."
        },
        {
            "text": "We set up small working groups, providing a space to share knowledge and strengthen peer support, and this was also a great way of integrating newer members of staff."
        },
        {
            "text": "Supporting people to step outside their comfort zone is vital as a manager, and this was not previously something that people felt confident or comfortable doing. I supported members of my team in conducting walkthroughs of their work and delivering ongoing virtual support when working from home or across different locations. This end-to-end view of their work supported colleagues’ understanding, whilst building confidence, ability and engagement. The decisions I made were influenced heavily by the feedback and challenge I received."
        },
        {
            "text": "Within our regular conversations we discuss individual goals, what has gone well, what they feel hasn’t gone so well and, importantly, proposals for making improvements, their development and their wellbeing. There are so many opportunities for personal and professional development within HMRC. Shadowing and coaching are encouraged by senior leaders and are great tools to wholly support our commitment to work together, recognise common goals and being inclusive. Goals aren’t all about performance. Attitude and resilience are just as important, as well as treating each other with respect and kindness."
        },
        {
            "text": "For me, one of the best things about being a manager is that you can influence change and encourage innovation. When you play a part in helping someone reach their potential, watching them grow in confidence and capability, it’s an amazing feeling and the biggest reward as a leader."
        },
        {
            "text": "If you haven’t already, read the first edition in the series to find out how Kyle Hopkins owns, and initiates change within his team."
        },
        {
            "text": " "
        }
    ]
}