{
    "url": "https://ipo.blog.gov.uk/2023/03/18/on-the-ball-the-year-six-nations-rugby-got-smarter/",
    "title": "On the ball – the year Six Nations rugby got smarter",
    "authors": [
        "kayleighenticknap"
    ],
    "categories": [
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-03-18T10:15:04+00:00",
    "content": [
        {
            "text": "From rugby balls to scrum hats, intellectual property is everywhere you look in the game of rugby. Inventors and businesses work together to improve the technology and safety of the game through innovation. "
        },
        {
            "text": "The rugby ball remains one of the world’s most recognisable shapes. It has changed very little since first created from hand sewn leather by shoe and boot makers, William Gilbert and Richard Lindon in 1823. "
        },
        {
            "text": "As a long-time rugby fan, I’ve found it fascinating to see how this instantly recognisable object has developed in innovation history this season, with the first airing of the Gilbert Smart Ball at a Six Nations Rugby Championship. "
        },
        {
            "text": "I often remember those Saturday afternoons at my local club with my grandfather and brother cheering our players on with excitement. One of my fondest memory was having the incredibly important job of running on to the pitch at half time with a plate of oranges (trying not to drop them). "
        },
        {
            "text": "I now spend my Sunday mornings cheering my son on from the side lines. A rugby player from the age of 6, he loves nothing more than getting muddy as he gets stuck in to his game. "
        },
        {
            "text": "Whether it’s a local club game or the Six Nations, rugby is often described as a game of passion, with plenty of unpredictable moments. One question on my mind for this year is, will the seemingly unstoppable Irish side manage to carry home the Triple Crown and a Grand Slam as well as the Six Nations title? "
        },
        {
            "heading": 2,
            "text": "The IP in a rugby ball "
        },
        {
            "text": "So, back to the ball. While we wait to see who will bring home the trophy let’s look at how far what started as a humble pig’s bladder has come.  "
        },
        {
            "text": "In the earlier days, rugby balls came in a variety of sizes as they were determined by the size of the pig’s bladder, and it was a big priority that they were made to appear significantly different to footballs.  "
        },
        {
            "text": "There is a remarkable difference when comparing the rugby balls of today to those of the 19th century. Nowadays they are mostly made of a synthetic material as developing technology sought to make them waterproof."
        },
        {
            "text": "IP rights such as patents and trade marks have protected improvements in ball surface, valve design and branding as successive steps are taken to make the rugby ball better for this popular game.     "
        },
        {
            "text": "Now, this season, when it comes to the Six Nations Championship, the revolutionary Gilbert Smart Ball has been the ball of choice. With 3D tracking and precision down to an accuracy measuring in centimetres, this game-changing technology marked the first time artificial intelligence has been used in a rugby ball.  "
        },
        {
            "text": "This rechargeable ball comes with a GPS microchip and can provide insights and data in real time as the game is in progress. The audience benefits too – the smart ball can collect interesting data on distance and the amount of territory gained during a game."
        },
        {
            "text": "It provides live in-depth analysis to the millions of viewers watching from pitch side or via broadcast footage and on social media.  "
        },
        {
            "text": "So, when you're watching the gripping close of the Six Nations tournament this weekend, spare a thought for the innovation behind the ball that will determine who goes home with the trophy. "
        }
    ]
}