{
    "url": "https://stratcommand.blog.gov.uk/2024/03/25/army_u25s_hockey/",
    "title": "Successful hockey training camp for Army U25's",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-03-25T12:54:59+00:00",
    "content": [
        {
            "text": "The Army’s U25 Men’s Hockey Team were in Gibraltar at the end of February to take the opportunity to play some competitive matches ahead of their Inter-Services tournament in Aldershot in March."
        },
        {
            "text": "The Army U25’s Hockey Team won the indoor Inter-Services in a last-second thriller back in November 2023 and had a hugely successful end to the 22/23 season."
        },
        {
            "text": "As an overseas tour was long overdue, they decided it was beneficial for them to come to Gibraltar to play against 3 local hockey clubs and conduct some intense training sessions to set the conditions for the team to repeat their victory at the Inter-Services tournament in March 2024."
        },
        {
            "text": "The team started off against the Gibraltar U18 select side. A really good match from both teams, with goalkeeper Private Adam Rees standing out as the key to the Army side staying in the match. Sadly, the match ended in 3-2 defeat for the Army U25 side."
        },
        {
            "text": "As this was the first time the team had played together in an outdoor setting, it was a great chance for them to blow away the cobwebs and figure out what system worked for them."
        },
        {
            "text": "The following day the team came up against the Titans – a national league team playing in the top tier of Gibraltar hockey."
        },
        {
            "text": "Titans boasted a Belgian Olympian in their team, who scored 6 Olympic-level short corner flicks. The Army team held really well, not allowing any open-play goals against and managing to score two themselves."
        },
        {
            "text": "Playing on the last day against the Collegians, a veteran’s team, was the last chance for the Army to play around with tactics, formations and systems of play, and whilst the 5 – 2 score was not flattering, it gave them highly valuable insights into how they need to set the team and what kind of hockey they need to play in the upcoming Inter-Services to beat the RAF and Royal Navy."
        },
        {
            "text": "During their time in Gibraltar, the players were able to see the sights of Gibraltar and conduct a battlefield study guided tour."
        },
        {
            "text": "Team Manager, Captain Kyle Beckett, said: “This was a fantastic opportunity for the team to get away from the usual setting of Aldershot and bring a new team together for a quality training package."
        },
        {
            "text": "Due to the nature of the U25 set up, we routinely have a lot of our core players spending time out of the squad, so each year we have to start from scratch."
        },
        {
            "text": "Coming to Gibraltar was the best way for the team to bond and come together to figure out what role each member plays in the team in the most efficient way. This undoubtedly has given us a better chance at regaining the outdoor Inter-Services title.”"
        }
    ]
}