{
    "url": "https://defrafarming.blog.gov.uk/2024/03/25/horticultural-farmers-and-growers-in-england-apply-for-an-fetf-grant-today/",
    "title": "Horticultural farmers and growers in England – apply for an FETF grant today",
    "authors": [
        "Ben Keene"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2024-03-25T15:28:00+00:00",
    "content": [
        {
            "text": "With the deadline fast approaching, I want to encourage horticulture growers and farmers in England – and contractors to them – to consider applying for a grant offered through the Farming Equipment and Technology Fund 2024 (FETF). "
        },
        {
            "text": "The FETF provides grants that go towards the cost of equipment and technology that support improvements in productivity, slurry management and animal health and welfare. "
        },
        {
            "text": "Successful applicants will receive a grant of:  "
        },
        {
            "text": "In this post, I'll set out the items that horticulture farmers and growers can apply for and the steps to apply."
        },
        {
            "text": "There are many items relevant to horticulture available for a FETF grant. The list of equipment aimed at horticulture can be found on GOV.UK. It includes:"
        },
        {
            "text": "We’ve listed the items into categories so they're easier to navigate. They are:"
        },
        {
            "text": "There will soon be an opportunity to let us know about items of equipment you would like to see on the list for future rounds. We'll blog with further details.  "
        },
        {
            "heading": 2,
            "text": "Steps to apply "
        },
        {
            "text": "You’ll receive an acknowledgement email within 24 hours of applying – you may need to check your junk folder for emails about your application.    "
        },
        {
            "text": "The RPA will allocate funding once all the applications have been received and scored. You may not receive any, or all of the funding you apply for.  "
        },
        {
            "text": "If your application is successful, the RPA will send you a Grant Funding Agreement (GFA). GFAs for each grant will be sent separately. If your application is unsuccessful, the RPA will write to you to tell you why. "
        },
        {
            "text": "Use the Farming Investment Fund service to accept your GFA by the deadline which will be in the email. You’ll need to select each grant to accept each GFA.   "
        },
        {
            "text": "We've set out the steps you’ll need to follow to claim your FETF 2024 grant payment on GOV.UK.   "
        },
        {
            "heading": 2,
            "text": "Learn more  "
        },
        {
            "text": "Our team hosted a webinar on the FETF grants on 12 March 2024. "
        },
        {
            "text": "Watch the recording of the webinar. "
        },
        {
            "text": "We recently blogged about the Sustainable Farming Incentive offer for horticultural growers and farmers in England.  "
        },
        {
            "text": "If you have questions about your application or item specifications, email FETFEnquiries@rpa.gov.uk or call the Rural Payments Agency (RPA) helpline on 03000 200 301 and select the option for the Farming Equipment and Technology Fund."
        }
    ]
}