{
    "url": "https://educationhub.blog.gov.uk/2024/03/how-ensuring-boys-girls-have-same-opportunities-school-sport/",
    "title": "How we are ensuring boys and girls have the same opportunities for school sport",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2024-03-25T10:30:26+00:00",
    "content": [
        {
            "text": "Being active can have a hugely positive impact on children’s physical and mental health."
        },
        {
            "text": "Announced on International Women’s Day last year, our plans also make it clear that girls and boys should be able access the same sports."
        },
        {
            "text": "We have also published new Physical Education (PE) guidance to help schools provide equal access to sport for their pupils, regardless of their background or whether they are a boy or a girl."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "How will the school sport announcement help girls play more sport?"
        },
        {
            "text": "Building on our commitments made to the Lionesses following their historic Euros 2022 victory, schools will now be expected to offer all sports equally to girls and boys. "
        },
        {
            "text": "Since September 2023, schools that successfully deliver equal sporting opportunities for girls and boys can be rewarded through the updated School Games Mark, to recognise their commitment to the development of sports competition across their school and in the community. "
        },
        {
            "text": "Selected schools around England have been able to keep their sport facilities open for activities outside school hours through government funding. This is especially benefitting girls, disadvantaged children and those with special educational needs. "
        },
        {
            "heading": 3,
            "text": "How are you increasing participation in sport in general?"
        },
        {
            "text": "Schools are asked to offer a minimum of two hours curriculum PE time. "
        },
        {
            "text": "We have provided support to schools on how to do this through the school sport and activity action plan, alongside new non-statutory guidance which showcases how schools across the country are providing excellent PE provision. "
        },
        {
            "text": "Ofsted also published a report into PE, which set out what high quality PE looks like, including equal access to sports. "
        },
        {
            "heading": 3,
            "text": "What is the PE and sport premium? "
        },
        {
            "text": "We announced a total of over £600 million in funding across academic years 2023/24 and 2024/25 for the PE and Sport Premium. "
        },
        {
            "text": "Designed to help children get an active start in life, the PE and Sport Premium gives more children access to high quality PE lessons and sporting opportunities. "
        },
        {
            "text": "Headteachers can choose how best to spend the money in line with the PE and sport premium guidance and grant conditions. For example, funds could be used for teacher training, offering more opportunities for pupils to take part in competition, and expanding the range of sports on offer. "
        }
    ]
}