{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/03/25/promoting-the-vote-is-social-work-in-action/",
    "title": "Promoting the vote is social work in action",
    "authors": [
        "Elaine James"
    ],
    "categories": [
        "Care and support",
        "Guidance",
        "Knowledge and skills",
        "Society"
    ],
    "pub_date": "2024-03-25T16:42:16+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Voting rights are human rights"
        },
        {
            "text": "Barring exceptional and unexpected events, there will be a parliamentary election in the UK this year. In the BASW Annual Survey of Social Workers and Social Work, 68% of social workers felt they had a role to play in promoting voting, but only 19% had supported someone to do so."
        },
        {
            "text": "To support our colleagues to promote people’s right to register and vote in elections, BASW, Learning Disability England, the National Principal Social Worker Network for Adults and Bradford Council, supported by the My Vote, My Voice campaign, have launched a Practice Guide to Promote the Vote."
        },
        {
            "text": "Supporting people to participate in democratic and political life runs through all domains of the Professional Capability Framework."
        },
        {
            "heading": 2,
            "text": "Framework for the freedom to vote"
        },
        {
            "text": "Professional accountability recognises the global nature of social work and the contribution social workers make towards promoting active citizenship and involvement in political and democratic life."
        },
        {
            "text": "Values and ethics place people’s rights to autonomy and self-determination at the heart of social work practice. If social workers support people to vote, arguably the biggest decision a person can make, every other decision they make is smaller. What time I get up, what I have for breakfast, where I go during the day, who I love to spend my day with, what time I go to bed, these are all smaller decisions than who gets to run the country!"
        },
        {
            "text": "Diversity and equality: evidence shows those from the most marginalised groups in the UK, including young people, those of Black, Asian or Minority ethnicity and disabled people, are least likely to register or turn out and vote. Social workers’ commitment to inclusivity must not be limited."
        },
        {
            "text": "Rights, justice and freedoms: in a 2011 paper, the Office of the United Nations High Commissioner for Human Rights made the case that voting rights were arguably the most important aspect of participation in democratic and political life. If social work is defined by a commitment to human rights, voting is the cornerstone of those rights."
        },
        {
            "heading": 2,
            "text": "Mitigating inequality"
        },
        {
            "text": "Knowledge: the international literature on voting describes how negative attitudes towards voting from support staff and lack knowledge about reasonable adjustments are the main barriers which disabled people face when wanting to participate in elections and vote."
        },
        {
            "text": "This compares with the increased likelihood that people vote when provided with access to education, easier to read information about voting and encouragement from others to do so. Social workers are uniquely positioned within integrated health and social care settings to share our knowledge and understand about what works to remove barriers to voting."
        },
        {
            "text": "Critical reflection and analysis: oppression is structural. People with social care needs are disproportionately excluded from voting. Social workers are educated in tackling root causes of oppression."
        },
        {
            "text": "Social workers are skilled to sensitively intervene and work in partnership with social care staff, carers and family members, to make sure no one is unlawfully excluded on grounds of mental capacity from being able to register and cast their vote in person if they choose to do so."
        },
        {
            "text": "Social work operates within political domains: understanding the context within which organisations work is fundamental. Developing your democratic skills, influencing through being involved in user led campaigns, such as promote the vote, provides social workers with the opportunity to collaborate with others in solidarity."
        },
        {
            "text": "Professional leadership: this includes developing your professional curiosity, embracing and promoting involvement in research and evaluation."
        },
        {
            "heading": 2,
            "text": "Local action, national enfranchisement"
        },
        {
            "text": "This is the approach we have taken in our local authority, Bradford. Since 2017, we have worked in support of local user led organisations, in particular Bradford People First and the School of Rock and Media."
        },
        {
            "text": "This includes:"
        },
        {
            "text": "We hope, having read this blog, you'll want to find out more about promoting the vote in your area. Our Practice Guide is a helpful place to start."
        }
    ]
}