{
    "url": "https://defrafarming.blog.gov.uk/2024/03/25/why-were-putting-area-limits-on-some-sfi-actions/",
    "title": "Why we’re putting area limits on some SFI actions",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-03-25T15:57:14+00:00",
    "content": [
        {
            "text": "Whether you’re designing a new product or policy, testing and gradual rollouts allow teams to gather feedback, grow in understanding and make improvements in a controlled way."
        },
        {
            "text": "From the beginning — and for all our schemes — this has been our approach."
        },
        {
            "text": "We designed SFI with farmers, for farmers. One of the most important things that they asked for was flexibility around how to achieve the aims of the actions. They also wanted the administration to be as simple as possible. For that reason, we didn’t place limits on any actions. Rather, we wanted to see how farmers responded to the offer and evolve it as needed."
        },
        {
            "text": "Since we opened the Sustainable Farming Incentive (SFI) for applications, we’ve continued to refine the scheme, informed by what farmers and other experts tell us, what the Rural Payments Agency (RPA) reports and what we observe through monitoring."
        },
        {
            "text": "This has led to a number of improvements: "
        },
        {
            "text": "All these things and many more besides, were shaped by feedback. We welcome it, we’re grateful for it and we hope new SFI agreement holders joining the 15,000 who’ve already applied will experience the benefits of those improvements.  "
        },
        {
            "heading": 2,
            "text": "Monitoring the amount of land taken out of food production"
        },
        {
            "text": "One of the things that we've been monitoring is the impact of the 9 actions in the current SFI offer which take land out of food production. "
        },
        {
            "text": "Through SFI, our aim is to support farming and farmers. We want to protect and improve the environment, food production and food security. We obviously don’t want SFI to be used in a way that comes at a cost to any of them. "
        },
        {
            "text": "We know that sometimes sparing land for a year, or 2 or 3 can make food production more resilient and can support farmers to achieve better margins from their land. Some of our SFI actions do take land out of food production for a short time, which helps farmers do this."
        },
        {
            "text": "The evidence shows that a small number of farmers, roughly 1% of those who applied for SFI in 2023, entered 80% or more of their farm into actions that involve taking land out of food production. "
        },
        {
            "text": "While flexibility and freedom of choice are important features of SFI, we think this goes further than is necessary. And, in the context of economic volatility and challenging weather conditions, there is a risk that this could become more of an issue."
        },
        {
            "heading": 2,
            "text": "Limiting actions"
        },
        {
            "text": "For that reason, we’re putting an area limit on 6 of the 9 actions. The reason for limiting these 6 is that these actions were designed to be carried out on parts of the farm and smaller areas within land parcels. They are less effective if they are carried out on larger areas or whole parcels and the impact on food production is greater. "
        },
        {
            "text": "We discounted 2 of  the 9 because they’re very clearly actions designed to be carried out on strips. We decided to remove one of the remaining actions, NUM3 (legume fallow) from the actions we’re limiting as it can play an important part in an arable rotation. It builds soil fertility for the next arable crop and allows farmers to control things like black grass in a way that doesn't involve chemicals."
        },
        {
            "text": "The 6 limited area actions are:"
        },
        {
            "text": "From midnight tonight we’re not going to accept applications where the amount of land in total that is entered into any combination of those 6 actions is above 25% of a farm’s total land. "
        },
        {
            "text": "The aim is to ensure that we get the balance right in the percentage of a farm that we will fund to take these actions."
        },
        {
            "text": "We’ve decided that 25% is the right level to cap these 6 actions to achieve this. Taking more land than that out of production on any given holding is unlikely to benefit the environment or food production."
        },
        {
            "text": "We were particularly keen to act on this before the traditional point at which farm tenancies are reviewed in September."
        },
        {
            "text": "The new approach does not apply to: "
        },
        {
            "text": "In addition, we want to emphasise that we would expect no more than 25% of a land parcel to be entered into IGL1, AHL3 and IPM2.  At this level we get the outcomes we need for nature, in a way that complements food production."
        },
        {
            "text": "We need some changes in what farmers grow, including more areas on farms that primarily deliver for nature. These are often the less productive areas, and, as we’ve set out before, these areas can support food production in a variety of ways."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "Information on the limiting of those 6 actions can be found in the SFI scheme guidance on GOV.UK."
        },
        {
            "text": "This summer, 50 new actions will be available through SFI. If limits apply to any of those actions, this will be clearly stated in the guidance. "
        },
        {
            "text": "The other actions currently on offer are not limited and the majority of land in the scheme continues to produce food. Learn more about those actions and apply for SFI today."
        },
        {
            "text": "We will continue to monitor SFI closely and may limit other actions in the future to ensure that we maintain balance between food production and looking after the environment."
        },
        {
            "text": "We’re about to publish another post on the take-up of SFI: who is applying, the actions they’re including in their agreements and the size of areas in the scheme, so look out for that."
        }
    ]
}