{
    "url": "https://insideDIO.blog.gov.uk/2023/04/17/a-helping-hand-for-reptiles-and-amphibians-on-the-defence-estate/",
    "title": "A helping hand for reptiles and amphibians on the Defence estate",
    "authors": [
        "Olly Howells",
        "Rich Sharp"
    ],
    "categories": [
        "Defence Estate",
        "Environment and Ecology",
        "Volunteering"
    ],
    "pub_date": "2023-04-17T12:11:00+00:00",
    "content": [
        {
            "text": "The Defence estate includes some of the UK’s most important wildlife sites and is unrivalled in terms of its size and the diversity of habitats and species it supports."
        },
        {
            "text": "Much of our estate is accessible to the public, and providing people both inside and outside military communities with access to green spaces, nature and in some cases entire wild landscapes has been part of MOD policy for several decades where access can be undertaken safely."
        },
        {
            "heading": 2,
            "text": "Connecting with nature"
        },
        {
            "text": "The benefits to individuals of engaging with nature are increasingly well understood. A 2021 report by the UK Mental Health Foundation stated:"
        },
        {
            "text": "‘Nature can generate a multitude of positive emotions, such as calmness, joy, creativity and can facilitate concentration. Nature connectedness is also associated with lower levels of poor mental health’ - How connecting with nature benefits our mental health (Mental Health Foundation, 2021)"
        },
        {
            "text": "There are many ways people can connect with nature but one of the most rewarding is by joining local volunteer groups to undertake activities that support and promote nature."
        },
        {
            "text": "The DIO Technical Services team has recently been working with one of these groups to facilitate access to a particularly interesting but little-known part of the Defence estate to do exactly that."
        },
        {
            "heading": 2,
            "text": "Volunteering at West Moors Fuel Depot"
        },
        {
            "text": "For many years DIO has worked in partnership with the charity Amphibian and Reptile Conservation (ARC) to help conserve herptiles (reptiles and amphibians) and their habitats at sites in Surrey, Dorset, and Cumbria but a new initiative has seen ARC volunteers bringing some much-needed manpower to help restore lowland heathland at the Defence Equipment and Support West Moors Fuel Depot in Dorset. Rick Sharp, ARC Volunteer Coordinator & Field Officer will pick up the story…"
        },
        {
            "text": "The ARC volunteers hard at work clearing scrub from the site [Crown copyright / MOD 2019]West Moors is a very different military site than the usual drop zone or tank range that ARC has worked on before. In amongst the hard standings used for storing crates of jerry cans and pipelines, emergency water supply tanks and other fuel storage infrastructure are some cracking pieces of heathland, supporting all six native reptiles in what must be one of the most undisturbed heathland sites anywhere in the UK. While the sand lizards might prefer the more industrial bare ground areas, adders like the slightly scrubbier deep heather found over much of the site."
        },
        {
            "heading": 2,
            "text": "Boosting biodiversity a unique military site"
        },
        {
            "text": "ARC has been working with DIO ecologists for the last four years to manage habitats at West Moors and the ARC volunteers have been involved from the very start. All our local volunteers jumped at the chance to visit this local “secret spot” and with mobile phones banned on site, the chance to be incommunicado for the day was much appreciated in this hectic modern world – even if you do have a barrage of calls when you pick up your phone on the way out!"
        },
        {
            "text": "ARC volunteers have worked right across West Moors over the last four years, clearing regenerating gorse, birch, and pine scrub from the heathland to help maintain the open nature of the habitat. Some of our normal practices, such as having a large bonfire to dispose of cut scrub, cannot be done at West Moors because of the fire risk so we had to stack cut material in piles and use a chipper to dispose of it instead."
        },
        {
            "text": "A volunteer tends to a section of overgrown scrub [Crown copyright / MOD 2019]This winter we had a difficult task working on a particularly good area for adders. Adders like a slightly scrubby habitat but like Goldilocks, it must be just right and when clearing scrub, we had to be extra careful to avoid potential hibernation sites. This is the sort of task where you must think like a reptile when thinning out the scrub, keeping an eye on the passage of the sun to get the best possible mix of sun and shade, looking for structural features in the vegetation that can help reptiles in their daily lives. As well as being hard work, it’s been a good test of the knowledge and skills of the ARC volunteers."
        },
        {
            "text": "A good team of well-motivated volunteers is essential for getting the work done, but at the same time, the generally slower pace of the day allows the team to really engage with the task and reflect positively on what they are achieving."
        },
        {
            "text": "Volunteering is one of the best ways to get outdoors and socialise with like-minded people while supporting local wildlife and natural spaces. On top of that, the benefits to both physical and mental health really speak for themselves. While a ready supply of hot drinks and doughnuts might help too, the extra calories always get worked off afterwards!"
        }
    ]
}