{
    "url": "https://civilservice.blog.gov.uk/2023/04/17/charities-and-partners-week-24-28-april-2023/",
    "title": "Charities and Partners week - 24-28 April 2023",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-04-17T08:46:08+00:00",
    "content": [
        {
            "text": "This week celebrates the first Civil Service Charities and Partners Week to raise awareness of the help and support available from the welfare bodies we work closely with. It shows that despite offering different things, each organisation complements each other and works well together for all civil servants. Alex Chisholm talks about what to look out for over the week. "
        },
        {
            "text": "I want to start by thanking every member of the Civil Service for your continued hard work and resilience. Everything we collectively achieve, through a range of challenges, enables us to deliver for the UK public, and to be truly a modern Civil Service."
        },
        {
            "text": "With this in mind, I’d like to remind you that you’re not on your own. One of the many things we can take pride in while working for the Civil Service is the value we attach to looking after ourselves and each other. This week is about reminding ourselves of that."
        },
        {
            "text": "Over the coming days, Monday 24th April to Friday 28th April, we will be hearing from:"
        },
        {
            "text": "They will be sharing the support and tools available to help us - how you can save money on your day to day spending, how to access practical, emotional or financial support, how to benefit from CS facilities, and how you can get involved in volunteering."
        },
        {
            "text": "Remember to ask for help when you need it, be it from the CS Charities and Partners, your departmental EAP service, or other sources of support. Look out for the communications on your departmental intranet this week."
        }
    ]
}