{
    "url": "https://geography.blog.gov.uk/2023/04/17/geography-in-government-awards-2023/",
    "title": "Geography in Government Awards 2023",
    "authors": [
        "niamhjefford"
    ],
    "categories": [
        "Awards",
        "Geography"
    ],
    "pub_date": "2023-04-17T15:02:26+01:00",
    "content": [
        {
            "text": "We are delighted to announce the shortlisted entries for the Geography in Government Awards 2023."
        },
        {
            "text": "Thank you to everyone that submitted a nomination the standard as always was very high, and it was very difficult for the judges to whittle down to the shortlisted below."
        },
        {
            "text": "The winner of each category and the overall winner will be announced at our awards ceremony in May."
        },
        {
            "heading": 2,
            "text": "Operational Delivery"
        },
        {
            "text": "Enabling the UK's first Carbon Storage Licensing Round with GIS. GIS Team, North Sea Transition Authority."
        },
        {
            "text": "The Ongoing Provision of Geospatial Support to Defence Aviation, Ministry of Defence."
        },
        {
            "text": "The National Underground Asset Register. The NUAR OneTeam, Geospatial Commission."
        },
        {
            "heading": 2,
            "text": "Contribution to Policy Development"
        },
        {
            "text": "Getting to the Point: Accelerating EV chargepoint rollout through geospatial data. Geospatial Commission’s Transport Sector Team, Geospatial Commission. "
        },
        {
            "text": "Evidence based decisions at the Forestry Commission. The Evidence and Analysis Team in Forest Services, The Forestry Commission."
        },
        {
            "text": "Socio-Economic Ward Profiles. Economics Unit, Strategy & Intelligence Directorate, Westminster City Council."
        },
        {
            "heading": 2,
            "text": "Excellence in Innovation"
        },
        {
            "text": "A novel approach to measuring numbers of people visiting natural spaces in England using crowdsourced and open datasets. Joint Mobility Squad, Defra, ONS and Natural England."
        },
        {
            "text": "Rivercraft 2. FCRM Flood Digital, Improvements Digital and Skills, Environment Agency. "
        },
        {
            "text": "Defra's Noise Modelling System: a tool for local, regional and national planning to manage noise pollution. Noise and Statutory Nuisance Team, Defra."
        },
        {
            "heading": 2,
            "text": "Emergency and Crisis Response"
        },
        {
            "text": "Foundation GEOINT support to the Ukraine crisis. Defence Geographic Centre, Ministry of Defence."
        },
        {
            "text": "JIGSO Project. JIGSO Project Team, Welsh Government"
        },
        {
            "text": "Automated address validation for COVID-19. The Geospatial Team, Data Science & Geospatial, UKHSA."
        },
        {
            "heading": 2,
            "text": "Excellence in Geo-visualisation"
        },
        {
            "text": "ONS Geography 30 Day Map Challenge. ONS Geography, Office for National Statistics."
        },
        {
            "text": "Census Maps. Digital Content, Office for National Statistics."
        },
        {
            "text": "Cartographic styling for the National Geographic Database (NGD). Geographic Data Visualisation, Ordnance Survey."
        },
        {
            "text": "Botanical Heatmaps and Summarised Botanical value map. Natural England Natural Capital Ecosystem Assessment team, Natural England."
        },
        {
            "heading": 2,
            "text": "Excellence in Local and Regional Sector"
        },
        {
            "text": "Environmental Justice Measure. Environmental Justice Measure Project Team, Westminster City Council."
        },
        {
            "heading": 2,
            "text": "Contribution to Public Sector Geography"
        },
        {
            "text": "Geospatial Virtual Work Experience. Team Geospatial Work Experience, Ordnance Survey."
        },
        {
            "text": "The 'Geography for Data Science and Analysis' module for the Government Data Science Graduate Programme. Module development team, Office for National Statistics, Ordnance Survey and Data Science Campus. "
        },
        {
            "text": "Image Interpretation Training. Defence Geographic Centre, Ministry of Defence."
        },
        {
            "text": " "
        },
        {
            "text": "If you would like to become a member of the Government Geography Profession and are a crown, civil or public servant you can join via our members site."
        }
    ]
}