{
    "url": "https://educationhub.blog.gov.uk/2023/04/17/is-maths-a-level-being-made-compulsory-for-16-to-18-year-olds/",
    "title": "Maths to 18: Is maths A Level being made compulsory for 16 to 18-year-olds?",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Curriculum",
        "numeracy"
    ],
    "pub_date": "2023-04-17T10:59:41+01:00",
    "content": [
        {
            "text": "On Monday 17 April, Prime Minister Rishi Sunak set out the Government’s plans to get young people in England to study maths up to the age of 18."
        },
        {
            "text": "This will give young people better maths knowledge to make sure they’re equipped with the skills they need for the future and to support them in their careers, including those in the creative industries."
        },
        {
            "text": "Here’s why we’re expanding maths study for 16 to 18-year-olds and what it means for you."
        },
        {
            "heading": 3,
            "text": "Will all 16 to 18-year-olds be made to take maths A Level?"
        },
        {
            "text": "No. When we talk about all young people studying maths to 18, this doesn’t mean everyone will have to take maths A Level."
        },
        {
            "text": "Instead, it’s about making sure that all young people, whatever path they take after school, have access to high-quality maths education that is suited to their needs. For example, we’re collaborating with the Institute for Apprenticeships and Technical Education to work out how maths can be incorporated in a way that works for apprentices and employers."
        },
        {
            "heading": 3,
            "text": "Will there be a new maths qualification that pupils will have to take instead?"
        },
        {
            "text": "We’re currently looking into the options available, including the best way to adapt existing qualifications and programmes to make sure young people get the maths skills they need."
        },
        {
            "text": "This research will also look at whether there are any clear gaps which would make a brand-new qualification helpful."
        },
        {
            "text": "We’re developing plans to bring maths into a variety of post-16 routes from T Levels to apprenticeships and beyond. The aim is to make maths a core feature of everyone’s education until the age of 18."
        },
        {
            "heading": 3,
            "text": "What level of maths do pupils currently study?"
        },
        {
            "text": "Maths is already a compulsory part of the curriculum for all pupils in England up to the age of 16."
        },
        {
            "text": "When pupils start secondary school, they are expected to have mastered the basics of the subject, ready to move on to tackling more complex problems as they start to prepare for GCSEs."
        },
        {
            "text": "To make sure young people have the core maths skills they need to succeed in life, pupils need to have a grade 4 or above in their maths GCSE by age 16, or continue to work towards that as part of their post-16 study."
        },
        {
            "heading": 3,
            "text": "Why is there such a focus on maths?"
        },
        {
            "text": "Many other countries – including Australia, Canada, France, Germany, Finland, Japan, Norway and the USA – already make sure that students take some form of maths until they’re 18."
        },
        {
            "text": "So many jobs require a good level of maths. As technology progresses, more jobs will require analytical and data skills than ever before."
        },
        {
            "text": "However, maths is also a crucial skill in countless aspects of daily life, from managing personal finances, to finding the best mortgage deal, to taking measurements when decorating your home."
        },
        {
            "text": "Currently, eight million adults in the UK have maths skills lower than those expected of a nine-year-old. By ensuring all young people study maths until the age of 18, we can support young people to start adulthood with the skills necessary to thrive in both work and home life."
        },
        {
            "heading": 3,
            "text": "Does this mean maths is more important than arts and humanities subjects?"
        },
        {
            "text": "Bringing maths into the education of 16 to 18-year-olds should not come at the expense of other subjects."
        },
        {
            "text": "It’s not just careers in science, technology, engineering and maths (STEM) which need good maths abilities. In fact, maths is an important skill across jobs, including the arts and creative industries."
        },
        {
            "text": "By ensuring all young people study maths, we will strengthen young people’s skillset and prepare them for the modern world of work, helping them thrive in a wide range of careers."
        },
        {
            "heading": 3,
            "text": "What are you doing to put these plans into action?"
        },
        {
            "text": "A new Expert Advisory Group is being organised to provide advice on our plans. We’re also conducting research to better understand how other countries make sure that young people are studying maths until they’re 18."
        },
        {
            "text": "On top of this, we’re committed to increasing maths teaching capacity and quality. This includes developing a new maths National Professional Qualification (NPQ) to support the professional development of maths teachers in primary schools from February 2024."
        },
        {
            "text": "At the same time, we're increasing the support available from Maths Hubs across the country. These are partnerships of schools, colleges and other organisations who work together to provide support for maths teaching in their region."
        },
        {
            "text": "Further details will be set out in due course, based on the findings of the Expert Advisory Group."
        },
        {
            "heading": 3,
            "text": "Will all teachers be required to take the new maths NPQ?"
        },
        {
            "text": "NPQs are voluntary qualifications to support the professional development of teachers and school leaders. As with all NPQs, the new maths NPQ will be optional."
        },
        {
            "text": "Teachers work hard to deliver excellent maths teaching already – this NPQ is being designed to support them further."
        }
    ]
}