{
    "url": "https://defradigital.blog.gov.uk/2023/04/17/what-ive-learned-about-panel-management-in-a-growing-research-team-part-one/",
    "title": "What I’ve learned about panel management in a growing research team – Part One",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Defra digital",
        "Defra service design",
        "User centred design",
        "User research"
    ],
    "pub_date": "2023-04-17T10:11:09+01:00",
    "content": [
        {
            "text": "User research panel manager Jason Stockwell reflects on what happens when a user research project grows suddenly, and quickly, and how this needs to be managed to keep things on track."
        },
        {
            "text": "Back in November, I wrote about why we have research panels in Defra. Since writing that post both the team and the programme have changed significantly. The programme and the panel have gone from being used for six researchers to over 20 researchers. This doesn’t mean the panel is now impractical, but it does mean there are extra considerations for the panel and booking participants from it."
        },
        {
            "text": "Of course, with this change comes a change in the processes associated with managing a panel. What once was a full-service recruitment for all user researchers has had to scale back. With that comes a “luxury” list of what panel management could be, and a series of tasks panel managers must do to do their job."
        },
        {
            "text": "I want to share some of the learnings from this work about growing and managing a panel within a complex programme. These are some of the elements that can change in a growing programme:"
        },
        {
            "heading": 2,
            "text": "Managing the panellists"
        },
        {
            "text": "Let’s talk about the most important thing on the panel, the people. We were in a lucky position where we have 2,500 participants who are (mostly) keen to take part in research and signed up on a panel to do this. There are still considerations we need to take with these panellists before we get them involved in research,"
        },
        {
            "text": "Managing the data"
        },
        {
            "text": "Beyond the people themselves, there’s the data produced by these research sessions and how we deal with the volumes of data needs more thought given the complexity of some major projects."
        },
        {
            "heading": 2,
            "text": "Sometimes people are hard to find, but that’s not your fault"
        },
        {
            "text": "Finding the right people for research opportunities need time. Some participants you might never find, or even if you do find them, they might have had a difficult experience with the department previously so might not want to get involved again."
        },
        {
            "text": "There is only so much we can do when finding some people. The people managing the panel are limited by other research requests coming in. That’s just a reality."
        }
    ]
}