{
    "url": "https://designnotes.blog.gov.uk/2023/08/21/how-the-international-design-in-government-community-is-coming-together-again/",
    "title": "How the International Design in Government community is coming together again",
    "authors": [
        "Kara Kane - Head of Profession for Design, GDS",
        "Martin Jordan – Head of Design and User Research, German government’s Digital Service",
        "Paloma Jain – Senior user researcher, GDS"
    ],
    "categories": [
        "Community",
        "International"
    ],
    "pub_date": "2023-08-21T09:00:48+01:00",
    "content": [
        {
            "text": "The International Design in Government continues to grow and convene — and we’re bigger than ever before. We have over 3,500 members on Slack and regularly have 40 to 50 people joining our calls. The last time we blogged, we talked about wanting to have more regular calls and to return to face-to-face events. We’ve done both! We’re excited to share what we’ve been up to…"
        },
        {
            "heading": 2,
            "text": "Community calls on topics that matter to members"
        },
        {
            "text": "Since our last blog post, we ran 8 community calls on topics the community prioritised. We had calls on end-to-end services, maturing and scaling up design, and designing for life events."
        },
        {
            "text": "Contributions were from Finland, France, Germany, Italy, Israel, Korea, Netherlands, Sweden, Switzerland, the USA, and Wales. We record all of the calls and share them privately with the community. With a global membership, time zones and work priorities mean we cannot find a time that works for everyone. Our recordings help with this. The most recent 8 calls have had over 1,500 collective views – so the recordings have 4 times as many views as the live calls. People value the content, get in touch with presenters to follow up on specific topics, and return to recordings or share them with colleagues when relevant."
        },
        {
            "heading": 2,
            "text": "Re-convening in person at the Creative Bureaucracy Festival "
        },
        {
            "text": "In June 2023, we got together in Berlin for the first time since the beginning of the pandemic and since our last in-person community activities in late 2019. We were thrilled to return to the Creative Bureaucracy Festival, which we first hosted a session at in 2019. This time, we ran an open panel discussion around the topic of the long slog of public service transformation – with participation of Estonia’s Ülly Enn, Italy’s Marco Maria Pedrazzo, and former GDS colleague Laurence Berry."
        },
        {
            "text": "We had a fantastic session with input from the audience. The key takeaways were:\n"
        },
        {
            "text": "We also participated in a satellite event of the festival: Berlin’s local public sector innovation meetup ‘Öffentliches Gestalten’. With many international visitors in the city, the topic was ‘Borderless challenges, exponential opportunity’. We talked about digital transformation, the role of communities of practice and global design patterns. All of the meetup talks are on YouTube."
        },
        {
            "heading": 2,
            "text": "Upcoming community events this autumn"
        },
        {
            "text": "Next up, we will be speaking at the Service Design Network (SDN) Global Conference, which is the biggest service design conference in Europe. Our talk is on the long slog of public service design – and other international government speakers will be there, too."
        },
        {
            "text": "Then later this year, on 29 November, we plan to run a 24-hour remote conference to bring together colleagues from all parts of the globe – not just the Global North, and co-create the most complete overview of the state of government innovation. "
        },
        {
            "text": "The idea is we’ll have 24 sessions – so, at least 24 countries, but not more than 1 contribution per country. We’ll work with regional community leaders to put together the content so we can get the best spread of representation possible. "
        },
        {
            "text": "Register your interest for the 24-hour remote conference."
        },
        {
            "heading": 2,
            "text": "Join the community"
        },
        {
            "text": "If you work in user-centred design in, for or with government anywhere in the world or are a design-minded public servant, we’d love for you to join the community. We have a Slack group, monthly community calls, and remote and face-to-face events to get involved in."
        },
        {
            "text": "Tell us what topics you want to discuss – and also if you want to share some work. "
        }
    ]
}