{
    "url": "https://defradigital.blog.gov.uk/2023/08/21/how-we-built-a-new-water-management-eligibility-checker/",
    "title": "How we built a new water management eligibility checker",
    "authors": [
        "Daniel de Cruz"
    ],
    "categories": [
        "Defra digital",
        "Defra service design",
        "User research"
    ],
    "pub_date": "2023-08-21T07:30:15+01:00",
    "content": [
        {
            "text": "In World Water Week we hear from Daniel de Cruz about his work on a new ‘Farm Transformation Fund’ water management eligibility checker."
        },
        {
            "text": "Hi, I’m Daniel and I’m a DDTS Programme Manager working in the Farming and Countryside Programme."
        },
        {
            "text": "This checker is a new service under the ‘Farm Transformation Fund’ that allows people to check whether they potentially qualify for the grant before they have to go to the time and effort of formally applying. It’s just one of the ways in which the Farming and Countryside Programme is transforming and improving the support available for the agricultural sector – with one-off grants (like this service) or ongoing agreements to incentivise and improve productivity and sustainability in the farming industry."
        },
        {
            "text": "While this was a new initiative, it built on feedback received from customers of previous agricultural grant schemes. There are lots of rules around eligibility and government funding that we cannot easily simplify, so there is always going to be a lot of information needed. The feedback told us that people just wanted a quick way of knowing if they were likely to qualify for the grant – to help them decide on whether to put the effort in to apply."
        },
        {
            "text": "This service is therefore fundamentally about making things easier for customers. It also makes it easier for our internal Grants Admin team who process the applications – as it avoids them having to spend time dealing with lots of applications that don’t qualify."
        },
        {
            "heading": 2,
            "text": "Being clear about the user need"
        },
        {
            "text": "The biggest challenge in the work was developing a good understanding of what users needed, and then marrying that up with how we wanted the grants to operate. We developed an approach and service that worked – both for external customers and internal administrators – and delivered to a tight timescale."
        },
        {
            "text": "We also delivered in a way that would allow key elements of the new service to be re-used for other grant schemes that were expected to be launched subsequently. And there have been several other schemes so far – including ‘Productivity’, ‘Slurry Storage’ and ‘Calf Housing’."
        },
        {
            "heading": 2,
            "text": "Never ignore the internal perspective"
        },
        {
            "text": "In addition, we had the challenge of connecting the new service with an existing internal database and the working processes that have built up around it. The new service has saved time in the internal team by presenting the data that is provided by users through the checker in a format that is much easier for them to re-use."
        },
        {
            "heading": 2,
            "text": "Responding positively to feedback"
        },
        {
            "text": "Things don’t always go smoothly, and this was no exception. We conducted an external assessment which identified key difficulties and where we could improve our approach. We took on the feedback received and made sure they we fully addressed."
        },
        {
            "heading": 2,
            "text": "Knowing we’ve made a difference means a lot to everyone involved"
        },
        {
            "text": "Overall, the collaboration between the different partners: our digital delivery team, the Farming & Countryside Programme, and Rural Payments Agency (RPA) colleagues, as well as an external delivery partner, was genuine and very productive, and a real pleasure to be part of."
        },
        {
            "text": "We could all recognise the clear link from this work to the support and benefit for real people and businesses – who are producing food and delivering environmental improvements “on the ground”."
        },
        {
            "text": "For me, though, the best thing was getting the new service launched to timescale and delivering real improvements to real users (both external customers and the internal admin team). Reducing our processing time from hours per application to minutes and giving customers more certainty that their application was likely to be accepted, was hugely satisfying."
        },
        {
            "text": "I recently went to speak to a group of farmers on behalf of the Programme, and it was so nice to have a conversation with some people who had recently used our system to apply. The feedback was positive, thankfully, but also highlighted some challenges and areas for further improvement. So still plenty to do!"
        }
    ]
}