{
    "url": "https://ipo.blog.gov.uk/2023/08/21/meet-the-ipo-board-director-of-rights-policy-and-enforcement-chris-mills/",
    "title": "Meet the IPO Board: Director of Rights Policy and Enforcement, Chris Mills",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Enforcement",
        "Innovation",
        "IPO"
    ],
    "pub_date": "2023-08-21T14:58:17+01:00",
    "content": [
        {
            "text": "Next in our ‘Meet the Board’ series we spoke to Chris Mills, the Director of the Rights Policy and Enforcement at the IPO who joined the IPO two years ago.  "
        },
        {
            "heading": 3,
            "text": "Tell us about your early career, Chris"
        },
        {
            "text": "I started off my career working in computing as a techie programmer, systems engineer and technical director. Back at the beginning of the twenty-tens, I decided to take a change of direction with my career and was lucky enough to secure a job in the Civil Service. I've worked in a few different departments - the Foreign Office, Parliament, the Home Office. "
        },
        {
            "text": "When I was at the Home Office, some of my work involved legislation and negotiating treaties with other governments like the U.S. One of the highlights of my career was sitting in the officials' box in the House of Commons just next to the Speaker as the legislation that I'd been working on for the past year with my team was passed. It felt like a really big achievement and was something that not many people get to experience. That was really special. "
        },
        {
            "heading": 3,
            "text": "What brought you to the IPO? "
        },
        {
            "text": "I love doing jobs which involve the law, politics and technology. If I can combine all three of those together, then I'm in my element. That's really what drew me to join the IPO, because my job here combines all of those. The subject matter gives me a closer connection to the public than I have been used to in other departments - it’s great to be able to see the impact of your work.  "
        },
        {
            "heading": 3,
            "text": "What are your IPO highlights so far? "
        },
        {
            "text": "I think the first thing I'd remark upon is the team here at the IPO. Everybody I work with is dedicated, committed, supportive.  "
        },
        {
            "text": "Quite apart from everything that we've all achieved together, the experience of working with these people is just brilliant. This is something that really strikes you from day one at the IPO. "
        },
        {
            "text": "In terms of achievements during my couple of years here, I would definitely call out the work that we've done with the music industry. The team has done a great job getting up to speed on the economics of music streaming. The operation of the value chain was unfamiliar even to many members of the industry, so we had to get into the real detail of how it works. We’ve been fostering new relationships, building trust and ultimately focusing on making a real impact on how that industry is operating - helping it to work more effectively to get remuneration to the people that deserve it. "
        },
        {
            "heading": 3,
            "text": "A new strategy steers the way "
        },
        {
            "text": "I'd also really celebrate getting our Counter-Infringement Strategy published. That was a phenomenally huge piece of work that was already underway when I joined. It has really set a direction for the team, knowing what they need to do on a day to day, week to week, year to year basis. It has also set expectations among our stakeholders - about what they can expect from us and about what we're going to be doing to make their IP rights worth something in practice. "
        },
        {
            "heading": 3,
            "text": "Getting to grips with the REULs "
        },
        {
            "text": "The IP legal framework is really complex and there's the real potential for unexpected consequences from any changes. With the Retained EU Law (REUL) Bill we really needed to get ahead of the game. That meant understanding its implications, working out what should happen to the IP framework and engaging with stakeholders to give them the confidence that the right decisions would be made in a timely manner.  "
        },
        {
            "text": "And what was the impact of that work? We know from our feedback that people are really pleased with the way that we've responded, and they’ve welcomed the commitments that ministers have made to maintaining stability in the IP system so that it continues to operate effectively. The team has done a great job both in terms of the technical analysis but also working with our partners and our stakeholders to maintain that confidence throughout. "
        },
        {
            "heading": 3,
            "text": "Top outcome for the CPTPP trade deal"
        },
        {
            "text": "It took a long time, but we got a really good outcome in our negotiations on the Comprehensive and Progressive Agreement for Trans-Pacific Partnership Agreement (CPTPP) trade deal."
        },
        {
            "text": "In particular, I'm really proud of the patents team who worked so hard to secure a good outcome for the UK, making sure that the UK's interests were protected while not standing in the way of the deal being concluded and achieving that win for the UK economy. "
        },
        {
            "heading": 3,
            "text": "What are your priorities for the future? "
        },
        {
            "text": "Everybody's talking about it, so I can't possibly ignore it - artificial intelligence. It has the potential to reshape what intellectual property is and means in society. It's going to be a real challenge for us to keep up, both in terms of policy-making here in the UK, but also collaborating with international partners to make a framework that applies across the world, because IP transcends individual jurisdictions. "
        },
        {
            "heading": 3,
            "text": "Evaluation – evidence and impacts "
        },
        {
            "text": "I’m passionate about making sure that we evaluate our work more effectively, more thoroughly and really embed that into our practice - the IPO has a really strong commitment to evidence. "
        },
        {
            "text": "We’re pioneering that through our Counter-Infringement Strategy, where we have embedded evaluation from the beginning. We’ll be putting in place an evaluation framework over the next year or so. I'll be really pleased to see the outcome - see the way it changes the way we approach our work as well as being able to tell us how well we're doing in terms of implementing our strategy. "
        },
        {
            "heading": 3,
            "text": "Implementing the Strategy "
        },
        {
            "text": "Of course, our Counter-Infringement Strategy is still quite new. We're in the first phase of implementing. We've got lots to do, but we have already invested in placing staff in partner agencies, upgrading the IP Crime Group and getting it on a fresh, firm footing. We’ve been working with the City of London Police and on building our National Centre of Excellence in Intelligence, which is really going to be the core of our offering to partners.  "
        },
        {
            "heading": 3,
            "text": "On conversations overseas   "
        },
        {
            "text": "Looking overseas, in the next year or two, there are going to be lots of international discussions on genetic resources, traditional knowledge and traditional cultural expression in the context of intellectual property. I think these have the potential to really define and shape how we think of IP in our society as well as our economy. I'm really looking forward to our teams taking part in those discussions and shaping the UK’s approach to negotiations. "
        },
        {
            "heading": 3,
            "text": "Making life better for designers "
        },
        {
            "text": "We're really excited that we are able to resume our work on the designs review. The team is gearing up for consultations next year and engaging with members across the design community. We’re looking at how we can overhaul the legal framework and make it work better for designers who want to secure and defend their rights. We know this is long overdue and we've got lots of ideas about how we can improve the system. We're really looking forward to working with all of our partners to put that into practice. "
        },
        {
            "heading": 3,
            "text": "The vision for IP in the future "
        },
        {
            "text": "Finally, thinking about the legal framework, I want to focus on vision and impact, thinking about how we can evolve IP policy for the continued benefit of the UK economy and wider society.  "
        },
        {
            "text": "We've already achieved so much and made massive strides forward and I'm really excited to see the continued progress we'll make over the coming years and months. "
        },
        {
            "text": "Lastly, I want to focus on how we go about our policy-making here at the IPO, making sure that we are focused on our vision for the system and the benefit that it can bring for the UK economy and for society more broadly. "
        },
        {
            "text": "As policymakers, we should always be thinking about what we can do to have the greatest impact for the greatest benefit. "
        }
    ]
}