{
    "url": "https://marinescience.blog.gov.uk/2025/01/29/building-capacity-for-sustainable-fisheries-ocpps-training-mission-in-madagascar/",
    "title": "Building Capacity for Sustainable Fisheries: OCPP’s Training Mission in Madagascar",
    "authors": [
        "angharadelliman"
    ],
    "categories": [
        "Aquaculture",
        "biodiversity",
        "Education",
        "International",
        "OCPP",
        "Uncategorized"
    ],
    "pub_date": "2025-01-29T15:27:05+00:00",
    "content": [
        {
            "text": "Author: Amy Anderson (MMO)"
        },
        {
            "text": "In October, the Marine Management Organisation (MMO)’s Global Marine Team undertook a deployment to Madagascar under the Ocean Country Partnership Programme (OCPP). "
        },
        {
            "text": "The Ocean Country Partnership Programme is a bilateral technical assistance and capacity building programme that provides tailored support to countries to manage the marine environment more sustainably, including by strengthening marine science expertise, developing science-based policy and management tools and creating educational resources for coastal communities. The OCPP delivers work under three thematic areas: biodiversity, marine pollution, and sustainable seafood. Funding is provided through the Official Development Assistance (ODA) overarching Blue Planet Fund (BPF) by the UK Department for the Environment, Food and Rural Affairs (Defra) and delivered collaboratively by the Centre of Environment, Fisheries and Aquaculture Science (Cefas), Marine Management Organisation (MMO) and Joint Nature Conservation Committee (JNCC)."
        },
        {
            "text": "The focus of the programme is to provide technical expertise and build capacity in each of three thematic areas, with the specific purpose of this trip being capacity building for those involved in detecting and tackling Illegal, Unreported and Unregulated (IUU) fishing, through the promotion of monitoring, control, surveillance and enforcement techniques, along with more sustainable fishing practices."
        },
        {
            "text": "The training began in Madagascar’s capital, Antananarivo, which, at over 1000m above sea level, provided some gentle acclimatisation for the three UK-based MMO officers. The two-day course in ‘Tana’ was targeted at the analysts employed by the Centre de Surveillance des Pêches (CSP; Fisheries Surveillance Centre), with an introduction provided to the digital tools that can be utilised to detect the presence of fishing vessels within Malagasy waters. This included demonstrations which highlighted the benefits of using satellite data to identify high risk vessels, over the expensive and time-consuming alternative of deploying a patrol vessel, as well as an overview of the range of data sources that enable remote investigations to be carried out into a fishing vessel’s legitimacy and activities, without the need to board or inspect it. Such techniques enable the more than 1.1million square kilometres of Madagascar’s Exclusive Economic Zone (EEZ) to be more effectively managed."
        },
        {
            "text": "The attendees of the training in Antananarivo with representatives of the British Embassy (Left), Training materials kindly provided by Trygg Mat Tracking (TMT) (Right)"
        },
        {
            "text": "The MMO team then headed to the coastal city of Mahajanga, in the north-west of the country, where Madagascar’s largest fleet of shrimp trawlers operate. Fishery inspectors travelled from their base locations around Madagascar’s 6000km coastline to take part in the four day course, which comprised of classroom-based and practical training sessions, beginning with the theoretical principles upon which fisheries management measures are based, provided guidance on safe boarding practices and transmitting distress messages should an emergency situation at sea arise, then demonstrated the practical skills required to carry out an effective inspection of a fishing vessel at sea or in port."
        },
        {
            "text": "Classroom training was delivered in a traditional style build"
        },
        {
            "text": "Feedback indicated a highlight of the training to have been the practical exercises which took place onboard fishing vessels, with this also being a fantastic experience for the MMO trainers; getting to see first-hand the challenges faced by Malagasy fishery inspectors enabled the rapid development of bespoke training material for the remainder of the course that would prove relevant and useful to CSP."
        },
        {
            "text": "At sunrise on a Friday morning, the MMO officers joined the CSP team in Mahajanga port to board fisheries protection vessel Atsantsa (meaning ‘Shark’ in Malagasy). A combination of vessel monitoring sources were used to identify a suitable target for inspection, which was fishing in an area around a three-hour steam from the port. The transit time was put to good use, with the MMO and CSP teams discussing and exchanging fishing gear measuring methods and trialling the use of equipment to determine the most suitable techniques for the environment."
        },
        {
            "text": "Fisheries Patrol Vessel Atsantsa in the morning light (Left), Inspectors trial the use of different net measuring equipment (Right)"
        },
        {
            "text": "Boarding of the target vessel was undertaken through the launching of Atsanta’s two inflatable boats, with the trainee inspectors, MMO team and their interpreters transported across the slight swell of the Indian Ocean to a Malagasy-flagged shrimp trawler. Once safely onboard, the team separated into three groups which allowed an efficient and thorough inspection of the vessel’s documentation, catch and fishing gear."
        },
        {
            "text": "Antsantsa's Rigid Hulled Inflatable Boats (RHIBs) are launched for transit to the fishing vessel."
        },
        {
            "text": "A debrief back onboard Atsantsa generated helpful discussions on safety at sea, particularly on the provision of a safe means of access to fishing vessels by inspectors, with the MMO describing the requirements and sanctions for failing to do so in UK waters."
        },
        {
            "text": "MMO fishery officers board a Malagasy shrimp trawler (Left and Right)"
        },
        {
            "text": "The training was considered by all to be a success, having resulted in the sharing of best practice as well as the opening of an ongoing dialogue between the UK and Madagascar on compliance and enforcement measures in relation to managing sustainable fisheries. "
        },
        {
            "text": "MMO officer Sarah Whitelaw said, “the engagement from CSP with the programme has been essential to the success of this training delivery. It has been a pleasure to share our experience and very rewarding to support the excellent work already ongoing in Madagascar on fisheries enforcement; bringing together inspectors from across this unique country with its incredible biodiversity to take back their skills to their own regions and promote sustainable fishing methods nationwide. We look forward to rolling out the next phase of the training in the new year”."
        },
        {
            "text": "The opportunity to exchange knowledge and experience onboard Atsantsa was valued by all."
        },
        {
            "text": "Thank you to everyone involved."
        }
    ]
}