{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/01/29/competition-that-drives-growth-and-investment-reflections-on-joining-the-cma/",
    "title": "Competition that drives growth and investment - reflections on joining the CMA",
    "authors": [
        "Doug Gurr"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2025-01-29T09:38:42+00:00",
    "content": [
        {
            "text": "The government has set out economic growth as its top priority and has done so for good and sound reasons. Without growth, there is no money to support the rebuilding of our vital public services and no prosperity for hardworking people and families. "
        },
        {
            "text": "But what drives growth? And how can a regulator like the Competition and Markets Authority (CMA) play a part?"
        },
        {
            "text": "Well, we know that dynamic, competitive markets drive growth. But another thing we know for sure is that business investment drives growth and that here in the UK we struggle with business investment.  "
        },
        {
            "text": "Last year, the UK again delivered the lowest level of business investment in the G7 and this has been true for far too long. This is where the CMA comes in – because in my experience, there are many factors in any investment decision but a big one is confidence in a stable, coherent and well-informed regulatory environment. "
        },
        {
            "text": "This is our north star: a regulatory environment that encourages the greatest possible level of business investment, subject to respecting the absolute importance of healthy competition and strong consumer protection. We want both domestic and international businesses to see the UK as a great place to invest. This means giving start-ups and venture backers the confidence to launch their businesses here in the UK, not elsewhere in the world. It means encouraging multinationals – with a pretty much free choice to place their investments anywhere in the EMEA time zone – to choose the UK. And it means giving our domestic businesses the encouragement and confidence to get on and invest.  "
        },
        {
            "text": "What does that mean in practice – what is the CMA going to do differently? Well, here are three simple – but powerful – things we want to drive forward.   "
        },
        {
            "text": "First, efficiency."
        },
        {
            "text": "We have to make our investigations and processes as simple and rapid as possible. We know it costs businesses to deal with lengthy and uncertain investigations. Good decisions, clear decisions, rapid decisions – that’s what you tell us you need and that’s on us to deliver. We’re already off to a great start with the ‘4Ps’ framework Sarah announced late last year."
        },
        {
            "text": "Proportionality, predictability, process and pace are all critical areas for us to dig into and I am confident we can make real progress in the near future. "
        },
        {
            "text": "Second, expertise. "
        },
        {
            "text": "The CMA has a wealth of talent and a committed workforce. But we also know businesses can find it frustrating when they feel they have to spend time educating the CMA about their sector dynamics and issues. And, of course, the deeper our understanding, the better the decisions we make will be. So, once again, we’ve listened and we will build mechanisms to ensure we invest in, and can access, world class expertise to enable a rapid, meaningful and grown-up conversation with every sector we investigate. "
        },
        {
            "text": "Finally, engagement. "
        },
        {
            "text": "Ultimately, we serve UK consumers. But our work has a direct impact on businesses across the UK and those looking to grow and invest here. So, it's essential we engage directly and meaningfully with the business community. "
        },
        {
            "text": "Sarah’s and my commitment is an open door, open ears and open minds.  We’re not naïve and we’ll never move away from a belief in the power of competition and consumer protection. But we want to hear what works for you – what’s going to give you the confidence to invest. The CMA's Growth and Investment Council, which met for the first time this week, does just that. The Council was launched at the start of this year and brings together the leaders of 12 major UK business and investor groups."
        },
        {
            "text": "We love the UK. Let’s work together to make it a brilliant place to invest, to drive the productivity, growth and prosperity we all want to see.  "
        },
        {
            "text": "All enquiries from journalists should be directed to the CMA press office by email on press@cma.gov.uk or by phone on 020 3738 6460. "
        }
    ]
}