{
    "url": "https://naturalengland.blog.gov.uk/2025/01/29/natural-england-welcomes-22-1bn-investment-in-water-industry-national-environment-programme/",
    "title": "Natural England welcomes £22.1bn investment in Water Industry National Environment Programme",
    "authors": [
        "Alan Law"
    ],
    "categories": [
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery",
        "Protected sites and species",
        "Site of Special Scientific Interest",
        "Special Protection Area",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-01-29T12:32:31+00:00",
    "content": [
        {
            "text": "The Environment Agency has published the Water Industry National Environment Programme (WINEP), detailing more than 20,000 actions that England’s 19 water companies must complete from now until 2030 to meet their environmental obligations. "
        },
        {
            "text": "Developed with guidance from the Environment Agency and Natural England, these actions represent a £22.1bn investment in England's water environment. "
        },
        {
            "text": "This investment in nature infrastructure is a vital contribution towards restoring the ecosystems we rely on for clean air and water and healthy soils – the basics of life. Nature recovery creates the resilient natural capital needed to grow the economy and for our health and wellbeing. Nature and growth can and should go hand-in-hand. "
        },
        {
            "text": "Natural England plays crucial advisory and regulatory roles in securing this synergy and we welcome the WINEP's £3bn allocation for Nature-based Solutions, a positive step towards nature recovery, climate action and the economic benefits it brings. Future WINEPs must go further and faster to mainstream Nature-based solutions. "
        },
        {
            "text": "The WINEP is a significant opportunity to address key water environment pressures and contribute to the restoration of protected sites, including SACs, SPAs, and SSSIs. We aim to maximize this investment's impact through integrated approaches and collaboration with partners like the Environment Agency, water companies, and Defra. "
        },
        {
            "text": "Through our catchment-focused tools, guidance, and advice, we will work to ensure the WINEP delivers more and better outcomes for nature and people. "
        },
        {
            "text": "We will continue developing infrastructure designs that benefit both water management and nature, drawing inspiration from successful projects like Abberton Reservoir in Essex. This reservoir supports biodiversity, provides green/blue space for communities, and delivers significant societal value. "
        },
        {
            "text": "Another notable WINEP project is the agreement with South West Water in Dartmoor to stop abstraction and remove a weir in Dendles Wood National Nature Reserve and SSSI. This project is expected to benefit woodland plants and lichens, and potentially salmon, with further downstream weir removals. "
        },
        {
            "text": "In Dorset, Natural England has secured 37 improvement schemes and 22 investigations through WINEP. These schemes will enhance various water bodies across designated areas, including SSSIs, SACs, and Ramsar sites, enable new house building and create over 120 hectares of new habitat by protecting raw water resources from agricultural pollution.  "
        }
    ]
}