{
    "url": "https://mhclgdigital.blog.gov.uk/2025/01/29/norfolk-county-councils-experience-with-the-cyber-assessment-framework-for-local-government/",
    "title": "Norfolk County Council’s experience with the Cyber Assessment Framework for local government",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Cyber",
        "Local Digital"
    ],
    "pub_date": "2025-01-29T10:26:26+00:00",
    "content": [
        {
            "text": "In October 2024, the Local Digital team launched the Cyber Assessment Framework (CAF) for local government as a tool for councils to assess and improve their cyber resilience. "
        },
        {
            "text": "Norfolk County Council took part in a recent pilot of the framework with 19 other councils. During the pilot, they completed a self-assessment of their organisation (objectives A&D of the CAF) with minimal direct support, and took part in regular user research and testing to help us refine the service."
        },
        {
            "text": "In this video case study, Norfolk County Council share their experience of the CAF, including how it’s helped them to take a broader view of their cyber resilience across areas that other cyber frameworks may not cover, such as governance and business continuity, and to consider their organisation as a whole. They also share their advice for other councils who may be considering undertaking the CAF for local government. "
        },
        {
            "heading": 2,
            "text": "Learn more about the CAF for local government"
        },
        {
            "text": "We recently published a blog post about how we’re taking a user-centred approach to designing the service, collaborating closely with councils to ensure it meets their needs. "
        },
        {
            "text": "For detailed guidance on the CAF for local government and how to get started, visit the UK Government Security website."
        }
    ]
}