{
    "url": "https://space.blog.gov.uk/2025/01/29/uk-boosts-planetary-defence-capability-with-iawn-membership/",
    "title": "UK boosts planetary defence capability with IAWN membership ",
    "authors": [
        "Edward Baker"
    ],
    "categories": [
        "Astronomy",
        "Delivering Missions and Capabilities",
        "Space surveillance and tracking"
    ],
    "pub_date": "2025-01-29T09:54:48+00:00",
    "content": [
        {
            "text": "Planetary defence is a key part of space sustainability and protection. In this article Edward Baker, Planetary Defence Lead at the National Space Operations Centre (NSpOC), explains its importance and the UK’s role in global efforts to protect Earth."
        },
        {
            "heading": 2,
            "text": "The risk posed by asteroids  "
        },
        {
            "text": "Planetary defence is the catch-all term which refers to activities involving the detection, tracking and threat mitigation from the threat posed by asteroids and comets. "
        },
        {
            "text": "Every day our Earth’s upper atmosphere is pelted by hundreds of small meteors no bigger than a pebble. Except for the streaks of light arcing across our sky as shooting stars, these events go completely unnoticed."
        },
        {
            "text": "The size of these meteoroids ranges from grains of sand to metre-sized boulders, and they pose no threat to populations and infrastructure on Earth as they burn up harmlessly in the atmosphere. Larger asteroids though, while considerably rarer, have the potential to cause considerable damage to infrastructure and injury to people. "
        },
        {
            "text": "On 13 February 2013, an approximately 18-metre size asteroid entered the atmosphere over Chelyabinsk, Russia. The subsequent air burst damaged more than 7,000 buildings and caused 1,491 injuries."
        },
        {
            "text": "Fortunately, there are no known asteroids that are a serious threat to Earth for the foreseeable future. However, there are estimated to be thousands of undiscovered asteroids larger than 100 metres and millions larger than 10 metres. The Chelyabinsk meteor went undetected before it entered the atmosphere. "
        },
        {
            "text": "Only a fraction of the millions of asteroids orbiting the Sun within the main asteroid belt between Mars and Jupiter are of concern. This is due to their size, composition and proximity of their orbit in relation to Earth’s."
        },
        {
            "text": "Asteroids whose orbits intersect with, or come within approximately 45 million km of the Earth’s orbit, are classified as Near-Earth Objects (NEOs). The NEO population as of 2024 is 34,000 and rising. "
        },
        {
            "text": "The smaller and more worrisome subset of NEOs, Potentially Hazardous Asteroids (PHA), number around 2,000. Their orbits are even closer to Earth, within 7,480,000 km and their size exceeds 140 metres. "
        },
        {
            "heading": 2,
            "text": "About the International Asteroid Warning Network (IAWN) "
        },
        {
            "text": "Identifying the remaining undiscovered NEOs and PHAs and preparing for the possibility of an Earth impact event requires multinational cooperation. "
        },
        {
            "text": "Established in 2013 and facilitated by the UN, IAWN brings together national space agencies, scientific institutions, and independent observatories dedicated to the discovery of NEOs and PHAs. Discoveries and follow-up observations which improve the accuracy of predictions are all submitted to the Minor Planet Centre (MPC), funded by NASA, which determines whether a newly discovered asteroid is a threat to Earth. "
        },
        {
            "text": "In the event an asteroid measuring over 10 metres in diameter has a 1% or more chance of impacting the Earth, IAWN is responsible for notifying the UN General Assembly and its members. The UK Space Agency will be the UK Government representative to IAWN. "
        },
        {
            "text": "The decision to join IAWN enhances the UK Space Agency’s mission to protect our home planet and outer space. As a member of IAWN, the Agency can use its global network of optical telescopes, coordinated by the UK National Space Operations Centre (NSpOC), to conduct follow up observations on asteroids identified as a possible Earth impact threat."
        },
        {
            "text": "These observations can play an integral part in understanding the likelihood, location and on-ground impact of the potential impact events. "
        },
        {
            "text": "The UK is also supporting the European Space Agency (ESA) in the development of the ‘FlyEye’ telescopes. These will photograph large swathes of the sky each night, searching for asteroids as small as 30-40 metres across, seeking to provide several weeks of warning for any potential Earth impactors."
        },
        {
            "text": "The UK has been also leading early studies for ESA’s upcoming ‘NEOMIR’ mission. This space-based telescope will be launched into orbit around the first Lagrange point (L1) between the Sun and Earth, and will be capable of observing infrared light. This will enable it to spot the faint heat signatures of asteroids as small as 20 metres, providing a warning of around three weeks for asteroids that we cannot see from the ground.   "
        },
        {
            "heading": 2,
            "text": "The UK capability"
        },
        {
            "text": "In support of the UK Space Agency’s membership of IAWN and commitment to planetary defence activities involving asteroids, NSpOC undertakes daily monitoring of NEO and PHA data from NASA’s Centre for Near-Earth Objects Studies (CNEOS) and ESA’s Near-Earth Object Coordination Centre (NEOCC)."
        },
        {
            "text": "In any given month, NSpOC monitors over 200 NEOs, around a quarter of these are classed as PHA and are a mix of new discoveries and those already identified and catalogued.  "
        },
        {
            "text": "NSpOC is also the lead UK Government point of contact for receiving and distributing data and notifications regarding possible asteroid impact events from IAWN, NASA and ESA."
        },
        {
            "text": "If an event crosses NSpOC’s alert threshold, a warning notification is distributed to the key decision makers within UK Government including the Cabinet Office COBR Unit, Governments of Devolved Administrations and UK Overseas Territories (OTs)."
        },
        {
            "text": "The asteroid warning capability is one of several services led by NSpOC in support of the development and operation of the UK’s space safety and protection capabilities. Other services include in-orbit collision avoidance, uncontrolled re-entry early warning and Severe Space Weather monitoring (SSW) via the Met Office. "
        },
        {
            "heading": 2,
            "text": "The UK Space Agency’s other planetary defence activities "
        },
        {
            "text": "The UK is supporting ESA’s ‘RAMSES’ mission to study the 375-metre wide asteroid Apophis, on its close flyby of Earth in April 2029."
        },
        {
            "text": "During this once in a millennium event, Apophis will pass the Earth at an altitude of no closer than 31,600km, closer than communication satellites in geosynchronous orbit, and will be visible to billions of people on Earth."
        },
        {
            "text": "RAMSES’ will analyse how Apophis changes during the flyby, scientists will learn a lot about the response of an asteroid to external forces, as well as asteroid composition, interior structure, cohesion, mass, density, and porosity."
        },
        {
            "text": "These unique insights are vital when considering how we may deflect any Earth-bound threats in the future, as well as offering new scientific insights into the formation and evolution of the Solar System. "
        },
        {
            "text": "To mark the flyby of Apophis, the UN General Assembly has adopted a resolution, co-sponsored by the UK, designating 2029 the International Year of Asteroid Awareness and Planetary Defence."
        },
        {
            "text": "In the run up to, and throughout, 2029 there will be a worldwide campaign to educate people about Near-Earth Objects (NEOs), the importance of planetary defence, and the collaborative efforts being undertaken to mitigate potential impact events."
        },
        {
            "text": "The UK Space Agency will be contributing to the campaign which includes educational programs, public outreach events, and collaborations with space agencies, academia, and the public. "
        }
    ]
}