{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2021/10/11/multi-domain-integration-demystified/",
    "title": "Multi-Domain Integration: Demystified",
    "authors": [
        "Ranald Dinsdale"
    ],
    "categories": [
        "FAQ",
        "Multi Domain Integration"
    ],
    "pub_date": "2021-10-11T13:26:43+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Strategic Command is currently working to change the way UK defence operates through implementing Multi-Domain Integration. But what does that actually mean? What does Multi-Domain Integration look like in practice? And how are Strategic Command going to make this change happen?"
        },
        {
            "text": "Firstly, what is Multi-Domain Integration, or MDI? In the most simplistic terms, it is about ensuring that every part of defence can work seamlessly together, along with other government departments and the UK’s allies and partners, to deliver a desired outcome and defend our nation."
        },
        {
            "text": "But, if we really want to try to understand Multi-Domain Integration, then a good place to start might be to see what it looks like in practice. Let’s go back to 2015, when the world watched as Russia launched an incursion into Syria in support of the Assad regime."
        },
        {
            "text": "The Russian forces were ruthless, effective and, most importantly for our example, they carried out simultaneous military action across all five of the warfighting domains: maritime, land, air, space, and cyberspace."
        },
        {
            "text": "So, what were they doing?"
        },
        {
            "text": "Concurrently, we saw:"
        },
        {
            "text": "And, although we couldn’t directly observe this, there should be no doubt that Russia were prosecuting intelligence operations from space as well."
        },
        {
            "text": "This combination of activities across all the warfighting domains meant that the Russian campaign in Syria was largely successful. It also provides us with an insight into how effective it can be to combine military capabilities across multiple domains, particularly when they work together in an integrated way."
        },
        {
            "text": "So, is this Russian example of success what we are striving towards when we talk about Multi-Domain Integration?"
        },
        {
            "text": "Yes, but we intend to go much further."
        },
        {
            "text": "Let’s have a look at what a UK multi-domain operation of the future might look like. This is just an example, and a UK response will be targeted and proportional to the nature of the threat."
        },
        {
            "text": "Imagine a scenario where an enemy nation or group has deployed its military to prevent opposing forces from accessing an area. To do this they will have set up an ‘umbrella’ of defensive measures, designed to deny us access and to prevent us from operating. How would we hope to overcome this challenge and penetrate the adversary’s ‘umbrella’?"
        },
        {
            "text": "Simultaneously, we could:"
        },
        {
            "text": "All of the above activity would crucially be connected through space-based communications, and surveillance and intelligence data from all platforms, whether on land, at sea, in the air, in space, or in cyberspace would be collected, analysed and available to decision makers and personnel."
        },
        {
            "text": "The operation would be run with our partners across government, such as the intelligence agencies, who would help us achieve the best picture of what is happening in the region. In addition, the Foreign, Commonwealth and Development Office could impose diplomatic and economic pressures on the adversary or their allies as a way of applying additional pressure."
        },
        {
            "text": "And all this would be part of an allied effort, in close collaboration with our partner nations around the world, motivated behind a common set of values."
        },
        {
            "text": "By combining multiple capabilities, applying simultaneous and targeted pressures on the adversary, and working closely with international allies and partners, this campaign could reveal the adversary’s vulnerabilities, ready to be rapidly exploited for our advantage."
        },
        {
            "text": "But how do we go about achieving this Multi-Domain Integration vision? How do we ensure that future operations are conducted in an integrated way?"
        },
        {
            "text": "There are several important enabling technologies that will help us start this process."
        },
        {
            "text": "Firstly, for Multi-Domain Integration to succeed, we must ensure that our data and digital equipment work seamlessly together and are immediately accessible. That’s why Defence Digital, part of Strategic Command, are developing the Digital Backbone."
        },
        {
            "text": "For years, the UK Armed Forces have been equipped with cutting edge hardware with advanced sensing abilities, capable of gathering valuable reconnaissance and intelligence data. Often, however, these platforms have worked in isolation."
        },
        {
            "text": "We need to ensure that all the data we collect from every platform we have, whether it’s a satellite, aircraft, drone, ship, or land-based system, can be brought together to produce the most complete image of what is going on."
        },
        {
            "text": "When achieved, the Digital Backbone will allow both decision makers and the troops to have the most complete and relevant information picture they require, as quickly as possible, and regardless of the hardware used to gather that information."
        },
        {
            "text": "Due to the vast quantities of data collected, Artificial Intelligence will be crucial to assist operators sift this information, and quickly establish the useful facts."
        },
        {
            "text": "Additionally, we need tech to help us plan and train for multi-domain operations. A single synthetic training environment would allow for full virtual mission rehearsal, and incorporate simulators for all the equipment, such as the aircraft, drones and cyber operations, involved. While previously we have had simulators for each piece of equipment individually, joining them together in a unified way is fundamental to preparing for warfighting of the future."
        },
        {
            "text": "So, the Digital Backbone and single synthetic training environments are two important technological enablers of Multi-Domain Integration, however technology alone will not result in MDI being achieved."
        },
        {
            "text": "Integration requires behaviour change."
        },
        {
            "text": "We must integrate by instinct. Whether procuring equipment, training, monitoring intelligence or developing operational plans, an integrated approach must be sought. We are best when we work collaboratively and think beyond the silos in which we have often worked."
        },
        {
            "text": "Integration is about giving us options when prosecuting operations. It is not necessarily about using every capability we have, every time we engage."
        },
        {
            "text": "Instead, it allows us to combine the right capabilities, at the right time, to achieve the desired outcome. That is why we are committed to achieving Multi-Domain Integration."
        },
        {
            "heading": 4,
            "text": "Find out more about the work of Strategic Command by following us on Twitter or LinkedIn, or subscribe to our blog."
        },
        {
            "text": " "
        }
    ]
}