{
    "url": "https://dwpdigital.blog.gov.uk/2021/10/11/our-pledge-to-redress-the-gender-balance/",
    "title": "Our pledge to redress the gender balance",
    "authors": [
        "Rowena Maccallum - Gender Lead, DWP Digital"
    ],
    "categories": [
        "Diversity",
        "DWP Digital"
    ],
    "pub_date": "2021-10-11T10:08:33+01:00",
    "content": [
        {
            "text": "As Gender Lead for DWP, and particularly because my role is aligned in DWP Digital, I’m delighted that we’ve signed up to the Tech Talent Charter (TTC) for the third year running."
        },
        {
            "text": "The goal of the charter is for the UK tech sector to become a diverse and inclusive community where people from all backgrounds are welcomed, listened to and valued for their contributions. This mirrors our aim in DWP Digital to be as diverse as the customers we represent."
        },
        {
            "text": "Although, the number of women holding digital roles in DWP Digital has increased, there’s still lots of work to be done to attract women to technical and leadership roles as we continue delivering our department-wide commitment to gender parity."
        },
        {
            "text": "Making a pledge of inclusion through initiatives like the Tech Charter is definitely a positive step forward."
        },
        {
            "heading": 2,
            "text": "Reflecting on the last year"
        },
        {
            "text": "Taking on the DWP Gender Lead role in May 2021, supporting our Chief Digital Information Officer, Simon McKinnon, in his role as Gender Champion for DWP, presented a great opportunity and exciting challenge for me."
        },
        {
            "text": "It’s been a busy time for us, as we aspire to increase female representation in digital roles and achieve a more gender balanced workforce across the department."
        },
        {
            "text": "Some of the initiatives we’ve implemented include:"
        },
        {
            "text": "With so much great activity taking place, it was amazing for our achievements to be recognised by winning the Best Public Sector Employer category at the Women in Tech Employer Awards in December 2020. DWP has also been listed in the Times top 50 Employers for Women for the third year running, which is a fantastic achievement. And over the last five years, representation of women at Senior Civil Servant level has increased from 39% to 50%."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "Our diverse workforce consists of people with various and multiple characteristics and backgrounds, which enable us to create a workplace where people can be part of networks, where they can thrive and feel supported, regardless of their gender."
        },
        {
            "text": "We’re currently refining our gender strategy plan, our priorities, vision and our intersectional approach for the year ahead. We’re looking to use technology, information and feedback from our colleagues to enable us to make informed decisions around our future initiatives accordingly."
        },
        {
            "text": "I’m proud to be involved and contribute to the vital work that looks at everything through an inclusive lens. Working alongside members of our DWP communities and networks such as Women in Digital, our Diversity and Inclusivity Champions and cross-government, it’s great to see the passion and enthusiasm that our colleagues have."
        },
        {
            "heading": 2,
            "text": "Come join us"
        }
    ]
}