{
    "url": "https://insideDIO.blog.gov.uk/2021/10/11/restoring-vital-sand-dune-habitats-at-penhale-training-area-cornwall/",
    "title": "Restoring vital sand dune habitats at Penhale Training Area, Cornwall",
    "authors": [
        "Lt Col (Ret'd) Andy Westcott"
    ],
    "categories": [
        "Conservation",
        "Environment and Ecology"
    ],
    "pub_date": "2021-10-11T16:22:00+00:00",
    "content": [
        {
            "text": "Jon Cripps showing Carolyn Cadman, Cornwall Wildlife Trust CEO, and Tony Juniper, Natural England Chair, some of the rare species found at Penhale Dunes which Dynamic Dunescapes is working to support. [Credit: Emma Brisdion]The UK Defence Training Estate is home to a diverse range of habitats and wildlife species, many of which have been granted protected status. Through our work with industry partners, conservation organisations, and the UK Armed Forces themselves, DIO is committed to sustainably managing land used for military training and balancing military needs with ecological conservation."
        },
        {
            "text": "An excellent example is a project underway this week at Penhale Training Area in Cornwall, which is situated within Penhale Dunes Special Area of Conservation (SAC). In a joint effort between DIO, Cornwall Wildlife Trust and the British Army’s 165 Port and Maritime Regiment, sand dune habitats are being restored to provide a much-needed boost to the area’s wildlife."
        },
        {
            "heading": 2,
            "text": "About Penhale Dunes Special Area of Conservation (SAC)"
        },
        {
            "text": "Penhale’s coastal sand dune system hosts a wealth of native wildlife, from reptiles like the common lizard and adder to delicate orchids, the rare silver-studded blue butterfly, and the silvery leafcutter bee. These ‘dune-specialist’ species thrive in our coastal landscapes when there are plenty of areas of bare sand available for burrowing into or hunting on top of, as well as areas of low grassland in which to hide or to produce flowers."
        },
        {
            "text": "Silver-studded blue butterfly at Penhale Dunes SAC. [Credit: Emma Brisdion]At Penhale Dunes these areas are becoming smaller and further apart due to the loss of natural grazing, climate change and nitrogen increases caused by air pollution. As a result, coastal sand dunes are experiencing significant biodiversity loss."
        },
        {
            "heading": 2,
            "text": "Combining military training with ecological conservation"
        },
        {
            "text": "A significant area of Penhale Dunes SAC is situated within Penhale Training Area, which we maintain in partnership with Cornwall Wildlife Trust, who oversee the environmental aspects of the training area. The current work is being completed as part of a machinery training programme for the 165 Port and Maritime Regiment, in a prime example of the positive role military training can play in conservation efforts on the Defence estate."
        },
        {
            "text": "To ensure work could begin safely, DIO worked with Army colleagues to provide unexploded ordnance clearance on the dunes. This week, personnel from the 165 Port and Maritime Regiment will remove areas of overgrown scrub and expose bare sand on overgrown dunes."
        },
        {
            "text": "In areas of low scrub, plant material will be raked out, and areas of dense mature scrub like blackthorn and hawthorn will be plucked and pulled from the dunes. In a previously damaged area that is now suffering from lower plant biodiversity than the surrounding dunes, diggers will be used to strip away the top layer of turf to expose patches of bare sand. This will create better conditions for sand dune wildlife."
        },
        {
            "text": "Silvery leaf cutter bee photographed at Penhale Dunes in June 2021. [Credit: Sally Luker, Budding Nature]Once 165 Port and Maritime Regiment have completed their work, they will be replaced by an army of volunteers, deployed to the dunes to remove any re-growth and monitor the site as wildlife returns."
        },
        {
            "text": "The work is taking place as part of Dynamic Dunescapes, an ambitious conservation project aiming to restore 7,000 hectares of sand dunes in England and Wales. DIO is excited to be contributing through our partnership with Cornwall Wildlife Trust, which will enable the 165 Port and Maritime Regiment’s training to have a real, positive impact on the ecology of Penhale Training Area."
        }
    ]
}