{
    "url": "https://despatch.blog.gov.uk/2021/10/11/rising-to-the-challenge-learning-to-drive-after-covid-19/",
    "title": "Rising to the Challenge: learning to drive after COVID-19",
    "authors": [
        "Despatch blog"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Feature",
        "Learning to drive"
    ],
    "pub_date": "2021-10-11T09:21:48+01:00",
    "content": [
        {
            "text": "We have all endured so much during the pandemic. We have lost loved ones, we have put our lives on hold, we have changed the way we live for the safety of others."
        },
        {
            "text": "As part of this, routine driving lessons and tests had to be suspended for months. Now that restrictions have eased, we know thousands of learners are still desperate to get on the road to help them access employment, education, healthcare and their social life. It is DVSA’s priority to help everyone through a lifetime of safe driving."
        },
        {
            "text": "In this blog post we hear from a driving instructor, learner driver and driving examiner. We celebrate how they all have risen to, and overcome, the challenges posed by the pandemic - and are helping the country to build back better whilst keeping themselves and other road users safe."
        },
        {
            "heading": 2,
            "text": "“I’m in this job to help people”"
        },
        {
            "text": "Ian Brett is an Approved Driving Instructor (ADI) based in Kent. Like most ADIs, he is self-employed. Ian says that, after 13 years’ experience, the pandemic “totally destroyed our business; we couldn’t earn money at all but still had bills to pay and staff to support. We fared much better than others, and were very lucky to have received government grants.”"
        },
        {
            "text": "Ian briefly helped deliver speed awareness courses online, while they couldn’t take place in person due to Covid restrictions. However, getting back to business has been his main focus."
        },
        {
            "text": "“It was difficult to get back into a sense of normality. The uncertainty was the hardest thing, especially with our pupils investing time and money, not knowing when they were going to get a test."
        },
        {
            "text": "“Now when you get a pass, it’s all the sweeter knowing the hard work has paid off. Sadly a fail means pushing things back even further; we do have to have some hard conversations, managing expectations of pupils and trying to get those who are ready for test in there first."
        },
        {
            "text": "“We are also part of a community of ADIs across Kent; we keep in touch and support each other when we can."
        },
        {
            "text": "A recent survey has shown that there is a huge demand for driving lessons, with 8 out of 10 of driving instructors currently have a waiting list .  “I feel more confident now, as there is more work and our business is sustainable. But even then, I’m in this job to help people. We currently have 140 pupils on our waiting list, and we field anything between 5 and 20 calls a day, enquiring about lessons."
        },
        {
            "text": "“We are also trying to train up more instructors. Generally we have to be honest with people, giving them further advice and encouraging private practice. It’s hard to know that we can’t help all of them, but we do what we can.”"
        },
        {
            "heading": 2,
            "text": "“It felt like I’d started learning all over again”"
        },
        {
            "text": "Meanwhile, 24 year old Bethany Bridel has been learning to drive in Sevenoaks. Her experience is one to which thousands of learner drivers across Britain can relate."
        },
        {
            "text": "She says, “when the pandemic first hit, I was really scared. I work in a pub and it was frightening to close the doors. The village I live in relies on tourism and it just became a ghost town."
        },
        {
            "text": "“Because of the lockdowns, everything seems a bit of a blur but I can remember thinking that no one expected lockdown to last as long as it did. So, driving lessons weren’t at the forefront of my mind. But after the second lockdown, it felt like I’d started learning all over again, and I haven’t been able to do any private practice, either."
        },
        {
            "text": "“It’s been very deflating feeling so ready for something and not being able to do it.”"
        },
        {
            "text": "Not being able to drive has had a big impact on Bethany’s life. “I live in a small village which is quite isolated, and I have to rely on public transport. It makes finding work very difficult."
        },
        {
            "text": "“I’ve passed the theory test now. It was a strange experience with all the Covid measures, suddenly being in a room filled with other people. But I felt safe the whole time; the staff were fantastic. I’ve had the same experience on my driving lessons, with masks and cleaning the car before and after.”"
        },
        {
            "text": "Bethany is definitely getting closer to her dream, though. “I do now have a practical test booked – on my birthday! We booked it months ago so it’s disheartening to know it’s still so far away, with most cancellations being very last minute. Though I was surprised by the huge amount of flexibility when it came to moving a test; that’s reassuring.”"
        },
        {
            "text": "She does say that she feels differently about driving now, compared to before the pandemic, adding “I guess I do have some anxiety about there suddenly being lots of new drivers on the road; but it’s reassuring that we’ll all have gone through a lot of practice.”"
        },
        {
            "text": "We wish Bethany the best of luck for her test. She tells us that when she finally gets the keys to her first car “I’m going to drive straight to the beach… or a drive through! I have also promised my boyfriend a meal out where I drive, and he can have a drink for a change.”"
        },
        {
            "heading": 2,
            "text": "“It feels good to be back doing what I am meant to do”"
        },
        {
            "text": "In the middle of the action is driving examiner, Richard Garner based in Chippenham. Responsible for assessing future road users, and giving them the ability to drive freely, how has his role changed and shifted?"
        },
        {
            "text": "To begin with, he had to shield as a clinically extremely vulnerable person: “When the pandemic first began, I was very concerned. Being vulnerable, I was worried about the effects of catching the virus; thankfully that never happened.”"
        },
        {
            "text": "However Richard has always been keen to get back to the day job: “I was eagerly awaiting a return to in car testing in April, and was incredibly disappointed to be told that I would not be given the choice to return as soon as I’d hoped. Instead I was asked to provide support to the Internal Communications team, working from home. This team have been amazing, and I feel I’ve made some new friends - albeit virtually!"
        },
        {
            "text": "“But I still couldn’t wait to get back into cars. At the end of the day, I’m a driving examiner; I should be out on the road, not behind a laptop. I just wanted to crack on.”"
        },
        {
            "text": "He found ways to step into the fold and support his colleagues, saying “eventually I took on tractor tests for my local area, to free up car slots for colleagues at my centre and others nearby. It was a safe option for me as I wasn’t in the cab with them during the test. It was great to get back doing my job, especially knowing that these kids that I’ve tested were getting ready for harvest, or helping their family’s business."
        },
        {
            "text": "Now, Richard is back in the passenger seat. “I recently did my first day of car driver tests after over nine months. Despite feeling a little apprehensive, everything came rushing back. It feels good to be back doing what I am meant to do; helping keep Britain’s roads safe."
        },
        {
            "text": "“I know that all industries – not just driving - are struggling to catch up, and that everyone is doing all they can to help. Of course, we have to assess candidates on the day but it’s great to see people pass first time, knowing that’s one less person waiting for a test.”"
        },
        {
            "heading": 2,
            "text": "Now is the time to drive forward"
        },
        {
            "text": "Needless to say, our roads are a vital network across the country."
        },
        {
            "text": "From delivering food, to the return of tourism and reuniting loves ones; they connect everyone and are the lifeblood of businesses across Britain."
        },
        {
            "text": "Helping learners to use Britain’s roads safely will inevitably bolster our economy in this difficult time."
        },
        {
            "heading": 2,
            "text": " Tell us how you plan to build back better"
        },
        {
            "text": "Reducing driving test waiting times will contribute to the national recovery effort and DVSA is taking steps to provide thousands of learner drivers with a driving test as quickly and safely as possible."
        },
        {
            "text": "Driving examiners, ADIs and learners will all have a huge role to play in our future."
        },
        {
            "text": "Tell us how you plan to help the country build back better and how the driving industry plays a role in your plans. Tag @DVSA and use #BuildBackBetter on social media – we cannot wait to hear from you."
        }
    ]
}