{
    "url": "https://civilservice.blog.gov.uk/2021/10/11/the-power-of-workplace-adjustments-ruths-story/",
    "title": "The power of workplace adjustments - Ruth's story",
    "authors": [
        "Chris Wilson",
        "Ruth Wylde"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2021-10-11T08:17:07+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Chris Wilson discusses the launch of the Civil Service campaign Workplace Adjustments Change Working Lives and explains how making changes helped one civil servant to continue her career.\n"
        },
        {
            "text": "Even making small adjustments can dramatically improve our lives in the workplace.  As Head of the Civil Service Workplace Adjustment Service, it’s why I am proud to launch the Civil Service internal communication campaign Workplace Adjustments Change Working Lives. \n\nThe campaign supports CS Disability Champion Sarah Healey’s strategic goal  of  “improving the standard and consistency of workplace adjustments across the Civil Service.” It does this by helping raise awareness and understanding of the significant difference that workplace adjustments can make to individuals. As a result, it incrementally helps build an inclusive culture within teams and organisations - which means everyone wins.\n"
        },
        {
            "text": "In the Civil Service, we use the term ‘workplace adjustments’ in communications and HR guidance and products, rather than ‘reasonable adjustments.’  The Civil Service aims to support employees who may have a barrier at work regardless of whether they have a disability or health condition. "
        },
        {
            "heading": 4,
            "text": "Over the next few weeks, you may see campaign activity in your department, including a video, posters, guidance and blog posts which share personal stories from civil servants. They include Cabinet Office civil servant Ruth Wylde, who openly shares her story about the difference workplace adjustments make to her working life.\n\nRuth Wylde, Senior HR Policy & Services Consultant, Civil Service HR"
        },
        {
            "text": "First, let me start by telling you a little bit about myself. I’m 56, and now work part-time, two days a week from home. "
        },
        {
            "text": "I like to think that I’m a bit of an adventurous spirit in life. One of my hobbies has always been riding motorbikes. Big powerful motorbikes - and I ride them like an idiot. Or as we like to say in the biking world - ride it like you’ve stolen it! No, honestly, I do. Hence, I was the idiot trying to prove that you can ride a six cylinder, 1300cc motorbike up one of the sides of Cheddar Gorge on loose shale and grass…."
        },
        {
            "text": "Suffice it to say, it didn’t go quite as planned, and here I am many years later with a spine injury that affects my mobility. I’ve destroyed a spinal disc, twisted two vertebrae, killed a large section of muscle (permanently) and broken a fragment of bone…. And by the time doctors figured all that out, the damage was unfortunately permanent and irreparable. "
        },
        {
            "heading": 4,
            "text": "Fighting constant pain"
        },
        {
            "text": "It’s left me with a walking stick, fighting constant pain, and an inability to walk far, sit too long in the wrong kind of seating, stand for long or lie down for too long. I take enough painkillers daily to fell a rhino, as my pharmacist gleefully tells me when I moan about them making me feel constantly exhausted."
        },
        {
            "text": "My workplace adjustments are all referred to as ‘soft’ adjustments. Apart from a decent quality chair, I don’t need any specialist equipment, though I do need help with attending meetings in offices. "
        },
        {
            "text": "I need step-free access rooms - lifts or escalators are fine. I can manage a chair when I get there, but I have to use my own car for travel. I also hold a Blue Badge rather than relying on using public transport or a hire car, as I can’t manage them, even when the policy dictates that they should be used. I also use my own discretion to book overnight stays away, if the days look prohibitively long once I factor in all the travel requirements."
        },
        {
            "heading": 4,
            "text": "Jumped at the chance"
        },
        {
            "text": "When the Workplace Adjustment Passport was introduced in 2015, I jumped at the chance to have one - what a great idea! All my adjustments listed, signed and agreed and updated each year, with as much detail as I choose to give about how my condition affects me. "
        },
        {
            "text": "It’s been so easy as I’ve changed managers, roles, grades, and even departments over the years since my back effectively told me, ‘You’re an idiot, I quit!’ to use my passport to agree my workplace adjustments.  "
        },
        {
            "text": "With the adjustments in place, I’ve been able to carry on pursuing my chosen roles and career path. It has even helped me articulate my need to apply for partial retirement to help manage my condition. "
        },
        {
            "text": "I’ve worked in the Civil Service for 36 years - and I’ve been fortunate to hugely enjoy my career. I’m very appreciative that my employer(s) understood my changing needs as my condition worsened, and adjusted what they expected of me to enable me to keep working through it all. And I promise - me and my current motorbike (GSX1400) are behaving ourselves. Honest."
        },
        {
            "text": "Huge thanks to Ruth for sharing her story so openly. Ruth’s account is a powerful reminder to us all that life can present challenges, but that doesn’t mean you cannot enjoy a fulfilling and thriving Civil Service career. Far from it!"
        },
        {
            "heading": 4,
            "text": "Further Information"
        },
        {
            "text": "The Workplace Adjustment Passport  is used to record all workplace adjustment requirements agreed between an individual and their line manager. Sharing and discussing the passport with line managers can enable individuals to be provided with tailored support and appropriate workplace adjustments. It also enables a smoother transition between roles, line managers and departments."
        }
    ]
}