{
    "url": "https://ipa.blog.gov.uk/2023/01/10/at-home-i-am-1-at-work-i-am-3500/",
    "title": "At home I am 1, at work I am 3500",
    "authors": [
        "Jo Jolly"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Major Projects",
        "Project Delivery"
    ],
    "pub_date": "2023-01-10T12:14:08+00:00",
    "content": [
        {
            "text": "Dr Jo Jolly, Deputy Director and Head of Project Futures at the Infrastructure and Projects Authority (IPA) discusses the importance of delivering the best outcomes for our environment and economy."
        },
        {
            "text": "Nick Smallwood’s recent blog on the progress being made to implement the ‘Transforming Infrastructure Performance: (TIP) Roadmap to 2030’ policy document, sets out the case for change. Project delivery has faced many challenges in the past, and will certainly face them in the future. Therefore, we must continue to transform project delivery and drive change. "
        },
        {
            "text": "While we have smartphones with access to virtually unlimited information on almost any topic, and sat navs that help us get to our destinations via the most efficient route, the adoption of data and analytics in project delivery needs to be more fast-paced. We need more access to data to improve how we deliver our projects. As capable, innovative, bold, project delivery professionals, this should be our number one priority. "
        },
        {
            "text": "Transforming to data-driven project delivery isn’t easy, and as humans we can become conditioned to believe that a difficult situation is unchangeable or that we are powerless to make a difference. And yet there is so much in our control that we can change when we collaborate as a community. With improved data sharing and problem-solving across projects and programmes we can learn faster together, and better deal with the challenges ahead. "
        },
        {
            "text": "Net zero challenge"
        },
        {
            "text": "With government's commitment to reach net zero greenhouse gas emissions by 2050, it is fundamental that everyone involved in project delivery maximises their contribution to reducing carbon emissions and delivering a cleaner future. "
        },
        {
            "text": "We have the collective ability - and professional and moral responsibility - to make a significant difference through the choices we make. And for those choices to drive us towards successfully delivering not only the outcomes of the project, but also to maximise the contributions to the UN Sustainable Development Goals (17 global goals designed to end poverty and protect the planet). The good news is, that as clients, both in the public and private sector, we can choose to incentivise the right things to deliver the best outcomes we can, for the economy, the environment and society as a whole. "
        },
        {
            "text": "UN Sustainable Development Goals: The Environment Agency's Boston Barrier flood risk management scheme demonstrates the contributions to the UN SDGs, beyond the original stated benefits of the project. [Boston tidal barrier, UK: adapting to climate change and delivering social outcomes]There’s no doubt we all want to do the best we can - government and industry - but sometimes it’s hard to know where to start. However, help and support is at hand. "
        },
        {
            "text": "A simple but powerful example comes from a Project Data Analytics Community hackathon, where we developed an app to record the benefits your project delivers against the UN Sustainable Development Goals. We will be open sourcing this tool for all to use, and in turn help with knowledge-share across the whole project delivery community. "
        },
        {
            "text": "In a recent email, Jonathan Williams, Project Futures Lead at the Environment Agency (EA) wrote to Sir James Bevan, Chief Executive at the Environment Agency, reflecting on “our commitment to the climate emergency”, which I would like to share with you. Jonathan wrote:"
        },
        {
            "text": "Even today, in 2022, I meet other project delivery professionals, including thought leaders across the industry, and I still hear comments like “carbon is being picked up by another workstream” or “I’m only one person in a large system”. "
        },
        {
            "text": "Jonathan went on to share his calculations of how “even one project delivery professional can make a huge difference”. Jonathan worked out his carbon footprint as an individual, as well as the average carbon footprint of the EA construction project, writing:"
        },
        {
            "text": "My carbon footprint is 10.21 tonnes of carbon per year. That’s the size of the opportunity for me as one individual… as a project manager I have a far greater opportunity to make a difference… one project delivery professional at the EA can influence decisions on projects that would have the same impact as 3540 clones of me living independently. It would take me over 44 lifetimes to produce the same amount of carbon as the average EA project. "
        },
        {
            "text": "Jonathan points out that “if every project delivery professional recognised the scale of their opportunity, then we will absolutely succeed in making the world a better place for us all”. He summarised his email by saying:"
        },
        {
            "text": "“At home I might be one individual, but as a project manager, I have an impact of 3500! How incredible is that?!” "
        },
        {
            "text": "Highlighted here is the huge amount of influence we have at work every day. Sir James’ response to Jonathan was equally uplifting, agreeing “we can actually make a far bigger difference than we might at first imagine… difference-making is infectious!”. They are right. To meet the challenges ahead we must collectively do better. We must make better, data-driven, decisions as project delivery professionals, and inspire one another to deliver better, more sustainable, outcomes. "
        },
        {
            "text": "For more information on TIP, click here. "
        }
    ]
}