{
    "url": "https://socialcare.blog.gov.uk/2023/01/10/building-on-leadership-with-the-florence-nightingale-foundation/",
    "title": "Building on leadership with the Florence Nightingale Foundation",
    "authors": [
        "Emily Pimm"
    ],
    "categories": [
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2023-01-10T11:57:00+00:00",
    "content": [
        {
            "heading": 2,
            "text": "An opportunity to develop"
        },
        {
            "text": "My Florence Nightingale Foundation (FNF) journey began last year, with an application to their Leadership Scholarship programme. I had never heard of the Foundation before, but after a discussion with a friend about helping people understand the impact of coronavirus restrictions on care homes during the pandemic, she recommended the scholarship as a way to get my voice heard."
        },
        {
            "text": "I work as a social care deputy manager at a care home run by Bristol-based charity, the St Monica Trust. Coming up to ten years in a management role, I was keen to continue to develop my leadership skills – this felt like an opportunity not to be missed!"
        },
        {
            "text": "Shortlisted for an interview, I was asked to prepare a discussion on a quality improvement project (QIP) that I would complete as part of the Scholarship. I presented my QIP to the FNF panel with a lot of enthusiasm! I was keen to highlight the levels of loneliness and social isolation people living in care homes had been experiencing during periods of lockdown, and the ways I felt certain changes could make a difference."
        },
        {
            "text": "In January this year, I was amazed to receive an email telling me I had been accepted onto the Scholarship! At this point, I had not anticipated what amazing opportunities would be coming my way. We started with a welcome day, where I met some incredible fellow nurses, all with varied experiences and knowledge and all with inspiring ideas on how they would improve practice in their fields of work."
        },
        {
            "text": "I was paired with my mentor, Sharon, because of our shared interest and passion for the rights of people who live and work under the social care umbrella. She has extensive knowledge and experience and is a grounding voice to guide and develop my leadership skills."
        },
        {
            "heading": 2,
            "text": "Positive connections"
        },
        {
            "text": "Sharon also provided me with opportunities to network with like-minded people, who continue to help me develop a greater understanding around the complexities of social care and social care leadership. Through these new connections, I have been able to create different ways to add my voice to those already trying to make a change within the sector."
        },
        {
            "text": "As part of the Scholarship, I have participated in several life-changing leadership programmes. These have not been your standard ‘sit back and take notes on theory’ courses. They have been a mixture of one-to-one coaching, peer-discussion, collaboration and a large amount of learning about myself as a leader."
        },
        {
            "text": "I have felt more courage in my convictions as a result. I mean courage in the sense that I feel my values, and the way I come across as a leader and a strategic thinker, have been positively affirmed, and that I am moving in the right direction."
        },
        {
            "text": "As my leadership journey continues, I am taking with me the skills and insights I have developed so far. I feel I can now find ways to channel my passion for being a voice for people who use the services within social care in a more effective and focused way."
        },
        {
            "text": "Social care nurses are underrepresented within Florence Nightingale Foundation programmes. If you would like to pioneer positive changes for the people you support, if you would like to find way to become a more ‘disruptive leader’ and challenge the norm – then this is the opportunity for you."
        }
    ]
}