{
    "url": "https://dwpdigital.blog.gov.uk/2023/01/10/designing-services-to-help-employers-support-disabled-employees/",
    "title": "Designing services to help employers support disabled employees",
    "authors": [
        "Sarah Bradley"
    ],
    "categories": [
        "Accessibility",
        "Diversity",
        "Enabling Services",
        "Universal Credit"
    ],
    "pub_date": "2023-01-10T15:32:46+00:00",
    "content": [
        {
            "text": "DWP Digital, and our supplier partners Opencast, are developing an online service to help employers better support disabled employees and those with health conditions in the workplace. "
        },
        {
            "text": "An early version of the service has entered public testing which is aimed at smaller businesses many of which do not have in-house HR support. It aims to help them to retain talent and create more inclusive workplaces. "
        },
        {
            "text": "1 in 5 of the working-age population are classed as disabled and overall, disabled people fare much less well in the labour market than their non-disabled counterparts.  Disabled workers move out of work at nearly twice the rate of non-disabled workers.  "
        },
        {
            "text": "We have been working together to understand barriers to retention and inclusion at work.  Employers have told us they want to do the right thing, but sometimes feel they lack time and knowledge. We have been working together with the aim of improving the support available to them. "
        },
        {
            "heading": 2,
            "text": "Gathering user insight "
        },
        {
            "text": "The discovery phase of the project set out to understand users and the workplace context and how employers go about finding information. This included mapping the existing information landscape and understanding problems for users in navigating disparate content produced by different areas of government.  "
        },
        {
            "text": "Based on interviews and workshops with employers and analysis of 180,000 webpages, we found evidence that more tailored information was needed to help employers find out about supporting their employees. The team designed a questionnaire for employers that, depending on their response, would lead to them receiving information and guidance tailored to their circumstances.  "
        },
        {
            "text": "The alpha phase that followed saw work start on a prototype. During alpha the team successfully validated the service concept and user requirements and conducted prototype testing with 20 businesses, to ensure the proposed solution would meet user needs.  "
        },
        {
            "heading": 2,
            "text": "Putting the live service to the test "
        },
        {
            "text": "The service moved from alpha into private beta towards the end of 2021, with Opencast developers, DevOps and QA consultants collaborating closely with the DWP Digital team to build out a working service.  "
        },
        {
            "text": "The private beta phase involved over 80 further research sessions with employers and line managers, as well as engagement with disabled people’s organisations and disability organisations. Over 1500 users tested the service in a restricted private environment to help fine-tune and validate the service.  "
        },
        {
            "text": "The service moved into public beta in Autumn 2022 where it is now being used by real users in a live environment.  "
        },
        {
            "heading": 2,
            "text": "Making an impact"
        },
        {
            "text": "While it is early days, response to the current version of the service has been positive so far, we’re starting to see naturally occurring traffic come in. We’re already getting good feedback from users about how they are going to apply their learnings in the workplace. "
        },
        {
            "text": "On launching the public beta service, the Minister for Disabled People, Health and Work said: “Since 2017 we have seen one million more disabled people in work, beating our target by five years. Now we want to go even further by giving more employers the tools and information they need to ensure disabled people and those with health conditions can succeed in the workplace.” "
        },
        {
            "text": "To find out more about the project listen to our webinar recording from Digital Leaders Innovation Week, and to find out more about DWP Digital visit the careers site."
        }
    ]
}