{
    "url": "https://prisonjobs.blog.gov.uk/2023/01/10/jims-journey-as-a-case-administrator/",
    "title": "Jim's journey as a case administrator",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2023-01-10T12:39:21+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Probation Service can really benefit from welcoming staff with varied life and work experiences. We talk to Jim who, after a long career outside of the Probation Service, joined us as a case administrator. "
        },
        {
            "text": "Tell us a bit about yourself "
        },
        {
            "text": "I work in the Norwich hub for London probation. I did 31 years in the museums and heritage sector and then took a career break and did some travel. When I came back I was really open minded as to what I would do. I took up my new role at the age of 58, so age is no barrier to joining the Probation Service. "
        },
        {
            "text": "Tell us a bit about your current case administrator role "
        },
        {
            "text": "There’s a nice bunch of people in our team and across the whole hub, with supportive colleagues.  "
        },
        {
            "text": "My duties are quite varied. I’ve worked in the safeguarding team and I’ve now switched to enforcement. I do breach letters and upload everything onto the system. "
        },
        {
            "text": "The quality of what we put on the system very much has a direct impact on the quality of things like recalls or future enforcement action. If we get our job right, there’s a bedrock of information that supports the probation officers. "
        },
        {
            "text": "Another daily part of my job until I switched to enforcement was the hub helpdesk. I did about 2 ½  hours a day most days. I’d take incoming calls and that could be anything from the police or solicitors, to a person on probation, or their family members. That makes for a certain level of variety, you never know who is going to be at the other end of the phone. "
        },
        {
            "text": "What attributes do you think are useful when you’re working as a case administrator? "
        },
        {
            "text": "I think you need a sense of humour, you need to have empathy and you have to show respect. I treat everybody the same, whether that’s a person on probation, or a senior probation officer, I treat them all with respect. "
        },
        {
            "text": "I also think you have to be alert to the fact that some aspects of what we’re handling can be quite dark. There are some difficult situations that you’re reading about or uploading information on so I think you have to retain a sense of perspective; take steps to look after your mental health and maintain good contact with colleagues. "
        },
        {
            "text": "I got the chance to sit in on about three or four interviews with the people on probation and that really reinforced my sense of what probation officers have to do. I found the quality of the officers quite remarkable in terms of their empathy, their patience and their focus. So when I do my job properly I’m conscious that I help them do their job properly. "
        },
        {
            "text": "What do you enjoy about the role? "
        },
        {
            "text": "What I like about the role it is that there are opportunities to develop yourself if you wish to take them. There’s definitely scope for progression and colleagues who will help you to develop yourself as well as do whatever your role is.  "
        },
        {
            "text": "Also secure employment - there’s a lot of job security in the role. The pension is extremely good compared to some sectors outside of the probation service. "
        },
        {
            "text": "Ultimately, what we do is important. I don’t want to be melodramatic about it but it’s all worthwhile, it’s all valuable. "
        }
    ]
}